{"id": 396544, "author": "lpmaho", "title": "MLabs - \"The Universal Joint\"", "url": "https://cardano.ideascale.com/a/dtd/396544-48088", "category": 26452, "amount": 25000, "description": "Cardano is growing quickly; however, countless stories go untold by the teams and individuals shaping this community.", "f6_no_assessments": 10, "f6_rating": 3.900000000000001, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is essentially for the addition of high end, blockchain specific video animations to upgrade a Cardano themed news and education show.  Over half of the budget is expected to be directed to these animations, so they are a pretty critical element of the plan.  In addition, there will be some written content to accompany this as well, along with audio-only podcasts, however, as noted, the budget is for those juicy visuals.  This is worth noting because it is something that would separate such a media channel from almost all the other similar projects in Cardano, and would definitely bring the best aspects of visual creation to the ecosystem in a vibrant way.  Building out all the rest of the planned content from these \"hooks\" as the team calls them, puts the visuals front and center which puts the project in good alignment with the challenge setting.  Using artistic rendering to capture new attentions also has the benefit of presenting old information in a new way for the already onboarded community, and makes a case for how other projects could start to seriously consider adding the value of a creative to their team in a more integrated way than static web design or a project logo.  They intend to start with partnerships more local to Cardano, but indicate that within 3-4 months they will be able to reach out to more traditional media partners, and their proposal suggests this could be non-crypto influencers or platforms.", "q0r": 4, "q1": "The team gives some great background on themselves and their association with mLabs, a major development and networking contributor to the Cardano ecosystem.  While they have an adequate timeline sketched out here, and the budget is (very) roughly imagined and distributed, the real issue here is going to be the addition of the visual artist themselves.  They indicate the challenge of needing to get some combination of visual impact, video and animation skills, and blockchain knowledge.  It should set their mind at ease to know that on at least one count they can reduce that challenge:  any artist brought into the work will be able to feed off of mLabs knowledge of the ecosystem and principles at play in blockchain and learn as they go.  One could actually make a case for the benefit of bringing in someone with fewer preconceptions about what the team will be looking for.  On another count, the team indicates enough experience with their own forays into video editing, that they can probably either choose to lean on a video expert with artistic touches, or to support an artist with some experience in video, or any combination in between.  One thing is for sure, they should expect to spend some time onboarding the visual renderer(s?) to the team and the vision.  Since the studio itself will need some time to come into being, there should be time for such a task.  One thing that is missing is any discussion of whether there is a plan for monetization of any of this content:  the team indicates that Youtube may not be the best choice for them, but they also don't rule it out.  What is the plan to sustain the content going forward?  The team points towards \"decentralizing\" the content as the answer, some combination of community creation and curation, however it isn't really explained at length.", "q1r": 3, "q2": "The included roadmap is broken up into 3 phases, starting with obtaining equipment and onboarding the artist.  The second phase begins with establishing the content and cadence of the shows and ends when a steady release scheduled has been established for the videos, explainers, documents and podcasts.  Expect all of this to take the majority of the first 3 months of the project and likely bleed into the next three as well, with a far out timeline of 6 months at the latest for final delivery (steady, offsetting bi-weekly shows, podcasts and articles).  The final phase is more theoretical and it isn't clear if it should be considered a deliverable of the project, what they call \"decentralization\" of the content, where it is ideated, even created by the community.  Most of the KPIs suggested to track the progress are of the \"influencer\" type, suggestions about recognition within the community, strong branding, etc.  It is expected that they will use the accumulation of deliverables, such as total podcasts to-date, as well as social media engagement metrics to prove progress on their monthly reporting.  As a weekly show, it should be easy enough for the community to keep track, as long as communication is strong through the first phase of the project, before much content is being created.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 7, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The idea is good, but I don't think it fully meets the requirements of the challenge. I think that because, through reading the challenge, I understood that the main goal is to make the content related to the Cardano ecosystem expand to different media besides youtube, where we already have a good base of content and viewers. What is said here in this proposal is that a team, apparently quite diverse and prepared (they have a website where we can get to know them better, as I will mention in the analysis topic below, and we can prove that they already have experience in activities it proposes) will produce content in various forms of media about Cardano. However, where would this content be released, exactly? It is said that podcasts, videos in animation format (to facilitate the understanding of complex technical content) and educational articles for those who want to delve into the subjects would be produced (I didn't quite understand the format of these articles, would they be written texts?). These are certainly extremely valid formats and content, but I miss two things here. The first is, as I said, to understand where these contents would be released. In addition to youtube, how does this team intend to make these contents reach the public? After all, in this challenge, we want to get out of the bubble a little and reach a more traditional type of media (perhaps TV or radio), with the objective of reaching different types of audience as well. Another thing that aroused my reflection was which themes, precisely, would be addressed in each of these contents. Who would talk about what and in what way. Because, of course, podcasts are on the rise, but what kind of subject do they intend to talk about besides the most recurrent subjects, which they themselves mention (the unit price of Ada and speculation). I think that in order for it to be understood whether this proposal meets the challenge well and is something that we should certainly fund, it lacked a better explanation of what types of media the created content would be released by and exactly what subjects would be addressed (in addition to who would address which topics). \n", "q0r": 3, "q1": "The team provides a pretty satisfying breakdown of who they are. We know their names, what would be their roles in the project and a small text is also attached that exposes the history of those involved. It's good how they attach links, whether it's Anthony's youtube channel or Maksymilian's GitHub, that way we can have real proof of the work they say they do. Another very positive point is how we have several team members who have a lot of involvement and experiences with Cardano. Often the team is even technically prepared to perform the intended tasks, but does not have a strong connection with our blockchain, which in my view is essential. So, in terms of the team, everything is almost perfect. It would be more suitable if they already had all the members, for example, from what I understand they will still hire a video editor and an artist to do the animations, it would be better if they already had these people defined so that we had 100% confidence in the team, after all the animations are a fundamental part of the success of this project, as well as the editing of the videos. But I understand that it is not always possible to present a proposal with all team members defined; in that case, I suggest they introduce these new team members when they are hired. Regarding the explanation of financing: I found this part superficial. They ask for a total of 25k, and explain how much would go to each part. But it would be important for each part to be further explained. I'll cite an example: in marketing, partnership and promotions, they claim that 7k will be spent, but why? What kind of marketing campaign will they adopt, how will these 7k be employed? Who do they plan to partner with and what kind of promotions are they thinking of establishing, and what part of the 7k would these things use? Likewise, other expenses could also be better detailed. Finally, as far as the script is concerned, I also think it could have been better explained, they establish phases, but we don't know how long (in months or weeks) they would last, what month each would take place, who would work on which step. Although they explain the basic activities to be carried out, without placing us in what time and space (and who would do each task), it is not possible to fully understand the development of the project. In the refinement phase, they touch on a crucial point that, in my opinion, should be better explored: building bridges with other forms of media. This is what we are explicitly looking for in the challenge, so I would like to understand at what point in the project this would be done and what forms of media and partnerships they intend to contact. So my suggestions are to explain in more detail both the roadmap and the use of funding, the team presentation looks great. \n", "q1r": 3, "q2": "As with the budget explanation and the roadmap, auditability is present, but could be better detailed. Progress is forecast for 3 and 6 months, where it is succinctly explained what is expected for that time period. However, dividing the progress into two quarters seems to me a very long time, I would like to understand on a smaller scale what progress would be achieved. For example, such information could be given from months. In the first month, we expect this and that to be achieved. In the second month, we want this extra progress. And so on. That way, we would have a more solid view of what they are expecting. As in the script refinement phase, at a certain point in the auditability they claim that they will “partner and release with more traditional content partners”, reinforces the need for more information on this. It is necessary to know what forms of media these are and how they would be able to establish this bridge and arouse the interest of such traditional media to disseminate our contents related to the Cardano ecosystem. Regarding the final product, that is, what is expected as a success of this project, I believe that sufficient and satisfactory information has been established. We know what to expect, in terms of project growth, partnerships, public response through interaction, etc.; what we really need is to establish this follow-up. In this way, it would be interesting for the team itself to establish a follow-up, gathering data and information and presenting this to the rest of the community, either through participation in Town Hall, discord channels or specific virtual rooms that take place after the general community meeting. Cardano, on Wednesdays. In general, it is good auditability, although it can be improved in terms of tracking progress (the 3 and 6 months part). \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The problem described in this proposal is closely aligned with the challenge. Producing high quality educational and engaging content about happenings in the Cardano ecosystem will be paramount in onboarding new users, educating/informing existing community members, and ensuring valuable projects have a platform to share what they are building.\n\nA main objective of this challenge is to create improve the creation of Cardano content outside of youtube. The proposer notes that \"educational, editorial, and human-interest content is underrepresented\" and this gets at the core of this challenge. \n\nThe proposer also specifies that the media made from this project \"will be freely available for reproduction by other media companies\" which shows the commitment to create good content that will be widely shared to communicate core concepts and ecosystem happenings.\n\n", "q0r": 5, "q1": "The team proposing is part of an integral group of engineers that understand the happenings of the ecosystem deeply; \"As an integral builder on Cardano, we have our \"ear to the ground\" for the technical developments of the blockchain.\" It is clear that the team involved in pushing this proposal forward will have many avenues to create the promised content through their direct connections to projects building on Cardano. The timeline and budget communicated in the proposal are reasonable and feasible. The expertise and personnel involved in the proposal have a track record of delivering on previous media projects to point towards. Overall, it is highly likely that if this proposal is approved by the community the team will be able to deliver on the promises laid out in the proposal.", "q1r": 5, "q2": "It will be easy to identify if this proposal is delivering on promises based off the clearly outlined content release timelines provided. The quality and quantity of the content will be easily identifiable as the product produced by this proposal will be public content. This proposal seems feasible and I am confident the given team can deliver on this proposal.", "q2r": 5, "assessor": "z_assessor_1087", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "This does not address the challenge of nation building dApps. This project may very well be useful to the Cardano ecosystem, but it does not address the challenge of building dApps to be used for national registries of any kind.", "q0r": 2, "q1": "The project is a bit vague in what it means by a decentralized studio. There is a budget line for equipment, but no description of where in the world it will be, or how it will be shared. Most of the budget is for salary for people to produce educational videos. This production can certainly be done in a decentralized way, but it's unclear if that is the goal.\n\nEach team member has demonstrated success of working on teams. Major markers of success will be team meetings, it is reasonable to expect they will meet those goals.", "q1r": 3, "q2": "The criteria for assessment are rather vague. Regular team meetings are trackable, yet there are no milestones for deliverables. How many videos will be produced? Is there a plan to measure public engagement with the videos? The proposal lacks quantifiable goals which would help a lot with auditing the progress and success of the project.", "q2r": 2, "assessor": "z_assessor_1336", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The project is very well aligned with the challenge, It has a clear target audience, which will help forming a strategy. Podcasts and video are some of the most used media types nowadays and by focusing on them, the project shows that it knows its target audience and knows how to reach it. Offering an option for those who wish to have more in-depth knowledge on the subject can expands the adience and increase the listener's interest.\nI would like to know more about how they plan on adapting the content to other needs. Translation could be an important part on this project, but it can't rely solely on crowdsourcing, as it would need a quality control. I have the same worry when it comes to the idea of open-sourcing, as uninformed content can be detrimental to the brand.", "q0r": 5, "q1": "The team seems capable and fit for the job and it is backed by the links provided showing their work, which is very positive.\nRegarding the roadmap, it was smart to divide in three phases and to make sure the team is ready and structured before effectively starting it. However, there could be more detail on how long each phase will take, and deviding in smaller sections could help visualize the different stages and possible risks the project could have. \nSince this roject is heavily dependant on social media reach, there could be a strategy focused on marketing.\nThe budget requested, while well defined, is a little high. The costs of Video Editor and Motion Graphics Artist part-time salary could be reviewed so there it wouldn't take such a large part of the budget", "q1r": 4, "q2": "I like how consistency taked a big role on the measurement of success, as it is what builds a base of dedicated followers. It's interesting how there is a mid-project analysis, allowing the team to adapt according to the project's pace after 3 months.\nHowever, the project could benefit from more data driven KPI: how many subscribers do they intend to have after 6 months? How many partnerships do they intend to have? How to measure the strenght of the brand identity?\nHaving more defined KPI will also help the team understand if they are close to reaching their goal after the 3-month-period, helping them adapting their strategy if necessary.", "q2r": 3, "assessor": "z_assessor_1659", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the main criteria of within the challenge.  The proposer identifies the problem of Cardano relying on other platforms (ie YouTube) to disseminate information and engage users.  The proposed solution, creating a Cardano space to engaged those who are strongly interested in Cardano, seems logical, reasonable and would cut away the noise and nonsense from other platforms.  The team has experience and has clearly thought through the needs across all areas from talent to resources to approach.  The have highlighted the potential risks, lack of ability to build animations, and provided mitigation strategies, simplify graphics however I would have liked to see the risk of minimal participation and a mitigation strategy provided.  My view is the most significant risk is creating a community of users engaging in “The Universal Joint”.", "q0r": 5, "q1": "The proposer has addressed a majority of the feasibility criteria by demonstrating the team’s experience and capabilities (pass), detail on the budget (could use more specifics on equipment), roadmap and overall past team success.  I’m confident the MLabs team can build the platform my only question is the plan on engaging users and the community.  ", "q1r": 4, "q2": "The proposer has defined easily measurable KPIs and a process in which the Cardano community can easily measure MLabs success with Universal Joint.  The MLabs team has established bi-weekly distribution of videos, interviews, educational content and podcast conversations and the Cardano community can easily measure this success.  It is obvious this team is well versed in the Cardano ecosystem and how to develop and deploy new projects in Cardano.", "q2r": 4, "assessor": "z_assessor_1807", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Currently, when it comes to cryptocurrencies, there are usually only speculative community groups. And negative, inaccurate information abounds, affecting the overall confidence of the market. So this idea wants to build a communication channel with users sharing what cardano is developing, promoting reputable projects and outstanding people who have contributed a lot to our community. Also show the world community how positive and great strides are being made in our community. An active project with no geographical limitations.", "q0r": 5, "q1": "The working team has members who have experience in communication with the production of content on youtube. They have links with artists to ensure more engaging content. In addition, they are education experts, who have many years of experience in creating educational products, so they are a potential group that can create educational and propaganda products to help the community better understand the development. development and the value cardano technology can bring.", "q1r": 5, "q2": "Their plan is to work in 6 months. During those six months, on average, there will be a video release every two weeks with a short interview or knowledge sharing.\nThey plan to further collaborate with media partners as well as educational content creation companies.\nI find an idea like this pretty easy to check the progress of the project by what they report (video content posted on website or youtube, number of followers...)", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The proposal suggests idea about building a multimedia studio creating qualified content for Cardano community. Its content might be in the form of podcasts, videos, and educational articles. This project will help community members and blockchain newcomers who want to have in-depth coverage of Cardano project and the team building it. However, its challenges are to make valuable and appealing content which require team both having experience in video editing and graphics and Cardano project. I would like to see more explanation about multimedia channels that the project would like to convey in its content. ", "q0r": 4, "q1": "As far as I'm concerned, the team member all have experience in media and technology field which is qualified to execute this project. Moreover, the expenses are clearly shown and calculated. I would like to see more detailed roadmap, timeline and KPIs as I think I this project is still in the early stage. However, the proposer really shows that they know exactly what to do and how to execute this project. Also, I think it is good idea to have partnerships with other partners in the long term and grow multilingual support which makes ecosystem bigger. I hope this project will get supported and funded soon.", "q1r": 4, "q2": "It is easy to check the progress of this project as we can see the lastest updates of videos, podcasts or articles on their multimedia channels. Also, we could check how appealing their content to community by seeing interactivity and engagement such as subscribers, views, likes,..", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Creating a decentralized multimedia studio to allow teams share their stories about their journey shaping this community is the focus of this proposal. This is a laudable proposal because these stories can motivate somebody to become active member in the community. \nAddressing the challenge, a universal joint is a mechanical connection used for transmitting motion and power between intersecting parts. The 'Film+ Media (FAM) creatives unite' challenge setting is about communicating a clear message toward media while creating educational and inspiring content. A thriving multimedia platform and content ecosystem will serve as a robust and novice-friendly onboarding experience for newcomers to Cardano and the blockchain space. \nThe main risk may be that it is labor intensive. However they will look for editors from the community to help. The challenge is effectively addressed by these facts. My rating is 4.", "q0r": 4, "q1": "The plan is clear in the proposal in the areas of bootstrapping - acquire some basic equipment, set up media accounts, hire video editors, etc. \nInitial phase- establish a release cadence centered upon succinctly edited video content, longer-term podcasts and in-depth articles. \nRefinement phase- incorporate community feedback into our content design, begin marketing efforts, to promote the platform,\nThe budget breakdown is clear and detailed showing costs of initial equipment, training and marketing costs. Total amount requested is USD 25000 is reasonable. \nThe team is made up of 3 experts with skills such as computer science, cardano-based projects, educationists and business development.  The information provided will make implementation successful and my rating is 4.", "q1r": 4, "q2": "The duration of the project is 6 months. \n1st 3 months - studio up and running, contents format established, steady cadence of content releases. etc.\n6 months - Partnerships and releases with more traditional content partners, Notable presence across typical social media platforms.\nSuccess can be seen by measuring bi-weekly uploaded and audio long-form interviews mixed with educational news content; bi-weekly podcast conversations; sizeable content engagement across platforms, etc., Attracting large members of lay people to the blockchain. \nThis is a new proposal. I think all the information here is sufficient for successful auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The Proposal is aware that the Cardano ecosystem is overgrowing, resulting in countless stories involving teams and individuals within the Cardano ecosystem. Since then, the Proposal wants to create podcasts to interview Cardano builders and create videos, educational articles to provide direct and in-depth knowledge about Cardano to the community. I appreciate the rich mix, including podcasts, videos with motion graphics, videos... The main goals of the Proposal are in line with the Challenge set. The Proposal's content will be freely distributed and available for use under a creative commons license, multilingual, which helps to increase the spread of the Proposal. However, the Proposal needs more clarification: after the content is completed, it will be posted, presented where, on what channel... for example, TV channel, Newspaper, Youtube channel, Facebook channel, Telegram channel, Discord,....will help the community better visualize the Proposal.\n", "q0r": 4, "q1": "Regarding the roadmap, the Proposal provides three stages, and I understand the specific tasks you need to do. However, you should measure the implementation time and provide a realistic timetable.\nRegarding the Budget, the Proposal needs to be presented in more detail,\nexample of Initial equipment costs: $2000 (laptop: $700, graphics software: $300, recording equipment: $300.....)\nExample of Editor and Motion Graphics Artist part-time salary:\nTotal time to complete the work one month (2 videos, 2 podcasts, 1 article): 45 hours\nEditor and Motion Graphics Artist part-time salary: $60/hour\nTotal: 45 hours * $60/hour * 6 months = $16200\nThe detailed and complete presentation will make it easier for the community to assess whether the Proposal has enough funding to accomplish the stated goal (2 videos, 2 podcasts, 1 article)\nThe Proposal states, \"These team members are already salaried and will not require additional compensation through Project Catalyst\". As a member of the Cardano community, I appreciate and appreciate this. However, in my opinion, an appropriate project management fee should be included in the Budget\nRegarding the Team, I believe the Proposal has a suitable team to complete the Proposal. Members have blockchain-related experience and skills, and there are members with media-related skills. However, you should provide more social networking links (Linkedin, Twitter, Discord...) so that the community can evaluate more about the team members.", "q1r": 3, "q2": "Regarding auditability, the proposal already includes a timetable for completing the project. The proposal already has KPIs for video and podcasts (2 videos and 2 podcasts per month.) I think it would be good if the proposal provides more KPIs for education articles and define KPIs for the following:\n- how many content engagement across platforms (? subscribers, ?views, ?likes, etc.)\n- how many traditional content partners do that proposal have partnerships and releases with?\nThis helps results and KPIs be audited well and helps the community better visualize what project success looks like. When the project is actually implemented, there will be more people accessing and understanding the value that the project brings, however, it would be better to have those numbers.", "q2r": 3, "assessor": "z_assessor_998", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a decentralized, multimedia studio focused on helping teams share their journey building and the issues they consider crucial.", "experience": "dApp team leaders, IOG partners, former educators, educational content editors, and team members experienced in audio production, sound design, and vlogging (YouTube)"}