{"id": 396702, "author": "hakua1993", "title": "A Film of Cardano Mission in Africa", "url": "https://cardano.ideascale.com/a/dtd/396702-48088", "category": 26452, "amount": 75000, "description": "How do we inspire the average person to align themselves with Cardano's mission while bringing clarity to what Cardano is doing in Africa.", "f6_no_assessments": 10, "f6_rating": 3.7333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer offers a unique idea that could have long lasting impressions and allow better understanding to what Cardano is bringing to the world, starting with it's initiative based in Africa. This film production could potentially reach many more outside the ecosystem as it sits now, through the medium of film that can potentially encapsulate an audience beyond cryptocurrency, but at the same time educating individuals on what Cardano globally may look like once full scale adoption occurs. The proposer is well versed in filmmaking and has a unique way of keeping audience's attention by offering real world experiences in a documentary genre, showcased by the widely successful \"A Failed Artist\". The solution to bring more awareness to Cardano by creating a documentary on the work that's being done in Africa now, putting boots on the ground and seeing what life changing accomplishments are being made through the ecosystem and technology of Cardano's efforts is something that is in dire need of sharing with the world outside of cryptocurrency. By using this artistic style of medium, it is a promising solution to the problem Cardano and other cryptocurrencies face when trying to explain real world applications available to the citizens of Africa now and beyond. The proposer should take into account, that this media can only truly be measured once the film is completed, therefore the Impact on the ecosystem could be massive if proper marketing of a successful release or even add live updates from production in real time. This could increase awareness even before completion and build more anticipation of said film.", "q0r": 5, "q1": "The proposer presents a feasible outline on what must be done before and after the production of said film. It is imperative that the funding more or less kick starts the team members, which are not clearly defined here though that would add merit to the proposal, allowing all parties involved a little reassurance that Project Catalyst and the Cardano ecosystem have faith in said idea to get the ball rolling. The relevant skills needed to produce and deliver on such a task, is highlighted within the previous film production \"A Failed Artist\". Having done that amount of quality production without a truly funded budget is quite remarkable, as anyone who watched the film can see, it was done with professionalism and captured the true essence of the story. If the same dedication is brought to the making of the proposed idea of a story on African citizens and the people who are working to build Cardano there, this could be an excellent way to showcase and bring awareness to one of/if not the only proof of stake blockchain platforms performing such globally challenging tasks. The artist and network of the proposer and their team could and should be given more detail within the proposal for clarity towards past accomplishments within the Cardano community. As an avid NFT collector, knowing of these two mentioned members, they have been well received in the Cardano communities and have built a network amongst their socials via Twitter and discord that I feel could benefit Project Catalyst, Cardano and the ecosystem. In terms of budget, there are some areas that may have higher estimates than what actual cost may total, but also some costs which may not be realistically defined: i.e. Travel expenses could be cut with properly timed planning which could reduce overall budget. Also Equipment needed such as \"Gear\" might be a low evaluation in order to properly complete such a task. Taking into consideration damages to equipment or lost items over the course of travel and transportation, this number may exceed the proposer's initial amounts. This particular proposal does not specify definitively the risks, but most likely has an understanding of what may or may not happen along the way.", "q1r": 4, "q2": "As mentioned above, the community outreach and success of such a film and it's production would rely heavily on the social networks of the proposer and any other parties involved in order to spread awareness outside of the Cardano ecosystem and audiences unaware of what's happening with the Cardano Africa Initiative. This funding seems fair to the proposer's overall ambitious tasks ahead. Creating a film production within a timeline is not something any professional in the same field would agree, always goes to according to plan. There will be some downsides to such a proposal and that must be taken into account before funding is received. Initial budget of $75,000usd could be more than enough to produce a film that aims to bring awareness into the Cardano ecosystem, but given the task that number could be even higher, if the proposer delivers an exceptional representation for Cardano Africa and all the detailed research that has gone into the project already, and what's to come in the future. The auditability from the team is somewhat undefined though mentioned within the proposal, it is said that, \"The community will be holding us accountable as we will be holding spaces and giving updates via twitter/social media on the current progress of the project\". Producing and filming of said solution may require weekly to monthly updates to Project Catalyst team members to track the progress being made. This type of understanding would better insure that catalyst funding is being allocated properly towards the expenses outlined and reiterate the milestones achieved from the proposer for the utmost transparency.", "q2r": 3, "assessor": "z_assessor_1529", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is very interesting and aligns well with the objectives of this challenge, in addition to dialoguing with the challenge focused entirely on promoting the growth and adoption of Cardano in Africa. I thought this challenge that encourages creatives and artists to work in the Cardano ecosystem is essential, because I believe that there is no point in creating amazing technologies and having technically very qualified people working on our blockchain without this being able to reach the general public. And the media are diverse, as it is said in the description of the challenge, Cardano already has a good base of reach through youtube, but I believe that this platform reaches a more specific niche of the population, when we want to build something that goes beyond the bubble. Speaking directly about the project in question: first, I would like to comment that we need to analyze carefully, because funding of 75k is requested, which is a lot for a challenge that has 150k as a total fund to be invested. Secondly, speaking of the idea itself, I thought it was very good and the team was very smart. I think this is because they had the insight that it is necessary to create an interesting and engaging script, capable of transporting the audience to the narrative, and whose main objective would be to understand we should be interested in the Cardano ecosystem. The team promises to use narrative strategies, according to them, merging the rational and emotional areas of the audience in order to captivate them, so that they can come to the conclusion of how necessary and important Cardano is for the world from now on. I can speak with a little experience here because I studied Cinema and Audiovisual for two years, and in fact, there are some basic ways to make a movie successful: creating projection and identification is one of them, that is, the spectator “turns” the character. And in that case, the viewer can become a member of the ecosystem, whether through Catalyst, proposing or simply using Ada and other technologies present in the ecosystem. I found it interesting how the team justifies the difference between producing a feature film versus creating multiple individual social media posts. I really believe it is a good strategy based on good principles: the team expressed their awareness that not everyone will take the initiative to research what blockchain is, and bringing this information in a simple and understandable way is more than necessary. However, some issues (besides being a very high budget, compared to the money dedicated to the challenge) concern me here about the impact of this project. The team argues very well why it is positive to produce a feature film, but does not give detailed information about this film. We have a sort of synopsis, but that's it. It would be interesting for them, as an audiovisual team that is already active and that already has previous experience, to inform: whether or not there is a script; if there is, I'd like to see it. If there isn't a script, I would at least like a more extensive explanation, one that gives me an understanding of the narrative as a whole, not just the premise. What will happen in this movie? Which characters? What are the conflicts, and how would Cardano be inserted here? What's the climax? How would problem situations be resolved? How would the movie end, how would the established scenarios be presented and what would our characters end up with? I believe that in order to have a greater force in impact, it is not enough to know the intention (however excellent it is) of the team towards the feature film, but also to know everything about it. \n", "q0r": 3, "q1": "Unfortunately, I found several problems to be solved in this part of the proposal. Let's start with the plan. Here some phases are established, but they are quite superficial. For example, in pre-production, partnerships would be made with others (which others? I would like to understand who these people are they intend to contact). Meetings would be held (where, for what duration and for what purposes?). In phase two, it would be production of the film itself. I'm worried about the 2 months time, I think it's a very short time for a feature film and whose investment is so high, which doesn't mean it wouldn't be possible. But I would like in which months this would happen and what the shooting rates would be (how many days they would be, how many times a week, in which locations, etc.). It would also be necessary to understand what these flights are - who would be going from where, to where and why? And about these accommodations, where would they be? I think it would be more than necessary to make the shooting plan explicit. In other words, I would like to know what would happen on each recording day, which scenes would be made, which audiovisual professionals would be working on these parts, which actors (even, this part of the actors is quite vague, it would also be important for us to know the characters, their characteristics and which actor profile would be suitable to fit here). Without this filming plan, it is very difficult to understand how this phase two, the production of the film itself, would take place. Part 3, which is post production, is a job of editing, adjusting the color, sound and so on. This part does not need as much detail as the previous one, although it would be good that we had more explanations. And finally in part 4 I would like to understand the distribution plan: this is essential for the success of any audiovisual work, and can be decisive between the success and failure of the feature film. Where would this film be distributed, streaming services, movie theaters...? In which countries would the investment in distribution take place, how to make the film accessible to everyone and not just to those who have the purchasing power to go to the cinema or have a subscription to some streaming service? Regarding the explanation of the money requested in the financing, I also feel a lack of details here. For example, his team 20k for equipment, but we don't know what equipment would cost how much and why it would be needed. There are about 14k invested in flights, accommodation and meals for the team. I would like to know, as already mentioned, why these flights would take place, from where to where, how many people would the team be composed of (between 3 and 5, but if there are 3, would the same money be needed?). In this part: “Film (B-roll / Interviews) = $22,000”: What is this all about, exactly? It's not very clear to me. I also missed the money invested in marketing, distribution and paying actors. The financial breakdown needs to be revised, in my opinion. And finally, about the team, we barely know who they are, unfortunately, we are only told their names and roles to be performed. Some important information that was missing were: a kind of curriculum, in addition to the film “A Failed Artist”, which they have already produced, what other works have been developed throughout their careers? Very important point: how do these people relate to the Cardano ecosystem, how did they get to know our blockchain and how do they relate to it? Is there anyone who is quite knowledgeable on the subject, or would an outside person be hired to further explore and explain Cardano's technologies? In general: both the division of phases, the budget breakdown and the explanation of the team exist, but they are superficial, lacking details to have greater confidence here. \n", "q1r": 2, "q2": "I found this part of the proposal rather superficial and inaccurate. I say this because little information is provided on how the community could follow the development of this project. It is true that we can do this follow-up through the information provided in the project phases, but, as I said earlier, the detail in this part is also insufficient, which leads us to have little exact material to monitor. The team claims it will keep the community updated through postings on social networks such as Twitter. But I wonder: how often would these posts be made? And what happens to those (like me) who don't use this social network? I would like the team to make access to such information more plural. It would be interesting for them to prepare follow-up material that would be disseminated on several channels, not only on social networks. It is important that you participate in events in our Cardano community, for example. It would be interesting if, as I said about impact, the script and characters were already presented to us now, and not as a form of auditability. Auditability, in my view, is used to monitor whether the project is going well or not, and we don't know its most fundamental characteristics, you know? It would be positive for the team to provide us with more solid means of monitoring this project, the information given both in the detailing of the phases and the forms of auditability proposed here do not seem sufficient for us to carry out a solid monitoring of the project. In addition to the construction of the feature itself, it would be important for us to know what would be happening in the post-production process, that is: how would the film be distributed, if the expected audience is being reached, how is the audience's return, the acceptance of this feature beyond the audiovisual community and so on. With that, unfortunately I suggest that the team rethink the auditability, improving it through these suggestions or other ideas. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 11, "ne": 8, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "There is a lot that I like about this proposal.  It suggests that there are more and better ways of engaging with crypto and Cardano than following social media feeds and blogposts.  It further suggests that if that engagement is an emotional focus on a relatable character than we tend to get more out of what we do learn, as any viewer of Hoskinson's videos can probably attest.  The benefit of a \"story\" being told in a compelling way around the use and impact of Cardano on lives of real human beings could have immeasurable impact.  Having said that, this project doesn't have to set its sights on such a lofty goal, or to look for the perfect story or find some critically important character.  It almost doesn't matter which subject matter they settle on or which locations they pick.  All they have to do is tell the truth.  Cardano should take care of the rest.", "q0r": 5, "q1": "The film included with this proposal is really all that this team needs to provide for a resume.  It makes it clear that they know the work the are embarking on, and the history of the film, from its rapid development schedule to the bootstrapping of it with a Cardano based royalty NFT mint tells us that they have the right attitude for approaching a project like this and of getting it done.  Even though the team looks good, I'll be perfectly honest:  I don't think they are going to create the greatest thing since sliced bread.  They don't have a lot of experience and the project they propose will be very emergent (ie: uncertainty everywhere) with a lot of logistical hurdles, no matter how small they try to make it.  However, I do think they can make something BETTER than what they have already created, which means it will probably be pretty good...  I appreciate what they are saying with their budget, when they indicate that the goal isn't to outcompete their fellow proposers, but to collaborate and bring as much talent into the big tent as they can (another logistical issue that will require management, big teams), so I don't think a yes vote here should be considered an either-or choice in this category.  If there is one risk for this project that I hope the proposer fully appreciates, it is the risk of losing sight of the landscape, the vision of the film, and getting caught in an advertisement for Cardano.  I think it is a great idea to have \"cameos\" by projects like WMT, but impactful, polished projects like that have their own charisma, and it can dominate a scene if allowed to.  The team needs to frame such things as true collaboration, with equal value from both parties.  ", "q1r": 4, "q2": "The roadmap indicates a classic shooting schedule with roughly equal allotments of time for pre-, post-, and filming.  But it should be noted that the included budget does not appear to include post-production or the finalization and circulation of the film.  And while post- can be some of the most important work on the film, having something to work with is an eminently reasonable deliverable for this budget.  Post can be bootstrapped later if need be, and having something to leverage will help (and Catalyst can be the target of that leverage).  The deliverables for this project appear to be the interviews, supplemental footage for intercutting to build scenes (what is being called \"b-roll\" in the proposal) and a main film or story roll. (The interviews may be considered the main roll, depending on what kind of film this turns into, but I expect they will be able to have a story roll.  As far as tracking the development of these deliverables, there are some early milestones that will help, such as finalizing the initial storyboard and firming up partnerships, and as the process starts to pick up, they will be able to use location and travel to measure progress.  And, of course, eventually they will be able to report what percentage of the film they have onboarded.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Cardano is growing and, developing Africa as a mission, but there is still not much awareness about the Cardano community. The team proposed with the idea of ​​creating a movie that could excite and inspire people outside of Cardano. Raise awareness of what Cardano is doing in Africa. The proposed team clearly described and had specific step-by-step solutions that impact the challenge. At the same time, the team also recognizes many risks and has solutions for those risks when the project is implemented.", "q0r": 5, "q1": "Set out specific plans, roadmaps in each stage, milestones for the implementation of different jobs. The budget is allocated in detail, transparently in each time and work for the whole project process. The members of the project are all people with the skills and experience in the world of cinema and technology necessary to successfully carry out the project. Increase the strength and sustainability of the project.", "q1r": 5, "q2": "It will be easier to measure the progress and success of the project if a timetable in the KPI performance. It would be nice to have exact figures. It aims to let the reader know what to achieve within the timeframe. Possible example: Stage 1: Project implementation date, How many Investors, Number of vehicles, Number of people inside and outside the industry… Stage 2: Completion date and, movie premiere, How much ticket buyers? The results achieved from the start of phase 1 to phase 2 are a definition of project success. In addition, the budget is explained in a transparent and easy-to-audit way. If successful and developed in the right direction, the project will be a new step for Cardano, the people of Africa and the film industry.", "q2r": 4, "assessor": "z_assessor_1409", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "I do think this idea can have an impact in the community outside Cardano to bring them in the Cardano ecosystem. However, it is an ambitious project on a delicate issue and, if not well-executed, could have a negative impact on how people view Cardano. \nAfrica is a big continent with many different cultures. It is a risk to pictureAfrica as one thing. I think the proposal could have presented some examples of regions they plan on focusing, or some people already mapped out to tell their stories in a cohesive way. And if the project was indeed executed with stories from different parts of Africa, the marketing should be extremely careful to avoid conveying the idea that Africa is just one singular thing. \nAnother risk that should be considered is that some countries in Africa are very unstable, and any unexpected event could delay the production.", "q0r": 3, "q1": "While the timeline is detailed, it is very ambitious. It seems risky to produce a documentary in such a short time, especially in Phase 2 : Film /Production. As mentioned, there could be unexpected events that delay the production, so I believe it should consider extra time to mitigate bigger delays.\nSimilarly, the budget could have some extra dedicated to an emergency. I also don't see any money dedicated to translators, unless it is included in another category. The budget asked is a bit too high, representing half of the budget available in this campaign.\nI would have liked to see more detaild in the team member's background.", "q1r": 2, "q2": "I like how the Cardano community will be a used to measure the success of the project. However, I would have liked to see some more clear and measureable KPIs. For example, how many viewers it expects to reach, and would be the impact in the Cardano ecosystem.", "q2r": 2, "assessor": "z_assessor_1659", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposers aim to produce an educational documentary series of an initial set of 3 episodes, with a length of 5-8 mins each, focusing on Cardano stories. The plan on starting locally with the Czech community of builders (Trezor is from Prague) and then spreading to the rest of the world. They intend to reach the Czech television as an initial distribution method, and judging by the quality of the trailer and the previous works already being shown on the platform, they stand a chance to do so.\nFrom all the information gathered in the proposal, I find it highly fits the challenge description and beyond that, it could have a positive impact upon the Cardano Community in general.", "q0r": 5, "q1": "The timeline and detailed plan are comprehensive, covering all stages of a film production: from pre-production to final rendering. The budget includes a lot of necessary items and fixed costs, offers information on hourly rates and times needed for completion, thus leaving no detail uncovered.\nThere is not a lot of information provided on the team members, although they have added some links to their previous productions, so I could make the judgement based only on that criteria - for a filmmaker that is what counts anyway.", "q1r": 4, "q2": "The progress development will be mostly social, through regular Twitter spaces and posts on social media platforms. Since it is a creative production, I find the description reasonable.\nThe success description is detailed, doesn’t have clearly defined metrics, but judging on the information provided and the content of the proposal, I think it is sufficient.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Having a film telling Cardano challenges and successes in Africa is a great deal and good propaganda. There are certainly good stories there and social issues faced by this region might be brought to light. The proposal does address the challenge as it helps to increase kpis as \"# of multimedia projects\", \"# of decentralised film crews\", \"# of decentralised content creation teams\" and is in line with challenge defition of success (Teams collaborating equitably to produce inclusive, high quality multimedia content + platforms = increase knowledge + adoption of Cardano).\nThere are though some things that I missed here in the proposal:\n1) It could include more details both on the content intended for the film and what format it will be made (real acotrs/ animaiton, documentary, story inpired in real life, etc)\n2) the communication/advertise plan with people outside community. This part is key for achieving project successl. In my view, it has to be advertised not as a film about Cardano or blockchain, becase it might not have the right appeal for people from outside. Cardano and blockchain shouyld be introduced smoothly and subltly inside the story, but the main focus should be in the styory of the people, their struggle and possibly success, linked with Africa.\n3) it is imporant also to be careful not to make the project looks like you are intending to get money from out of Africa struggle. I know this is not the intention but other people might have this perception and it is all about how it is advertised and made.\n4) The last point is regarding the money aquired with commercializing the film. whats the plan for it? Will it help to pay for the film only or is it intended to get prof ? If it is the latter, maybe some part could be donated to Africa charities institutions or for Cardano projects in Africa not being funded by Catalyst. It would would help to address point number 3. Also, how the film will be distribuited? will it only be available online or will it make it to the cinema? what platforms will it be available?", "q0r": 4, "q1": "There's a clear plan in place but it seems a bit challenging. Fillming and producing in only for 4 months looks very hard, but, as I'm not experienced in this, I wont consider this in my score. Budget breakdown is fair and well done but it is important to mention it accouts for half of the challenge total budget. Maybe this proposal could be broken down into 2 funds or have part of it being self funded by future tickets revenue. Obviously, producing a film is expensive and budget for this kinf of proposal will always be naturally high. \nAs for the team, there are 3 people in project team but experiences and capabilities are poorly described. it could have more details on what productions the team has cariried out before and links to verify these info. there's, however, a link from a previous movie produced before. Moreover, it will require to hire a whole film making team, which I understand its a lot of people (including whole cast, editing professionals, cameramen, etc).", "q1r": 3, "q2": "It is proposed here good milestones that will certainly help to track project development. The recurrent updates on social media can also help to follow up with it. I'd also include here some kpis after film is launched, related to how many viewers, how much money it will be made, etc. and the public and speciallized critics perception. It would be good also to somehow measure the impact of the film in the outreach of Cardano.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "After thorough reading, I get really excited about their proposal and I think it is great idea to create films to raise awareness and inspire people around Cardano blockchain. After watching the film \"A failed artist\" that the team have completed within 2 months without external funding, I really appreciate their effort and believe in the impact of the films on human's mind, both emotionally and logically. Therefore, film could be definitely used as a tool to attract, inspire people to participate and build Cardano ecosystem. I hope this project will be a success which could impact the film industry and educate population about blockchain technology. ", "q0r": 5, "q1": "After reading this proposal carefully, the proposer clearly gives their story idea \"Cardano can unite every human\".in the film. To transform this story idea into film, the proposer breaks the plan into four phrases and period for completing each phrase. I think their strength is that the proposer and team member are very experienced in making film. They know exactly what and how to transform a story idea into a film. Also, the detailed budget is clearly given for completing each job. Personally, I believe in success of this project and I hope this proposal get funded soon.", "q1r": 5, "q2": "It is possible to check the progress of this project as the updates are given on social media/twitter. Also, from the community feedback, the story will be revealed over time.In addition, from the release of the concept trailer or partnerships information with other companies in Africa. ", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "A great project to me, as it requires many of the problems that need to be solved in this challenge, it almost covers all of the problems the challenge posed, it can scale quickly and large to many places, this is a very good project, it brings great development value to the Cardano ecosystem, I want to see this project again in the next Funds if the project is not Funded in Fund8. It's amazing to create a film that inspires ordinary people to find themselves and align with Cardano's mission in Africa, it's completely replicable. to other regions of the world thereby adding value to the Cardano ecosystem.\n\nThis solution is amazing, it almost every problem in this challenge, the author's arguments are logical and clear. IOHK and Cardano built a foundation in Africa very early on and devoted a lot of attention to this continent, the solution to creating movies for audiences, making them feel what Cardano has been and will do for Africa. Africa, make them more motivated for themselves and feel the mission that Cardano is doing for Africa. A great solution.\n\nThe project has mentioned some risks when implementing, besides some of the solutions that the author proposed to overcome it, but the community needs more solutions for those risks if the project is Funded. The community is more interested in how the project will look if it is not well received or is delayed by external influences (e.g. lockdown due to the epidemic will not be able to complete the projects). outdoor footage ), and what the project author needs to prepare to fix when that happens. Of course, the community always listens and supports the construction of the Cardano ecosystem, but we need to know more about the risks that the project will face if it is funded, which makes the project go. in the right direction and achieve the set goals.", "q0r": 4, "q1": "Very well, this Project provides clear and reasonable timelines for implementation and completion, compared with the information provided. This is completely feasible to implement, however, the goals are not specific compared to the information provided potential that the project brings. The main stages are divided systematically, however, since the author is an experienced person in this field, in my opinion, the author should add a timeline to achieve the above goals (Eg: Total time to implement the project is 16 months divided into 4 phases, phase 1 is 2-4 months, the achieved goals will be reported to the community as...).\n\nThe budget exceeds 50% of the total budget of this challenge, the author's argument and explanation about disbursement are reasonable, transparent, and clear, which is very helpful for the transparency of the project to the community. Taking over half of the total budget for this challenge represents a big deal compared to the challenge, but with 15 years of experience as the author stated, it's a reasonable budget.\n\nThe implementing personnel have been assigned specific jobs, the listed experiences are suitable for the project, but the identity of the members is difficult to verify clearly. The author please provide more links to the profiles of the team members (eg: Facebook, Twitter, Linked,... or anything to make it easier for the community to identify the team) I hope to see it, currently, I only see a link to a movie the author has made - A failed artist.", "q1r": 3, "q2": "The project does provide KPIs, but the overall goals are easy to measure against the information the project provides, yet it's hard to test them. It would be difficult to check how far along the stages have been with an offer like this from the author, how do you plan to release it once it's done, which festival to submit it to? released on which platform? the community needs more detailed information.\n\nThe project has not yet determined success, information from the project shows what is being done, but the test has not been successful. The success of a feature film when it is welcomed by many people and broadcast on multiple platforms or local TV stations, the author needs to further list this metric to provide clarity when the project is funded.\n\nCompletely new idea information on the Cardano platform, which has never received any funding from the ecosystem. This is the first project on Ideascale and also a new challenge, it will be great for me to continue to see it appear in the next Funds.", "q2r": 2, "assessor": "z_assessor_709", "no_vca": 8, "ne": 3, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The proposal solves the problem presented by the Challenge by making a movie to introduce Cardano to people in Africa.\nThe project has given specific KPIs and goals that match the challenge settings outlined, for example, the number of people inside and outside the film industry who are aware of and understand more about Cardano, the number of filmmakers that the project will collaborate with, etc.\nThe project does not mention future expansion; however, I believe that if the project is successful, it will positively contribute and inspire other filmmakers to create Cardano products.\n", "q0r": 4, "q1": "Regarding the team, I see that you guys have a lot of experience and skills in filmmaking. However, to be better, I think the team needs more knowledgeable members and in charge of the technical and technological aspects of Cardano. At the same time, you should add a social network link so that the community can better understand your team.\nRegarding the roadmap, you guys listed four stages to complete; I think it's reasonable.\nRegarding the budget, in Phrase 2, I saw the team propose a budget of $20,000 for Gears, to be more transparent, I think a table describing what to buy, how much it costs….is needed.\nThe budget for Film (B-roll, interviews) team needs to be more descriptive because not everyone understands the budget in the film industry.", "q1r": 3, "q2": "The team has provided a roadmap, but the team should add specific milestones with the time to achieve,\nFor example, there are 100 scenes, the time to complete the first 50 scenes is 1.5 months, the time to complete the following 50 scenes is two months.... this makes the project clearer and easier to measure.", "q2r": 3, "assessor": "z_assessor_998", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Create a film that sparks interest in people outside of Cardano's circle of influence while inspiring them to align with the mission.", "experience": "We have created one of the first large content gated ticket systems on the blockchain with the film \"A Failed Artist\" in 2 months with no external funding.\nFor more info check out https://www.afailedartist.com/\n15+ years combined experience in directing, filming, and editing."}