{"id": 397859, "author": "dposadas", "title": "ADA funded STEM themed indie film", "url": "https://cardano.ideascale.com/a/dtd/397859-48088", "category": 26452, "amount": 50000, "description": "There is a lot of FUD against crypto/Cardano ADA. The power of film has not been tapped to counter this.", "f6_no_assessments": 4, "f6_rating": 2.75, "videos": [], "media": [], "f6_assessments": [{"id": 621, "q0": "The idea of countering FUD with an accurate portrayal of Cardano in an indie film, whether low budget or not, is an exciting idea.  There really aren't the typical exposure issues for a crypto film that there would be for a traditional festival circuit film, the issue would be leveraging it if it were successful across niche crypto markets into something that traditional media platforms would recognize.  But just in terms of being seen and spreading the word, I don't think a film could ask for a more receptive market than Cardano.  It is clear that it is not intended to be a movie explicitly about Cardano or ADA, but rather seeks to subtly layer in Cardano as a piece of the landscape.  Whether that means it is little more than an easter-egg reference or if ADA is an immutable fact of the daily life of the characters is unknown.  As well, how this presentation of it is meant to counter FUD is also unknown, and perhaps of more critical importance, as it is listed as a core problem this proposal seeks to address.  Without giving away elements of the screenplay, it would be nice if the proposer could give a hint-list that indicated the nature of particular FUD messages that it sought to counter.  Charles Hoskinson notes all the time the personal attacks against Cardano and its supporters are some of the worst forms of FUD (the politics of personal destruction, he calls it) and that is a theme that could be woven through a character piece like this.  But something like misrepresentation could also make a good theme...the point is it would be nice to have some idea of the approach without spoiling the story.", "q0r": 3, "q1": "The proposer lists an extensive array of his exposure to the types of principals needed to get small film projects some credibility, including acting and producing experience and connections with some industry insiders that could provide critical leverage.  He also suggests some talent that can be onboarded, one to remain nameless, but others with extensive film and television credits (and in the case of Joel Torres, excellent screen presence).  While most of the proposer's experience seems to be in theater, his production and writing experience seems to be the most relevant and they carry over well, especially to an indie project.  The timetable is tight, with 3 months for filming and 3 months for post-production and marketing, and the budget seems just as tight, though the proposer seems to be pretty flexible here.  The biggest issue with the budget is the confusion around the ability to raise enough funds, what constitutes enough funds, and what is the proper amount to distribute across the budget.  The proposer says on the one hand that they are not asking for the total amount needed, but also says that they can downscale the budget if needed.  The budget breakdown that assigns percentages rather than dollar amounts makes it almost impossible to say whether the $50k requested will be enough to get this project on track, or if the intention is to backfill this funding as needed into a budget sourced elsewhere.  All of this adds up to real risks without much mitigation strategy being provided.", "q1r": 3, "q2": "Delivering a complete film project on this budget and timeline is a daunting task, and the milestones provided indicate as much: show a draft film online by the end of the year.  They say they will be providing updates to the Cardano Foundation once per quarter, which indicates the need for some clarification of the audit process.  The progress reporting will need to be monthly, in order to keep unlocking funds, as it won't all be disbursed at first, so the proposer needs some kind of KPIs in order to track the post-funding progress up until the film is released.  Number of pages of the script that have been filmed is one that could be used, though it can be clunky (a scene could be half a page or, if it had a lot of dialogue, 10 pages).  If a storyboard is completed, or a shot list (camera instructions that allow a film to be shot out of order for maximum efficiency), either could be used as %complete metrics.  Alternatively, the filming could be broken up by location, and progress could be reported as the completion of a particular location.  Regardless of the particular method chosen, the proposer needs to be prepared for constant monthly progress reports to IOG or else the funding will dry up.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 7311, "q0": "The impact of this project is not very clear, and therefore I am not sure that it will align well with the objectives of the challenge. Here, we are seeking to finance audiovisual projects that go beyond youtube, where Cardano already has a strong base of content and viewers, products that pierce the bubble in which we find ourselves and dialogue with traditional media and different types of audiences. With this, we aim to increase the reach of our blockchain, so that more people know Cardano, understand at least the basics about its technologies and who knows, become active members of the community, acquiring Ada, delegating them to one of our pools, etc. From what I understand the objective of this film would be to break the prejudice with Cardano, as the author says in the first sentence of this proposal, “there is a lot of FUD against crypto/Cardano ADA”. What is FUD? Well, from the context I infer that it is really misinformation, prejudice and misconceptions, such as that all NFTs are coined in an anti-ecological way (we know that the way they are processed at Cardano has one of its ideas being ecological, so it doesn't consume as much energy and cause deforestation as people think all blockchains do). Anyway, that would be the goal of the film, and with that it would disseminate instructions about our ecosystem, which would fulfill the objectives of the challenge. The problem is that from the description of the proposal we have no guarantee of how this would be done. The author claims that people knowledgeable in the audiovisual field read and approved his script. But it would be much better, instead of saying that, if he made this script available, so that we could: understand the story, what would be the beginning, middle and end? Is it a traditional narrative? He said it would be cult, but why? And why that would be good, if our goal is to reach the masses with narrations that are interesting and compatible with the widest possible audience. I would also like to know the characters, the climax of the story, and especially, at what point Cardano would enter this narrative and in what way. How our blockchain would be presented to the public, what concepts would be covered within the various that people need to know to understand the Cardano ecosystem (from the most basic things like what is blockchain, cryptocurrencies, a pool and etc to the more complex ones). What kind of narration would this film have (direct or indirect)? Anyway, we were not able to understand exactly the characteristics of the story, in cinema we have a maxim that is \"don't talk, show\" (when it comes to making the scenes happen in the movies) I think this would also fit the case of the proposals for this challenge. It would also be interesting if he attached a trailer. Anyway, I didn't feel sure how this film would impact the Cardano ecosystem and if it would be in line with the specific objectives of the challenge, because in my view there was a lack of information, we only have a synopsis of the film in the auditability, but that doesn't fill the gap of things we need to know. \n", "q0r": 2, "q1": "The roadmap is shallow, the proponent says that more details will be given if the proposal is funded, but unfortunately this is not how it works, in order for it to be funded we need to fully understand what will be done, how and if it will achieve the objectives of the challenge. The script is an indispensable part of understanding the whole, because through it the idea is to solidly visualize the process; what would be needed here is for each of these phases (Q1, Q2 and so on) to be better explained. It would be necessary for the tasks that would compose them to be informed and detailed, I'll give an example: at first, the fundraising and agreements would be finalized. What agreements? With whom, for what purposes? In Q2 the filming would take place, in this part we would need to know: 1) where the filming would take place 2) the filming plan that included what would be shot each day, which scenes, locations, actors, audiovisual professionals and etc 3) the exact dates , to understand how long we are thinking of working. And likewise, the other steps should be better detailed as well. Regarding the budget, 50k is requested, but note that this money would not cover all the expenses of the film, marketing, for example, does not enter these accounts. I didn't understand for sure if this part would be their internal funding (the professionals themselves would pay) or if the money would be raised in another way other than through Catalyst, for example. Regarding the explanation of how these 50k would be used, the proponent makes a division by means of %, for example 10% ie 5k would go to the director. I can't see if it's a fair value because we don't know how many hours of work each professional would have, so it's not possible to trace the relationship between hours of work and price, so I don't know if the value is fair or above the necessary/compatible with the Marketplace. Some expenses, such as “miscellaneous”, could be explained. What do they think could happen unexpectedly so that 5% of the budget was reserved for this? Finally, as far as the team is concerned, I don't think that part is explained satisfactorily. The only person with a very detailed resume is screenwriter Dennis Posadas, he is also the only one who seems to have any knowledge of Cardano. But what knowledge is this? What is your relationship, exactly, with our blockchain? Is he an active member of the community, if so in what way? In this specific challenge, I think it's important to have a balance, logically most of the team will be from the audiovisual area, but it's essential that we have a Cardano specialist to ensure that information about our ecosystem is correctly represented. \n", "q1r": 3, "q2": "I don't think the proposal is highly auditable because the proposer talks about few ways for us to track the progress of this film. He says that there will be quarterly updates on Cardano's foundation, what do you mean? What will be updated, and why only quarterly? Monthly feedback would be more appropriate, I think that 3 months is too long for us to be unaware of the progress of the project. There is also no clarity on how these updates would be transmitted, if it would be through video calls, written reports, infographics... They claim they will also make the film outline available, but I think this is something that needed to be delivered now. , in the proposal itself. It would be a lot easier to monitor the project if it had a detailed schedule, some member of the Cardano community who lived where the movie was going to be filmed (or at least most of the scenes) who from what you can tell, in the Philippines, could follow the project more closely and bring periodic feedback to the Cardano community. It would be even more interesting if that person understood something about audiovisual. Anyway, everything I mentioned so far would be a means of following the process, but we also need to stay in the results. In relation to this, some very abstract expectations are also given. For example, when the movie would be finished and also that some big streaming service like Netflix or HBO is expected to show it, and that millions of viewers are expected. These are all goals, I would say, a bit generic. I would like to understand more. For example, which film festivals does the team intend to submit the film to? If no streaming service accepted to show the project, what would be the alternative? The house of millions of viewers is an ambitious goal, how do they intend for the film to become so popular? We would need to know the marketing strategies to be more confident that this goal would be achieved. Finally, there was a lack of detail, outlining more tangible goals and strategies on how to achieve them, in addition to that they only mention goals about the reach of the film - it would also be important to understand if the spectators caught the message and were interested in Cardano, going after more informations about. It could be measured, for example, the reaction of the public through social media and it would also need to be observed if, by chance, at the time of the film's exhibition, the number of google searches related to Cardano increased, bought more Adas and etc, ways to measure the direct impact of this production on our blockchain. Therefore, I think the auditability is insufficient. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1259, "q0": "The reason I have given a rating of 3 for impact is that this is a product placement proposal. \nThe impact it will make purely depends on the success of the film. But there are no guarantees that it will create an impact for cardano even if the film is a moderate success. \nWe’d be putting all our eggs in the hope of a cult success.\nOne other reason for the rating is the script notes. The script reader has given it an average rating with notes that need to be implemented.\nAlthough I do have to mention that the script readers are not always spot on with unearthing cult gems. \nThis proposal is hit or a miss in terms of impact in my opinion.\n\n\n", "q0r": 3, "q1": "I do believe that the team will complete the project.\nI base my opinion on the fact that the script notes mention how the film can be completed with a comparatively lower budget and the experience on the production team that will potentially work on the film.\nThe reason I give a 4 instead of a 5 is that there is no guarantee of quality. There are many low-budget films being produced but only a tiny percentage get distribution and an even tinier percentage gets noticed.\nThe final reason for the score is that the script writer seems to have experience in stage writing but not as much experience in screen writing.\n", "q1r": 4, "q2": "Films usually are easy to audit in terms of work completed.\nI think the auditability could have been broken down further.\nFor example: \nPre Production:\nWeek 1-4: Script breakdown, finalizing cast and crew etc.\nProduction:\nWeek 4-12: Updates as shooting progresses etc.\nI hope I made my point. Just a regular breakdown of the film production process would be easy to audit.", "q2r": 4, "assessor": "z_assessor_1330", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8200, "q0": "\nProposer states that there is a lot of FUD against Cardano ADA and by producing a low budget Asian STEM indie film he wants to oppose FUD against crypto/Cardano ADA. Because there are no KPIs, it's hard to compare KPIs with challenge setting and proposal is not able to scale and address future challenges. Sending a strong message through movies and videos is a great idea and would certainly have a positive impact on the Cardano ecosystem.\n", "q0r": 3, "q1": "It would be great if proposal had links, for example via LinkedIn, Twitter or a website where we could get information about the team. The question arises whether the people mentioned in the proposal are real? I’d love to see a detailed view of the budget and since the entire challenge budget is limited to $ 150K it’s not reasonable to ask for $ 50K. My advice is to ask for a smaller part of the amount so you can easily join the future Catalyst F9. 10 eth. It is necessary to develop a detailed plan of what and how the tasks are performed and it is necessary to take into account possible challenges and risks.\n\n", "q1r": 2, "q2": "A successful project should have a detailed roadmap with milestone and a time frame within the project will be completed. When KPIs are completely left out, the community cannot monitor the development and success of the project.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Produce a low budget Asian STEM indie film with some crypto to counter crypto/Cardano FUD, and release it as an online video.", "experience": "The Proponent is a book author/screenwriter/playwright/tech consultant. He had an off-off-Broadway NYC play in December 2018. He writes newspaper tech opeds.\nHe was a former Intel robotics engineer and has an EE background. He has a good working knowledge of crypto/blockchain."}