{"id": 398215, "author": "ericdberkeley", "title": "Cardano-centric YouTube-style site", "url": "https://cardano.ideascale.com/a/dtd/398215-48088", "category": 26452, "amount": 48000, "description": "The opportunity to learn more about Cardano and Ada is limited due to the extraordinary amount of noise, misinformation, and FUD on the web.", "f6_no_assessments": 3, "f6_rating": 3.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is very good but I'm not sure it's innovative enough for this challenge. Here we want to fund projects that aim to bring content from the Cardano ecosystem to traditional media and new audiences, to pierce the bubble that already exists in social networks (telegram, discord) and youtube, where we already have a good amount of media content related to Cardano and a lot of spectators. The idea of ​​this proposal is to create a website that would bring together several things, in the proposer’s own words, “a YouTube-style video-based website that has video and information channels, a forum, a Help Desk/FAQ/Knowledge Base crowd-based and a future online store selling products.” The project's differential is that all the information that circulated here had to be proven, so that there were only facts and not opinions. For me, this was the most positive part of the project, and also some moderation strategies such as the fact that you have to pay a monthly fee to comment on the forum, thus avoiding those comments that don't add up and bring false information. However, what I said at the beginning about not being sure if it meets the specific objectives of the challenge well is because spaces would be created here to do things that already exist, we already have several youtube channels that talk about Cardano, including official and extremely reliable channels like the IOHK channel, for example. I don't see much need for us to create a new website to post videos about our blockchain if we already have such a strong community on youtube. The part of the store, which will sell NFT in the future, was a little abstract, what would be sold once it opened? Who would get the money? The forum and FAQ part seems to me the most interesting, in my opinion if the site focused on this it would be a more valid proposal, because in more than 1 year as an active person in the Cardano community, with CA at 4 funds, I have never heard of of some site that was a heavily monitored forum and FAQ. I think the debates/questions and answers take place on the community's own communication channels, such as telegram and discord, but I don't know if there is a space dedicated solely to this and that is well organized. Therefore, I partially agree that this proposal has a positive impact and aligns with the objectives of the challenge, as I explained, here it is intended to develop things that already exist and are well consolidated, while a certain part of the idea is indeed innovative and seems to me to be very useful for Cardano. \n", "q0r": 3, "q1": "The proposal does not have a roadmap per se. What we find here is an explanation (quite extensive) of what would need to be done, what activities would be developed so that together they could compose the project as a whole. However, this is not in the form of a timeline, there is no phase division or notion of time here. It would be necessary for the proponent to divide this explanation into smaller parts, according to the phases of the project, and they would need to be associated with some notion of time: phase 1 would last 4 months, for example, and would take place between June and September 2022. Ideally, these phases would consist of a list of tasks and each task should also be located in a specific month and informed how long it would take to complete. Therefore, I disagree that there is a good visualization of the process here. It is explained what would be done, but not in an organized way and associated with the passage of time. Regarding the budget division, I think this explanation is much clearer, I can understand why 48k was requested and how this money would be divided into parts. I think that in relation to the salary of the professionals involved, there could be one more explanation, since it corresponds to almost half of the entire budget. It would be important for us to know how many hours per week they would work, that way we would know the price of their working hours and we could analyze if it is compatible with the market or above. It is very interesting that they included the potential income of the project, this is something that I do not usually see in the proposals and it serves to have a visualization of how this money (48k) could generate return, reinforcing the idea that it is an investment and not a spent. And finally, about the team members, we only have information about the bidder, which worries me. As I understand it, he intends to hire other professionals to compose a team, but in this case, would he still select them? I would like more clarity on this matter. However, speaking of him, there is a very rich and extensive detail about who he is, previous experiences and also his linkedin profile, through which we can see his work in practice. However, I am also concerned that he did not clarify his relationship with our blockchain, how he understands Cardano, his experiences in the ecosystem, etc. For me, it is essential to always have at least one person on the team who is highly knowledgeable about our blockchain technologies, and this is not clear. Therefore, I think the feasibility of the project is good, but it still leaves many things to be desired and gaps to be answered. \n", "q1r": 4, "q2": "I disagree that the proponent presents objective and effective ways to monitor both the progress and the final result of their project. The measurement of progress he suggests is abstract, “meet the milestones to be set for website development and launch”, what are these milestones? It would be necessary that gradual objectives were outlined, so that the community would be able to progressively follow the progress of things. I think that with the creation of a detailed schedule this would be more possible, the proponent could prepare reports at the end of each month with information on the main advances, in a language accessible to all and forward it to the Cardano community through one of our communication channels, as I mentioned earlier in my review. Another alternative would be for a member of the community, who understands well the technologies involved in this project, to be able to follow the development of the stages directly with the proponent, and bring this feedback to the rest of the community. Regarding the results, the way in which the proponent suggests measuring success is very comprehensive, it would be necessary to establish more specific goals, such as the number of posts that move the forum, views of the videos attached to the site, etc. In this way, we would have more solid ways of monitoring, even numerically, the possible success of the project. I suggest that the proposer, who proves to be extremely capable and qualified even for the elaboration of such a technical proposal, revise this final part of it, in order to bring more details that can improve the quality of auditability by the Cardano community. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This proposal gives me an uncomfortable feeling, as if there might be a gang of rowdy Web2.0s loitering just down the street.  It is a proposal for a somewhat Brobdingnagian media platform, and I find myself stumbling over several concepts as they are approaching me.  For example, the proposer suggests that NFTs could be a part of the platform \"assuming that market stabilizes and develops credibility\"...the market's credibility is a function of the underlying protocol, not the behavior of its participants, and cNFT as an onchain asset is a near perfect manifestation of an NFT protocol.  The tripping hazards continue as I try to duck out of sight:  \"trusted MSM news sources to populate the platform\", \"membership fees to access engagement in a forum\",  \"in-person IT support and helpdesk for issuing tickets\", and then there is this doozy, which makes me wonder if I have accidentally run down a dead-end alley:  \"This gives editorial control to trusted staff and community members to shape, form, and control a fact-based flow of information with a singular voice.\"  Am I reading too much into it?  As a professional approach to a media platform, this proposal shines:  it is clear and articulate, the goals are well laid out.  But I can't shake the impression that these protocols, while probably highly successful for centralized command-and-control of a narrative for protecting a brand, are woefully uninspired for helping us realize the distributed potential of Cardano.  The community curation and platform for generating content, maybe I can get behind that (if it isn't behind too many gatekeeping functions!), but the intimations behind a top-down imposition of narrative...I don't know.  I want the FUD and manipulation of the hearts and minds of curious crypto onlookers to get corrected as much as anyone, but I don't think the answer is to accidentally endorse the tactics that make the manipulation possible.", "q0r": 3, "q1": "I indicated above my issues with some of the principles that I feel underly they approach being taken here, but where I really have no complaint is in the plan and qualifications to carry it out.  The proposer lists an impressive resume and indicates excellent knowledge of the building space.  The budget is sensible, if a bit light on the development side and a bit heavy on the human support side, and it is clearly laid out alongside a detailed plan with actionable items in an order that allows us to easily picture the project start to finish.  And this makes sense as the the proposer is using previous experience building a similar platform for an autonomous driving specialty site (which isn't currently available to browse), so a port of the specs and protocols would be super efficient.  I do note that I see no evidence of opensource here, and the proposer's earlier history working on the HSX site indicates that it is probably meant to be that way.  I personally consider those old HSX protocols to be an example of the WallStreet led financialization of Bitcoin, with derivatives and rehypothecated assets, and a lot of the culture around things like that was the opposite of opensource...lots of legal structures to shield intellectual property, lots of isolation and milking of innovation...Hopefully those principles are not fellow travellers anymore, as  a community based resource like this really needs to be fully opensourced, for sustainability if nothing else.  I think the proposer has successfully identified sustainability costs as the biggest technical risk of the project, and his suggestion of distributing the work to the community is a wise approach, though it does threaten some of the top-down control that the platform seems to be relying on.  If there was a pledge here to opensource the project, I would consider the mitigation of sustainability concerns to be signed sealed and delivered.", "q1r": 4, "q2": "The professionalism and quality of the proposal do much to allay my worries that this might be a hard project to keep track of or to efficiently audit.  While no specific roadmap is included, the general timeline indicates several natural audit points: initial front end UI/UX deployment, integration of plugins for most of the functionality, such as the forum and helpdesk subscription.  As each of these things are completed, they can be added to the development progress reports.  It would be good to see expected KPIs for measuring the noted \"go/no-go\" decision to take the site out of beta and let it roam free.  Is that expected to be a decision based on early participation, or is the idea that a maintenance budget will be able to be forecasted at that point, and future funding needs will be the determining factor?  The need to onboard a healthy cohort of members (60+) for some of the platform's functionality is a possible indicator that a good connection and networking scheme will be in place with the community and that communication and tracking will be feasible.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal contains a clear description of the problem it intends to solve and a potential solution to address those problems.\n\nThe author presents his idea for the pointed problem in detail. In a way, there is a closeness between the proposal and what the challenge intends to solve. However, there are some aspects that could be considered, such as: (1) what strategy could be adopted so that the platform content reaches traditional media viewers (2) how the author intends to transform the created platform into a multi-stakeholder initiative. sector.\n\nFrom these two points, we can see a greater correlation with the challenge.\n\nOne of my interpretations was a possible conceptual distance between what the challenge establishes as a priority and the proposal presented here. While the challenge calls for creating a bridge between digital media and a variety of media and platforms, the proposal is focused on building a single platform with a strong commercial bias.\n\nThis commercial platform is necessary to support this project, but another interesting approach would be to encourage the involvement of different professionals to develop audiovisual projects together.", "q0r": 3, "q1": "The author indicated his experience and reference, which shows competence to develop the project. In addition, he clarified the skills and team needed to implement the proposal.\n\nThe budget was presented in a structured way and it makes sense to implement the project. One detail that must be considered when evaluating the proposal is the intended business model. The project here needs an ongoing income to stay active and relevant. The existence of sponsors and/or paying customers is necessary.\n\nSome revenue generation possibilities were presented, but as mentioned earlier, in this case an assessment of the business model is necessary to ensure viability.\n\nThe plan and schedule could be more detailed, perhaps with an attached file. Although a reference has been presented, it would be important to understand the detailed steps for delivery.\n\nThe author appears to be aware of the risks involved. He clearly presented his risks and what it would take to mitigate them.", "q1r": 4, "q2": "The author clearly presents his goals and plan for the project, but the same was not true of the auditing aspect.\n\nThe information provided is more about meeting a schedule step than the availability of means to help the community audit project progress. This is a sensitive point and one that can be easily adjusted, as the author was very advanced in the previous steps.\n\nRegarding the KPIs, the author did not present valid indicators and metrics for monitoring and evaluating the project's success. As in the previous topic, in this case it is also possible to complement the proposal to meet this requirement.", "q2r": 2, "assessor": "z_assessor_1818", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Establish a 6-month pilot ADA-specific fact-based news & info video website. Showcase unbiased MSM and crowd-sourced info to educate newbies", "experience": "Established same at Max Keiser's Hollywood Stock Exchange. Wrote articles for the official HSX site, built related website, and wrote a film-industry newsletter which helped establish HSX credibility. Proposal is modeled after web dev efforts in the Full Self Driving (FSD) space"}