{"id": 398384, "author": "andrewgoodwall", "title": "Youth user generated content", "url": "https://cardano.ideascale.com/a/dtd/398384-48088", "category": 26452, "amount": 22500, "description": "Youth across the world are unaware of Cardano, the blockchain, and opportunities that exist, due to lack of credible video content.", "f6_no_assessments": 9, "f6_rating": 4.62962962962963, "videos": [], "media": [], "f6_assessments": [{"id": 2547, "q0": "One huge challenge within the Cardano ecosystem and the world of blockchain technology as a whole is the education necessary for those new and even veteran users to progress equally. Goodwall is solving this by eliminating the barriers with the use of a well designed mobile application which brings years of combined expertise in accordance with Youth Council members to continuously forge new paths of direction in order to deliver the proper education and knowledge needed. This Impact on the entire Cardano ecosystem is beyond crucial for the future generational growth. It's clearly articulated by the proposer that this group of Goodwall members will be given incentive to share their blockchain experiences which \"include monetary prizes, access to further blockchain education courses, mentorships, etc.\" The proposer understands raising a child takes a village, and a strong Global village within Goodwall is a sure fire way of producing, collecting and analyzing the most useful information useful to those without prior knowledge of the ecosystem that is Cardano. In doing so, the proposer emphasizes the multilingual teams from around the world to diversify and maximize the impact to a scale not scene thus far in blockchain education. With already 2 million members on the Goodwall mobile app, key objectives from the proposer for 1 million impressions, 30k engagements over a course of 2,000 video entries from users that clearly demonstrate Cardano technology use-case solutions is very likely to not only impact the existing user base, but for future adoption into the community. Scaling up the amount of users to Goodwall, there's a clear indication from the proposer that solving the problems of communication, or lack there of is of the utmost importance to ensure all the content presented is peer reviewed by community managers to allow for quality content for the Cardano ecosystem.", "q0r": 5, "q1": "Diving further into the member's expertise, with a combined 40+ years experience, and an already engaging, successful launch of the Goodwall application, it's clear the proposer has presented a well established team to accomplish the goals set forth within the timeline. The shared Linkedin profiles of each member is a clear indication of professionalism and diversity within the team's overall goals in mind; communication of Cardano technical aspects as well as educational content for it's user base to learn and grow within the ecosystem of blockchain on a global scale. With each member having more than 500+ connections, the source of knowledge and experience is perhaps the best established group of individuals presented to Project Catalyst. The proposer has given a series of detailed solutions to stay on course throughout the timeline in an identifiable manner in which all items can reasonably be completed and any outsourced materials that might present themselves in the future of the program; user based submissions and verifiable content reviewed. Having such a diverse team from a multilingual standpoint, this proposal clearly has a team capable of producing excellent results from the funding provided by PC in hopes to help motivate and excite the next generation of young entrepreneurs and like-minded individuals coming to Cardano.", "q1r": 5, "q2": "The proposer has implemented the proper links and tools which will be used to measure the KPI/Metrics of the problem solution with the use of Google.docs to have a clear and public report of what's to be accomplished within the proposal's milestones. Having the application data available, it's easy to see the Impressions from it's user's and scale the demand of engagements while video/photo of program submissions are being made. All of which proposed in the timeline can be seen by Project Catalyst members to follow the progress of the team's challenge all in one place. With a targeted response from the community engagements, a minimum of 2,000 entries are being monitored and reviewed to successful apply these experiences to mobile app for the new youth of tomorrow to learn and grow from others. These publicly shared documents will be the tool needed to assess the milestones presented from an identifiable means to measure the proposals overall goals to solving the problem, ensuring the growth of the Cardano ecosystem as well as future members young and old.", "q2r": 4, "assessor": "z_assessor_1529", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 7333, "q0": "I really liked the idea and I think it fits very well with the specific objectives of the challenge. Here, we are proposing that media content (videos, photos, audio, etc.) be created on Cardano, and that this content circulate on different platforms that escape from places where Cardano already has a good circulation of content and a good audience, such as for example , youtube. The idea is that, with content circulating through new platforms, new audiences are reached, thus increasing the expansion capacity of the Cardano ecosystem. This proposal is about a platform called Goodwall, which is focused on young audiences and educational content, from what I understand. The advantage here is precisely that, in addition to posting videos, this platform has some different features from youtube itself. This can be seen through the excerpt: “A constant dialogue and feedback collection is carried out through a number of means, such as: dialogue with the Goodwall Student Council, a group formed entirely by young people that has an advisory and consultative role in the Goodwall's governance and strategy; ii) regular communication between Goodwall's Community Management Team and young users of the platform through chats, pages and posts; iii) focus groups held regularly and composed in order to provide a representative sample of the target audience; and iv) post-program surveys to assess performance and impact achieved”. I confess that, the first moment I read the proposal, I thought: what's the point of releasing videos about Cardano on a platform that is much less known than youtube? However, when I got to know these features, I was convinced that it can be an impactful initiative, as this bridge and communication between the users of the application is the differential in relation to youtube. I also think that the project fits well with the objectives of the challenge because the proponent explains that young people would be encouraged to create and submit content of their own creation on blockchain; this is very positive because I believe it can generate a boom in relation to the subject, due to the fact that this content would be encouraged through prizes, financial rewards or access to more educational content. I think it's a great way to captivate this target audience to learn and mobilize in relation to the cause, after all, everyone likes to receive these rewards, let alone if they are in cash. Another positive point that I see in this proposal is that the proponent is very aware of the possible problems that he will face during the project, and already proposes solutions for this, which demonstrates a lot of maturity and planning. The only negative point I found here is that the proponent does not say exactly what topics within the blockchain universe would be addressed, in what order and why, if this were said, it would generate a more solid understanding of what will be created here in the future. Other than that, I think the idea is very good, and deserves to be carefully evaluated for possible funding. \n", "q0r": 4, "q1": "Regarding the script, I think this part is well executed, but it could be even more detailed. For example, about program preparation, we know that this would involve the following activities: User Journey Design + Promotional Asset Design + Video Shooting and Editing Challenge + Education Series Video Shooting and Editing + Education Series Video Shooting and Editing Speaker Session Videos + Landing Page Design. We also know that all of them would result in a total time of 8 to 12 weeks to start, develop and finish. However, the information could be passed on more precisely here. For example, we could know how long each of these activities would take, exactly (or approximately) to develop. Let's see, user journey design, how long does the team intend to work on this? And what exactly would that user journey be? It would be positive if, in addition to a more precise time determination, the proponent attached a short explanation about these parts, because this way we would understand more accurately each step of the process and this would result in a better understanding of the whole. Now speaking of the budget, something similar happens. The total amount is divided into a few parts, but these parts are gates of many other small parts. Let's exemplify to make it clearer: “Creation of Program Material - Creation of promotional and non-promotional assets - social media, videos, landing page, content, profiles, newsletter, etc: $3785”. How much would go towards creating promotional and non-promotional assets? What would these assets be? What social media would be used to publicize the materials created? How much money would go to the newsletter? I think each of these parts could be better detailed, because we know the value that will encompass all these parts of the project, but we don't know what each one individually would take in relation to this larger piece. I believe that both the script and the budget are good, but they could be better if they were more specifically detailed. Finally, in relation to the team, I think this part is excellent. We know a lot of information about each member of the team: their names, professional roles, previous experiences and the responsibility they would have, exactly, in this project. I think this is all very essential so that we have a solid view of who we are dealing with, generally in the proposals the proponent only informs the name and previous experiences of those involved, and in this we also have the definition of the exact role that each one would play in this project, which gives us a very deep understanding of how this team works. \n", "q1r": 5, "q2": "The proponent suggests 3 ways we could track the development of the project: impressions, engagement, and challenge submissions. I think they are really good indicators to see how this project is developing in practice, but it is not clear how this information would be accessible to the Cardano community. In my opinion, it would be interesting if the team carried out a monthly survey on these variables and made the survey results available to the Cardano community, through any of our various communication channels, such as telegram or discord channels, in meeting rooms. debate after Town Hall and etc. It is up to the team to choose the most appropriate means of communication to convey this message. It would also be important, in my view, for us to know how their work routine was being developed, that is, did everyone manage to fulfill the tasks planned that month? Did everyone work the hours (hours) that were agreed? If there were problems and/or delays, how can these be overcome and compensated? In addition to understanding the achievement of partial results, it is also necessary to monitor the tasks that are being carried out so that such results are achieved. Now talking about the success scenario, in other words, the final results, I think this part of the proposal turned out great because the proposer gives us numerical data that would be used to measure success: “1 million impressions + 30,000 appointments + 2,000 entries challenge”, and also qualitative. It would be important for the proponent and his team to seek to understand how these young people who had access to the created content got involved with Cardano, if they followed their studies in the blockchain area; it would also be super interesting if some of the content generated by them were shown in Town Hall, because then we would see with our own eyes the fruits of this initiative. Finally, I would like the proponent to carry out a qualitative research on the results of the project, which would allow us to understand beyond numbers how this has all impacted young people and also the Cardano ecosystem, if we actually have new active members and how they relate to our ecosystem. This data could be presented at a Town Hall meeting, as well as a small snippet of content produced by young people, as I suggested above. I think the auditability is almost perfect, it just lacked a little detail. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 10730, "q0": "This Proposal is novel in F8: Film + Media (FAM) creatives unite Challenge. The proposal wants to create a playground, a starting point for young people worldwide to know and start their journey with blockchain. The proposal leverages Goodwall, a large work and education platform with 2 million members across 150 countries. The project team has a lot of experience in creating Programs on Goodwall. The proposal wants to make a Program/Challenge on Goodwall to introduce Cardano. I believe Proposal if implemented in practice, will have a positive impact on Cardano.\n\nThe proposal provides key targets (1 million impressions, 30,000 engagements, 2,000 challenge entries). In the Marketing industry, there is a concept of conversion rate, assuming this rate is 10% - 20% (depending on industry); I believe from 30,000 engagements, there will be 3,000 - 6,000 people interested and learning about Cardano. A percentage of people ( in 3000-6000 people above) will join the Cardano ecosystem (search for career opportunities, join Catalyst, write proposals, become a CA... for example). For a proposal, these numbers are a positive result.\n\nI searched the keyword Cardano and the names of a few other blockchains on Goodwall, but there is no such content. So, if Cardano is the first blockchain to be introduced on Goodwall, it will make an excellent first impression in the hearts of the young, future generation of the country. I believe the proposal is suitable for Challenge, and the main goals are ideal for Challenge settings", "q0r": 5, "q1": "Regarding the roadmap, the Proposal provides a plan consisting of 3 main stages, each of which explicitly lists each job with actual time to complete. Looking at the roadmap, I know what the project team does, one by one. I find the proposal to provide a good roadmap. However, I would expect the roadmap to list more videos the team plans to make, for example:\n\n- Challenge videos: 5\n\n- Educational series: 6\n\n- Speaker session videos: 4\n\nRegarding Budget, the proposer fully lists each item. Looking at your presentation, I believe your team has a lot of experience implementing such Programs. However, to be better, in some Budget sections, the proposer should list in more detail, for example:\n\n- the proposal's plan: make 4 Speaker session videos,\n\n- Speaker salary for one video (assuming the video is 30 minutes long): $300\n\n=> Speaker salary: $300 * 4 videos = $1200\n\nThis specific presentation will make it easier for the community to assess the reasonableness of the Budget items, thereby determining whether the proposal has enough funding to accomplish the goal.\n\nRegarding the Team, the proposal has a strong team; each member has responsibilities in each specific job. All members have Linkedin links for community reference. I believe the team has enough skills and experience to complete the proposal.\n\nThe Proposal has a complete list of associated challenges/risks, with a resolution for each challenge/risk. I find these workarounds reasonably doable. The team's risk management skills are good; I appreciate this.", "q1r": 4, "q2": "The metrics/KPIs that define Proposal's success are obvious. The Proposal clearly describes, without ambiguity, the definition of KPIs (Impressions, Engagement, Challenge Entries). \n\nIn addition, the Proposal has a professional report upon the completion of the project. I have seen the sample report that the team did before; it is detailed and precise. In addition, Proposal provides a Google form for the community with recorded information and documents. I appreciate this willingness and transparency.", "q2r": 5, "assessor": "z_assessor_998", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 643, "q0": "When it comes to diverse, decentralized growth networks, it is a fundamental truth (whether network participants recognize it or not) that education and learning nodes are the first things to grow in sustainable ways.  So it says something when an already well established network participant boasting millions of proven members steps into a new role and relationship and says \"Lets start with education\".  That indicates to me that the team behind the initiative \"gets it,\" and in this case, that is the Goodwall team.  If you aren't familiar with Goodwall, it is sort of like a LinkedIn that prioritizes early growth and opportunity, and thus focuses exclusively on young people (think: students, graduates).  What they are proposing to do here is to leverage that worldwide youth community to create a library of content revolving around their learning, experiences and ideas within the Cardano ecosystem.  There is really too much to describe in terms of how this looks, so I encourage voters to check out the project they recently conducted centered around youth opportunity in Ghana (https://youthshapeghana.goodwall.io) to get a feel for what a Cardano program could look like.  And keep in mind that the Ghana effort reached over 4.2 million people.  A LOT of that engagement revolved around entrepreneurship, which translates to a LOT of Project Catalyst engagement, especially proposals.  On top of creation of a ton of emergent onboarding material and the actual onboarding of what could be a huge cohort of proposers, there is also the additional scaling potential of Goodwall adopting Cardano to build out DAO style governance for its in house and community driven protocols around things like program selection, which could additionally serve as a model for many of its member to adopt their own approaches to DAOs...  All in all this proposal seems like the tip of an incredibly robust opportunity, that is a direct hit on decentralized media generation.", "q0r": 5, "q1": "The team behind the proposal is well equipped and backed with tools and resources.  With a recently completed program that can only be described as spectacularly successful, the chance to execute a Cardano program is very easy to envision.  They are extensively staffed, with every major role you could imagine for a project like this:  there are leads for marketing, social, design and more.  The budget is surprisingly reasonable for the proposal, but it makes sense as the team is salaried and supported by Goodwall, so the requested funds are all targeted at the specifics of running the new program itself.  The timeline they provide looks identical to their Ghana project, with an implementation phase that is a bit shorter at 3 months, and then a full four months for the \"challenges\" to run, with a month or so to gather up and do a retrospective on the results.  I would advise the proposal team to maintain close communication with Project Catalyst during the design period, as the Goodwall challenges and the Catalyst challenges could be in-sync and perhaps even both taking cues from the other in their categorization and design.  Each of these phases is characterized by 4-6 steps that follow-on logically from eachother, and plot a course to completion that is easy to visualize.  They do a fantastic job of mapping the basic risk management of the project in a professional way, but special attention needs to be paid to the \"Fake news\" risk.  Cardano FUD will likely be the most significant deleterious behavior that is faced by the program, so a robust approach to respectful community guidelines (which appears to be in place on Goodwall) as well as a solid base of factual resources for their moderators to rely on for \"fact checking\" the FUD will be critical.", "q1r": 5, "q2": "The plan is well laid out and should be easy to track.  The early portion of the project will be harder to track than the latter, and will consist of updates regarding design deliveries for the program (landing page, protocols, etc) along with creation of the challenge videos and education materials.  As noted above, it would be good to include a deliverable of the resources that will be the basis of \"fact checks\" in the community (especially if they wish to get good feedback on the resource before leaning on it).  Once the challenge portion of the program begins (and in the marketing leading up to it) the team plans to track the number of times the Cardano educational (etc) resources are posted amongst their community (impressions), the number of likes/comments that those impressions drive (engagements) and the participation in the challenge protocols they design (entries).  These numbers seem somewhat audacious at first glance:  1 million impressions?  2000 entries?  But after diving into the Ghana project they did, I think these numbers may actually prove to be quite modest...", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 6, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3517, "q0": "This is a good proposal to engage youth in blockchain and the Cardano ecosystem by inviting youth itself to create content. This proposal approaches an important target audience, as young people are the ones who have higher chances of spreading knowledge about technology.\nHowever I am not sure the incentives mentioned would be enough to motivate young people to create said content, and there should be some kind of quality guideline. The proposal does seem to recognize those risks, which is a very positive thing.", "q0r": 5, "q1": "The timeline is achievable and well-thought. \nThe budget is a bit high for this campaign, and maybe a more detailed budget would help understand if this amount could be lower. At the same time, I am not sure the US$ 500 for incentives would be enough, as lack of engagement is a risk, and increasing the budget for incentives could help to mitigate it. \nI believe there should also be some budget for unexpected costs, which is not clear to me that it is being considered.\nThe team is strong and I like how the proposal included what each person will be responsible for.", "q1r": 4, "q2": "It seems that the team is already used to auditing their project, which would be a huge help for this project. I also like how there are clear KPIs and the numbers they expect to reach. I think there should be some milestones and routine monitoring to make sure that the project is on the right track, and it is not clear to me that those regular monitoring are being considered. Overall, this seems like an auditable project.", "q2r": 5, "assessor": "z_assessor_1659", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4619, "q0": "The target age group(16-24) is note-worthy. Most of them beginning their goal of pursuing their academic goal or professional goal. Their community of 5million+ a more channelized approach to the FAM. As opposed to more generic approaches by other media platforms, this platform educating the youth with adequate academic background to understand the technical aspects of blockchain and incorporate Cardano and contribute to its immediate growth.", "q0r": 5, "q1": "A team of 7 with average experience of 7+\nyears(5 in program managing 1 in marketing and 1 in product design). They should be able to deliver the outputs proposed. Their website does show 65+ team members, they should be able to help (if needed). Additional info:\nThey have partnered with UNICEF to spread awareness to youth in a seven week program(as er their attachment). They are funded by European Union Horizon 2020. The website is well designed The blog posts are very informative and well written. They have a team of 65+ and 5million+ user base. This could be a great platform to increase Cardano's influence in the academic and startup space.", "q1r": 5, "q2": "2000 videos, 1 million views, 30000likes/comments. Well designed documentation of the whole process. Precise and concise auditable goals.", "q2r": 5, "assessor": "z_assessor_1748", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 5274, "q0": "First I have a different opinion from the Proposal on \"Problem statement\". There is no shortage of trustworthy content in my opinion. Quality content abounds on youtube, websites, and community groups. Youth across the world are unaware of Cardano, the blockchain, and opportunities that exist because they are unaware or fully aware of them. But the solution of the proposal is to promote research and content creation about blockchain, which solves the \"Problem statement\". I found it to meet the goal of the challenge, and I like the idea. Goodwall is a large and reputable education and knowledge-sharing platform with over 2 million members in over 150 countries. Organizing the program to encourage Goowall members to create content and share with other users about the Cardano platform. I think it will have a strong and positive impact because it can reach a large number of people. and deep understanding. Challenges and risks are also scrutinized.", "q0r": 5, "q1": "The plan provides a clear way to accomplish the goal of the proposal. The plan has enough work to be done to follow each stage and the set time. I have no reason to ask for anything more. The budget given has not been detailed. It would be nice if the team could present specific tasks so that the reader could know the cost allocation for each job. (example creating program documents: video production: 100$ x 10; website: 500$; Message board: 200$ x 20; ...) .\nThe team has a lot of experience and appropriate professional knowledge to perform well the tasks of the proposal. Each member is assigned responsibilities that are specifically listed along with a description of experience relevant to the position held. Each member can check the information through the LinkedIn link. I am very impressed with the information about the members and the clarity in assigning responsibilities to the members. I believe the team is capable of implementing the stated plan well.", "q1r": 4, "q2": "Anyone interested in the results of the project can view the report through the google directory. A sample report is attached. I like the way you presented the sample report. It is clear and full of data. Specific KPIs are provided. There are metrics to determine the success of the project. the team has provided enough data and data so that we can understand what will happen. This makes it easy for the project to be tested. The resource sharing is very good raw footage in addition to the benefit of avoiding unnecessary costs. It also makes the project easy to scale for newcomers and verifiable through the amount of shared footage.", "q2r": 5, "assessor": "z_assessor_1908", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5393, "q0": "This proposal not only addresses the challenge but effectively relates to all aspects of the challenge specifically. The project incorporates multiple media platforms in a way which will reach the largest target market. Furthermore, it is a multimedia project which focusses on sharing knowledge and insight and gives various people a chance to not only share information, but also learn from others (whilst acknowledging and challenging the problem of fake news). They have placed an importance on having multilingual teams around the world, thus the information is even more accessible. The project works on a basis of multiple streams of content creation and specifically addressing and teaching Gen-Z about Cardano, being part of Gen-Z myself this grabs my attention and I know this would be an effective manner in which to share information to my peers, especially because it does not require a lot of admin on the receivers side. They will also be \"promoting the use of shared resources, and will create a Google Drive folder to be used by the entrants. This folder will contain raw footage to avoid unnecessary costs and CO2 emissions.\" This shows how they have actively and successfully addressed every aspect of the challenge to convey the innovative ideas. It is evident that the project will open gates for education and inspiration as it allows for open communication and promotes innovative ideas to be shared (as it is a very social platform). The diversity and variety in the partners also echo how there is clear collaboration between creatives and professionals  and as mentioned above, the accessibility of the platform allows for an enrichment of the Cardano ecosystem. The aim of the proposal also parallels that of the challenge its its ultimate goal to educate and grow knowledge about Cardano using multimedia content and in a way in which the content is understandable. It is evident that this proposal has been well thought out, and all aspects have been thought of and addressed. I would love to use something like this to learn more  about the crypto world and the proposal promotes enthusiasm about the possibilities within the youth. It effectively targets a gold mine of opportunities that lie within the youth and Cardano.\n", "q0r": 5, "q1": "The foundation of the proposal is already set as Goodwall is already a thriving application which promotes similar ideas portrayed in the challenge (namely a sharing of resources and information, amongst other ideals shown in the previous assessment note), thus success can be expected. Furthermore, there is a detailed timeline which indicates that there is a clear and focused plan for the use of funding and a clear time frame for each component. The proposal is also impressive as it not only shows a detailed acknowledgment of the possible challenges but also a possible solutions, indicating the proactive and dedicated nature of the partners which are all vital to ensure success. Moreover, the various partners cover numerous aspects of the proposal and have been in their respective fields for a long time, also indicating probable success of the project, if carried out.", "q1r": 5, "q2": "The proposal is detailed and thorough, it provides an in depth look at the goals of the project as well as a realistic timeline on how the project will be conducted. It is evident that the partners are passionate and provide numerous resources to show this, however they are also professional in how they consider numerous aspects of the project. They also provide a way in which the success of the project can be measured and go a step further as to define what the different levels of success, for the project, mean.  the extremely detailed budget breakdown also shows the level of competence in not on the idea, but the partners too. ", "q2r": 5, "assessor": "z_assessor_1966", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8248, "q0": "This proposal's idea is great, it identifies the problem addressed in the challenge, to attract more people by the media channel, especially target generation Z, the future creative generation which is my favorite part of this proposal. Goodwall is an app that already has audiences from all over the world. This is one of the advantages of the team. However, The proposal is written in a detail but still in a very general idea as the proposer aim to educate the youth about blockchain but the team's experience is non-blockchain background, I am a bit concerned about the content quality. In case you can recruit more experienced people to join the team, the proposal can have a very big impact on the youth and make them realize the application of blockchain to their everyday life. My suggestion is to build the content on more platforms like Tiktok as it is a great source to easily approach the youth. ", "q0r": 4, "q1": "There are some points that make me keep a neutral opinion over the feasibility of this proposal. The core team with detailed descriptions with a marketing and event planning background will help generate good visual videos, landing pages, events and enhance the reputation easier but there is a lack of people with blockchain technology experience, hope you can build a solid team after getting funded. Still as mentioned in the impact session, the proposal does not breakdown in detail the content of the video series, it is mentioned blockchain education in general. It will be more persuasive in my opinion if you have (maybe only a draft) details of the video content. The link for Goodwall definition is provided. Regarding the budget, it is broken down into reasonable sections. But to gain more trust, you can divide them into smaller pieces. For example, how can your team calculate promotion fee will be $3,6k. There is a summary roadmap of 3 stages with a total of 32 weeks, I am also concerned about how many videos does your team plan to have in the first stage. There are risks foreseen by the team with suggested solutions. In my opinion, this is a wonderful idea to be actualized and if it is put a little bit more effort in the details. It will definitely get funded :)", "q1r": 3, "q2": "The proposal is definitely can be auditable. KPI for successful vision is provided as well as a report link to track the progress, the videos will be uploaded to the mobile app. If the team can provide more reference links and resources that can be used to build up the content, it would be much more wonderful. Lastly, I would like to kudos to the team for this wonderful idea Goodluck to the team with this fund and hope to see you more in the ecosystem in the future.", "q2r": 4, "assessor": "z_assessor_659", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Educate youth on the basics of the blockchain via experiential learning videos, and build user generated content from like minded youth.", "experience": "Goodwall is a mobile-first platform with 2M+ members across 150+ countries, guiding youth aged 16-24 through the world of education and work. Goodwall has hosted a number of wide-scale programs and challenges on the platform, with a recent program reaching 4.2M+ youth in Ghana."}