{"id": 398671, "author": "donbrasil", "title": "Cadano UNE Brazil Branded Marketing", "url": "https://cardano.ideascale.com/a/dtd/398671-48088", "category": 26452, "amount": 30000, "description": "We believe that the biggest problem in Brazil is access to information, accessibility and low union of the existing community.", "f6_no_assessments": 5, "f6_rating": 3.2, "videos": [], "media": [], "f6_assessments": [{"id": 7338, "q0": "I think this proposal can work but it is also quite risky. The idea is, from what I understand, to create animated video content that teaches the public about Cardano and its technologies in an accessible way, and also promotes actions on the street with well-known personalities, in order to draw the attention of those who pass by; while these actions were established, video fragments would be recorded in order to compose a short documentary to be shown later. That's what I got from the project. In theory, I think it's something quite innovative, different from what we see in the other proposals (at least so far) of this challenge, as this project promises to promote a further level of interaction between the team, the public and what Cardano is all about, mainly through face-to-face meetings. However, a number of factors concern me here about how this project would look in practice. We know that these meetings would take place in Brazil, but it is not specified in which cities, much less in which streets, in which parts of the neighborhoods, etc. I think it would be important for us to know the exact location of these events, as it is a crucial point for the success of the project. It would be necessary for these meetings to be held in busy but at the same time safe places, so that the team could use their photography and sound capture equipment in a carefree way, for example, but at the same time they were busy enough corners for it to be possible. interact with a good number of people. Another thing, I am a little in doubt about whether it is really a good idea to promote these events in such a spontaneous way, I think it can go very well or very wrongly, because 1) people are usually in a hurry, they are not available to stop and learn about new things as they go from one corner to another, especially if we're talking about big cities like São Paulo and Rio de Janeiro. How would the team be able to attract these people, keep their attention? 2) I think it's already complicated to do a street action in relation to well-known issues, for example, here in my city I've been out on a Sunday for a walk and saw a campaign to raise awareness of animal rights. It was people handing out flyers and calling for conversation, and there wasn't much audience retention. I am unsure whether people would want to stop in their tracks to hear about something that is unknown to most, and also why people still have a certain prejudice towards blockchain. Thus, the question remains whether they would really be interested in participating in the actions. I think that if the team had explained better how they would do these actions, for example, who would these well-known people, musicians, artists, etc., be that they intend to hire? How would these personalities be educated about what Cardano is and how would they get that message across to the public? Apart from the participation of these well-known people, what else would make up these events? Distribution of pamphlets, promotional materials? What is the content that the team intends to record from these moments? We have to take into account that most people do not feel comfortable in front of the cameras and would probably not allow the use of their images, especially if they would only be there to know what it is about and would not be automatically involved in the cause. . Therefore, there are several doubts that came to me about the execution and, consequently, the impact of this project, it may be that yes, all this will work out and through this project we will be able to disseminate content related to Cardano in different media from those we already have a good audience. , but it may also be not. \n", "q0r": 3, "q1": "Regarding the feasibility of the project, I believe that some things are well explained here but others need improvement. For example, several things are said that would be part of the project development process, that is, tasks to be performed in order to develop a whole. They would be the pre-production (agenda development, team formation, registration in social networks, etc), the production itself (where there would already be educational content about blockchain ready, the face-to-face events would take place as well as their recording to promote social networks and continue to promote Cardano) and post production, where all video content would be posted, shared and partnership attempts made. We were able to clearly understand what would be done, but not when. In other words, I think that to improve this part of the proposal, it would be necessary to establish a more specific roadmap, which would also include how long each developed activity would last and probable dates. With this, we would have a much better understanding of the whole, as we would be able to relate activities with deadlines to be met. Regarding the budget, in my opinion the asking value is too high and not compatible with the project's needs, I think I could even agree better with this value if the parties had been better explained, justifying the need for such an investment. For example, half the money (15k) would be for various things: employees, equipment rental, domain registration and website creation. How much would go for such a thing, and why? How many employees would there be? What is the value of your working hours? Exactly what equipment would be leased, and from where? Could it be that all the events would take place in the same city and with that they already have in mind somewhere to rent equipment? How much would domain and website creation cost? Likewise, the other parts could be better detailed, such as why marketing would cost 5k USD, what is the project's dissemination strategy, etc. And finally, speaking now of the team involved, I thought this part was good but there is also room for improvement. The names, roles and a little history of each team member are told, so that we can get to know them in a satisfactory way, but I think that some profile should be included on social networks or on sites like vimeo, linkedin, through which we could see the work of those involved in practice. The team is made up of artists, audiovisual professionals, design, marketing and so on, that is, it is essential to see some examples of their previous work to know who we are actually dealing with. Some vimeo links are attached, but I would like to see, for example, the portfolios of those responsible for the design. What worries me here is also the fact that we don't have any Cardano experts on the team, how do we know that someone really knowledgeable about the subject will support the team, that information related to the Cardano ecosystem is real, up to date and reliable? Therefore, I think it would be essential for someone here to play this role, the team could partner with someone who has proven this knowledge. \n", "q1r": 3, "q2": "I think the proposal is reasonably auditable in terms of the process and very much in terms of results. I say this because, about the process, the team tells us in a very abstract way how we could track the progress of this project. It is said that in the first month what would have to be monitored is the creation of social networks and the establishment of partnerships, while from the second to the sixth month there would be several things, but in summary: the face-to-face actions and their recordings, the launch of video content and the movement of social networks. I think they should have detailed the progress expectations on a monthly basis, because from month 2 to 6 is a very long time with a lot of things happening, and without specifying with clarity what would happen in each month those members of the Cardano community who were going to audit the proposal would be a little lost on how to work, what would have to be ready at a certain point and so on. I would like that in the feasibility part they would build this schedule related to dates, so that we could have a sense of deadlines and if things were being done within the expected time. Regarding the results, I think it's a very simple proposal to audit because basically all the content here would be released, made known to the public instantly, so it's very simple to monitor whether the partial results are being delivered or not. I see two distant ways of auditing the results: the entire Cardano community, or anyone interested, could periodically check the project's social networks, in order to monitor the videos that would be coming out as well as the reach and audience interaction; community members who lived in the cities where the actions were to take place could participate, and with that, bring impartial feedback on how the moment was, if there was good public support, if the team clearly and correctly disclosed information about Cardano and etc. With that, I think we could monitor the proposal in a very complete way; my suggestion is here about the dates in the schedule. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 652, "q0": "So the plan here appears to be:  create a host of educational animations about Cardano, along with some scripts for \"street actions\" in Brazil (which are basically scripted art and acting pieces conducted in public).  The proposers will host the educational content on their CardanoUNE site, targeted at a Brazilian audience, and then film the street actions as live, expressive marketing events that cycles attention back to the website to learn about Cardano, where they learn about the next street actions, etc. From there the performances are networked between the artists, interest increases...  a very grassroots, community-centric approach. Its a nice little feedback loop with a specific target, and its focus on educational explainers and drawing on diverse artistic communities makes it well aligned with the challenge, though not particularly broad.  Multilingual support would be the one thing I would like to see added, as I'm sure the art and explainers will be valuable even outside of the targeted communities.", "q0r": 4, "q1": "The team has a lot of high-quality content under their belts already, if one follows the links to the video content they have written and created, and they seem to have a good feel for the process they are implementing here, especially the scritping and creation of the street actions.  the equipment budget is modest and the $500/mo/staff stipend, primarily for the pre-production tasks of creating the scritps and educational material seems equally so.  The per-video cost of $500 also seems very efficient, and the team assures that they will be using equipment and technology intended to keep costs down.  The largest budget item of $5000 for marketing is the only place where they seem to have been more conservative about the ability to get by on a tight budget, but anyone who has tried to drum up support for exhibitions or live events knows that $5000 for 20 events is easy to spend.  There is the question of how they plan on sourcing the knowledge for the educational resources, and just what they expect those to be.  The assumption here is Cardano onboarding material, but how that might integrate with the stories in the street action is unclear.  The best bet for the material, for this kind of project, would be to focus on high-concept onboarding:  things like climate sustainability of Cardano, ability of Cardano to serve the unheard and unbanked, that kind of thing.", "q1r": 4, "q2": "The roadmap and budget here make several clear audit points obvious:  during the pre-production phase we can expect that the site will go online and educational material will show up on it.  Later, during phase 2, there will be the regular filming and posting of the live events.  In the final phase, which is more of a retrospective, the team could take measure of any longer-term partnerships they have created, including any referrals to Project Catalyst to keep the CardanoUNE momentum rolling. The team also indicates a desire to set up a GitHub for the project, which is a good sign for accountability and tracking, and could be a way of providing the content to other distributors who can add the multi-lingual dimension that I would love to see this project add.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3518, "q0": "The idea is very interesting and alligned with Brazilian culture. Indeed blockchain and cryptocurrencies are very well knows in Brazil, and sometimes it is even a taboo. By inviting local artists and activists to participate on the project, Cardano can reacher wider audiences, as the population will feel like someone is finally speaking their language. I also like that the project intends to be sustainable by using QR Code.\nHowever I would like to know if there is an specific city or region the project will take place. Brazil is a very big and diverse coutnry, and each place has its one specificities. \nThere could be more challenges considered for the proposal. Brazil is currently living a delicate moment in an electoral year and a polarized population. This scenario may present a number of risks for the project, specially when it comes to activism. It is also a possibility that artists and activists might be fully booked due to the elections.", "q0r": 4, "q1": "I believe the schedule could be more detailed , it is unclear how long wach phase will take. The production phase could be divided into smaller tasks so we can have a clearer understandment of how the project will occur, since it is the main phase.\nThe budget is well thought, but it is high for this challenge. I think it would be worth considering scaling down the project, to start with a smaller funding, specially because of the risks of doing it in the electoral year, to later search for more funding and a more bold budget.\nThe teams seems qualified and have a strong and relevant background.", "q1r": 3, "q2": "The idea of success is well aligned with the challenge. \nThere could be more measureble impact. I would like to know how many followers and subscribers on social media they plan to have by the end of the project, and how will they measure the impact. I think the schedule presents a good idea of the development of the project, but now about the impact it intends to have in the community.", "q2r": 3, "assessor": "z_assessor_1659", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5883, "q0": "the idea of linking street art/actions with Cardano is valid and Brazil is a great place to deploy it, both because of its social issues and because of its size and population. However, it is still not clear in the proposal how the bridge between these 2 will be built. it says th street icons real people will be invited to participate but are they involved in Cardano somehow? Have they ever had a project developed alongside with Cardano or story about it to tell? have they been contacted yet?\nThe concept of having an unified community is indeed important and reflects Cardano purpose but some direct link has to be made, else, it will be too generic and will not show Cardano potential.  It could also mention which city(ies) this actions will happen.\nIt also says that  educational content will be available but these contents could be better explored here, reiforcing how Cardano is part of it. what will it teach about? what message will be in the QR code? it lacks some informaton to better understand proposal impact.\n\nIn regard to challenges and risks, i agree with the one mentioned, but it doesnt say how to desmistify blockchain. Maybe if explaning better the educational content (and how it will be taught) could address this. I also see challenges and taking a world, that is mostly online and in eglish, to the streets of a portuguese speaker developing country. This will demand much more than educational videos, for a long term engagement. Moreover, social media nowadays have already a lot of videos and promotional materials. How these media will  differentiate from others and really attract people attention? \n", "q0r": 3, "q1": "There's a sound plan in place but it is not time-framed. It should mention here how long each phase will take.\nBudget breakdown is well done but proposal is quite expensive, consuming 20% of total challenge budget. Important to note, however, that video and media production are indeed expensive.\n\nIn regard to the team, there are 5 committed people with audio visual experience and competencies in editing, filiming, directing and scripting, so I guess they are capable of executing this project succerssfully.", "q1r": 4, "q2": "There are some milestones mentioned but more information on how this milestones would be made available to community could be provided (will there be a dediucated channel for it? Will people be able to have access to the conents? etc)\nAlso, there are no kpis mentioned. It would be imporant to measure how many people participate in the actions, how many people are reached in social media by the videos, how much engament is generated, how many wallets are created becuase of it, how many people get in contact to better know about Cardano an do so on. This metric should have target (at least some).\nWithout having hthis metrics it is impossible to know if it was a success or not", "q2r": 2, "assessor": "z_assessor_298", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6282, "q0": "The proposal has a confusing rationale from the problem to the solution. There are three main issues indicated in the problem: 1. access to information; 2. accessibility; and low union of the community. Even in the detailed problem statement and solution, the explanation is still a bit open and makes it difficult to understand what exactly is the solution to which problem. \nIf proposers work on this clarity, the proposal will get more chances of being voted by the community.  ", "q0r": 2, "q1": "The proposer has provided evidence of his experience with content creation, but has given no information about experiences with Cardano or knowledge about this technology – which is something essential in the proposal. Specially because this knowledge will be needed to raise awareness or to make interventions successful. \n\nThe proposal does not consider substantial risks (that there must exist), neither has provided information on how to diminish them. ", "q1r": 3, "q2": "The roadmap lacks information about the total timeframe and the milestones for each phase. The phases are explained with misguiding information, as the proposers indicate 3 phases, move to 4 in the bullets and detail other phases (other than the ones in the bullets). The proposal could work on its clarity and bring clear deliverables in order to make it better to audit. \n\nIt could also limit the items in the problem statement, then it would be more comprehensive to assess if the solution corresponds.", "q2r": 2, "assessor": "z_assessor_386", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Is the creation of street actions for the generation of branded content along with information about the blockchain", "experience": "workaholic graduated in cinema and electronic commerce and I've been living the audiovisual world for 15 years, I work as a film editor for Samsung/Cheil Brasil, I have full knowledge of design, motiondesign editing, 3d, photography, social media content, drone pilot."}