{"id": 399177, "author": "carlhenryglobal", "title": "Monaco Streaming Film Festival 2022", "url": "https://cardano.ideascale.com/a/dtd/399177-48088", "category": 26452, "amount": 9700, "description": "Cardano needs a boost into mainstream awareness, more exposure to the public at large is required demonstrating the use-cases & benefits.", "f6_no_assessments": 6, "f6_rating": 2.555555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 4983, "q0": "The problem statement presented has a good correlation with the needs identified for the challenge.\n\nThe author ends his statement with a reasonable assumption that the use of use-case & benefits would be a good way to achieve the objectives. In addition, its proposed solution includes the exhibition of the piece at a film festival and the possibility of being shown to those responsible for different platforms, distributors and agents, which also meets the space that the challenge proposes to fill. .\n\nThe proposal could have a more elaborate description of the problem statement and justifying the proposed solution.\n\nIn the section that talks about the general objectives of the project, seven topics were pointed out that correlate the proposal with the generation of value for the ecosystem, which deserves to be highlighted in this proposal.\n\nThe main factor that enables a future scale of the project arises from the visibility that the content will have at the festival and the opportunities that will arise from the knowledge of different market players.", "q0r": 4, "q1": "Information was provided about the team involved, but it was unclear who is specifically involved in the production of the film and who is involved only with the festival. Understanding that the purpose of the proposal is the creation of the film and the festival is the promotion channel, I believe it would be important to give more emphasis to who will produce the content and their experiences.\n\nThe author attached several references to the proposal, mostly about the festival in question, but also with some information about the plan. As one of the risks involved is the time to launch, it would be important to provide more information about the production process after the investment is raised.\n\nThe team involved in the creation of the film, the focus element of the analyzed proposal, was not detailed. In addition to introducing those involved in the festival, it would be important to understand more about those involved in the production of the content.\n\nThe budget breakdown does not present complete information about how it will be used in the production of the content. We have information about the costs of managing the project and its promotion, but it is not clear how the resources will be used in the production stage. Therefore, it is also difficult to assess whether the resources will be sufficient.\n\nRegarding the action plan, no information was found about the deliveries, stages and schedule until the completion of the project. The link provided for this purpose does not lead to plan information.\n\nThe only risk pointed out was related to the short time between the end of Fund 8 and the beginning of the festival. The solution suggested to mitigate this risk was for the documentary to be produced using the author of the proposal's own resources.\n\nHowever, it would be interesting to understand other possible risks related to the production of content and to achieving the objective.", "q1r": 3, "q2": "About the auditing of the project, two pieces of information were not clarified enough.\n\nWhen asked about how the monitoring of the project's development would be carried out, items about the objectives of the challenge were repeated. It would be important to understand, in fact, how the evolution of the project can be monitored.\n\nIn addition, information on roadmap, milestones and schedule was not clarified. This information is also essential for the community to be able to follow the evolution of the project.\n\nFinally, despite having listed goals for the project, which is excellent, metrics and KPIs were not defined so that the community can track the success of the project.", "q2r": 2, "assessor": "z_assessor_1818", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 283, "q0": "The problem statement is a bit broad and vague. The solution targets a worldwide audience more than anything (which is not wrong). It seems a bit less targeted on a local area and more entered into the realm of widespread filmmaking through the festival with all it’s worldwide audience. Very impressive, even if there is no plan for scaling due to the nature of the proposal. Full marks for this!\n\nThe proposer's specific experience is NOT given. Instead, the festival's credentials their film will be presented at is given (which is not what the proposal was asking for). The lower score in this section is a reflection of this omission.\n", "q0r": 4, "q1": "The proposer's mistake is adding only links to budget, links for experience, etc. Even the links themselves only take you to a page of several other links. It is impossible to determine where the budget is or where a timeline is written out within any reasonable amount of time. This assessor did not find much of the expected information behind the links, even with exhaustive research (and I am a researcher by trade).\n\nAll information is to be submitted inside of the proposal. Thus, the low score reflects the slap-dash manner that seems to have been put into the creation of this proposal (a proposal that had SO MUCH promise!).\n\nPlease be mindful of the following: The voters of these funds are potentially voting on 1,000+ proposals this round. They should NOT be expected to play researcher and follow the 15+ links presented to track down all the details of the proposal. If the links were submitted in addition to the requested information, that would have been more than helpful. If rewritten for a subsequent year of the festival or for some other occasion, please follow the instructions of submission to benefit the schedule of the voters first, and not yourselves. You are clearly skilled in your areas enough to execute the proposed solution––why not take the necessary time in asking for this community's almost $10,000?\n \nAll that said, the team seems MORE than adequate to complete the task, but with a lack of a budget and timeline, there is no way this assessor can recommend anything more than that brief comendation.\n", "q1r": 2, "q2": "Any chance for metrics and KPIs to save what is lacking in the other sections is lost in this section. Needed metrics are missing, and in their place is a bullet pointed list of the objectives from the challenge setting. This in no way is the list of metrics and KPIs that are being asked for here.\n \nSimply streaming a documentary at a festival does not constitute some privilege of not taking time to put in real effort into your proposal. There is no reason to believe that the team would be more mindful while making their documentary.\n \nI am struggling to find positive and encouraging words, but this proposal simply seems like a farce, a disingenuous scavenging for funds that may or may not be used for the stated purpose.\n \nPLEASE rewrite with full detail in the actual document. Links are NOT a substitute for information that is being asked of in the proposal.\n\nIn conclusion, it is this assessor's understanding that this proposal could have been scored with FULL marks and quickly fully funded with NO question. But only if the writer would have simply taken the time to do their work as asked by the submission process: a process that honors the voter's time and pays careful attention to the responsibilities that managing such a large fund entails. Indeed this is funding that so many well-meaning individuals, groups, and businesses are using to promote the Cardano ecosystem in earnest––please keep that in mind for the next round.\n", "q2r": 1, "assessor": "z_assessor_1134", "no_vca": 14, "ne": 6, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 665, "q0": "The proposal is for the funds to make a film for the Monaco Streaming Film Fest, an for a promotion package with the event organizers.  The content of the film will \"showing all the use-cases & benefits of Cardano for the public & businesses\"...and that is literally all we hear about the film itself, which seems sort of key to the proposal.  The proposal does a good job of describing the benefits that can accrue due to being shown at the festival, which saw 140,000+ views last year.  I am convinced that this would be a good place to have a film on Cardano shown.  But what kind of film is it going to be?  Live actors?  Animation?  Interviews?  Narrative based?  How long?  What kind of production should we expect? What are the use cases they are going to cover?  Are they forecasting things like Hydra scalability, or sticking to current functionality?  Without knowing anything about the film, it is hard to know if it is worth making, no matter what film festival it might get put into.  There are a host of associated endeavors listed in the auditability section of the proposal, but no clear connection to the content of the film.", "q0r": 3, "q1": "As of the writing of this assessment (3/18), the proposer has exactly 74 days to script, film, and post-produce a film, not to mention however much time is required to submit the film and get it approved.  If one starts counting from the likely funding disbursement for this proposal, they probably have less than 30 days.  With this deadline looming over the scene, the proposer has noted he will pay for the film himself.  Ok.  They have quite a team assembled, but it is unclear just what they are assembled to do.  What we need to see here is some kind of shooting schedule, equipment needed, etc.  With a timeline this tight, it is utterly important that it be included, to see if it really is possible, instead we get an assurance that there is \"ample\" time.  The budget isn't a big ask, but it would still be nice to know how it is going to pay for this miracle, but when the proposal sends us to a webpage, the webpage just has a link to send us back to the proposal.  These are not the signs of a hyper-prepared crew ready for the task at hand.  From what has been provided, I see no real sign that this project can be accomplished.", "q1r": 2, "q2": "Technically, from the framing of the proposal, there isn't any need for progress reports.  If the proposer funds the film himself, and if they manage to make it to the festival somehow, then it will be all said and done before the first funding tranche is released.  Therefore, either the film exists at that point, or it doesn't.  If it does, then we need some metrics for establishing that it had any impact.  Since the proposal didn't provide any, I can suggest number of streaming views of the film, any kind of award or ranking from the Film Fest.", "q2r": 2, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5394, "q0": "While the proposal states that it addresses all the aspects of the challenge, it fails to elaborate and provide enough detail as to how. Furthermore, where it does incorporate a multimedia platform and aligns with the goals of the challenge (namely to increase knowledge of Cardano and blockchains and provide a platform to share knowledge and ideas), the proposal does not illustrate an effective way to do so and whilst enthusiasm is shown in the proposal, there is not enough information as to how the project directly addresses the challenge, thus the funds would be better allocated elsewhere where the goals and method as to achieve them are more impactful and clear. whilst a video/ documentary on Cardano might be effective to educate a few it does not allow for a collaboration of ideas and thus will not directly enrich the Cardano eco-system.   ", "q0r": 2, "q1": "It is stated in the proposal that the funding is unlikely to be distributed in time and the proposal fails to acknowledge other challenges which may arrive (such as the issue that in a documentary style format, for someone who is new to the Crypto world, it can be challenging to effectively take in a process all the information in one setting. Furthermore, as shown in the proposal, none of the partners are particularly well versed in Cardano and blockchains etc. this creates further challenges which have not been addressed thus makes the possible success very questionable. Moreover, a detailed timeline is not given, nor is an adequate breakdown of how the funds will be used shown, thus one jumps to the conclusion that there s not a clear and focused plan of action and thus not a direct road to success.", "q1r": 2, "q2": "There is simply not enough information to motivate a funding for this project, whilst the idea is certainly heading in the right direction and holds various parallels with the challenge, it is still in the beginning stages and needs to be more thoroughly thought out and planned to ensure success. There also appears to be a missing in the expertise of the partners in terms of the Crypto world. There is a lack of information as to specifically how the money will be used ad the plan of action. ", "q2r": 1, "assessor": "z_assessor_1966", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8219, "q0": "This proposal clearly presents a problem and that is that Cardano needs a boost into mainstream awareness and offers a solution to making a film that will be screened at the Streaming Film Festival in Monaco 2022 end of May. Creating and presenting the Film at public events will add value to the Cardano ecosystem. This proposal was made in Film + Media Challenge and is in line with the challenge objectives. Because all parameters are met I strongly Agree.", "q0r": 5, "q1": "Proposer clearly points out the links where we can see the cooperation of the two teams. The team of people behind the Streaming Film Festival, Monaco 2022 and the team of people who should be creating video content about Cardano. The requested budget was clearly presented in the proposal, but no budget breakdown was made. Proposer leaves a link through which the budget breakdown should be visible https://gerolamo.org/our-projects/fund-8-proposals-and-data, but information is not available. Proposer states that he will self-fund the preparation of the documentary and the pre-promotion. Given that the date of the festival is defined for the end of May, I am not sure how realistic it is that the entire project will be realized because it does not specify a detailed plan and implementation plan or list the resources needed to implement the project. Because the parameters are not met I disagree.", "q1r": 2, "q2": "As I have reviewed the whole proposal and all the links that are in the proposal, it would be good if this project started working 6 months ago. No roadmap with milestones is listed and KPIs that would define the success of this proposal are omitted. The development and success of this project in my opinion the community can’t follow. Because the parameters are not met I strongly disagree.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10117, "q0": "This project is about creating a Film showing all the use-cases & benefits of Cardano for the public & businesses & show it in the Streaming Film Festival, which surely matches with the challenge expectation. Creating the film can make it easier to document a general introduction about Cardano ecosystem for new comers. Plus, streaming that film in the Film Festival, which has big audiences and great impact will help to grow the reputation and recognition of Cardano with general public. ", "q0r": 5, "q1": "The team explain well about their intension and they seem understand much about the Film Festival, which is positive. However they plan from now (Mid April 2022) to Tuesday 31st May to produce the documentary and negotiate a promotion package with the Streaming Film Festival Team but the proposal doesn't include any detail of this plan (It would be better if they show up something they have already done). Plus, seem like the team members have experience on more of business side, not on film making. I also can't find the detailed budget breakdown on their link attached on their proposal. ", "q1r": 3, "q2": "It is easy for us to see the final outcome of the project: the Film and their streaming of it on the Film Festival. However, to minimize the risk, they should include the plan for each step to produce the film or to negotiate a promotion package with the Streaming Film Festival Team, which makes the project more progress- auditable.", "q2r": 2, "assessor": "z_assessor_809", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will create a Film showing all the use-cases & benefits of Cardano for the public & businesses & show it in the Streaming Film Festival.", "experience": "The festival has a professional & experienced international & local team involved in all aspects of producing film & video, this is the second year. 2021 was a great success & 2022 will be bigger & better! 140,000 viewed the streamed content which is ideal for Cardano Exposure."}