{"id": 399669, "author": "sebpereira33", "title": "Decentralized Cinema Festival", "url": "https://cardano.ideascale.com/a/dtd/399669-48088", "category": 26452, "amount": 35000, "description": "NFTs are too associated with digital images or worse scams. The NFT needs a new use case that can showcase its true potential. ", "f6_no_assessments": 6, "f6_rating": 3.777777777777778, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=26015"], "media": [], "f6_assessments": [{"id": 672, "q0": "This is a great project for both meeting the challenge standards (they tick off boxes across the board) but also for showcasing Cardano in general.  The elegant solution that creates that dynamic is an NFT sale that both governs participation in an asynchronous online film fest as well as allowing the decentralized audience to curate the award winner for the fest.  The ability to demonstrate the security and ease of Cardano's on chain NFTs, as well as the branding around the fest to raise awareness of Cardano should get some interest (the proposer intends to issue 7000 of the NFT participation \"tickets\").  The big challenge is in the intersection of awareness, utility and expressiveness.  If the participants have a seamless experience, as cNFT projects have become, will they appreciate the Cardano experience?  Probably only if they come from other NFT experiences.  In an odd paradox, there is a risk that the better this project functions, the less likely anyone is to pay attention to the fact that it was blockchain based.  The secret sauce is correctly noted by the proposer:  the project needs to have enough success, that it can roll into the next project and be able to up sell the idea that such a smooth decentralized event was possible because the underlying technology was up to the task.", "q0r": 4, "q1": "The budget is hefty for a one off event when you consider that the event is held entirely online.  The big issue seems to be the massive storage requirements needed to get the film entries behind the NFT front end voting and ticketing system.  But there aren't a lot of secure ways around this that will allow the team to run the voting protocol, so you start looking for where the budget could maybe be tightened up.  The testing budget could maybe be brought down, but you have to consider that a smart contract will be required to run the protocol, so a full audit would be wise.  A couple of other issues stand out.  A simple one is an idea of what the pricing mechanism of the NFTs would be, and how the awards for the fest would be handled.  The other issues is more of a nuisance, which is that the key team members have not been listed here.  Yes this is a previously funded team and we can find that info by digging into older proposals on their website, and yes they have a good discord channel where they are all around and you can communicate openly with them, but it would have been good to see the actual team members listed out with their qualifications.  None of the projects yet proposed by NFTDAO are quite like this one, so knowing some background would give us more confidence in how they are approaching this, especially in areas like marketing that could make or break this project.", "q1r": 4, "q2": "The provided road map structures a 9 month lead up to the launch of the \"DeFest\", and there are plenty of reportable milestones, from the website front end, to social engagement metrics for the early marketing.  In addition there are the key milestones of the NFT ticket sale and the onboarding of Fest film submissions, both of which will be driving the anticipation around the event.  If these last two are successful numbers, and if the smart contract does its job, than the results of the fest will hardly matter.  The success will come with the excitement and engagement surrounding the event, with its ability to establish momentum and keep it going.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 1732, "q0": "The team proposes to open a Decentralized Film Festival. The festival will be the perfect vehicle to showcase the power of Blockchain technology, NFT use cases, and the Cardano network. Realize the true potential of NFT. The festival will attract people from many countries and the multilingual group will increase. The team clearly and in detail described the solution to the challenge. The festival will be a major media impact for Cardano. The team also had solutions for the risks when the proposal was implemented.", "q0r": 5, "q1": "The team already possesses the necessary technologies and the NFT ticketing market is an advantage for the implementation of the project. The proposal provided a clear blueprint. Detailed roadmap for each job in each different milestone. The $35,000 request budget is analyzed and allocated appropriately. In addition, the team is skilled in the context and experience, knows the importance and development of the Cardano community. The team has the necessary technology and skills to execute the project. Power up the success of the project", "q1r": 5, "q2": "The proposal is brand new, but the team has laid out a detailed plan that clearly shows the feasibility of the proposal. The team provided several ways to easily measure project progress and development. However, It would be nice if the KPI added a few metrics in the milestone. It will make the proposal even stronger. Budgets are allocated transparently and easily audited.", "q2r": 4, "assessor": "z_assessor_1409", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 4986, "q0": "The problem described by the author seemed to me to be more of a hypothesis than a real problem. Then, when he starts the description of the solution, he mentions how Cardano has the potential to impact content distribution. This second sentence seems to me to have more to do with the challenge. In this case, using NFT as a ticket would be secondary.\n\nThe author defends the decentralized film festival vehicle to empower the network and points out how he intends to involve the ecosystem in the process. It is a clear proposal, but we have to consider the comment made by one of the CAs regarding the conflict between the concept of pre-selection and decentralization.", "q0r": 4, "q1": "The author has solid experience in the community and as a participant in previous challenges. In order to implement the project in question, in addition to not appointing other members, it was not made clear whether the author has previous experience to lead the development of the festival. In this case, it would be interesting to attract other people with complementary skills to the team.\n\nRegarding the budget, values were presented broadly. It would be interesting to see a greater breakdown to ensure all steps and deliverables are covered.\n\nThe project execution plan was divided into a clear timeline. It is possible to get a sense of the author's planning. I, as a project consultant and marketing manager, believe that there is a greater level of complexity from planning to implementing this project. This topic can be improved from a detailed plan between stages, knowledge areas and more precise dates.\n\nThe author presented three main risks, which make sense according to the challenge. In addition to a clear description of the risks, ways to mitigate them were indicated.", "q1r": 4, "q2": "The author presented as ways to measure the progress of the project some of its goals, which he wants to achieve. In this case, it is worth considering a review to separate what are sales or audience goals and what are metrics to monitor the evolution of the process.\n\nWith that, I consider that indicators about the success of this project were presented, but I would still add other metrics, which relate to (1) the reach of the content; (2) variety of audiences reached and engaged; (3) the festival's ramifications for other vehicles/sectors/platforms.\n\nFinally, it is worth considering that the proposal lacks a suggestion that indicates how the community can monitor the progress of the project.", "q2r": 3, "assessor": "z_assessor_1818", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6043, "q0": "It is true that NFTs still have a lot of untapped potential. Especially in an ecosystem like ours that specializes in bringing serious projects to life and not just useless scams.\n \nThat's why I appreciate this project. It finds a problem not only in our ecosystem, but in the crypto ecosystem in general. And while it doesn't propose a general solution to the problem, it does propose an interesting project to help start changing the fate of NFTs on Cardano.\n \nThe project is perfectly circumscribed to the challenge and is able to scale to address future challenges.\n", "q0r": 5, "q1": "The proposer describes himself as an almost ideal candidate for this festival. Perhaps one more person, film and media specialist, is needed to complete the team. He attached links that certify his sayings.\n \nThe timetable is detailed and covers one by one the necessary steps for the film festival to take place at the end of the year.\n \nThe budget is broken down well enough: it only separates some categories, but does not delve into them. There is a lack of work in this area. Still, it does seem reasonable.\n", "q1r": 4, "q2": "The proposer establishes the KPIs of his project in a good way. It seems reasonable that the community can evaluate the success of the company through the number of NFT tickets sold and the number of films that decide to participate in the festival.\n \nThe proposer does not list the milestones. This requirement is essential to help the community to audit the project, so its absence is something that should not be overlooked when scoring the project.\n \n", "q2r": 3, "assessor": "z_assessor_32", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7378, "q0": "I'm not sure this proposal would have such a big impact and would meet the challenge's objectives well. The idea itself is interesting, but I don't know if it would work that well... I'll argue. First, reviewing the objectives of the present challenge, we are working towards the dissemination of media content about Cardano in traditional media, different from those in which we already have a wide domain, such as youtube for example, where there is already a series of content related to the our blockchain and we also have a good viewer base. The goal here is to be able to expand knowledge about Cardano to different audiences through different platforms such as radio, local television, etc. Cinema is certainly a media format that is worth exploring, so much so that we have proposals here that suggest the creation of feature films and so on. However, the idea here would be from another angle: using technologies from the Cardano ecosystem to promote the realization of a film festival in which the films, from what I understood, would not necessarily address content on our blockchain. A number of doubts come to my mind regarding this project and its impact on the objectives of the challenge. What kind of films would be shown at the festival? And how many, is expected? Who would be the target audience? How would people be instructed to buy a ticket that is NFT if they don't know or know but don't know how this technology works? How would they perceive the differences between minting NFTs on the Cardano blockchain or other blockchains? And if the proponents themselves claim that Cardano is facing problems inherent in its growth, which generate difficulties such as the delay in processing in the NFTs, how would people derive from this experience the possible benefits of Cardano? Would it be that useful for the ecosystem if only the tickets were NFTs, but the content of the films had nothing to do with Cardano, that there were no debates about our blockchain, that in no way were guidelines disseminated about it that would make it are people interested in becoming active members of the community? In my view, not so much confidence is conveyed that, just by purchasing the tickets, the goals of expanding the Cardano ecosystem are achieved, causing an increase in the number of media content about the blockchain, community members, digital wallets and any other indicators that clearly demonstrate that our ecosystem would in fact be benefited. A suggestion I can make is that before each film, a short video is shown that summarizes what Cardano is, how the purchase of those tickets works on our network, how this technology can be used for various other purposes as well, etc. And it would also be necessary to understand where the festival would take place, this would help a lot to understand the proposal itself and its impact. \n", "q0r": 3, "q1": "Unfortunately, the feasibility of the project is not very high, because all the information we needed to know about it is provided in a very basic way. Regarding the roadmap, both in the impact part and in this part, the proponents explain what would be done, but the establishment of the schedule is very superficial. The description of the activities is done in a very summarized way, a single sentence explains each one of them, without the proper detail we cannot understand in a deep way what will happen, how these things would be done exactly. Another observation is in relation to the temporal division. It is said what would happen in the first three months, and then in the next three and finally in the fourth quarter of 2022. In my head, these accounts don't add up much because I believe that the funding of this fund would only be distributed in approximately May/June, which would make the second quarter already the end of the year. But anyway, the time division is very macro, for example, in the first quarter, three activities would be carried out. Does that mean 1 per month? Or would some take longer because they would be more complex than others? Would they happen in parallel? Who would work on them, and what would their work routines be like? For the script to be better, it would certainly be necessary to have more details, for example when the dFest would take place, how long the voting of the films shown would last, how would the publicity process of this event take place, so that the members of the Cardano community could acquire their NFT tickets and those unfamiliar with this technology can learn about to participate. Regarding the budget, a very high amount is requested, and it is not possible to understand exactly how it would be used. The division of parts is somewhat superficial, each of them should be better justified, for example, why is it necessary to invest 10k in UI/UX design? It would be the design of what, exactly...? The format of the festival is not clear, but by this indicator we are led to think that it would be through the digital format. Anyway, how many designs would work on this, what would their working hours be, how much would the price of the work hour be, so that we could see more concretely if the amount asked is fair? As in the case of design, the others should have been better explained, especially marketing, so essential for the success of this project. And finally, as far as the team is concerned, it's not presented properly for us. We only have information about Sebastian Pereira. About your team, we don't know who its members are, what they would do, what their academic backgrounds, professional paths, how they relate to the Cardano ecosystem (we know they are part of a DAO, but who does what in this organization?) ... It would be necessary for us to know all this, their full names, a detailed and verifiable CV (perhaps through their linkedin profiles or github pages), in short, the way in which the team is presented to us, in case you don't know the components of the NFT-DAO through previous work, there is no way to be confident that the team is prepared to execute the project successfully. \n", "q1r": 2, "q2": "The suggested auditability modes are quite objective, and allow a basic follow-up on the success of the proposal. In general, what is suggested is: how many tickets were purchased and how many projects were sent to the festival. Of course, these are practical ways to monitor the success of the project, but they are not enough for this to be done in a complete and in-depth way. As it is presented to us, I believe that auditability would be able to cover part of what needs to be analyzed. It would be important, first of all, to establish a way of measuring progress, the development of stages. It would be necessary for the script to be better detailed, perhaps in months, as suggested by me, and that with that we would have content on which to base ourselves for the realization of the phases. It is important that a bridge be established between the NFT-DAO team and the Cardano community, in order to obtain partial results from the process. This could be done through the elaboration of reports at the end of each month, giving us the opinion of how high each task is and constant monitoring of whether things are being done as promised, both in relation to the deadlines, in the right way and more qualified people for each activity. Now about the results, I think it is possible that in addition to the indicators suggested by the proponents, the number of tickets and films at the festival, was analyzed a little further. We could try to understand how this festival impacted the lives of viewers, if really the aim is to show, in the authors’ words, “how blockchain technology and NFTs can work to create a new type of film festival. One that is decentralized, open, transparent and fair” has been achieved. This can be done if the participants understand how NFTs and smart contracts work in Cardano and are interested in making this technology work for other purposes. Contact could be established with them after the festival, either via email or other forms of contact, so that we know how they are applying the knowledge about this technology in their lives and how this project has actually impacted our ecosystem. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "In the proposal, there are links to the NFT-DAO website, the live Akkadia.io NFT marketplace, the site for the Center for Blockchain and Digital Innovation at the University of Wyoming, the NFT-DAO's GitHub repository, and all the data needed to vet the project.\nEspecially the GitHub repository shows the Akkadia.io code, the Audit Report from the Company Mutual Knowledge (inventors of the Glow smart contracts language), our NFT metadata standard, and other public information. There is enough information in all the links provided to show we have the resources, technical knowledge, and partnerships to deliver on the proposal.  "}, {"id": 8696, "q0": "The proposal talks about a decentralized cinema festival where people buy an NFT ticket that gives them the right to vote for the winners and participate in the event. \nCinema festival is used by industries, nations and private entities to attract people to a particular industry or country. A decentralized festival is the perfect festival to showcase the power of blockchain technologies, NFTs use cases and the Cardano network. \nThe main risk is a lack of project submissions in the form of films. These facts address the challenge effectively. My rating is 4", "q0r": 4, "q1": "The project will take about 9 months to deliver. The first three months will bring out the design and minting policies of the NFTs, The next three months will be the set up of the sale of the NFTs using Akkadia and the next three months for announcement of the date for the dFest. \nThe budget breakdown is clear and understandable showing costs of marketing for the tickets, airwave initial storage, UX design and testing. Total amount requested is USD35000 and is reasonable.\nThe NFT-DAO  team is the proposer and Sebastian Pereira is the team lead, who is a Proposer, CA, vCA, Challenge team member. The information provided will make implementation successful.", "q1r": 4, "q2": "Measuring the number of tickets sold as a percentage of the total. About 7000 tickets would be allocated for the event; number of project submissions to the event- open decentralized, transparent and fair; the number of submitted films in total. Final report on Akkadia NFT Marketplace. \nSuccess would be measured according to plan - at the end of project, there are enough resources and excitement to do a second iteration of the dFest next to people. This project can be audited successfully given the information presented. ", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Decentralized cinema festival where people buy an NFT ticket that gives them the right to vote for the winners and participate in the event", "experience": "Economics graduate, EMURGO Academy blockchain instructor, a long-time participant in Catalyst as CA, VCA, and Challenge team participant.\n\nPlus all the resources of the NFT-DAO."}