{"id": 399728, "author": "fractalfuzion", "title": "DUB popular ADA Video for the World", "url": "https://cardano.ideascale.com/a/dtd/399728-48088", "category": 26452, "amount": 10000, "description": "10% of the worlds population speaks English. Would gather open source video content about Cardano then translate / DUB different languages", "f6_no_assessments": 6, "f6_rating": 2.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 5621, "q0": "I agree that this proposal addresses the Challenge presented in the Film + media (FAM) creatives unite challenge, especially regarding the 'educational and inspirational multi-lingual multi-media content' part of it. The proposer/s suggests that they would develop the infrastructure to translate (DUB) open source content into many different languages in order to attract and inform more people about the Cardano ecosystem. This indeed is needed and could be a welcome and useful contribution. However, I wonder why dubbing is a good choice, compared to simply adding translations of the English into subtitles in different languages, and find that the amount of work needed to dub voice-acted recordings and cut them into a video to not be such a good use of community funds in comparison to making alternative subtitles and keeping the original language intact. The proposer does not address the risks to delivering the project, but only states that they are determined and that not creating 'interesting high quality content' is 'another challenge to this initiative', leaving this reviewer wondering about what they mean. There are many risks, like how to keep it from 'being boring,' how to make it 'really fun and engaging', but how? And, what about distribution? I see risks there as well, but they are not addressed.", "q0r": 4, "q1": "When it comes to feasibility, I have one main word: specificity. I can neither agree nor disagree that the proposer/team would be able to successfully achieve their goals. I find no evidence that they are versed in issues around translation or this kind of media production, as there are no references to work done in these areas, no links to professional credentials, etc. There is only a general timeline, starting with acquiring talent, including voice-actors and editors.  How about targeting the specific and most useful video content to translate?  There is so much of it, how to sort through and decide what is most impactful? And, again, do we need dubbed voices? The proposer is not specific about what the project really is: is it to develop a team of people who can take whatever content and make it available to different language cohorts? And, what languages? No specificity there either. And, what specific forms of distribution into which specific 'respective ecosystems?' Regarding the budget, it too is rather general.  Hiring translators should be the first priority, regardless of whether voice-actors or subtitles are used in the end. But, the money is not tied to any specific amount of content. I would like to see examples of which videos the proposer/s think are important, and depending on the length of that content, how much it takes to translate it, etc. Charles Hoskinson's white-board video from October of 2017 is 50 minutes long. As someone who had made subtitles for films, it is a lot of work to take a non-stop monologue like that and translate it well, even now these days with automatic translation software, etc., much less to cut it in effectively to a 50minute video!  And that is just one video. Then, there is $1500 'to produce videos edit down short points' in the budget.  What does that mean? I am not sure. Do you edit down Charles' video to 'short points'? Again, the lack of information specificity in this proposal leaves me in doubt about the proposers ability to successfully achieve useful results that would justify the amount of money asked for and produce useful content for the stated goals of broadcasting such content to a diverse language cohort.", "q1r": 3, "q2": "I strongly disagree that the information presented in this section is sufficient to account for how we as a community can measure the success of the proposed project. If there is a lack of specificity as stated above in the feasibility, it is even more so here. Simply stating that 'the project will document number of post, likes, comments, video views, to track engagement and will make all data available to the public with full transparency' sounds fine, but means little. Again, there is a great lack of specific information, which makes sense I suppose, when there is little detail in the previous sections, how can there be specific metrics or KPIs if they are not tied to specific goals? The question 'What does success look like' is not answered, but is filled with a statement that its success 'would have major impact on the reach of Cardano's message by making more materials open to the world', but not 'how' or what that looks like. Again, opening up to more people is a goal of this challenge, but this new proposal is in need of refining, and given that the proposers work a lot more on shaping their ideas and providing community voters with details about how their idea will take shape and impact the ecosystem, as well as how success will be measured specifically, then I feel that this idea could be successfully funded.  As it is now, this would not be a good use of community funds, even at 6.7% of the Challenge budget.", "q2r": 1, "assessor": "z_assessor_210", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 6045, "q0": "While the proposer's intentions are commendable and finds a real problem within the community, the proposal in this area is not clear or detailed enough.\n \nIn the first place, the percentage of English speakers is higher if we consider not only native speakers, but also those who speak it as a second language. But this point is not the most relevant.\n \nMore importantly, there seems to be no previous study of the existing material or of the specific languages in which content is needed and to which the videos are intended to be translated.\n \nFor this field, it would have been great if the candidate had told us what languages some of the most important videos in our community are available in (such as Charles' whiteboard) and what languages they intend to translate into.\n \nThe project fits well with the requirements of the challenge, but I do not consider that the proposed solution to the problem is satisfactory.\n", "q0r": 3, "q1": " \nThe issues from the previous section also carry over to feasibility.\n \nThe proposer cannot make a timetable in which he proposes \"Immediately start talent acquisition, find voice actors...\" in the first week, if he still does not know in which languages the content is needed in order to later hire the specific translators.\n \nThese types of unforeseen problems would undoubtedly delay the entire process and the entire timetable.\n \nThe proposer does not describe himself as the ideal person to carry out this work (he seems to have no background in dubbing or film and media), nor does he attach links that certify him as suitable. It also doesn't mention team members for the project.\n \nThe budget, on the other hand, seems reasonable and well described.\n", "q1r": 2, "q2": "The proposer, at no time, makes a list of milestones or detailed kpis for his project.\n \nThese two requirements are fundamental to the Cardano community. Since it is, for the moment, the only available tool that it has to audit the projects it finances. Therefore, the total absence of them makes this project impossible to audit.\n \nI recommend, in the future, reading some of the many good examples that Catalyst provides as examples of projects that have successfully filled the \"auditability\" section.\n", "q2r": 2, "assessor": "z_assessor_32", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 676, "q0": "Multilingual functionality is deserving of high marks in the Cardano ecosystem right now, so proposals like this really fit the bill.  Fitting the challenge setting is a bit more of a trick for a straight translation service, but as the focus is very much on open source videos, that probably means we shouldn't ding it much.  The proposer plans on rounding up ALL the opensource video out there for Cardano (I'm going to assume that there is some sort of vetting procedure they are going to adhere to, such as only \"official\" sources, such as IOG and Hoskinson, though it would be interesting if they could get some participation from tubers like AoS.)  While I admire the enthusiasm and goal here, I wonder if there isn't a built in pivot here, of creating opensource machine learning transcriptions that could then be made part of a community that just sources good content, gets the ML work done, and then adds translations for the dub.  Certainly it is among the options for ways to scale this project, and since there aren't any languages where these messages won't resonate, there should be scaling of the project for as long as the proposer has the energy.", "q0r": 4, "q1": "There is definitely a risk here of not having the scope for the project dialed in well enough, but to the extent that the team does a good job of being selective about which videos they will opensource, I estimate that they could cover somewhere between 30-40 videos at around 30 minutes each.  An example would be the famous Charles Whiteboard Video, which would run about $215 or so (estimating based on about $5/minute, including transcribing, so a bit of a steal).  So depending on the number of translations you did (and most dubbing services have about 40 of the most popular languages, so you could use that to set a benchmark, maybe 10 languages or maybe 40).  The more comprehensive you are on the addition of languages (which is the whole point of the proposal) the fewer videos you can do and vice versa.  If you did the CWV in all the most popular languages, you would be very close to using up the whole translator budget on just that one video (though I would argue \"Sounds like a good start\").  Alternatively target maybe ten languages to start (and make the transcription opensource), and you could do 3-4 videos.  I would have liked to know just how many videos the proposer was planning on fitting in here, and what kind of length they were expecting to get out of the edits.  When I think of the truly universal stuff, the CWV, some of the stuff about Oroborous and Jormangandr, I'm thinking 30 minutes minimum.  Just not sure what the proposer has in mind to decide if the budget is feasible.", "q1r": 3, "q2": "The lack of a clear number of deliverables makes the roadmap kind of useless.  Different number of videos don't just result in different budget numbers, it also affects how it all fits in the 12 week timeline.  The proposer included metrics for views and other social engagements, which can help measure impact (I would also suggest the number of languages with successful translations), but what they will need for the reporting in order to keep releasing funds over the 3 months is going to know how many videos they will be creating per week, or creating and then distributing.  The final report can't close until the project is 100% complete, so the proposer really needs that number.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1515, "q0": "This proposal brings up a valid point in that only a minority of the people in the world speaks English, to reach a broader audience and increase inclusiveness, we need to adapt the content for many different languages. The proposal is aiming to translate and dub \"open source video content\". However, there are multiple unknown factors in the proposal that needs to be addresses. \n\nThe proposer states a few examples of videos that could potentially be translated, instead they should provide a plan of X numbers specific videos that will be translated if the proposal gets funded. Will all videos be translated and dubbed? Or will there be any mix of these depending on the language?\nFurthermore, it is stated that the content will be translated to \"many different languages\". How many languages can the community expect if they choose to fund this proposal? What languages are potential candidates? How do you determine that those languages are the most suitable and impactful to reach a broader audience?\nThe above mentioned questions should be addressed in order to gain a good score in terms of impact. It is too vague and general in its current state. The score in impact would be 1 star, but the idea of the proposal aligns with the challenge setting and is relevant. Therefore, the resulting score will be 2 stars. ", "q0r": 2, "q1": "As mentioned in the impact section, there are too many unknown variable to this proposal which makes it hard to assess. A time plan has been provided but it is unclear if you aim to translate 1 video to 1 language or 15 videos to 30 different languages. This must be addressed and stated more clearly in order for the proposal to be more credible. As a result, it is impossible to tell if the proposal is feasible to any extent. For now, it will receive a 1-star rating but the proposer is encouraged to refine the proposal with the above mentioned details and resubmit it in the future!", "q1r": 1, "q2": "In the auditability section it seems that the proposer has not understood the questions. In the first section in auditability you should state how you will measure the *progress and development* of the project. In this case, you should state how you measure progress during your 12 week plan stated in the feasibility section.\nIn the \"success definition section\" of auditability you should include the KPI's that you listed in below the \n\"Please describe how you will measure the progress and the development of the project?\" question. These KPI's should also be stated more clearly and it would be favorable if you could attach a number to each one. This way, the community can audit the proposal and assess if you have reached your intended goals or not. Therefore, the resulting score in auditability will be 1 star.", "q2r": 1, "assessor": "z_assessor_139", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4642, "q0": "There is a need for translating all the blockchain educational videos in multiple languages. This helps in reliance of knowledge transfer on the expertise of local vloggers or social media influencers in complex blockchain topics. This can certainly provide users with demonstrated quality content.", "q0r": 4, "q1": "No experience in translation or similar projects. Demonstrates a good amount of experience in NFT creation but no other details furnished about the team of people having the required skills and experience nor any personal accomplishments in the same discipline. No details about the number of languages planned, based on which one could analyze the feasibility of the project. No total number of videos planned.", "q1r": 2, "q2": "No details on the specific number of views/engagements. No specific number of languages targeted or achieved. No specific number of videos targeted or achieved.", "q2r": 2, "assessor": "z_assessor_1748", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5617, "q0": "The proposer only states that they wish to develop the infrastructure to dub existing content. The proposal doesn't offer any real value to the ecosystem from the initial infrastructure. Intention to actually Dub content from the funds being requested is poorly communicated. From the look of the proposal (as written) the value would be locked in the infrastructure to dub owned by Fractalfuzion. Future proposals I would guess would be to use this infrastructure to dub, but this is not clear.\n\nIf the intention is to actually dub content then the details are missing. The challenge is about creation of content, and if this proposal was about creation of dub content it would have more impact on the challenge and ecosystem as a whole. There is some mention of required people that will be paid in the budget process, but again here the actual output is not stated.\n\nRecommend reworking this proposal with detailed expiation on the value proposition to the community.", "q0r": 2, "q1": "Details of content to be translated are missing, details on which languages to be translation missing. The focus of the time line is the two months of distributions with only one week being focused on unspecified translations.\n\nBudget breakdown missing. For example unknown how many actors and translators will be hired.\n\nIt seems that the proposal is to have a staff on hand to do translations, but is this service going to be offered to the community in the future? Whats the longevity of the project?", "q1r": 2, "q2": "Limited details provided that can offer a measure of outcome. Given the proposal doesn't mention how many, if any video will be translated it will be difficult to track the progress of this proposal. ", "q2r": 1, "assessor": "z_assessor_209", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We would develop infrastructure to translate DUB open source Cardano content into many different languages so more people can learn about it", "experience": "Fractal Fuzion is a CNFT creator, Stake pool operator, Shill-A-mania Champion, Cardano Stonerz club OG, Tokhun premium partner artist, Tokhun ambassador, active Cardano community member, Catalyst Community Advisor, 2500 club member. I am dedicated to my work ."}