{"id": 400110, "author": "petr.smelik", "title": "Blockchain Class by adatruth.com", "url": "https://cardano.ideascale.com/a/dtd/400110-48088", "category": 26452, "amount": 12000, "description": "Newcomers need education to understand the system + recognise scams. Lack of content on real world use cases explaining the vision + basics.", "funded": 2, "upvotes": 29724981, "downvotes": 16898868, "votes_result": 12826113, "votes_cast": 119, "f6_no_assessments": 7, "f6_rating": 4.095238095238096, "videos": ["https://vimeo.com/592379844", "https://www.youtube.com/watch?v=8PadHTYeiGQ&list=PLgIO96BXrRnb51UTv6rvDcOH6YebH8RAN&index=24", "https://www.youtube.com/watch?v=t86e0M-262A&start=4935"], "media": [], "f6_assessments": [{"id": 686, "q0": "There are two levels to the value of this project.  The first is to understand that it is a localized film project to create a total of 3 episodes (the first is already underway) in Czech/English, target some TV airtime for them, with a Vimeo or equivalent distribution as a fallback position.  The project works on this level, just fine.  But there is another level that you will understand if you watch the included trailer...  as someone who has sat through more than my fair share of screenings, there can be something intangible about seeing a \"good\" one, something that comes across as maybe professionalism, or a crispness of vision.  Whether its a rhapsodic counter-culture narrative or a hemorrhoid cream commercial, this \"it\" can be found there, and I am getting a sense of \"it\" from this trailer.  Sure the actual content is somewhat hollow (it feels like placeholders to me, as well as some places where I think effects were intended but not yet included), but they just look really *good*.  Thinking about what this person might roll out with a decent budget behind him, gets my gears turning.  It sounds like their approach is going to be interviews that use a personality to highlight a facet of Cardano (for example, an interview with a Catalyst OG or success story could be an expression of how Catalyst fits into the Cardano landscape).  I think there could be some real potential here.", "q0r": 4, "q1": "I may not know if the project will end up with a big reach and impact, but what I do know is it won't be for lack of a great product.  All the little things you look for are here: the set and props are cohesive, there is a systematic \"bloom\" of image rate (beginning with the slo-mo of the coin that is a nice juxtaposition) that is well orchestrated and timed leading into the final hold on the desk.  There is a phenomenon where the angular lines in the images are actually rotating as the images accelerate, which gives it a feel like a countdown timer...I doubt that was intentional (but if so, kudos!) but it speaks to instinct and talent, nonetheless.  The budget seems quite reasonable when you see the quality we might get from this, and looking at the included film repository, I can almost guarantee the quality.  I liked seeing the dedicated line item for the script, as a docu guy can sometimes be tempted to forgo that part, but I feel like it has to be there, even if you end up a mile away from it in the end (script gives theme, and these feel like they need to be thematic, being only 5-8 minutes).  They are spreading the time line out, with final delivery a full 7 months out.  It looks like they are going to be doing each video in parallel, and then doing the distro all together at the end, which might be an issue (see auditability) but it may strictly be a budget move to get a little more out of the studio rentals etc.  Should also mention that the sound was top notch on those videos.  I don't know if the filmmaker has the ear for this, or leaning into his studio tech, but it works.", "q1r": 5, "q2": "With 3 simultaneous pieces all being assembled at once, they should have no shortages of milestones to hit.  It would have been nice to see some audit breakdowns of some of the phases, but the audit can still be extracted from what is there.  For example, there will be either storyboards or dailies or shot lists for the filming, and those can be parsed for progress reports.  If the films were rolling out one every 2 months, that would make it much easier to audit, but it is understandable if the budget makes them want to approach it differently.  Ultimately, this is a proposer who has been in constant contact with the community, is creating materials for others, and is on the challenge setting team for the FAM challenge.  I don't think the community is going to have any trouble holding his project accountable.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 5624, "q0": "I agree that the idea proposed fits the objectives in the Challenge Brief, and if implemented could lead to better education for newcomers to the Cardano ecosystem. I like the idea that 'real life use cases' would be featured, but wonder what specific issues would be targeted? There is a great deal of content being produced by people distributing on YouTube, etc., that provides information about Cardano to the uninitiated, so I am looking for what specifically the proposing team would focus on to create the greatest impact for the benefit of the ecosystem. Making 'professional' content is fine, but about what? Which use cases, etc.? See more below.", "q0r": 4, "q1": "Taking from what is written above, I can neither agree nor disagree that the proposing team can successfully achieve their goals. Yes, they can make films, that is apparent from the links provided. But, I can make films. So what. What are they about how will they achieve the stated goals of growing the knowledge base about Cardano? I need to see a list concrete ideas that the proposers have identified that need articulation, and why what they will produce is better than existing content. Giving the voters such information is important and would allow us to better decide if we want such content to be created, if we think it is important. I love the idea of a 'Cardano (not just Blockchain) Class' as a resource, and it is needed, but the details about specific content are lacking. Also, the target-market is the Czech Republic, their local environment, but broadcast of their content on Czech television is not guaranteed. Understood. Knowing nothing about Czech tv, I would like to see evidence that there are channels where distribution is possible, to see evidence that those program slots are being targeted. Furthermore, I could give a better score, if the proposers would actually find a marketing specialist, not simply say that they need one to succeed. Finally, when it comes to budget, 8% of the Challenge Funds and their timeline are reasonable.", "q1r": 3, "q2": "I can not agree that the proposers have provided us with useful KPIs or metrics to measure success. 'Distributing the series is the success of the project. That's the plan.' is not a way to measure, it is a statement. Furthermore, marking the progress of meeting dated milestones is fine, but, not so useful when measuring the impact of a successful project that justifies giving $12k worth of community funds to film makers who have not provided us with details of what exactly they will be making 'Classroom Lessons' about Cardano about... Sorry, but we need more information here. Back to the 'KPI/Success Metrics drawing-board'! ", "q2r": 2, "assessor": "z_assessor_210", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 572, "q0": "Such well produced videos has the potential of reaching really big audiences, completely addressing the challenge objectives. One of Catalyst main obstacles is the inability of reaching big audiences, this video could surpass that barrier. Good solution for the problem. Challenge is addressed and confident to find the right suitable people, there are lots of them in the community. Would recommend looking at townhalls, also looking into more languages would be great!", "q0r": 5, "q1": "Team seems to be well prepared for the task and show evidence to prove so. The needed team is well established and timelines seem reasonable.\nIf you are seeking for Marketing why not including it on budget on the proposal? seems like a big part of the project just to leave it hanging right? why not include it on the proposal and have the certainty to have that KEY part of the project ", "q1r": 4, "q2": "Timelines of the project are well established and the success of the project will clearly show itself in the series, I would suggest some Outcome KPIs like amount of viewers if published online. Maybe social media behavior or even trafic to website expected.", "q2r": 5, "assessor": "z_assessor_1190", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 1482, "q0": "More education is necessary for Cardano to grow. I like that this proposal clearly focuses on entry-level content geared at educating newcomers about Cardano. This is a great example of how we can leverage film and media to grow Cardano.", "q0r": 5, "q1": "Being a creative director myself, I can confidently say that the content will be of a high caliber. After reviewing the work of the proposer, I believe he has the talent to create a high quality series. My only concern is the promotion of this content. Outside of getting the series onto TV networks, how can we get this content in front of more people? As the proposer mentioned, I would like to see a marketing person join the team to promote the content created.", "q1r": 5, "q2": "The auditability will come through reports on timelines, reaching deadlines successfully, and the overall reception of the content post production. With consistent reporting, we should have no trouble auditing this proposal. ", "q2r": 5, "assessor": "z_assessor_1382", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 5276, "q0": "I believe the proposal solves the challenge. The proposal does the job of spreading knowledge through videos that explain the basics of Cardano, which is part of the challenge's goal of increasing the understanding and acceptance of Cardano among the audience. The author's solution to achieve the goal is to try to distribute the videos on Czech television and the project's websites. Although the author does not guarantee this, access to Czech TV is excellent. But delivering this solution is an important goal that will promote the creation of quality, professional content that contributes to the growth of the Cardano community. Quality content adds value to the Cardano ecosystem. Through the provided video trailer, I see the team's professionalism: engaging content and sound effects. The author noticed their shortcoming and called for help with marketing to get the video to a bigger audience. Unfortunately, I cannot directly help the author to solve this problem. But in my opinion, to solve the problem, the author can recruit someone with expertise and experience in marketing and communication to add to the team. I think this is not difficult and doable. Or another way is to cooperate with large communities on Social Media such as Facebook, Twitter.., and forums interested in Cardano content. If the project content is good, it will be possible to be accepted for broadcasting. This helps the author focus on his expertise and do his best work. The plan was to produce three videos, each 5-8 minutes long. I wonder if such amount and length of videos are enough to convey knowledge and enough content to bring a lot of value to the Cardano platform?.", "q0r": 4, "q1": "The team has extensive experience and expertise in film, television & film making, editing and has won numerous awards. The team with Razali Samsudin is well known for his contribution to the Cardano Ecosystem and Catalyst. With this team, I think they are fully capable of creating quality and professional content and accomplishing the proposal's goal. Membership information can be checked through the attached link. However, not all thread members have this link. It is better if every member is provided with a full connection. The workflow is brief and sufficient to understand what will happen. It would be nice if progress were given more quantity in terms of workload to be done in stages. (e.g., May: shoot one movie; Edit content for one movie, Record 1 movie; June: Record 2 movies; edit two movies....). The cost of items with accompanying costs is a fill-in. However, with a volume of 3 videos, each video is 5-8 minutes, but the production time lasts 6 months. It seems the project does it very slowly. The cost for that amount of video is also unreasonable. I am bewildered as to whether there is a mistake here?. The team realized that they lacked marketing and communication, but they did not provide a plan or cost to fix it. ", "q1r": 2, "q2": "Progress, Budget, and progress measurement are presented as if they were for single video production only. However, the author did write that they are looking for funding for three volumes. That confuses me, and it's not clear how many videos are produced in the audit section. In addition, there are no metrics so that the reader can get a real sense of the amount of work the proposal will do. I like the idea and believe in the team's capabilities, but the lack of concrete numbers to determine the project's level of performance and success leaves me with no basis for an audit. I hope the project will see a plan revision into smaller sections that include specific roadmaps with measurable milestones.", "q2r": 2, "assessor": "z_assessor_1908", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 5736, "q0": "This is one of the MUST fund proposals. Clearly 5 star in all categories.\nThis documentary series is about the fundamentals of Cardano explaining the real basics combining real life use cases where possible. Our community is so very lucky to have active, engaged, Cardano advocates within our midst.\n\nCatalyst community has produced and continues to produce volumes of written reference material about Catalyst. Some include material helpful for blockchain education. Little if any has been produced on film, in the format of a documentary, by professionals, using professional techniques, filmed in studios such as described in the proposal.\n\nsee this as an example of quality of this team’s work.  https://vimeo.com/689160574 \n\nLikewise there are many amateur YouTubers who produce introductory videos about blockchain. Few seem to be produced by professional teams. And of those which might be, even fewer are produced from the perspective of educating about the Cardano Protocol. The proposed professional educational series is designed to attract proposers, advisors + voters to learn about Cardano + Catalyst, increasing meaningful participation.\n \nOne of the goals of this challenge is to share stories about Cardano throughout the world. The Blockchain Class is designed to do that, starting on a national level first where the proposer and his team are recognised. Making it most likely to get national distribution as a reference for international distribution.\n", "q0r": 5, "q1": "Most proposals include bios of people of good experience, but rarely so closely related to the work needed to fulfil the promise.\nThe qualifications, and recognised (award winning) skills of the proposal team assures the product will be completed. To a high professional standard.\n\nPetr Smělík - Documentary Filmmaker, 16 years of TV & Film experience, received several awards for his documentaries\nhttps://www.vivatscreen.com/\n\nRazali Samsudin - https://www.linkedin.com/in/razali-samsudin\nEducator, Editor, Digital Economy, Blockchain & Sustainability Researcher, Social Entrepreneur, Catalyst Proposal Mentor, Wada UN SDG and Education Coordinator, Co-Founder of Sustainable ADA, Contributor for Positiveblockchain & Catalyst School Core Member.\n\nIvan Horák - Sound Designer, 20+ years of TV & Film experience, received several film awards\n\nPavel Hlavatý - Director of Photography, 25+ years of TV & Film experience.\n\nThe team correctly identifies risks and has a risk management approach. \"As in any documentary / educational programme the challenge is to find the right people for the interviews and showing the stories that resonates throughout the community.\"\n\n\"That's tricky, but the team demonstrates they are experienced enough to provide the right content. Czech Republic and Prague especially is a crypto friendly place. It's a home of Satoshi labs - company bringing Trezor. There are lots of developers, builders and a strong Cardano community as well.\" \n\n", "q1r": 5, "q2": "The proposal seeks funding for clear deliverables - 3 episodes (5-8 minutes long each)\n\nThe first episode is featuring Czech Cardano Ambassador Jaromír Tesař.\nThe schedule is detailed.\n\nFilming: May and June 2022 \nEditing: July and August 2022 \nAdditional postproduction: August 2022 \nSound recording (VoiceOver): September 2022 \nFinal mix: September 2022 \nColor grading and mastering: September 2022 \nDistribution: October 2022\n\nThe budget is very reasonable. Detailed, verifiable for reasonableness and auditable.\n\nBudget: $12000 for 3 episodes.\n\nFilming: $4000 (this includes studio rental, filming equipment, cameraman + sound guy + lights guy on set)\nEditing: $2500\nAdditional postproduction, graphics, low-budget VFX: $1500\nSound recording, voiceover and final mix: $2000\nColor grading and mastering: $500+500\nScript and translations: $1000\n\nClearly a 5 star proposal. Can not find fault anywhere.\n", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8703, "q0": "Having read the proposal the focus is about offering professional educational series that will attract proposals, advisors and voters to learn about Cardano and catalyst through participation.\nIn addressing the challenge, sharing stories about Cardano throughout the world is what this blockchain class about doing. They will actively reach Czech television with their project. The video will be distributed on their website via Vimeo to viewers. \nThe main risk foreseen is how to find the right people for the interviews and showing the stories throughout the country.. With this information, the challenge is effectively addressed. My rating is 4 . ", "q0r": 4, "q1": "They are seeking funds for 3 episodes, which the first episode is featuring Czech Cardano Ambassador Jaromir, which will be bilingual \nThe budget is broken down clearly showing costs of activities such as filming, editing, sound recording, etc. The total budget of USD12000 is reasonable. \nThe team is made up of 3 people who are experienced in fields like blockchain and sustainability, social entrepreneur , catalyst proposal mentor, to mention a few. \nThe information provided can make this proposal successfully implemented . My rating is 4.", "q1r": 4, "q2": "The proposer has stated that the timeline is self-explanatory, which I think should have been clearly outlined and explained in the auditability section. I recommend that they outline points in the section they belong to for clarity. \nThe metrics for determining success are filming, visual post production, audio post production and distribution which can be tracked easily.  This is a new proposal and SDG goals chosen are 4 and 16. My rating is three because the roadmap does not look clear to me. ", "q2r": 3, "assessor": "z_assessor_688", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Professional educational series attract proposers, advisors + voters to learn about Cardano + Catalyst, increasing meaningful participation.", "experience": "16 years of TV & Film (mostly documentaries)Several festival awards for editingBest Documentary Film Award (2020)Educator\n\nhttps://www.vivatscreen.com\nhttps://www.adatruth.com"}