{"id": 400210, "author": "defidiscussions", "title": "Documentary: South America", "url": "https://cardano.ideascale.com/a/dtd/400210-48088", "category": 26452, "amount": 60000, "description": "Many recognize Cardano as a way of making money, ignoring Project Catalyst's goals to act as a tool to create positive change in the world.", "f6_no_assessments": 6, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"id": 2700, "q0": "IMPACT:\nThe production of a film documentary based on Project Catalyst is a creative way to open the gate for Cardano education, diversity of opportunities in the ecosystem, and mass adoption. As this challenge describes, in this early stage of the blockchain, the cooperation between social media experts and TV& Film professionals is required. The proposers identify the need of new videographic tools to address what Cardano has to offer, besides the value of a token or staking revenue. In this context, the team explains the solution: the creation of a documentary, showing the lifestyle of people who live in centralized Latin American countries, and how Project Catalyst has made an impact and changed their lives. \nSome of the key goals for the team is the future partnerships with “Fundación Hogar de Esperanza”, a charity organization located in Cuenca-Ecuador, “Global Smile Foundation”, a foundation that provides comprehensive cleft care for patients in underserved areas, based in Guayaquil-Ecuador, and “Hacienda Cacao & Mango”, a premier cacao farm in Ecuador, as well.\nI believe that a well-produced Cardano documentary is a powerful tool when comes to increasing adoption for Catalyst Project. I also understand that the team has reached out differently non-profit organizations located in Ecuador. That is a proactive step the team has done. They also provide links attached to this proposal, as a verification mode of a serious plan in process. Getting connections with a variety of charity establishments is a valid point. I come from a developing country, and I understand that the infrastructural, technological, and educational need is real in South American countries. \nRating given: 5\n", "q0r": 4, "q1": "FEASIBILITY:\nThe implementation of this film documentary seems feasible based on the exhaustive budget attached for this proposal. The team specifies each area that will be covered throughout the film production such: project development, producing staff, rights, music, talent, crew, production expenses, travel, post-production, insurance, administration, and promotion, providing the amount and total cost needed. The proposers also provide references and social media links on where we can observe their professional skills and job experience within the film industry. \nAs mentioned in the proposal and budget document, Will Shelton would be the main film director. He has information displayed on his website about his experience as an actor and film/theater producer. \nAlso, the proposers demonstrate their experience working with high the media industry, by linking: “Darkest Secret-Horror Short”, which is the film displayed at the beginning of the proposal. This video has about 46k views and was published 2 years ago under the name of the “1080 Eye Films”. I have to say that the work and talent invested in this video is a clear example of the skills and impact that a well-produced film could generate on online users and new crypto adopters. \nIn addition, all the team members provide their professional references and additional working information. Finally, as the team describe, they have also partnered with Techademia, which it is a well-known educational project in the Cardano ecosystem. This provides a reference and professional network commitment, that the they have built with other projects that focused in building educational tools for the ecosystem. I would like to point out that it would be ideal to provide previous videos, links, or references related to Cardano and Catalyst. The video the have linked is a valid tool that shows the professionalism in filming production, but since this is a Cardano Catalyst oriented problem, I would like to learn the experience the team has creating blockchain related content.", "q1r": 4, "q2": "AUDITIBILITY:\nI agree with the idea of submitting a Cardano film to several film festivals to legitimize and bring the Catalyst content into an artistic educational level. This will generate curiosity and adoption to new individuals outside from the crypto environment. In addition, the team offer a detailed pre-production schedule, daily process updates on daily call sheets, and advertising and marketing post-production, as a proof of the project verification. I believe that these metrics show the professionalism and clarity of the project. It is admirable and creative what the team wants to achieve by proposing a film documentary production, and one of the things we are looking to accomplish in Catalyst is scalability for future implementations in the educational area and sustainable adoption. Based on this idea, the team will offer daily call sheets to keep track on the progress of the content production. We want to promote and encourage professional video content in terms of technicality and film quality, but also make sure we offer excellence on the educational content and narrative of what Catalyst Project is. Overall, I observe the potential of this project based on the solid team who is behind the proposal, the connections they have made with Cardano community projects, their experience in film and media content, and their community driven labor and goals they are hoping to bring for developing areas in Latin America. \nScore given: 5", "q2r": 5, "assessor": "z_assessor_1557", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 5625, "q0": "I like the Problem/Solution formulation! And, I strongly agree that the proposal addresses the goals of the Challenge Setting as set out in the FAM brief. When I have been able to see information films about the actual use cases that involve Cardano blockchain ecosystem solutions, I am always taken by this form of telling the stories (of course I am, I am a film maker!). However, there are too few of these, and many are not done by professionals. So I would love to see more work by those whose passions are telling stories audio-visually-textually, where we as viewers are placed into that world somewhere else, to which we may never be able to go otherwise, and can experience a productive use of blockchain technology and specifically how the Cardano ecosystem is bringing positive change to the world. This proposal deals with exactly this possibility. Furthermore, the proposers have developed appropriate contacts with many organizations, targeting educational and humanitarian aid groups, as well as supply chain actors. With the stated goal to broadly share information about showcasing Cardano as 'a physical tool in the 21st Century arsenal to enact change' I sincerely hope such projects gain the needed funding and provide intended impact. When it comes to risks, and how COVID-19 and other things (lack of budget, etc) can present challenges, I always tell students that 'you are only limited by your creativity'! There are always solutions, even if it is using video conferencing tools to make interviews, or getting people on the ground where you cannot go, for whatever reason, to take their mobile phones and record video themselves that they can provide to the producer/editor. We have possibilities today we never had just a decade ago. Let's get this done!", "q0r": 5, "q1": "Here I begin with a minor point, namely, that the weeks do not add up, as I see it (not 44 weeks but to 52). It may be me, but no matter. Filmmaking always varies when you are dealing with 'reality', and it takes time. In general, I feel that the priorities are in the right place: 4 months of pre-production research might seem like a lot to those who are not involved in filmmaking, but that time is most important. If done well, it will make all of the time filming, and even in post-production, more efficient. I do think that the 'Edit' and 'Total Post' (not sure what that means... Edit is part of post!) seem a bit long, if the intention is to have 27 weeks for that whole process. I would like to see a bit more detail about what the proposers mean by this part of their planning. The budget is very impressively laid out in their PDF, with some minor questions about details not worthy of going into here (like why is the sound engineer more than the the DP? or, about buying and then selling the production equipment used?). Even if the amount is 40% of the total FAM Challenge budget (with external funding a given as well), which is high, I feel that if the team can produce a very good quality product that executes on or realizes their intentions, it will be money well spent. Finally, I do think the signs given in the proposal show that the team is experienced and serious, and should be able to deliver. Their credentials speak well for themselves.", "q1r": 4, "q2": "When it comes to auditing the progress and development of the project, the proposal does a nice job of listing the ways the team can measure progress in each part of the pre-production/production/post-production processes. Even thought it shows a clear awareness of these processes, I might suggest they find a way to keep track of these things, which would also help build momentum and generate viewership even before the production is complete, like a social media blog etc., that interested members of the community or others could partake in as the project progresses. go. When it comes to the 'What success looks like' part of auditability, the proposers suggest good ways of measuring success, but do not give specifics as to how to measure, what kind of numbers they can aim for, etc. This is always difficult when anticipating the reception of creative productions, but, specifying where they are targeting such reception and how many of what KPIs would signal success to them would be a desirable component to add to the proposal. How do you measure something like 'more people investing in Cardano, not just for money, but to use it for their own projects to make the world a better place, wider acceptance of it as an asset to enact change on a global scale, and a greater general understanding of Cardano'? Find a way, and do it! That said, I want to encourage the community to seriously consider funding this proposal and hope the film gets made, I want to see it (or these- I hope there are many)!", "q2r": 4, "assessor": "z_assessor_210", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Impact:\n \nThank you so much for believing in this project as much as we do! I appreciate the comments on exploring creative options to circumvent budgetary challenges and other constraints.\n \nFeasibility: \n \nThank you for pointing out the error in our time frame, you are correct it is meant to be 52 weeks. Even though it is a small error we want to be as transparent about our working schedule as possible. As for post-production, Total Post includes the Edit in its week count. The additional three weeks of Total Post comes from one week of Wrap, which is considered post-production, two weeks of color corrections, exporting settings for festivals, and any other unforeseen post-production time expenses. \n \nThe sound engineer is also our editor, and so his expenses are greater as he is performing a greater level of work for his time. Purchasing the equipment and then selling allows us to recoup some budget to place towards post, although this measure would only be implemented if the 60k are the only funds raised.\n \nWe greatly appreciate the curiosity and understanding of our budget in a space where there are not many film professionals. \n \nAuditability:\n \nAuditability can undoubtedly be helped by creating social media pages in order to post our progress to keep the community in the know, as well as generating an audience for when we ultimately release our film. Measuring success is a more difficult question to answer as we would not be operating around a box office. One solution could be to hold NFT ticketed screenings of our film that would promote Cardano inherently, and measure turnout. Another could be social media views and shares. \n \nThank you again for all of your kind words and encouragement.\n"}, {"id": 690, "q0": "I really like seeing projects like this and challenges like this on Catalyst.  These deeper artistic explorations are a necessary element in the creation of culture, and when that is a culture of change and transformation, it is important that it gets documented along the way.  This proposal seeks an mvp type budget to create a full scale Cardano documentary focusing on stories of radical change in people's lives in South America.  There are indications in the team they have assembled that they have some ideas about which stories they want to approach, but it is worth noting that it won't be the choice of stories that makes something like this compelling, it will be the way the stories are approached, and the team indicates a desire to really dig into individuals who have used Cardano to transition from legacy, centralized structures to the beginings of decentralized possibility.  If they follow through on that approach, and let Cardano sell itself through the impact it has had, and is having, then the film should enjoy making its own impact along the way.", "q0r": 5, "q1": "The skills of the team are fantastic, with a dedicated film core team and what looks like Cardano networker/supporters around them.  While the timeline lays out clear tasks and order to complete them with a standard pre-, film, post- schedule, it is the budget that really shines and shows the dedication and thought that has been put into preparing for this project.  We could spend quite a bit of time in this budget, but I just want to highlight some things.  The first is the comprehensiveness of it.  They indicate that they are pursuing other funding in parallel, in case Catalyst can't come through, and being able to strip the Catalyst budget down to critical mvp is a good way to organize the chaos of multiple partners.  Secondly, you can see real effort throughout the budget to carefully cut costs while trying to maintain room for quality and avoid committing to an \"underfunded project\" if that makes sense.  For example, they save about $2000 by halving the equipment budget with a lease/sale scheme, and they save about $1100 in research by eliminating travel.  These aren't ideal approaches, but they can save money that can be backfilled if other funding is acquired, without sacrificing needed equipment if other funding is slow to arrive or non-existent (or if it is Catalyst that doesn't come through).  A lot of the budget is also pushed up front into pre-production and filming, where the team has some control of the spending.  Once a film project gets to post, it is like managing a fire:  control can pass from you to the film as it takes on a life of its own.  Every dollar saved early gives you that much more artistic control as the end nears.  And if extra funding IS acquired?  Post and marketing are great places to sink extra funds.  It is worth noting that on the timeline provided, there will be at least one more Catalyst funding round expected before their work is finished.  If the team has a solid stack of interviews and B-roll, they could create a trailer and approach Catalyst with another proposal later for the post-production and marketing costs.", "q1r": 5, "q2": "The roadmap provided is clear and makes sense, and they do a good job of indicating how deliverables and KPIs will be tracked.  The pre-production schedule they mention, for example, is filled with actionable tasks (picking up equipment, locking in interviews or locations) and the schedule can be expressed as \"% complete\" so that the community can keep track without necessarily knowing everything on the list.  Once filming starts, the dailies are good for anyone that is following along that closely, but milestones like finishing out locations or interviews are more relatable and express better for the less granular monthly KPI/progress reports needed.  In terms of measuring the impact, the only way to find out is at the very end of the project, once it can get some eyes on it.  The team plans to get in on some filmfest circuits, and there could always be an NFT ticket screening for the Cardano community.  But that world is extremely unpredictable....the real  impact may have to be measured in grassroots social media type distribution, even though it may be capable of much more.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you so much for your comments as the thorough examination of our work helps to show the community that we are taking this project very seriously. We aim to create the highest quality possible to showcase the world the truth about Cardano."}, {"id": 3523, "q0": "Showing impact by humanizing those who were benefited by Project Catalyst is a great way of showing the extent of Cardano's impact. It seems like the team already has connections on the region and know where they want to shoot, which translates into a more in-depth proposal. \nOne risk they should be aware of is that, in this type of media, is common that it conveys the wrong message of people of color being saved. In my opinion, the documentary should focus on people who has received aid as protagonists of their own stories, and Project Catalyst as a booster for change", "q0r": 5, "q1": "The roadmap is very detailed and well thought. It's clear that the team know what it wants, how to achieve it, and how long it will take to achieve it. \nI do think there should be some focus on network with local organizations. While government approval is essential, the reality of some South America regions is that the activities that should be provided by the government, are actually provided by local organizations. It's them that the population trust.\nThe budget is proof of the maturity of the proposal: it is very detailed, it includes the main equipment needed, the personel costs, transciptions, and other expenses that are often overlooked. However, the budget asked is high for this challenge.\nThe team seems prepared for the project and already has a relevant background that will allow them to implement this project. I like how there are links to check on their previous work.", "q1r": 4, "q2": "I like how the proposal mentions daily monitoring to make sure the shootings are on schedule, it shows that the team knows the shooting routine. \nI think that the proposal would benefit from more detailed KPIs. For example, how many people do they intend to reach at the end of the project? Is there an estimate of how many interviews they should get during the shooting? How are they measuring the quality of the documentary? There could be some data driven KPIs to make sure the project will achieve its goals.", "q2r": 4, "assessor": "z_assessor_1659", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4987, "q0": "The proposal clearly presents a problem to be solved and a solution that can address this problem directly.\n\nThe authors were concerned with producing a proposal that would have an excellent fit with the challenge. With the success of the project, they will be able to create educational and inspiring content, strongly contributing to the ecosystem and giving visibility to a product that has the potential to spill over into other types of media, not just Youtube.\n\nIt became clear how the author of the proposal intends to add value to the ecosystem, who are the players involved and those who will be impacted by the project. Above the project's expected result, the strategy adopted is coherent and robust.\n\nIn addition, the success of this project opens the door to exploring new opportunities for the Catalyst Project on a global scale. Expanding the scope of the positive impacts generated by community action.", "q0r": 5, "q1": "The multidisciplinary team involved in the project meets the requirements for the development, production and distribution of the content. The appropriate references about the team's experiences were presented, which increases confidence about the proposal.\n\nThe budget was presented in detail and built in an exemplary way, including considering contingency factors. One doubt about the budget is due to the mention of the authors' search for other sources of financing. The budget requested by the proposal seems to be the minimum for project implementation, but it would be interesting to understand the impacts of not being able to obtain additional resources.\n\nAs well as the budget description, the project execution plan was clearly detailed, going through all the project development stages. In this plan, we know which resources will be needed and we have visibility from planning to final delivery.\n\nThe author pointed out global risks that affect any project of this nature. A risk that could be added is related to the fundraising itself for the implementation of the proposal. As stated earlier, it was presented that the authors will seek other complementary sources of funding. My understanding is that there is another type of risk to be mitigated here and that could be considered in the proposal.", "q1r": 5, "q2": "For the audit process, it was detailed how the community will be able to monitor the implementation progress at each stage of the project. All points listed are consistent with the roadmap, deliveries and the schedule presented.\n\nThe author clearly presented how he defines success for the project, this definition being coherent with all the information presented throughout the proposal and directly reaching the objectives defined for the challenge in question.\n\nAdditionally, objectives and metrics were listed for evaluating project results, including for the short and medium term.", "q2r": 5, "assessor": "z_assessor_1818", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10084, "q0": "The proposal is tend to creating a documentary to show the positive impacts of Project Catalyst which is as a tool to make positive change in the world. It's a beautiful idea. In a common way, people  recognize Cardano as a way to make money. This project is more about Project Catalyst, a part of the Cardano ecosystem, which less awareness but also play an important role. There are many projects that talk about how to increase awareness and popularity of the Cardano community but Project Catalyst documentary making is a fairly new approach. I think the solution clearly address the challenge.", "q0r": 4, "q1": "The skills and experience of team members are capable to implement that plan. Information on detail plans is also provided. Fund allocation is also listed in detail. With the information the proposer provided this project is feasible.", "q1r": 5, "q2": "The proposer giving how to measure progress in each phase and show how the crypto community and the outside community can track the project's result.", "q2r": 4, "assessor": "z_assessor_792", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Create a documentary showing Project Catalyst’s positive impact in South America and depict its potential global impact as a tool for change", "experience": "Produced a video with over 50k views on youtube with no budget. IMDb Credits. Multiple film festival runs and projects adopted by streaming services.\n\n25+ combined years of Film and Media experience, including directing, editing, cinematography, writing, and acting."}