{"id": 400528, "author": "azlankonma", "title": "Permaculture & Blockchain: YouTube", "url": "https://cardano.ideascale.com/a/dtd/400528-48088", "category": 26452, "amount": 35000, "description": "Finding a connection between real-world sustainability and the emerging metaverse is a bridge that needs to be built for humanity to thrive.", "f6_no_assessments": 7, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims to use the teams background in video production and teaching permaculture to reframe the topics around Cardano and blockchain in a way that would be relatable to people in communities that are striving for sustainability and harmony with their natural environments.  Forgive the metaphor, but this is rich soil to till.  I have an off-grid, self-subsistence lifestyle with a heavy and growing reliance on blockchain technology, and the communities I am a part of all participate in this kind of lifestyle because of problems they see in the legacy institutions that surround them, from food production, to employment to health(sick)care.  While I don't get the impression that the intent of the creators here is to show how to use blockchain technology to address specific sustainability processes (such as track and trace, SSI and double-spend protection), I don't see how they will be able to avoid it in the longterm success of the project.  For example, an idea they intend to cover is how smart contracts could be understood by contrasting them with the way a farm works.  I often describe the work of Catalyst as being like a beehive, an integral part of maintaining the health of its ecosystem.  The reason these natural metaphors hold water is because like beehives and growing plants, blockchain is a network effect that reflects the values and needs of its ecosystems.  Cardano is unique among blockchains in that it is rigorously proven to be logical, and all of its adaptations that allow us to rely on that logic, to do things like conduct commerce between consenting adults, are also rigorously validated against that root proof.  When the content creators use the analogy of a farm to explain SCs, they are begging the question of whether a SC could be used to express something about farming, such as seed-to-sale for organic produce or avoiding double-spend ($) in the trade of critical supplies or knowledge.  I would expect that the topics this team seeks to cover, while valuable in their own right, will take on a life of their own, as Cardano gains exposure to the kinds of communities that need it most:  communities of radical change and inclusivity and self-governance.", "q0r": 5, "q1": "The team behind this proposal already has a permaculture video project, and offers training and teaching for permacultrue and sustainable living, so the addition of a Cardano-->permaculture learning resource is quite easy to imagine.  From their website and in the proposal itself you get hints of an understanding and appreciation of Cardano and blockchain, but the real strength they bring is the ability to translate the basics of Cardano to their well laid out platform and targeted audience.  The timeline and budget make it clear that they are looking to leverage their experience in this space with the help of these funds to build a content studio, of which the deliverables for this project will be their first production.  They look to be creating somewhere in the neighborhood of 14 total videos for this first round of the experiment, with the goal of monetizing the studio in such a way as to be self-sustainable, likely as a youtube channel.  To that end, the majority of the budget is aimed at some pretty great equipment...I dare say they would be able to onboard full fledged documentaries with what they have laid out here.  The budget is a big ask within the challenge fund, requesting almost a quarter of the total fund, but there does seem to be a lot of value on offer here.  Looking for areas of the budget where the team may be able to be more competitive, I really only see the marketing item ($3k) and the promotional event ($4k) at the end.  Because the promotional event has not been broken down more into how it would be conducted and have the money spent, that is an area that could be tightened up, but it isn't clear that it would make the budget more competitive.  As it stands, the risk here is one of under-delivery, of taking on a mid-budget project and getting low-budget results.  Here I feel that a lot of the risk is mitigated by the strengths and experience of the team, and the fact of what they delivered for the educational courses of the big websites Udemy and SkillShare.  I think they are ready for this.", "q1r": 5, "q2": "The timeline they drew up has clear steps that will be easy to audit:  studio buildout can be expressed as a %complete metric, the release of the films at a rate of two per month are easy to track and measuring the project platform youtube channel will provide metrics for engagement and growth.  I did have two concerns, the first regarding the challenge KPIs.  While I believe they align well with the challenge, I am not seeing a clear way to measure the impact in terms of understanding Cardano.  It is implied in the content intentions and in engagement metrics with the channel, but it would be nice to see something more direct, such as a part of the platform that directs users to create ADA wallets, or a portal to Catalyst to put the knowledge gained in the videos to use.  The other concern was the nature of the final event.  It makes up a decent portion of the budget, but there is no indications of what kind of impact it is intended to measure.  It is obviously to increase exposure (and has the potential of creating a piece of the audit puzzle, which is the required final report due upon completion of the project), but how will it be conducted, who will participate and who will it reach?  It almost seems detached enough from the guts of the project to be a separate idea.  As a marketing idea, the proposer needs to consider how to capture its impact via metrics, and use those expectations to validate the line item in the overall budget.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 7, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "Unfortunately, I have my doubts about how much this idea will add so much to the Cardano ecosystem. Starting with the fact that the proposer intends to create a channel on youtube, where we already have a good base of content about Cardano and also a considerable amount of viewers. As I see it, this challenge aims to release videos, photos, audios and other forms of media on platforms other than those on which we already have a strong base. The idea is to reach other, more traditional media, such as television and radio, for example, in order to have access to a different audience, which would be the people who would consume content on these alternative platforms. I think that for even more money to be invested in the creation of content for youtube, it is necessary that the project is very well structured, that we know exactly what would be done and that this was very positive and differentiated for our blockchain. The idea here is to create a series of videos that address topics related to permaculture. I think it would be necessary for the proponent to better conceptualize what area of ​​study this is, I did some research on the outside to understand what it is about, since I had never heard of the term. In short, it is something that relates to ecology and how society can organize itself in alternative ways. The proponent defines some subjects that would be addressed in the channel: “Ethics in Permaculture, Sustainable Design Principles, Blockchain solutions, sustainable practices, alternative societies, off-grid solutions”. The problem is that the content seems to be much more about design, permaculture and sustainability than blockchain. It is unclear how the proponent will impart knowledge about Cardano, he says he will cite blockchain practices, but where would our blockchain specifically fit in here? When talking about this technology, the impression that is given is that the proponent would generally explain what it is about and focus on use cases. However, it is essential that the contents created make clear the specific characteristics of Cardano, what is the difference between our blockchain and the others, what are the advantages (even ecological) found in Cardano. I would like to know which exact topics would be covered on this, as there are several, from the most general (what is blockchain, what are cryptocurrencies, what is Cardano and etc) to the most specific (how to propose to Catalyst, which language of blockchain programming, such as programming for smart contracts and etc). The proponent even mentions what topics will be covered, but the quote is superficial, even though he has given the example of how he would explain what smart contracts are. Finally, my opinion is that it is not clear how Cardano will be portrayed in this channel, the percentage of videos that would be dedicated to our blockchain in relation to the other subjects mentioned, which specific subjects would be addressed, etc.; therefore, not much confidence is given in the impact of this proposal. \n", "q0r": 3, "q1": "We have a roadmap attached, but I thought the proponent should have explained the proposed activities for each period of weeks. He cites what will be done, but does not detail the activities. For example, in the first week, “Building the team and forming alliances”, how will this be done? We see in the part of the team presentation that he has already defined the professionals involved in the project, but in relation to alliances: with whom does he intend to try to establish them? And how will you make that contact? What exactly is he looking for with such alliances? As in this week, the others should be better explained, in week four, for example, the proponent intends, together with his team, to start producing the videos. How would this process take place? Which professionals would be involved in this part of the project, and what tasks would they perform exactly? The script is ok, but not deep enough for us to have a solid visualization of the process. Regarding the division of the budget, 35 thousand dollars are requested for the project, a value that I found quite expensive, because we don't know how many videos would be produced in total (I believe there are 24, since the project would last 12 weeks and the each of them 2 videos would be released, but this information would need to be confirmed). The way in which the money would be used, however, is well explained, we know well how the total would be distributed. The proponent explains this division into a few parts and within those parts he even delimits what exactly the expenses would be, for example, for “Video Production Equipment: $9,500” the expenses would specifically be for the rental of “A-cam: Body of 4K Full-Frame camera, a set of 2 lenses (prime and zoom), a more economically priced B-Cam, professional-grade 3-point lighting system, monitor-recorder, an A-cam filming rig and mounts tripods and miscellaneous equipment”. My suggestion that would serve to further improve this part of the proposal would be for the proponent to say how much each of these pieces of equipment would cost to rent. If he specified how much each of the little things within those larger parts would cost, I think the budget explanation would be flawless. However, it's still good the way it is. Finally, analyzing the team, I think this part was superficial as well as the script, because all we know are the names of the team members and also the roles that they would be assigned. However, more detail is necessary, such as, for example: to know a little about their previous experiences, in other words, the curriculum of each one. Where did they study, where did they work before? it would also be very important for us to know if they have any previous experience with Cardano, we know that Vinay Deva is an expert in blockchain, but is it specialized in our blockchain or another? Anyway, more details should have been provided about the team. In summary, my opinion is that only the budget is well explained, with both the script and the team needing more details. \n", "q1r": 3, "q2": "I believe that the proponent already has a good idea of ​​how the auditability of this project would be possible. Regarding the development process, he divides this analysis into 3 parts, explaining what would have to be monitored in each. I think the explanations are about both the tasks to be performed (such as going after equipment rental) and the small goals (partial results) to be achieved, as in phase 3: “promote the content to maximum reach” . The question here would only be how to make so much information within easy and practical reach of the entire Cardano community. Will any online document sharing tool be used, such as Notion, Miro or Google Docs? Could it be that at the end of each of the aforementioned phases, the proponent and his team would prepare a report, gathering the main information, advances and difficulties encountered in that period of time? It is necessary that such a report be produced (it can be written, or recorded, it is at the team's discretion) and that it be freely available for any members of our community to have access to it and be able to exercise auditability in a constant and safe way. The ideal would be for someone who understands sustainability/permaculture to audit the project and maintain contact with the Cardano community, this would make the auditability process more practical and simple. Regarding the final results, I also think the proponent suggests very good ways to monitor the results, both quantitatively (e.g. he aims for the channel to “Get 1000+ YouTube subscribers with 4000+ watch hours”) and qualitatively (Establish a similar presence on at least 3 other social media channels and 1 other video sharing platform for maximum reach). I think that a direct survey could be carried out with the channel's subscribers, with the objective of understanding how they are using the knowledge that was acquired with the hours watched on the channel. In other words, in what ways are they getting involved with the blockchain universe, if they have become active members of the community and if so, in what way, in what activities of the Cardano ecosystem they are currently involved and etc. All information collected in this final phase should also be easily accessible to members of the Cardano community, as I also suggested in the partial results part, on any of the various communication platforms available. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "There is a strong educational component to this proposal, and it seeks to explore similarities between the cardano ecosystem and the real world ecosystem, its excellent in this regard. \nThere is a real opportunity here to collaborate with the decentralized media producers as well as blockchain educators.  Many of the proposals i have read want to have a YouTube venture funded, I think it would be more in the spirit of cardano to move away from YouTube and search for other hosting services. ", "q0r": 3, "q1": "The videos produced by the proposer demonstrate  an understanding of basic film making, script writing and editing by an individual.  The proposal could be realized with a strong a diligent leader. ", "q1r": 4, "q2": "Nearly half the budget is on equipment.  Once the ADA is out of the ecosystem it becomes untraceable.   This creates an opportunity to negotiate ada for goods which would enhance the auditability of the project and introduced cardano to a wider audience.  As decentralized media comes online, we may se production teams that can deploy to tell this important story..\n\nWeekly episodes and production meeting notes can be all audited online and so can the final product.  ", "q2r": 3, "assessor": "z_assessor_1483", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The problem posed by the project is fascinating, and its solutions are constructive. It provides a lot of information to expand knowledge about Blockchain and metaverse to many people through Youtube. The project explaining how the solutions can solve the problem is also very detailed, and I believe the project can implement these solutions. The project also shows a deep understanding and experience in Blockchain, metaverse, or NFT.", "q0r": 4, "q1": "The project has a specific plan, including the implementation roadmap and detailed budget analysis. The implementation roadmap is mentioned in detail every week, and I believe with the set timelines, the project can thoroughly complete the implementation roadmap. However, I am concerned that in 2 weeks, the project can produce 4-7 videos or not, this depends on the number of personnel the project has, but this information has not been provided. The project has also provided a detailed budget analysis, and the given costs are entirely consistent with the work items mentioned.", "q1r": 5, "q2": "The project has not yet provided specific KPIs to evaluate progress. I suggest that the project could set KPIs for the reach of videos, and everyone can track these KPIs openly and transparently because anyone can see how many videos are created. How many views. In addition, transparency also needs to be demonstrated through the project's use and allocation of capital. Therefore, for each item of work that needs to be paid for, the project needs to be recorded and made available to everyone. In addition, the project can create checklists of activities that need to use capital and communicate with participants about costs and remaining balance.", "q2r": 4, "assessor": "z_assessor_1710", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The proposer is asking for funds to buy filmmaking equipment (cameras, lights, tripods), worth $9500, computer and editing software (Mac Studio, Mac studio Display) worth $6500 and hire a film crew for 12 weeks, totaling $35000, to create “a simple YouTube channel”  that “will address Permaculture Ethics, Sustainable Design Principles, Blockchain solutions, sustainable practices, alternative societies, off-griding solutions, among other things.”\nSince the aim is to make YouTube videos, without any further vision about their distribution beyond that or any clear artistic or special educational content, I don’t see the proposal fit the challenge brief of building a bridge between Youtube and more traditional media.\nAnd from the few descriptions offered about the design and concepts of the videos, I cannot assess if the proposal will be having an impact upon the Cardano ecosystem.", "q0r": 2, "q1": "The proposer presents a timeline and a plan, that for the most part look feasible, except for the week 7&8, where they mention they will be “generating” 5-7 videos. That is a big amount for a period of 2 weeks, what kind of videos will they be, that would offer the possibility to have them so quickly finished?\nThe budget explains what it will be spent on: for the most part, it will be equipment for a film studio. However, since the proposer hasn’t provided any details, previous works, demo reels or professional social profile links of the involved team members or himself, it is impossible to assess the quality of the videos or have any confidence in the team’s ability to deliver the project and justify a budget requested for creating a small filmmaking studio.", "q1r": 2, "q2": "In the development progress question the proposer has offered a shorter version of the project’s plan, without providing any method of verification of the steps described, thus leaving the question unanswered.\nFor the success description, the proposer has described 3 levels of succes: easy, medium and hard, each containing several milestones of success. It is an interesting and valid approach, as such, this part of the proposal segment has been accurately described.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is practically combined blockchain and the sustainable development of the real-life world and I think this is a creative idea. People keep talking about the development of blockchain but to make it sustainable, it needs to be applied to everyday life. The idea will add value to the community in a long term, not in a short term and the content he heads to is a big idea which in my opinion is a hard task to complete within a short period of time. What exactly will the video content be about as I can see him mention a lot of informative information needs to be mentioned. How can it continue to grow after that? I suggest he makes a demo video and also states clearer of the video content he is making, which will make his proposal more persuasive. I am new to Permaculture and will look it up but if this proposal is successfully established and the idea is widely spread and applied, the blockchain community will literally enter a whole new level of improvement. ", "q0r": 4, "q1": "There is 1 link provided to explain the Permaculture, the proposer's experiences are described in words and if there are any links that help us check your background, you will gain more credibility as it is hard for one to gain trust by words. Also, I do not see your experience in blockchain technology, which is an important criterion to build your video series. A team will be recruited after he gets funded. The budget is broken down in detail but if it is broken down in smaller amounts, it would be better as the budget allocated is still in big amount for each aspect. The time frame for this proposal is in 12 weeks which is quite narrow in my view, the video content will take more time to generate, and this kind of video will even take more time, maybe 6 months is good enough to measure the success. The plan is still good to give it a try.", "q1r": 3, "q2": "There is a roadmap with a specific time set but not in a very detailed plan. There is no link for the youtube video yet. The KPI is stated in a specific number but 12 weeks are hard to reach the target, as long as it has a good marketing strategy, which I still have not seen mentioned here. My suggestion is that they break down the stage and make more detail of each stage. Focus on quality content and marketing strategy. To sum up, this is a big project and I would love to see it on board and create quality content. Hope to see a demo video to help us see a better understanding of the project as a whole.", "q2r": 3, "assessor": "z_assessor_659", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal states a clear problem that is well connected with the needs of the challenge, by offering a series of videos exploring the synergies between permaculture and blockchain technologies. What is interesting is that the whole impact is rather well explained, with the reasons for the problem and what it could bring. the desire to inform and educate fits well with the challenge. This impact is conscious and explained in a way that everyone can understand, which is a plus. A little more specific points on the impact on the community would be important, on the fact that it could reach a different audience and allow more understandable messages to be passed for non-technical people for example, would have specified the value, for people foreign of the art medium. But overall the information is well communicated. On the other hand, this proposal shows many clues leading to think that it will be able to address future challenges.", "q0r": 4, "q1": "The members of the team are well identifiable, but any additional information on a team is essential in order to prove their experience, it would have been appreciable to provide links to their profiles, or other as proof, some teams give information on their character and their vision for exemple and it allows to bring an additional dimension and get a better idea of ​​the people behind a project. It is good to have provided a video in the appendix. The budget is well explained, it seems coherent and very reasonable. As well as the plan which is very detailed. The technical aspects are approached in a very understandable way. The only thing is that the risks are addressed, but explaining possible solutions to remedy them would have been important. And the SDG Ratings are given and make it possible to better identify the orientation of the team in terms of ethics. The precision that this proposal is the continuity of the project already proposed in fund 7 shows that their reflection could be matured and also an index of motivation. ", "q1r": 4, "q2": "KPIs are precise, they really make sense and allow us to refer to them both qualitatively and quantitatively. The plan is given with time indices and in its whole the idea of ​​this proposal in itself contains a reflection on auditability. The team wants to set up a youtube channel so it will be possible to follow the progress of the project. The team also plans to promote the project by setting up an event.\nAnd the whole proposal also demonstrates the knowledge of the team and their attention to being understood. ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "A video series that explores the commonalities between permaculture & emerging blockchain technologies to propose \"the decentralized state\".", "experience": "With over a decade of experience in consulting, designing, & teaching Permaculture, I understand the underlying concepts that can be tied together with the emerging technologies of the future. My interest/expertise in filmmaking, cinematography & video editing are also an asset."}