{"id": 400971, "author": "jtrube", "title": "Japanese Cardano Master Class", "url": "https://cardano.ideascale.com/a/dtd/400971-48088", "category": 26452, "amount": 10000, "description": "Japanese interest in Cardano and blockchain technology is growing, but many still feel that it's still too new and complex to get involved.", "f6_no_assessments": 7, "f6_rating": 2.6190476190476195, "videos": [], "media": [], "f6_assessments": [{"id": 2701, "q0": "IMPACT: Cardano is constantly seeking to provide diversity of content in different languages, to ultimately increase cryptocurrency adoption and high levels of communication innovation. As we know, English is the number one predominant language for blockchain learning and cryptocurrency training. \nAccording to the latest United Nations Data, in 2020, Japan reaches the 11th place, based on the population ranking worldwide (125,715,982). This means that educational crypto resources are necessary to be implemented for this target audience. In this context, I agree with the proposed solution of creating a collection of master class videos that introduce blockchain and crypto fundamentals, showcasing Cardano. In addition, as the world’s third largest digital asset, Cardano, has overcome Japanese regulations to finally launch on ‘BitPoint’ (Japan’s digital asset trading platform) in 2021. This a great achievement for Cardano as a blockchain, and future growth as a cryptocurrency.\nOn the other hand, Japanese culture is very particular in terms of advertisement and crypto marketing. For instance, if we look at the social media content, Japanese ads are less functional, mainly focused on highlighting brands and names, comparing to the massive American marketing strategies. Japanese are more interested in laughter. They consider laughter one of the best marketing ingredients, and this is why many call Japan a ‘creative culture’. Based on this information, the idea of fun videos, combining real and animated individuals who cover blockchain fundamentals, could potentially generate positive interest between the Japanese community. \nMy concern would be the lack of key metrics or goals that the proposers are planning on implementing for this video proposal. I would like to see a more detailed description of the Cardano content for this proposal. Also, how this Japanese film is going to address future challenges if they team gets funded. We want to make sure that the creation of educational tools in different languages, are sustainable and scalable for future references and crypto educational growth.  \nScore given: 3", "q0r": 3, "q1": "FEASIBILITY:\nThe implementation and production of this proposal does not look clear in my opinion. The proposers break down the master video classes into 3 different phases: Planning, preparation, and video launch. However, I believe necessary to specify details about each phase, and how they are planning to accomplish the master video classes set goals by timelines. It is hard to measure how the process is going to be completed without a specific explanation of the procedures of creation, production, content selection and marketing strategies. In addition, even though they offer a detailed budget breakdown, it does not look clear to me how the budget is going to be distributed in some of the areas such: Talent (Who are the talent professional required for this proposal?), Make-up + style (Which make up tools this production include?), Camera (What type of camera it would be required for the videos production?), and copy (What does copy mean on this proposal?). \nWhen offering a budget break down, it is needed to be as specific and meticulous as possible. For funding proposal requests, the proposers need to provide a verifiable plan and fair budget for a better understanding of what is required, and for the effectiveness of the proposal.  \nOn the other hand, Joe Trubenstein and Brano Beres appear to be the proposers for this project. I am assuming one of them are also called ‘Nick’ (found on the team member details of this proposal). They provide their job and professional experience in a brief narrative way on the feasibility section. However, I consider important to add links and social media verification resources, where we can find additional professional and working references. This relevant skills and experience resources are needed to verify the correct implementation and success of a proposal. \nScore given: 1", "q1r": 1, "q2": "AUDITIBILITY: I do not find enough clarity on how this proposal is planning on assessing the Cardano master class video. I understand that the purpose is attracting the Japanese community by creating fun educational videos about Cardano. However, we first want to ensure the information provided on a proposal, is sufficient to audit the progress and success of it. As mentioned before, this proposal is lacking on the team professional links, previous work and experience references, clarity on the feasibility phases, and limited break down details of the video creation, production, and post-production process. The budget is also lacking information about some of the ergonomics and logistics cost, previously mentioned at the feasibility review. In addition, they offer a 12month milestone break down. But they do not specify how they will achieve their monthly goal. Instead, the team provide a brief and short title for each month. Within the 6 month time frame, the project expects to achieve a minimum of 5000 views. My question is: What are the marketing and advertisement strategies the team is planning on implementing to achieve this milestone? Do they have a channel or website with Cardano or crypto enthusiasts on it to base these significant expectations? In addition, they mention that within 12 months, they are expecting to reach 20, 000 views. That’s a very optimistic number of views and online interaction, however, we want to make sure to offer reasonable milestones expectations based on identifiable measurable goals such as: social media active interaction, effective marketing and promotion strategies, experience video production, etc. In my opinion these video interaction expectations remain ambiguous, based on speculative assumptions.\nScore given: 1", "q2r": 1, "assessor": "z_assessor_1557", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 716, "q0": "The proposer correctly identifies a problem which I personally find flabergasting:  why are the technologically innovative Japanese not a leading cohort in the adoption of Cardano.  I have heard many possible suggestions, but what the plausible ones all have in common is a cultural barrier of some type.  Without attempting to explain this paradox of qualifications vs adoption, this team suggests using their experience, in rebranding major products (porsche, fashion brands) for Japananese consumers, to reframe the Cardano/crypto onboarding conversation in a way that may just be able to bridge that divide.  Curious about what types of fare might make it across the gap, I spent some time watching Porsche commercials from Japan...but it was inconclusive.  It is a different kind of presentation than I am used to, no doubt, but if there is a secret sauce than I am not bright enough to see it.  Having said that, I still think the proposers may be on to something, and what I am sure of is that translation only begins with the language used, and it should also include cultural imagery and context, and if that is something they can bring to the conversation, by all means, they should take a shot.  If I have an issue here, it is the idea that the Japanese aren't perfectly capable of understanding the nuances of Cardano, and why wouldn't their own Japanese Cardano Ambassadors (of which there are many) not have had better luck making in-roads already.  Hand in hand with this is the idea that Cardano is most definitely not a \"brand\" but I am being forgiving with the proposer's use of the word.  \"Reframing\" is how I would prefer to describe it.", "q0r": 4, "q1": "I would have liked to have seen either something the team had personally done, or at least a solid example of the phenomenon they are talking about, where a product is rebranded to cross the cultural divide, preferably a high tech one.  I don't doubt the phenomenon, I just would like to have an idea where this team is coming at it from.  I found the timeline interesting, as it opened with a large window for branding, where I thought they should start with filming, but the more I thought about it, yeah, the branding makes sense because they literally have to rebuild the content to suit the audience.  They don't indicate an expected length to be targeted for the film, so it is hard to parse the budget and come away with how adequate it might be, but I can say that it is a well distributed budget among the tasks.  It is a weird roadmap in that it doesn't clearly have the workflow for the actual filming part of the work, so it is hard to say if that is 6 months out or only 3, whether they classify the filming process as the \"launch\" part of the plan (which sounds like a release), or if it occurs before that.", "q1r": 3, "q2": "Whether the filming begins 3 months in or 6, they start including the metrics for quantifying success (views pretty much) at month 9 and have set a target for 20,000 views by 12 months.  The early phase of rebranding and planning may be the hardest to track, maybe by creating a script as the deliverable and trying to fit it all in in the first month.  They had KPIs for the acquisition of equipment and the buildout and preparation of the studio.  They didn't include any KPIs for the filming phase and I am not sure just what format they will be filming under (a description of just what they meant by a Master Class video, format-wise, would have been helpful) but presumable they will have some kind of workflow document to track the progress.  Typically I don't consider the auditing of progress on filmwork to be difficult, but it does differ from one format to the next.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1525, "q0": "The proposed idea is to produce video content to YouTube in Japanese about blockchains, cryptocurrencies and Cardano. As a result, the Cardano community will reach a \"new\" and broader audience that is already technologically mature. The proposal is well aligned with the challenge setting, it matches the description of the campaign brief a lot. It could be questioned if it would fit better in the \"Grow east Asia\" challenge but this proposal aligns better with the \"Film + Media (FAM) creatives unite!\" challenge. \nA point to improve in the proposal is to explain more thoroughly about the content that will be produced. It is stated that the proposer has great experience with content creation but their knowledge about blockchains, crypto and Cardano is rather vague. This should be addressed in the future and as a result, the proposal will receive 4 stars in terms of impact.", "q0r": 4, "q1": "The outlined budget seems reasonable but each post is spare with no further evidence to back up the claimed cost. This could be improved to increase the credibility. \nMy biggest concern however is that there seems to be a mixup between the feasibility and auditability section in terms of the detailed plan and measurement of progress. In the feasibility section you should provide a detailed plan. In its current state, the all details are group into the first 3 months and nothing more of value is provided really. You could reduce the scope of this plan and only provide details for the first 3 (or 6) months. Things should also be split up into more concrete milestones each month. \nThe team is credible and described as experienced but an issue is the lack of evidence for knowledge within blockchains. It should be addressed how you will gather relevant and correct information for your videos. \nThe resulting score will be neutral in terms of impact because of the issues raised above. 3 stars given.", "q1r": 3, "q2": "As mentioned in the feasibility section, the proposal have mixed up things between the two sections. In the auditability section you should describe *how* you will measure progress of the development. How can the community track the progress of the development of your project?\nYou should move all previously stated KPI's to the \"success definition\"-section. Eg. \nWe want to achieve a minimum of 5000 views within the 3 months following launch. \"We want to achieve a minimum of X views within the Y months following launch.\". Also consider adding KPI's for things such as likes, shares and other interactive elements.\nThe score will be neutral in this section (3 stars), the proposal has the fundamentals down but it needs refinement. This is very much true for the auditability section.  ", "q2r": 3, "assessor": "z_assessor_139", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3936, "q0": "The aim of proposal is to provide videos introduces blockchain and Cardano fundamentals in a very unique way: combination of real and animated individuals to convey the content. \n\nIn my opinion, this is a new approach and it takes time and budget to create, so there should be a demo video to showcase the community then we can better assess the quality, whether it would be a good way to deliver content or not. Moreover, there is no detailed information about what topics will proposer deliver in videos, or team's competency in Cardano in general, so it's not easy to identify which impact level will the project have on the community.", "q0r": 3, "q1": "The proposer delivers a plan for a 12-month duration, but no specific activities in the planning and preparation stage have been provided. No marketing strategy to attract viewers has been planned out. In addition, personal profile of each team member does not relate to Cardano ecosystem in particular or blockchain in general, Also, challenges that the proposer forecasted (Covid restriction, venue unavailability) do not really impact the project since this is a online video project, not meetups or seminars.", "q1r": 2, "q2": "The information about how the proposer will track the progress is abstract, not specific enough to understand. The proposer should outline a detailed method for measuring progress and defines a clear means of success. I also suggest creating a concentrated source for the community to also keep track of activities during the planning and organizing phase, such as social media activity, Q&A from attendees,...", "q2r": 2, "assessor": "z_assessor_1693", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5227, "q0": "Since there appears to be no website to reference more information, this proposal is all the information we have to make a judgment. This proposal does not fully identify the problem, scope, or end result of success. The proposal gives brief mention to some recognizable names that have been worked with previously (though it doesn't explain to what capacity) and it gives relatively vague information about the state of Japan in terms of blockchain adoption/perception and media. The general idea of breaking into Japan in this way sounds like a good idea to me, but I am not convinced by this proposal. I want quantifiable problems, relevant statistics, and a convincing explanation of why this needs to be done. ", "q0r": 2, "q1": "The bar is set so low and the funding looks like it's going to build a brand new company from the ground up. If they don't already have a camera, studio, or audio equipment, they don't appear to be motivated to be doing anything on their own. Also, their highest set goal is 20k views in 9 months, which breaks down to $.50 per view if this funding is approved. The timeframe/view ratio also makes no sense. Statistically, the most amount of views takes place in the first 24-48 hours, which means they'd have to establish a long-term marketing plan to deviate from that trend. They don't indicate any information about marketing. This needs more thought and information. ", "q1r": 1, "q2": "I am deeply concerned that this is a \"reimagined version of a past proposal.\" The method of auditing success is very minimal and the cost is far too high. I can't give my approval based on what we've been given here. ", "q2r": 1, "assessor": "z_assessor_1896", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8228, "q0": "The proposal describes in detail how the problem of lacking the videos with the Japanese speaking area can be solved. Perhaps it would be good to develop other KPIs in addition to the number of KPIs that focus on the number of views on the YouTube channel. Videos in Japanese would give Cardano ecosystem additional value and would have an impact on both Cardano and Japan, but also on people who live around the world and speak Japanese.\n\n", "q0r": 4, "q1": "I would like to see the links like LinkedIn or Github in the proposal, a website where you can get information about the team. It would be great if the team is transparent. The budget is presented although it needs a deeper elaboration. How many hours of work are needed to perform the actions, what is the hourly rate? It is a great idea to make a video about Cardano for the Japanese market, and in order to realize this idea, it is necessary to make a workable plan. Proposer elaborates on possible challenges in the proposal.\n\n", "q1r": 2, "q2": "A roadmap with milestones needs to be developed in more detail. With such projects, it is good to have elaborated KPIs so that the community can monitor the development and progress of the project. It is good to work out within the time frame exactly what is being done and how the tasks that will make the project successful are performed\n\n", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10184, "q0": "This is a Master Class video production idea in Japanese introducing the basics of blockchain and cryptocurrency, Cardano and Catalyst. The unique point of this Video is that it is fun and sophisticated, suitable for Japanese culture. This contributes to attracting the development of the Japanese Cardano community. The project is impactful and the content is suitable for this Challenge.", "q0r": 5, "q1": "The execution plan is written overall. The proposer should list in detail the necessary work items to serve as a basis for calculating the necessary costs, manage the project progress later and Catalyst can evaluate the feasibility of the project being implemented. according to this plan.\nThe budget accounts for about 6% of the total budget of this challenge. The budget has listed the costs briefly, the cost corresponding to each work item is unknown. Maybe because there is no detailed plan, it is impossible to compare.\nAbout the project implementation members, there are 2 members with experience in marketing strategy, brand strategy, event organization. In addition, the group will receive additional support from friends. Based on the experience stated in the proposal, it can be seen that the team has enough experience to run the brand marketing campaign and manage the video production project. However, if the team attaches proof of experiences such as sample videos or product samples, it will confirm its ability to perform better.", "q1r": 3, "q2": "The way to check and track the project progress is not mentioned in the proposal. In the plan section, the proposed team mentioned uploading Videos to Youtube. However, it is not possible to know which youtube channel and the current number of followers, the effective level of interaction of that youtube channel currently.\nThe proposed team has outlined KPIs to measure the success of the project. The goal is 5000 views within 3 months of release and 20,000 views within 9 months of release. I think the KPI should be raised to match the impact of the project. The team should think more about marketing strategies for this video to increase the number of viewers. Because with the current KPI, the impact or effectiveness of attracting a large number of viewers has not been realized. I think the proposed team should consider this point.", "q2r": 3, "assessor": "z_assessor_823", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Produce a Master Class video in Japanese that introduces blockchain and crypto fundamentals, before showcasing what Cardano has to offer.", "experience": "Over a decade of event production and content creation in the Japanese market for clients such as Google, Porsche, Ralph Lauren, and more."}