{"id": 401005, "author": "cornl", "title": "Cardano Community Podcasts & YT", "url": "https://cardano.ideascale.com/a/dtd/401005-48088", "category": 26452, "amount": 6000, "description": "Cardano has a strong YouTube community but we need to push forward. How about enjoying Cardano-themed podcasts in our headphones?", "f6_no_assessments": 8, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 718, "q0": "This is a continuation of a community hub that has begun to develop in Poland around Cardano.  This proposal suggest that the next stage of their growth should be from distributing media content to their community.  From descriptions of the shows they have already done (translated, so forgive me if I don't have this quite right) but it really seems like they are focused on teaching and learning about Cardano and the space, which is a breath of fresh air from the constant FUD and price speculation which I am sure their listener's have to wade through to find them.  As a small project, the impact is limited, but it seems proportional to the modest funding request, and it plans to deliver 24 weeks worth of material, a mix of sub 30-minute audio and youtube podcasts.", "q0r": 4, "q1": "With 150+ episodes and counting of their general crypto show, the pivot to Cardano should give them plenty more to talk about.  This track record gives a high level of confidence that they can keep up the good work.  The budget works out to sub $200 per episode, which seems...well, like a great deal, to be honest. They include a small marketing budget, and if I have any concerns here, it seems like with their experience they could really be targeting more marketing specifically to upgrade their outreach and keep the community hub project growing.  It seems this approach is more about solidifying a media base before targeting more growth.  The timeline is short and sweet, and it amounts to just keep doing what they are doing.", "q1r": 5, "q2": "They are up to date on current IOG reporting for the hub, which consists of multiple social channels like Telegram and discord, which is both a sign that they understand the reporting process as well as a source of connection for the community to be able to follow and see how they are doing and growing.  They included a roadmap that indicated in the months ahead they would be evaluating growth opportunities for the Hub, and I think it would be helpful if they identified some general KPIs to help them better target opportunities.  Right now it seems like they are going to gauge which media platforms are providing the best feedback for the podcast, and then orient in that direction with marketing, but I think they could also be gauging the value of Catalyst onboarding in their area, maybe by coming up with a referrer program  (also a source of funding for the show if it works) for their listeners who have ideas and can be onboarded as proposers or assessors.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Thank you for this review and feedback. Noted!"}, {"id": 1483, "q0": "I really enjoyed reading this proposal. I believe this podcast will bring value to the Cardano community through education via new mediums. Podcasting is a huge and untapped market.", "q0r": 5, "q1": "Those working on this proposal seem extremely qualified to create the content and execute on this proposal. I like that they have experience in multimedia production and have already began development. They should have no problem implementing this proposal.", "q1r": 5, "q2": "The auditability of this proposal will come in the development and release of a quality podcast. After reviewing the links in the proposal, I believe the team will deliver high quality content that is easily auditable. Having content already produced really helped me believe in the success of this proposal. I would be interested in seeing analytics by country during the auditing process to determine the regional impact of this proposal. ", "q2r": 5, "assessor": "z_assessor_1382", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "Thank you for your assessment."}, {"id": 2702, "q0": "IMPACT: A challenge category for creatives has been absent so far, especially in the cryptocurrency world. This challenge addresses the important of creating educational and inspiring content about Cardano in different formats, available to the public. As the team members mention, we need to push forward the production of multimedia tools and teams collaborating to produce inclusive, high quality media content to increase knowledge and Cardano adoption. In this regard, the present proposal is perfectly aligned with the objectives of the challenge about bringing a series of Cardano centric podcast with close cooperation with Cardano Center in Poland. One of the great powers of podcasting is the attention it attracts. It’s tricky to encourage people to spend 30 minutes reading an article or watching a recorded lecture, rather than offer audio content accessible at any time and place. In addition, we require blockchain content available in different languages, as is proposed to be implemented in this proposal.  Even though ADA has been positioned at the top 10 of all time cryptocurrencies, we can provide educational knowledge to bring it to the top 3. The proposers have already established series of Cardano educational content and have them available on different media platforms such as: Spotify, Apple Podcasts, Google Podcasts, RadioPublic, etc. All these are verifiable links with Cardano and blockchain content. The proposers clearly articulate how this podcast series will add value to the Cardano educational content, also making them available on various media platforms. I believe in its current form, this proposal  offers great valid points, variety of solutions, and educational resources that show the proactive efforts and work done for the Cardano ecosystem and crypto community growth.\nScore given: 5\n", "q0r": 5, "q1": "FEASIBILITY:\nThis proposal has previously published Cardano content podcasts in various social media platforms (Spotify, Apple Podcast and Google Podcasts, and many others). As mentioned before, all the educational social media links attached are active and verifiable. Therefore, I consider the project goals for future podcast implementation is likely to be feasible and successful. Moreover, the proposers provide a roadmap where they aimed to create 1 podcast per week (within 6 months plan), which will have a duration of 30 minutes each. I believe this as a sensible expectation, that also offers a reasonable time frame to complete the work. The content of each recorded podcast will include crypto news, educational blockchain content, project reviews or interviews. The marketing campaign media they will target this time will be Twitter, Facebook, and Instagram.  Wieczorową Porą, has been creating and producing Cardano content and workshops on different social media platforms for public consumption. This shows his experience as a communicator and crypto educator. In addition, the proposers specify the budget they require for covering the cost of the content creation (brainstorming, scripts, recording content, editing, and multiple platforms marketing costs). The budget requested is by far, reasonable (6000 USD), and will cover the content creation and the set goals established in the plan. The team behind the project offer different links where we can identify their professional experiences as Cardano community ambassadors and blockchain supporters. The only thing I would suggest at this phase is providing the potential challenges and risks that could occur or affect the implementation of the plan; however, the feasibility of the project looks sensible to be accomplished based on their previous professional experience, community involvement and Cardano educational content.\nScore given:5 \n", "q1r": 5, "q2": "AUDITIBILITY:\nI believe that the references, links, professional team experience, educational social media content previously produced, and all the information provided, are sufficient resources to audit the progress and success of this proposal. Moreover, the team mentions that the development and progress of the project, will also be verifiable. The solution for the metrics and progress will be the weekly episode updates of Cardano-themed podcast, that will be available on multiple social platforms. In addition, they proposers will define the success of this podcast content based on the platforms with more social media interaction. In my opinion, this is a solid and strategic point, since the team has already created social media platforms and have vast experience on showcasing Cardano content. They also refer to yearly project expectations, based on the consistency and content weekly update and mention they want to be present in the online format in a more effective manner, while continuing to deliver high quality content for crypto enthusiasts. This shows that the team is interested and focused on scalability and how to promote Cardano community growth. I must mention that this is by far, one of the best proposals from its category I have reviewed, since they recognize the challenge, provide feasible solutions, cover details to meet the standards and expectations of each area evaluated in a project, and have already put the time and works in building an educational foundation before requesting funds. \nScore given: 5", "q2r": 5, "assessor": "z_assessor_1557", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you for the review and feedback."}, {"id": 4580, "q0": "People of present generation are moving towards social media or podcast for entertainment purpose, hence podcast would be excellent idea where they can even continuously work with podcast on.\nPodcast is even used in physical working place where people will love to have knowledge about the future projects or understanding the importance of the block chain in the future hence proposal effectively addresses the challenge.", "q0r": 5, "q1": "The success of the plan wont be difficult as it just needs one excellent speaker where proposer has even mentioned the speaker's name, and all the other platforms collaboration would take time to engage , once people start loving the podcast it wont take much time for people to invest in block chain and engage in the nation building activities therefore, Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer has clearly mentioned about the speaker and all the platforms where they want to host their podcast ,the proposer has even done research on duration of the podcast so that it wont bore the audience ,these small crumbs are mentioned in very detailed manner in simple words by the proposer and also provided the areas where they can market their podcast hence  information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "Thank you for your review and suggestions."}, {"id": 4652, "q0": "Podcasts are currently the popular mode of communication especially knowledge transfer. With major shift happening towards the podcasts, this may be the mode to reach more people. With a population close to 40 million and about 25 million speaking Polish or Slavic languages, local language podcast would reach a significant audience.", "q0r": 5, "q1": "Having had the experience in podcasting during the last funded project and knowledge sharing carried out via various podcast media since 2 years(First Spotify audio in Jan 2020) solely on cryptocurrencies, experience will be helpful in delivering the project target. Although more media presence and advertisement needs to be generated(YouTube stats: 70 videos 650+subscribers and16000+views in over 9 months). But this can possibly addressed by the fund specified for advertising on social media platforms like Instagram, Facebook, Twitter and possibly TikTok.", "q1r": 4, "q2": "\"Number of views and listens\" but the projected number is not specified, also engagements in form of comments/likes/shares should have been included. The number of new members projected to join the local community should have been specified. ", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "Thank you for your review and suggestions. We will include the measures suggested in \"Auditability\" part in our (hopefully) future Catalyst reports."}, {"id": 5395, "q0": "A crucial aspect of the challenge is utilizing various media platforms and this project does so by drawing bridges between numerous platforms like discord, Instagram and twitter (among others). Furthermore the weekly podcasts would promote educational content that is reality accessible. As a frequent listener of podcasts, they would be an effective tool in learning about Cardano and other crypto related topics and the fact that the podcasts are on a platform that is frequently used, encourages listeners and thus enriches the Cardano ecosystem whilst increasing knowledge, which is also an essential part of the challenge. Moreover, one partner (Nikodem Zegzda) already has a platform and the other (Kornel Gajewski) is well versed in blockchain translating this shows and collaboration and coordinating between professionals and creatives, and the project is decentralized whilst encouraging new discussions and sharing of information between people. However, it is unclear what language the podcasts will be in and an aspect of the challenge is multilingual teams, however this is a simple task to challenge and the project still acts in educating and inspiring. I am relatively new to the Cardano and crypto world and the project does an effective job in conveying the ideas in a clear manner and creates a sense of excitement abut the content there is to learn and the areas to grow, and thus gives me faith in the ability to do the same in the podcasts .", "q0r": 4, "q1": "The podcasts are already underway and merely need funding to continue and grow as to share information in the most effective way possible. Based on the qualifications and high levels of interest about the crypto world from both partners, not just as a hobby but as a main source of income, it is evident that the partners are dedicated to sharing information and have clearly thought about the most effective way to do so, furthermore the thoroughness of the project and the many sources which are given as reference also indicate the dedication and thus the likely hood that this project will succeed. the plan presented is also very clearly set out and is realistic, with the roadmap clearly showing the amount of time for each podcast and specific areas for the funds. Although vague ideas are shown for the months ahead, which are promising, it would be more re-assuring to have  relatively detailed information on the actual ideas, as the project states \"Evaluating other media platforms like TikTok.\" and more information about the ways that they plan to evaluate and incorporate the media platforms should be incorporated. the metrics which will be utilized to access success are also very clear and achievable thus, it shows clear goals and focus, indicating. there is also a detailed acknowledgement of the challenges which they will face which are not too wearisome and are manageable. A very good job is done in showing the partners dedications and the project is eloquent and clear, as well as instills a sense of excitement about the simple, yet effective plan. ", "q1r": 4, "q2": "Clear metrics are provided to show how success can be attained i.e. through views and social media activity, also meaning that it is possible to track favorable patterns and what listeners want and don't want. Detailed information is also given about funds and how they will be allocated and because the podcasts are already running it shows the level of competence in the partners. Furthermore, the funds are believable and not excessive and various references are shown to support the project. It is a straightforward idea that has a lot of opportunity for creative thinking and growth and thus preaches similar ideas portrayed in the Cardano eco-system. ", "q2r": 5, "assessor": "z_assessor_1966", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "Thanks for the review and feedback - noted. "}, {"id": 8229, "q0": "The team presents a serial shows about Cardano through a podcast in collaboration with Cardano Center Poland. They claim that there is a great lack of knowledge in Poland about Cardano. The proposer has an idea through a podcast to spread knowledge about Cardano in collaboration with the Polish Cardano Community Hub which consists of social media groups (Telegram, Discord, FB & Twitter). Proposal is in align with the stated challenge settings. Proposer clearly and extensively communicates how this project will give value to Cardano.", "q0r": 5, "q1": "The team is transparent and the proposal contains links where we can see the work done so far. The budget is reasonable and clearly presented, a budget breakdown has been made. A detailed work plan has been developed with clear actions on how and what the team will work to create podcasts. The time frame is presented in such a way that the podcast will be done once a week for 6 months. The team also lists possible risks and challenges.", "q1r": 5, "q2": "A clear roadmap was presented within 24 podcasts will be made and posted on social networks. KPIs are elaborated through the number of views, social media activity, growing the number of local community members. The community can monitor the development and success of this project.", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for your review and suggestions."}, {"id": 8706, "q0": "This proposal seeks to create a Cardano -themed series of podcasts covering Cardano basics , interviews, project reviews and news from ADA-World This is a laudable idea that will make more people interested in Cardano news and eventually became community members. \nAs indicated in the proposal, the aim of this proposal is to keep creating and bring to the keep creating and bring to the next level a series of Cardano -centric podcasts with close cooperation with Cardano Center Poland. They have already published initial Google podcasts , Anchor etc. The proposer stated that though ADA is in the top ten Cryptos in Poland, yet there is a big gap in Cardano knowledge in Poland. \nIn addressing the challenge, the proposer has stated that through their podcasts and their wider marketing they would reach as many crypto users as possible to be aware of how powerful Cardano ecosystem is and also onboard users that heard of crypto but never really got interested in it. \nThe main risk is that people may not accept crypto because of their sentiment about it and their geological location. The challenge is effectively addressed. My rating is 4. ", "q0r": 4, "q1": "Their currently published podcats are on various platforms. The road map is clear sharing  that when they get funding for this proposal, they will start with continuous creation of fresh Cardano-focused content. Marketing campaign in social media, evaluating possible cooperation with crypto , other media platforms like TikTok. \nThe budget is well broken down for easy auditing, showing costs of content, marketing funds, etc. Total budget is USD6000. \nThe team is made up of 3 experienced people in various skills as entrepreneurs, organizing online and offline, etc..\nThe details in the proposal addresses the challenge effectively, and my rating is 4.", "q1r": 4, "q2": "With the progress, every week a new episode of Cardano-themed podcast on multiple platforms, accompanied by YouTube video .Key metrics are the number of views, social media activity, and growing the number of local community members. \nSuccess  can be seen in creating at least 24 content-packed episodes of Carda-themed podcasts; reaching at least a couple hundred listens of every episode, with numbers growing with every episode; making people demand more from them, via social media pages and the comments section on podcast platform.\nThis proposal is an expansion of initial idea of Polish Cardano Community Hub- Cardano Center Poland, currently in production.\nThe details provided are sufficient for successful auditing. Good proposal. I recommend it. ", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for the review and suggestions. "}], "solution": "The aim is to create a Cardano-themed series of podcasts covering Cardano basics, interviews, project reviews and news from ADA-world.", "experience": "Nikodem Zegzda - podcaster, YouTuber, entrepreneur, owner of Kryptowaluty Wieczorową Porą brand, organizer of numerous live and online events;\nKornel Gajewski - 4-yr-experienced blockchain translator & BeInCrypto.pl writer/editor; Cardano Ambassador since 2018\nCommunity - endless"}