{"id": 401124, "author": "checkpoint", "title": "Checkpoint Learning and Media", "url": "https://cardano.ideascale.com/a/dtd/401124-48088", "category": 26452, "amount": 12000, "description": "There is a lack of well established and established media projects with focus and use-case on DLT/Blockchain technology.", "f6_no_assessments": 5, "f6_rating": 3.4, "videos": [], "media": [], "f6_assessments": [{"id": 720, "q0": "The proposal doesn't do the concept here justice, and after working through the Checkpoint platform's volume of material and sites, I have concluded that whatever it is that this proposal is asking for must be something good.  First understand that the Checkpoint platform is extremely diverse, with a core platform of free digital magazines and a wider metaverse (also free) that connects up their properties, and the thing that ties these all together are a couple of basic ideas about community and the value of learning (thus a lot of material for kids), with an overlaid concept that games can be the \"medium\" within which all of this is explored.  Where it starts to get interesting is the platform's work to integrate Cardano, with a metaverse utility token (no real world value) and a governance token (sort of the way to buy into the company if you like what it is all about), as well as an extensive NFT program for use in the metaverse.  After all that, where this proposal comes in...is unclear, lol.  I think what it is asking for is the funding to develop its Learning cohort of materials.  Think of these as programs that schools will be able to sign up for, and, content-wise, think of it as an established model for teaching through video games.  What they need are actual educators to onboard and help them build this material, and then to get schools signed up to use it.  A detail hidden in the roadmap, is that this school onboarding makes up the VAST majority of the company's income growth projection, so it is understandable they desire to build this out.  The benefit of building it out, is that (outside advertising space, school program sales and the sale of the governance token, whose tokenomics I would classify as better than most) all of the content they offer, and a lot of it is geared to educating kids, is absolutely free, and this aspect is built into the governance of the company.  If someone were to invest in them (buy their governance token) and they grew as they expect to, that would mean lots and lots of schools onboarding their program (value of the governance token increases), and lots and lots of kids and their parents onboarded into their educational metaverse (adoption of Cardano increases).  For Cardano growth, 5 stars, for tenuous challenge setting alignment (video games are absolutely within the challenge parameters, IMO, but the development of the school programs and onboarding of teachers isn't well described in those terms) 3 Stars.  I'm splitting the difference.", "q0r": 4, "q1": "The budget was surprisingly low, which is part of why I settled on the proposal being specifically about the educational cohort.  The other part was the actual content of the budget which didn't seem to have any development related expenses in it.  The main concern, as far as assessment goes here, is the creation of the teacher lesson and how it integrates with the teacher onboarding.  This part of the process is where the project syncs up with the challenge setting, so sussing it out is important.  I am assuming that the lessons they create are actually video games, with a component, either a backend or frontend that interacts with the metaverse.  Because this is what the company does, I don't find it odd that it isn't in the budget.  But it would have been helpful, if somewhere the team had mentioned that the purpose here was to onboard teachers to help them make their educational video games \"school ready\".  The only issue I have is that this isn't clearly stated.  Instead the header tells us this is about integration to the Cardano blockchain, the audit tells us this is about video game advertising and a crypto version of their magazines, the impact tells us they will run editorial pieces (on Cardano presumably?) across their magazines, and the budget tells us they will onboard teachers.  They will onboard teachers with this proposal, is my analysis.  Yes, they will do all the rest to, but not under the scope of the proposal.  With that in mind, I believe the team is up to the task, and that they will be able to successfully onboard the teachers.  Whether they will gain widespread adoption in schools (or among homeschoolers), there is no way to know.", "q1r": 4, "q2": "Auditing the process of creating the video lessons should probably be no problem:  track the onboarding of teachers, the lesson development (I assume they can be tracked with something like Agile, or any other software workflow).  The rollout to schools can be tracked by noting the commits from schools, the number of teachers trained (would be nice to have a description of how they see the rolling onboarding process going, as it is hinted at in the budget).  The one audit point they note that is relevant might be the people onboarded to the checkpoint platform, but, as to the impact of this proposal, they should probably add how many schools actually get signed up, since the growth of Checkpoint can come from so many sources, you want an idea of how much this project helped.  They will also want to maybe get some mentorship for the IOG auditing process...on the one hand, the overall platform and roadmap make me think they have the organizational strengths to fulfill audit requirements easily, but the state of the proposal kind of makes me wonder.\n", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 9, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1020, "q0": "The problems proposed by the proposal are impractical and confusing.\nThe method of solving the problem is not clear.\nI think this proposal does not help solve any of the problems that the FAM challenge presents.", "q0r": 1, "q1": "Information about members in the project is detailed but there is no reference source. This will make it very difficult for me to judge whether the information about the team's expertise and skills is real.\nThe general plan lacks details, making the proposal, if funded, also difficult to succeed", "q1r": 1, "q2": "The proposal's effectiveness indicator does not exist, which is a huge minus point to evaluate the success of the proposal.\nThe features and solutions of the proposal are not clear and specific which will make it difficult for the proposal to be successfully implemented when funded.\nThe team should review and add additional risks that may be encountered during the implementation process to have a precautionary plan.\nAll of this makes the proposal's chances of success when it comes to funding close to zero", "q2r": 1, "assessor": "z_assessor_1253", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"id": 4653, "q0": "The proposal focuses on educating the schools about the blockchain technology which is a great initiative. If the teachers are provided with sound understanding of blockchain and well designed tools in form of game, videos or magazines, they would be great facilitators in inculcating the younger generation in the blockchain ecosystem. The trust the parents place in the teachers may also reduce the resistance of skeptical parents. Also the simple language used in educating the children may also be passed on to the adults and educate them in a broader sense.", "q0r": 5, "q1": "The projected revenue for current year is about 600,000Euros. Currently Checkpoint Magazine YT has 47 uploads in last 2 years 47 subscribers and just over 6k views, which is less in terms of engagement via videos. The reach may involve Gaming/direct engagement with schools which is not clear. The magazine, podcast or video design and content may be exemplary but they may require a technology partner to monitor and guide through the process of developing the education material along with their current experience. This being a completely new domain, the teacher training content should be precise in order to avoid confusion and further skepticism.", "q1r": 4, "q2": "Better parameters for audit may have been the number of different content developed for different age groups. Number of teachers on-boarded and their feed back regarding the content. Languages the content was translated in. Kids or schools reached and their feedback.", "q2r": 3, "assessor": "z_assessor_1748", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5230, "q0": "Ambitious, experienced, educated, and reputable. This proposal does not do justice to the depth of this project and the impact that it can make on future generations in a web3 world. This is an education platform that is open to anyone around the world (via the development of language accessibility) AND people of different learning styles by utilizing different mediums of media (with top-level experience in all different mediums). While my first initial thought was that $12k is an expensive proposal, the level of expertise they bring to the table is well worth it. The requested amount is directed entirely at onboarding more teachers, which is an incredible investment given the people that those teachers would be learning from. Genius! ", "q0r": 5, "q1": "The roadmap is highly ambitious and backed by impressive levels of notoriety, expertise, and experience. They've already worked with some VERY recognizable brands and have a detailed roadmap all the way up to 2024 that increases accessibility and awareness at massive levels. Providing this funding only serves to add fuel to the massive potential they have loaded up. This organization embraces the future by utilizing video games and facilitates opportunities for those that will have the privilege to interact with this program. ", "q1r": 5, "q2": "They have multiple avenues for measuring the success of this project. To start, they will be releasing their own governance and utility tokens. So, interaction and involvement from the community will be enforced by the blockchain. They've also got a YouTube channel set up and the development of various mediums to disseminate information. I'm impressed! ", "q2r": 5, "assessor": "z_assessor_1896", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8231, "q0": "Proposer presents a problem and that is that there is a lack of established media projects with focus and use-case on DLT / Blockchain technology and wants implementing an already existing independent media and education platform to the Cardano blockchain. The team of this proposer wants their already existing digital magazine and podcast implement to Cardano blockchain. This project has goals align with the outlined challenge settings but lacks elaborated KPIs.\n\n", "q0r": 4, "q1": "The team is transparently presented and through a prominent link in the proposal we can get information about the necessary skills, knowledge and experience needed to implement the project. The budget has been presented. I would like the budget to be worked out in more detail in terms of how many hours it takes for certain tasks listed in the proposal. A detailed plan needs to be better developed in clearer time frames. The team outlines the possible risk of adapting to the non-crypto world and hopes to use its existing reputation for positives in the blockchain.", "q1r": 3, "q2": "The Roadmap is elaborated in detail for the whole project but not for this proposal which is part of the vision set out by the proposer. It would be good if a roadmap was made exclusively for this proposal. The community cannot monitor the development and success of this proposal because there is a lack of roadmap and KPIs that need to be developed.", "q2r": 3, "assessor": "z_assessor_656", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Implementing an already existing independent media and education platform to the Cardano blockchain.", "experience": "I've been a journalist for over 20 years and have come from a BBC and Guardian background - broadcast journalist (award winning). I have been in the games industry for over 15 years working and launchings some of the most recognisable gaming sites specialising in audiences."}