{"id": 402486, "author": "natnael", "title": "Cardano's Footprint in Ethiopia", "url": "https://cardano.ideascale.com/a/dtd/402486-48088", "category": 26452, "amount": 5000, "description": "Cardano's impact in Ethiopia is not well represented due to lack of proper narrative and showcasing what the flagship project is improving.", "f6_no_assessments": 6, "f6_rating": 3.0555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "Undoubtedly, this set of documentaries would be a valuable tool in educating locals in Ethiopia about Cardano as a blockchain and all the potential it has through the use of Atala Prism in the Education sector there––a definite value add to the Cardano ecosystem. The problem and solution statements appear in line with the Challenge Setting.\n\nThe relevant experience is adequate for this section, though more detail should be added to the Impact section to expand if you are rewriting for future funding rounds. As much detail as you can fit into the proposal is always better.\n\nKey metrics and goals are found in later sections. This proposal can be defined in one way as a 6 video project. As such, there is no plan to scale––though any strategies for scaling should be added if rewritten.\n", "q0r": 4, "q1": "Relevant skills and experience are only given about the proposer. The cinematographer is said to have “years of experience.\" But, how many years? No skills or experience are given for the narrator, the video editor, or anyone else they may be working with. If rewritten, please include thorough experience details for all involved. And if, for instance, the cinematographer is also the editor, please explain that. Further, add the years of experience or estimated number of edited projects.\n\nThe budget is a bunch of round numbers with no breakdown for any section. It seems clear that the locations have not yet been chosen, so the travel expenses are a vague figure––this should be remedied by making a solid plan and proposing an accurate budget for this area. Also, the “contingency” and “extra logistics” items are undefined beyond their titles but equal almost 40% off the entire budget. This issue is inadequate thus far but would benefit from some time put toward explanation.\n\nThe budget could be interpreted as exceeding actual needs by perhaps 30%-40% due to undefined areas. A complete plan that includes real numbers is needed before rewriting/resubmitting if not funded this round.\n\nThe budget and schedule should also be cut in half and proposed over two funding rounds ($2,500 first round and an adjusted figure for the next). Funded rounds only last 3 months, and this is a 6-month project with no plan to resubmit for funding in Fund9 stated.\n\nThe education schedule is far too fluid, as described, to have a more solid timeline. Thus, it is assumed by this reader to be an accurate timeline for creating the first documentary. The lack of a timetable for the other 5 videos means this section will be rated very low.\n\nThe proposer sets out a few challenges and risks assumed and seems to have a realistic idea of what to expect between the fluid education schedule and delayed response from some involved entities (who are only referred to as “stakeholders”––more info on these individuals would be helpful to voters).\n\nAt the end of this section, the proposer mentions that they and the cinematographer have worked together for years creating video productions. If the proposal is not voted through, when rewriting for the coming round, please add some samples of your work together. This will be helpful to voters in determining your potential to execute the proposal.\n", "q1r": 2, "q2": "There is a roadmap only to the first video being published––but the budget appears to be written for all 6 documentaries. It would be VERY important for the author to rewrite to include those details. The low rating for this section reflects the lack of a timetable for those other 5 documentaries.\n\n\nThe metrics are basic at best: the numbers of videos and views as well as feedback from the audience. More creative ideas to track progress could be added. Perhaps a community built around the education that the documentaries provide? Or a podcast in the future (that could also be funded by Catalyst later on)?\n\nThe description of the target problem and the solution are clear and understandable. Only the details in between and a full 6-documentary timetable seem to be lacking.\n", "q2r": 2, "assessor": "z_assessor_1134", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "In assessing many of the film proposals in this challenge, it has been notable that the stories envisioned, whether documentary style or scripted, are all very broad, not yet specific, not yet pinned down.  I am a writer, I understand the situation they are in, and I understand that whether a story, fiction or otherwise, is planned in advance, what matters is that you tell the truth.  Even in fiction, even in fanatasy, you can still tell the truth, and you must.  So I don't hold it against anyone for not having a story yet.  But this proposal has a story.  And as the outline of that story is presented, an insider's view of the education system in Ethiopia, and the hope that Cardano brings to the space, a lived story, I am reminded that having the story to tell, is really what it is all about.  The proposer is addressing an issue of direct and critical relevance, with a unique perspective, that of both someone who experienced the education system first hand, and who understands the blockchain, and Atala, and what it can accomplish.  It is not a huge project.  It may end up being the smallest project in the whole challenge setting.  But something about it seems bigger to me than all the rest.", "q0r": 5, "q1": "The proposer lays out a specific shooting schedule (which you can do when you have the story outlined) and alerts us to having worked with a partner to make several videos already about business and blockchain.  I would have liked to have seen a link to some of that work, but, as the budget is small and his descriptive proposal describes many specifics of getting a basic documentary video shot, I am comfortable giving him the benefit of the doubt.  In particular, the budget only calls for skills, logistics and a small equipment rental fee, indicating that they must already have much of the equipment needed, which can be in the thousands of dollars.  Alternatively, they may not, and the budget is short changed...  That is my one issue with the proposal as it stands, the budget may not be adequate to finish the film, or have decent post-, and thus less than it could have been.  But if the proposer says he can do it for that amount, its hard to justify saying he can't.  The only real risk he mentions that I think has merit or hasn't been mitigated, is the logistical issues around place/time shooting for certain features of the film like scheduled examinations.  He also indicates that access required to film such things may be a hard task.  If that ends up being the case, it would be unfortunate, but I can imagine several ways around it, from filming before or after testing, to staging a scene.  Obviously the real deal is always best, but it is a doable proposition, to my mind.", "q1r": 4, "q2": "The highly specific schedule rundown should make for natural, easy audit points.  Story board, script, shooting schedule are all deliverables that fill out a progress report.  Wrapping location and set shoots can be a good tracking mechanism for a film (if he has dailies, they can be used to as a %complete metric, but this doesn't seem to be the kind of project to have dailies).  Post-production usually has some milestones built into it, but due to the fund allocation(around 5%) I don't think they are looking at a heavy post- process, so that may have to be reporting on the film finalization, with metrics on hits and views, etc for the final report, to measure impact.  Would like to have seen a link to a youtube channel or social media channel to indicate how the community might follow along with the project and be kept up to date.  It isn't in the budget, but maybe under \"contingencies\" they could roll out a touch point like a dedicated social media channel or account.  Every little bit helps when staying in touch with a project.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 7, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is a story about an Ethiopian's educational journey and shows the importance of the Cardano solution. But in the solution presentation there is no mention of how this proposal solves that problem. There is no specific solution, no way to solve the problem completely. The proposal does not accomplish anything on the issues the challenge has presented.", "q0r": 1, "q1": "There is no specific information about the team. There is no evidence for us to know if the proposal team exists and is skilled enough to successfully execute this proposal.\nThe advantage is that the plan is very detailed and specific, including a lot of work items", "q1r": 2, "q2": "Unclear team information is a huge minus. Makes it hard for me to believe this project can be successful. Although the implementation planning and costing sections are detailed and complete, it is not enough.\nInformation about who the audience is is not yet available. Who will this video serve. The basic description of the scripted content does not have, lack of watch time metrics to judge whether the video content is really engaging or just a bad product.\nSo with this series of shortcomings makes this proposal very unlikely to succeed.", "q2r": 2, "assessor": "z_assessor_1253", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "People always love fun learning ,where people of this generation love movies or documentary , As documentary creates more and more interest towards people will not only watch the documentary but also insists others to watch the documentary where their will be wide spread of knowledge for Ethiopian people. hence the proposal effectively addresses the challenge", "q0r": 5, "q1": "As it doesn't require much people to work on out it can be easily be a successful one .Even the proposer has mentioned about releasing the video on accurate dates with respect to the education policies which will definitely help people to show interest towards the documentary. And In Countries like Ethiopia people always try to support local talent which can be another reason for being successful", "q1r": 4, "q2": "The proposal hasn't properly explained about how the documentary will reach the people whether it will be through social media or local theaters or will it be through TV mode.\nThe proposer should have already considered Story flow and storyboard creation , Scriptwriting earlier part itself so that it can reduce the time.\nThe proposal should also mention how marketing is done for presented documentary for being successful one.\nOther than above mentioned points  information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 3, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "A clearer picture about the documentary content could have been provided. \"Journey of an Ethiopian student & 3 exams and how Cardano can change their lives\":it is difficult to see the correlation between the two nor has the proposer mentioned it anywhere. Details about the length of the each of the 6 videos proposed in not mentioned. Details about the distribution mode of the content made and possible ways of reaching the wider audience or any assistance required by the community in doing the same, could have increased the awareness about the impact of the film.", "q0r": 2, "q1": "There are no detail of experience furnished. There is only mention of a collaborator whose profile or work history isn't available, the total years of experience. The previous works or profile of the proposer is also not available. Cannot asses the capability of the team of 2 without any details or previous works furnished.", "q1r": 2, "q2": "6 videos in 6 months. Detail only about the first one to be uploaded on June 30. No further information regarding other videos or breakup of fund for each video separately. Success of videos based on number of views and audience response, but no specific number mentioned for the number of views or audience response(in terms of comments or likes). No platform of content distribution mentioned. One only can to assume that it is YouTube.", "q2r": 2, "assessor": "z_assessor_1748", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The proposer mentions a valid problem within the challenge and within our community: the lack of more information about the valuable work that Cardano is carrying out in Ethiopia.\n \nAnd as a solution, he proposes a simple task: the making of a documentary that, if it is successful (basically in its professional production and dissemination), would add value to the Cardano community in general.\n \nThe project is well framed in the challenge.\n", "q0r": 5, "q1": " \nWhile the proposer meets most of the requirements in a good way:\n \n-Make a detailed timetable, with specific dates that adapts to the circumstances of the school year that is previously stated.\n-Make a very reasonable budget, of a low cost compared to what is available for the challenge and well detailed.\n \nThis field of the proposal has a central and very important problem:\n-The proposer does not certify himself as the ideal candidate to carry out the filming of a documentary, since he does not offer links to what he states nor does he offer links to previous works on the subject.\n \nThe latter is of vital importance for this field, since the community must certify the suitability of the candidate to carry out professionally the project that is financed.\n", "q1r": 3, "q2": "There shouldn't be any major problems auditing a project of this style, but the proposer doesn't stop at formulating in a detailed and extensive way the kpis and milestones that every development of a documentary should have.\n \nWithout these two requirements, the community does not have the necessary tools to closely follow the development of the project. Auditing is getting inside the process, not simply checking that the end result is achieved.\n \nMuch more detailed work is missing in this category.\n", "q2r": 2, "assessor": "z_assessor_32", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Having a documentary that tells the educational journey of an Ethiopian will provide the importance of Cardano's solution.", "experience": "Born and raised in Ethiopia.Went through the educational journey.I worked as a production manager.I have worked in the media and creative industry.I run various blockchain and non-blockchain projects in Ethiopia."}