{"id": 403307, "author": "shlomocohen", "title": "CaricatorADA (CaricatureADA)", "url": "https://cardano.ideascale.com/a/dtd/403307-48088", "category": 26452, "amount": 9300, "description": "Cardano and its community is lacking creative and unique ways to promote Cardano, its philosophy and core values at scale.", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 737, "q0": "What a great project!  The art produced for shlomocohen's Hoskintoons cNFT project is ridiculously  vibrant and detailed, and the chance to see some thematic idea from a Hoskinson AMA or deep thoughts at 2am vid are simply too good to pass up.  Images like that, which I'm guessing will be \"Cardano and systems that change the world for the better\" -centric, have a real chance to exhibit viral behavior, and with Cohen's history in print, could easily be syndicated for even wider circulation if a paper ever picked up a story on Cardano.  Beautiful visual art based around Cardano definitely engages the challenge metrics, with a talented creative onboard wanting to extend their Cardano outreach.  As a marketing effort, I have to wonder just how many outside of Cardano's inner circle will hear or care about such a project, but there is only one way to find out, and at this price, the art is a steal.  Oh, but he needs a totally new name for this thing...flood his inbox people, get some ideas out there.", "q0r": 5, "q1": "There is no doubting the artistic talent, and seeing the dedication to the Hoskintoon's cNFT drop (5000+ hours, and it shows) indicates this guy ain't lying when he says he really digs Charles' message.  The planned release of 1 graphic per week is ideal...plenty of time to get it right, not so slow that interest can wane.  The budget looks fine, plenty for 3 months of legit marketing, the rate per graphic is screamingly low.  You aren't going to find any problems with this rollout plan.  I also appreciate that they are looking at the long game before the rollout to see if there is any cNFT synergies that can be realized to give the project some longer term sustainability.  Kudos.", "q1r": 5, "q2": "This one won't be any problem to audit.  Every week the images are going to be all over your Cardano feeds, they can start rolling out immediately after funding, 4 per month with lots of social media engagements to measure means the progress reports will probably be brimming.  He does mention a stretch goal worth noting:  getting the big dog himself to sit up and take notice.  Let's make it happen, shall we?\n", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1023, "q0": "This is a very interesting idea. Rigid monotonous images and content are too familiar to viewers, making them feel boring and no longer interested.\nHumor and lively are always things that attract viewers. It will be a way to attract more attention even those who don't know anything about Cardano.\nThis proposal is addressing what the challenge is to educate and inspire.", "q0r": 5, "q1": "The team are individuals who excel in the expertise and skills required to make this proposal successful such as creativity, humour.\nIn particular, member Shlomo Cohen has a long list of national and international achievements and is recognized by the international community.\nThe plan is detailed, clear, simple and no frills.\nAll of these will further confirm that the proposal, if funded, will be successfully implemented up to 90%.", "q1r": 5, "q2": "The roadmap includes the time and the implementation is very complete and detailed.\nFull performance metrics. If possible, add more time to watch the video to assess the quality of the content.\nThe budget is suitable for each content of the work to be done.\nWith very detailed and reasonable planning, this proposal after being funded will have a very high chance of success. Wish the team will create creative and funny videos.", "q2r": 5, "assessor": "z_assessor_1253", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6055, "q0": "I do not agree with the problem that the proposer exposes: I think that Cardano has a very active and creative community that is constantly looking for how to help promote it, in fact, the proposer is a good representative of this. But I agree that any contribution from creativity to help promote Cardano more (through quality work) adds value to our ecosystem.\n \nI think that the project is not strictly what the challenge is looking for, but rather meets the requirements in a tangential way: making illustrations of Charles's videos is not “Film or Media”, but it is not very far from these categories either.\n \nAnyway, my general impression of this project in this category is positive.\n", "q0r": 4, "q1": "Given the quality of the artist and his vast experience (both outside and inside our ecosystem), the feasibility of the project seems to me the strongest point of the project. In fact, I would like to have seen more ambition in terms of goals, but I imagine that once funded, proposers can even give much more than what is written in their timetable.\n \nTheir timetable is well written and detailed, as is the budget breakdown.\n \nThe candidates are clearly suitable for the task, as confirmed by the links they provide.\n \nThe risks for this project are very low. Perhaps they will require more creativity if some week Charles decides not to upload a video, but beyond that, there seems to be no other big risk.\n", "q1r": 5, "q2": "The auditability of this project is a simple task for the community. Comics will be created week by week as proof that the proposers are carrying out their work.\n \nPerhaps some more detailed milestones are needed on the more specific objectives in the area of promoting comics. Some good milestones could make it clearer how this project intends to have such a successful scope as the one proposed.\n", "q2r": 4, "assessor": "z_assessor_32", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8235, "q0": "Proposer claims that there are not enough creative and unique ways to promote Cardano in the Cardano ecosystem, so he decides to create creative content in the form of caricatures by Charles. Proposer states that he will make 12 cartoons that will be related to the weekly videos that Charles will upload. He also states that the cartoons he would make would be uploaded on social networks with a link to Charles videos, which in my opinion would have an impact on the Cardano ecosystem. The proposal is able to scale to address future challenges and key metrics and goals of the proposal align with the outlined challenge settings.  All required parameters are met that's why I strongly agree.", "q0r": 5, "q1": "We have a clear insight into the skills needed as well as transparency of who is behind this project. The budget is clearly presented and presented in detail as well as a plan and timeline for delivering. Proposer claims that he will create 1 Cartoon per week for 12 weeks and Cartoons will be shared on social networks. Maybe to ad duration of the Cartoons and what challenges / risks could occur during this project that's why I agree.", "q1r": 4, "q2": "The roadmap is presented in 12 weeks and one Cartoon will be made each week. KPIs bring our attention to 5-10 media channels that will publish Cartoons on a weekly basis. The community can monitor the development and success of this project. All required parameters are met that's why I strongly agree.", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9621, "q0": "This proposal states a clear problem related to the challenge in an original way, by proposing to caricature the weekly video of Charles Hoskinson. The explanations on the solution are precise and the impact is conscious, but could have been a little more developed, especially about what it could bring to the community and more. The fact of using the medium of the caricature could for example make it possible to reach a different public, This could perhaps even expand later on caricatures beyond the videos of Charles and be an opportunity to bring another dimension for the atmosphere in the community ? The same is true for the link between the challenge and this initiative, which could have been developed a little more. We do not need to convince people already convinced by the benefits of art, but what about people who are foreign to this medium? Giving them more information about the added value of such projects is something only artists can do. But, it is a good thing to have put links allowing us to see the previous creations of the proposer. The fact that it is about evaluate NFT models for it shows us that this proposal is part of a continuity approach that will be possible to address future challenges. ", "q0r": 4, "q1": "The members of the team are quite well identifiable and links are provided as proof, as well as the possibility of seeing their previous creations and thus attesting to their skills. The budget is clear and seems consistent with the needs of the challenge. The plan is realistic and understandable. Risks are addressed with a solution provided. \nThe team planning the collaboration with IOG and Charles is a plus (it could have been specified if the team already has this collaboration, or the means put in place to ensure it)", "q1r": 5, "q2": "The roadmap with a milestone and time horizon of completion is provided and allows us to base ourselves on concrete elements to certify and follow the evolution of this project, With weekly publishing of the caricatures. With the objective of views on social media twitter likes, RTs, impressions, engagements, profile visits. In addition, there is talk of Exposure in media channels out of the community.  Many links are provide and give more informations, which permit a good understandment. ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A weekly caricature representing the weekly video of Charles Hoskinson", "experience": "40 years of experience making daily political cartoons for newspapers, in the largest/most read newspaper in Israel (Israel Hayom) , won multiple awards, NFT designer"}