{"id": 403485, "author": "glory", "title": "Cardano Innovator's Story", "url": "https://cardano.ideascale.com/a/dtd/403485-48088", "category": 26452, "amount": 35000, "description": "Today, The biggest problem with Cardano projects is a lack of information outlining stories of projects and technologies building on Cardano", "f6_no_assessments": 8, "f6_rating": 2.958333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2554, "q0": "This proposer's solution in bringing more information showcasing Cardano's technology as well as stories on projects being created in the ecosystem is based on the successful production via podcast and youtube presence. As we move forward in media outreach within & outside of Cardano, it seems like these types of educational tools will have an impact on listeners and viewers. Content itself is not enough to reach a wider audience, but with the help of known entities in the space, companies/businesses and other entrepreneurs building on Cardano, it may highlight this information and overall awareness in the ecosystem. Having a loyal following via social media such as Youtube and podcasts, it is important to note that without an existing subscriber base (under 5,000-10,000 viewers) it may be difficult to have a guaranteed significant impact on the Cardano ecosystem. Having reviewed previous content from the proposer, it seems likely the channel will grow but by how much is still uncertain.", "q0r": 2, "q1": "From the proposal presented, it does not seem feasible that one content creator, the proposer, could verify the numbers given in the timeline. What makes the number of listeners continuously grow within the months of one episode to the next? From an estimated 2,000 listeners for the first interview (optimistic) to a massive one million listeners/viewers by the final episode, this seems unrealistic in regards to past impressions/views of material, and user activity thus far on the channel. Properly marketing the episodes and it's future guests presented on the podcast/youtube channel, it could seem more likely the results of these interviews will add significant value to the Cardano community. Budgeting evaluation for such tasks towards the solution of the problem facing Cardano, bringing more awareness and educational content representative of the blockchain and the people involved within the ecosystem, this proposal fails to validate it's expectations. Starting with Project management, what exactly is the breakdown of this expense? The proposal of 30 interviews over the course of 8 months, in total would equal $1,160 per episode ($34,800). This over the course of the timeline seems more understandable on a macro scale, but will this amount of funding bring an audience of this caliber the same value back into the Cardano ecosystem, in terms of cutting edge information? Who is being interviewed and are they a valid members growing with Cardano; are they well known or newly building on the platform? Project Catalyst must weigh all these variables. The proposer could possibly work on building their media presence first before funding is granted or perhaps sharing more detailed intentions towards the content mentioned. There's no doubt that the more media presence to the Cardano space, the better informed new users as well as the veteran members of community will be long term.", "q1r": 2, "q2": "The proposer has set some very ambitious goals in terms of accomplishing a solution to the overall problem of bringing forth more information and highlighting businesses/companies/projects in the Cardano ecosystem. The auditability aspects of the proposal mainly depends on if the interviews can be done, in accordance to the press releases (where these will be released is unclear but should be noted for progress of milestones to be viewable from PC members) and the number of listeners/viewers across all platforms. None of which really can be defined successful until the first interview is aired. Where can the numbers of these listeners/viewers be seen from each episode? Is this publicly shared information that could gauge the impression it may have on the Cardano ecosystem? There does not seem to be a clear understandable solution that addresses the problem, that funding such a proposal would solve. It is thought that after funding the listeners/viewers will come flowing in with every subsequent interview, yet the subjects of these interviews are still undefined. Having some sort of details to whom and what importance they will bring to the Cardano community would be best outlined in the proposal before any further actions can be taken.", "q2r": 2, "assessor": "z_assessor_1529", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1025, "q0": "This proposal is a blueprint that lacks detail and clarity. The problem to be solved is not identified as the challenge presented. Not sure what the goal of this proposal will be for the community or Cardano.", "q0r": 1, "q1": "I see a lot of feasibility problems in this proposal. The professional capacity of the proposed author is not good such as lack of creativity, lack of attractive host, no communication ability. That is shown by the video they have made on the channel and the number of views is extremely low. This makes it very difficult to guarantee that the author of the proposal will attract the audience to see the content of their interview.", "q1r": 1, "q2": "Lack of specific performance metrics and metrics to demonstrate how a successful outcome of the proposal will address the challenge presented. Those metrics like new signups, views, watch time, backs.", "q2r": 2, "assessor": "z_assessor_1253", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 4589, "q0": "People of this generation love podcast ,where they can even run these podcast during their work , hence coming up interviews with block chain leaders will provide great knowledge on Cardano's projects and also boost people in investing more towards cardano .\nThis also addresses the challenge for those people who has misconception on cardano's future project hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The plan has very high chances of being successful ,since it doesn't require any 3rd party help ,where they already have partner podcast team , bringing the cardano giants might be small setback other than that,  it will direct interaction from cast to audience , which will definitely boost people to invest in the cardano for the future projects ,so the plan presented ,it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer has clearly mentioned about the podcast partners that he'll be using , and also provided very much detailed roadmap of the project, he has also presented some of his old work which were pretty good.\nThe proposer has even presented his target by the end of jan 10 of next year, which shows   he has gone through all the  possible aspects for long vision in this presentation, hence information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 4969, "q0": "I believe that the idea of having interviews with many interesting people that represent Cardano ecosystem is very beneficial for learning and introducing this community into the world. As a filmmaker myself i know that the message well spread impacts strongly and faster. So yes interviews could be a great media resource for the ecosystem of any community for both education and inspiration.", "q0r": 4, "q1": "Looking at the links provided I can see that Glory Tshokama has experience in interviewing people. But that is not enough to make a successful project. He has very little views and it is vital to not only record people but being able to gain popularity for the message. \n\n\nAs he states he will get one million views but on the perspective of even 4 interviews gaining two thousand views it doesn't necessarily equals one million if you turn them into thirty two interviews. In my experience people view what is relevant to them. So the hopeful thinking here is not backed up with any strong evidence of success.\n\n It is very hard in the world full of media to stand out. I would suggest that he spends more research into how to spread the word and which platforms he could use to benefit the relevancy to the audience.  \n\nHe is stating that it will take 8 months. It is not clear how the process look.  I would like to see more details indicating the amount of work for each step/time required x corresponding remuneration.\nHow long takes the editing, what platforms he is planning to spread press releases so that they can inspire/educate and be interesting.  Actually there is not much knowledge of the Cradano community backing up the interest to make interviews. You can be interested in everything but you need to know what you are promoting to the world. So in Glory Tshokama proposal I didn't gain enough of research onto what he knows about Cardano itself.  It would really help if the person behind the media message is passionate about the project/community itself.", "q1r": 2, "q2": "Though there is clarity in the description of the problem and good enthusiasm in solving it the rest lacks good plan and reliable value. We can make million interviews and post them somewhere but I believe that's not what creates momentum and inspires others. In the world clogged with information we need to know how to stand out as well as spread the message. The roadmap of tasks and actions needs to be backed up with more research of different relevant platforms. The metrics of time is needed and budget are not clear and indicate lack of understanding and research into the problem. The audience growth and progression of the views is too vague.", "q2r": 3, "assessor": "z_assessor_1808", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5278, "q0": "proposing does the creation of weekly podcasts. The podcast content is interviews with leaders in the Cardano ecosystem. Podcasts are then posted to available media sites. In my opinion, this Proposal meets the objective of the challenge. Sharing the knowledge and stories of the founders and leaders in the Cardano ecosystem provides accurate, valuable, and engaging content for me. I think that content has value and can attract the community. This helps the good knowledge about the Cardano ecosystem to spread widely. so the Proposal will help add value to the Cardano ecosystem. I am confused about the solution to the proposal. The author should show how to do it instead of just talking about what to do and achieving what results so that readers can better visualize the solution offered. One podcast per week seems a bit low. it would be nice to be able to produce 3 or 4 podcasts per week.", "q0r": 4, "q1": "Unfortunately, there is no information about the project team. It is better if the team provides information about the experience, relevant knowledge to carry out the project, and the link to be able to verify the information provided is true. It's good that the author has included some links to podcasts he has done. That helped regain my trust with the team. The roadmap is presented with clear timelines and metrics. Enough for readers to grasp the roadmap and implementation results. The lack of solutions presented in the plan makes it impossible for me to assess the feasibility of the proposal even though the numbers appear to be feasible. It is better if the timelines come with specific tasks. (Eg: Contact the founders of the projects; prepare interview content; Filming and video editing;...). The budget breakdown is sketchy, it should be broken down by specific tasks (e.g. editing 1 video: $200; Marketing on Fb per podcast: $300;...) to represent that project feasibility.", "q1r": 3, "q2": "Project results are evaluated through three indicators: number of interviews, number of press releases, and numbers of listeners and viewers across all platforms. In my opinion, those indicators are enough to determine the success of the project. Parameters are shared on the project websites and social media. This is transparent and completely verifiable. The author provides attachment links to the media sites that the team is working on, podcasts.apple.com, oppen.spotifi.com, podcasts.google.com. I listened to a few podcasts and I was intrigued by its content and presentation. Relying on the results that the team is working on increases authenticity and gives me confidence in the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1908", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5562, "q0": "The proposer mentions in the problem statement that “The biggest problem with Cardano projects is a lack of information outlining stories of projects and technologies building on Cardano”, which is not quite true, there are many sources of information, many podcasts and YouTube channels that are offering the exact information, the proposer wants to produce.\nBesides this, the main idea behind the proposal is to build a YouTube channel with interviews, that will be “a massive win for the Cardano community members and enthusiasts”, “will attract massive engagement for the Cardano blockchain”, “will be a tremendous benefit for the community” and “The impact will be remarkable.” However, there is not much info besides these hyped statements, and as such, I cannot evaluate whether the project will fit the challenge brief of building a bridge between YouTube and the more traditional media, and how it will impact the Cardano ecosystem in general.", "q0r": 2, "q1": "The project roadmap consists of a timeline with the scheduled podcast sessions (as a time, not as a content), and have also the number of listeners included for each, and that is not an information adequate for the detailed plan, but for the success description, as it is not a certainty but a desired result of the project. The budget is not clearly described at all, there are 3 main categories offered, but I cannot assess how those numbers have been calculated and if the are feasible.\nThe proposer does not offer any concrete information about his skills, previous work or professional social profile links, there is only a bullet list of some skills he claims to possess, but I am not able to verify those claims.", "q1r": 2, "q2": "The progress measurement is somewhat well described, since it will be a series of podcasts, that the community will be able to verify their upload on the social media channels easily. \nThe success description is very idealistic, with no clear milestones provided “Success for this project is providing lots of exclusive interviews” and as such, it will be hard to evaluate the impact it will have.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5619, "q0": "The idea of offering innovator's stories is a good one. Having an avenue for show casing existing and upcoming Cardano projects will provide value to the ecosystem.\n\nThe project fills the need in the challenge of adding to the # of multimedia projects.\n\n", "q0r": 4, "q1": "The expected growth path of the project doesn't seem reasonable. On Youtube the proposer has a subscriber base of ~1000 and low engagement of those subscribers, low ongoing viewership. On the other platforms Rankadvertising is on there is no viewship information available.\n\nGiven in the first month the proposer expects 2000 listeners. Although this is possible to obtain with the suggest marketing budget of 10K, the growth trajectory to 1 Million over 8 months appears unrealistic and require significantly more marketing. Further, the level of ongoing engagement obtained through marketing rather than natural growth is shown to be lower as maintaining an audeince can be challenging over a long time frame. Take the example Kaizan Crypto, one of the major influences in the Cardano ecosystem who has been in operation for a significant time. He has ~30K subscribers and a few ~1000s views for their videos. https://www.youtube.com/c/KaizenCrypto/videos.\n\nA breakdown of the various budget points is desirable. There is no way to gauge the current worked required to achieve the stated outcomes. \n\nThe model of participant acquisition also appears to be that projects will approach Rankadvertising to participate - this is also unrealistic, at least while viewship numbers are low.\n\nHighly suggest this proposer look to offer a shorter project (say 3 months) for less funds that would allow them to establish creditably and viewership in the community and to provide a proof of concept before expanding. The budget ask is ~1/3 of the total challenge and it is therefore not possible to support.", "q1r": 1, "q2": "The existence of the Rankadvertising Podcast is confirmable. There is not way however to confirm the size of the existing audience, or how the proposal expects to grow their audience at such as high pace over a short period of time. The expected growth path is not founded, and somewhat unrealistic.", "q2r": 2, "assessor": "z_assessor_209", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8860, "q0": "I agree with this author's idea, simply because behind every successful project there are always good stories that need to be conveyed, through which it will inspire and motivate to continue, so Having a home where gathering success stories from Cardano projects is an interesting initiative. If funded, the project will be to add value to the Cardano ecosystem. This project has identified part of the problem to be solved of this challenge, but the scale of the impact of the project is very large, as it is heard every day all over the world.\n\nCardano's scale is increasingly expanding, so it is necessary for projects like this to accompany, in addition to conveying messages from successful project owners, people will see the growing popularity. of Blockchain, of Cardano, and they will have confidence that they will be as successful as the VIP guests invited to interview. This solution is amazing, it identifies almost every problem in this challenge, the author's arguments are logical and clear.\n\nThe project has mentioned some risks when implementing, in addition to some of the solutions that the author proposed to overcome it, but the community needs more solutions for those risks if the project is Funded. Managing all the risks that the project will face when it is implemented will help keep the project on track, in addition, it will also help the community understand the difficulty if the project is funded. (For example, how will the author handle it if the number of visitors is not achieved as set out, do the interviewees tell their own stories?...) of course, if listed. The more the better for the project.", "q0r": 4, "q1": "I agree with the intensity of interviews and the number of press releases as well as the number of listeners through each period, however, the author needs to add \"on all platforms\", so which platforms specifically Please?!. Great when the project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project aims at are also very specific and completely achievable.\n\nThe list to be disbursed has been listed by the author but needs to be shown in more detail, in my opinion, the author can be more specific such as Marketing and advertising on which platform? How to track the work of the project manager, edit the executed content?. The budget is already 20% over the total budget of this challenge, compared to the information the scheme provides, some of the project expenditures need to be clarified if it is Funded.\n\nThe implementation staff has been assigned specific jobs, the listed experiences are suitable for the project, but the identity of the members is difficult to verify clearly. The organizational chart of the project is reasonable, but I don't see any reputable links to identify the project members' identities (Names of members, associated profiles, Linkedin, Twitter, Facebook,...", "q1r": 4, "q2": "By tracking three key performance metrics: Interviews, press releases, and listeners and views across platforms, this is fully trackable and verifiable by the community, great, the scheme has great transparency. The project provides KPIs, but the overall goals are easily measurable compared to the information the project provides.\n\nI came across the Website: https://www.rankadvertiser.com/podcast it's very interesting, I see this as a real test of the project like the project is being worked on and implemented. The scheme has clearly defined success, the information from the scheme showing what is being done and how it is being done and testing has had significant initial success, which is amazing.\n\nA piece of completely new idea information on the Cardano platform, which has never received any funding from the ecosystem. This is the first project on Ideascale and also a new challenge, it will be great for me to continue to see it appear in the future.", "q2r": 3, "assessor": "z_assessor_709", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "The Rankadvertiser Podcast channel will focus on bringing the stories of Cardano ecosystem development to the Cardano Community.", "experience": "I have been hosting stories of entrepreneurs and businesses on Rankadvertiser Podcast. I have interviewed multi-millionaires founders like Sam Kamani, Purdeep Sangha, Sunil Godse, Lane Kawaoka, and more. I have experience in entrepreneurship, project management, and advertising."}