{"id": 405138, "author": "rsw33n3y", "title": "ADAO Education & Marketing Content", "url": "https://cardano.ideascale.com/a/dtd/405138-48088", "category": 26452, "amount": 9750, "description": "A lack of educational DAO content within the Cardano ecosystem.", "f6_no_assessments": 7, "f6_rating": 3.2380952380952377, "videos": [], "media": [], "f6_assessments": [{"id": 287, "q0": "From a voter’s perspective, the Impact statement is vague. It is also concerned with areas outside the Campaign Brief, such as “learning styles” and “experience levels.” These areas may be helpful if first the goals of creating content for National Media, TV, & Film (a main thrust of the Brief) and other stated goals are first clearly met.\n\nThe author addressed creating content in multiple languages, indeed part of the Brief. Though, if unfunded this round, this assessor suggests specifying which languages the team will be working with. At present, the lack of detail compounds with the unrealistic notion of “every” used when they talk about the ‘challenges or risks foreseen’: “The main challenge is making content…for EVERY learning style, language/culture and experience level” (assessors emphasis on “EVERY”). Surely, an unattainable goal in 3 months. The author might instead answer: “what can we do in 3 months?” For instance, voters could trust a proposal that specified the exact number of languages (perhaps 2 or 3) in which, again, a specific number of DAO-related videos (maybe 5 or 6) would be produced under the particular titles X, Y, and Z.\n\nIn short: Simplify the proposal for the 3-month funding round, specify what work is to be done, and cater only to the needs of the Campaign Brief. These are the elements of successful Catalyst Proposals.", "q0r": 2, "q1": "This section asks for a detailed plan and timeline. The author’s answer begins with: “Content is never a finished product…” The problem is that this is more a philosophical answer part of an unrelated conversation about film-making, etc. Instead, we only need specifics of finished products (i.e. the number of videos uploaded for distribution). Eliminate the fluff.\n\nOne area of great clarity is ‘whiteboard videos.’ We can see this image! Now you can add further insight with answers to questions such as: Who will use the software? Who are they? What is their rate? Who will write their script(s)? What does that individual charge? Who are they? Adding this clarity will have your voters only concerned about asking themselves: “should funding be spent on making content around the often confusing topic of DAOs on Cardano?” Of course, it is likely a resounding “yes!”\n\nWith many years of experience consulting groups on business plans, I offer the following. Budgets are easily readable when they are number-driven. Detailed breakdowns can make a reasonable budget feel “lazy” to a reader––but you are not lazy! Clarity earlier in the proposal will lead to a more number-driven budget that comes as a natural outcome of the work put in.\n\nThe Feasibility section reads like you are searching for agility. However, this assessor believes that if specifics are added, from the outset, the team could predict potential gaps and be able to predict more accurately where they will be spending on items such as hiring outside help.\n", "q1r": 2, "q2": "If, first, the author employs clarity in the other two sections of the proposal, it will undoubtedly lead to an audibility section that will be far superior to what it is at present. Their answer to the first question is representative of this point.\n\nThe suggestion above of clarifying the number of videos to be produced, in a specific number of named languages, etc. would then lead to a list of tangible KPIs that will measure outcomes directly related to funding. At present, this section is severely lacking in mechanisms for measurement that would offer a voter any hope of success.\n\n\nSocial media follower counts are easily manipulated. That being a widely known fact, this notion should be seen as a disqualified metric. Instead, a concrete number of how many viewers/learners directly benefit from the funding you could receive would be a far superior measure. Again, once a more concrete goal and roadmap are established in the earlier sections, this section will be able to offer a clearer vision for auditability.\n", "q2r": 2, "assessor": "z_assessor_1134", "no_vca": 12, "ne": 7, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 755, "q0": "The proposal is for a series of short whiteboard videos that explain concepts around DAOs in general, and ADAO in particular.  This proposal also seeks to provide significant multilingual support which I give high marks for.  One thing I appreciate, is that in assembling the team for this project, they are relying on a decentralized team spread across the ADAO community.  To the extent that specific skillsets don't present themselves from this cohort, they will go outside the DAO community to find someone suitable, but my early investigation on their discord indicates they have plenty of volunteers.  On-chain and decentralized governance is a topic near to my heart, so seeing proposals that address education on the subject always get my approval.  The only area where I hesitate is that this info will need to be well thought out, and the general approach from the team is scattershot.  I would like to see them dial in  a couple of parameters, specifically which language support they will offer to start, and what learning styles they aim to capture here.  My impression is that they just mean the videos will help reach learning styles their articles aren't or something like that, but it would be nice to see this clarified.", "q0r": 4, "q1": "The budget is well laid out and as a scriptwriter, I love seeing them put most of the work in that area.  After all, this is an educational project, and that starts with getting the lessons right.  Another big chunk is available for the translations, which I love, but again, I would like to see some specificity here about which languages are supported.  I appreciate what they are saying about pulling the team from the community but I would prefer that they had already gotten some commitments for that, or some sample work.  The budget does seem adequate to assemble a team on the fly, but for the illustrator especially, I would like to see some work.  The number of videos made is left a bit open ended and I don't know if the timeline is ideal, with 2-3 months being listed for, I think, 30-50 small videos.  I don't think they have pinned this down enough, and I would be surprised if 2 months is long enough to even make all the scripts for 30 shows.  If these numbers were more specific, this would be an easier grade to raise.", "q1r": 3, "q2": "As DAO builders I trust that whatever other shortcomings are present, they won't have a problem setting up a project workflow with natural audit points.  With that many shows being released, they should have multiple metrics going up each week, from scripts finished to videos.  They final target is unclear...is it 30 shows?  50?  I appreciate that they see a potential for plenty of productivity, but the point of having the number is so that the progress towards completion and full release of funds can be monitored.  They will need to settle for a number in order to present this to the Catalyst audit facilitator.  As an opensource team, I expect that all the relevant tracking will ultimately be done, however, so this project should be able to stay on track, once that destination is defined.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2974, "q0": "Having a library dedicated to educating all levels of the Cardano community members in multiple languages is vital to the success of scaling Cardano, especially when you factor in the new influx of people on a regular basis we are seeing daily. We are only going to continue to grow so having a library with different levels of expertise gives newer community members a chance to learn from the beginning which builds a foundation as they will have access to higher levels of information. This will also save Cardano members time by not having to spend several hours searching various search engines filtering through material that isn’t always accurate information. There is a lack of knowledge of DAOs as well as new DAOs being introduced to Cardano every week. This proposal will help bridge that gap by providing information for people of all skill levels. You hit it right on the head when you mentioned having different learning styles as everyone learns differently. Some people are visual learners while some are readers and having the content in multiple languages will allow for more people to have access to the information. ", "q0r": 5, "q1": "What I did like about your proposal is that you broke down the topics which would start off as an educational mini-series and develop into more in depth topics so newer community members are not intimidated by the more complex information. Three months would to be enough time to generate some solid content which would give you a great start. What languages were you planning on translating in?  I did not see that in the proposal. I think Spanish, French, Chinese, German, and Japanese are a great start but would love to see many more languages added in the future. I liked how you broke the budget down by price with a detailed description so we know where the funds would be allocated. It is a good start to getting this proposal executed. The more content that can be distributed about Cardano DAOs on various social media platforms the better it will be for new members looking for information. Your team is solid as they have a wild range of skills and talents to complete this proposal but maybe it would have been nice if you shared a little intro to introduce the team members. ", "q1r": 5, "q2": "As they say numbers don’t lie which means by tracking the numbers you will be able to measure how effective each area is within the 90-day, 180 day and 12 month marking period. Tracking social media analytics is a great way to measure progress as well as judging what content will work best for what social media platform you choose to use. The subscriber/ follower goal you have set is a very obtainable goal. The only thing I could suggest is starting the Facebook sooner than the 6-month mark. I would say get it set up right away. Creating a content calendar is very helpful and needed when structing your posting schedule. Plus, then you can develop a posting plan by telling a story where each post grows into the next post. This is a proposal that the Cardano community can benefits from regardless of if they have been around for several months or years or even if they are brand new to the Cardano Blockchain. Look forward to seeing this project grow.", "q2r": 5, "assessor": "z_assessor_1596", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4676, "q0": "DAO is one of the mail pillars of the blockchain ecosystem. The sheer lack of awareness is only second to the lack of importance given to DAO. The first step in this direction would be to impart education to regarding the same across all age groups. multi-level and multi lingual trusted platform to achieve the same is very important. Similar projects for DAO are very less, since most of the FAM proposals are for making documentaries or education content which covers broader and more well known aspects of blockchain implementation.", "q0r": 4, "q1": "The budget breakdown considers only content creation details, which shows none is being invested in marketing. This creates a little confusion about you achieving the audit targets, especially when you mention the work needs to be done in terms of advertising in different social media platforms. The work-experience of the of at-least the people who are going to be involved in the project should have been included in form of LinkedIn/other profiles or previous similar work experience should have been mentioned. A broad term of \"Our Team\" or \"Outsourced work\" doesn't provide any information regarding the expertise of the personnel involved. The mention of number of languages should have been added to justify its budget of $3000 also include estimated hourly price for each translator. The script and copyright budget of $4000 could have been lowered.", "q1r": 3, "q2": "The auditability parameters include Twitter YouTube Instagram and Facebook, viewership and subscribers which are well specified, and broken down appropriately into period of 3, 6 and 12 months. However the specific number of videos and length of videos, under each learning style group or age group should have been specified. The total number of languages should have been specified.", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 4998, "q0": "The proposal brings a vague problem statement and starts from a premise that was not justified in the course of the proposal's content.\n\nIn general, the proposal in question is actually still drafted as an idea. In this case, it can be considered an excellent idea!\n\nIf this is indeed considered to be a relevant problem, the proposed solution still needs a reasonable justification. In addition to presenting clearly how this idea will get off the ground.\n\nServing as a marketing manager for the past 4 years, I would like to see a more detailed presentation of why this issue was identified as a problem, who/what it affects and what is the conclusion behind this solution. Will this solution solve this problem because the community needs it? This analysis was not in-depth enough.\n\nRegarding the correlation with the challenge, there is a great distance. The proposal does not meet what the challenge is intended to solve. It remains, among other things, to point out how this content will go beyond digital media towards traditional media.", "q0r": 2, "q1": "The author of the proposal has not clarified who will be involved in the project. The description used, that the community will carry out the work of producing the content, does not guarantee the quality of the execution and the experience of those involved.\n\nAnother point that the proposal is limited is in the identification of skills needed for the project as a whole. The list of different professional formations does not clarify the formation of the team and the number of those involved.\n\nRegarding the budget description, I would like to see how it will be used in phases and according to planned deliveries. The superficial presentation of the budget makes it difficult to analyze the feasibility of the project.\n\nUnfortunately the plan and schedule is based on generic definitions and, as mentioned earlier, with an idea formulation. The evolution of this idea and validations, can become a proposal with the expected level of detail.\n\nThere were no mention of risks for project delivery. In addition to knowing that the project will test different formats and analyze feedback, it is important to identify what can get in the way of project delivery.", "q1r": 1, "q2": "The proposal did not describe how the project development process can be audited. In addition, notions of the roadmap and schedule were not clearly presented.\n\nRegarding the KPIs, the author defined some objectives he has for 3, 6 and 12 months, but the rationale behind this estimate was demonstrated. It would be important to understand the rationale for using these indicators and how they point the way to project success.\n\nAnother superficial response was about the success of the project. In addition to seeing the growth of the community, we need to understand which paths the project itself intends to take.", "q2r": 1, "assessor": "z_assessor_1818", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5569, "q0": "The scope of the proposal is to create a library of content regarding ADAO and DAOs on the Cardano ecosystem.\nSince it is not described at all, I could not assess the impact of content related to ADAO, they have not presented their achievements so far, or why it would be important to have an online library financed that would provide information about them.\nRegarding the second part, about DAOs in general, that could indeed be more interesting, though whiteboard, informational videos is not a format suitable for the more traditional media, which this challenge aims to build a bridge with.\nAs such, due to the information provided so far, I cannot find this proposal suitable in this challenge or properly evaluate its impact on the entire Cardano ecosystem.", "q0r": 2, "q1": "The detailed plan offers a glimpse into what possible questions will be answered in their informational whiteboard videos, but not much detail about how long each video will be, if it will be only a whiteboard video, if it will have a voice-over or the person making the notes will also be narrating etc.\nThe budget is divided into the main sections, but there is no further information on how those numbers have been calculated, i.e price per hour, hours needed, fixed cost etc.\nThe team details are very superficial, no names have been provided, no social profiles to check the skills they possess, no kind of information that would give the community confidence in the team’s ability to deliver the project.", "q1r": 2, "q2": "While the proposers have provided a lot of information in the progress measurement section, the question has not been quite addressed. The KPIs that have been provided need to be connected with a method of measurement, that can be verified by the community independently, for example: where can the community check the informative pieces being produced etc.\nThe information provided would have worked better in the success description, as they are clear milestones of success - followers on social channels on a timeline of 12 months, divided in a quarterly growth.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8241, "q0": "Reading the proposal, it is clearly pointed out that the problem is the lack of a library of educational and marketing DAO content. The proposer offers a solution for creating an education library that is in line with the outlined challenge settings. The proposal can be extended to future challenges. It is stated in the proposal that the creation of 30-50 video content would surely give value to the Cardano ecosystem. Everything that is needed in terms of impact is clearly listed so I strongly agree.", "q0r": 5, "q1": "The proposal is missing the links that could provide us information about the team, necessary skills and experience of the team needed to implement this project. The budget is clearly presented and elaborated. The proposal states a clear plan for the completion of works within 2-3 months and describes the necessary resources needed for project implementation. It might be good to list possible challenges and risks in the implementation of this project, because it involves shooting a large number of videos so if any challenges and risks happen we know how to deal with them. Due to the lack of information about the team and possible risks I neither agree nor disagree", "q1r": 3, "q2": "The proposal clearly presents what will happen and how the success of the project will be monitored over 3 months, 6 months and 12 months. The community can easily follow the work and development of the project. As all parameters in Clarity / Auditability are met I strongly agree!", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Build a library of educational and marketing DAO content.", "experience": "ADAO is made up of a wide variety of talented individuals that will be able to build and maintain this DAO content."}