{"id": 370072, "author": "", "title": "A.S.T.O.P. - Stop Scams & Threats", "url": "https://cardano.ideascale.com/a/dtd/370072-48088", "category": 26117, "amount": 20000, "description": "Charles Hoskinson is sick of scams harming Cardano ADA, he wants a proactive group to find ways to stop them for all stakeholders", "f6_no_assessments": 7, "f6_rating": 1.9047619047619049, "videos": ["https://youtu.be/jB-nSxAmse0"], "media": [], "f6_assessments": [{"q0": "This is a proposal to build a network of people to stop scams. That would be great. But how will you and they do it, how will the be compensated. It doesn't seem like  a scalable solution. ", "q0r": 2, "q1": "There is no concrete plan on how this proposal will solve the problem, just a statement of the problem then asking for some funds to build a team to build the solutions. This is the same story as in the proposers other 9 proposals, except this one doesn't even have a plan and timelines. ", "q1r": 2, "q2": "Whilst there is a road map, the deliverables aren't very specific. Please provide a plan for what you will actually do, rather than a proposal asking for cash to the build a plan on what to do and deliver. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The proposal wants to establish a framework as well as a shadow network and backup network of the Cardano Blockchain. While the idea of pulling existing recources together to align all forces, this proposal does not offer a clear pathway about what the intended framework would look like. Why did the proposer not reach out to the hackerone bounty team that he used as possible reference? It would be more credible if there were already some partnerships with active groups like the Catalyst dry-runs or the mentioned bounty group or stakepool operators that would be interested in joining the team. The proposal would fit better in the \"emerging threat\" as it does not aim to support SPO´s.", "q0r": 2, "q1": "I would see the proposed idea of a framework and the shadow network being two different things at the moment. While I would agree that this proposer might be able to add ideas and get in touch with people, he will have to rely on future cooperations to install any technical developments on the blockchain so this is not likely at this point. While certain groups like the hackerone group, there is no indication of any existing partnerships at the moment, so it would be set up from scratch and there´s a high likelyhood that existing teams already have a framework. I do like the idea of trying to get most or all teams to share and work together, though. The incentives and the general financial plan are very broad and it is not clear who will be doing for instance the website so it´s difficult to see if this would be implemented - I suggest to - if the proposal does not get funded - try and set up at least a smallish team before the next round so that it is easier to see experience connected to the intended outcome.", "q1r": 2, "q2": "Some things are: for instance to start a social media presence for this framework. And to start a team. Other points are very unlikely and too broad. I see a general problem with audit because the proposal aims to start a team and prepare a framework. Without any partnerships the proposed milestones are more of loose ideas without a solid background. I suggest reframing the proposal to setting up a team and establishing guidelines maybe, that can be stored and viewed by DEV teams that want to contribute to safety measures.", "q2r": 2, "assessor": "z_assessor_19", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "While scams & hacks are a real threat to many dApps built on top of any blockchain, I feel that this proposer missed the point of the challenge. Therefore, the so-called proposal is null and void.", "q0r": 1, "q1": "He says it himself: \"I will start by saying that this is an idea for a framework that will need to be built upon by lots of people around the world, many of whom will have skills I do not have. I am happy to work with other groups & organisations, input ideas to others or simply put this proposal out there for others to implement.\"\r\n\r\nSurely the proposer has nothing but good intentions but there is no plan here, only disparate ideas and thoughts.", "q1r": 1, "q2": "As it is, this is not a ready proposal.\r\n\r\nHopefully you find a team to take this forward and return in Fund7 with a more detailed proposal that you submit in correct challenge. Thank you for your efforts!", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The problem and solution presented are reasonable but not within the scope of the challenge. as they are not related to SPOs.\r\n\r\nThe proposal presents a reasonable rationale for monitoring scams and disseminating information to prevent losses and scams in the community.\r\n\r\nCurrently, Cardano Foundation offers a channel for communicating scams, I believe it would be interesting to create a collaborative network among the Cardano community to increase the scope of the proposal.", "q0r": 2, "q1": "The nature of the proposal doesn't require high technical level, but it does require reach and ability to engage the community around the proposal, however the proposer did not provide relevant information about his reputation/involvement in the Cardano community.\r\n\r\nA roadmap with reasonable deliverables/targets was included.\r\n\r\nA budget breakdown was included, but there are not enough details for the feasibility assessment, I would recommend including more details about the different activities, people needed to design the activities and the hourly rate involved in the activities.", "q1r": 2, "q2": "The problem and solution presented are not related to the challenge, as they do not address SPOs in the proposal.\r\n\r\nThere are no metrics and KPIs. There is a reasonable timeline and deliverables/targets that help with auditability.\r\n\r\nI would recommend including more information about the number of people needed to develop the proposal and more information about the proposer's participation in the community.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "This a very good idea and if implemented will be good for the ecosystem but the information provided does not seem to be very clear,  the solution to  \"Establish a network of people to identify & stop scams wherever they appear in the world through direct action with social media  & owners\" is not ideal in the blockchain world, The Proposal does not shows any way how he would stop Scam before it appears with Billion of people in the world, For that I score 2", "q0r": 2, "q1": "The experience presented is good but The  proposer mention the creation of  cardano native token \"CHG\" into the challenge , the Proposer does not provides information how the said token will help stop Scam, So I disagree strongly that the method highlighted here is highly likely that the proposal will be implemented successfully , for that I score 2", "q1r": 2, "q2": "The measurement of the achievement of the objectives has been presented, a breakdown of the budget is available but there is no planned start date. Additional milestones would be helpful to allow for better tracking of the project. Furthermore, the criteria for goal achievement are vague. ", "q2r": 2, "assessor": "z_assessor_430", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement is one that we are all acutely aware of and it is important but it is not clear that is answers the specific challenge or contributes to \"running nodes should be prepared for disaster.\" It is more about how to protect individuals. ", "q0r": 3, "q1": "There is no mention of a team. This should be included. Also it appears that the proposer has submitted a large number of proposals with the idea of getting significant amounts of funding. I have previously reviewed a proposal from the same organisation that was related the building industry. This is a very different area and I get the impression that the proposer is phishing. ", "q1r": 1, "q2": "The budget is broken down but it does not really add any useful information. There is a plan in place broken down into 3 moths phases that provide some ability to audit the project. ", "q2r": 4, "assessor": "z_assessor_466", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "\"If I understand this challenge correctly it is looking for ideas for the recovery of the Blockchain and to pro-actively identify potential problems before they go live (happy to be corrected in the comments).\"\r\nWhile this statement from the proposer is not completely wrong in reference to the challenge, the proposed solution and problem statement is about SCAMS so the proposer misunderstood the key metrics for this challenge. While this proposal uses \"Detecting Scams\" as a problem statement and would want to set up a network to avoid and detct sams, this does not support the idea of this challenge for disaster recovery strategies.", "q0r": 1, "q1": "Relevant experience of this proposer is difficult to assess, the website that is provided lists very many areas of expertise so I would assume that this individual is very active in networking and providing services in this business. But the proposer did not include why his business experience would add value to this specific idea. The proposed plan is to provide a framework for how a global network would operate to detect and avoid spam and generally how to deal with spam. Since the proposer is one individual and not a team and no reference to how the global teambuilding will take place or a discord where prior commitment to Cardano or Catalyst can be viewed is provided, implementation at the moment is not very likely. The financial budget is allocated too broadly and contains \"anti scam developers\". While developers can certainly provide programs that detect scams, this term is a bit weird and would not point to relevant experience of the proposer in this area. I also don´t think that in 3 monts the \"management of all social media\" will be wanting to cooperate with a scam website, the ideas are too ambitous and therefore seem a bit odd. Generally, the proposed framework is not established at the moment so the proposal can only be seen as a starting point. I personally would not like the connotation of \"war rooms\" and \"sheriffs\" and \"deputies\" and all. Given the usual framing Catalyst likes - so the least authority that is possible, it seems like a bad choice in reference with the community.", "q1r": 3, "q2": "Auditability is not really addressed or given - the ambitous ideas remain broad \"high profile individuals\" and \"management of all social media\" sounds strange and basically it sounds like a real plan or roadmap at this point is not really focussed on. Here are the measures of success for the challenge as a reminder, that the roadmap and milestones do not include these things:\r\nLikely points of failure identified. Disaster communication channels set up. Recovery procedures identified. Testing procedures developed.", "q2r": 2, "assessor": "z_assessor_606", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "Establish a network of people to identify & stop scams wherever they appear in the world through direct action with social media  & owners", "experience": "43 Years in business & 23 years online"}