{"id": 383464, "author": "jtrube", "title": "Japanese Cardano Crash Course Video", "url": "https://cardano.ideascale.com/a/dtd/383464-48088", "category": 26252, "amount": 10000, "description": "Интерес японцев к криптовалютам и технологии блокчейн растет, но многие все еще не решаются инвестировать или участвовать в сообществе.", "funded": 1, "upvotes": 66552398, "downvotes": 3779372, "votes_result": 62773026, "votes_cast": 133, "f6_no_assessments": 7, "f6_rating": 3.761904761904762, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer identifies the problem that many Japanese are hesitant to participate and invest in Cardano. As a solution, it offers educational video production about blockchain and crypto fundamentals. The proposal appears to be in line with the challenge as it has the potential to attract new non English members to the Cardano community.", "q0r": 5, "q1": "The proposer has attached a link to the site of his work where it is possible to assess that he seems to have relevant experience to implement the proposal. The budget has been detailed and appears to be reasonable for the proposed work. The proposal has a realistic deadline for its completion. The proposal presents a roadmap with milestones where it is possible to understand what will be done and how it will be done. The proposer describes the resources needed to implement the proposal. The proposal does not appear to pose greater risks for its implementation. ", "q1r": 5, "q2": "The proposer clearly presented the target problem and its solution. A roadmap with milestones was also presented, which are important for monitoring the work's progress. And it presented KPIs that are important for evaluating the success of the proposal.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely that many Japanese are still hesitant to invest or participate in a community.It is clear that this proposal falls within the scope of the challenge brief by creating a master class video in Japanese \r\n\r\nThis proposal shows somewhat how it adds value to the Cardano system by creating master class video in Japanese \r\n  Key metrics are  stated such as number of views.Proposal can scale to address future challenges by further adding more content.This project will have a positive impact on Cardano system by increasing the awareness and knowledge among Japanese speakers.  I cannot say that this project adequately addresses the challenge  hence i have given it a 2 star rating.\r\n.\r\n \r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.", "q0r": 2, "q1": "The proposers have provided no evidence  of themselves with their skills and experience in translation or these sort of projects. The Linkedin Profile has not been provided.  The company website has been provided but we have no evidence whether they could execute the same level of proficiency on DLT and Blockchain as they do with consumer brands.  The links are not sufficient. I visited the website.   I feel the proposer is competent to do these videos.  The proposal   has  indicated the core leadership. \r\nThe Linkedin profiles are not given. Only two leaders are given. He has not provided the team structure of members and their capabilities . The budget has  not been outlined clearly Everything seems to have the same price.  ALso the price is very high considering what the output is. Prices seem to have been arbitrarily chosen. The budget is   very high to achieve the set goals.  The proposer has not provided a verifiable plan if additional funding is required  \r\nThere is no plan for additional funding  if objectives are not met. Theres no detailed timetable  so I cant comment if it is realstic . The proposal gives no sensible and conductible plan for implementation.  The proposal has no technical aspects which have to be addressed . The proposer has not. identified risks in this proposal . Even though experience in consumer brand may be there, the plan presented this proposal may not be implemented successfully and budget is too high hence I have given it a 1 star rating.   I would advise you to work on the areas I have mentioned and take them as constructive feedback to improve your proposal and present it again in Fund 8. \r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\n\r\n\r\n ", "q1r": 1, "q2": "The Metrics/KPIs that define the success of the proposal would be number of videos and how many views per video and in total. A marketing budget has not been allocated. All the money seems to be for production with no thought as to social media marketing or any other marketing.\r\nThere is a clear understandable description of the targeted problem but there is no detailed solution. \r\nThe information provided is not sufficient to audit the progress and the success of the proposal hence I have given it a 1 star rating.\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 15, "ne": 4, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "This proposal aligned with given challenge problem statement, which is to provide a multilingual resource about Cardano by creating a fun and educational video, introducing all Cardano. It will further raise awareness to Cardano in Japan, and attract more people to learn about Cardano.", "q0r": 5, "q1": "The proposer provides their team profiles, and have experience proven by their work on their website. Eggworm, the company that write this proposal, able to identify the team needed for this project, proven by providing their team composition in attachment. The budget is outlined and listed in category, but it lacks of detail. How many people will work on it (budget allocation)? How many work hours will it be? These thing will help people understand how this budget is planned. Aside from that, the roadmap can also be explained in more detail. The first 3 month doesn't mention anything more than what they will do, it lack of information about how they will do it. Provide explanation on how they will prepare the first 3 months (such as finding people to become the speaker / talent for the video) will be helpful.", "q1r": 3, "q2": "The roadmap is provided, however it's still lack of detail like I've mentioned before. Metrics and KPIs is pretty straight forward, which is to see their view counts on YouTube. Tracking the progress should be viable too, since they're shooting a video set and project. Auditors can see their progress by looking at their edit videos. However, it would be helpful if the proposer could provide a target achievement in each week for their video progress. I.e the first 3 week (after 3 months), able to create 3 videos that cover the basics of Cardano in Japanese, etc.", "q2r": 3, "assessor": "z_assessor_640", "no_vca": 15, "ne": 4, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "This is an online educational project through short videos to introduce cryptocurrency to the community in Japan. It is a project in the proposed chain to promote cryptocurrency closer and more applicable to the community in Japan.", "q0r": 4, "q1": "This is a small suggestion that is quite easy to implement into content videos. But the project has not yet provided a communication strategy to convince the masses, how to reach the masses. If only online in a small group of communities, the influence will not be able to spread.", "q1r": 3, "q2": "Through the videos and content they convey, it is quite easy to see the progress of the project. And it's pretty easy to track how the project affects the masses.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "The issue raised by this proposal is clear and related to the challenge in that their solution aims to raise awareness, and grow the Cardano and Catalyst community in Japan.\r\nThis impact is clearly explained in terms of both the Japanese community and the Cardano and Catalyst ecosystem. This is reflected in the data expressed in the KPIs which are aligned with the challenge goal. ", "q0r": 5, "q1": "The experience of the participants is well detailed and supported by links and the attached slide with a list of their clients. Identifying the participants is therefore easy and appreciable. The budget is quite clear and detailed according to the tasks to be accomplished, it seems quite coherent. The technical aspects are addressed, only the risks are not clearly expressed, but this is counterbalanced by the evidence of the team's previous experience and their current work. ", "q1r": 5, "q2": "Overall, the information provided in this proposal is clear and allows the community to refer to concrete evidence of the success of this project, which is also reinforced by the evidence given in the KPIs with time data and a horizon for achievement. The accompanying video gives an idea of the type of production of the team, which is a plus. The fact that the proposal is translated into Japanese is also appreciated. Perhaps a little more explanation of how the team communicates their progress to the Catalyst community could have been provided, but a link to their site is given.", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "I think this proposal effectively addresses the challenge as it aims to build videos about blockchain, crypto and Cardano in an entertaining Japanese way (like creative advertisement videos). If they can make videos like the sample video attached, I think their Youtube channel will attract an certain amount Japanese joining Cardano. ", "q0r": 5, "q1": "I only rate 4 for the feasibility because the development plan is not complete written. The team intend to use the first 3 months to complete the plan and preparation and I think it should have been done when proposing this. Or at least, the team should have added the key content for those videos in this proposal. \r\nThe timeline is good because of considering first time a Japanese service had ever enabled users to use crypto assets as a source of e-money payment.", "q1r": 4, "q2": "This proposal combine KPIs into milestones, and it's fine but it is not sufficient enough to present what to do specifically in 3/6/21 months. KPIs should consider of the number of viewers will get onboarded Cardano. \r\nI suggest team to work more on this.", "q2r": 3, "assessor": "z_assessor_836", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This is a very helpful proposal, it produces a master class video in Japanese that introduces blockchain and crypto fundamentals, before showcasing what Cardano has to offer. Those who do not speak English, here are Japanese people can access knowledge and information about cryptocurrencies, remove language barriers, thereby raise awareness, and grow the Cardano and Catalyst community in Japan .", "q0r": 5, "q1": "While the team has sufficient evidence to demonstrate the skills and experience needed to implement the proposal, it would be interesting to know the profile of the people involved (linked in,...)\r\nA longer roadmap should be defined, providing information on how this project can be sustainable over time and is essential\r\nRegarding the staff allocation, which requires a budget of $10,000, it is necessary to further clarify how this money is used, specifically: the number of hours worked should be specified, the amount to be paid per hour.\r\nJust relying on the number of views to evaluate the success is not enough, it is necessary to have more criteria such as: the number of likes, the number of dislikes, the number of positive comments, the number of negative comments,... This makes tracking and evaluating people much easier.", "q1r": 3, "q2": "This is a very good proposal, it brings a great benefit to Japanese users in particular and the Cardano ecosystem in general. I appreciate that the proponent uses 2 languages (English, Japanese) to present information. However, the information provided in this proposal is not really convincing. To increase people's confidence in this project, I think the proponent should provide more complete information. For example: long-term roadmap, additional criteria to evaluate success, ... (as I mentioned in the previous section). Besides, should also clarify the difficulties-challenges, how to solve those difficulties-challenges.\r\nLet's work together, don't give up!", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "Создать видеоролик с мастер-классом на японском языке, в котором рассказывается об основах блокчейна и криптовалют, а также демонстрируются возможности Cardano.", "experience": "Более десяти лет занимается организацией мероприятий и созданием контента на японском рынке для таких клиентов, как Google, Porsche, Ralph Lauren и др."}