{"id": 383838, "author": "sucy", "title": "Cardano Connect", "url": "https://cardano.ideascale.com/a/dtd/383838-48088", "category": 26252, "amount": 12000, "description": "Большинство новостей и ресурсов, связанных с Кардано, предоставляются на английском языке, что является препятствием для китайскоговорящих.", "funded": 0, "upvotes": 15841488, "downvotes": 20404272, "votes_result": 4562784, "votes_cast": 97, "f6_no_assessments": 6, "f6_rating": 2.611111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Having an online database, that Chinese users could utilise to help them translate Cardano-specific terms or sentences is a tool that could be very beneficial to the expansion of the community. What I haven't been able to find out, is how technical this dictionary would be and how will the user suggested terms be validated for accuracy. Also, as the database will continue to grow, how will it financially support itself?", "q0r": 4, "q1": "There is mention of \"our team\", yet there are no further details provided. How many members does the team have, how many years of experience and proof of it do they have?\r\nWhile the plan at first sight might look simple, there are many factors to be considered. How long will it take for the initial database to be compiled? How long will the development stage for the front-end last? How will users be able to add terms, will they need to create an account?\r\nThere are many details that need to fill out all these questions and many other. ", "q1r": 3, "q2": "There is mention of hiring translators, yet the budget does not cover any expense regarding this matter. How and when will the database be compiled, if there are no funds allocated to the personnel tasked with translation. Will they be volunteering this task?  Is the proposal split into 2 phases, and translation is not covered in this one? \r\nWhat is the timeline and the expected launch date? Will there be an MVP or will it be launched as a full fleshed product?\r\nThese questions are very important in assessing the progress of the proposal, and having them unanswered leaves the proposal in an inception stage, that would need to be polished before a future resubmission.", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 17, "ne": 5, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The proposal identifies the problem that there are few resources related to Cardano in the Chinese language. The proposer offers as a solution the creation of an online English-Chinese dictionary. This proposal is in line with the challenge as it will help to attract more non English speakers to the Cardano community. The proposer does not present any plans to keep the project sustainable in the future.", "q0r": 4, "q1": "The proposer does not identify who the members of his team are, nor does he present evidence of their abilities. The budget is detailed and appears to be reasonable with the proposed work. The proposal does not have a deadline for completion of the work. The proposer presents a plan showing what will be done but does not set dates for completion of milestones, which would be important to monitor the progress of the proposal. The proposal does not pose greater risks for its implementation.", "q1r": 3, "q2": "The proposer clearly presents the target problem and the solution. The proposal presents KPIs that allow you to assess the success of the proposal. It also features a roadmap but lacks dated milestones. I think this would be important for monitoring the progress of the work in a more organized way. ", "q2r": 4, "assessor": "z_assessor_429", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely most Cardano-related news and resources are delivered in English, presenting a barrier to Chinese speakers. \r\n.It is clear that this proposal falls within the scope of the challenge brief by creating  an online English-Chinese dictionary that translates complicated terms, including Cardano-specific phrases, in seconds  \r\nThis proposal shows how it adds value to the Cardano system by creating  an online English-Chinese dictionary that translates complicated terms, including Cardano-specific phrases, in seconds\r\nKey metrics  would be  number of users, number of terms, number of social media mentions and shares, number of CHinese speakers engaging with Cardano.\r\nThe key metrics and goals of the proposal fall within the scope of the challenge. Proposal can be scaled up to address future challenges by adding more terms.  This project will have a positive impact on Cardano system by increasing the awareness and knowledge among Chinese language speakers.  \r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 4 star rating.\r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.\r\n", "q0r": 4, "q1": "The proposers  have provided no evidence  of themselves with their skills and experience in  , translation or these sort of projects.  No Linkedin profiles are given here.  The links are not sufficient. There is no way to know if the proposer is competent to do the site.  \r\n The type and number of team members required to implement the proposal is not stated.No team structure is listed. The budget has not been given in detail. No hourly rates nor number of hours has been given. The budget is not  reasonable to achieve the set goals. It is fairly high. The proposer has not provided a verifiable plan if additional funding is required. There is no plan for additional funding  if objectives are not met. \r\nTheres a broad timetable but not much details.  The proposal doesnt give  a sensible and conductible plan for implementation.  Resources  necessary to implement the proposal are described.   \r\n .The proposer has not identified risks in this proposal. Given experience and plan presented it is not highly likely this proposal will be implemented successfully\r\n This proposal is not detailed and budget is not reasonable hence I have given it a 2 star rating. \r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities", "q1r": 2, "q2": "There is no clear roadmap with milestones.    There is one Metric of number of viewers.The problem has been clearly understood but solution has not been given in much detail.    The proposer has not identified possible hurdles, challenges and difficulties. \r\nThe information provided may not be  sufficient to audit the progress and the success of the proposal hence I have given it a  2 star rating.\r\n  \r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 17, "ne": 6, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "It seems that your project will help to reach the goal wanted by the challenge but however, you should precise If you build such a platform what prevent you to open it too other language?", "q0r": 4, "q1": "From my point of view:\r\n•\tyou need to describe more what your actual team is composed of. You only mention that there are several bilingual members who can provide translation but you don't describe their experience and knowledge. You don't also mention how you will pay them? \r\n•\tYou also mention that you will hire professional translators but I don't see any budget allocated for it. \r\n•\tYou should also clearly describe more the budget and how it will be spend during the project. The budget seems also a bit underestimated due to the number important of translation that you will need to do.\r\n•\tWhat form will take your dictionary: is it an app, available on which platform, on mac PC etc… You need to describe more in what perimeter you will use your software\r\n•\thow you will integrate your platform to other cardano web platform (you explained well how you will promote your project but not how and where it will be available)\r\n•\tYou also need to give a more precise planning of the development of the project\r\n", "q1r": 2, "q2": "In your proposal, the KPI seem interesting. However, the roadmap ant milestones to develop the project are not clearly define. You should explain what the main milestones of your project are and what are the level of KPI you wanted at this time. ", "q2r": 3, "assessor": "z_assessor_602", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The proposal aims to build an online Cardano English-Chinese dictionary. I do not agree the proposal is impactful because the proposal does not address the objectives in the challenge's success (not even one): \r\n    - Increase adoption and community engagement of non-English speakers. (In my opinion, using a dictionary and trying to translate Cardano resources by themselves is not an easy and convenient way to encourage people come to learn about Cardano, so that it would not address this objective).\r\n    - Increase amount of resources in a variety of languages. (In my opinion, a dictionary with isolated words about Cardano should not be a Cardano resource)\r\n    - A sense of community and conversations. Having people around to talk with. (A Cardano English-Chinese dictionary does not help people gather and talk together absolutely).\r\nI recommend the author should build a platform in which Cardano resources would be translated into Chinese since the team 'includes several bilingual members who can provide translation, interpretation, and localization strategies' as the proposal mentions. That would help Chinese people to understand Cardano resources in an easy way, instead of trying to use the Cardano English-Chinese dictionary and translate by themselves. That would be definitely impactful: not only help to increase adoption and community engagement of Chinese speakers but also help to increase amount of resources in a variety of languages.\r\n", "q0r": 2, "q1": "There is a conflict between the plan and the budget of the proposal: Most of the proposal's plan is about to build a database for the dictionary (defining terms and keywords, organizing online discussion for Chinese speakers suggest terms, hiring professional translator). However, budget is about building the platform and marketing cost. There is no cost for the discussion organizing and hiring translator. And there is no plan for building the platform. Therefore, I strongly disagree the proposal is feasible.", "q1r": 1, "q2": "The proposal provides KPIs (just KPIs only) for auditability, no roadmap, no milestones and time horizon. Moreover, KPIs does not provide exact numbers as the proposer expects. I recommend the author should fulfill information for the community (and the challenge team) be able to audit the progress and the success of the proposal to make the proposal auditable.\r\nBecause of the missing information, I strongly disagree the proposal is auditable\r\n", "q2r": 1, "assessor": "z_assessor_714", "no_vca": 15, "ne": 3, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "Conceptually, this is a useful proposition. It generates an online English-Chinese dictionary that translates complicated terms, including Cardano-specific phrases, in seconds, with the name Cardano Connect.\r\nIt will help Chinese users to easily access Cardano-related news and resources", "q0r": 4, "q1": "The information about the team's experience is very sketchy, it will be easier to evaluate if the proponent provides more information to verify the team's experience: profiles of the people involved (linked in,...), previously successfully implemented projects,...\r\nNo roadmap provided. For a project to be evaluated, it is essential to define a short/long term roadmap. It contributes to goal setting, helping to define specific tasks that need to be done within certain time periods.\r\nAsking for a budget of $12,000, people want to know how to spend that money. As for the budget allocation, which is provided too general, further clarification is needed, it is necessary to determine how many people are involved, the number of hours worked, the amount per hour.\r\nThere are specific metrics to measure success: for example, in the first 3 months there are 50,000 visits,...", "q1r": 1, "q2": "The content provided is incomplete, lacking a basis for people to judge its success. The proponent needs to supplement and clarify the following issues: profile of participants / roadmap / success indicators / specific budget allocation,... (as I mentioned in the previous section. ). Besides identifying difficulties-challenges, how to solve those difficulties-challenges is also very necessary.\r\nThis is a good idea, if more information is provided, it will increase the trust of the reviewers. Let's work together, don't give up!", "q2r": 1, "assessor": "z_assessor_862", "no_vca": 17, "ne": 3, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "Cardano Connect - это онлайновый англо-китайский словарь, который за считанные секунды переводит сложные термины, включая фразы, специфичные для Cardano.", "experience": "В нашей команде есть несколько двуязычных сотрудников, которые могут обеспечить письменный, устный и локализационный перевод."}