{"id": 384105, "author": "benzvibenjamin", "title": "Multilingual dynamic Q&A", "url": "https://cardano.ideascale.com/a/dtd/384105-48088", "category": 26252, "amount": 4700, "description": "Не владеющий английским языком не может получить доступ к простой информации о Cardano и Catalyst", "funded": 1, "upvotes": 27745280, "downvotes": 10952859, "votes_result": 16792421, "votes_cast": 98, "f6_no_assessments": 6, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Это предложение очень хорошо соответствует цели данного вызова, а также связано с другим вызовом f6, целью которого было привлечение новых членов в Catalyst в дополнение к привлечению текущих участников. Идея заключается в том, чтобы создать сессию вопросов и ответов, которая объяснит, что такое Cardano / Catalyst аудитории, которая никогда не сталкивалась с нашим блокчейном, и перевести ее на разные языки. Теоретически, я считаю, что это идеальная инициатива для того, что мы ищем в этом вызове. Мне просто хотелось бы больше деталей в целом, например: какие-то примерные вопросы, которые можно задать, помимо более очевидных, таких как \"что такое блокчейн\", \"что такое криптовалюты\" и так далее. На каких языках мы здесь говорим в плане перевода? Как эта веб-страница могла бы интегрироваться, например, с работой команды AIM? Это будет веб-страница, но может ли AIM разработать инструмент? Поэтому необходимо пояснить такие детали, чтобы у нас было более четкое представление о самом проекте, хотя идея очень хорошая. Из-за отсутствия деталей я считаю, что воздействие реально, но его нужно усилить.", "q0r": 3, "q1": "Имеющаяся у нас информация об авторе немногочисленна. Мы знаем, что он изучает бизнес в одном из международных учебных заведений во Франции. Но нам было бы важно знать такие детали, как: какое это учебное заведение; каким бизнесом он собирается заниматься; как, по его мнению, блокчейн связан с его образованием... Хорошо, он обосновал, что блокчейн - это технология, которая будет важна в будущем, а Cardano выделяется тем, что является устойчивой и имеет цель улучшить мир, но я хотел бы знать относительно себя, как он собирается применять технологию в своем обучении/работе? Есть ли у него опыт работы; какова национальность его однокурсников, то есть на какие языки будет переведен курс. Поэтапность проекта хорошо определена, я считаю, что это хорошо проведенное предложение в этом аспекте, а также что оно не так сложно в реализации в том смысле, что единый график может хорошо указать, что нужно сделать, чтобы добиться успеха. Уровень детализации каждого этапа не так глубок, но он дает нам хорошее понимание процесса. И, наконец, что касается бюджета, я также обнаружил, что он не очень подробный, хотя запрашиваемые деньги невелики по сравнению с большинством других предложений, автор мог бы лучше объяснить каждую часть. Почему создание раздела \"Вопросы и ответы\" стоит 2000 долларов? Как эти 2000 будут разбиты на небольшие мероприятия? Я думаю, что в целом не хватило деталей как в презентации команды, так и в разделении бюджета.", "q1r": 3, "q2": "Опять же, здесь мы имеем среднюю разбивку информации. Мы знаем, что их цель - охватить около 100 человек, из которых 20 станут активными членами сообщества Cardano, перевести на 3 языка и так далее. Но нам было бы важно знать, в какие университеты он намерен обратиться, в какие страны, как он будет связываться с этими людьми, чтобы мы могли отслеживать деятельность. Было бы интересно, например, если бы люди, участвовавшие в проекте, могли дать обратную связь: присоединились ли студенты из целевых университетов к Catalyst, начали ли они изучать блокчейн, приняли ли они Cardano? Автор мог бы дать нам такие ответы в качестве формы проверяемости, Я считаю, что последующие действия в этом предложении были бы скорее качественными, чем количественными. Я думаю, это связано с тем, что важнее знать, заинтересовались ли люди, среди которых был проведен раздел вопросов и ответов, вхождением в экосистему Cardano, чем, обязательно, сколько людей было охвачено. Поэтому я бы хотел, чтобы автор способствовал дальнейшему контакту с сообществом (он мог бы даже присоединиться к группе AIM, которая уже имеет предыдущий опыт и знает, как представить результаты). Я думаю, что темы, затронутые здесь автором, могли бы быть более глубокими.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 13, "ne": 7, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "I really like the general idea of having a dedicated Q&A portal. Its much more straightfoward than courses and can impact much more languages with less effort.\r\nMy main considerations on the proposals are:\r\n\r\n1) How these students will contacted (using which filters and channels) and what does well informed mean? maybe it could include more details on what is going to be taught to them and how (will it follow a course model?) Also. how to guarantee these students will really be \"well informed\"? Maybe exams could be made, with different types of questions.\r\n2) will the students have a limited time to reply? I understand having fast reply is essential to guarantee a good user experience. At the same quality, it is necessary to ensure the quality/assertiveness of the information provided.\r\n3) Last, I'd highlight here in the proposal who the target audience is. Is the ovjective to mainly address new member already engaged questions or to attract still nont engaged people? This changes a lot the communication strategy.\r\n\r\nI like the idea to start small and see scale up aftewards and to have an open log with the Q&A, especially translating the most reputable one. Maybe some reward could be given to the best repliers. Also appreciated the idea of trying existing platforms and evaluating if creating a new one is better. ", "q0r": 4, "q1": "Proposer qualifications are a bit vague. Not clear if he alone has the contact to reach several countries or how active he is in cardano community to provide information to students recruted. Theres no way to verify the  personal information provided.\r\n\r\nRegarding the plan, it seems solid and is time-framed.\r\n\r\nBudget breakdown is ok, I'd just detail more the \" Answer the questions = $1500 (for 3 months)\". Is it to pay students or for other operational costs? are the students going to be paid by  number of replies of in a fixed way? All in all, its a cheap project with a good impact if scaled up.", "q1r": 3, "q2": "Good and simple KPIs with target. They are sensible within project scope and seem to be aligned with expectations within project scope. Milestones can be extracted from the plan.\r\n\r\nLast, I really liked the challenge section but I'd add a mitigation strategy to these risks. How to overcome them?\r\none note: it says  as challenge \"We can not cover all the languages in the world\". I'd say this is nearly impossible, so maybe it would be better if this specific challenge was narrowed down by the number of languages aimed/desired at the end of the project. Its important to set expectation straight since the beggining.\r\n\r\n\r\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 14, "ne": 6, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposer identifies the problem of not having easily accessible information about Cardano and Catalyst in non-English language. It clearly presents the solution to create a Q&A section in multiple languages. This proposal has the potential to add value to the Cardano community as it can increase the engagement of non-English speakers with a simple tool. ", "q0r": 5, "q1": "The proposer did not show evidence of his skills relevant to implementing the proposal. The budget has been detailed and appears consistent with the proposed work. The deadline set is suitable for the job. A plan was presented showing what will be done and how it will be done which is important to assess the feasibility of the proposal. The proposer considered the risks and challenges of its proposal.", "q1r": 4, "q2": "In the proposal it is clear what the target problem is and its solution was also well described. A roadmap was presented with milestones and KPIs that are important for monitoring and evaluating the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely that  Non-English speakers can not access easy information about Cardano and Catalyst. It is clear that this proposal falls within the scope of the challenge brief by creating a dynamic Q&A section for newcomers in multiple languages.\r\nThis proposal shows clearly how it adds value to the Cardano system as it would create a dynamic Q&A section for newcomers in multiple languages where they could ask questions and get real time answers from people, not bots. They would get answers in their preferred local language. Key metrics are clear, reasonable and realistic. THese include contacting of students, teaching the students about Cardano, Creating the Q and A Rubric, in the form of a web page or a content repository of all possible questions which would grow. The key metrics and goals of the proposal fall within the scope of the challenge. The list of metrics and KPIs is comprehensive and well laid out. It is a simple enough plan, easy to execute.  As questions grow the repository would also grow. Proposal can scale to address future challenges by further adding languages and students to answer questions. \r\n\r\nThis project will have a positive impact on Cardano system by increasing the awareness and knowledge among non English speaking newcomes to DLT and Cardano\r\n\r\nI cannot say that this project adequately addresses the challenge but I also say it would be useful hence i have given it a 3 star rating.\r\n\r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.\r\n", "q0r": 3, "q1": "The proposers have  not provided evidence  of themselves with their skills and experience in building these sort of projects. The Linkedin Profiles of Core leadership has not been provided. They are students at a business school in France. While the concept is simple,no proof has been given that they are able to execute this plan.  The links are not sufficient. \r\nI have visited the links.but its to the corporate site of the school, not anything of the proposers themselves. I cannot assess if the proposer is competent to build this content since no information has been given as to prior experience in this area. \r\nThe proposal   has stated that the students of the school from 10 countries will work together and reach out to other students.  There is no guarantee if other students will join, or if they would be competent in providing this service in an efficient and timely manner.He has not provided the team structure of members and their capabilities and has mentioned other partners who he would work with such as web developer.\r\n The budget has  been outlined clearly and broken down into identifiable items. They have allocated themselves 1200 USD for learning.  This should not be a cost factor per se since learning is a voluntary process and should not need to be paid for. They can charge for answering questions but learning itself should not be charged for. 2000 USD to create a simple web page by which questions can be added and a repository created is far too high, speaking in my professional opinion as a web and solutions developer for over 20 years. The budget is  not reasonable to achieve the set goals.  The costs are higher than I feel are reasonable. For example 2000 USD for a simple web site seems somewhat high to be reasonable. \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\nThere is no plan for additional funding  if objectives are not met. \r\nThe timetable is realstic to build the tools and related research.\r\nThe proposal  does not give a sensible and conductible plan for implementation. It has no plan stated with no detailed breakdown in terms of the various stages of development. \r\nResources  necessary to implement the proposal are described. \r\nThe proposal has technical aspects which have not been addressed \r\nThe proposer has not identified risks in this proposal . Given experience and plan presented it is hard to say this proposal will be implemented successfully hence I have given it a 1 star rating. Also I have rated it like this because the budget is too high for such a project.  \r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\nGiven experience and plan presented and the other issues mentioned above, it is highly unlikely this proposal will be implemented successfully hence I have given a 1 star rating. If these issues are addressed and you resubmit you would have a good chance.\r\n\r\n\r\n\r\n\r\n\r\n \r\n \r\n ", "q1r": 1, "q2": "\r\nThere is no clear roadmap with milestones and a time horizon for achievement.\r\nThere are some clearly defined Metrics/KPIs that define the success of the proposal. These include reaching over 1000 people, and getting at least 20 to be active in Cardano and Catalyst. Having interaction with at least 3 languages and 1000 Q per month to be answered. \r\nThere is no basis to know how they plan to reach these 1000 people or persuade 20 of them to be active. There is no way to know how they plan to get 1000 questions per month  since that presumes everyone who is reached will have a question and keeping asking at least one question a month. This is not realistic.\r\n\r\nNo marketing budget has been allocated. \r\nThere is a clear understandable description of the targeted problem and but there is no practical solution which would solve the problem. \r\nThe proposer has not identified possible hurdles, challenges and difficulties. \r\nThe information provided is not  sufficient to audit the progress and the success of the proposal hence I have given it a 2 star rating.\r\n\r\n\r\n", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 17, "ne": 4, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "it is a good idea to develop a multilingual page. the proposer mentioned a landing page where the viewer will now select the language to interact in. this requires the viewer to know the language in which the landing page is crafted before accessing the language he wants to interact in.  Again. Proposer is yet to interact with classmates to get the languages that can be worked with. this should have been done already so that the proposal can be focused on the particular languages to offer services in.", "q0r": 3, "q1": "Reaching out to hundred people (100) giving the budget and the effort to be put in is too small. Also bringing onboard 20 active communities should be reviewed should there the opportunity. The team to execute these plans is yet to be formed. there is no evidence of similar work done. i encourage the team to start similar project on social  media like telegram on a low scale and then pursue funds to scale up. ", "q1r": 2, "q2": "the budget will need more clarification. for instance what will go into the learning process of the students etc. Being a web site, activity on it can easily be tracked and will help in the auditing proce.", "q2r": 3, "assessor": "z_assessor_728", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This proposal sets out a clear problem and in line with the criteria of the challenge, in the sense that its solution is to create a Q&A rubric on the platform where people from different countries can ask questions and get informed about Cardano and Catalyst. The positive impact on the Catalyst ecosystem is clearly explained and aware. This is also reflected in the KPIs, with the desire to Reach over 100 people and get at least 20 people to be active in Cardano and Catalyst, and use 3 different languages. ", "q0r": 4, "q1": "\r\nThe description of the candidate could have been supported by links, which would have brought more details. But the explanation of his skills and that of the candidates sought for the realization of his project is quite clear and precise. The budget is quite clear and seems coherent, developed into different themes and linked to the objectives of the KPIs. The time indices provided seem consistent. The fact that they plan to collaborate with groups such as Catalyst school, already established in the community is a good point, it would have been even better to be able to prove this collaboration with concrete actions put in place, (like a mentor, or as a co-sponsor for example).  \r\nThe risks are discussed, but it could have been interesting if the team specified the solutions worked out to face them and alternatives to ensure the realization. \r\n", "q1r": 4, "q2": "It is clearly stated that After the 3 months process, they will present the result to the community and suggest how to scale the activities, which is a proof of transparency, explaining exactly the means of doing so would have even better. On the whole, this proposal is rather clear and its honesty is appreciable, in the sense that it remains transparent on the stages and what is planned to be done. The KPIs are clear enough for the community to attest to their evolution, thanks to quantitative objectives. A little more explanation of the means put in place by the team to properly integrate the project into the eco-system would have been a plus.", "q2r": 4, "assessor": "z_assessor_739", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Создайте динамический раздел вопросов и ответов для новичков на нескольких языках", "experience": "Студент бизнес-школы международной школы, владею 4 языками"}