{"id": 383100, "author": "bef7103", "title": "Wine open market - Stappato", "url": "https://cardano.ideascale.com/a/dtd/383100-48088", "category": 26240, "amount": 10000, "description": "ワインへのアクセスは難しく、割り当てやウェイティングリストへの参加は困難であり、市場への参加を制限していることはよく知られています。", "funded": 0, "upvotes": 16927940, "downvotes": 19122429, "votes_result": 2194489, "votes_cast": 165, "f6_no_assessments": 11, "f6_rating": 3.3333333333333326, "videos": [], "media": [], "f6_assessments": [{"q0": "ワインの販売とCardanoのエコシステムの間のギャップをどのように埋めるか、ここではあまり明確ではありません。提案者は、スマートコントラクトを使って、ワイン取引のプラットフォームとなるDappを作るつもりです。しかし、これらのコントラクトは正確には何のために使われるのでしょうか？それは販売データかもしれない？どんなデータ？私たちのブロックチェーンネットワーク上でホストされるのは、一体何なのでしょうか？ワイン生産者にとってのメリットは何でしょうか？提案者たちは、目標のひとつとして「新しいワイナリーをプロジェクトに統合し、彼らのワインへのオープンアクセスの利点を示す」ことを挙げています。その利点が何であるかを提案書の中で定義することが重要です。また、最終消費者にとってはどのようなメリットがあるのでしょうか？ターゲットとなるのは、年齢層の高い上流階級の人々で、通常、より洗練されたワインを消費する人たちだと思います。ほとんどの場合、ブロックチェーン技術をすでに使用している人（技術分野の知識や暗号の世界に興味を持っている人）、あるいはカルダノのエコシステムサービスを利用する可能性の高い潜在的なユーザーを対象としています。しかし、ここでの聴衆は違うようで、本当に、カルダノとは何の関係もないと思われる人たちです。このような人たちに、どうやってここでの利点を理解してもらい、どうやって従来の技術から離れてこのような新しい技術を使うように説得するのでしょうか？このように多くの疑問があるため、残念ながら、私はこの提案がうまくいくことが保証されているとは思いません。つまり、Cardanoの取引数を増やし、私たちのエコシステムに新しいユーザーをもたらすDappを作るということです。非常に特殊なニッチなプロジェクトであり、私が提起した点について、より良い論証が必要でしょう。1)これがどのようにCardanoに利益をもたらすのか、より詳細に2)生産者や消費者がどのようにブロックチェーンを使うことに納得するのか、などの説明があれば、おそらくその影響に対する信頼性は大きく高まるでしょう。", "q0r": 2, "q1": "このチームについてはほとんど知られていませんが、ワインビジネスの経験があり、ブロックチェーンの知識もある3人だと言われているだけです。しかし、これはとても少ないことです。彼らの名前、それぞれが何をしているのか、過去の仕事の簡単な履歴、そして何よりも、彼らがどのようにCardanoのエコシステムに関わっているのかを知る必要があります。ブロックチェーンの経験を持つプロフェッショナルがいると言っていますが、その経験とはどのようなものでしょうか？これまでにCardanoで何かプロジェクトを行ったことはありますか？もしそうなら、どのプロジェクトですか？残念ながら、私たちがほとんど知らないチームを信用することはできません。入札者には、それぞれの詳細で個別の説明を記載することを提案します。できれば、以前の仕事の例や、もしあればリンクトインのプロフィールも記載してください。ここにはスクリプトがありますが、それは表面的なものです。例えば、最初の3ヶ月はプラットフォームを作ってプロデューサーに見せることに専念しますよね。彼らは、どのゴールで何をするのかは知っていますが、どのようにするのか？このような製品を得るためには、誰がどのような活動を時系列に展開していくのか。また、3ヶ月という期間は非常に長いと思いますが、例えば月ごとに活動を分けて整理していけば、もっと面白くなるのではないでしょうか。ここで気になるのが、以下の点です。「ワインビジネスの経験を持つパートタイムの外部コンサルタント（週に1日、3ヶ月間で1500米ドル/月）」。このプロジェクトでは、1人の人間に週に1日だけ働いてもらう、つまり約4日間の仕事で1500米ドルを支払うことになるのですね。この値は非常に高く、作業時間とは相容れないものだと感じました。他のプロポーザルでは、デザイナー、開発者、広報担当者など、多くの専門家がフルタイムで働いてこのような給料を受け取っています。これは私の考えでは、やや不釣り合いです。予算については、ロードマップに沿って説明されています。それぞれの段階で、報告された活動にどれだけの費用がかかるかが伝えられています。この点については、資金調達を理解するのに十分な情報があると思いますが、ここでの私の見解は、（私見ですが）ある値は妥当ですが、他の値は前述のコメントのように不釣り合いだということです。したがって、結論としては、1）チームについての情報が少ないため、信頼することができない 2）脚本は表面的だが、全体を見渡すことができる 3）予算は理解できるが、不均衡な部分がある。", "q1r": 2, "q2": "提案書の著者は、消費者数、サプライヤー数、販売された製品数など、プラットフォームの直接的な成果を監視するためのKPIをいくつか挙げているので、監査可能性は高い。これらは純粋に定量的なデータですが、プロジェクトが成功したかどうかを簡潔に示すことができます。また、スマートコントラクトがどれだけ生成されたか、カルダノのエコシステムへの直接的な影響はどうだったかなど、何らかの分析があれば素晴らしいと思います。この部分は、提案書全体でも、最終的な評価指標でも、ほとんど検討されていません。与えられたロードマップに基づいて、プロジェクトの発展を追うことは可能です。しかし、先に述べたように、誰が何をするのかわからないという事実に加えて、あまり詳細な説明がなく、数ヶ月という大まかな時間的区分がなされているため、そのような具体的なモニタリングを行うことはできません。そこで私が提案するのは、著者がカルダノに特化した指標（KPI）を定義し、ロードマップをより詳細なものにすることです。プロジェクトの全貌を理解するためには、営業担当者とカルダノの開発者の両方と接触する必要があります。提案書を監査することは可能だが、コメントデータの作成、修正、改善が行われれば、さらに満足度の高いものになるだろう。", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 31, "ne": 18, "ng": 13, "nfo": 0, "vca_o": 2}, {"q0": "引用された問題は理解できますが、問題の次元を説明するための情報が不足しています。ワイン市場の規模は？市場にはブロックチェーンで解決できるような困難が存在するのか？\n\nワインのマーケットプレイスには可能性を感じますが、この提案の価値観は十分に確立されていません。\n\n提示されている指標では、顧客数、ワイナリー数、販売アイテム数を測定することができますが、インパクトの可能性を評価できるような目標・KPIが設定されていません。\n\n上記の点を明確にしないと、正確なインパクト評価ができないので、これらの点を含めることをお勧めします。", "q0r": 2, "q1": "このチームの適格性を評価するには十分な情報がなく、この提案に関わった人たちの名前さえもわかりません。ブロックチェーンやワインの分野での経験について言及されていても、この情報を裏付けるソースやリンクはありません。スマートコントラクトの開発には誰が責任を持つのでしょうか？\n\nプロジェクト計画は3つのフェーズに分かれていましたが、実現可能性を示す詳細はほとんどありません。スマートコントラクトの開発については、誰が開発するのかという情報がありません。フェーズ1にはMVPがありますが、提案の仕方では実現可能性を示す情報が不足しているので、チームはアイデア/コンセプトを正当化するための根拠をもっと練ることをお勧めします。\n\n予算が十分に定義されていません。提案書では10,000米ドルを要求していますが、営業担当者を1,500米ドル、コンサルタントを3ヶ月間1,500米ドル、マーケティングに1,500米ドルを雇用するための費用が言及されています（これらの値に基づいて、どのように10,000米ドルになるのでしょうか）が、これらの費用はいずれもdappの開発には関係しておらず、チャレンジの目的がdappの開発であることを考慮すると、提案書がチャレンジの主な範囲外の項目にのみお金を要求するのは意味がありません。予算の実現性を判断する最大のポイントは、dappの開発にかかる費用を把握することであり、チームは追加費用をカバーすると述べていますが、これは実現性を裏付ける論拠にはなりません。\n\n提案のリスクと課題が考慮されていない。ワインのマーケットプレイスを作る前に、この市場の可能性や需要を知り、ブロックチェーン上にマーケットプレイスを作ることの魅力を知ることが重要でしょう。これらのワインは、ブロックチェーンによって認証/認定されるのでしょうか？サプライチェーンモデルを作る意図があるのか？メタデータを利用する意図はあるのか？もしワインがブロックチェーンによって認証されるとしたら、ブロックチェーンに含まれるデータとワインそのものとの間の不正を避けるためのメカニズムはどうなるのでしょうか？\n\nアイデア自体は有効であり、マーケットプレイスはチャレンジの範囲内ですが、提案の実現可能性を適切に評価できるように、チームはより詳細な情報を提供することをお勧めします。", "q1r": 1, "q2": "問題がうまく説明されていなかったので、ワイン市場にカルダノブロックチェーンを使用することの価値提案を理解するために、より多くのデータや情報を提供することをお勧めします。提示されたソリューションでは、スマートコントラクトの開発に関する技術的な計画について十分な情報が示されていません。\n\n記載されているメトリクスは、ブロックチェーンの利用を理解するのに役立ちますが、目標/KPIが設定されていないため、監査可能性は極めて主観的になります。\n\nタイムラインが設定された計画がありますが、スマートコントラクトがどのように使用されるかについての情報がなく、ビジネスプラン自体が非常に主観的であるため、提示されたプランはドラフトであると考えます。", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 28, "ne": 15, "ng": 13, "nfo": 0, "vca_o": 2}, {"q0": "This proposal would be a good innovation towards the Cardano blockchain, and it would gain attraction on new users as well as current users. This is because, 1) The wine market only in the U.S alone have a market worth of $88 billion. 2) Deploying smart contracts are considered a simplicity for both consumers and sellers (Though bugs, errors or malicious actors can trigger undesirable results that are hard to correct.) 3) The involvement of traditional markets into the blockchain. ", "q0r": 5, "q1": "With the given experience and connections, I believe this will an interesting project for the Cardano ecosystem to provide wineries into the blockchain, though elaboration of the hiring of team members can be further informed - but the proposer only requires funding on the marketing side. I would also like to add on the Phase 2, (what are the risks when onboarding new wineries into the project?). As it will also add as a good point to where the expansion of the project to success.", "q1r": 5, "q2": "The funding required is only for marketing purposes and seems reasonable, and I am thrilled that the project will be implemented in the blockchain. Though, further elaboration on outreach campaigns and milestones for the marketing would be helpful to give a glimpse of the Wine Open Market. I believe it would be revolutionary to provide wineries or maybe in the future other types of spirits into the blockchain whereby users can directly buy it via smart contracts.", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 19, "ne": 3, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "It isn't clear how much value and users this app. will bring to Cardano. Please give more information about the waiting lists for buying directly from wineries, as this isn't something many people have experience with. How will the trade platform work? Will there be buy/sell orders?", "q0r": 3, "q1": "Who are the team members? What previous achievements can you show? It seems that you're determined to make this project work; it might be helpful to complete the MVP and then ask for funding.", "q1r": 2, "q2": "There are simple KPIs which are measurable and realistic.", "q2r": 5, "assessor": "z_assessor_80", "no_vca": 32, "ne": 3, "ng": 19, "nfo": 10, "vca_o": 1}, {"q0": "The proposer wants to build a platform to enabe wine lovers to be treated more fair when buying wine directly from producers. A dapp will be built so the project is in line with the challenge. There's an implicit benefit for the cardano ecosystem so no problems there. The key metrics make sense for such a proposal tracking the adoption of the platform once made. I'm not sure if the project will be capable of scaling because no team members are directly specified. And I don't think the types of members mentioned will be enough to bring the project to it's success once scaling is necessary. I see quite a bit of things missing in the proposal: an understandable budget, any kind of proof for stated skills, thought about reusing what's already been done and open sourced, probing for partnerships or talks with producers and a couple of other minor things like supply chain management research, price points, competitiveness.  As a developer, I was expecting more detail. With all due respect, this looks like an idea and not a business plan. Overall a good idea that fits with the challenge. ", "q0r": 4, "q1": "Unfortunately I couldn't find any evidence of the mentioned skills in the proposal. This brings down the credability of the project alongside the fact there are details missing in the proposal. I didn't understand the budget break down, there was some mention of 3 months 1500 which makes 4500 and then 3 months of 1300 which makes 8400 and 1500 for marketing making 9900 in total, but the budget is 10000 so I didn't see where the last 100$ are. I hope the proposer wasn't rounding up and just made a mistake in calculating the end cost. I encourage the proposer to come back for the next funding rounds and take better care when compiling the proposal keeping in mind the proposal requirements. Putting yourself in the eyes of the voter is also a good idea when writing a proposal. Overall there were a couple of more things missing in the proposal that I already mentioned. Keeping in mind all said things I'd advise the author to take a look at other proposals and look at how does a proposal that is already funded look like. A good idea, but I couldn't call it feasible for the aforementioned reasons.        Taking in potential risks like competition also seems like a reasonable thing to do.", "q1r": 2, "q2": "No mention of any way to trace the progress of the project. I'd suggest a telegram channel or some other medium to keep the community involved as they could be future customers of the app. Metrics and KPIs seem good, but that's not enough to make a good proposal. The roadmap is a bit hectic, but it's structured. The description of the problem and solution are understandable.   Overall an idea that needs more work in order to turn into a serious proposal IMO. Good luck!", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 32, "ne": 13, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "This proposal intends to create an online marketplace and cut out the middleman that takes margins on sales transactions. What is proposed is basically like an online cooperative which wineries can join and where consumers can buy wine. So it should be profitable for both producer and consumer. If successful, it could generate additional transactions on the Cardano blockchain. ", "q0r": 5, "q1": "The proposal speaks of a 'blockchain professional', which I suppose will build the smart contract. The unbacked relative experience that is claimed would suffice to run the business. But who would create the online marketplace and website? \nTo enhance the feasibility and community trust in this proposal, consider publishing the team's identity and some proof of experience. ", "q1r": 3, "q2": "While there is a clear roadmap, plan and KPIs included in the proposal, there is no information on what would happen if the project initially turns out to be not as successful as anticipated. Is there a plan b to mitigate this risk if it were to occur? \nThis in combination with details on what is intended with the marketing campaign (online advertising, tv ads, ...) and a website where additional information could be found would improve the auditability of this proposal greatly. ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 32, "ne": 3, "ng": 26, "nfo": 3, "vca_o": 1}, {"q0": "The idea is about filling the demand and supply gap between wine consumers and producers using Blockchain smart contract functionalities. This is a project that has the potential great use case globally and more adoption of the ecosystem. It definitely address the campaign challenge and should he be given a chance.", "q0r": 4, "q1": "The team has already brought the project to a realistic level and they are just asking for funds to promote the platform and for administrative costs. I am convinced that the proposal will definitely be implemented successfully. Also considering the detailed milestones and realistic budget request and the project has a great chance for a successful launch. However no challenges or risk factors had been mentioned, I still believe that the team has enough passion to ensure success.", "q1r": 4, "q2": "The proposal has given considerable information to assess and the progress of the proposal if funded.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 31, "ne": 1, "ng": 19, "nfo": 11, "vca_o": 1}, {"q0": "As an experienced Technical builder and Active Catalyst member, coming from one of the TOP wine producer countries in the world I found this proposal aligned with the Challenge objectives, as implementing the smart contract in the trading platform will drive more usage and increase transactions in the Cardano Blockchain. Though its impact is not clear as no much information was provided in order to clearly assess that. As the proposal is aimed to support the validation of an MVP and business model in the market it does makes sense that this information will be better understood once that model is validated.", "q0r": 4, "q1": "The team brief description seems to be appropriate for the successful achievement of the project goals for this phase, though no specific details or external reference links were provided in order to further validate those capabilities. As the requested funds will be used to fund Sales/Marketing/Customer Validation I don't see there will be too much problem to carry out the desired goals, but no information was presented on the technical side as well, on how and whom will produce the prototype/MVP and wether those members of the team are already identified or hired.\nThe timeline is clear but not detailed, and we are talking about an MVP in 3 months, so I'd add many more details and deliverables to the project in order for others to assess if the plan fits the purpose and what type of platform/complexity will be built.\nNo details on the Business Model or Platform operation were provided, besides that it seems to be a double sided platform with a Smart Contract, I'd recommend to add those details so anyone can understand what is behind the idea, to form an opinion on its chances of success.\nI do value the expressed commitment that you will fund the building of the project on your own, that's great but not enough to reach the success of the project if what is being built is not the proper platform, and to understand that more details are needed.\nThe requested budget breakdown was provided and makes sense with its intended usage and market prices and seems reasonable for a Prototype (at least with what I imagine with the information provided)\nNo risks were identified within the proposal and there will be many to be addressed in the way.\nI recommend to add all of these details to produce a complete proposal presentation weather you are voted and funded, so you can provide progress reports (they will be needed) and if not voted to participate in the next funding round, loved the idea to disintermediate the wine industry.", "q1r": 3, "q2": "Even though a general goal of delivering an MVP and support the validation with the funds, no specific KPIs were provided, so it will be hard for the community to be able to audit the progress of the project. I recommend to add SMART KPIs in enough details within the 3 months project period to be able to measure and audit progress. General Production KPIs will also be great to have to understand the level of impact this project can/aim to produce.", "q2r": 3, "assessor": "z_assessor_288", "no_vca": 32, "ne": 14, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "The tracking of wine, like other merchandise is something that blockchain should play a big future role in. This app in particular is set to make it easier to get on the list to be able to purchase and distribute directly from wineries in a fair manner which I think is great. There are a lot of wineries in Italy, my concern currently with how much impact it will have is that they dont appear to have any direct communication with a winery at this time which would be a great way to get started in knowing that this is something that is important to the wineries in their area.", "q0r": 4, "q1": "There is mention that the team has blockchain experience but there is a lack of information on exactly what they worked on in the past or links to previous projects and repositories. It would also be a good idea to attach member linkedin profiles or similar.", "q1r": 3, "q2": "I think the milestones that they came up with are well thought out and are achievable. I think the rationale for the salaries could use some additional work. For example with the part time external consultant, are you saying they will work 1 day per week and for each of the 3 months they would get 1500 usd? that seems quite high for roughly 4 days of work in the month. Its possible Im misunderstanding but some clarification on that would be appreciated.", "q2r": 3, "assessor": "z_assessor_119", "no_vca": 32, "ne": 2, "ng": 29, "nfo": 1, "vca_o": 1}, {"q0": "The proposal do achieve the challenge goal. Which is bringing more users to the platform (which runs in the ADA environment).\nIt has a potential to make a huge impact, since according to Fortune Business Insights  [https://www.fortunebusinessinsights.com/wine-market-102836], it has a projected grow to USD 456,76 bi in 2028. Therefore, if this platform could get 0,5% of its market, its a volume of USD 2 bi in 2028, which is huge.", "q0r": 5, "q1": "The proposal did not show the reference and links that shows the team experience. It would be good having this info.\nAbout the budget, I’ve not understood it quite well. I’m missing a more broken down information. Since you’re using the money just for marketing and sales, it should be added where are you intending to advertise, for example, for how long and which methods are going to be used to do it and check its reach.\nThe timetable seems fair to develop what you’re proposing.\nOne point that I’m missing is the logistic strategy. I’m wondering here if you’re going to be only a platform which connects the seller and buyer or you’re planning to have some logistics solutions. I’ve seen this site here (https://www.liv-ex.com) which looks like your proposal, however they have some warehouses to implement logistics. Here in Brazil we have some fidelity clubs which send different wines every month to the subscribers, but they too have their own logistic net (or they provide this service, not having the actual places). Therefore, you might find that providing this service to the seller is a way to increase their participation.\nWould be great to have a risk map, considering marketing effectiveness, logistics (is it going to sell all around the world?), seller stock, etc.", "q1r": 3, "q2": "It should be added some more KPIs like volume of transactions, number of countries supplied, etc. It would help to track the development of the platform.\nMoreover, since it was not defined the advertising methods, it’s quite hard to verify its effectiveness and audit it, needing more information (method, platform, tracking, etc). ", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 32, "ne": 8, "ng": 22, "nfo": 2, "vca_o": 1}, {"q0": "The idea is valid but some points in the proposal could be clearer. First, its not clear how this application would leverage blockchain and smart contract technolgies in relation to regular market place or plataform for wine selling. More details on this could be given.\nSecond, its also not mentioned the potential market for this business, which makes it difficult to assess its full impact. for instance, it says, waiting list are hard to get into, but it could also say how many people are trying to get on these lists and how many there are in the lists. However, I particularly like that the business development part will happen in paralell from the technical development. It would be nice also to see the business model that is being thought for this DApp or how it intend to get revenue from. It could be from a monthly subscribe fee, transaction fee, etc.\nI'd also provide more information on communication strategy to target audience. How will they be reached and what kinds of advertising would be made?\n\nImpotant to say that proposal is aligned with challenge as it will likely increase \"Number/growth of application output\", \"Number/growth of application transactions\", Total \"volume of Ada involved in application transactions\" and other challenge KPIs.\n\nIn general, the idea is good but proposal could better explore the advatnages of smart contract (specially for those not very familiar with it) and the total impact, considering number of potential users.\n\n\n\n", "q0r": 4, "q1": "There are very few information about the team. It only mentions that 3 people are committed and their general experience, with some vague terms (as wine world connections). To make this part better strucutured, it would be imporant to see their individual capabilities and experience, have linkk to verify the information and bring more concrete example. For istance, when it is mentiones \"wine world connection\", it could say with whom is this connection and what level of connection is this, if any toher project was already developed with them, etc.\n\n\nThe plan is sound as it is time-framed and contain acitivites and deliverables. Again, much appreciated that business development happens together with technical development. I also liked that a MVP will be done first. Theres also a fair budget breakdown distribuited in the timeline.", "q1r": 3, "q2": "There are milestones in the timeline and 3 KPIs defined. It would be imporant though, to see some targets spread out in time, to check its evolution and see if its going accordin to plan.\nOther possible metric to add is someway to measure the number of reccurrent purchases from same costumer. This could give som insight on the quality of the service as a whole (wine + platform).\n\nIn regard to risk analsysis, I'd consider both technical and business risks to be addressed have a mitigation startegy in place since begining.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 30, "ne": 11, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "生産者から直接ワインを購入する権利のためのオープントレードプラットフォームを開発し、より広範で公正なアクセスと流動性の向上を実現する。", "experience": "ブロックチェーンの専門家やソムリエ出身者など、業界で複数年の経験を持つ3人のチーム +ワイン界のコネクション"}