{"id": 384351, "author": "bwana", "title": "Embedded EUTXO Manager", "url": "https://cardano.ideascale.com/a/dtd/384351-48088", "category": 26240, "amount": 10000, "description": "ユーザー定義可能なリモートエンドポイント管理がない。", "funded": 0, "upvotes": 17463670, "downvotes": 16362985, "votes_result": 1100685, "votes_cast": 144, "f6_no_assessments": 4, "f6_rating": 1.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "This is an unwithdrawn draft proposal with of only 34 words, there is nothing to assess.\r\nThe information given is not even suitable to properly get the gist of the idea: the problem statement (the why) is not clear either to someone with dev experience or to a voter.", "q0r": 1, "q1": "No plan presented (34 words draft proposal), the experience is only given through a GitHub profile page which shows some relevant experience.", "q1r": 1, "q2": "Cleraly not as there are only 34 words in this unwithdrawn draft proposal.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 20, "ne": 0, "ng": 14, "nfo": 6, "vca_o": 1}, {"q0": "This proposal focuses on Wrapper for etuxo management written in Typescript with Open RPC spec JSON-RPC API. The problem statement is very abstract and not explained. Because this proposal is not completed, the solution is still very abstract, not clear impact, however, in my opinion, this idea is very worth trying for completing in the future. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "The team's profile is briefly described but no proof/link for verification. Therefore, there is no proof of feasibility. Based on the given information, I disagree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "Since this is an incomplete proposal where auditability/transparency can't be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "While in essence, the proposal addresses aspects of the challenge, it's impossible to do an actual assessment without further details about the implementation and the expected outcomes.\r\nI would suggest providing much more detail on how the proposed solutions would work and what type of impact could we expect from the results of the proposal on the Cardano ecosystem as a whole.", "q0r": 2, "q1": "It's difficult to assess the feasibility of the proposal because of insufficient information to properly judge both the team and the deliverables intended to be created by the proposal. In the future, I would suggest including at least the information required when doing the self-assessment checklist, i.e. detailed budget, approximate public launch date, a clear definition of success and information about all the team, their background and links to their previous related works.", "q1r": 1, "q2": "Even though in theory progress on technical development would be straightforward to audit, the proposal doesn't include any metrics to measure success by, an estimated project roadmap and timeframe nor a clear description of deliverables and a broken-down budget.\r\nI would recommend including a complete proposal in a future round. ", "q2r": 1, "assessor": "z_assessor_681", "no_vca": 14, "ne": 0, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The statement of the problem and the objective is unclear, although it seems interesting and can be successful. Many times the voter of the proposal does not know, I recommend that in the explanation of the problem and the solution explain these sections using not so technical language. Many catalyst voters will not understand your proposal.", "q0r": 3, "q1": "Your experience is important, although you provide your repository Githup could also provide your linkedin or a website to get to know you better.\r\nIt is difficult to know the probability of success since it does not provide a detailed implementation plan, nor does it explain where it will allocate the resources, it could disaggregate it, what would be the destination of the $ 10,000\r\nYou should mention if there is a work team with you or if you plan to form one", "q1r": 3, "q2": "It does not provide an auditability mechanism to know the progress of your proposal, nor does it mention the impact and feasibility of the proposal.", "q2r": 1, "assessor": "z_assessor_743", "no_vca": 13, "ne": 2, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "Open RPC仕様のJSON-RPC APIを用いてTypescriptで書かれたetuxo管理用のラッパーです。", "experience": "EnOS Linux distroに実装されているOpen RPC spec APIを利用して、EVMノードクライアントとの対話を行いました。"}