{"id": 383488, "author": "dcspark", "title": "Milkomeda SPO validator training", "url": "https://cardano.ideascale.com/a/dtd/383488-48088", "category": 26245, "amount": 10000, "description": "Milkomeda需要一套分布式的验证器来实现充分的去中心化", "funded": 2, "upvotes": 90159196, "downvotes": 22154368, "votes_result": 68004828, "votes_cast": 310, "f6_no_assessments": 4, "f6_rating": 3.4166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Stakepool可能是Cardano的核心。它也是生态系统中主要和重要的利益相关者之一--如果不是最重要的话。  他们的生活越好，对整个Cardano社区来说就越好。理想情况下，Cardano的侧链需要像主链一样去中心化。在过去的几个月里，我们以ISPO的形式获得了许多新的赌注激励（代币，NFTs空投等），许多较小的和不太受欢迎的池正在努力维持他们委托的ADA。参与运行Cardano的侧链可能是他们需要的答案，以保持他们对我们区块链的忠诚度，同时还能通过一些激励措施实现所有相关方的目标。因此，我同意我们需要在这个话题上投入更多的资源，这个提议将是一个很好的开始。", "q0r": 5, "q1": "dcSpark团队的综合知识、技能和经验可能会说明问题。然而，我不能否认，仍然缺乏一些细节。也许我们可以从了解更多的事情开始，比如衡量有多少SPO对这个前景感兴趣，SPO的资格，所需的池子参数，等等。  随着Milkomeda主网的测试版即将发布，可以说，该提案将迅速交付，并与区块链的发展时间表保持一致。", "q1r": 4, "q2": "虽然还没有提到准确衡量该提案实施结果的指标，但我认为这一点是可以想出来的，并且在以后可行性部分提到的事情被实施后很容易被证明。不过，如果我们能在提案中附上任何简报，那就更好了。Milkomeda的Github本身就很不错，足以说明该团队的工作质量。希望在未来的几周内，我们可以看到更多积极的公告，以实际测试的形式出现。", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 17, "ne": 9, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "Connecting Cardano to EVM is a great solution to scale and connect Cardano with other blockchain platforms, especially Ethereum. But I really haven't seen a specific plan, roadmap or a specific description of the product of the proposal, so I still don't really know how the product will be implemented and what the specific solution is. . Although the proposal wants to be funded to audit the project, the proposer also needs to be more specific about the product", "q0r": 2, "q1": "\"Proposer said their Team is composed of well known ex-Emurgo and ex-IOHK employees who have been building the Cardano ecosystem for the past several years but no evidence provided of team's experience and size of the team. Providing profile links, github pages or links to past projects your team worked on will boost voter confidence in your capabilities in making this project a reality. \r\nIn addition, a specific description of the project's product and roadmap is indispensable to know the feasibility of the proposal.\"", "q1r": 1, "q2": "\"There is no specific product description, no roadmap, No info has been provided to show how this project will solve the problems it wants to solve. There is no way to track the progress or success of this project.\r\n\r\nProposer said they plan to start the audit as soon as possible. They will release the final audit report to the community once we have addressed any issues found. But we don't even know what their product is\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The proposer is clear with their objectives to support their current running project. Above all, this training is for stake pool operators, an important role in the Cardano ecosystem. With decentralization in mind, this proposal will have a positive impact that supports the Cardano development.  ", "q0r": 5, "q1": "Success likelihood is very high considering the proposer is also the developer behind the Milkomeda. But, the proposal doesn't mention the training schedules, modules, and the detailed budget plan breakdown. How many stake pool operators are eligible for the subsequent training sessions? If the stake pool operators are not selected for the validation process, are they still considered members of Milkomeda DAO? Otherwise, it will have risks of becoming a centralized sidechain. ", "q1r": 3, "q2": "Although the proposal has its official website, it should have other social media channels to update the training progress or documentation. It should be announced as well in the dcSpark social media channels. And, of course, training milestones and amount of stake pool operators joined should be announced too. ", "q2r": 4, "assessor": "z_assessor_647", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposer outlines the task of providing documentation and training to stake pool operators to make it easier for them to learn about and run a Milkomeda validator. The Milkomedia sidechain brings EVM support to the Cardano blockchain. As the ROI of ADA decreases for staking rewards over time as less inflation is offered by the protocol SPOs will need to have more income from other sources such as transaction fees or other validators and nodes. The Milkomeda validator node provides on of these business opportunities for SPOs and making it easy to learn and start using those validators presents an impactful opportunity and business model that can help the ecosystem.", "q0r": 5, "q1": "The proposal team have a history working within IOG and Emurgo. The team now operators their own company dcSpark and have completed a number of Catalyst proposal that have shown they can execute the proposals they get funded for. The proposal team created the Milkomeda sidechain so are naturally also the right people to train others to start running the validator nodes required by the sidechain to operate.\r\n\r\nIdeally the proposal team would have broken down the budget more and given a better itemised list of exactly what the documentation would include and how they are training the SPOs in december.", "q1r": 4, "q2": "The proposal team gave an outline of starting work in December training the validators. No success objectives or KPIs were provided. It would have been good to understand what a successfully trained validator would look like. Perhaps they have covered some specific amount of content or have demonstrated a certain understanding. Or potentially it could be looking at the metrics for their validator and that they meet the thresholds for what would be considered a node that is being run correctly. The plan has clarity however some more information here would have made it easier for advisors to know how this will be audited when providing evidence of the impact the proposal has had.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 16, "ne": 8, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "我们计划编写文件，以帮助任何希望成为Milkomeda验证者的股权池，并帮助验证者解决任何问题。", "experience": "我们的团队由知名的前Emurgo和前IOHK员工组成，他们在过去几年里一直在建立Cardano生态系统。"}