{"id": 383602, "author": "stakepool247", "title": "SPO Performance Monitoring Service", "url": "https://cardano.ideascale.com/a/dtd/383602-48088", "category": 26245, "amount": 36500, "description": "利益相关者缺乏实时监控工具，无法向他们和委托人提供利益相关者的业绩信息。", "funded": 2, "upvotes": 108734910, "downvotes": 20352983, "votes_result": 88381927, "votes_cast": 547, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal presented address the challenge in the proper way and it's about the development of tools for SPOs for monitoring their nodes and provide useful data to their delegators. In general we already observed in many cases that a user-friendly way to present data can be more effective that have more data to present: I think that this is one of the things that the proposal will obtain by developing his project, simplifying access to data and guaranteeing delegators a more informed choice.\r\nAnd this can be realized providing to SPOs a set of open-source tools that can help them to maintain the pools: it seems to me a classic Win-Win situation.\r\nThe reason why I'm not giving the full 5/5 is because i see a great potential for this proposal to become a real business opportunity for the proposer but it's not presented in this way: it would have been good, for example, to present the set of tools also as a service that can be offered to other SPOs and obtain a better alignment to the challenge.", "q0r": 4, "q1": "I have no doubt about the feasibility of the project: Lauris is a well-known community member and his dedication to the community his huge, give his involvement in the Catalyst Circle and the SPOCRA initiatives.\r\nThe steps for development are well defined and described in detail and also the budget breakdown is detailed in the right way and provide a clear picture on how the costs are divided for the various parts.\r\nIt would be great to add some technical details about the implementation of the dashboard: which languages / technologies will be used, what is the architecture to present the data (the monitoring tools will need a dedicated hardware or can be run on the node itself? There will be a centralized server to aggregate and present data?) but the overall evaluation about feasibility is extremely positive.", "q1r": 5, "q2": "As for the feasibility criteria, there is a great level of details about the roadmap and the steps that will be used to develop the project and these information could be used by the community to track the success of the project in an easy way. They KPI presented are well defined and the fact that will be developed an API to give access to these KPIs is an important point that add great value to the Auditability criteria. It would be good to include some KPIs also to keep track of the development of the project (like Github commits/issues/milestone) but the fact that the project will be published on Github already implies these kind of metrics.", "q2r": 5, "assessor": "z_assessor_147", "no_vca": 25, "ne": 12, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment, which also applies to decentralized and partially mission-driven stakepools, especially regarding the economic part. This knowledge and my knowledge about mission driven stakepools enables me to provide valuable insights for this challenge. The proposal identifies an important addition to the Cardano ecosystem, additional Stake Pool Performance tools that will sure help improve the system. Hence, this proposal meets the challenge metrics very well and will halp towards scalability of staking. It will be very beneficial to the Cardano ecosystem and SPOs.", "q0r": 5, "q1": "The proposer shows that they are competent in the field and able to deliver. It is highly likely that they are up for the challenge.  \r\nThe budget is outlined clearly and broken down into detailed, identifiable items and is reasonable to achieve the set goals. The proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This proposal can confidently be assessed as feasible", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 4, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "A great idea that will be definetly accepted and welcomed by many SPOs to have such statistics. Therefore they can improve and adjust to the findings. \r\n\r\nBy boosting other SPOs we can indirectly boost them to alternative business opportunities, since they will have some analysis of their performance.\r\n\r\nThis proposal is in accordance to the challenge goal.  ", "q0r": 4, "q1": "Based on the information provided we can assume that he can deliver. The fact that he is a part of a 600+ community as an elected representative increases the credibility. \r\n\r\nAlso, the roadmap is containing relevant detail and information, boosting the abovementioned credibility. \r\n\r\nRating given 5.", "q1r": 5, "q2": "At the roadmap, we can track the progress, because posted information is suitable for audit.\r\n\r\nAlso, provided KPIs are stated.\r\n\r\nIt would be also fine to see how such metrics increased performance or lead to some positive outputs.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "提供专业的性能监测解决方案，帮助SPO和代表实时监督和了解池的性能。", "experience": "SPOCRA董事会成员，受资助的提案人，桩池运营商，桩池作为服务提供商，SPO导师，当选催化剂圈成员。"}