{"id": 384179, "author": "geekship", "title": "SOIL: PRISM Pools", "url": "https://cardano.ideascale.com/a/dtd/384179-48088", "category": 26245, "amount": 42, "description": "SPO需要吸引代表", "funded": 0, "upvotes": 17764247, "downvotes": 21072506, "votes_result": 3308259, "votes_cast": 106, "f6_no_assessments": 4, "f6_rating": 2.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Unfortunately this proposal is not in the scope of the challenge and it is only at the idea-stage level.\r\nThe ideas presented about BIT, SOIL and Mycell are a good start and should be expanded but unfortunately it is not clear the relation between them and the challenge chosen. A more level of details is required to prepare a successful proposal.\r\nI suggest to the proposer to read the guide for proposers to write a proposal or follow the Catalyst School workshops on \"How to make a proposal\" in order to understand the level of details required to prepare a successful proposal.\r\nThis assessment is generic and reused on purpose for similar incomplete proposals.", "q0r": 1, "q1": "Unfortunately the operational part for the proposal is completely missing, as well as a proper amount of fund requested.\r\nFor the Feasibility section it's really important to provide info about: \r\n- Details about the technical implementation (which languages/technologies will be used?)\r\n- Details about the team: listing of the team members, skills, experience  and references for each member.\r\n- Details about the budget: a budget breakdown, estimate about the cost for each specific stage, list of actionable tasks and deliveries, a timeline for each delivery in accordance with the costs estimated.\r\nI suggest to the proposer to read the guide for proposers to write a proposal or follow the Catalyst School workshops on \"How to make a proposal\" in order to understand the level of details required to prepare a successful proposal.\r\nThis assessment is generic and reused on purpose for similar incomplete proposals.", "q1r": 1, "q2": "Unfortunately the Auditability section of this proposal is not complete at all and lacks details about its auditability.\r\nFor the Clarity/Auditability section it's really important to provide info about: \r\n- A clear definition for the success of the project\r\n- A roadmap about the deliverables that will occur\r\n- Key Performance Indicators to allow the community to keep track of the proposal progress and implementation\r\nI suggest to the proposer to read the guide for proposers to write a proposal or follow the Catalyst School workshops on \"How to make a proposal\" in order to understand the level of details required to prepare a successful proposal.\r\nThis assessment is generic and reused on purpose for similar incomplete proposals.", "q2r": 1, "assessor": "z_assessor_147", "no_vca": 25, "ne": 10, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This very short proposal of 250 words that aims to create a smart contract token system to help SPOs attract delegators but the proposer tells in the proposal that he preferred to focus on another proposal. Moreover the $42 requested seem to be just a placeholder amount.\r\nThe proposer posted similar proposal in different funds with almost the same texts, so my reviews will be very similar.\r\nAs this is just an unwithdrawn draft, I can only give it 1 star.", "q0r": 1, "q1": "A LinkedIn profile is given with developer experience but for a developer, a GitHub profile with some code to review is usually better.\r\nSince there is actually an external profile with some experience to review I can give 2 star instead of just 1 but there are no other data in the proposal to match this experience against.", "q1r": 2, "q2": "The outline of a plan is given but doesn't go into any actual details. ", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 18, "ne": 0, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment, which also applies to decentralized and partially mission-driven stakepools, especially regarding the economic part. This knowledge and my knowledge about mission driven stakepools enables me to provide valuable insights for this challenge. The proposal identifies an approach to link together Basic income, staking and intellectual property rights, which will if implemented correctly add quite some value to the Cardano ecosystem. It quite well (together with the related proposal from fund6) meets the requirements of the challenge and is set up in a way that makes it able to scale.", "q0r": 5, "q1": "The proposers is transparent about his background and seems competent and up to the task. It is likely they he is up to the challenge. The proposer does unfortunately not define the idea of a SOIL ecosystem further, however the BIT token is sufficiently explained in his last proposal that is linked. The budget is, according to the old proposal, mainly for self-sustaining, which makes it very decent and reasonable. No plan regarding the case that additional hurdles occur or additional funding is required is presented.The implementation plan could be more detailed. Technical details could be explained better to make the proposal more credible.", "q1r": 3, "q2": "Together with the old proposal, a sensible roadmap and goals are provided and defined problem and solution statements give a good, auditable proposal, except for the fact that the SOIL ecosystem term is not explained in detail.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "The proposal is not well developed. it is difficult how it will promote buisiness opportunities for SPOs.", "q0r": 2, "q1": "The proposer is mainly a frontend developer, but much of this proposal requires a lot of back end and blockchain work. there is no real roadmap and the proposer indicates they are focusing on another proposal. ", "q1r": 2, "q2": "This is not really a full proposal and does not include details necessary to audit its success. ", "q2r": 2, "assessor": "z_assessor_67", "no_vca": 20, "ne": 0, "ng": 13, "nfo": 7, "vca_o": 1}], "solution": "创建一套基于身份的功能，并通过SOIL生态系统推广提供该功能的池子。", "experience": "软件开发人员超过10年，最近5年专注于前端。\nhttps://www.linkedin.com/in/martin-vavrovic-9617514a/"}