{"id": 381053, "author": "jaitnez", "title": "New d-EdTech Platform for LatAm", "url": "https://cardano.ideascale.com/a/dtd/381053-48088", "category": 26242, "amount": 51040, "description": "Миллионы людей в Латинской Америке страдают от низких стандартов и неравного распределения образования, а также от неустойчивости сферы занятости.", "funded": 2, "upvotes": 109327718, "downvotes": 6268567, "votes_result": 103059151, "votes_cast": 300, "f6_no_assessments": 10, "f6_rating": 4.666666666666666, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=12695"], "media": [], "f6_assessments": [{"q0": "Команда разработчиков предложения утверждает, что разрыв в образовании между социальными классами может быть причиной низкого присутствия латиноамериканцев в экосистеме Cardano. Как латиноамериканец, который был в государственной и частной системе образования в более чем одной стране региона, я полностью согласен с этим утверждением. Несмотря на то, что этот метод уже исследовался в других экосистемах, команда планирует решить эту проблему путем создания образовательной платформы, которая использует модуль Learn-to-Earn и может оказать значительное влияние на экосистему CARDANO. Несмотря на амбициозность проекта, команда грамотно разделила его на 5 основных этапов, что позволяет сообществу оценить влияние, которое команда планирует оказать на каждом этапе. Однако один аспект, который можно улучшить в этом предложении, заключается в том, что проект начнет оказывать \"реальное воздействие\" через 2 года, поскольку именно тогда планируется привлечь к проекту представителей промышленности и преподавателей. Я бы рекомендовал команде включить в качестве результата MVP (12 месяцев) пилотное тестирование MVP с показателями успеха в результате тестирования.", "q0r": 5, "q1": "Членам команды удалось собрать очень разнообразный набор навыков и опыта по широкому спектру дисциплин. Были предоставлены рекомендации на LinkedIn, поэтому опыт можно проверить с этой точки зрения. Один критический момент, которого мне, возможно, не хватает в команде разработчиков заявки - это человек с образованием / педагогическим опытом, они описали в комментариях к заявке, что рассчитывают на консультанта с таким соответствующим опытом, но, к сожалению, не предоставили ни описания, ни ссылок на него. Они проделали отличную работу в отношении описания бюджета, а также в отношении идентификации будущих рисков, которые могут помешать успешной реализации проекта.  \r\n", "q1r": 4, "q2": "Они очень хорошо описали пять этапов от краткосрочного (3 месяца) до долгосрочного (после 3 лет), каждый из которых содержит краткое описание того, что будет происходить. Команда сделала еще один шаг вперед, объяснив сообществу, что именно будет происходить в краткосрочной перспективе, включая набор, развитие и исследовательские действия. Более того, команда подробно описывает, какие показатели успеха они ожидают, что я считаю важным, особенно начиная со второго года, поскольку именно эти показатели будут иметь ощутимое влияние. Еще одним элементом, добавляющим проверяемость, является открытый исходный код платформы. Это позволит сообществу детально понять, как продвигается проект и в каком направлении он движется.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 25, "ne": 15, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Это предложение очень хорошо согласуется с задачей стимулирования развития в Латинской Америке через создание образовательной платформы, ориентированной на технологии, что, безусловно, поможет в решении вопроса о нестабильности образования на континенте и возможностях трудоустройства. Тем не менее, я бы хотел, чтобы авторы прояснили, как блокчейн Cardano мог бы вписаться сюда, безусловно, в рамках технологического учения наша экосистема была бы в значительной степени рассмотрена, а также использование DID, что также хорошо соотносится с задачей из предыдущего фона (Atala Prism). Несмотря на это, я почувствовал недостаток уверенности в том, что этот проект принесет обратную связь сообществу Cardano; я знаю, что такая связь будет существовать, но было бы здорово получить подробную информацию об этом. Что касается изменения ситуации на континенте, нет сомнений, что такой проект очень нужен и перспективен, авторы могли бы также уточнить, какую целевую аудиторию они стремятся охватить в принципе, в какой латиноамериканской стране, в какой возрастной группе и т.д. Еще одна деталь, которая вызвала у меня сомнения - это стоимость курсов, предоставляемых Академией Ayllu. В какой валюте, ада, местной валюте они будут оплачиваться? Какова будет средняя цена курсов, и кому пойдет эта прибыль? Было бы интересно узнать, как будет работать эта более финансовая часть платформы, хотя я знаю, что это детали, но детали важные. В целом, проект соответствует тому, что требуется в этой задаче.", "q0r": 4, "q1": "Команда, задействованная здесь, безусловно, квалифицирована, чтобы хорошо выполнить проект; мы знаем, кто они, их имена, краткую историю их биографии и предыдущего опыта, а также их профили LinkedIn, где мы можем познакомиться с каждым из них более подробно. Однако было бы интересно, если бы авторы проявили больший интерес к юзабилити платформы, то есть к созданию простого и эргономичного дизайна UX, чтобы еще больше увеличить преимущества проекта, обеспечив целевой аудитории простоту навигации. Еще один момент - это вопрос маркетинга, неясно, собираются ли они нанять кого-то профессионального и ответственного за выполнение этой части проекта, или даже команду публицистов, как это будет рекламироваться и т.д.? Это огромный проект, поэтому ему нужна большая огласка, чтобы дойти до общественности. Что касается этапов, из которых будет состоять весь проект, то авторы очень хорошо указывают, что будет происходить в тот или иной период времени. Всегда полезно составлять график мероприятий, которые необходимо выполнить, параллельно с успехами, достигнутыми за эти месяцы, что они и делают в мельчайших подробностях. Что касается бюджета, то он также объясняется очень подробно, так что у нас есть твердое понимание того, как будут использованы запрашиваемые деньги, какие части сколько будут стоить и так далее.", "q1r": 5, "q2": "Эта часть предложения очень полная, у нас есть KPI, необходимые для того, чтобы понять, достигает ли проект намеченных целей, мы знаем, каковы амбиции команды, даже в отношении количества студентов на платформе. Мне показалось очень интересным, как они нарисовали идеальный сценарий, то есть контекст, в котором все будет происходить наилучшим образом, который включает в себя самообеспечение и так далее. Я также предлагаю, чтобы существовал какой-то канал связи между командой и сообществом Cardano во время реализации проекта, поскольку он огромен и включает в себя несколько аспектов (программирование, дизайн, образование, маркетинг). Можно было бы проводить периодические встречи или даже предоставлять частичные результаты, с помощью которых мы могли бы оценить прогресс. Но это бонусное предложение, я думаю, что проверяемость здесь довольно хорошая.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 19, "ne": 15, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The key metrics and goal of this proposal also align with the challenge settings, that is developing application that might be useful in other parts of the world. And also this proposal will give impact on their local communities, by adding value to increase the education by giving Plutus course in Spanish for LatAm community members.", "q0r": 5, "q1": "The team consists of several Plutus Pioneers and also experience management team. And they provide valid LinkedIn profile. Budget is outlined clearly and broken down properly. And the sum is still reasonable in my opinion to develop an educational platform. Moreover, the team also include realistic time frame to complete the work that they mention in the proposal. The proposal clearly describes the resources necessary to implement the proposal, such as development team & academic advisor on it. If funded, I think this team could implement their proposal accordingly.", "q1r": 5, "q2": "The team break down their roadmap & phase into several parts. And I think this helps the team to achieve their milestone in a good way. The metrics and KPI are defined clearly in 3 phases, such as short/medium/long term goals. It would be great if they could also include GitHub or website link, so that the community could track their project progress if funded.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 19, "ne": 2, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "The New EdTech platform for LatAm will help to draw new community members into Cardano Ecosystem by deploying the Learn-to-earn model. The EdTech platform is very much needed for LatAm community and has a very high potential to scale.", "q0r": 5, "q1": "The proposer team is comprised of 4 individual team members from different countries in the region give the broad perspective of scaling the product into this region. The budget is broken down in detail although it seems quite high for educational content creators. The proposal outlines a realistic timetable for the implementation but did not go into detail about platform and technical know-how required to build the platform. This could pose potential challenge to implement the proposal successfully. ", "q1r": 3, "q2": "The project will be open-source. It also has milestone and timeline to split project into phases making it easy to audit and monitor the progress. It should elaborate more on the technology aspect and the edTech platform features that would be included...", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "What a great way to grow Cardano's impact in Latin America. Having Spanish-language open-source education is the most important first step.", "q0r": 5, "q1": "This team has an incredible amount of experience in software development. Through their qualifications you can see that this team is experienced, organized and ready to start building. Additionally, their proposal has KPIs, a project schedule, and a budget breakdown that proves the team can be effective.", "q1r": 5, "q2": "This proposal outlines their kPIs, project schedule, and budget breakdown. From this information, the Foundation and community can audit the project's progress.", "q2r": 5, "assessor": "z_assessor_668", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This proposal is about building an EdTech platform that incentivizes participation to promote growth in a technology-oriented educational landscape, and relevant job industry. This is a great idea (an open-source Learn-to-Earn). The problem is clearly described, and explained in detail with the context in LatAm. Solving this problem is fit for this challenge.\r\nThe solution is clearly defined with a timeframe for the short, mid, and long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is clearly described with suitable skills, experiences for implementation. however, it would be better if the information of demo/pilot is provided. The roadmap is clearly defined with short, mid, and long term. The budget is clearly described (with a total budget, items structure, and explanations of calculation base). There is a lack of risk and mitigation.\r\n\r\nTherefore, based on the given information, I agree with this proposal's feasibility, I can rate it with a score of 4", "q1r": 4, "q2": "There is full of information provided, with external links for verification. However, there is a lacks: (1) information of demo/pilot; (2) Risks and mitigation. \r\nTherefore, based on the given information, I agree with this proposal's auditability, I can rate it with a score of 4. If the missing information listed above was fulfilled, I would give this 5 points.", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 12, "ne": 2, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to create a platform that will help the transfer of knowledge to keep individuals ready to work, and to keep a healthier pace in the life cycles of the industry. The challenge is quite addressed.", "q0r": 4, "q1": "The team is made up of Plutus Pioneer, 20 years experience in software engineering, 15 years and above as DevOps expertise, marketing advisors, who will be able to successfully implement the proposal. The plan mentions market and product, new recipe for transferring knowledge derived from industry, content in Spanish, technology oriented topics, tokenized incentive mechanism, native token incentives for learning. All these will make the implementation successful.", "q1r": 4, "q2": "The roadmap mentioned is clear from January 2022 to March 2022. The budget is well broken down for effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal addresses the challenge very effectively and delivers a thorough plan to create an educational technology platform for people in Latin America to become job-ready individuals and for the growth of Cardano ecosystem in Latin American countries. In my opinion, the author clearly understands these issues, is competent, motivated, and shows profound engagements with Latin American community as well as Project Catalyst and Cardano system.", "q0r": 5, "q1": "I strongly agree this proposal is likely to be successful implemented. The proposal provides all characteristic of a feasible proposal: evidence of relevant skills and experience of the team needed for the implementation and team members' information; fairly budget is split into items very clearly and be reasonable to achieve the set goals; a sensible and conductible plan with realistic timetable to complete the work; the necessary resources are described in details in the proposal in short term phase of the plan (to develop and implement a Proof of Concept (PoC)). In addition,  the project is bilingual (English and Spanish version, as we can see in the proposal and the AYLLU ACADEMY files attached in the proposal), so that language barrier is no longer the problem for people in Latin American countries of technology-oriented education. \r\nIn my opinion, it would be greater if the proposal considers challenges and risks relevent to the successful implementation (might be in the short term success, not a whole)", "q1r": 5, "q2": "In my opinion, the proposal is fully auditable because of the following points:\r\n. The proposal has a roadmap with milestones and time horizon for achievement; clear understandable the description of the targeted problem (Basic features of PoC) as well as the solution that addresses the problem.\r\n. Metrics/KPIs that define the success of the proposal are set clearly, easy to see and easy to audit (we should focus on the short term success to assess the Auditability as the proposal's current plan).\r\nThere is a small mistake in Phase B of short term roadmap and KPIs: I believe the author means Phase B in 4 month mark instead of 7 month mark.\r\nSince I extremely agree with the proposal, I would like to see more details about how to distribute this platform for the people in the proposal.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 15, "ne": 7, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "-Quality technical training in spanish is both a great use case for Cardano and a powerful way to expand it's awareness and adoption in Latam, therefore a stong alignment with the Challenge is evidenced.\r\n-The proposal is highly scalable to a have global reach in the future.\r\n-Would be great to see a more specific commitment to include Cardano/Plutus/Marlowe content in the description since as it is written there is no assurance of providing Cardano focused content.", "q0r": 5, "q1": "-Evidence is provided of a very strong team behind this proposal. They have a strong bond to LatinAmerica as well as the adecuate set of experience credibility and skills to deliver.\r\n-The proposal is thourough and well structured, a complete and detailed implementation plan is in place.\r\n-The budget provided is clear and reasonable.\r\n-Clear goals are set.\r\n-Future funding will most likely be required for next stages.\r\n-In the future team could benefit from bringing in a Marketing/growth/sales talent to support a good scaling speed.", "q1r": 5, "q2": "-Delivery on the proposal's plan is verifiable in each stage and the KPIs proposed seem to be a good way to measure success.\r\n-In order to track progress it would be great to include in the proposal some means of progress reporting.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is bringing a much needed decentralized EdTech solution to LatAm a region in great demand for this type of tool to help advance its societies. The proposal is perfect for this challenge.", "q0r": 5, "q1": "The team members come from technical software engineering backgrounds, are SPOs and have completed the Plutus Pioneer program. They also delivered a proposal containing an overview, timeline, KPI and other key information such as cost breakdown and definition of success. ", "q1r": 5, "q2": "The team is already heavily engaged in Cardano technical processes and their proposal is complete/well packaged. All info needed to audit progress is included.", "q2r": 5, "assessor": "z_assessor_764", "no_vca": 16, "ne": 2, "ng": 7, "nfo": 7, "vca_o": 1}], "solution": "Платформа EdTech, стимулирующая участие для поощрения роста в технологически ориентированном образовательном ландшафте и соответствующей индустрии занятости.", "experience": "Пионер Plutus, 20+ лет опыта в разработке программного обеспечения, 15+ лет экспертизы DEVOPS, консультирован консультантами по бизнесу и маркетингу."}