{"id": 382611, "author": "alexp7", "title": "Token Allies, Latam Businesses", "url": "https://cardano.ideascale.com/a/dtd/382611-48088", "category": 26242, "amount": 25000, "description": "В Латинской Америке предприятиям и стартапам очень трудно получить быстрый и легкий доступ к финансированию, что препятствует воплощению в жизнь многих замечательных идей.", "funded": 2, "upvotes": 80821156, "downvotes": 2655313, "votes_result": 78165843, "votes_cast": 199, "f6_no_assessments": 6, "f6_rating": 4.5555555555555545, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=19879"], "media": [], "f6_assessments": [{"q0": "Это предложение, если я не ошибаюсь, присутствовало на f6, но целью было только создание платформы, которая облегчила бы управление токенами компаниями. Текущая цель - помочь малым предпринимателям/компаниям финансировать свой бизнес через краудфандинг. Автор хорошо проблематизирует контекст проблемы: Латинская Америка - очень обширная и разнообразная территория, здесь трудно выделиться, а также начать с нуля, здесь не так много возможностей для финансирования, а малые предприятия нуждаются в помощи, чтобы хорошо развиваться. Поэтому я считаю, что идея создания платформы, которая поможет компаниям создавать/продавать/управлять своими токенами, очень актуальна, и это, безусловно, пойдет на пользу экосистеме Cardano, поскольку увеличит оборот активов, майнингованных на нашем блокчейне. Положительно, что авторы объясняют, как они смогут использовать свои платформы: не только для отдельной аудитории, но и для стартапов и инвесторов в целом. Они также заботятся о том, чтобы четко объяснить, как предложение достигает целей задачи: стимулирование инвестиций в ADA в латиноамериканских предпринимателей, принося пользу одновременно континенту и Cardano. Я считаю, что это предложение очень хорошо отвечает поставленным задачам.", "q0r": 5, "q1": "Дуэт авторов кажется очень хорошо подготовленным к выполнению этого проекта, они предоставляют нам очень подробную и разнообразную информацию о том, кто они такие, что они сделали в профессиональном плане до сих пор, их связи с блокчейном Cardano (которые сильны, что является очень положительным моментом) и их профили linkedin, что дает нам возможность узнать еще больше об их работе. Благодаря этому мы полностью уверены в вашей подготовке к успешному выполнению этого предложения\". Благодаря теме \"общие этапы\" мы можем получить представление о том, как будет происходить процесс разработки данного проекта. Однако я нашел эту информацию очень поверхностной, авторы тратят много времени на то, чтобы рассказать о необходимости их инициативы, а также о том, как будут работать Token Allies, модель halving и pledge и т.д.. Но, к сожалению, они не уделяют столько внимания сценарию. Деятельность разделена на 3 этапа, которые приходятся на квартал 2022 года, но нет глубокого объяснения каждого этапа, наоборот, мы имеем только предложение, объясняющее, что будет сделано... Но нам нужно было бы понять детали, например, порядок действий, кто что будет делать, подтемы, я бы сказал. Невозможно хорошо представить себе процесс на основе представленных деталей. Что касается финансового отдела, я считаю, что здесь также не хватает деталей. Например, есть часть, в которой авторы говорят: \"- $7,000 пойдут на расходы на сервер, юридические услуги и маркетинг\". Сколько пойдет на каждую вещь? Это потому что? Какие юридические услуги будут необходимы? Как будут проводиться маркетинговые стратегии и сколько они будут стоить? Я считаю, что когда речь идет о зарплате тех, кто участвует в проекте, недостатка в деталях нет, потому что информация уже самодостаточна, но в этой второй теме - да.", "q1r": 3, "q2": "Эта часть предложения была очень хорошо освещена, авторы озаботились установлением метрик успеха и KPI, таким образом, у нас есть точная информация, которую можно проанализировать с точки зрения проверяемости. Я думаю, было бы интересно, если бы команда представила сообществу частичные результаты, например, запуск бета-версии платформы, и постепенно приносила бы все больше и больше обратной связи; нам нужно точно понимать, было ли выполнено обещанное финансирование, получили ли латиноамериканские бизнесмены реальную выгоду, другими словами, функционирует ли платформа должным образом. Еще одним способом оценить, как развивается предложение, был бы прямой контакт с бизнесменами и инвесторами: оказала ли эта инициатива реальное влияние на их жизнь? если да, то каким образом? Что можно улучшить? Было бы также интересно, чтобы сообщество Cardano, особенно в Латинской Америке, воспользовалось порталом и проверило из первых рук, все ли, что было запланировано, было выполнено. Таким образом, я считаю, что это очень проверенное предложение.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 18, "ne": 11, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal addresses directly the challenge. If this model proves to be successful, it could be implemented on global scale, as a funding platform for small/private businesses. ", "q0r": 5, "q1": "All information provided, including full deployed project web site, are easily accessible from the proposals page.\r\nThe initial token listing and the platform prototype is expected to be developed in January 2022.", "q1r": 5, "q2": "The examples of metrics to be taken into account for auditing the projects seem comprehensive, streching from Q1-Q3 2022.\r\nI agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The issue being it is tough for startups and businesses in LATAM to get access to the funding and it is stopping many great ideas being real. The proposer will be providing a platform from which startups and businesses in LATAM can Create manage and sell their own business tokens. This proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer's team have experience doing business in Latin America and have enough knowledge about the field. They have also provided a complete plan on how the proposal will be implemented. They have also given a complete roadmaps each will time targets. With all these details It will very much possible the proposal will be implemented successfully", "q1r": 5, "q2": "The prosper has provided the Milestones to achieve within the time period. Also given a detailed budget allocation for each expenses with key performance indicators. The proposal also consist of step by step timeline hence all these information should be enough to track the success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 19, "ne": 4, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This token allies proposal will provide a platform for  Latin America Businesses to raise fund by letting them create, sell and manage their own tokens. This will help to increase adoption of Cardano in Latin America.", "q0r": 5, "q1": "The 2 proposers have a great mix of experiences. Lucas liaise with Latin America businesses and Alex has experience in develop technical solutions and an active community member in Catalyst. I would give them 5 star if they address about potential risk and challenges they will face. They mentioned about  halving and pledging of businesses on the platform which is great to protect the investors who give their pledges to businesses.", "q1r": 4, "q2": "The KPIs and roadmap are mentioned in the proposal. I would appreciate more detail breakdown, for example, the Allie coins will be launched in Q1: how much is the funding will go towards making that happened. What would be the extra features that they will introduce in Q2 and how much would that cost. It would give the community more confidence to track the progress and see it through the success of this proposal. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal sets out to make it quick and easy for businesses and startups in Latinamerica to access capital. It can be added that this has a positive impact on the Cardano ecosystem. Provide a platform where businesses and startups from Latam will be able to easily create, manage and sell their business tokens. Problem and solution statements are reasonable and within the scope of the challenge.", "q0r": 4, "q1": "This is a proposal that quality and enthusiastic team members who can successfully achieve their goals in my opinion\r\nThe plan is presented in a really optimal way, it is very likely that this proposal is successfully implemented in the way that the proponents describe. There is no doubt about the success of the proposal, what they demonstrate what they do, what they do. I completely agree with this suggestion.", "q1r": 4, "q2": "Proponents provide a clear definition of success and a roadmap with milestones. Clear launch date and roadmap with milestones\r\nIt's good that the recommendation team included some pretty useful KPIs to allow us to see how helpful previous work was. The data provided can easily be made available to test and monitor the process in promises\r\nThe stated budget is reasonable enough and it makes me completely agree that the team is competent enough to tackle the challenge. Clear and reasonable budget allocation", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "The solution is not so different from Cardano Funding Platform: provide crowdfunding for all, provide ADA for ideas that proves potential. However, it might be a good way to make Cardano Catalyst community more popular in LatinAmerica.", "q0r": 3, "q1": "The team members have relevant experience and show their enthusiam in the proposal (The proposal is very well-written and informative). It includes information about each team member, road map in detail etc. They even plan for the longterm, which shows their vision for the project. Their LATAM business and community is a good resource that they can make use of.", "q1r": 5, "q2": "The Road Map and KPIs are very detail. It makes the project become easy to audit the progress and measure the success.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "Мы стремимся создать платформу, на которой предприятия и стартапы из Латинской Америки смогут легко создавать, управлять и продавать свои бизнес-токены.", "experience": "2 аргентинских партнера. Много лет занимаются бизнесом в LATAM, имеют опыт работы в стесненных ситуациях. Активные члены Catalyst."}