{"id": 383444, "author": "dcspark", "title": "Milkomeda documentation (es & pt)", "url": "https://cardano.ideascale.com/a/dtd/383444-48088", "category": 26242, "amount": 4000, "description": "Документация для Milkomeda в настоящее время представлена только на английском языке. Мы хотим перевести эти документы на другие языки для развития Cardano", "funded": 1, "upvotes": 52779357, "downvotes": 17262369, "votes_result": 35516988, "votes_cast": 224, "f6_no_assessments": 4, "f6_rating": 2.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The Milkomeda protocol will be in itself a great tool for the Cardano ecosystem, by opening the path to onboarding developers from other ecosystems. English is one of the most spoken languages worldwide when it comes to programming, but the more people are able to access documentation for developing tools on Cardano, the more d'apps will be built and the more the ecosystem will grow.", "q0r": 5, "q1": "The team is composed of skilled individuals, who have already started building and innovating in the Cardano ecosystem, they have also linked to the project's gitbook, which is very comprehensive and detailed. I trust the team will find reliable translators for the documentation and make sure it will be as efficient as possible.", "q1r": 5, "q2": "The project is about to be launched and as soon as the English version of the documentation will be ready, they will start the translation process for other additional languages. It is a straightforward process, that has been properly explained and that will be easy to evaluate during its progress.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 18, "ne": 1, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "This proposal was submitted in the Grow Latin America, Grow Cardano challenge, but I don't see the team mentioning any impact of the proposal on Latin America. Therefore, the proposal has almost no impact in this challenge", "q0r": 1, "q1": "\"The team is composed of well known ex-Emurgo and ex-IOHK employees who have been building the Cardano ecosystem for the past several years.\r\nThey also work in dcSpark which is a crypto ecosystem builder company. dcSpark was founded by three former EMURGO members who have been deeply involved in the Cardano ecosystem for years\r\nBut I have not seen any proof that the experiences proposed by the proposer are true, so I still have doubts about the veracity of these personal experiences.\r\nBesides, I have seen that the proposal has solutions to implement, but the plan, roadmap, and key metrics have not been given, reducing the feasibility of the proposal.\r\n\"", "q1r": 1, "q2": "As mentioned in the other sections, there is limited information about what this plan is concretely going to deliver and therefore would make it almost impossible to know what success measures or any other metrics could be use to track and follow the progress of this proposal.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 18, "ne": 0, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "The issue isn't very obvious, but it's directly related to the campaign's challenges. Proposal to reduce socio-language barriers by translating Milkomeda documents from English into other languages\r\nThis proposal is more of an idea than a concrete proposal. Although the proposed idea is good, it does not meet the needs of the challenge. You will translate Milkomeda documents into any language. Is it useful to the Latin American community?", "q0r": 2, "q1": "Please provide more information and proof of your experience. The more people know about the mind behind the project, the easier it is to trust. Potential team members will also want to know more about you and your abilities. Adding content to your proposal presented by you will also give your members and CAs capacity and commitment. Does the team include the famous former Emurgo and IOHK employees that the team mentioned? I think the team should provide specific information about the team's experience, qualifications or any link to the profile so that it is easier for us to confirm the proposal is viable or not.\r\nThe proposal does not provide enough information to help gauge its progress.", "q1r": 1, "q2": "In addition, the lack of detailed budget justification would be required to improve the relevance of the proposal. Both proposals require $4000 for two translators and 1 engineer to review. In my opinion, the budget needs to be explained more clearly, for example, how long they will do, their work will do\r\nTo improve listening, proponents should include a roadmap, milestones, development timeline, key dates, metrics, and KPIs.\r\nSince there is no blueprint, no KPIs or metrics, there is no way to gauge the progress and success of the proposal.", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "The proposal suggests creating language translations for documentation of their new EVM sidechain being released called Milkomeda. Milkomeda allows for EVM based DApps to be deployed on Cardano using Milkomeda and presents a great opportunity for Cardano to increase adoption. Making the tooling more easily accessible to different countries through language translations is a potential high impact task to execute.", "q0r": 5, "q1": "The team has a strong background in the community and has worked internally with IOG / Emurgo and in their own company now supporting the ecosystem. There are countless examples of open source code that has been delivered and a history of executing their proposals effectively. The budget is low, has a simple break down and is reasonable for the task at hand.", "q1r": 5, "q2": "The proposal is a simple suggestion to extend accessibility of current work they are carrying out on Milkomeda. No success objectives or KPIs were provided. The proposal is fairly simple to understand but it would have been good to know more on the success metrics side where the cut off is for translations. For instance this proposal could fund three months of keeping translations up to date and we expect to request further funding after that. Or perhaps instead we don't expect the documentation to change much and this will be the only proposal we need so this proposal covers 12 months and that information can help form some of the success measures or KPIs. ", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Перевод документов для пользователей и разработчиков на другие языки", "experience": "Наша команда состоит из хорошо известных бывших сотрудников Emurgo и бывших сотрудников IOHK, которые создавали экосистему Cardano в течение последних нескольких лет."}