{"id": 383466, "author": "mariacarmo369", "title": "Lovelace translation Portuguese", "url": "https://cardano.ideascale.com/a/dtd/383466-48088", "category": 26242, "amount": 7500, "description": "Языковой барьер должен быть снижен с помощью решений, которые предоставляют контент на многих языках.\nМы хотели бы перевести наш видеоконтент", "funded": 0, "upvotes": 18382890, "downvotes": 23857127, "votes_result": 5474237, "votes_cast": 148, "f6_no_assessments": 4, "f6_rating": 3.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "In the proposal, the author states that one of the reasons why the Brazilian community is not more present in the Cardano community is due to the language barrier and proposes to solve this issue by translating 50 episodes of the Lovelace academy. Even though I agree that introducing new concepts to a new user in their own language increases the likelihood of that person joining the community, before I will agree that this proposal is in line with what this challenge seeks, I would like to understand the precise details of the proposed path to ensure that a new user is added to the community as a result of the consumption of this translated material. Although the impact metrics associated with the challenge are presented, it is not clear to me how to ensure transparency in that regard. The proposed solution is aligned with the F7 challenge: Multilingual resources. \r\n", "q0r": 3, "q1": "The proposal is written by Maria Carmo 369, who has a YouTube channel with a substantial number of subscribers (12,900), therefore, I would consider her compliant based on her skills and experience. A budget section is also included, which describes how the author arrived at the final amount requested. In spite of this, I must say that I frequently employ translation services due to the nature of my job, and these are normally quoted on a per word basis, which would enable me to make a more accurate estimate. As a Latino and having the pleasure of having many Brazilian friends, I have been able to get to know the good and the bad of Brazil's culture. In explaining this, I am telling the proposer that an hourly rate of $30 is much higher than what is paid in the market. \r\n", "q1r": 4, "q2": "Lastly, and in line with the previous point, the data necessary for carrying out a complete evaluation of the auditability of the proposal are not included in the proposal. Therefore, I think that it would be beneficial for future catalyst cycles to include a roadmap of the actions you plan to implement, as well as an indication of when this information will be available from the organization. It is crucial that the community be able to audit the implementation process throughout the entire period.\r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 21, "ne": 7, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The language barrier is always an issue that needs to be addressed in order to bring knowledge and information about Cardano and programming languages like Plutus and Marlowe. Translating videos on these topics into Portuguese is a great solution for the development of Cardano in Latin American countries.", "q0r": 4, "q1": "\"The team behind this proposal is Educator and content creator across 3 channels in the community all Cardano related. But I just saw the proposalr listing 1 youtube channel with 865 subscribers what is the other 2 youtube channels?\r\nThe team wants to share knowledge about programming language, but I have not seen any team member with programming experience, how can I share knowledge about programming languages? Because I really don't understand clearly the videos that the team wants to translate are videos with content that the team created themselves or from what source?\r\nAlso, how many people are on this team?\"", "q1r": 2, "q2": "\"Proposal has given detailed and auditable budget breakdown through videos uploaded on youtube channel.\r\nBut the key metrics and KPIs of the proposal are not clear. How many new youtube subscribers from spanish-speaking countries? And how to check it?\r\nHow many enrolment of portuguese-speaking countries in the IOG programming courses through these videos?\"", "q2r": 2, "assessor": "z_assessor_645", "no_vca": 17, "ne": 0, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "Recommend to translate 50 episodes from Lovelace Academy Channel into Portuguese. It would be nice if you briefly describe why you chose the Lovelace Academy Channel. It stands for something. We'll then have more context in your proposal. There is a problem that describes the right solution to the challenge, the concept of the proposal is reasonable, but the absence of a blueprint affects the testability of the proposal. To get funding, I think the team should rewrite a plan that includes more detailed and clear roadmaps, team-level information, and KPIs. That will make it easier for users to measure recommendations", "q0r": 3, "q1": "Because of the lack of information, it is not possible to know if the project is feasible or not. Suggestions are only briefly explained, without further information.\r\nInformation The people behind the proposal are sketchy, do not provide any information about their skills and experience, so there is no basis for us to evaluate the potential of the proposal.", "q1r": 2, "q2": "The budget given is reasonable. The proposal lacks roadmaps, milestones, deadlines, metrics and definitions of success after 3, 6 and 12 months. There is no roadmap or timeline to be able to check\r\nThe suggested KPI is not clear, you should translate the document into portuguese, but the success indicator here is new youtube subscribers from spanish speaking countries, possibly also due to our mistake proposer", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 17, "ne": 2, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge by dealing with the language barrier to quality content access within latin america, where english has a limited spread. The main focus of the team seems to be translation of already existing content produced by this team for now which is a very cost effective way to expand the reach of already available content, it would be great to see it evolve to original content in portuguese. ", "q0r": 5, "q1": "- The team has a succesful history of funded proposals (Lovelace Academy) and therefore is in a good position to expand into Spanish and Portuguese.\r\n- It would help to see a detailed timeline with specific milestones and dates for the plan implementation. \r\n- The budget seems to be reasonable for successful implementation.\r\n- Generic KPIs are proposed to measure success, In future iterations of this initiative it would be great to see specific values as goals.", "q1r": 4, "q2": "The implementation of this proposal is easy to verify as it should be public content on a youtube channel, but the fact of not having a specific timeline makes it difficult to meassure effective delivery.", "q2r": 4, "assessor": "z_assessor_740", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}], "solution": "Мы хотели бы перевести 50 эпизодов с канала Lovelace Academy.\n25 о языках программирования и 25 на общие темы.", "experience": "Преподаватель и создатель контента на 3 каналах сообщества, связанных с Cardano"}