{"id": 384240, "author": "livingwaters.cr", "title": "Living Waters Costa Rica", "url": "https://cardano.ideascale.com/a/dtd/384240-48088", "category": 26242, "amount": 10000, "description": "В латиноамериканском сообществе не хватает информации об экосистеме Cardano и ее преимуществах", "funded": 0, "upvotes": 16179603, "downvotes": 19174543, "votes_result": 2994940, "votes_cast": 117, "f6_no_assessments": 5, "f6_rating": 2.8666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Это предложение немного запутано. Понятно, что целью будет культивирование пространства и осуществление в нем нескольких параллельных проектов, которые могут по-разному извлекать пользу из экосистемы Cardano. Однако идея очень большая и не детализирована, я не понял, где здесь помешают, например, выращивание грибов и разведение рыбы. Честно говоря, часть, которая имела для меня наибольший смысл, - это реактивация ресторана, поскольку в этом пространстве авторы намерены принимать ADA в качестве формы оплаты, а также продвигать дебаты об экосистеме. Верно, но это ни в коем случае не соответствует конкретным целям задачи; мы пытаемся финансировать проекты, которые особенно полезны для Латинской Америки, ее жителей, ее микроэкономики. Я считаю, что тот факт, что это место находится в Латинской Америке, должен был бы принести эту пользу, но я почувствовал отсутствие инициатив, которые выделялись бы в местном контексте, за пределами фермы. Мне кажется, что проект является очень хорошим бенефициаром этого начинания, но как насчет территории за его периметром? Неясно, где именно находится эта ферма, из названия мы знаем, что она находится в Коста-Рике (но у нас есть и другие подробности), кто будет отвечать за каждый проект, какие группы будут работать, будет ли она открыта для публики на 100% или только в определенные дни... К сожалению, есть много деталей, которые остаются неопределенными, плохо сформулированными, я не могу понять, какое влияние это предложение будет иметь для Латинской Америки, в частности. И в связи с этим я не думаю, что предложение хорошо отвечает предпосылкам задачи.", "q0r": 1, "q1": "Что касается команды, у нас нет четкой информации. Мы не знаем, кто они; как их зовут, каковы их профессиональные роли, какую роль каждый человек будет играть в проекте в конкретном смысле, небольшой учебный план того, что они сделали до сих пор, как они оказались вовлечены в экосистему Cardano. Авторы приводят в соответствующей части опыта некоторые области знаний, в которых они работают, такие как инженерия, сельское хозяйство и 3d (дизайн?), но это сделано очень поверхностно и без контекста. То есть, кто такой инженер? Что он сделал, что он будет делать в проекте? Нам было бы необходимо знать команду в полном объеме, таким образом, передавалась бы необходимая уверенность в их подготовке к выполнению этого проекта. Что касается графика, то здесь есть сценарий, который поэтапно объясняет, какие действия будут выполняться. Они заботятся о том, чтобы дать детали и перечислить цели, чтобы наше понимание стало более ощутимым. Меня беспокоит то, что каждая из этих фаз представляет собой нечто очень уникальное, то есть, как будто это своего рода мини-проект внутри проекта. Например: одна фаза посвящена открытию ресторана, но нам нужно будет понять много деталей об этом. Так как какие разговоры здесь будут продвигаться, какие конкретные вопросы во вселенной Cardano, как часто будут проходить эти дебаты, кого будут звать на такие встречи и многое другое. Другими словами, хорошо понимайте каждую часть целого. То же самое происходит и с другими этапами проекта, каждый из которых уникален и полон богатства, порождая потребность в деталях, которых, к сожалению, не существует. То же самое происходит и с бюджетным подразделением; некоторые темы даны, но им не хватает детализации. Когда просят $4K на строительство бассейна: почему? Какие специалисты будут здесь работать, выполнять какие задачи? В части \"время и расходы на интеграцию розничных клиентов\", какие расходы? Было бы важно, чтобы они уточнили, о чем идет речь.", "q1r": 2, "q2": "В ходе работы над сценарием авторы устанавливают, каковы будут конкретные цели каждого этапа. Это очень позитивно и очень помогает в аудиторской части проекта. Я считаю, что было бы лучше, если бы некоторые команды были разделены, чтобы преодолеть разрыв между самим проектом и остальным сообществом. Было бы проще, если бы один человек отвечал за команду, а команды могли бы работать над разными частями. Например, одна команда работала бы с рестораном, а другая - с бассейном; и у каждой команды был бы представитель, который мог бы говорить с сообществом, либо через Town Hall, либо разрабатывая более сжатый способ представления данных из каждой части проекта. Было бы также лучше, если бы части были разделены по месяцам, обычно я предлагаю именно это, потому что собирать семестры или кварталы - это так много времени для оценки. Положительно, что команда также включила некоторые KPI во время детализации предложения, это увеличивает доступность информации для мониторинга. Другими словами: Я считаю, что это наиболее полная и хорошо объясненная часть предложения, для меня единственное, чего не хватает, это установления контакта между авторами проекта и остальным сообществом Cardano.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "This proposal problem statement and solution is about spreading awareness and education on Cardano to the Costa Rican community by creating a mushroom and fish farm and making it as a community center for Cardano learning. The proposer mentioned at least 20% of retail clients incorporating Ada payment systems by Q2 2022\r\n\r\nAt least 20% of employee pay in ADA by Q2 2022\r\n\r\nAt least 20% Delegation from regulars to our stake pool for extra benefits at our location by Q3 2022 . Explain 20% of what? How big is the target market? The estimate number of 20% from unknown value is too general.  Therefore the key metrics and goals presented in this proposal are unclear whether it really gives impact to the community and Cardano.", "q0r": 2, "q1": "The proposer provided evidence of relevant skills and experience needed to implement the project. However, the proposer did not present in details the required manpower and resources to successfully implement the project. Moreover, the budget presented is not outlined clearly and broken down into identifiable terms. For example, in stake pool costs $4,000, which part in running SPO that costs 4000? Is it the hardware? Or the personnel that will be running the SPO?  For time and expenses for onboarding retail clients $2,000, how do you plan on spending that $2000? What expenses that required that amount? Is it on education materials? Or the manpower that teaches the community? What about the community space revival and mini summit that needs $4,000, is it for renovation and organizing events? If it is so, state how much is allocated for renovation and how much is used for organizing events. Therefore it is hard to assess whether the budget requested are reasonable to achieve the set goals. Furthermore, this proposal did not provide a sensible and conductible plan for implementation. Can you share the education materials that you are planning to distribute to the community? How do you plan on onboarding the community to use ADA as payment? How do you plan on processing the payments and how will it integrate with their business?", "q1r": 2, "q2": "This proposal provided a roadmap with milestones and a time horizon for achievement. However the numbers presented on how many people that they aim to educate or bring onboard Cardano is unclear. Therefore the key metrics and KPI that define the success of the proposal remains vague. Moreover, the proposer did not provide any information for the voters to keep track of their progress. Therefore the information provided is not sufficient to audit the progress and the success of the proposal. ", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 22, "ne": 5, "ng": 7, "nfo": 10, "vca_o": 1}, {"q0": "Living waters Costa Rica will increase exposure of Latin America community through closed loop mushroom and fishfarm, restaurant site and Cardano retreat space/meet ups. Although it seems beneficial to the community, the proposal might need to share more operational information.", "q0r": 3, "q1": "The budget of $10k ADA to make this project possible is not an issue but how to make the project more sustainable and environmental friendly. The information of which will be crucial for the community to decide should the project be funded. The proposal hasn't provided as much this type of information as in how much has been done on site and more operational detail on fish farm, coffee plantation,  closed loop mushroom or the tavern etc.", "q1r": 4, "q2": "As a community, the operational detail will be much appreciated. The majority of budget will be used for eco-stake pool and the community space revival so most of proposal detail are in those areas. However, it is important to study about the impact to the local ecosystem as a key factor to monitor the project progress and if it enhances the community stance on SDG. ", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "I see little alignment with the challenge, it's a good thing that they accept ADA and provide a space for spreading the word in their premises. Also great that they'll setup a Stake Pool Operator. But other than tha I believe the funds requested are not mostrly going to impact wignificantly the growth of Cardano in Latam.\r\nThe scalability of the project is very limited, so the population that could be impacted by this proposal is not large.", "q0r": 2, "q1": "The team seems to have a good general idea of how to move forward but their profiles don't provide any details about their experience of capabilities relevant to the nature of the project.\r\nThe budget could be more detailed so the reader can have a better picture of how the amount requested is justified.", "q1r": 2, "q2": "The proposal could benefit from having a section adressing how the community could verify implementation and succes.\r\nOne of the main items is and SPO which should be easy to audit.", "q2r": 1, "assessor": "z_assessor_740", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Using a closed-loop mushroom and fish farm that on boards vendors and creates entrepreneurs through employment and mini summits is great way to grow Cardano community on Latin America since the project brings economic value to people. Farming or agriculture is a traditional field and people from this field who can benefit from this project will be the new commers to Cardano community. People easily be attracted to anything that bring immediate realistic value to them. Therefore this is great way to bring these people into the community, which can make the community more diverse since currently member on Cardano Catalyst community is primaly have tech-base or financial-base.", "q0r": 5, "q1": "The proposer is very experienced in relevant field: farming and system engineering. He/she explains well about the solution. The proposal also includes detail plan with roadmap. All the steps are well-thought and is likely that will be implemented successfully. The team also has clear vision about future expansion.", "q1r": 5, "q2": "The roadmap and KPIs are on point. The roadmap is clear with all the phases and action will be taken on each phase, which is easy to track the progress and the KPIs are detail with number quantity for each goal, which make the proposal become easy to measure the success.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "Использование грибной и рыбной фермы замкнутого цикла, которая привлекает продавцов и создает предпринимателей через трудоустройство и мини-саммиты", "experience": "15+ лет в области регенеративного земледелия, аквапонного земледелия, системного проектирования в пермакультуре, приобретения и развития недвижимости, 3D."}