{"id": 384421, "author": "chrobilliard", "title": "Endorsing the marginalized", "url": "https://cardano.ideascale.com/a/dtd/384421-48088", "category": 26242, "amount": 37000, "description": "Нынешняя финансовая система не знает, как доверять тем, кто не пользуется услугами. Высокий уровень дефолтов и отсутствие доверия к унаследованным институтам.", "funded": 1, "upvotes": 53195351, "downvotes": 9045041, "votes_result": 44150310, "votes_cast": 170, "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Как латиноамериканец, я полностью поддерживаю это предложение, поскольку оно направлено на решение проблемы значительной части населения Латинской Америки, которая в силу характера своей работы лишена возможности пользоваться традиционными финансовыми услугами. Уже одно это полностью соответствует духу Cardano. Нано-/микро кредитное решение уже реализовано традиционным способом. В процессе обеспечения заемных средств и повышения кредитного потенциала они планируют использовать преимущества внедрения ISPO. Ожидается, что держатели ADA будут привлечены к их бизнес-модели, предлагая свои родные TOKEN на Cardano. Через 12 месяцев они рассчитывают привлечь 2000 держателей ADA с более чем 100 млн ADA, размещенных в их пулах ставок. Целевой аудиторией компании являются люди, чьи социально-демографические характеристики затрудняют или запрещают им доступ к преимуществам традиционной системы финансирования. Однако, с точки зрения децентрализации, я предлагаю команде улучшить характеристики предложения. Например, опишите, рассматривает ли команда на втором/третьем этапе проекта внедрение смарт-контракта для управления всем предлагаемым решением. Это повысит соответствие тому, что ищет Catalyst и экосистема Cardano.\r\n", "q0r": 5, "q1": "Тот факт, что бизнес-модель уже работает на рынке в течение 8 месяцев и показывает отличные результаты, дает нам некоторое представление о возможностях команды. Кроме того, добавление таких отличных партнеров, как MELD, VENT и ADABLUE, позволит им использовать возможности Cardano для улучшения своих бизнес-моделей. Что касается навыков и опыта, команда предоставляет как краткое и подходящее описание, так и ссылки на свои профили. Представлен простой бюджет, почти полностью посвященный разработке. Однако было бы идеально, если бы они также указали стоимость часа работы разработчика, профиль, который они ищут, и место, где они собираются его нанять (учитывая, что стоимость часа работы разработчика сильно варьируется в зависимости от контекста, в котором он нанимается). Отсутствие ссылок на людей или контакты упомянутых партнеров также является областью для улучшения.\r\n", "q1r": 4, "q2": "Вместо того чтобы представить этапы внедрения, команда решила представить описание результатов, первый - через месяц, второй - через шесть месяцев. С точки зрения проверяемости, я думаю, что команде следовало бы приложить больше усилий, чтобы описать сообществу, какие шаги или действия будут выполняться в ходе реализации. Тем не менее, я должен отдать им должное, поскольку они предоставили отличное описание метрик успеха проекта. Всего представлено восемь метрик, разделенных на четыре временных периода, первый из которых приходится на начало месяца, а последний - на следующие 12 месяцев.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 21, "ne": 12, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "This proposal is spot on aligned with the challenge. It does not only help grow the Cardano ecosystem in Latin America but even helps relieve human suffering. Every individual that doesn't have to go to greedy loan sharks is a success story. Perhaps the next step is to turn the loan sharks in to ADAentrepreneurs. :)\r\n\r\nAlready Grameen Bank proved that unbanked and underbanked communities are trustworthy and now this type of modern \"Collaborative Credit Scoring\" mechanisms help popularize that fact.\r\n\r\nI like the team's ready-for-collaboration thinking: \"We can even facilitate our credit scoring to other Cardano dApps who can benefit from our credit scores.\"", "q0r": 5, "q1": "A solid team with 10 members publicly listed in LinkedIn, a reasonable expansion roadmap and already existing product. What more can you ask? Well, you can ask partnerships. They have even those. A word or two from Ken Olling (MELD) would have helped legitimize the said partnership but I guess we'll just take your word for it. \r\n\r\nThe only open question remaining is this: What can the ISO/ISPO participants do with the native tokens? In the comments section the answer is \"Our token will be used by our users to get endorsed to get the loans in stablecoins / fiat\" but what will I do with the token if I'm nowhere near in Latam region? If you can answer that convincingly, I might just become one of those ISO/ISPO participants.\r\n\r\nLater the plan is to move the off-chain microloans on-chain but the team needs to come up with a sidechain or state channel solution to make sure the fees are kept to the minimum. They reveal in the comments an interesting detail: \"we are lending even bus tickets\".\r\n\r\nRegardless of these possible caveats, I am confident in the team to implement this initial plan and to find answers in the open questions.", "q1r": 4, "q2": "Although there's not much detail about the deliverables and KPIs, it's a fairly straightforward plan: employ one developer to set up the stakepools and another one to take care of the native token minting and distribution. The team hasn't budgeted anything for themselves. This tells me the company is already well-funded and functioning (running on 5% profit margin). Auditability comes from the fact that results speak for themselves. It is indeed the Cardano community who literally votes with their wallets whether or not to participate in Kashin's early steps.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 19, "ne": 6, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This would, if carried out properly, align perfectly with the goals of both this challenge and Cardano as a whole.  By providing opportunities for persons with need for small loans an opportunity to build credit where no useful/dependable/fair credit system exists, Cardano will be entering into a market in which it may very easily become a critical financial system while simultaneously improving the lives of members of the society.  Additionally the setup and operation of stake pools connected to this endeavor will increase decentralization of Cardano into Latin America.", "q0r": 5, "q1": "Based on the information provided by the proposers team, it appears that not only do they have considerable experience in financial management and app building but they are planning to integrate Cardano into an already-existing successful lending infrastructure, including an existing app already utilized by persons in multiple countries.  Based on information presented it appears highly likely that this will be a successful proposal.", "q1r": 5, "q2": "Progress and success are suggested to be audited by growth of connected pools and distribution of native tokens.  The numbers they intend to have on two stake pools within a year are respectable and if achieved should represent a considerable foothold in Latin America.  It seems that this would be easily verifiable and represents good potential for Cardano expansion.", "q2r": 5, "assessor": "z_assessor_708", "no_vca": 15, "ne": 4, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The problem raised by this proposal is clear and also related to the needs of the challenge, in the sense that its solution works to solve problems that would bring concrete solutions on a local scale and progressively on a wider scale in South America. Although the positive impacts for the Latin community are clearly stated, those concerning the Catalyst community are a little less explained, but it is possible to understand this implicitly, especially since the KPIs provide clear evidence of the overall contribution of this project. ", "q0r": 4, "q1": "The explanation at the beginning is an advantage and a confidence booster. The team members are clearly identifiable and supported by links on their linkedin profiles, as well as the accuracy of their mentors and partners. The budget is clear and combined with timing indicators, it seems reasonable. The timetable also seems realistic and clear. What is appreciable is that the technical aspects are addressed in an understandable way. The risks are not discussed, which could have been a benefit. ", "q1r": 5, "q2": "All the information given is clear. It is interesting to propose the KPIs in this way: \"Our project will be successful if\", which gives concrete indications so that the community can attest the success of the proposal. The website is provided and allows for more explanation. This project could benefit from offering more ways for the Catalyst community to follow its progress, which could perhaps help them in their desire to launch their project in Cardano.", "q2r": 4, "assessor": "z_assessor_739", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Мы выдаем кредиты представителям неформальной экономики; наш совместный кредитный рейтинг лучше оценивает риски, а процент невыплат в 2 раза ниже.", "experience": "Наша команда руководителей имеет большой опыт работы в финансовой сфере и сфере мобильности, возглавляя глобальные компании на рынке Латинской Америки."}