{"id": 385132, "author": "ciro.gelvez", "title": "Food produced with Agriculture 4.0", "url": "https://cardano.ideascale.com/a/dtd/385132-48088", "category": 26242, "amount": 85000, "description": "Традиционное сельское хозяйство не имеет доступа к данным о состоянии сельскохозяйственных культур в режиме реального времени, что позволило бы повысить урожайность и придать ценность конечному продукту.", "funded": 1, "upvotes": 52406516, "downvotes": 5098161, "votes_result": 47308355, "votes_cast": 175, "f6_no_assessments": 6, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Я поздравляю команду за это замечательное предложение, особенно за блестящую формулировку контекста и причин, по которым нам необходимо решить различные аспекты этой сложной проблемы. В попытке решить эту проблему с учетом как технологических, так и исторических аспектов, команда предлагает ряд решений, таких как разработка \"умных контрактов\" для всей сети распределения, IoT-устройств, обработка данных для страховых компаний и др. Хотя проект может показаться амбициозным, команда включает блок-схему, объясняющую, как они рассчитывают добиться экономической устойчивости. В целом, если предложенная здесь реализация будет осуществлена, это станет огромным успехом не только для Cardano, но и для всей индустрии. Возможность масштабирования в другие области была бы безграничной.\r\n", "q0r": 5, "q1": "Имеется очень подробное описание навыков и опыта членов команды, наряду со ссылками на их резюме на LinkedIn, дополнительно представлена ссылка на сайт их стартапа - Wseeds - где среди прочего можно увидеть прототип датчиков. Есть также раздел бюджета, где показаны четко определенные статьи расходов, а также четкое описание того, как будет реализован проект. Я считаю, что статьи в разделе бюджета вполне уместны. Как я опишу ниже, есть несколько аспектов осуществимости, которые необходимо улучшить для обеспечения безопасности сообщества. (1) Я хотел бы обратить ваше внимание на то, что не совсем понятно, является ли ваш стартап еще теоретическим или у него уже есть успешный опыт в области IoT-решений. Если последнее, то было бы интересно представить данные об успехах на сегодняшний день. (2) Хотя бюджет имеет положительные стороны, команде следует предоставить больше деталей, чтобы сообщество могло точно оценить, например, на разработку смарт-контрактов запрашивается $15000, необходимо представить почасовую стоимость и предполагаемое время выполнения контракта. (3) Не было упомянуто о возможных рисках для успешной реализации, а мне ясно, что проект такого масштаба столкнется со многими из них на своем пути. В частности, мне было бы очень интересно прочитать о преимуществах и ограничениях колумбийского законодательства в этой области и о том, как вы планируете с ними справляться.\r\n", "q1r": 3, "q2": "В этом предложении четко описаны 4 результата, первый - улучшение имеющихся у них датчиков, второй - улучшение платформы, третий - создание автоматизированной теплицы (захватывающе!), и, наконец, доля рынка, которую они планируют завоевать. Хотя сроки представлены как минимум 3 месяца и максимум 12 месяцев, я думаю, что мог бы описать это лучше. Хотя я понимаю сложность предложения, я бы рекомендовал представить графический элемент типа Ганта на раутах в случае получения финансирования или для будущих предложений в рамках циклов Catalyst. Другой аспект, который я бы рекомендовал для улучшения проверяемости, - это рассмотреть возможность перехода на открытый исходный код, а второй - это скорее рекомендация - изучить решения, которые есть у SingularityNET для улучшения их моделей IA.\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 27, "ne": 18, "ng": 8, "nfo": 1, "vca_o": 2, "reply": "We are so grateful about your comments. That give us a clear idea about what we need to do better."}, {"q0": "Общая идея и продукция (как технология, так и культуры) хороши. По предложению кажется, что компания предлагает и то, и другое.  Мое основное беспокойство здесь - отсутствие первоначального фокуса и разделение усилий, учитывая, что это стартап, с небольшими ресурсами. Конечно, бизнес-модели должны быть протестированы, но на начальном этапе, возможно, будет лучше сосредоточиться только на одном (коммерциализация технологии/услуги или конечного продукта).\r\nМне нравится, что есть наглядный пример цепочки создания стоимости, так гораздо проще понять, что предлагается.\r\n \r\nВ любом случае, также неясно, как само предложение действительно влияет на задачу. В нем говорится, что это колумбийский стартап, но не сказано, в какой стране он уже представлен и в какие страны он намерен расширяться, если получит финансирование. Наличие четкого плана развития бизнеса/расширения позволило бы легче оценить его влияние. Кроме того, предложение применяемой технологии или конечного продукта не обязательно сделает людей более осведомленными об этом или приведет к росту сообщества. Существует образовательный шаг о том, что стоит за приложением, для тех, кто собирается его использовать, чтобы они поняли и заинтересовались blochain и т.д. Здесь этот шаг также не ясен.\r\n\r\nИ последнее, я вижу, что здесь также отсутствует экономический анализ цены конечного продукта. Насколько дороже он будет стоить? Готовы ли люди платить за него? Если нет, то проект не будет экономически целесообразным, хотя технология потрясающая.", "q0r": 3, "q1": "Над этим уже работает целеустремленная команда в качестве стартапа, что может подтвердить их возможности. Резюме команды можно проверить по ссылкам на linkedin.\r\nЕсть надежный план развития технологии, но мне не хватает деталей в бизнес-плане/плане расширения, особенно если мы говорим о финансировании компании. Некоторые действия, кажется, занимают немного больше времени, чем должны (например, \"Создание видеорекламы для проекта\" займет 6 месяцев, что многовато).\r\n\r\nРаспределение бюджета справедливое и разумное", "q1r": 4, "q2": "Существуют миллистоны для стадии разработки/опроверки проекта, но и некоторые метрики на стадии развития бизнеса/коммерциализации, но могут быть некоторые ожидания роста продаж, чтобы оценить их со временем. Эти метрики не связаны со временем.\r\n\r\nИ последнее, что касается рисков, этот проект связан как с технологией, так и с развитием рынка. Это делает его очень рискованным, так как технология может не сработать, а потребители могут не захотеть приобрести продукт. Необходимо было заранее провести анализ затрат и выгод.\r\n", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2, "reply": "This is a really complete feedback. Thank you. We will make it work."}, {"q0": "This seems like a perfect example of a proposal that meets all of the goals for the challenge and potentially brings a new industry on to the cardano blockchain. I love that this proposal specifically addresses a regional issue and supports local communities with a combination of on-chain and off-chain solutions. This proposal helps reduce the inequality of resources and data access between small farmers and industrial plantations, therefore helping smaller farms compete on the global markets.", "q0r": 5, "q1": "The proposers have put together an undeniable experienced team, with a significant variety of relevant experts. Along with a very detailed explanation of the technology and plan for implementing the proposal it is highly likely this proposal will be implemented successfully. The timeline and  budget is reasonable and outlined clearly, allowing the community to have confidence in the project team and gives the community ample opportunities to assess the progress of the project.", "q1r": 5, "q2": "One of the best proposals for the community to audit and ensure the team is implementing the project correctly. Very few project that clearly identifies all the key members of the proposal, which makes it much easier for the community to proposers accountable for the success and failures of the project. It is clear that transparency and audibility are priorities for the proposal team. The proposal offers a realistic timetable to complete the work and provides enough information to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_338", "no_vca": 23, "ne": 6, "ng": 17, "nfo": 0, "vca_o": 1, "reply": "We are so grateful about your comments. Thanks a lot."}, {"q0": "The use of smart contract to improve the agriculture production is a also a good way to promote the use of Cardano ecosystem by the farmers.\r\nThis proposal would give an opportunity to people from various fields and background to learn about. Farmers, distributers and consumers. The proposal it's in alignment with the challenge", "q0r": 5, "q1": "It would be innovative  to introduce the smart contract in this system of agriculture as proposed trhough this project.\r\nThe timeframe seems reasonable,same thing for the budget, even if some sections would need some details.\r\nA strong team is behind this proposal, formed by experienced people in various fields, necessary to bring in some expertise for its success, added to that, all the experience of the Wseeds in that field. What I would like to point out is that I didn't find a specific region in Colombia where this project will be starting from, and also no reference to the collaboration with local authorities, as in such initiatives, those instances/people may slow things down if they don't buy in. ", "q1r": 5, "q2": "The company already has a website , where I assume this new project will be published for a possibility for community to check the progress. The roadmap of the project isdetailed and dates defined.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1, "reply": "We are so grateful about your comments. Thanks a lot."}, {"q0": "The proponent clearly understands what needs to be done for the proposal.\r\nThe given problem statement is very clear and involves several aspects of the challenge. This proposition has great potential! Smart contracts in agriculture are a revolution", "q0r": 4, "q1": "Undoubtedly, the team set out to develop the project is quality. Proposal provides information about team members with relevant skills and experience for successful project implementation.\r\nAccording to the proposal presented, it shows enthusiasm and seriousness for the proposal, however the scope of the proposal is quite wide so it would be better to give a list of potential risks and challenges in this regard. future. To increase the probability of the proposal's success.", "q1r": 4, "q2": "Multiple smaller milestones within each core milestone will indicate more confidence in the expected delivery to be successful.\r\nNo go-to-market strategy, no timeline, no budget analysis to see if the amount is right. Which list is generic so it's hard to check\r\nThere is no real roadmap with milestones or KPIs provided, making it difficult to track the progress and success of this project.", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 21, "ne": 1, "ng": 11, "nfo": 9, "vca_o": 1, "reply": "We are so grateful about your comments. That give us a clear idea about what we need to do better."}, {"q0": "The explanation of the problem raised by this proposal and the solution provided are clear and understandable. \r\nThis proposal fits well into the problems to be addressed by the Challenge. In the sense that it would raise awareness in South America about how Cadano works, but also improve the lives of people and support the development of local communities. In addition, the success of this project would have the potential to impact the rest of the world and promote the skills of your team and partners. \r\nThe only thing missing would be to explicitly highlight the benefits of this proposal for the Catalyst eco-system, even if these are understandable. The same goes for the KPIs which are not clearly linked to the challenge indicators, although they are concise and detailed. ", "q0r": 4, "q1": "All the information about the proposers is detailed, clear, proven and seems to match with the skills needed to carry out the project. It is nice to have such a clear picture of the members of the team. The budget seems to be in line with the needs of the mission, coordinated and coherent. The plan is quite detailed even if some elements may seems abstract for people who are not familiar with these fields. It would perhaps lack a precision on the possible risks of the project and the indicators of how the team would respond to them. But the technical aspects and the contextualisation are rather clear and appreciable.", "q1r": 5, "q2": "The roadmap is clear and seems to be realistic and coherent, as well as the corresponding time indices seem reasonable and well coordinated. The KIPs make sense and are articulated in themes (AgroBoxes, Wseeds platform, AgroLab) which facilitates understanding. However, there is a lack of information about the solutions provided in order to trace the progression of this proposal within the community. ", "q2r": 4, "assessor": "z_assessor_739", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1, "reply": "We are so grateful about your comments. That give us a clear idea about what we need to do better."}], "solution": "Сельскохозяйственная продукция из наших устойчивых культур, используемая с помощью нашего Agro-box и смарт-контрактов между фермерами, дистрибьюторами и потребителями", "experience": "Экспериментальный фиизикст, инженер-программист, биоинженер, экономист, стартапер с опытом разработки сельскохозяйственных технологий от 2 лет."}