{"id": 382199, "author": "highlander", "title": "Smart Contract Library - Phase 1", "url": "https://cardano.ideascale.com/a/dtd/382199-48088", "category": 26251, "amount": 45000, "description": "Cardano lacks an open source library of smart contracts that developers can use for rapid prototyping.", "funded": 1, "upvotes": 47711176, "downvotes": 17707950, "votes_result": 30003226, "votes_cast": 200, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "This project wants to create and open source a set of smart contracts template to speed up the overall cardano development. This will be a great contribution with an even greater impact if it happens, because of the boost it will give any developer to test and get to know the cardano ecosystem and the way things work. The proposal identifies a problem fitting for the challenge setting. There is a clear idea of how will this imrpove the cardano ecosystem described. There aren't any key metrics to speak of which align with the outline challenge settings. Adding such would be my advise for future proposals. I'm keeping in mind the authors of this proposal have serious and relevant experience in the creating of smart contracts in etherium and I'm confident they're going to be able to accept any future challenges comming their way.  If implemented this proposal will add a lot to the ecosystem in terms of reusable smart contract templates, which is necessary in growing communities like the cardano one.   ", "q0r": 5, "q1": "The plan is to hire an open plutus pioneer developer that has smart contracts experience but that hasn't happened yet, so no credentials can be given or linked which is a hurdle since a concrete person that could verifiably do the work would bring credability to this proposal. The budget is prety straightforward basically paying 1 guy a salary to do the work. The timetable could be better since there aren't any milestones except for the release of a beta version. The feasability of the project will depend on whether or not the team can find a developer to  do the job or not. The good thing is there's a clear understanding and plan for how many team members will be necessary for the implementaiton of the proposal. The budget is clear enogh, understandable and broken down to pieces in order to describe the steps necessary to reach the goal. There might be a need for more technical tasks and milestones along the way. There's a realistic timetable and if the proposers follow it, there should be no problem implementing the work as planned. There is a description of the necessary items to implement, but no roadmap that clearly explains the sequential tasks that will be worked on, which might help the supporters of this projlow the implementation .  The thing that I expected as a developer was to see any kind of architecture or plan for the technologies that are going to be used. This would have helped me to access how easy would be to find a person to do the job. Without specifics I'm unable to give a proper estimation of success based on what's described in the proposal. The proposers have signiffican expertice with the development of smart contracts on etherium which will be beneficial even though the ecosystem and paradigms are different on cardano.  There might be room for collaborations between this project and others I've seen in the Developer Ecosystem challenge. ", "q1r": 4, "q2": "Since the team plans for all the code to be open source on a repository, I don't imaging there will be a problem for anyone interested to follow through with the progress of the project. No KPIs are provided and this would help for any community member to measure the success of the proposal. It would be my suggestion to add a more concrete KPIs and maybe break the proposal in several different tasks that would be implemented over several funds.  A roadmap is a deffinite suggestion for future fund proposals, it's just an integral part of any good project.  There could have been more explanation on the technical side of things, but overall I believe in this project!   ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This is a brilliant and game changing idea to have a smart contract library available to help speedup the developments proocess on the cardano ecosystem. This is game changing it will help speed up the process of application development on the cardano blockchain since developers can easily use already build open source templates which will ease their burden of having to start writing smart contracts from the scratch.", "q0r": 5, "q1": "The team have the required expertise to execute the project. The budget sits well though not so detailed but it is reasonable to guarantee a successful project execution.", "q1r": 4, "q2": "The proposer has outlined a timeline for project execution but has failed to include key metrics/KPI's, which is key to be able to help audit the progress and success of the project when funded. ", "q2r": 3, "assessor": "z_assessor_799", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly and concretely answers the most important guiding question of this challenge, “How can we ensure future developers benefit from the work that is funded today?”. Its plan is simple to describe and understand, but its impact could be substantial, not only for existing Cardano smart contract developers, but also it could prove a great resource for attracting new developers to the platform by making their transition much easier with a prebuilt library of smart contract templates, which is the aim of this project. Overall the proposal could have a big impact on the ecosystem if properly executed as it could make the experience of smart contract developers on Cardano much smoother.", "q0r": 5, "q1": "The team clearly has experience with building blockchain related applications, as is evident from their website, which hosts multiple NFT related mini-games. But, from the looks of it their current smart contacts run on the Binance Smart Chain & Ethereum and it’s unclear if they have Cardano specific experience, as that’s not mentioned in the proposal. However this may not have a great impact on the feasibility of the proposal as their plan is to hire an external developer part-time to write the Cardano specific smart contract templates, in fact this is where most of their requested budget is allocated towards (40 out of 45K).\nTheir goals are realistic, the proposal is written in a very down to earth manner and the requested budget seems feasible. The very reasonable amount of $30/h is given, and a full year of part-time development is factored in.", "q1r": 5, "q2": "The audibility section of the proposal is the only one that leaves a few things to be desired, like a clear description of the KPIs and of the exact intended launch dates. However these can be easily deduced from the proposal, as they are mentioned. Thus the progress of the proposal according to the given timeline, as well as the completion of the smart contract templates could be easily monitored and verified by the community auditors. However if a future submission of the proposal will be required I would recommend including these elements.\nI would like to mention that in the case of this proposal specifically the community would need to audit the quality of the technical output as well as the overall completion of the project. We certainly want to be vigilant about wasting community treasury funds, but perhaps in this case it would be even more important to assess the quality of the smart contract templates generated by the project. It would be far worse to release a set of flawed smart contracts in the community carrying the stamp of approval of project Catalyst.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is clear and concise which aims to build and publish a series of smart contracts templates, similar to Ethereum's Open Zeppelin which Cardano developers can use. Laudable idea and it addresses the challenge effectively.", "q0r": 4, "q1": "The team is behind the Highlander platform and they have written smart contracts on Ethereum already, and are capable of implementing the project. The plan depicts that they aim to build an introductory series of smart contract templates for token issuance, NFTs, and governance protocols. They will then release the contracts to the public and refine thm based on user feedback. The team can successfully implement the project based on the valid facts in the proposal.", "q1r": 4, "q2": "The budget is well broken down and timeline clearly showing 3, 6 and 12 months. The amount requested is also reasonable for the project.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 23, "ne": 1, "ng": 15, "nfo": 7, "vca_o": 1}], "solution": "Build and publish a series of smart contract templates, similar to Ethereum's OpenZeppelin, that Cardano developers can utilize.", "experience": "We are the team behind the Highlander platform. Chris is our lead developer and has extensive experience writing smart contracts on Ethereum"}