{"id": 385056, "author": "titan", "title": "Transaction Editor & wallet", "url": "https://cardano.ideascale.com/a/dtd/385056-48088", "category": 26251, "amount": 16400, "description": "The cardano CLI is to cumbersome to use on large & complex transactions", "funded": 2, "upvotes": 142629562, "downvotes": 9374330, "votes_result": 133255232, "votes_cast": 664, "f6_no_assessments": 4, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Wow ... just waw! The proposer wants to introduce a transaction edditor that's more usable to replace the cardano CLI(command line interface). As a developer myself I can relate to the problem described in the proposal and verify that it meets the challenge setting. It's clearly articulated how this will bring value and spark joy in the developers in the cardano ecosystem me included! The key metrics are relevant and it's clear that the proposer has put a lot of thought in the actual proposal no less than the tool itself. Surely there will be challenges, but I have no doubt considering the authors experience and time management that challenges will be met without issue! There's absolutely nothing missing from this proposal, which is rare. This project will add something missing in the ecosystem: an easy way of working with transactions without having to suffer. There are no concerns on my part. This project will impact the community greatly if funded and I encourage people to vote for this as I totally will!", "q0r": 5, "q1": "There are so many credentials and skills listed that it took me a while to read and verify them all. The guy is a Ph.D. in Theoretical Physics developing simulations for correlated electrons systems (mike drop). There's a clear execution plan and he knows the work that needs to be done and the time and process to do it. The budget is clear and broken down well enough to be sensible to achieve the set goals, of which they are many and ambitious. There's a realistic timetable to complete the work, but I'm wandering if a team wouldn't be more beneficial, but I can certanly respect the man who wants to build a tool in the proper mannar and having team members is not always the way to go (at least in the begining). A detailed explanation is provided not only on the \"what\" but the \"how\" as well, which is rare and needs to be appreciated. The resouces necessary for the project development are clear. The technical aspects like the chosen edditor and functionalities already present and planned for the future are all described and meaningfull as milestones. The proposer has considered challenges and risks relevant to a successful implementation and more on top of that, he's analysed the impact of those decisions. The project is in sync with what's already been done, and this will be a building block in the future I believe. Absolutely stellar work of a proposal! Good luck! I hope you get funded! I'll vote for you! ", "q1r": 5, "q2": "Having to speak of tracability the author has already very specific timetable and plan on how to include beta testers from the community to help him in the work cycle as well as plans for documentation and letting the community know the features being made available. I see no problem with letting the people know what is done and developed. The metrics and KPIs are also on par with the rest of the proposal and that's seldom the case in many other proposals. A roadmap with milestones and all the bells and whistles are there as well as a time table that considers challenges and has a buffer for them. A clear and understandable problem and a coresponding solutions are present and well writen althrough a bit technical at times. The solution 100% is a solution for the struggles of the regular everyday software engineer.  Good luck! ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Currently the tools available for developing an app on Cardano (on low level) is still far from perfect. Using cardano-cli would still make developer struggle and have trouble, as what the proposer mentioned that there are a lot of people asking and looking for answers on Discord and Cardano forum. This proposal would build a tool to make it easier to use cardano-cli in a declarative way, means you declare what you want and the tool will handle the command for you. E.g for creating wallet, looking UTxOs addresses, balance, etc. By having this tool, it will greatly help the developer community building on Cardano, and further attract more developer to not get intimidated into getting started.", "q0r": 5, "q1": "Oscar (the proposer) have proven the experience in building these various tool, from the growing open-source Scientific Python Project until it became the open standard, to having a Ph.D. in Theoretical Physics developing simulations for correlated electrons systems. Looking at the Github repo, it has a comprehensive documentation, with already working feature such as: token mints, metadata, delegation certificates, unlocking of Plutus Smart contracts. Although, it would be better if Oscar could provide his Linkedin too for further verification. Reading through this proposal, Oscar could articulate clearly on what the problem, how he came up with the solution, and how to implement that solution with working example already provided. The 10-week action plan he provide is clearly described in details, and shows what to achieve on every week. Overall, this proposal have a high chance of success, considering the amount of experience he had. ", "q1r": 5, "q2": "The roadmap, the goals / achievements, and metrics/KPIs is very well defined in details (10-week plan). It is highly auditable considering this is an open project and we can track the progress through Github commit. The proposer have a clear understandable description of the targeted problem, and also able to articulate the solution in details, i.e using Emacs and specify why he choose it, why it would help developer community in Cardano, etc. ", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 21, "ne": 10, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The team pointed out the dead point of user experience and made a great way to fix it. This idea will save a lot of time and advance the risk when performing transactions in the node. In addition, the team also has detailed content to explain how it impacts and the target. \r\nMoreover, the KPIs are promising for people in Cardano communities. ", "q0r": 5, "q1": "The team has experienced how to perform their plan well, moreover, they did it since fund 6 and there is a video to visualize how this idea happen. The team also provides full of content to explain what they gonna do from point of view of users, and also with the technical explanation. Everything is clear and easy to understand. Moreover, there are many attached links in the proposal that can show how great this team did for the Cardano ecosystem. ", "q1r": 5, "q2": "They have a detailed roadmap in weeks and good KPIs for easily auditing their progress. \r\nThey also have a good explanation about the problem, and that's why their solution can address the problem very well.", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 2, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "A high level, declarative, transaction editor that fully integrates with your wallet, cardano-node and your text editor will be a helpful tool since it solve the problem of the cardano CLI. ", "q0r": 5, "q1": "He's a skillful developer with relevant experience and he explain very well what he plan to do. All information is very transparent: the time he will spend on the project, a detail timeline and KPI etc. Moreover he also demonstrates what the expect outcome will be with examples. ", "q1r": 5, "q2": "The metrics to audit the progress is well-thought. We can easily track the progress of the project because he's very transparent and the timeline is in detail plan.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "A high level, declarative, transaction editor that fully integrates with your wallet, cardano-node and your text editor.", "experience": "Working prototype for transactions, with token mints and unlocking Plutus scripts. Prize winner on the Plutus Pioneer Capstone challenge."}