{"id": 383382, "author": "joedavidmyna", "title": "Professional Accounting/Tax Advice", "url": "https://cardano.ideascale.com/a/dtd/383382-48088", "category": 26255, "amount": 10000, "description": "Les projets financés manquent de connaissances sur les implications fiscales et comptables des crypto-monnaies et sur la manière de rester en conformité.", "funded": 2, "upvotes": 63325790, "downvotes": 2140217, "votes_result": 61185573, "votes_cast": 173, "f6_no_assessments": 5, "f6_rating": 3.999999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great small project to provide Tax advise workshops and a resource for UK Crypto Tax. Whilst maybe slightly off topic on the challenge, this type of information is important for businesses starting out in this space and it can be very expensive to get even if you find people with the right experience. \r\nInternational experience is mentioned, however the Repository is only for UK Tax advice. What regions will the workshops cover?", "q0r": 4, "q1": "The proposers have clear experience in this space and have set a out a simple plan of 5 workshops and the creation of a repository of knowledge. Its not entirely clear what will be provided for the general Q/A availability. It would be good if this was specified. Overall the team should have no problem delivering on this project.", "q1r": 5, "q2": "Delivery of the workshops will be simple to audit. There are not too many details on what will go into the repository making delivery of this a little harder to audit. KPI's have been set out regarding number of viewers of the workshops and the resources. IT would be nice to set some goals here. How many attendees and document views would be considered a success? Given the price of tax advice though it would only take probably 10 people benefitting from this to be way cheaper than individually seeking out tax advice in this area.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 26, "ne": 3, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "In many parts of the world, there are no laws regarding crypto currency in place. Accountants are starting to draft them, but until anything is put in place, accountants and companies have no resource or knowledge on how to deal with crypto assets.\r\nAs such, having a guide and online workshops easily accessible to anyone would be a highly valued resource for the Cardano community and would help funded projects deal with this important task.", "q0r": 5, "q1": "The team is comprised of several skilled accountants that are already assisting companies with crypto currencies and NFTs. The plan they have presented is very reasonable, and the fact that they start local first (even if local means the UK) and then gradually adapt the knowledge for international legislations is a sign of a well-thought proposal.", "q1r": 5, "q2": "The information presented is succint, yet complete. The proposal leaves no questions unanswered and as such can be easily evaluated if successfully funded. I find the budget very reasonable, considering the task at hand and the skilled team members working on it. ", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 20, "ne": 2, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "Being UK-centric this scope is very limited and doesn't offer much to the global community. If the proposal had been a global database of tax advice and UK was used as one of, say 3-5, pilot countries, then this would have been spot on. Perhaps you can gather tax experts from other countries/states/regions and re-submit again for Fund8 with a renewed global scope. Perhaps in the first stage it could only focus on UK and the Commonwealth.", "q0r": 2, "q1": "No doubt this is capable team and would surely deliver what has been planned. Since the crypto regulation is in constant flux and varies wildly country-to-country, this would probably require permanent updates. If not a full-time team, it should be a Wiki with committed members handling the updates.", "q1r": 4, "q2": "The deliverables are easy to understand but perhaps a bit wrong. \"Provide two workshops for funded proposers\" would essentially limit the participation to British proposers.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 24, "ne": 0, "ng": 13, "nfo": 11, "vca_o": 1}, {"q0": "It would be very beneficial for people to get information about taxes from professionals. \r\n\r\nUnfortunately, based on the information in the proposal, it is unclear what countries' taxes can be covered by this proposal. Since taxes laws can be different for each country, it is not stated how it would be approached.\r\n\r\nAlso, regarding workshops, it would be nice to see more detail about online/offline form, how many attendees are expected and how many tutors will be there, so we could evaluate 1000/workshop. \r\n\r\nRating given 3.", "q0r": 3, "q1": "Based on the information of the proposal, we can assume that they will deliver the final outcome since they are a tax company.\r\n\r\nRating given 5.", "q1r": 5, "q2": "Two KPIs are provided, and given the content of the proposal, it is sufficient.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "* The problem statement addresses and issue which is relevant for all funded projects to avoid risk. Therefore it indirectly aligns with the challenge setting. The solution looks like basic information for finance and tax relations. I see a lot of potential to increase the level of impact with this team on behalf of project Catalyst to not just avoid risk but also boost the teams from a financial stable point of view.  ", "q0r": 3, "q1": "The proposal proves how to deal with accounting and tax topics in the UK. The team members are mentioned by name and role. What remains open is the experience of the individuals and for which countries the advise is applicable and therefor valuable for the Catalyst teams. The roadmap is outlined in a quarterly way with a rough description what is going to happen. The workshops show headlines what to expect and take away. The proposal offers a realistic timetable to complete the work. The budget breakdown could be a bit more specified. At the moment we do not get the information how many people are involved in which work package. The KPIs are very easy to measure. Taking into account that financial advise is relevant for all teams, I reckon with some financial KPIs where the funded teams benefit from, e.g. saved hours, saved money, law suits, … It would be amazing to get more information worked out in an updated proposal.", "q1r": 4, "q2": "The proposer provides a roadmap describing what is happening on a quarterly base. The problem description is understandable. What remains open in the solution is how to deal with different systems in various countries. In order to bring this proposal to the next level it would be very helpful to specify how to deal with different situations in different countries and why this is the base to accelerate funded projects. Accounting and tax is mandatory for everybody, there is some room left to tell the audience the measured impact of this proposal.", "q2r": 3, "assessor": "z_assessor_737", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1}], "solution": "Proposer des ateliers ainsi qu'une ressource fiscale afin de donner aux projets les outils et les conseils nécessaires pour être financièrement conscient et respecter les règles fiscales.", "experience": "Cabinet comptable spécialisé dans les crypto-monnaies, comptables qualifiés, en activité depuis 8 ans. L'équipe détient des investissements en crypto-monnaies individuellement"}