{"id": 384643, "author": "mayraceja", "title": "6-Wk Crypto Bootcamp + VC Demo Day", "url": "https://cardano.ideascale.com/a/dtd/384643-48088", "category": 26255, "amount": 120000, "description": "Les jeunes entreprises de crypto-monnaie doivent avoir accès à une formation axée sur la crypto-monnaie, aux meilleurs investisseurs en crypto-monnaie et à des mentors. La plupart des accélérateurs sont trop génériques.", "funded": 1, "upvotes": 38857025, "downvotes": 15226705, "votes_result": 23630320, "votes_cast": 162, "f6_no_assessments": 6, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Oui, cette proposition relève efficacement le défi et aurait probablement un impact significatif sur l'écosystème Cardano. En se concentrant sur les projets exclusivement cryptographiques pour l'accélérateur qui fournit non seulement l'éducation, le camp d'entraînement et l'encadrement, mais aussi une opportunité de lancer des projets au sein de l'accélérateur, cette proposition se distingue des autres dans cette catégorie. Cela augmente l'impact de la proposition, car les développeurs et autres crypto-entrepreneurs seront équipés des compétences nécessaires pour faire passer leurs projets à la phase suivante, tout en ayant une ligne de contact directe avec les acteurs clés de l'écosystème Cardano.  J'aurais aimé voir comment l'équipe prévoit d'impliquer la communauté Cardano dans le développement du programme et comment le produit final sera partagé avec elle. Il n'est pas clair comment les membres de la communauté intéressés seraient sélectionnés pour participer ou si ce serait un programme open-source ou s'il serait commercialisé pour le profit. Bien que je pense que le projet semble pouvoir avoir un impact sur la communauté, ce point doit être davantage expliqué. Pour obtenir la note maximale, les votants ne doivent pas se poser de questions sur les composantes \"quoi/comment/pourquoi\".", "q0r": 4, "q1": "Oui, étant donné le plan présenté et l'expérience des proposants, il est très probable que cette proposition soit mise en œuvre avec succès. Les proposants font un excellent travail en fournissant leurs références pour que les membres de la communauté puissent les valider avant de voter. Il est clair qu'ils ont l'expérience nécessaire et sont des vétérans de l'espace blockchain/crypto. Je donne 4/5 à cette section pour les raisons suivantes : 1) il n'y a pas de calendrier et la feuille de route n'offre qu'un aperçu du programme, mais pas comment ils prévoient de le développer/réaliser ; 2) le budget est loin d'être assez détaillé pour le montant demandé. Dire 100 000 dollars pour le personnel ne donne aux électeurs aucune indication sur la façon dont vous êtes arrivés à ce montant et sur son caractère raisonnable - combien de personnes ? à quel rythme ? pour combien de temps ? 3) si les références des proposants sont utiles, rien n'indique la volonté des \"invités\" de participer et si des mesures ont déjà été prises pour les impliquer. Leur absence ne signifie pas que ces questions ne sont pas disponibles ou qu'on n'y a pas pensé, mais il appartient aux proposants d'être explicites et de ne pas laisser les électeurs faire des suppositions pour arriver à la conclusion. L'incorporation de ces points à l'avenir donnerait probablement aux électeurs une confiance supplémentaire dans la faisabilité de ce qui est présenté.", "q1r": 4, "q2": "Malheureusement, les informations fournies ne sont ni suffisantes ni insuffisantes pour auditer les progrès et le succès de la proposition. Bien que je sois reconnaissant pour la section \"résultats et indicateurs clés de performance\" incluse dans le document, elle est trop éparse et ne permet pas vraiment de mesurer si la proposition pourrait être auditée. Par exemple, les proposants énumèrent 15-30 startups diplômées de la première cohorte ; au moins une session de mentorat en direct par équipe ; une journée de démonstration réussie ; et une enquête post-cohorte. Cependant, tels qu'ils sont présentés, ces critères apparaissent plus comme une liste de contrôle que comme quelque chose qui peut être audité. Je m'explique : si vous avez 15 à 30 diplômés du programme, comment allez-vous déterminer si leur temps passé a été un succès ? Cela inclut-il les abandons ou l'attrition ? Quels sont les critères de sélection de ces 15-30 personnes ? Ensuite, le fait d'avoir plus d'une session de mentorat en direct par équipe est un indicateur intéressant, mais cela fait également partie du cours qu'ils suivront avec les invités - il n'est donc pas clair comment cela aidera à vérifier la proposition puisque c'est déjà un critère pour leur achèvement. Les deux derniers points semblent également trop peu développés pour que les votants aient confiance en leur auditabilité. Comment définiriez-vous une journée de démonstration réussie ? Le nombre de projets financés ? Nombre de VCs intéressés ? Le nombre de participants ? Et, en quoi l'enquête post-cohorte sera-t-elle utile ? - Que mesurerez-vous ? - comment les résultats seront-ils communiqués à la communauté ?\r\nComme il semble que ces éléments manquent et sont pourtant essentiels pour les votants, je ne suis ni d'accord ni en désaccord avec cette composante. Dans les prochains cycles, j'encouragerais fortement une plus grande élaboration pour les électeurs.", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is to set up an accelerator for 15-30 start-ups by two proposers who have experience across the VC and start up space, though not in actually running their own accelerator.  This meets what the challenge is trying to do, though maybe not quite as well as proposals from already up and running accelerators such as SeedStars. ", "q0r": 4, "q1": "There is a reasonable outline of how the accelerator would run. No detailed plan has been provided on how to get to this stage and make it all happen. Whilst the proposer have been involved in this area, its not clear from their LinkedIn profiles how much they were involved in actually getting it all up and running. They probably have the networks to bring in the mentors given their experience. It would be nice to see a better budget breakdown than just staff 100k, Marketing/ Website/Docs/Admin 20k. \r\nA more detailed plan on how to manage the behind the scenes and costs would give more confidence of a successful delivery.", "q1r": 4, "q2": "The program ahs been set out and delivery it thus auditable. They have set out some KPI's which can be measured. One of the KPI's is \"Successful Demo Day\". What is success in this context. Is it the amoutn of funding raised, the number of people attending/viewing, the amount of media exposure? It would be good to have some goals around this against which success can be measured. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 25, "ne": 6, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "With aligned key metircs and goals, this proposal answers exactly what is being asked in the challenge. The problem is well identified and solution simply explained. The suggested bootcamp and investor connections sound like a scalable solution that could be a great follow-up for Catalyst funding.", "q0r": 5, "q1": "Both Mayra and Audrey are well-known figures in the industry and it's an honor to read a proposal written by them. The plan is very good and the enclosed 7-page pitch deck relays the same information more visually. A bit of nitpicking though: on one slide the white font on light background is almost invisible.", "q1r": 5, "q2": "The deliverables and KPIs are simple and understandable. Only thing that could have been opened up more is the budget. How is the $100,000 for staff distributed? Which roles, how many hours, at what rates etc.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "Definite 6 week crypto boot camp to provide mentorship. Clearly addresses the challenge.", "q0r": 4, "q1": "The team of experts have the experience to implement the proposal. The team are Mayra Ceja and Audrey Chaing, who are blockchain specialists with over 10 years experience. Links to their profiles are attached to the proposal. The team can implement the proposal successfully. The detailed plan outlines pre-wor, education and worksheet, 6 week live sessions, virtual bootcamp, recorded video, among others, which all point to a successful implementation of the proposal.", "q1r": 4, "q2": "The road map is clearly showing in the proposal as week 1 to 5 with clear guidelines. The budget however is quite high and a little more details could have been provided to allow effective auditing. Hence my 3 star rating. ", "q2r": 3, "assessor": "z_assessor_688", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This proposal demonstrates acceleration and mentorship benefits for selected companies. It is unclear what the rough selection criteria would be, so therefore, its unclear if this proposal benefits the community as a whole or if it is substantially additive to the existing ecosystem. ", "q0r": 4, "q1": "The Team is competent and accomplished. The concept is not unduly difficult.", "q1r": 4, "q2": "The proposal lays out no milestones in program development. Therefore, it's not possible for the community to audit the progress of this accelerator. Success milestones are present and seem publically auditable, ie did this happen? yes/no.", "q2r": 4, "assessor": "z_assessor_701", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "The proposal is the very definition, in a traditional and useful sense, of accelerating and mentoring individuals for beginning ventures.\r\nThis is a 6 week bootcamp course, with a structure layout and mentors already lined up.", "q0r": 5, "q1": "The experience of the team of proposers, as well as the mentor examples provided, appear to be of very high quality.\r\nThe plan, as mentioned, is a well-structured 6-week bootcamp course ranging from initial fundraising concepts, to mentor reviews and pitches.\r\nOne concern is a bootcamp course is a lot of information in a very short period of time. I was not able to determine if there will be any prior requirements. This is not a determining factor, however a consideration.\r\nThe budget is broken down as 100k or staff and 20k for everything else. I am not sure I am understanding the thought behind this number breakdown. I would suggest a slightly more involved explanation of individual costs, could help viewers.", "q1r": 3, "q2": "The graduates and as well as the survey (providing the results are anonymously public) are decent KPIs for this proposal.\r\nI am not sure it is clear to viewers what determined a \"successful demo day\".", "q2r": 4, "assessor": "z_assessor_816", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "Cryptcellerator (Bootcamp crypto de 6 semaines) par des experts en blockchain et des VCs chevronnés. Comprend des sessions en direct, des mentors et une journée de démonstration Crypto VC.", "experience": "10 +Years VC, Startups/Accelerator, Blockchain, a éduqué plus de 1000 startups, réseau de mentors des meilleurs Crypto VCs/startups."}