{"id": 384893, "author": "rich", "title": "Let's Woo Techstars", "url": "https://cardano.ideascale.com/a/dtd/384893-48088", "category": 26255, "amount": 405000, "description": "Catalyst a besoin d'une relation d'accélérateur de classe mondiale axée sur les possibilités de développement commercial de la blockchain Cardano.", "funded": 1, "upvotes": 25758397, "downvotes": 17906830, "votes_result": 7851567, "votes_cast": 127, "f6_no_assessments": 5, "f6_rating": 1.9333333333333331, "videos": [], "media": [], "f6_assessments": [{"q0": "Great idea which would definitely hit the challenge brief. TechStars is a well recognised accelerator and the exposure for Cardano and Catalyst would also be large driving future entrepreneurs to the Cardano ecosystem. \r\nHowever the title \"Lets Woo Tech Stars\", implies the aim of the project is to bring them in. Apart for experience listed at knowing the key people at Techstars, there is not plan on milestones associated with bringing them onboard. Ideally this proposal would have TechStars involved as is the case in \"Accelerator in Emerging Markets\" where the proposer is SeedStars.", "q0r": 4, "q1": "The proposer claims close links to TechStars and thus the ability to bring them in, however no evidence is given. \r\nIn its current form the proposal is a great idea, but there are no details on how the budget is to be used. Is the $400,000 to be $20k to each start-up? \r\nConfidence in this being successfully delivered relies upon TechStars being involved.\r\nMore details on the budget and proof of connections to TechStars (LinkedIn?), or ideally TechStars being part of the proposal would be required to have a high confidence of this being implemented successfully.", "q1r": 2, "q2": "The proposal as it stands only is requesting funding for the first stage, the Founders Catalyst Accelerator. All that has been put forward as success is that this is run. Funding for further steps at 6 and 12 months has not been requested so cannot really be considered as part of this proposal but more as a future project. \r\nWhilst delivery of this first stage is easy to audit, I would suggest there should be some intermediate steps. This should included confirmation that TechStars is onboard to run it, and selection of the teams. Success cannot just be that the program was run. It should be measured by the the impact the program has both on the teams themselves (how many came out with a minimum viable product, business plans, got further funding etc.) and also how much exposure the program brings to Catalyst and Cardano. ", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 26, "ne": 3, "ng": 18, "nfo": 5, "vca_o": 1, "reply": "This is really meant to stimulate a deeper discussion at Cardano Foundation.  The assessor doesn't understand the the total cost of the full accelerator expeience is $9MM because the 12-week accelerator is $3MM with a commitment of 3 cohorts.  The $400K option is a lighter version one-time and is for 20 teams over 10-weeks.  The idea had to be presented this way because the challenge has a $500K budget because: \"This challenge seeks professional-grade Accelerator programmes and Business Incubators to step up, co-develop, and deliver venture building programmes with Catalyst.\"    Techstars siad they would be interested in working with Cardano and sent program details, but asked they not we posted 'as is' in a public forum, they would be interested in discussions with the right folks at Cardano. Therefore, it is simply understood the community doesn't have the budget authority to release $9MM as Filecoin and Launchpool have funded theirs.  "}, {"q0": "No doubt Techstars could give a great boost for Catalyst funded projects.\r\n\r\nThe proposer quoted this part of the challenge: \"This challenge seeks professional-grade Accelerator programmes and Business Incubators to step up, co-develop, and deliver venture building programmes with Catalyst. \" As this suggests, it would be better if it was the people in the accelerator who submit the proposal. The proposer claims to have \"long standing relationships with Techstars founders, General Manager and program managers.\" If it is so, it would been amazing to get at least a few words from them here.", "q0r": 2, "q1": "$405,000 would be 81% of the total challenge budget but if you pay attention to the budget you see this proposal is in fact only asking for $5,000 (and 20 hrs) to be used for the negotiations. I would suggest doing that 20 hours effort and re-submitting the proposal in Fund8 with the Techstars staff.", "q1r": 1, "q2": "No real plan here. Just an idea to spend 20 hours negotiating. Hard to audit.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 26, "ne": 4, "ng": 12, "nfo": 10, "vca_o": 1, "reply": "Correct, 80% of the $500K budget is hard for the CAs to reconcil but it is the first time this challenge was presented, so the budget for it is way under estimated.  This information in the proposal will help educate the community on the costs structures they should be considering to actually accelerator Cardano projects."}, {"q0": "It would be better to provide more specific project purposes and delivery mechanism for the Cardano ecosystem, and possible other blockchains could adopt your module. Which price tag near ½ million project asking, should there be a greater impact on reaching overall Cardano end-users in your program. For the project scale of approx. 80% of the total challenge fund, should at least provide at least a simple analogy to indicate Techstars (yet to know who) is most suitable to deliver F7: Catalyst Accelerator & Mentors and 20% for others.", "q0r": 2, "q1": "Should at least provide a single traceable to know what/who is behind the project, asking for 4050000 over 500000 of total allocation challenge fund. For example, when saying Apple is proposing this project, the least to provide apple.com, apple.net, apple.dot.anything or similar available resource and validate-able links so CA can give it a quick view. In your case, what is \"Techstars\"? Do you mean www.techstars.com if you google it? Should clarify in your project precisely.", "q1r": 2, "q2": "Apart from \"Arrange meetings / Secure Quotes / Hold Discussions on viability of long-term relationship\" and quote for 20 x $250 per hour then 400k \"Contract for the Founder Catalyst Accelerator\". This 400k should disclose further info or any kind of initial or sample of Service Level Agreement (SLA) may be used for such contract and be monitored from Cardano project and the community.", "q2r": 1, "assessor": "z_assessor_661", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1, "reply": "Yep, the outcome is simple - get people to look at Techstars as a possible solution to this challenge, which this Assessor did!  The actual scope of the $500K challenge is way under budget for bringing in a truly world class accelerator."}, {"q0": "This proposal is, at its core, a negotiation without the guarantee of success and a partnership funding request. These should be, in my experience, two separate asks and should go to the community as such.\r\n\r\nThe uncertainty inherent in the negotiation causes me to disagree that this effectively fuels the expansion of the community and provides capacity-building mentorship.\r\n\r\nAdditionally, this proposal is for a 10week pilot program with Techstars and therefore doesn't provide sustained acceleration and mentorship.", "q0r": 1, "q1": "Again, these are two requests in one proposal. Will the negotiation be successful? It's not clear. Is this the right person to lead the negotiation? That also is not clear. Is this what the community wants? Also unclear.\r\nWill Techstars deliver an accelerator? yes, that is very likely.\r\nGiven the uncertainty in the negotiation component of this project, I am disagreeing this proposal as written will be implemented successfully.", "q1r": 2, "q2": "There are no in-process milestones. No auditable negotiation milestones. \r\n\r\nThe success parameters for 6 and 12 months are irrelevant as they pertain to an as yet-unauthorized longer, future relationship. ", "q2r": 1, "assessor": "z_assessor_701", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "* The problem statement aligns with the challenge setting. The solution suggests to use established Techstars and develop a partnership. This could enable ventures to grow stronger and faster. The disadvantage from my point of view is that we fund it to 100% and it is a one time thing. What would be interesting if outside Cardano investors would contribute partly or maybe even completely in order to put 'our' teams in the a real market competition. ", "q0r": 3, "q1": "* The proposer drops a name 'Techstars' and proves with impressive numbers their success story. Helpful would be to get more information about the proposer, too. Techstars know what they do and they run a 12-week program. Due to 'budget' restrictions from this challenge the author suggests to start  a trial version of 10 weeks. Beyond a pretty high hourly rate (in comparison to other proposers in the same challenge) we do not get any information about the budget breakdown. What is confusing: 12-weeks with 3x12 teams to 10-weeks with 1x20 teams. What remains open how to select the teams (stage, size, industry, country, business model, …). ", "q1r": 3, "q2": "We do not get all information to audit the progress and the success of the proposal. Problem and solution are understandable. The metrics to accelerate the funded projects are wage and could be elaborated better. What does the generic Techstars processes and successes mean for Catalyst teams? And most important what happens after the 10-12 weeks? I would love to see a clearer picture of this proposal in an updated version.", "q2r": 2, "assessor": "z_assessor_737", "no_vca": 12, "ne": 2, "ng": 7, "nfo": 3, "vca_o": 1}], "solution": "Développer un partenariat Techstars comme ils le font avec diverses entités en fonction des causes et de la commercialisation.", "experience": "Relations de longue date avec les fondateurs de Techstars, le directeur général et les responsables du programme.  Expérience avec leurs programmes et leurs mentors"}