{"id": 385190, "author": "hilina", "title": "Mereb", "url": "https://cardano.ideascale.com/a/dtd/385190-48088", "category": 26255, "amount": 96250, "description": "Besoin de mentors pour le projet de catalyseur des start-ups communautaires", "funded": 0, "upvotes": 16720440, "downvotes": 17001468, "votes_result": 281028, "votes_cast": 120, "f6_no_assessments": 12, "f6_rating": 1.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "L'idée en elle-même a beaucoup à voir avec le challenger, puisqu'il entend créer une plateforme qui réunira mentors, entrepreneurs et startups - comme le dit l'auteur. Cependant, le fonctionnement de cette plateforme est très confus. A commencer par le fait que l'on ne sait pas s'il s'agirait d'un environnement physique ou virtuel. En ce qui concerne la répartition des dépenses, l'auteur a inclus des dépenses telles que la location de bureaux et le mobilier, ce qui nous amène à conclure qu'il s'agirait d'un espace physique. Mais il serait extrêmement important que l'auteur clarifie cette question, s'il s'agit réellement d'un espace physique, où serait-il situé ? Il n'est pas non plus clair comment se ferait le suivi des personnes sur cette plateforme ; Tout d'abord, comment les personnes/petites entreprises à conseiller seraient-elles sélectionnées ? \"Le modèle sera fourni par nous et comprendra les rapports nécessaires demandés pour le soutien fourni\", indique l'auteur. Mais quel est le contenu de ce modèle ? Ensuite, quelles informations l'équipe d'experts rassemblerait-elle pour les aider ? Comment les connaissances acquises dans l'espace en question seraient-elles testées, comment pourrait-on voir, dans la pratique, l'avancement des bénéficiaires ? L'auteur cite quelque chose comme les sujets d'engagement et les heures de travail, mais ce n'est pas suffisant pour nous permettre de comprendre cette question. Je crois que la fourniture de données globales fait défaut, il n'est pas possible d'avoir une visualisation solide de ce qui se passerait dans ce projet, malheureusement. Je suggère que l'auteur revoie l'explication de la façon dont les suivis seraient effectués, à travers quelles mesures le succès serait mesuré et comment ces résultats pourraient être exposés à la communauté Cardano.", "q0r": 2, "q1": "L'auteur ne nous donne pratiquement aucune information sur lui-même et son équipe. Tout ce que nous savons, c'est qu'il a de l'expérience dans le travail de mise en relation des personnes et qu'il est également impliqué dans le réseau blockchain en Afrique. Mais de quel type d'implication avec les hubs s'agit-il, selon lui ? Quelle est sa participation à la blockchain africaine ? A-t-il participé au Grow Africa Challenge, Grow Cardano, du fonds précédent ? J'aimerais voir quelques exemples de son travail précédent, comment il est arrivé à notre blockchain, etc. Et à propos de son équipe, nous ne savons pas qui ils sont, quels sont leurs noms, combien de personnes composent l'équipe ; ce que chacun fait, des exemples de travaux précédents individuellement... Je viens de réaliser qu'il y aura une équipe car dans la partie division des dépenses, il parle de plusieurs domaines comme le marketing, les développeurs, les ressources humaines, etc. Il me manquait une personne spécialisée dans le design, ce qui est toujours important pour créer une navigabilité et une apparence positives pour les portails en ligne qui seront créés. À propos d'un script, cette partie de la proposition est malheureusement totalement absente. L'auteur ne précise pas quelles seraient les étapes nécessaires à la réalisation de son projet, comment se déroulerait la séquence des activités qui composeraient un tout, et combien de temps durerait chacune d'entre elles. Nous n'avons aucune idée de la manière dont ce projet serait construit, il est nécessaire que l'auteur crée une chronologie des activités pour que nous puissions comprendre le processus, et pas seulement le résultat. Et enfin, il y a un clivage financier, bien qu'il soit superficiel. Par exemple : 500 pour l'utilité. Qu'est-ce que c'est ? 10 000 pour les ressources humaines : combien de personnes travailleraient ici, en faisant quoi et pendant combien de temps ? Les mêmes questions peuvent être adressées à 12 000 pour les développeurs. Il demande 2600 pour les voyages, mais je ne comprends pas pourquoi, voyager où et faire quoi ? Ces questions et d'autres doivent être clarifiées.", "q1r": 2, "q2": "L'auteur ne nous fournit pas d'indicateurs clés de performance (KPI) ou de mesures de réussite pour nous permettre d'exercer l'auditabilité du projet. S'il existait un script avec des phases très détaillées, nous pourrions contrôler si ces activités ont lieu, et aussi si elles se déroulent dans le temps imparti. Cependant, il n'y a aucun type d'information qui puisse nous donner un contenu à utiliser comme base et promouvoir le suivi. Je suggère que l'auteur dessine quelques sujets à ce sujet, établir un pont avec la communauté Cardano, afin de présenter les résultats des parties du processus général, c'est-à-dire, progressivement ce qui serait fait, et enfin, que les gens qui ont été guidés ici dans ce certains commentaires. De cette façon, nous pourrions comprendre si, au final, les objectifs initiaux ont été atteints, si le mentorat a eu des effets et comment les bénéficiaires vont développer les connaissances acquises dans le projet.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 19, "ne": 13, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "This proposal is essentially asking for $96,250 to build a list of mentors and integrating it with websites and maybe paying some mentors. Of that cost $45,000 is for 'other contingencies'. \r\nPlease provide a clear plan for how to bring it all together or deliver it.\r\n\r\n", "q0r": 1, "q1": "There is no plan on what will be delivered. Please provide evidence of your experience. Please provide a detailed plan of what you will deliver and when with an associated budget. As currently stated it is very unlikely a successful project would be delivered.", "q1r": 1, "q2": "There are no clear deliverables and associated timelines against which progress could be measured. There are no KPI's or goals against which success could be measured. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 31, "ne": 2, "ng": 24, "nfo": 5, "vca_o": 1}, {"q0": "I suggest a deeper check of the assumptions for the financial projections and look for areas where costs were underestimated or omitted altogether, so a more practical assessment can happen and for a clearer understanding of possible pitfalls and challenges.", "q0r": 2, "q1": "Despite the challenge, this proposal presents a preliminary understanding of why new criteria will be needed to address the challenge. It is essential that this proposal explains how it aligns with the community's goals. Several improvements can be made and a proposal can have a higher impact level and explain what is the problem to be solved and how this proposal will benefit the community. Moreover, I believe that we need to understand how to scale up the proposal to meet future challenges and what are exactly the goals and key long-term objectives.", "q1r": 2, "q2": "There is not enough information on the feasibility of the proposal and how effectively it addresses the challenge in its entirety. Are there similar success stories in other blockchain environments or how will it integrate with other platforms. Lastly, I got the impression the proposer doesn't have the full extensive knowledge and other questions seem unanswered.\r\nMore details are in need in terms of types of data that will be retrieved, mentors assessments and quality due diligence, data collection processing, storage, and overall data governance in terms of the proposed project. ", "q2r": 2, "assessor": "z_assessor_243", "no_vca": 23, "ne": 5, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "It is unclear how this proposal amplifies and commercializes funded projects. If we are to create a yet another matchmaking platform, it would have to be justified why it's so much better than e.g. the one on https://projectcatalyst.org/community or the channels currently available in Discord.", "q0r": 2, "q1": "Apart from brief \"worked with hubs\" comment, there is no mention of who the team is or what their qualifications are. There is a budget but it is unclear why the office and furniture are needed to begin with. Project timeline and detailed plan is missing. Even the scope is unclear.", "q1r": 1, "q2": "There is no real plan here and no milestones or KPIs given.As it stands, it would be very difficult to measure and track the progress of this proposal. ", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 27, "ne": 3, "ng": 14, "nfo": 10, "vca_o": 1}, {"q0": "The proposal has identified a problem and addresses a solution to the problem. However, is unclear why a third party platform (tool) will help both the mentors and the mentees as the mentors profiles \"will be integrated with different websites\" (which websites (topic)?) and what will be the benefits for the Cardano ecosystem and the people involved.\r\n\r\nThere are no KPIs/metrics defined to measure the success of this proposal (how many viable projects could be mentored in a predefined period of time? what is the potential funding that can be attracted/invested? etc.).\r\n\r\nThe execution part of it seems to be lacking in essential details as the next review sections explain.", "q0r": 2, "q1": "There are no detailed info about the team members, their experience and assigned roles relevant to this proposal.\r\n\r\nThe budget is outlined and broken down into identifiable items, but it lucks in providing necessary info about the resources that will require spending money (human resources - how many people are necessary for the project and how much time they will work for? etc.)\r\n\r\n\"Advertising and Promotional Expenses\" has a component (Other/additional categories) that needs 45% of the requested amount of money but it lucks to provide info regarding what is to be done for this item.\r\n\r\nIf additional funding is required to implement the proposal, the proposer has not provided a verifiable plan in this regard. (this type of project if it starts it should stay for a period of time on the spot light).\r\n\r\nThe proposal doesn't offer a realistic timetable to complete the work.\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (competition, legal constrains etc.)", "q1r": 1, "q2": "There are no KPIs/metrics defined to measure the success of the proposal. (how many mentors will get to be involved into the project, and what will be the output of their work (goals)? etc.)\r\n\r\nThe proposal itself reads very poorly and it doesn't look like an executable project and it needs more editing so that it can be assessed properly given its direction.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 22, "ne": 5, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The proposal aims to provide mentors for the catalyst community start ups and create a platform for mentors and start-ups & mentors to interact between. However it does not clearly identify how the platform will be constituted and what is the scope of the mentorship or what forum this will take place. \r\n\r\nThe proposers scope is varied and broad and does not have a firm vision as to how it would incubate professionals and businesses and the expected outputs do not align with the campaign brief. For example the proposer says they will work with Cardano in streamlining the process of this entire engagement end to end, but it does not outline how it will work with Cardano. In important future consideration is how will a program scale, the proposer would have benefited from outlining what the next steps are for this community and what happens if there are too many individuals need mentorship and not enough mentors. ", "q0r": 2, "q1": "The plan does not detail any credible members or show past experience of members involved, it also does not detail how the matchmaking will take place and whether or not any online platform will be involved. To the proposal credit it details a spending plan to establish an office as a hub for the mentorship program. However It would be more valuable if details of where this office will be located were disclosed, it is arguable that this work could be done without a central office. In addition to this spending is not mapped against any kind of timeline of events. Within the plan it identifies a development team, however the proper does not mention what software is being developed and how it will produce an outcome, without that detail in the scope of the plan there isn't a clear outcome of success. \r\n\r\nThe proposer does not highlight what the previous experience in mentorship or working with hubs to connect ecosystems is. Links to external credentials such as a website or Linkdin profile would have been valuable here. ", "q1r": 1, "q2": "The information provided does not provide a sufficient way to audit the progress or success. Within the expected outputs there are no measures of what a good outcome looks like, for example there are no milestones or deliverables measured against those milestones. \r\n\r\nThe proposal does not outline how it will be kept accountable to those within the Cardano or Catalyst ecosystem. For example it might have been better to have a measure of success being a certain of number of proposals submitted by those involved in the community in Africa to project catalysts's fund 8 or 9. Another audit metric could have been to measure the quality and strength of the created a network or mentors and mentees within a certain demographic that have brought forward quality opportunities to individuals that our currently outside of the Catalyst ecosystem. ", "q2r": 1, "assessor": "z_assessor_332", "no_vca": 21, "ne": 10, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Interesting proposition but more information is required as to why it requires an office space to connect individuals together towards that goal. This can be made with larger exposure in an Application or online format.", "q0r": 3, "q1": "Not much details are revealed to assess the skills needed to deliver the plan. More confidence and transparency can be achieved with some form of content related with the  goals.", "q1r": 2, "q2": "The information needs more work as to how are mentors connected, and what sort of support is provided through this solutions as well as more details on KPIs and stage by stage plan.", "q2r": 2, "assessor": "z_assessor_594", "no_vca": 18, "ne": 0, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "From the proposer's explanation the problem he is pointing to is not clear. It would be good to present the problem in more detail as well as to offer an elaborate solution. Unfortunately, I cannot decide whether this idea has a positive impact on the Cardano ecosystem. From the information provided by the proposer in the proposal, it is not clear how this idea will add value to the Cardano and Catalyst ecosystem. It would be great if the KPIs were developed and presented. The proposal is not able to scale and address future challenges.", "q0r": 1, "q1": "Unfortunately, the proposer does not provide any information that shows who is behind this idea. We do not have the insight into the knowledge, skills and experience needed to realize this idea. We don't know who the people are and how many people would work on this project. It would be good to have more information. The budget is presented but unrealistic. It would be good to make a clear price list within the budget of how much each item costs. The detailed implementable plan was presented, but more as an idea and what should be done like \"to do list\". Unfortunately, we do not have any details of actionable tasks and order of execution a realistic timetable to complete the work and technical aspects and technologies needed to start and implement the project. Proposer lists the resources needed to implement the project, which is great. Each project carries within certain risks and it would be good to work them out as well.\r\n\r\n", "q1r": 1, "q2": "In this proposal we do not have a roadmap, KPIs, time frames within the project will be implemented. Unfortunately, due to the lack of all the necessary information, the community cannot in any way track the development of this idea.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about creating a platform to make a better interaction between mentors, entrepreneurs, and startups for the Catalyst. This is a meaningful idea, and addresses this challenge. Undoubtedly, the problem statement can not be denied, however, it should be described more in detail with some supporting arguments. The solution convinces me of a clear potential impact on the Cardano ecosystem in the long term.\r\nTherefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "Proof of team feasibility can be seen [\"Strong networking skills and connected to the blockchain community in Africa\" is very important for a proposal of this challenge], however, there is NO reference/proof (documents/links,...) for verifying that. For more feasible: (1) Some information of demo/pilot/similar works done by this team should be provided; (2) Measurable KPIs/metrics should be provided; (3) Budget explanations of calculation base and Risk should be added.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "there is a lack of a wide range of information that should be added, including: (1) reference/proof (documents/links,...) for verifying team profile; (2) Information of demo/pilot/similar works done by this team; (3) Measurable KPIs/metrics; (4) Budget explanations of calculation base; and (5) Risk.\r\nTherefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "The problem statement does address the proposal but not the WHY. It may be obvious to the writer, thus it is is not clear to the reader. It is undefined how the Catalyst startups benefit from it to become faster and stronger. In order to improve it and show how all funded Catalyst teams benefit from it, it would be helpful to show how they benefit from this proposal.", "q0r": 1, "q1": "The team does not provide any information that provides evidence that it is capable of delivering the solution. The proposal describes resources necessary to implement the proposal and lists very detailed all kind of expenses (rent, hardware, people, legal,…) It would be very helpful to explain much more detailed what costs lead to what result, e.g. in a detailed action plan mapping to a roadmap. The proposal does not show any KPIs how the success for the Cardano ecosystem could be measured.", "q1r": 2, "q2": "Roadmap, minestrones and success metrics like KPIs are not included in the proposal. Beyond it is not clear what is going to be developed. I do not see a clear understandable description of the targeted problem we are addressing int his challenge and would love to see a more detailed explanation about the execution of the idea. ", "q2r": 1, "assessor": "z_assessor_737", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This proposal's defined purpose is to be able to match mentors with those needing mentoring, which at the root, does address the need for \"accelerators\" and \"business incubators\" for startups.\r\nAn improvement for this proposal would be to provide more detail.", "q0r": 4, "q1": "Available, is a great high-level overview. However, there is little reference to the proposer's, and team's, experience level in this field.\r\nIn addition, I would suggest providing more structure and detail on the plan to acceptance of mentors, as well as the matchmaking of mentors and \"mentees\".\r\nA work breakdown structure (WBS) would be beneficial in this case.", "q1r": 3, "q2": "Within the detail of the mentors, there is a reasonable amount of information to presume, but not ascertain, that the progress and success could likely be audited based on the updates of the mentors and those receiving the help.\r\nIt is great that the proposer went through the effort to list the breakdown of the fund allocations.", "q2r": 3, "assessor": "z_assessor_816", "no_vca": 16, "ne": 3, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The problem statement is clear and I can see how it will be able to add value to the Cardano ecosystem. However, I'll give 3 stars for the impact metric for one main reason: it's not scalable. It's hard to visualize from the description how the solution will be able to scale up in the future as the community of startup mentors and mentees expand, as everything seems to be going through a central entity (the firm, as the proposal puts it). Perhaps a better way to run this would be in the spirit of decentralization similar to how DAOs are runned, in which the proposers can serve more as a facilitator in the process instead of the ones running everything, and leave the actual functioning of 'firm' to the  mentors and mentees who are invested in the community. This can allow it to be self-sustaining in the long run, so in the short run what the proposers can do is to get the infrastructure needed up and running, for example through designing incentive mechanisms (think: DAOs, POAP, Tokenomics etc) to build up the community and keep them invested. Other than the scalability concern, the idea itself can be impactful!", "q0r": 3, "q1": "The budgeting has been broken down but it's still not specific. For example, there's $12000 allocated to the developer team, but it's not clearly stated how many people will this be split between and for how many months. The expertise of the proposers and the developers involved are also not elaborated upon. It would be better to include specific examples or deliverables achieved in the past so as to be better able to convince the Cardano community that the team will be able to see this project to fruition. For these reasons, I'll give 3 stars for the feasibility metric.", "q1r": 3, "q2": "I'll give this two stars for auditability. First of all, there isn't a road map available so members of the Cardano community won't be able to hold the progress to account. Even having projected roadmaps of milestones would be good. It's also not clear which specific stakeholders the proposers will try to reach out to in order to be on track to reach the milestones. Lastly, the budgeting has been broken down but it's still not specific. For example, there's $12000 allocated to the developer team, but it's not clearly stated how many people will this be split between and for how many months. The main reason for giving two stars to auditability would still be the lack of a clear roadmap with expected milestones, so that should be improved upon in the future. There are also no KPIs (for example, numbers of mentors agreed to take part, number of mentees signed up etc)  to measure the progress of the idea along the way.", "q2r": 2, "assessor": "z_assessor_912", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Créer une plateforme permettant une meilleure interaction entre les mentors, les entrepreneurs et les startups pour le Catalyst.", "experience": "Collaboration avec les hubs pour connecter les acteurs de l'écosystème en Afrique. Fortes compétences en matière de réseautage et connexion avec la communauté blokchain en Afrique."}