{"id": 382991, "author": "cole.vt", "title": "Sustainable SPO's Impact & Stories", "url": "https://cardano.ideascale.com/a/dtd/382991-48088", "category": 26246, "amount": 15000, "description": "No hay suficiente participación de la comunidad + intercambio de historias sobre los SPOs en el ecosistema de Cardano a nivel global, que se encuentre en un solo lugar.", "funded": 1, "upvotes": 27484447, "downvotes": 14258478, "votes_result": 13225969, "votes_cast": 108, "f6_no_assessments": 4, "f6_rating": 3.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Un centro que ofrezca una imagen colectiva de las OSP de éxito crea una oportunidad para dar vida a la inspiración en la mente de los espectadores. Dado que el blockchain es un concepto extraño para la mayor parte del planeta, el objetivo de esta propuesta de salvar la brecha de comprensión a través de la narración de historias es sólido y tiene la capacidad de presentar a los potenciales OPVs formas de participación no consideradas anteriormente. Las historias nos conmueven y nos enseñan mucho más que las instrucciones o los planos. Asumir la tarea de contar estas historias tiene el potencial de plantar la semilla de la acción dentro de los futuros OPP, y ayudarles a ver el camino más claramente a través de la experiencia de aquellos que ya han recorrido la distancia. Esto también tiene el potencial de introducir a los OPP en nuevas y significativas relaciones con las partes interesadas de todo tipo. Para lograr el impacto de este reto de forma más directa, el equipo proponente tendría que examinar cuidadosamente las OSP implicadas para asegurarse de que están destacando grupos que cumplen los criterios clave del reto. ¿Están todas las categorías representadas y destacadas como una consideración fundamental? ¿Están bien dispersas por todo el mundo? ¿Están adecuadamente estacionados? ¿Utilizan principalmente energía verde? Si se consigue dar con este enfoque, la idea pasará de ser buena a ser genial.\r\n", "q0r": 4, "q1": "El entusiasmo del equipo proponente queda patente en su diseño. Su experiencia y credenciales combinadas son muy adecuadas para esta tarea. El presupuesto parece poco realista, ya que la producción de vídeos cortos suele rondar los 1000 dólares, y este grupo pretende producir 100 historias con los diferentes ODS... ¿habrá gastos de viaje, equipo, etc.? La comunicación parece un segundo reto importante: ¿cómo se pondrá el equipo en contacto con los equipos y se asegurará de contar con un espectro diverso de OPVs narradores involucrados? Dicho esto, este proyecto es, en última instancia, un trabajo de codos, esfuerzo y resistencia, lo que hace probable que dos personas tan comprometidas con una misión perseveren y resuelvan estos problemas en el camino.", "q1r": 3, "q2": "Este equipo ha hecho un buen trabajo pintando el cuadro de lo que es posible a través de la narración, y la idea es sólida. Es estupendo ver que el proyecto Fund6 sigue adelante. En la propuesta no queda claro si el centro presentará principalmente artículos o vídeos, o ambos, y cómo se determinará. Esto también influirá en el diseño de las redes sociales y el marketing. También serviría de visión a largo plazo entender cómo conectará SustainableADA con los lectores/espectadores a medida que se vayan logrando los contenidos. No cabe duda de que este proyecto es una empresa importante y que tendrá un mayor impacto en su alineación con el reto si consigue una amplia audiencia y llega a los posibles SPO, a los que se anima a participar y a promover la misión. Más allá de alcanzar el objetivo de 100 historias, el grupo podría medir la participación en sus posts/historias, los datos del sitio, la nueva participación de los espectadores que antes no estaban involucrados, las nuevas relaciones desarrolladas, etc. Sería bueno que estos criterios se determinaran desde el principio para poder mostrar la imagen completa del impacto. Esto puede salvar la brecha entre tener historias poderosas e historias poderosas que están moviendo activamente a una comunidad.", "q2r": 3, "assessor": "z_assessor_856", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "El problema presentado es razonable y está dentro del alcance del desafío. La promoción de las OPEs impulsadas por la misión es un aspecto importante de la descentralización de Cardano y esta propuesta está asumiendo ese papel.\n\nEl objetivo de producir contenido para 100 OPEs indica un buen impacto potencial en el desafío, pero me gustaría ver más información sobre el tipo de material a producir. La propuesta menciona el objetivo de producir artículos/vídeos para 100 OSP impulsadas por la misión, pero creo que es importante establecer con más detalle el formato de estos artículos, historias/vídeos.\n\nSe definieron tres métricas relevantes, pero la ausencia de KPIs/objetivos en estos indicadores hace que la evaluación del impacto sea más subjetiva. Recomendaría incluir KPIs con objetivos que indiquen de forma más clara y objetiva lo que podemos esperar como resultado.", "q0r": 4, "q1": "El equipo describió la experiencia y las cualificaciones adecuadas para llevar a cabo la propuesta con éxito. El equipo tiene asociaciones con la AMA y la AIM, que tienen buena reputación en la comunidad por su trabajo en el ecosistema de Cardano. Hay fuentes para comprobar la información.\n\nHay un desglose del presupuesto, pero hay un punto que hace dudar de la viabilidad de la propuesta. Se ha establecido un presupuesto de 100 dólares para la producción de contenidos promocionales para cada SPO, pero no se especifica qué tipo de artículo/vídeo/relato se puede esperar. ¿Hay una estimación de caracteres/palabras por artículo? ¿Hay una estimación de cuántos minutos tendrá cada SPO en vídeo? Sin esta información, es más difícil evaluar la viabilidad del presupuesto destinado a esta producción de contenidos.\n\nMi impresión es que la propuesta se centró mucho en la justificación de los ODS y cubrió poco sobre cómo será la promoción de los ODS, que es el objetivo del desafío, por lo que recomendaría centrarse más en el plan de creación de contenidos.\n\nVarios de los pasos descritos en la hoja de ruta son desarrollos que ya se han completado y aunque es importante ver que el equipo ya está llevando a cabo el trabajo, poco se ha dicho de lo que se entregará como resultado de esta propuesta en la hoja de ruta presentada, por lo que mi recomendación sería centrarse más en el desarrollo que será el resultado de esta propuesta. El objetivo de 250 historias de SPO no está incluido en el presupuesto y no quedó claro si será un desarrollo futuro que necesitará más financiación.", "q1r": 3, "q2": "Hay una clara relación entre el problema, la solución y el reto, hay una buena alineación y la propuesta aborda bien el objetivo del reto.\n\nEl objetivo de 100 historias parece una buena forma de comprobar la auditabilidad, al igual que las tres métricas descritas, pero yo recomendaría incluir KPI con objetivos, que pueden comprobar más objetivamente el rendimiento de las historias.\n\nNo hay claridad sobre el tipo de material que se producirá para los SPO, recomendaría que se estableciera más claramente. Hay un plazo definido para la entrega de las historias, sin embargo, la hoja de ruta no contiene suficiente información relacionada con los entregables/hitos relacionados con esta propuesta (La mayoría de los elementos presentados en la hoja de ruta son anteriores a esta propuesta)", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposer has done a great job by putting up this detailed and interesting proposal. It addressess the challenge and has the potential of adding value to the ecosystem since the comminity will become much aware of the SPO roles, their sustainability and  how relevant they are in adding value to the cardano network.", "q0r": 4, "q1": "The proposer has a great team with the required experience to execute the project. The proposer has provided enough links that point to team members and their experiences which i think is applaudable. The budget is on point and reasonable to guarantee success.", "q1r": 4, "q2": "The proposer has stated the KPI's, a roadmap and has also described how success will look like when the project is executed. This i think is commendable.", "q2r": 4, "assessor": "z_assessor_799", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The Proposer wants to increase community participation through story sharing from successful SPOs. Their success stories when told within the community will encourage more participation and drive SPOs an stakeholders globally. Very laudable project recommended. The challenge is well addressed. ", "q0r": 5, "q1": "The team is made up of Educators, Economists, NGOs, sustainability experts, video editing experts, writing, Figma, Canva and AdobeCC experts who are capable of delivering. Their plan is detailed and comprehensible, such as, being specific in producing a story / video for \n100sustainable SPOs about their connection with Cardano blockchain and sustainability. They plan to have an article / interview with the major alliances and their members and work their way through the SPO list once funded. With their credentials and plan, the project can successfully be implemented. ", "q1r": 5, "q2": "They mentioned that they will share updates on the project through social media channels like twitter, linkedin, etc for easy auditing. The KPIs are clearly outlined as masuring the amount of community funds in ADA staked to projects, the number of verified unique hosting, etc. Measuring success based on a strongly motivated team willing to reach out to a minimum of 100 SPOs ; the budget breakdown is comprehensive and the timeline of 12 months broken down is also clear for easy auditing. Good proposal recommended.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}], "solution": "Facilitar el aumento de la participación significativa con y de las OSP impulsadas por la misión y las partes interesadas a nivel mundial.", "experience": "Educadores, Economía, Sostenibilidad, Humanidades, Ciencias Sociales, ONGs, Emprendedores Sociales, Escritores, Edición de Vídeo, Figma, Canva,AdobeCC"}