{"id": 383433, "author": "felixweber", "title": "Mission& Vision driven SPO Networks", "url": "https://cardano.ideascale.com/a/dtd/383433-48088", "category": 26246, "amount": 10500, "description": "Los fondos creados para apoyar la construcción de la comunidad e infraestructura catalizadora están poco representados en el ecosistema.", "funded": 1, "upvotes": 32072743, "downvotes": 12978015, "votes_result": 19094728, "votes_cast": 157, "f6_no_assessments": 6, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "Se trata de una propuesta apasionante en la medida en que crea una solución al reto rica en experiencias y promete un proyecto posterior cuya aplicación permitirá el crecimiento, la expansión y el aprendizaje en casos futuros. Aborda los objetivos del reto en la medida en que involucra a entidades más pequeñas como OSP y las une en una red de funcionamiento de modo que cada entidad individual pueda capitalizar la experiencia del colectivo y contribuir a ella. Además, estas entidades más pequeñas pueden ser examinadas para ver si cumplen los requisitos (misión, uso de energía verde, experiencia) desde el principio y si se adhieren a las mejores prácticas para crecer dentro de un entorno de OSP en red. Parece que este enfoque de colaboración podría erradicar algunas de las barreras de entrada para las futuras entidades, sobre todo las que están verdes en este campo y las que tienen menos organismos y recursos para lanzarse a la aventura sin una infraestructura comunitaria. La creación de una tesorería específica para la red también muestra un pensamiento a largo plazo en términos de gobernanza y sostenibilidad.", "q0r": 5, "q1": "El muy experimentado equipo proponente ya tiene mucho en marcha, y está desarrollando el primer grupo de OSP con una tesorería desarrollada y gobernada. Existe una mentalidad y un compromiso de base para el desarrollo de una comunidad de apoyo y unidad. Dado que muchas de estas entidades ya están versadas en la crónica del aprendizaje experiencial y en su difusión global, es muy probable que este equipo sea capaz tanto de navegar por el proceso de diseño y unión de la solución de las OSP impulsada por la Misión y la Visión como de reunir un plan integral vivo, que sería un regalo para las futuras organizaciones y un logro clave para atraer a más organizaciones a servir como OSP. El cronograma es minucioso, y el presupuesto muy detallado para la asignación de los fondos solicitados.", "q1r": 5, "q2": "La naturaleza experimental de este proyecto permite, naturalmente, cierta flexibilidad en cuanto a las métricas. La hoja de ruta de 90 días prevé resultados de alto nivel entre enero y marzo. La confianza del equipo en su trabajo y en su visión de esta solución se hace patente en esta propuesta. Dado que esta idea tiene tanto potencial para servir como un poderoso modelo de crecimiento, contribuiría a la solidez de esta propuesta el hecho de que se anticiparan los posibles escollos y se consideraran las soluciones/tácticas dentro de la sección de viabilidad u hoja de ruta. Por ejemplo, reclutar a futuros grupos comunitarios para que participen en la segunda, tercera y cuarta redes puede resultar un reto importante. ¿Cómo se abordaría esta cuestión? ¿Cómo prevé el equipo la comercialización de la oportunidad a aquellos que son nuevos o se sienten intimidados por la perspectiva? Una vez que la red inicial haya tenido éxito y se haya documentado el proceso, ¿cómo prevé el equipo aprovecharla al máximo para construir la comunidad y la infraestructura de Catalyst? Se trata de consideraciones a largo plazo y que tal vez estén fuera del alcance de esta propuesta, pero reflexionar sobre estos posibles retos podría ayudar a formar una carrera inicial más sólida.", "q2r": 4, "assessor": "z_assessor_856", "no_vca": 16, "ne": 9, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal addresses directly the challenge by crating synergies between SPO's and community.", "q0r": 5, "q1": "All information provided, including fully deployed prototype pool network, are easily accessible from the proposals page. The proposal is well edited and well thought through, with easy to follow line of development. The budget for this 3 month operation, is listed in detail and acceptable.\r\n", "q1r": 5, "q2": "The proposer states that, all records of projects, stake pools, delegation, rewards, and treasury disbursements will be tracked and audited. Planned pool network meetings, will be recorded and publicly available.\r\nI strongly agree and rate auditability with the highest score of 5. \r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The idea of SPO community treasuries is a powerful one.  Its easier to see the the connection to rapid funding than to the sustainable operation of stake pools. However in the future this may become more obvious. I think it is important to explore these governance mechanisms. ", "q0r": 4, "q1": "This is basically a proposal for research and documentation on a governance model. The proposers are deeply involved in Catalyst so should have a clear grasp of the task at hand. ", "q1r": 4, "q2": "Some KPIs refer to the Ryuuki project, so there is definitely some overlap here. It may be difficult to separate the two proposals when auditing. The other KPIs refer to the production of documentation and are not very specific as to form, quantity, or dissemination/marketing. ", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to create a network that will document the journey of SPOs from scratch to prominence. They stated that the impact is to help fund community project aside catalyst funding; run an experiment in mutual support and management of a community treasury. The challenge has been addressed effectively as I read the proposal.", "q0r": 4, "q1": "The team is made up of experts engaged in catalyst community project, SPOs, catalyst circle members, funded proposers, community advisors and mentors who will be able to successfully implement the proposal. The detailed plan outlined in the proposal, among others, will launch a prototype network of community stake pools; support the creation and oversight of grassroots treasury; explore and document the concept ; great SPO network that will form and further decentralize the Cardano network. All these facts can lead to a successful implementation of the proposal .", "q1r": 4, "q2": "The road map of the work to be done is clearly stated as from January to March 2022 with details outlined in the proposal. The budget is well broken down and will make auditing very effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal supports the greatest challenge that the Cardano community is facing in the next five years, namely the ability to self-govern and successfully manage the wealth that they together create and share. ", "q0r": 5, "q1": "The proposal is driven by highly experienced and respected community leaders who have dedicated their lives to this mission. While the challenge is enormous, and nobody managed to accomplish it before, these trailblazers are dedicated and willing to experiment and work hard with the engagement of the community to forge a path to a new \"societal operating system\" that supportive of human flourishing.", "q1r": 5, "q2": "Everything will be open sourced and accessible by the community, including in form of an accessible playbook.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Creating a network for SPOs is an innovational idea. It \r\n helps to overcome the disadvantage of large organizations'  pools which is lower level of intention/care for one particular ADA pool (as they have many pools for different coins). Though, it is unclear to me about whether 100% of the SPOs joining the network have to be committed to the Community Network Treasury, or there is a choice for them to not join in the Treasury (meaning that they can autonomically use their rewards while being part of the network). Overall, this idea can be scaled-up to address other challenges in the future.", "q0r": 4, "q1": "Given that a prototype pool network is already up and running, it can be implied that there is a high possibility that this project can be put into action. The proposers have done a great job as the budget plan is clearly stated in the proposal, however, there is a lack of information about the team members. Additionally, given that this project would help fund community projects outside of Catalyst funding rounds, so would this mean that the team have to do a whole assessing stage just like Catalyst do? That point should be put into consideration in order to utilize the effort.", "q1r": 4, "q2": "By using existing tools like Github, it can be easy for outsiders to audit both the project and the network itself. So the proposers have done a good job on assuring clarity.", "q2r": 5, "assessor": "z_assessor_936", "no_vca": 18, "ne": 3, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Crear una red innovadora de OPCs centrados en los catalizadores, trabajar con destacados constructores de catalizadores y documentar su viaje de OPC.", "experience": "Asamblea de Proyectos Comunitarios Catalizadores establecidos y comprometidos, OPS, miembros del Círculo Catalizador, proponentes financiados, asesores comunitarios y mentores"}