{"id": 383959, "author": "jt.aussiegingersnap", "title": "Easy Node Deployment - [Revelar]", "url": "https://cardano.ideascale.com/a/dtd/383959-48088", "category": 26246, "amount": 5000, "description": "Para los nuevos SPO's y desarrolladores, la puesta en marcha de los nodos (no locales) de Cardano lleva demasiado tiempo.", "funded": 2, "upvotes": 84538499, "downvotes": 5352764, "votes_result": 79185735, "votes_cast": 218, "f6_no_assessments": 6, "f6_rating": 4.388888888888888, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem statement is clear and concise, however, this proposal would be a better fit for an Open-source dev ecosystem challenge, as this problem statement is not relevant to how it will support independent SPO's to make the Cardano network globally sustainable. This proposal would be more important for developers who might be building something in Cardano like NFT's etc. The proposals goals would certainly add much more value to the Cardano ecosystem but the successful implementation of the proposal would not align with the goals of the current challenge.", "q0r": 2, "q1": "The proposal has a detailed description of the proposer's skill sets and relevant experience for the implementation of the proposal.  Proposer's team looks to be having enough manpower and a skilled team to successfully implement the proposal. The budget breakdown is clear and the timeline looks reasonable. Also, the proposal has a weekly plan/roadmap and the required DevOps engineer for the implementation of the proposal. The execution plan of the proposal is very much clear so including this in an appropriate challenge would have made much more impact on this proposal.", "q1r": 4, "q2": "The proposal contains a clear roadmap that has weekly deliverables, also most importantly since the project is an open-source one, the weekly deliverables of the project can easily be tracked by the community from the Github repo. Would suggest to the proposer to add (in future proposals) KPI's on how the proposal would add more value to the independent SPO community so that the voters can understand the relevance of the proposal to the current challenge.", "q2r": 3, "assessor": "z_assessor_208", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "\r\nThe problem needing to be solved has been identified and articulated namely For new SPO's and developers, spinning up (non-local) Cardano nodes takes too much time.\r\n\r\n\r\n\r\n\r\n\r\n\r\nIt is clear that this proposal falls within the scope of the challenge brief whereby to \r\nCreate a secure & simple node deployment with open source configurations, security practices & monitoring.\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating such a solution\r\n \r\n  Key metrics  would be  number of users, no of wallets, no of fiat transactions, no of ADA transactions.\r\n \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more businesses who use the same solution\r\n\r\nThis project will have a positive impact on Cardano system by enabling small businesses to get on board.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country including payment gateway containing sites. \r\n \r\n\r\n", "q0r": 5, "q1": "\r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  required skills. \r\n  \r\n The links are sufficient. \r\n \r\nI have visited these links  \r\n  \r\n \r\nThe proposers are well experienced and competent to do the project\r\n \r\n The type and number of team members required to implement the proposal is stated.\r\n \r\n \r\nThe team structure is listed and experienced.\r\n \r\n \r\n The budget has been given in detail. \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are described.   \r\n  \r\nThe proposal has technical aspects which have been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   \r\n", "q1r": 5, "q2": " \r\nThere is a roadmap with milestones  \r\n\r\n \r\n There are  Metrics such of number of users, no of wallets, no of transactions, time taken, amount of fees saved, amount of time saved on each transaction.\r\n   \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties.  \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 20, "ne": 5, "ng": 6, "nfo": 9, "vca_o": 1}, {"q0": "Great initiative to create a tool where the creation on a stake pool becomes a breeze. I've seen multiple stake pools not being able to hold their head above the water because of everything that comes with it. By creating a node deployment the development of a stake pool beings a bit non-technical.", "q0r": 4, "q1": "Regarding the project itself, we get what is required. We have a roadmap that explains in detail what is planned. Although 6weeks might be a short amount to set everything up so that it is understandable to a bigger audience. The team behind the proposal is surely qualified for the job. They present all the relevant skills needed for this. What I am wondering is how are you planning the budget? The team consists of 6 people but there is only funding requested for 60h for Developer operations? The proposal states to pay for the cloud service costs but I have a feeling that $5000 is not enough for this proposal?", "q1r": 4, "q2": "The team provides us with all the necessary details to assess the progress of this proposal. We have a worked-out roadmap and a budget breakdown. They also convey that they will do surveys at each 3, 6, 10 months to follow the process of the deployment and evolvement of the developers using the GitHub node. They will provide the updated details on the GitHub page that are provided. Great proposal on something this is needed for global deployment.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have been able to collect a lot of experience on sustainability topics and can hence competently evaluate sutainability criteria in proposals in this category. The proposal matches the challenge well and it is clear the proposer has properly read the challenge and knows their way around the topic. Their proposal has the potential to add quite some value to the Cardano ecosystem, specifically by supporting people with less technical competencies to set up their own stakepools, thus improving the decentralisation aspect of staking.\r\nThus, the proposal clearly articulates how it will add value to the Cardano ecosystem. The key metrics are formulated well and match the challenge setting. The proposal has the potential to help a lot with scaling up staking.", "q0r": 5, "q1": "The proposal shows that the proposers know what they are talking about. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and have a certain pool of talents available. \r\nThe budget is outlined clearly and is reasonable to achieve the set goals.\r\nThe proposal offers a very detailed description of what is going to be done and how and a very detailed, rationable and transparent implementation plan. It describes the resources used.This is a very feasible proposal", "q1r": 5, "q2": " Well-defined metrics are presented that define the success of the proposal. A clear, understandable problem description is supplemented by a detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 4, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposer wants to resolve the issue of spinning up non local ADA nodes taking too much time by creating a simple and safe node deployment making it's configurations, security practices and monitoring open source hence this addresses the challenge", "q0r": 5, "q1": "The proposer and their team have enough knowledge and have required experience to make this proposal a reality. The team has provided a detailed plan and have also given a clear roadmap with timeline. The fund for the proposal seems to be reasonable. based on these data it's very likely this proposal will be implemented successfully ", "q1r": 5, "q2": "The proposal consist of measurable roadmap with timeline and a complete fund allocation.\r\nIt have been very helpful to audit the progress of proposal by providing required KPIs and definition of success for required months. With the given information the progress and success of the proposal can be audited easily", "q2r": 5, "assessor": "z_assessor_937", "no_vca": 24, "ne": 3, "ng": 13, "nfo": 8, "vca_o": 1}, {"q0": "Providing an open source repo with commands that can help developers to quickly spin their cardono nodes would improve adoptability. However, being able to automate the installation and setup process with a script will be much more beneficial to user. If the direction is to automate the installation process. then it's the right thing to do.", "q0r": 4, "q1": "I believe the proposer and his team has the necessary knowledge and skills to implement the proposed project by considering the background", "q1r": 4, "q2": "github folks, stars can be used as an immediate metric to check popularity of the project. Also monitoring  and report back from the user as stated in the proposal can also be very helpful for auditing purpose.  However if an anonymous running log can be incorporated  and sent back to a server(with permission) to be automatically read, interpreted and displayed for stats and auditing purposes.", "q2r": 4, "assessor": "z_assessor_959", "no_vca": 24, "ne": 2, "ng": 16, "nfo": 6, "vca_o": 1}], "solution": "Cree un despliegue de nodos seguro y sencillo con configuraciones de código abierto, prácticas de seguridad y supervisión.", "experience": "Una década como fundador y director de tecnología + Pionero de Plutus + Fondo 6 + junto a un equipo completo de ingenieros. (Ver abajo)"}