{"id": 385157, "author": "johnathan.lopez.a", "title": "SolarPowered Community Staking Pool", "url": "https://cardano.ideascale.com/a/dtd/385157-48088", "category": 26246, "amount": 30000, "description": "El consumo de energía del blockchain. El desarrollo de un Staking Pool sostenible mediante el uso de tecnología de energía renovable para operar el staking pool.", "funded": 0, "upvotes": 19919416, "downvotes": 19771245, "votes_result": 148171, "votes_cast": 140, "f6_no_assessments": 8, "f6_rating": 2.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal doesn't state a clear problem. Whilst PoW is quite energy-wastefull PoS doesn't consume that much energy. On the other hand each effort in this direction is needed and plans to educate about sustainability would help to spread awareness.", "q0r": 3, "q1": "The proposer could provide more information about himself, he could add how exactly he wants to do his education community programm. As of now it seams more like an idee than a product which is ready to go.", "q1r": 2, "q2": "The proposal could be more detailed. There is no clear roadmap, no succes-metrics or clear milestones. Also the is no risk-assessment. Maybe it would help to reasses the proposal and submit it in a new form for the next Fund.", "q2r": 2, "assessor": "z_assessor_41", "no_vca": 20, "ne": 1, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "The development of a sustainable Staking Pool by using renewable power technology to operate a staking pool is a great idea. The proposal clearly states the problem and offers a solution. This idea has a positive impact on the Cardano ecosystem. It would be good to elaborate in more detail how this idea would add value to the Cardano ecosystem. The proposal does not list KPIs so it is impossible to compare them with the ones indicated in the challenge. The proposal is not able to scale and address future challenges due to lack of data.\r\n\r\n", "q0r": 3, "q1": "It would be good to have information about the team and the work done so far as some work experience. The proposal does not provide information on how many people will work on this project and whether team members have the necessary skills, knowledge and experience to implement this idea. It would be good to show transparently who is behind this idea. The budget is presented but not broke down into identifiable items. As we do not have a clear insight into what the money will be distributed, the requested amount is not reasonable. This is a great idea but it would be good to detail the implementable plan and work out the details of actionable tasks and order execution. It would be good to develop and present a realistic timetable to complete the work and what resources are needed together with the technical aspects for the implementation of the project itself. It is good to keep in mind the idea of possible risks because what if the risks overshadow the project itself?", "q1r": 1, "q2": "In proposal we do not find the necessary information about the roadmap with milestones and a time horizon for achievement. KPIs are also missing and should be developed and presented. The community, although this is a great idea, cannot in any way track the progress and development of the idea itself.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 17, "ne": 4, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "I think this is a great proposal and it definitely meets the challenge of growing the Cardano community in one of the most important digital asset territories in the modern world. I'm currently on the island Anguilla which isn't too far from Puerto Rico and I too have considered decentralized education as a means of growing awareness and usage of the Cardano blockchain on the island. ", "q0r": 5, "q1": "The team seems to be experienced in regards to their focus and I am of the opinion that they will be successful. Setting up a stake pool which can be done as a introduction to this level of tech for those who were unaware but fortunate to become involved will only spark more interest in the concept of Cardano stake pools in a region that has lots of sunshine and internet to facilitate effective and efficient operation for years to come. ", "q1r": 5, "q2": "The requested amount of 30,000 usd should be enough to get the initiative started and I think the outline proposed is auditable. I would imagine that one the systems are set up, the developer maintenance or rather stake pool operators actions and outcomes every epoch will be auditable on the Cardano Blockchain. If any foul play are bad intents are recognized proper actions can be taken. I would like to see an active auditing body for the funded catalyst proposals. ", "q2r": 4, "assessor": "z_assessor_676", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The proposal correctly identifies a problem within the challenge as well  stating how it will ad value to the ecosystem. It would be good to show how The stake pool will bring in stake and then clearly return the rewards to the community as this is not mentioned.", "q0r": 4, "q1": "The Proposer seems to have the requisite experience required however the link to his github lacks sufficient data to validate this. There needs to be a breakdown of budget to where these funds will be allocated. Are they towards solar panels or setting up the stake pool itself?", "q1r": 2, "q2": "Whilst the project mentions some great long term goals there is no clear roadmap to said goals. It would be great to see KPIs listed in future proposals so that there is a clear auditable path.", "q2r": 2, "assessor": "z_assessor_745", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The problem statement is not really related to Cardano Staking Pool community. However, it stated the problem from POW Bitcoin mining as a comparion. The Solution is very at a surface \"using renewable power technology\" but not mention the concrete solution for the easily-stated problem", "q0r": 2, "q1": "Team is very briefly described with almost no declaration about team members and only have 1 website in github. The github was also not freqquently updated. With this team and the activities, it is doubtfullly that the project team/or single member can deliver the solution ", "q1r": 1, "q2": "The project has no clear KPI just a definition of success for 3,6 and 12 months after the launch date (which no definite launch date.) Instead with all of that the requested fund is up to 30000$ ", "q2r": 1, "assessor": "z_assessor_782", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The idea of using renewable energy to operate Staking Pools is great. Yet, this proposal's key metrics and goals do not align well with the challenge's objective (which focuses on  SPOs). Also, it would be nice for the proposers to give more details on how they will education the community and build sustainable projects. Along with that, I think an informative tool/platform is needed for ADA holders to approach the goodness of SPOs that are involved in the project.", "q0r": 2, "q1": "The proposal is lack of evidence to prove that the writer is deeply aware of the resources they have/need and the experience they have in the field in order to implement the project. Merely stating the budget ($30.000) without outlining or breaking it down makes it hard for readers to determine if it is a reasonable number. Besides, a timetable should probably be included.", "q1r": 2, "q2": "I recommend adding a roadmap and KPIs to the proposal so that we all can audit the progress and the success of the proposal. ", "q2r": 2, "assessor": "z_assessor_936", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "using renewable source of energy mainly solar to reduce the block chain power consumption,\r\ndeveloping sustainable Staking Pool by using renewable power technology to operate staking pool,  proposal effectively addresses the challenge.", "q0r": 5, "q1": "with help of using renewable energy,\r\nusing it for  development of sustainable technologies to operate Staking Pools by using renewable power technology to ensure security and scalability,\r\nthey have enough Professor, SJU CodeClub Instructor,  DataAnalyst/Developer,\r\nwith given xperience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has provided sufficient information on how to use Education community program. To empowerment of the community by the education in Sustainability, Food Security, Food sovereign, and STEM. Decentralization, security, and scalability,\r\nHave provided detail plan for 3-6-12 months plan,\r\nThe proposer has provided sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 35, "ne": 3, "ng": 18, "nfo": 14, "vca_o": 1}, {"q0": "This proposal addresses the challenge from the point of view by promoting smaller SPOs and stakepools using green energy. One could argue that it supports decentralisation too, since the SPO would be located in Puerto Rico and it would not running on one of the larger data centres.  \r\nHowever, the current description is very brief and more details are needed on several aspects to enable a proper assessment. \r\nI would recommend to clarify at least the following aspects of the description: \r\n1. Under 'describe your solution', it says development of sustainable technologies. I assume that the proposal is to design a power supply that is based on renewable technologies. Can you describe which technologies that you have in mind, and how you plan to bridge the periods when not enough solar PV electricity is produced? (e.g. electrical grid, battery) \r\n2. Change the discussion under Detailed plan from Bitcoin POW to Cardano POS (Proof Of Stake). Cardano is about 1000 times more energy efficient than the POW of Bitcoin. It would be better to frame the discussion about the Cardano stakepool technology.\r\n3. The education community program has very broad scope (e.g. food security/soverign) and the link is not clear to the stakepool operation with renewable energy. Can you explain this further? My proposal would be to focus on designing a renewable power supply for your stakepool as a first step. The other apsects could possible be addressed in later funding rounds.\r\n4. Make a breakdown on the funding needs (cost for salaries, equipment etc).\r\n5. Prepare a timeline for project implementation.  ", "q0r": 3, "q1": "Very limited information is provided. So please add more information about the background of the team members. \r\nThe proposal does not contain a plan on how the project will be implemented, see my comment above. Afterwards, we can make a judgement on how likely it is the the project will be implemented successfully. ", "q1r": 1, "q2": "No, not at this stage. The content of the project and its plan still lacks many details, e.g. project plan, the exact content of the project. \r\nThe project proposer need to complement the proposal with missing information for a positive opinion.", "q2r": 1, "assessor": "z_assessor_997", "no_vca": 34, "ne": 10, "ng": 23, "nfo": 1, "vca_o": 1}], "solution": "El desarrollo de tecnologías sostenibles para el funcionamiento de los Pools de Estacas mediante el uso de tecnología de energía renovable para garantizar la seguridad y la escalabilidad.", "experience": "Profesor de Estadística\nInstructor de SJU CodeClub\nPuerto Rico, Caribe\nAnalista de Datos/Desarrollador (R, JavaScript)"}