{"id": 381358, "author": "jaggerbellagarda", "title": "Verifiable NFT-based resumes/CV", "url": "https://cardano.ideascale.com/a/dtd/381358-48088", "category": 26240, "amount": 25000, "description": "The current verification of work experience and job-related documents can be a costly and time-consuming process.", "funded": 1, "upvotes": 39254036, "downvotes": 6328784, "votes_result": 32925252, "votes_cast": 174, "f6_no_assessments": 6, "f6_rating": 3.9444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal idea is quite unique and i believe similar to the IOHK product Atala Prism, but with NFT use case. \r\n\r\nAs myself coming from third world country and being a senior developer myself , i have first hand witnesses the forgery and fake documentation/degree certificates being produced by the people. The source of this forgery usually does not occur from the university but rather in open market, as there is currently verifying these documents authenticity is in itself a high cost endeavour for the companies OR higher education institutions from other countries.\r\n\r\nTherefore, i strongly agree that this proposal addresses a very unique problem in the open world out there and provides a very nice NFT based dapp solution to this problem.", "q0r": 5, "q1": "The experience of the team is presented well with the links to their linked in profiles. As a developer myself, i notice that the tech stack is already chosen and the team experience is in align with the tech stack they have chosen for Front end, backend and blockchain development. \r\n\r\nFrom experience point of view, i think plutus knowledge is missing out and i would have given full points if the blockchain developer also mentioned his involvement (PPP enrolment/successful completion) in Cardano ecosystem.\r\n\r\nFrom plan perspective, i feel it is very well written and budget and costs are reduced to fulfil the F8 budget goals. This budget, however, in my opinion could have been split further, rather than giving up a big $20k number, for instance : how many developers will work, what is their rate per hour/month, and how this number of 20k was reached ? \r\n\r\nThe plan, however, is very well outlined. The solution approach clearly mentions the goals and scope of the solution, along with the technical approach. it is great to see that team has already thought through the high level feature sets and how they will approach the implementation of this proposal. \r\n\r\nOverall, therefore, i agree that  it is likely this proposal will be implemented successfully", "q1r": 4, "q2": "The plan presented here is quite elaborative. The 1-3 and 4-9 months time frame that is given is also divided further into Tasks, and each task set is well split into feature sets.\r\n\r\nThis is very good as community can closely track the progress in week by week basis. I see that this is some how in align with agile methodology, and I hope that team follow Agile to include community feedback while they are working on the proposal.\r\n\r\nThe overall project goals gives good sense of what success looks like and where eventually the smaller time frames features are taking us in terms of bigger picture. Therefore, i strongly agree that the information provided is sufficient to audit the progress and success of this proposal.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposers wish to introduce verifiable work-related documents and experience presented as an NFT. This identifies a problem in the challenge setting, solved by the development of a dapp so the proposal matches the challenge. The authors clearly state the many ways they're going to add value to the cardano ecosystem, mostly through verifiable, decentralized information that ca not be tampered with. I can take the reaching of the set goals by weeks as the Key Performance Indicator, which seems fair enough considering no other metrics were provided. As a developer I see no issues for the project to scale with it's growing environment, and I like the initiative they've taken to already speak to potential partners in the face of some institutions.  This solution will add to the ecosystem and especially if many people start using this way of authenticating credentials, there would less document fraud and other commonly occuring problems in the hiring scene. I have no concerns about this proposal. Good luck to the team, I will you well!", "q0r": 5, "q1": "The proposers give links and an explicit reference to their names and skills which I managed to verify with a bit of googling. From the looks of it, this project has involved a considerable team to work on it, and the type and number of team members is already set. The budget is outlined clearly and it seems reasonable for the work that needs to be put in for the project to succeed. The timeframe set for all the work seems realistic. There's a very concrete plan for all of the implementation which as a developer I can appreciate. The technologies that are going to be used are all listed and seem legit for the task at hand. There are enough resources for the proposers to successfully build their project from the ground up, but I would suggest to look arround for other open-source projects and what they have done to minimize the common work necessary.  There are some risks and challenges mentioned as well as possible solutions to some of the hurdles in the way.  Overall seems like a feasable project with good team standing behind it with their names and titles.", "q1r": 5, "q2": "I love the fact the team has planned for podcasts and a social media presence, but I would have liked them to have a discord channel or some other way to let their voters and community members know how is the development and progress of the project going. The metrics and KPIs are really detailed, which is rare. One thing I liked is the team has a great definition of success which seems realistic to me as a developer. The roadmap with milestones for the technical and non-technical implementation is logical and sequential. There's a clear description of the targeted problem with authenticating a persons work experience and a clear description of the solution, that was very well thought out.  I really like the proposers have looked through the eyes of theur future users and see what they would expect of their platform and have a plan to deliver it. Overall I think the project can be more easily tracable if the team has a way to get continuous feedback from the community as well as letting the community know the progress.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Consider this proposal of high value, because it seeks to facilitate the process of verifying a work and study history, in order to make it cheaper and also to avoid fraud. Labor verification is, in fact, a bureaucratic and expensive process, and I have already seen another proposal that addressed this issue, proving its need to be portrayed. If this process is done through the generation of NFT, registered in the Cardano blockchain, it can greatly benefit our community and facilitate the process of hiring people both for the candidates themselves and for the companies. The authors argue well about the advantages of doing this verification process through our blockchain, relying on the permanence and immutability (as he says) of the technology to obtain the desired results. They are also concerned with making clear what the gains are for each part of the public: people, academic institutions and companies. So, I believe so, this project is directly aiming to generate high value apps for our beneficiary ecosystem.", "q0r": 5, "q1": "I found it impressive how the team details exactly how would be the use of each type of user in the application, which bought that they have total technical knowledge and planning in relation to the contents present here. The outline of a script is also exemplary, that is, we know 1) when it would happen 2) who would make it happen 3) what would happen. That said, there's not much to question, other than as much detail as possible is always good, we could find out more about what would happen, for example, more divisions of task blocks. The team is also concerned with detailing how it intends to expand the tool's reach, which is, again, positive, because it shows that they are aware of the importance of this part of the proposal. Regarding the financial division, I thought that this part was superficial, the amount asked for in the financing is very high, which requires a very good explanation of why such an amount is needed. Although there is a breakdown of costs by parts, it is shallow. And finally, about the team involved, we have details of who they are in an individual way, this is essential to convey confidence and with such explanations a lot of confidence is conveyed that they are capable of successfully executing the project. It is very positive how they even attach linkedin profiles, giving us the possibility of getting to know them even more than the details in the proposal. I would only improve on the financing part of the explanation.", "q1r": 4, "q2": "The project roadmap is very detailed, so we have the material we need to monitor the progress of things. The author also establishes in a specific topic what the project's objectives and solutions would be, which says a lot about auditability, but this part could be more detailed. I wish the team had put as much emphasis on this part as they did on the script, for example. What is needed here is to establish a bridge between the team and the community. How would these partial results be presented? We need a solid way to monitor project execution, because, despite not being as multidisciplinary (I say this because in certain proposals there are so many areas of knowledge involved that we may even get a little lost on how to monitor auditability), it still does. be a complex idea. It would be important for the team to periodically present feedback on the project to the community, for example, this could be done monthly. So I think there are some things to review when it comes to auditability.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "A problem and a solution to the problem have been identified, and the idea has some potential but its usability, as it is presented, seems to get stuck in the early stage of the project and I will explain it in the next section why I think so.\r\n\r\nSome key metrics are defined and are outlined with the challenge objectives but more are needed to evaluate the impact of this project to the community and to the Cardano ecosystem", "q0r": 3, "q1": "The project aims to create a system where people can store info about their studies and work experience, info that will be endorsed by relevant third parties, and will be frozen on the blockchain as a Proof-of-Trustworthy, in a form of NFT, for further reference.\r\n\r\nWhen creating and making public a CV the person who is looking for a job is having in mind at least of couple of directions to follow: 1. to get the attention of the potential employer and (if necessary) 2. to hide his intention, in most of the cases, of leaving the actual employer.. Starting from this points some major drawbacks are at the horizon. A job offer is based on a series of requirements, and thus giving the possibility of each potential candidate to adapt his/her resume to meet those requirements and not being filtered out. They don't have to lie, just to make the resume more attractive. Saying this, why people would like to take snapshots of their resume that wont match in some aspects over time?\r\n\r\nSecond issue, regarding the request to the employer to endorse the working experience of an employee who is leaving, who would want to be so nice and do this freely knowing that the company will lose an (valuable) asset?\r\n\r\nReworking this proposal and finding a viable usability for the project ma give a better chance for a successful implementation.\r\n\r\nAccording to the LinkedIn profiles posted as reference for the team members it looks they don't have the necessary experience to help them implement the project. Additional relevant references are required to get the better result of the assessment.\r\n\r\n", "q1r": 2, "q2": "The proposer is not aware of any challenges and risks relevant to a successful implementation.\r\n\r\nBased of the info provided, even the idea has potential, it seems unlikely for the project to succeed.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 20, "ne": 2, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The proposal presents an excellent and innovative use case for NFTs to solve real-world issues. The technical challenges are negotiable and the author is rightly approaching the adoption problem by aiming to onboard one university which can bring about a cascading impact on the whole ecosystem. Overall the proposal is effectively addressing a core challenge. ", "q0r": 5, "q1": "The proposer has carried out research in this new area which could solve old problems and has come up with a workable plan. The has a detailed breakdown and does not seem to have major technical risks. There is a very high chance that the project will be implemented successfully.", "q1r": 5, "q2": "The project has a clear roadmap and task analysis. The steps are well-defined and achievable. The aim to get one university to sign up is a healthy idea to try out the project. Considering these parameters it is felt that the proposal is auditable. \r\n", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 2, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The idea of using NFT minting as proof of academic and work achievement is very good. There are several proposals in this fund with a similar angle in different categories, but this one expresses the problem and potential solution in a very coherent and logical way and with a credible roadmap. I am worried about this technology to reside in a startup with so many experienced team members without specifying the fee it will charge users for their service after successful completion. This looks like an attempt to get R&D funded by Project Catalyst while retaining the IP and future revenue from potential success.", "q0r": 2, "q1": "The proposer is already known to the Cardano community and the team is experienced and skilled to carry out the proposal. I doubt that the $25K or a MVP using 1 company and 1 academic institution will be indicative of the success or possible flaws of the implementation.", "q1r": 3, "q2": "The proposal uses repetitive wording and lengthy lists to create an illusion of thorough analysis without explaining how this proposal is different from its many competitors, how institutions can be onboarded and what the risks are. To me, the most worrying flaw of the proposal is the lack of separation between startup and Catalyst proposal, or how this proposal's benefits are unique to Cardano.", "q2r": 3, "assessor": "z_assessor_692", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "The ability to verify the authenticity of work-related documents (i.e., Degrees) and work experience as Non-fungible Tokens (NFTs).", "experience": "The team consists of 5 individuals - business development, technical architecture, scrum master, mobile expert and a blockchain developer."}