{"id": 382035, "author": "jcaso", "title": "C64 Extension Wallet", "url": "https://cardano.ideascale.com/a/dtd/382035-48088", "category": 26240, "amount": 19660, "description": "Wallet extension that provides a sovereign, customized experience for users and devs by supporting P2P, NFT, Identity, Voting as plugins.", "funded": 1, "upvotes": 77413110, "downvotes": 12201552, "votes_result": 65211558, "votes_cast": 387, "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "I've been a community advisor since Fund 2 and a vCA ever since I remember (OK, not really, from Fund 3 to be precise). I've also acted as a proposer in some Challenge Setting funds (I'm old enough to remember when they were called Community Choice - yes, the name sucked). But, I'm getting carried away. This proposal is practical for the end user. It aims to develop a community cross-browser light wallet with a popup format that supports switching networks (Testnet - Mainnet - Yeah!!] and unifying all of them within the same tool from the same account. What makes it even better is that users will be able to choose their own trusted endpoints. The cross-browser light wallet could have a great impact if it is successful - especially as Cardano users are increasingly frustrated with using a full node wallet (yes, we are looking at you Daedalus!). The idea of using a progressive modular extension wallet that facilitates the addition of new use cases in the form of plugins (did anyone say P2P, NFT, Identity, voting etc..?) is great and very impactful. If you a voter and haven't checked out https://c64.app/ (the C64 wallet site) do it. I didn't even know it existed. This is decentralization. More wallets, more approaches, more resilience. All stakeholders benefit. ", "q0r": 5, "q1": "The project has a very competent team behind it. It includes an ex-Emurgo DevOps lead. Gimbalabs co-founder, a full-stack Developer, Cardano ambassador, SPO, and an ex-Emurgo Yoroi-mobile, R&D Engineer advisor... The team consists of three members who clearly have the technical knowledge to deliver the result. I am often worried about some proposals - that may die a slow (or fast) death after delivery, but what is really encouraging about the feasibility and enduring growth of this project is that the team has already fleshed out Future features that they intend to build and add with future funding from Catalyst (in future rounds). The C64 wallet seems to be an idea with great growth potential - as recognized by the proposing team. They included a realistic timeline broken down into three key stages for completion, while the budget has been fleshed out into components - allowing for a more detailed scrutiny of work. The proposers have included and expounded on key explains technical components that they will rely on - and I love that it will be cross-browser Chrome, Brave, Edge and Firefox (tentative). The idea to include demos in the proposal was excellent, plus thanks for including Linkedin profiles. \r\n\r\n\r\n", "q1r": 5, "q2": "The proposing team has a clear vision of what they wish to deliver and a clear pathway to deliver it. They included a clear an understandable eplanation of what they want to achieve and their proposed solution is rational and makes a lot of sense. The team included a 6-month timeline with 14 KPIs that they want to use for auditing and development. The development has been divided into three large phases and with the detailed budget breakdown - it will be easy to audit. This is an example of a clear and well presented proposal. ", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The proposer wants to build an extension wallet and it's functionality be expanded with plugins. So depending on what you need, you can extend your wallet with. It's a very interesting and intuitive proposal which fites the challenge setting. I also like the proposer has made efforts to lower the cost of this proposal by means of combining effort between fund 5 proposal and the current one. There's an implicit value brought to the ecosystem if this proposal is funded and implemented, but judging by the previous record of this proposer, I'm not worried. There will be reported KPIs each two weeks as it has been done up to this moment. Impact is always connected to scaling a solution, and for this one I don't have any worry that the team would be able to face the described challenges. There are great many efforts put in to the solution of this project and it shows as there aren't any wholes in the proposal. This project would benefit the community and the ecosystem significantly if implemented as described, but I believe it will be even more beneficial if it's a colaboration between a few projects with the same ideas. As a dev I don't have any concerns about the implementation of the proposal.", "q0r": 5, "q1": "The proposer has added the linkedin profiles of the team members, which says two things. 1. The proposers are ready to back their project up with their names. 2. This enables the verification of the stated skills listed in the proposal. 3. (bonus) brings credability to the project. The number of type of team members have obviously been discussed and are present in the proposal. The budget is handled beautifuly, there's an option presented by the proposers, to use the funds from previous funding in a more optimal manner iis proposal gets funded as well, and I'm amazed at how clearly the project tasks are grouped up if that happens. There's a realistic timetable to do all the stated necessary work. The project defines how will it be executed and what implementation will be used.  There's a large description of the future items that need to be supported which make sense like (trezor support, staking and otheres). There are some challenges and risks considered in the proposal. Another thing I really liked is the list of demos, but I'll touch on that in the auditability section. I'm not sure if the project is in sync with other simmilar proposals that want to build separate plugins by the presented standad and be able to implement with each other on a modular level, and my suggestion as a developer would be to take a look around simmilar proposals and see if they can't colaborate on some features and plugins. Overall a great proposal with a lot of potential in it. \r\n", "q1r": 5, "q2": "Not worried about tracability of the project, since the proposer has prooven to give 2 week updates on the progress of the solution. What I would recommend is to have a discord or telegram chanel to get feedback directly from the community if necessary, but that's not in any way mandatory. I really like the long list of KPIs mentioned in the text of the proposal. They bring validity to the effort being done because they are so relevant to the projects success. The roadmap and milestones are present as well and will be visible to the community that want to follow through. I see a clear definition of a problem and a really technical and deep understanding of the proposed solution.   I wish good luck in the voting phase to the author. It's a good proposal!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "There is a need for lite wallets to provide more options to end users and developers for experimentation. The proposal will also provide Cardano Backend tools for the community to use and will decrease the dependency on a single entity for providing backend for lite wallets. ", "q0r": 4, "q1": "The team C64 which is proposing this project was funded for a desktop wallet which can mint NFTs. The same team is proposing to create a cross browser wallet in Typescript which is considered better for security than the javascript. The team also proposes hosting of Cardano Backend suites for the lite wallets. Based on the experience and the demonstrated capability it is likely that the team will be able to complete the project successfully. ", "q1r": 5, "q2": "The proposal is detailed with clear risk analysis. The dcSparks connector has been released and is successful therefore the proposal should not be facing any technical blocks. The proposal has a clear roadmap and it is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This is one of the Cardano wallets that was funded in fund 5 and they still keep developing that proposal. This proposal is an additional part that I think they need to do for more convenience to end-users, increase the user experience is what can increase the results of their KPIs that include both in the old one and this proposal. Therefore, this small project will help the whole bigger project better impact on Cardano ecosystem ", "q0r": 5, "q1": "As I mention, this proposal is an expanding fund for developing their browser extensions, which means that they're running this project and have some results on it. We can check the product through the main website of the project. \r\nAnd the team filled this proposal with the whole project implementation plan that all is clear. Therefore, I absolutely believe that they're doing well and will make this proposal good as they did with the other parts of the project. ", "q1r": 5, "q2": "Info in the proposal is completely enough to help auditing works in this scope of the proposal. They pointed the specific outline in the general roadmap that relates to this proposal clearly and all make sense. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 20, "ne": 1, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "It's great idea to build an extension wallet by adopting the Connector standard from dcSpark for interaction with dapps and Defi services which increases users and devs' experience and the Cardano applicability. Also, this dapps helps Cardano to communicate with other blockchains. The proposer shows a clear roadmap and solutions to build the wallet. This project will definitely help the growth of Cardano community. ", "q0r": 4, "q1": "The proposal has qualified team with experience in developing Cardano, Ermugo and Ardana project which make me believe in the success of implementing this project. The team has a deep understanding of Cardano and their project. They give a clear road map and detailed KPI. Also, I find the requested fund is suitable for their proposal at this stage. ", "q1r": 4, "q2": "It's easy to audit this project as every information related to the implementation of the proposal is clearly stated. They give a detailed timeline for the roadmap,KPI which can be checked on their website and github source. The proposal also gives evidence behind the team backgroud as they are well-known in Cardano community which make this proposal gain more trust. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Design and implement a progressive modular extension wallet that facilitates the addition of new use cases in the form of plugins.", "experience": "The team has wide professional experience as full stack developer, real-time processing, mobile applications, sys admin, devOps, and SPOs."}