{"id": 382294, "author": "torres", "title": "Vertra: tokenized properties market", "url": "https://cardano.ideascale.com/a/dtd/382294-48088", "category": 26240, "amount": 60000, "description": "How to increase the liquidity of the real estate market through tokenization and create a new form of financing through blockchain.", "funded": 0, "upvotes": 15812993, "downvotes": 16038537, "votes_result": 225544, "votes_cast": 147, "f6_no_assessments": 4, "f6_rating": 2.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is addressing the challenge of what applications will provide the most value for end users in 2022. It addresses this by looking into how to increase liquidity of the real estate market through tokenization. This problem statement could start to become pertinent within 2022 as there is a huge need for housing and need to finance it, by enabling tokenisation it makes it more accessible to a wider audience.  Examples of this solution have been described as token holders have access to dividends and tenants to a rent to own model, these examples provide clarity as to how the proposer will overcome the problem statement. \r\n\r\nVentra's proposed practical solution implemented in Cardano would benefit the Cardano and Catalyst ecosystem and community making it more attractive to new comers and existing token holders. Their white-paper states that there isn't a public market for selling and buying real estate markets only private ones, by making a public and secure market the proposal in effect democratising retail finance and cutting out the middle men that often create a barrier to entry for a newcomer into a housing market. On the flipside for the investor in property will have access to a wider housing market which won't limit them to markets within their own geographic locality. \r\n\r\nThey have measured a successful outcome by marking completed stages on their roadmap, currently they are at stage 2 and outline the start of stage 3 in Q2 of 2022. There propsal could benifit from more indicators of what success looks like, such as the number of users onboarded, tokens purchased, more granular development milestones reached and volume of Ada transacted. \r\n\r\nIt appears that there has been some consideration into scaling the platform that has been outlined in the white paper. Using cloud infrastructure on AWS means from a technical standpoint infrastructure and server usage can easily scale up. Combining the front end with NextJS the front end user experience should be fast. However the white paper also mentions that Elasticsearch will be used as a database, the usual standard is to have dedicated database and simply use Elastic as a search index and have a dedicated NoSQL database such as MongoDB. It would be good if this choice had further justification behind the technologies, it's good these have been consider technology choice but would benefit from further justification. Scaling has also been considered in-terms of the economics of the token, a good example of this is fractionalization, which allows smaller-scaler investors to participate, allowing them to own marginal parts of assets. If the platform wishes to scale to a larger user-base then enabling smaller participants with fractionalization is essential. \r\n\r\n", "q0r": 4, "q1": "Vertra have wealth of experience in the retail marketplace and are well placed to understand how this tokenized property markets will work. However there appears to be a lack of technical expertise displayed in the proposal and who might be the team members who have the engineering skills to pull this proposal off. \r\n\r\nA linkedIn post it appears Vertra are partnering with other real-estate agents to develop there web presences demonstrating some good ability to develop websites, however the skillset required goes beyond this and to create a token skills such as Plutus, Marlow and Haskell would be needed. In another LinkedIn post Vertra mention they have had no technical knowledge and have since acquired that experience within the company which is a good sign that they have the capacity to learn.  On balance the proposal would benefit from demonstrating those technical skills by adding links to Github profiles or LinkedIn profiles of technical employees, or those who would be leading the project from that stand point. It's unclear whether the proposer knows what team members are required to fulfill the proposal as this isn't outlined in the plan. If they were to outsource technical knowledge the proposal should outline how this will be achieved. \r\n\r\nThe proposal funds have been allocated to smart contract development of Vertra's road map. It builds confidence to see this aligned in the broader picture and that stages 0-2 have already been completed. Each identifiable item such has been allocated a breakdown of the total requested funds, such a smart contracts development has been allocated $12,000 which appears to be a fair amount. However a justification as to why smart contract development costs $12,000 ought to be given, for example $12,000 is a Plutus devs time for over a 4 month period.\r\n\r\nThe whitepaper provides a \r\n\r\n\r\n\r\n", "q1r": 3, "q2": "The proposal presents a reasonable amount of audibility that the public can measure performance against. For example as Vertra are launching a smart contract and a tokenized property things such as Ada transacted through the chain can be analysed externally. However the proposal itself does not identify this a measure of success. \r\n\r\nEach stage of the program is marked against an item in the roadmap which has a date. This part of the project has marked a deadline for each milestone of the roadmap enabling to verify if the project has met its deadlines in time. The proposal does not explicitly define how the community can keep up to date with the project, whether that be social media, email or other comms channels. One would assume that they would be updated if they're an existing user of the vertraimoveis.com website, and the proposal should identify how this is done. ", "q2r": 4, "assessor": "z_assessor_332", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies a real problem which is the lack of liquidity of real estate. The idea of tokenizing real estate through integration with blockchain would be revolutionary and would off course add immense value to Cardano. There is off course many challenges with this idea which are not fully explored in the proposal.", "q0r": 4, "q1": "I'm Portuguese and i read through the vertraimoveis.com website as well as their Facebook page and found no reference to this proposal, the whitepaper or anything to do with tokens. There's also no information on the identity of the team or their experience. These facts by themselves already cast immense doubt on the proposal. A number of concepts are introduced throughout the proposal such as the \"Rent to own\" and others which represent the \"What\" you would like to achieve but not much information on the \"How\" to achieve it. This proposal presents some considerable technical and legal challenges but these are not explored in the proposal. In essence this still reads more like a concept then a executable proposal. Integrating the blockchain with your platform and developing the required smart contracts by Q2 of 2022 seems very optimistic. There's a simple budget breakdown presented, but it requires more detail i.e. what will the 12k for \"Smart contracts development\" be used for ? how many hours of development are required ? And for \"Marketing for the marketplace\", where will be marketing be done ? and will this be for your whole platform or just the tokenized properties ? ", "q1r": 1, "q2": "A roadmap is presented, but it includes stages prior to this proposal that are not relevant (stage 0 to 2). The milestones are also very broad e.g. the development of smart contracts and integration with your platform could be broken down into more tangible milestones as this is the critical step of the proposal. There also no KPI's presented. A simple KPI could be increase in user base 3 months after launch of token or amount of capital locked in tokens 3 months from launch.", "q2r": 2, "assessor": "z_assessor_125", "no_vca": 27, "ne": 10, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "There will be a lot more advantages when bringing real estate to the blockchain network as the team is aware of in the proposal. And I think that's the reason why they list out some important points that their idea can deeply solve the problem in real estate. But I think the team should provide some goals, key metrics to their proposal to help assess whether their ways of development suit or not with this challenge. For this project, it can be the numbers of properties listed in their platform, total value in the market, or can be the number of active users of both buyer and seller... \r\nBesides the key metrics, they should prove that their idea will bring some value to Cardano ecosystem.", "q0r": 2, "q1": "It's great when the team has a good acknowledgment about this market and their solution idea of the platform can address current problems a lot. \r\nIt's great when they're in the way of developing their platform and we can see it on their website, now they're on bringing it to network. But I hope that the team can give more detail about their roadmap and timeline. Because there's no detailed implementation plan in the proposal, so it is hard to say whether their roadmap is realistic or not with their plan. It also means that can't assess the required budget is reasonable or not. \r\nLast but not least, seem that they will still keep developing the project without fund, but funding will help accelerate their plan. Hence, my advice is that the team should give some risk and how they control when getting the fund", "q1r": 3, "q2": "Without considering about the detailed implementation plan, their roadmap is enough for tracking and auditing the progress.\r\nBut the team lacks key metrics, this help Catalyst community knowing what the success of the idea will look like. \r\nOne last good thing is they have a good awareness about the problem as I said before, which helps them form the features of the platform that can address the problem very well.", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is based on a well-known use case for blockchain: use tokenization to increase liquidity in a market, real estate in this case. It takes the form of a dedicated marketplace and the corresponding token.\r\nIt's easy to see the benefit of this proposal for the company real estate financial market, however the proposal fails to clearly explain what the success will be like and how large will be the added value for Cardano Ecosystem. Key metrics are not well aligned with the challenge setting, except from the part where a token is created. I would recommend this team to partner with another project to further detail technical aspects of the Dapps. \r\nI disagree that this proposal effectively addresses the Dapps and integration challenge.\r\n", "q0r": 2, "q1": "The company claims a 1-year existence, which I was not able to confirm from the website. I would recommend to the proposer to translate the website in English, this would probably facilitate people assessing, and decide for vote.\r\nThe global company roadmap is given, but the part dedicated to smartcontract development is not detailed.  Without more details, my understanding is that the proposer does not know well Cardano Blockchain. It defines the main token as \"digital tokens to be issued as Cardano-based smart contracts on the Cardano Blockchain\". On cardano, to create custom tokens does not require smart contracts.\r\nThe budget allocation is broadly described. The team is not identified, so I was not able to confirm that it gathers computer science and blockchain skills required for this development.\r\nI strongly disagree that this proposal is likely to be implemented successfully.\r\n", "q1r": 1, "q2": "This proposal does not offer project Kpi, or a detailed development roadmap. It does not explain if the smartcontract development will be open source and published on Github for example.\r\nI cannot consider that this proposal offers the community a way to effectively monitor the progress of the development.\r\n", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}], "solution": "Vertra is a global real estate marketplace of tokenized properties token holders have access to dividends and tenants to a rent to own model", "experience": "We developed the platform available on vertraimoveis.com and have over 20 years of experience in the real estate financial market on team."}