{"id": 382341, "author": "raghu.thakur", "title": "Dapp for Art & Creator Discovery", "url": "https://cardano.ideascale.com/a/dtd/382341-48088", "category": 26240, "amount": 30000, "description": "Only 3% of artists are able to get discovered and digitally promote their art and talent. Crypto adoption among the artists is 0.004%.", "funded": 1, "upvotes": 34179549, "downvotes": 13275146, "votes_result": 20904403, "votes_cast": 184, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "I agree that this proposal effectively addresses the challenge. The problem statement describes a well known issue in traditional art creation domain. The solution given to the problem is no brainer, as blockchain and decentralisation is at crux of the existing problems of centralisation/monopoly.\r\n\r\nThe proposal, however, in my opinion could have represented some statistics proofs on the numbers that proposer has given in the problem statement (only 3% of the artists are able to get discovered) Crypto adoption is at 0.004%. Also the solution claims 10 times more crypto adoption at 91% lesser costs, it would have been great if community was made aware of how the proposer reached/found this number. Any additional information that helps community verify your claims is nice to have, otherwise it just feels a claim which has no substance behind it.\r\n\r\nThe website is already in place and they have a working product up to certain extent, and i believe the decentralisation part is missing for which this proposal has been made. What i do not get is, however, that the product is perhaps more than a year old, and how come they reached to decentralisation aspect of it now, and what efforts were done in the last year or more from their side to promote decentralisation ?? It would be nice to have that information here presented  (basically their learning curve on when they identified this problem of centralisation, because if it was there since the beginning did they just come across cardano and why could not they take up Ethereum based solidity contracts to have first version of it ? , They could theoretically simply use ERC20 converter to switch their project to Cardano ) \r\n\r\nRegardless, some room for improvements in writeup but interesting idea so i agree with it.", "q0r": 4, "q1": "The main team behind the proposal is quite transparent, and their public profile is presented here.  Only one of the given team members is on the technical side but his github profile and participation in Haskell/functional programming can not be seen.  \r\n\r\nAs a plutus pioneer program participant and senior developer myself i know that learning curve with Plutus programming is rather not as trivial as in high level languages such as java/javascript etc. So for community it would have been nice if we can get a more detailed outlook onto github repos and/or other developers who will be participating and has either been part of Plutus pioneer program OR have made other open source contributions ?\r\n\r\nThe plan presented here is divided stepwise and quite elaborative. Success after 3-6-12 months are well described. However, to support 3 months milestone, I do not see any further further Budget breakdown at MVP stage. It is written Back-end platform development but what exactly they mean by backend ? The smart contract (with the offchain-onchain code), What storage protocol they will use (e.g. arweave??).\r\n\r\nThe technical jargons such as \"validation of prototype models for individual components \" does not help the reader (let alone a developer like myself) to understand in easy fashion what voter/community members can expect, what does it really mean ?\r\n\r\n\r\nAlso how this number (25k $) is reached ? It would have been better for the community if the proposer had further broke down this budget requirements via man hours, and split MVP stage into further 2 weeks sprints and/or smaller timeframes. Some proposals here have provided a jira board with such implementation. \r\n\r\nTherefore as a CA i have to give those proposals higher ratings and giving this proposal same rating as them would not be fair imo.\r\n\r\n", "q1r": 3, "q2": "I would say that the information provided here is sufficient. The good part is that how success looks like in 3-6-12 months is given, but in my opinion this should have been broken down further so that community can track the progress on biweekly(if not weekly basis).\r\n\r\nI think the community has the ability to audit the progress and success of this proposal, but proposer could have done a better job in giving more confidence on what measures they will take to have scaling in mind from very first stage. For instance Cardano has already figured out the scaling part long before Hydra will start, I believe for any platforrm that is looking for wide adoption, hard stuff should be figured out in beginning and if done so , must be made aware to the community via this proposal.\r\n\r\nOverall, a good writeup, but further room for improvements.", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": " There is a need for onboarding visual artists to blockchain which provides a secure and decentralized means to monetize the art. This initiative to provide a networking site with smart contract-based remuneration has the potential to onboard a large number of artists including photographers. This is relatively low-hanging fruit and achievable. ", "q0r": 5, "q1": "The proposers are already running an artist networking site and are experts in the domain. The team also has a clear plan and aim. The current proposal is to create an MVP and a working model. This platform also aims to attract artists by offering work which by itself will start boosting adoption. Therefore it is highly likely that the project will be implemented in earnest. ", "q1r": 5, "q2": "The proposal is detailed and includes a clear roadmap. Their work schedule has been provided in detail. The proposal will have visible outputs and adoption can be measured in quantitative terms. Thus it satisfies all requirements for audibility. The success can also be measured based on the number of artists the dApp onboards. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 15, "ne": 1, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposal does addresses the challenge, and have an interesting outlook of creating a social network platform in the blockchain, thus increasing the adoption of users. Moreover, this does not just increase adoption but give opportunities to unsung creators that want to share their work and skills on the Cardano ecosystem. The proposer have even set milestones that they want to achieve and gave detailed overview on how creators can benefit using the dApp.", "q0r": 5, "q1": "The front-end interface for Bluetook looks alot like Facebook, and I believe it will easily adopt users to use it. Given the team members that have experiences in various fields, I think the dApp can be developed successfully. In addition, the whitepaper have clearly planned for its ICO tokenomics.  The main concern are risks management that the proposer have not mentioned. (Such as, when both party of creators agree via smart contract to create something, what are the risks involve in doing so? What happens if once they have agreed on the smart contract and the \"get together\" does not actually happen? How do creators avoid from being scammed through this?). These are essential for bringing confidence to the users/voters.", "q1r": 4, "q2": "The funding required are well allocated in terms of business, development and marketing. On the whitepaper, the proposer have mentioned all phases to achieve their goal on gaining users. And based on the proposal above, I do believe that the proposer wants to kickstart on the MVP stage within the 3 months as the budget has stated. Roadmap are detailed, with integrations on Artano (marketplace) and galleries, have shown that the proposer's vision of the project. Although, this will be a big leap, it will be helpful if there are key metrics to be tracked for better auditability. ", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal fits the challenge and gives a brief general overview of the problem it's trying to solve. The proposers didn't outline how this would add value to the Cardano ecosystem. Still, given that the product they have prior is already active, there is no doubt that this will drive adoption by utilising this technology.key metrics align with the proposal; as detailed in the plan, the project is measurable via tokens and transactions flow.", "q0r": 4, "q1": "The proposers primarily link to a startup called bluetook, which the team is trying to integrate and build on top of Cardano. a small team is put together which has the relevant experience from the startup bluetook, but should be aware that Cardano is an entirely different beast and requires an understanding of how it works under the hoods to properly take advantage of Cardano's features to make this project a success.  The project offers a fair overview of what they want to achieve in the 18-month timeframe, but the budget doesn't match what they are setting out to achieve. What's being asked is less than what is used in their budget breakdown. I didn't see any relevant challenges risks that the team will face as to whether or not it will hinder the project's success. Details and context were missing; a little more light should be shed on the information that the proposal lacked, such as risks, key performance metrics, more emphasis on the problem etc.", "q1r": 3, "q2": "Short Milestones are outlined briefly, and KPIs are non-existent. We get a brief description of the targeted problem and more of an emphasis on their solution, but as a viewer, we don't understand the problem and how it fits in with the solution. More information on the problem and examples of how things work today rather than jumping straight to the solution.", "q2r": 3, "assessor": "z_assessor_903", "no_vca": 16, "ne": 3, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Decentralized discovery of art & the creator with Social network. 10 times more crypto adoption by artists & clients at 91% lesser cost.", "experience": "Bluetook operational for 1+ year & hosts 1700+ artists, 50k curated images. Founders include Artists, Tech & Management with 17 Patents."}