{"id": 382311, "author": "lpanchot", "title": "No code, audited Smart Contracts", "url": "https://cardano.ideascale.com/a/dtd/382311-48088", "category": 26240, "amount": 20000, "description": "Dapps don't have an easy way to create, manage, and execute smart contracts. Developing contracts is difficult and audits are expensive.", "funded": 2, "upvotes": 126635128, "downvotes": 9785911, "votes_result": 116849217, "votes_cast": 665, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers want to enable the usage of smart contracts in a no-code way. Meaning that people would have UX that wouldn't involve any code on their part. The problem identifies an opportunity to introduce regular people to smart contracts without even knowing it. This will have a great impact on the adoption of the cardano ecosystem if it spreads. This impact will bring value to the cardano ecosystem, through people getting the word out. The key metrics are sensible for the project and will provide nice tracking to optimize the process and the project in the future. As a developer looking through the people involved and the credentials and skills described I don't see a problem for this project to scale up. The one thing I wish I saw more of was ways to interact with the community. Fair to say that one of the authors has left a @telegram link so people can get back to him, but a discord channel can grow an actual and involved community. This proposal will bring a missing piece of the current ecosystem, by bringing regular people to the cardano community.  I really like the proposal, good luck and I'll be following your progress. ", "q0r": 5, "q1": "I always like when proposers leave links with their linked in profiles, because this brings be some piece of mind and further more it brings credibility to the whole project. In my experiecne  voters really like when proposers stand proud with their names behind a project. A team of specific skill members is already ready and working to implement the proposal and AFAIK they're right on schedule. The budget is simple enough and outlined clearly in an understandable manner. In the resources the proposers have explain with pictures (the best medium) the way the algorythm work and it's pretty straightforward and simple enough to work without issues. As a developer keeping in mind the work that has yet to be done, I trust the team will be able to finish within the timetable they have set for themselves. The plan is sensible and has answers to the question not only what are we building but how, as well. The resources linked in the proposal help to understand the possible implementation details or at least some of them. I like that one of the developers is a haskel developer, since that is the first rate citizan on the cardano development ecosystem. The technical aspects could have been a bit more concrete, but I'm speaking out of curiosity. The proposers have put quite the roadmap as their KPIs are very ambicious. The project is in sync with what's already been done, and their project will be a block that other developers will be able to step on to build their own applications.", "q1r": 5, "q2": "The one small concern I have is the tracability of the project. Since they have a site for it, I hope they put a section where the authors can put some blog posts or some kind of progress reports concerning the project and how it's comming along. The metrics and KPIs seem relevant. I like the fact they are implicityle connected to the the projects deffinition of success. The roadmap and milestones along the way are concrete enough that the items can be implemented sequentially and the time set for the project still kept. There's a clear and understandable description of the problem to be tackles as well as a simple but well through out solution.  My small suggestion would be for the authors of the proposal to see through the eyes of their future community and think of a way like a discord channel, where this community can grow and help them betatest their work. Overall I like the proposal and will be voting for it. Good luck to you in this and following proposals!", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "n order to bring the threshold required to use smart contracts down these kinds of no-code systems are mandatory and they have to be made prolific to improve adoption.  The proposal aims to build smart contract templates for the most common use cases. This will address the core challenges in the smart contract ecosystem. ", "q0r": 5, "q1": "The team consists of more than five people with balanced composition and they have produced a prototype with an open codebase. The experience and qualification is sufficient to carry out the building of smart contracts and the web interface. The work so far is professional. Therefore the team will be able to complete the proposal.\r\n", "q1r": 5, "q2": "The aim of the proposal is to build a system that can be used by people from nonprogramming backgrounds to use deploy smart contracts. This is a must feature and Marlow is aiming to achieve this. Therefore the aim and the outline are clear and the proposal implementation details are sufficient to trace the progress of the proposal. Therefore the proposal can be monitored and success can be measured. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "As information about the capabilities and value of smart contracts disseminates through society, easily deploying smart contracts without the need to write code has the potential to onboard a lot of new users to blockchain in general and Cardano in particular. The more reliable and easy to use \"no-code\" solutions the Cardano ecosystem can provide the better. This is why I believe the impact of the project proposed can be quite significant and matches the goals of this challenge perfectly.", "q0r": 5, "q1": "The team provides full details about themselves with links to their LinkedIn profiles from their website. They seem to be a mix of passionate young developers. Given that they have already started working on the project they are requesting funding for, there is a high likelihood that the project will be successfully implemented. Also, because of this, the outlined timeframe seems realistic and doable. The budget is on the small side, but given that it looks like they have self-funded the project up to this point it is likely that they are going to continue to do so.", "q1r": 5, "q2": "I would have liked to see more attention given to the KPIs, but other than that all the elements are there to make for an easily auditable proposal if funded. The timeframes and metrics are described clearly and would be easy to follow.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "We have created a no code solution that enables users to create, manage, and execute smart contracts.", "experience": "We have been building this product for 8 months and are currently integrating with PAB. https://clearcontracts.io/team"}