{"id": 382508, "author": "lloydduhon", "title": "Urban Farmer dApp", "url": "https://cardano.ideascale.com/a/dtd/382508-48088", "category": 26240, "amount": 5000, "description": "Food insecurity is a global crisis. Supply chain issues are making the problem more acute.", "funded": 1, "upvotes": 59049776, "downvotes": 10917224, "votes_result": 48132552, "votes_cast": 214, "f6_no_assessments": 3, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "I found this idea to be very current and relevant, in line with the challenge's objectives. It is a fact that the food industry is one of the largest and most profitable in the world, which does not make access to food fair for everyone. The population is defined by the prices and availability chosen by a multinational supermarket chain, often, and also by the consumption of nauseating foods with preservatives and fertilizers (in the case of vegetables and fruits). This makes it necessary to diversify access to food and one way to do this is through small producers. These initiatives are already a reality, for example, through the promotion of organic fairs with local producers, Instagram profiles focused on Food Design, for example, projects such as street fairs that take place weekly in places, etc. Having a Dapp that bridges the gap between producers and consumers is a good idea to engage Cardano's blockchain technologies in such an industry and encourage it. It is positive that the author details what activities would be found in Dapp, giving us a more accurate view of how it would work and how the project could benefit the Cardano ecosystem: as I understand it, some payments would be made with ADA in the future and the blockchain would be used for carrying out the activities, however, this bridge was still a little abstract for me. I don't think there was a very clear explanation of how Dapp would benefit the blockchain. So I think it's an excellent idea, but your relationship with Cardano could have been further broken down in order to promote a deeper understanding of how the project would meet the challenge's objectives.", "q0r": 1, "q1": "The authors are concerned with creating a good script, that is, we have a lot of details about what it would be and then we have an established notion of time for it: in the \"action plan\" part, we understand in greater depth the activities to be developed , they explain well each thing that would be done and determine the order. And in the \"script and milestones\" part, these actions are synthesized and related to the temporal notion, making the information understood more precise and monitorable (as I will comment in the next topic). Regarding the team, it is a pair; no good details are established about who they are. We know their main areas of expertise and that one of them is a specialist in what he does, with 25 years of experience. But it would be better if we knew who did what and there was a section of the proposal dedicated to explaining their careers in more depth and, more importantly, how do these people report to the blockchain Cardano? So it would be important and this idea was clarified here, for example, if the authors explained how they met and acted in the community. And as for the money that was asked, it's really a small amount compared to the other proposals and that is justified by the project, but more details would be needed, for example in the design part, it is said that some university students would work with it , but how many? What would be the intended value for each? The information provided provides an understanding, but not too deep.", "q1r": 4, "q2": "Here we have two ways to exercise auditability. One is through the details present in the action plan, where the author presents what the activities would be in a very detailed way, giving us the possibility to monitor whether what was promised will actually be done properly. Some results are also indicated in the \"key performance indicators\" part; however, these indicators cover a very long time: expected results by July 2022, end of 2022 and end of 2023! Shorter goals should be established so that it is more possible to audit, for example, if monthly or even bimonthly goals were provided, it would be more possible for us to monitor the activities. Six months is a long time without accurate monitoring. Therefore, I believe that it is easier to promote auditability is by the indirect means that the author provided in the action plan, the key indicators could be better detailed. I also believe that the audibility of this project could be done through the constant supply of author information to the community, which could be done during some room in After Townhall, which are promoted by the Catalyst Swarm group.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 18, "ne": 10, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "This dApp addresses challenge objects directly because it will provide high value for small farmers and consumers.  In the growing market of micro urban farms, this app, once completely developed, could attract new cardano users and increase transactions on the network.  Success looks like small farms using the Cardano Blockchain, tokens, and DAOs to manage farm operations such as initial set up (system construction, specific crop instructions), collection of environmental data and IOT sensors - I feel this will be a common app in the near future because of the issues noted in the proposal and in the \"Sustainable agriculture - EMURGO Trace\"  program.\r\n\r\nAs a microgreen farmer myself, I understand the problem for small farms to access markets and get started.  Additionally, small, urban farmers are (in my opinion) likely to be tech savvy, early adopters, highly connected to multiple networks.  The consumers / buyers are likely to be influencers and trend-setters, as well.  The proposed application will satisfy the challenge by attracting new users to the platform.  ", "q0r": 5, "q1": "This proposal is likely to be a success because the Wife and Husband team are an established small farm (see the website), have technical skills (see the linkedIn profile), have a collaborative mindset (see comments section and work with local university students).  Because they have a real need, have the skills and are willing to collaborate and learn, this app can be built.  I have no doubt it an app like this will be built soon.   \r\n\r\nMy concern is that the plan is too wide or unfocused and that  risks and potential problems are not addressed.  It is an early stage plan and I expect it will be iterated and revised.  It's not immediately clear from the plan what deliverables will be during this round and what are future intentions.  For instance, the last Key Performance Indicator concerning a DAO is not within the scope of this proposal (It's awesome, but not appropriate in this section).  And the budget breakdown could be more detailed. More details and clarity in the roadmap and milestones would build trust in successful completion.   ", "q1r": 4, "q2": "At this stage, the plan is barely sufficient concerning auditability.  The roadmap and milestones are in place, but could be more clear and focused.  More details about Hydra, Machine Learning (ML) and centralized AWS (Amazon Web Services) would improve this plan.  It does meet the challenge very well, but risks are not specifically mentioned.  The risks include lack of awareness and adoption:  How do people discover the app?  How and why do they stop what they are doing now and do something new?  Will getting 10 new farms onboarded next summer be difficult?  and then 30 new farms (5 per month for 6 months)?  It seems a monumental and audacious task for the funds requested. \r\n\r\nI love audacious tasks - that's what our community is about.  Proposers, please be encouraged and, and voters, please consider this impactful and fledgling proposal carefully.   ", "q2r": 4, "assessor": "z_assessor_56", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "A very well presented proposal with a great idea. If this app works it could also get a lot of people to start an urban farm as a means to  provide for their families alleviating unemployment, while providing fresh produce to clients. This Dapp will increase adoption of Cardano, and will have a positive impact on the Cardano Ecosystem. The KpI's are in line with that of the Challenge.", "q0r": 5, "q1": "The proposers have the necessary skills and a LinkedIn profile is given that shows their experience, skills and education. The budget is outlined and very reasonable. A detailed action plan sets out how they plan to roll out the project. They will make use of a local design college's students to help implement the UX/UI. KPI's are laid out well, as well as a road map with milestones. I do not see Risks discussed in the proposal. All the skills required is also listed.", "q1r": 4, "q2": "This proposal does include a road map with mile stones and KPI's, that can be used to quantify the success of the proposal. The proposer does not indicate how the community can follow progress of the project.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Develop a dApp that helps micro urban farms to operate and expand, while making it easy for community members to order produce from them.", "experience": "Owner/Operator of Living Greens Urban Farm.  \n25 Year IT veteran, CTO level experience.  \nCardano Plutus Pioneer 2nd Cohort."}