{"id": 382821, "author": "i3dangels", "title": "i3D Mass Adoption Protocol", "url": "https://cardano.ideascale.com/a/dtd/382821-48088", "category": 26240, "amount": 42700, "description": "Mass adoption for startup investing is an illiquid, high risk, &  poor data environment with low liquidity for founders & investors.", "funded": 1, "upvotes": 74449304, "downvotes": 11485856, "votes_result": 62963448, "votes_cast": 351, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=27675"], "media": [], "f6_assessments": [{"q0": "Targetting a user base such as startups could do a great deal of good for the Cardano community. The proposal focuses on providing the startups with the fundings and financial assistance needed. The decentralized feature provides this platform envisioned by the team with more scalability and integrity. The proposal on successful implementation could draw more attention from startups planning to host on a decentralized network and make them prefer the Cardano chain over the other chains. Having said that I strongly feel the impact of this could be huge for the community.", "q0r": 5, "q1": "The proposer provides the readers with an elaborate detailing of their game plan. The phase-wise development and the corresponding deadlines provide the community with the foreseeable result. The mentioning of the further need for funds through the next rounds adds more credibility to the authenticity of the proposal. The team blend and their experience is an add-on. The extensive amount of groundwork already laid down is another positive to look at. The team also recognizes the possible threats and weaknesses it might face and how they plan to mitigate them through a SWOT analysis, which is certainly unique compared to a lot of other proposals. However, an elaborate budget breakdown would have had done the trick for gaining full marks on feasibility criteria.", "q1r": 4, "q2": "The creation of a new token to facilitate the operations surely shows that this proposal is moving forward towards its envisioned destination. However, the proposer makes no clear indications about the metrics that the auditors could use to monitor the progress on a regular basis. The number of startups onboarded, the amount of funding, the new contributions facilitated by the platform might be good enough metrics I feel the proposer could have added along with an estimated figure for each of them. The timeline and the deliverables look promising and thus, I give a score of 4 out of 5 for the clarity and auditability of the proposal.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal has been presented by a strong team, after detailed planning and SWOT analysis. With this background work and detailed planning, there is a very high chance that the project will be implemented in the best possible manner. The Github repos are also very active with substantial work showcasing the team's capability and commitment.", "q0r": 5, "q1": "This proposal has been presented by a strong team, after detailed planning and SWOT analysis. With this background work and detailed planning, there is a very high chance that the project will be implemented in the best possible manner. The Github repos are also very active with substantial work showcasing the team's capability and commitment.", "q1r": 5, "q2": "The proposal includes a whole meaningful KPI that can measure the actual adoption rate. The funding is for the development round, enabling scaling and allowing rapid mass consensus by a more extensive network to assess the idea. There are a nicely laid out roadmap and plan. Therefore the I think the proposal is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This proposal speaks directly to the main objectives of the challenge, by implementing 3 Token Double Sided Marketplace offering a combination of due diligence, network validation, investor capital preservation and liquidity to encourage mass adoption for crypto startup investing. The project offers complete end to end solution that solve three common problems for crypto startup which are credibility, network validity, and capital. This project is certainly a game changer in DeFi and could potentially foster lots of new crypto startups. \r\n", "q0r": 5, "q1": "Team consist of multiple individuals with significantly relevant credential and expertise. Given the combined experience presented by its team member, it is highly likely that the project can be a huge success. Team provides clear roadmap and requests a reasonable budget with detailed breakdown. The whitepaper provided by the team has depth technical explanation. Problem statement and solution delivered match and both address the challenge effectively. Success measure of this project is very reasonable, and team has explained clearly their step-by-step execution plan. This proposal is one of the best in Fund 7 and should be voted by the community.\r\n", "q1r": 5, "q2": "The success criteria provided the proposal is reasonable and achievable that make the project feasible and realistic. Team does not mention where they will publish the progress of project execution making their web as the only source of monitor or audit the project. So, the team can improve the execution of this project by posting the detailed budget spending on cardano forum so it can be audited by the community member. This proposal is one of the best in Fund 7 and should be voted by the community.\r\n", "q2r": 5, "assessor": "z_assessor_643", "no_vca": 17, "ne": 5, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "Startups lack a lot of resources and have to do tons of inexperienced work in a limited time. For good startups that want to save time and get rid of problems in due diligence, this idea is a silver bullet for them. Moreover, this idea also inspires a lot of investors to come and help young startups because its mechanic and features can help startups transparent info easier. \r\nIn addition, throughout the proposal, there is a lot of solution that is not just for solving the problem, but also motivate users a lot to engage with this platform. \r\nI think that the success of this platform will affect a lot to the world and Cardano ecosystem, especially it can help startups in Catalyst problems go further easier. ", "q0r": 5, "q1": "This team can make it! \r\nThis is an experienced team in startups and TradFi, DeFi... that's not just from their profile but checking the detailed info of their plan, they have a good guiding about how their solution can point out the necessary features/ activities that really need for the user based on user insight - as my experience with the position of startup and stakeholder. \r\nBut I hope the team can have a better roadmap, more detail to help me understand what they are doing and gonna do in that time. \r\nLast but not least, it's appreciated when they add their SWOT into the proposal. It means they have well analytics and can has a good plan to implement this idea. ", "q1r": 4, "q2": "The roadmap is less info for auditing what the team will do. But their KPIs are very promising, all about the number of user adoption. \r\nI hope that this team will succeed in this idea, this will help a lot of startups around the world. And will increase the number of startups that can fly to the moon. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 17, "ne": 3, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "3 Token Double Sided Marketplace offering a combination of due diligence, network validation, investor capital preservation and liquidity", "experience": "Educated & Experienced team with multiple startup experience collectively. We are strong & balanced with experience in tradfi & defi sectors"}