{"id": 383100, "author": "bef7103", "title": "Wine open market - Stappato", "url": "https://cardano.ideascale.com/a/dtd/383100-48088", "category": 26240, "amount": 10000, "description": "Access to wine can be challenging: allocations and waiting lists are notoriously hard to get into and restrict participation in the market", "funded": 0, "upvotes": 16927940, "downvotes": 19122429, "votes_result": 2194489, "votes_cast": 165, "f6_no_assessments": 11, "f6_rating": 3.3333333333333326, "videos": [], "media": [], "f6_assessments": [{"q0": "It is not very clear here how to bridge the gap between the sale of wines and the Cardano ecosystem. The proponents intend to create a Dapp, which would be a wine trading platform, using smart contracts. But what would these contracts be used for, exactly? Could it be the sales data? What data? What exactly would be being hosted on our blockchain network? What would be the advantages of this for wine producers? At one point, the proponents say that one of the goals is \"to integrate new wineries into the project, showing them the advantages of open access to their wines\". It would be important for them to define in the proposal itself what these advantages would be. Also, what are the benefits for end consumers? I believe that the target audience is upper class people with an older age group, these are usually people who consume more refined wines. This audience is not the audience we are used to dealing with in our projects - most of the time, we are aiming to reach people who already use blockchain technology (people who already have knowledge of the technology field and interest in the cryptographic world); or even potential users, who are more likely to use Cardano ecosystem services. But the audience here seems to be different, really, people that we don't expect to have any kind of connection with Cardano. How to make this public understand the advantages present here, how to convince them to leave the traditional and use these new technologies? Because of so many doubts, unfortunately, I don't think the proposal is as guaranteed to work, that is, to create a Dapp that increases the number of transactions in Cardano and brings new users to our ecosystem. It's a very specific niche project, and it would need a better argumentation about the points I raised. If there were explanations about 1) how this would benefit Cardano, in more detail 2) how producers and consumers would convince themselves to use blockchain, confidence in the impact would probably be greatly increased.", "q0r": 2, "q1": "We know very little about this team, all we are told is that they are three people with experience in the wine business and also knowledge about blockchain. However, this is very little! We would need to know their names, what each one does, a brief history of previous work and, above all, how these people relate to the Cardano ecosystem. They claim there are professionals with blockchain experience - but what would that experience look like? Have you done any projects in Cardano before? If yes, which one? Unfortunately, there's no way to trust a team we barely know. I suggest that bidders include detailed and individualized descriptions of each, preferably with examples of previous work and if there are also linkedin profiles. There is a script here, but it is superficial. For example, the first 3 months would be devoted to creating the platform to show it to the producers, right? They know WHAT would be done with which GOAL, but HOW? What activities would be developed chronologically and by whom, in order to obtain such a product? I also think that 3 months time is quite long; it would be more interesting if the activities were divided and organized monthly, for example. A point that worries me a lot here is the following: \"part time external consultant with experience in wine business (~1 day/week for 3 months 1500 USD/month\". We would be paying one person to work only 1 day a week on this project, that is, approximately 4 days of work that would cost USD 1500? I found this value very high, incompatible with the work time. Many professionals from other proposals work full time to receive such a salary, whether designers, developers, publicists, etc. This is somewhat disproportionate, in my view. Regarding the budget, it is explained along with the roadmap. At each stage, we are told how much the activities reported would cost. In relation to this point, I believe we have enough information to understand the funding, my observation here is just that (in my opinion) some values ​​are fair, but others are disproportionate, as was the case commented earlier. Therefore, in conclusion: 1) there is no way to trust the team because there is little information about them 2) the script is superficial, but allows a view of the whole 3) the budget is understandable but disproportionate in some parts.", "q1r": 2, "q2": "The auditability here is good, because the author of the proposal outlines some KPIs that serve to monitor the direct results of the platform: number of consumers, suppliers, products sold... These are purely quantitative data, but they would indicate in a concise way if the project was successful or not. It would also be great if there was some sort of analysis of how many smart contracts were generated, what was the direct impact for the Cardano ecosystem? This part is little explored in the proposal as a whole, and also in the final metrics. It is possible to follow the development of the project based on the given roadmap. But, as I mentioned, without much detail and with a broad temporal division of several months compiled, in addition to the fact that we do not know who would do what, it is not possible to carry out such specific monitoring. Therefore, my suggestion is that the author define some metric (KPI) focused entirely on Cardano and that the roadmap be more detailed. We need to have contact with both the sales person and the developer in Cardano, to understand how the full facets of the project would be being developed. It is possible to audit the proposal, but this could be done in an even more satisfactory way if the commented data were created, revised and improved.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 31, "ne": 18, "ng": 13, "nfo": 0, "vca_o": 2}, {"q0": "Although the cited problem is understandable, there is not enough information to explain the dimension of the problem. How big is the wine market? What difficulties exist in the market that could be solved through blockchain?\n\nI can see potential for a wine marketplace, but the value proposition of this proposal is not well established.\n\nThe metrics presented would allow the number of customers, wineries and items sold to be measured, but goals/KPIs have not been established that could allow the assessment of the potential for impact.\n\nWithout clarifying the above points, there is no way to make an accurate impact assessment, so I would recommend including these points.", "q0r": 2, "q1": "There is not enough information to assess the team's qualification, we don't even know the names of the people involved in this proposal. Even though there is mention of experience in the blockchain and wine fields, there is no source or link to support this information. Who will be responsible for the development of smart contracts?\n\nThe project plan was divided into 3 phases, but there are few details that indicate feasibility. There is no information about the development of smart contracts and who will develop them. Phase 1 will have an MVP, but I would recommend that the team work more on the rationale to justify the idea/concept, because the way the proposal was presented there is not enough information to indicate feasibility.\n\nThe budget is not well defined. The proposal is asking for 10,000 USD and there is mention of costs for hiring a salesperson for 1,500 USD, a consultant for 1,500 for 3 months and 1,500 USD for marketing(based on these values how do you get to 10,000 USD?), but none of these costs involve developing a dapp and considering that the purpose of the challenge is dapp development it doesn't make sense that the proposal asks for money only for items outside the main scope of the challenge. The main point to judge the feasibility of the budget is to understand the cost for the development of the dapp and although the team has mentioned that it will cover the additional costs, this isn't an argument to support the feasibility.\n\nRisks and challenges of the proposal were not considered. Before creating a wine marketplace, it would be important to know the potential, the demand of this market and what would be the appeal of creating a marketplace on the blockchain. Will these wines be certified/authenticated by blockchain? Is there an intention to create a supply chain model? Is there intent to use metadata? If the wines are certified through the blockchain, what would be the mechanisms to avoid fraud between the data included in the blockchain and the wine itself?\n\nThe idea itself is valid and a marketplace would be within the scope of the challenge, but I would recommend that the team provide more details so that it is possible to assess the feasibility of the proposal properly.", "q1r": 1, "q2": "The problem was not well described, I would recommend providing more data and information to understand the value proposition of using the Cardano blockchain for the wine market. The presented solution does not show enough information about the technical plan regarding the development of smart contracts.\n\nThe metrics described are useful to understand the use of blockchain, but as no goals/KPIs have been established, auditability becomes extremely subjective.\n\nAlthough there is a plan with an established timeline, I consider the plan presented to be a draft, as there is no information on how smart contracts will be used and the business plan itself is very subjective.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 28, "ne": 15, "ng": 13, "nfo": 0, "vca_o": 2}, {"q0": "This proposal would be a good innovation towards the Cardano blockchain, and it would gain attraction on new users as well as current users. This is because, 1) The wine market only in the U.S alone have a market worth of $88 billion. 2) Deploying smart contracts are considered a simplicity for both consumers and sellers (Though bugs, errors or malicious actors can trigger undesirable results that are hard to correct.) 3) The involvement of traditional markets into the blockchain. ", "q0r": 5, "q1": "With the given experience and connections, I believe this will an interesting project for the Cardano ecosystem to provide wineries into the blockchain, though elaboration of the hiring of team members can be further informed - but the proposer only requires funding on the marketing side. I would also like to add on the Phase 2, (what are the risks when onboarding new wineries into the project?). As it will also add as a good point to where the expansion of the project to success.", "q1r": 5, "q2": "The funding required is only for marketing purposes and seems reasonable, and I am thrilled that the project will be implemented in the blockchain. Though, further elaboration on outreach campaigns and milestones for the marketing would be helpful to give a glimpse of the Wine Open Market. I believe it would be revolutionary to provide wineries or maybe in the future other types of spirits into the blockchain whereby users can directly buy it via smart contracts.", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 19, "ne": 3, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "It isn't clear how much value and users this app. will bring to Cardano. Please give more information about the waiting lists for buying directly from wineries, as this isn't something many people have experience with. How will the trade platform work? Will there be buy/sell orders?", "q0r": 3, "q1": "Who are the team members? What previous achievements can you show? It seems that you're determined to make this project work; it might be helpful to complete the MVP and then ask for funding.", "q1r": 2, "q2": "There are simple KPIs which are measurable and realistic.", "q2r": 5, "assessor": "z_assessor_80", "no_vca": 32, "ne": 3, "ng": 19, "nfo": 10, "vca_o": 1}, {"q0": "The proposer wants to build a platform to enabe wine lovers to be treated more fair when buying wine directly from producers. A dapp will be built so the project is in line with the challenge. There's an implicit benefit for the cardano ecosystem so no problems there. The key metrics make sense for such a proposal tracking the adoption of the platform once made. I'm not sure if the project will be capable of scaling because no team members are directly specified. And I don't think the types of members mentioned will be enough to bring the project to it's success once scaling is necessary. I see quite a bit of things missing in the proposal: an understandable budget, any kind of proof for stated skills, thought about reusing what's already been done and open sourced, probing for partnerships or talks with producers and a couple of other minor things like supply chain management research, price points, competitiveness.  As a developer, I was expecting more detail. With all due respect, this looks like an idea and not a business plan. Overall a good idea that fits with the challenge. ", "q0r": 4, "q1": "Unfortunately I couldn't find any evidence of the mentioned skills in the proposal. This brings down the credability of the project alongside the fact there are details missing in the proposal. I didn't understand the budget break down, there was some mention of 3 months 1500 which makes 4500 and then 3 months of 1300 which makes 8400 and 1500 for marketing making 9900 in total, but the budget is 10000 so I didn't see where the last 100$ are. I hope the proposer wasn't rounding up and just made a mistake in calculating the end cost. I encourage the proposer to come back for the next funding rounds and take better care when compiling the proposal keeping in mind the proposal requirements. Putting yourself in the eyes of the voter is also a good idea when writing a proposal. Overall there were a couple of more things missing in the proposal that I already mentioned. Keeping in mind all said things I'd advise the author to take a look at other proposals and look at how does a proposal that is already funded look like. A good idea, but I couldn't call it feasible for the aforementioned reasons.        Taking in potential risks like competition also seems like a reasonable thing to do.", "q1r": 2, "q2": "No mention of any way to trace the progress of the project. I'd suggest a telegram channel or some other medium to keep the community involved as they could be future customers of the app. Metrics and KPIs seem good, but that's not enough to make a good proposal. The roadmap is a bit hectic, but it's structured. The description of the problem and solution are understandable.   Overall an idea that needs more work in order to turn into a serious proposal IMO. Good luck!", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 32, "ne": 13, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "This proposal intends to create an online marketplace and cut out the middleman that takes margins on sales transactions. What is proposed is basically like an online cooperative which wineries can join and where consumers can buy wine. So it should be profitable for both producer and consumer. If successful, it could generate additional transactions on the Cardano blockchain. ", "q0r": 5, "q1": "The proposal speaks of a 'blockchain professional', which I suppose will build the smart contract. The unbacked relative experience that is claimed would suffice to run the business. But who would create the online marketplace and website? \nTo enhance the feasibility and community trust in this proposal, consider publishing the team's identity and some proof of experience. ", "q1r": 3, "q2": "While there is a clear roadmap, plan and KPIs included in the proposal, there is no information on what would happen if the project initially turns out to be not as successful as anticipated. Is there a plan b to mitigate this risk if it were to occur? \nThis in combination with details on what is intended with the marketing campaign (online advertising, tv ads, ...) and a website where additional information could be found would improve the auditability of this proposal greatly. ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 32, "ne": 3, "ng": 26, "nfo": 3, "vca_o": 1}, {"q0": "The idea is about filling the demand and supply gap between wine consumers and producers using Blockchain smart contract functionalities. This is a project that has the potential great use case globally and more adoption of the ecosystem. It definitely address the campaign challenge and should he be given a chance.", "q0r": 4, "q1": "The team has already brought the project to a realistic level and they are just asking for funds to promote the platform and for administrative costs. I am convinced that the proposal will definitely be implemented successfully. Also considering the detailed milestones and realistic budget request and the project has a great chance for a successful launch. However no challenges or risk factors had been mentioned, I still believe that the team has enough passion to ensure success.", "q1r": 4, "q2": "The proposal has given considerable information to assess and the progress of the proposal if funded.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 31, "ne": 1, "ng": 19, "nfo": 11, "vca_o": 1}, {"q0": "As an experienced Technical builder and Active Catalyst member, coming from one of the TOP wine producer countries in the world I found this proposal aligned with the Challenge objectives, as implementing the smart contract in the trading platform will drive more usage and increase transactions in the Cardano Blockchain. Though its impact is not clear as no much information was provided in order to clearly assess that. As the proposal is aimed to support the validation of an MVP and business model in the market it does makes sense that this information will be better understood once that model is validated.", "q0r": 4, "q1": "The team brief description seems to be appropriate for the successful achievement of the project goals for this phase, though no specific details or external reference links were provided in order to further validate those capabilities. As the requested funds will be used to fund Sales/Marketing/Customer Validation I don't see there will be too much problem to carry out the desired goals, but no information was presented on the technical side as well, on how and whom will produce the prototype/MVP and wether those members of the team are already identified or hired.\nThe timeline is clear but not detailed, and we are talking about an MVP in 3 months, so I'd add many more details and deliverables to the project in order for others to assess if the plan fits the purpose and what type of platform/complexity will be built.\nNo details on the Business Model or Platform operation were provided, besides that it seems to be a double sided platform with a Smart Contract, I'd recommend to add those details so anyone can understand what is behind the idea, to form an opinion on its chances of success.\nI do value the expressed commitment that you will fund the building of the project on your own, that's great but not enough to reach the success of the project if what is being built is not the proper platform, and to understand that more details are needed.\nThe requested budget breakdown was provided and makes sense with its intended usage and market prices and seems reasonable for a Prototype (at least with what I imagine with the information provided)\nNo risks were identified within the proposal and there will be many to be addressed in the way.\nI recommend to add all of these details to produce a complete proposal presentation weather you are voted and funded, so you can provide progress reports (they will be needed) and if not voted to participate in the next funding round, loved the idea to disintermediate the wine industry.", "q1r": 3, "q2": "Even though a general goal of delivering an MVP and support the validation with the funds, no specific KPIs were provided, so it will be hard for the community to be able to audit the progress of the project. I recommend to add SMART KPIs in enough details within the 3 months project period to be able to measure and audit progress. General Production KPIs will also be great to have to understand the level of impact this project can/aim to produce.", "q2r": 3, "assessor": "z_assessor_288", "no_vca": 32, "ne": 14, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "The tracking of wine, like other merchandise is something that blockchain should play a big future role in. This app in particular is set to make it easier to get on the list to be able to purchase and distribute directly from wineries in a fair manner which I think is great. There are a lot of wineries in Italy, my concern currently with how much impact it will have is that they dont appear to have any direct communication with a winery at this time which would be a great way to get started in knowing that this is something that is important to the wineries in their area.", "q0r": 4, "q1": "There is mention that the team has blockchain experience but there is a lack of information on exactly what they worked on in the past or links to previous projects and repositories. It would also be a good idea to attach member linkedin profiles or similar.", "q1r": 3, "q2": "I think the milestones that they came up with are well thought out and are achievable. I think the rationale for the salaries could use some additional work. For example with the part time external consultant, are you saying they will work 1 day per week and for each of the 3 months they would get 1500 usd? that seems quite high for roughly 4 days of work in the month. Its possible Im misunderstanding but some clarification on that would be appreciated.", "q2r": 3, "assessor": "z_assessor_119", "no_vca": 32, "ne": 2, "ng": 29, "nfo": 1, "vca_o": 1}, {"q0": "The proposal do achieve the challenge goal. Which is bringing more users to the platform (which runs in the ADA environment).\nIt has a potential to make a huge impact, since according to Fortune Business Insights  [https://www.fortunebusinessinsights.com/wine-market-102836], it has a projected grow to USD 456,76 bi in 2028. Therefore, if this platform could get 0,5% of its market, its a volume of USD 2 bi in 2028, which is huge.", "q0r": 5, "q1": "The proposal did not show the reference and links that shows the team experience. It would be good having this info.\nAbout the budget, I’ve not understood it quite well. I’m missing a more broken down information. Since you’re using the money just for marketing and sales, it should be added where are you intending to advertise, for example, for how long and which methods are going to be used to do it and check its reach.\nThe timetable seems fair to develop what you’re proposing.\nOne point that I’m missing is the logistic strategy. I’m wondering here if you’re going to be only a platform which connects the seller and buyer or you’re planning to have some logistics solutions. I’ve seen this site here (https://www.liv-ex.com) which looks like your proposal, however they have some warehouses to implement logistics. Here in Brazil we have some fidelity clubs which send different wines every month to the subscribers, but they too have their own logistic net (or they provide this service, not having the actual places). Therefore, you might find that providing this service to the seller is a way to increase their participation.\nWould be great to have a risk map, considering marketing effectiveness, logistics (is it going to sell all around the world?), seller stock, etc.", "q1r": 3, "q2": "It should be added some more KPIs like volume of transactions, number of countries supplied, etc. It would help to track the development of the platform.\nMoreover, since it was not defined the advertising methods, it’s quite hard to verify its effectiveness and audit it, needing more information (method, platform, tracking, etc). ", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 32, "ne": 8, "ng": 22, "nfo": 2, "vca_o": 1}, {"q0": "The idea is valid but some points in the proposal could be clearer. First, its not clear how this application would leverage blockchain and smart contract technolgies in relation to regular market place or plataform for wine selling. More details on this could be given.\nSecond, its also not mentioned the potential market for this business, which makes it difficult to assess its full impact. for instance, it says, waiting list are hard to get into, but it could also say how many people are trying to get on these lists and how many there are in the lists. However, I particularly like that the business development part will happen in paralell from the technical development. It would be nice also to see the business model that is being thought for this DApp or how it intend to get revenue from. It could be from a monthly subscribe fee, transaction fee, etc.\nI'd also provide more information on communication strategy to target audience. How will they be reached and what kinds of advertising would be made?\n\nImpotant to say that proposal is aligned with challenge as it will likely increase \"Number/growth of application output\", \"Number/growth of application transactions\", Total \"volume of Ada involved in application transactions\" and other challenge KPIs.\n\nIn general, the idea is good but proposal could better explore the advatnages of smart contract (specially for those not very familiar with it) and the total impact, considering number of potential users.\n\n\n\n", "q0r": 4, "q1": "There are very few information about the team. It only mentions that 3 people are committed and their general experience, with some vague terms (as wine world connections). To make this part better strucutured, it would be imporant to see their individual capabilities and experience, have linkk to verify the information and bring more concrete example. For istance, when it is mentiones \"wine world connection\", it could say with whom is this connection and what level of connection is this, if any toher project was already developed with them, etc.\n\n\nThe plan is sound as it is time-framed and contain acitivites and deliverables. Again, much appreciated that business development happens together with technical development. I also liked that a MVP will be done first. Theres also a fair budget breakdown distribuited in the timeline.", "q1r": 3, "q2": "There are milestones in the timeline and 3 KPIs defined. It would be imporant though, to see some targets spread out in time, to check its evolution and see if its going accordin to plan.\nOther possible metric to add is someway to measure the number of reccurrent purchases from same costumer. This could give som insight on the quality of the service as a whole (wine + platform).\n\nIn regard to risk analsysis, I'd consider both technical and business risks to be addressed have a mitigation startegy in place since begining.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 30, "ne": 11, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "Develop an open trade platform for the rights to buy wine directly from producers enabling broader and fair access and increased liquidity", "experience": "Team of 3 with multiple years of experience in the industry including blockchain professional and sommelier graduate +wine world connections"}