{"id": 384071, "author": "keith", "title": "Music NFT Launchpad", "url": "https://cardano.ideascale.com/a/dtd/384071-48088", "category": 26240, "amount": 20500, "description": "Musicians are not able to effectively diversify from, and monetize their music using current platforms led by dominant corporations.", "funded": 1, "upvotes": 47129533, "downvotes": 9794957, "votes_result": 37334576, "votes_cast": 183, "f6_no_assessments": 6, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal addresses the problem of musicians not being able to monetize their music using the existing platforms in the music industry. Being a musician myself, I know this all too well. The solution to the problem statement does not contain the actual solution, but fortunately that is found in both the title of the problem statement and the roadmap. The team aims to create a way for musicians to learn about Music NFTs and releasing them as such, along with a release on a streaming platform. Considering the music industry is quite complex, I would have liked a little bit more explanation in detail of how their platform will work, but I'll get to that later. Integrating music and artists into the NFT space efficiently has been proposed and tried many times before (because it is very much needed), but there has yet to be a really solid platform to be launched. The core idea is very relevant and great, and If successful and properly developed it might be a huge deal for both the Cardano Ecosystem and the music industry as a whole. I agree that this proposal addresses the challenge, albeit vaguely in how it aims to execute said plan. ", "q0r": 4, "q1": "The team has a lot of expertise with marketing, design, engineering and consulting. The lead founder is a Stake Pool Operator, which proves a deep involvement and understanding of the Cardano ecosystem. One addition that would strengthen the credibility of the team further is the inclusion of some other sources that can verify the expertise and competency of the team. There is a link provided to a beta of the product (which is nice), but what I'm asking for is a presentation of the team members themselves. The proposal is asking for less than 10% of the total challenge budget, but it would be nice to see an estimate of the working hours included in the funding allocation part of the proposal. For example, how many hours does the 5000 USD allocation in a web developer mean, and for what period of time? It is very promising that the launchpad (artistdrop.io) is already up and running, that speaks well for the future of the project. If I understand the proposal correctly, the team will be the ones minting the original artwork from the artists into NFTs, which will probably both be appreciated and criticized by the artists. A simple example description of how the process of using the platform from both artist and buyers perspective would provide a lot of clarity to this proposal.  All in all, I agree that there is a good chance that this proposal will be implemented successfully. ", "q1r": 4, "q2": "The proposal includes a roadmap spanning from Q4-2021 up until Q2-2022. In order to further increase the transparency of the proposal, it would in my opinion (as an experienced Community Advisor) be helpful to include some KPIs into the roadmap. For example, from when does the \"onboard 4 musicians a month for an NFT drop every week\" start? Has it already started? Also, explaining the process of removing the minting service middleman and possible challenges of doing this, since many people aren't familiar with the ins and outs of NFT minting. \r\nWhat would really increase the credibility of both the team and the proposal are some reflections on potential risks and challenges connected to the development of this project. As an active musician and experience with being contracted to record labels, I'm wondering how the team will deal with the rights to the music if it is released on other platforms, but minted at artistdrop.io at the same time? Will it be in collaboration with streaming platforms and record labels, or without their knowledge? Or will the proposal focus on independent artists? There is a lot of contracts and pitfalls in the music industry, and I believe that the biggest challenge of creating a solid NFT-platform for artists lie there. Having an explanation of how the team aims to navigate through that would increase the trust and credibility of the proposal proportionally. Due to the limited information provided in this proposal, I neither disagree nor agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. ", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal defines a problem and introduces a solution to tackle it. It could have been made clearer what exactly makes this marketplace special in comparison to other marketplaces. ", "q0r": 4, "q1": "The proposal is already in the works which shows the commitment of the team. The team has a wide experience in tech and blockchain and the lead founder is already involved in the cardano community since several years. They could have added some more technical aspects to the proposal in my opinion, why I will rate this with a four.", "q1r": 4, "q2": "The proposal provides information about the team, the roadmap and how they will use the budget. In my opinion the roadmap could be more detailed. Also the key-succes metrics could be explained a bit more in detail. Overall the proposal provided more than enough information to asses it and get an idea of the product", "q2r": 4, "assessor": "z_assessor_41", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The problem in the proposal is within this challenge. Their success metrics also fit with the challenge direction. But the team should provide more info about how their event will impact the Cardano ecosystem. ", "q0r": 4, "q1": "The team doesn't have a clear implementation plan that helps to understand what they will do. This project is not simple and they need to think more about the plan to add to the proposal instead of only brief info for each field of activity. \r\nAfter that, they should make a more detailed roadmap. And some relevant risks, that the team doesn't mention here. \r\nAt last, the budget that the team required is suitable with the provided roadmap, but as I mentioned above, they should make a better plan, then a better roadmap to help CA assess it. ", "q1r": 3, "q2": "For the idea of this project, my advice to the team is that they should make a better roadmap. The current roadmap and key metrics are close enough to audit what they will do in the future. \r\nThey don't have any content to show about the well-acknowledgment about problem context and clarify how their solution can address it. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The music NFT launchpad proposal fits well with dApp & integrations by allowing the artist to launch their singles or albums using a NFT along with a release to their streaming platform. This will encourage more artists to use the platform and lead to increasing adoption on Cardano.", "q0r": 5, "q1": "Although the proposer team has no direct experience in music, their technical background (engineer, consultant, and designer) will help them to implement this proposal. It would be quite good for them to locate someone who could look into smart contract development as they will work closely with smart contract developer and it will be a smooth operation when the team can communicate which feature is necessary for the future launchpad.", "q1r": 4, "q2": "The funding allocation looks plausible but the community would appreciate more elaborate response for this part. To create the launchpad ready in 6months is quite an impressive task in itself. Anyhow the community can assess the fund flow as well as monitor the project progress anytime at ease with the mentioned KPIs. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "I see value in creating a platform where creators/musicians can sell their music NFT(s) in the Cardano ecosystem. This will in fact benefit the current users and attract new users, as the problem has been clearly  stated, that musicians in the traditional schemes of this business are being monetized by corporations and not having the true value of their own crafts. ", "q0r": 4, "q1": "The team members are clearly stated, and I have looked up to the website. I am not sure what the proposer means as live, as the current website have only few information about the proposal. Moreover, I have tried joining the discord server but was unable to as the invitation was expired. In addition to this, as a UI/UX designer that uses Figma, the prototype on the given link is only half way done. This gives a lack of confidence for both CA(s)  - to understand clearly the proposer's idea, and voters - to have confidence in which how the technical development of the idea. Though the roadmap has been defined, but vision of expansion, milestones to develop, and risks to be taken are not well delivered. ", "q1r": 2, "q2": "The required funding must be broken down in a detailed manner and take account of risks that will be addressed, as to have better auditability. What's lacking is the milestones and management on the KPI(s) given. For example, how do the proposer intend to increase musician revenue by 20% by Q2 2022. What steps should be taken to put importance and protect/avoid musicians from scammers in the platform? What are the UX features that enables users to adopt the platform easily? ", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Onboarding musicians to distribute their work through NFTs on Cardano, has the potential to greatly popularise the platform. However, after reading the proposal I'm not convinced that the team behind it is the right candidate for the job. On the other hand, this may be the result of a rushed proposal due to lack of time.\r\nThe idea has a lot of potential, and it would be great to see a CNFT \"record label\" be born, that's why I would hope that the team resubmits a more complete and thought out version of the proposal in the future.", "q0r": 2, "q1": "The description of the proposers' experience is very promising at first glance, but no credentials or links to previous works are given to allow the community to verify and better judge for themselves.\r\nGiven that their landing page is presented as a working platform I have my doubts about the standards of the team at the moment.\r\nI would advise filling in the gaps in the gaps in the proposal, elaborating on the promising concept and resubmitting it to a future fund.", "q1r": 3, "q2": "Not a lot of thought seems to have been given to the KPIs of the proposal, they are present, but are very shallow. I would suggest further elaborating on them in a future iteration of the proposal.\r\nThe proposers are keen to point out that their service is already live, however on inspection of their website I discovered that it is little more than a landing page with a brief FAQs section.\r\nThe budget is broken down, but the figures seem a bit generic, particularly the sum allocated to the smart contract developer. The roadmap is brief and introduces elements not detailed elsewhere in the proposal.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Musicians will be able to release their single or album as an NFT along with the release to streaming platforms.", "experience": "Our team currently includes three members with a wide variety of experience in tech, blockchain finance and marketing."}