{"id": 382833, "author": "sirpool", "title": "Delegation Matching Service", "url": "https://cardano.ideascale.com/a/dtd/382833-48088", "category": 26246, "amount": 14800, "description": "É difícil coletar delegados suficientes para sustentar a operação do pool.\nE poucas diferenças em relação a outras piscinas ao escolher uma piscina.", "funded": 1, "upvotes": 62502248, "downvotes": 13553463, "votes_result": 48948785, "votes_cast": 169, "f6_no_assessments": 4, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal addresses directly the challenge by crating incentives marketplace for delegators to easily choose desired stake pool. For SPO's it provides new ideas for attracting new delegators, making small pools sustainable over time.\r\n\r\n", "q0r": 5, "q1": "The idea seems very good, to drive new ways of turning SPO's into mission driven pools. \r\nAs I understand, by delegating to SPO's with this delegation matching service (DMS), it rewards delegators with extra perks and incentives, taylored to delegators interests and needs.\r\nThe proposer is SPO, running 6 months of experience. \r\nThe budget is acceptable, clearly defined and broken down in segments.", "q1r": 5, "q2": "The description of the DMS system is very interesting, and the proposer has decisively chosen the solutions with a win-win mentality as a principal framework. Expecting influx from conventional markets into Cardano stake pool system.\r\nThe defined launch date for the test platform in japanese is in 1st quarter of 2022, followed by official service launch in 2nd quarter, and mobile application in 2023.\r\nI rate this projects auditability with a top score of 5.", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 20, "ne": 4, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "This proposal problem statement and solution are aligned with the challenge. \r\nThis proposal also clearly articulates how it will add value to the \r\nCardano ecosystem by further promoting the expansion and decentralization of the Cardano network with Delegation Matching Service (DMS) that will help promote and attract delegators to smaller pools. \r\nAlso, the key metrics and goals of this proposal are aligned with the outlined challenge settings.\r\n", "q0r": 5, "q1": "The proposer also knows the required manpower and resources to successfully implement the project. \r\nThe budget presented is outlined clearly and broken down into identifiable terms. \r\nMoreover, the budget requested are reasonable to achieve the set goals. \r\nFurthermore, this proposal provides a sensible and conductible plan for implementation. However, the proposer did not provide evidence of relevant skills and experience needed to implement the project. Please provide a linkedin or a github profile to verify your credentials.", "q1r": 3, "q2": "This proposal provided a roadmap with milestones and a time horizon for achievement. \r\nThe proposer also provided key metrics and KPI that define the success of the proposal. \r\nHowever, the proposer did not provide any information for the voters to keep track of their progress. Please provide a medium for the voters to engage and receive updates on your work progress.", "q2r": 3, "assessor": "z_assessor_357", "no_vca": 21, "ne": 3, "ng": 8, "nfo": 10, "vca_o": 1}, {"q0": "It is a great idea to provide both 1. the possibility for SPO to attract new delegators 2. the possibility for delegator to choose an SPO based on more metrics than just APY.\r\n\r\nI agree, that currently the situation is narrow and delegators and SPOs are suffering to its consequences, and this could potentially solve the problem. \r\n\r\nI find the proposal in accordance to the challenge goal.\r\n\r\nRating given 5.\r\n", "q0r": 5, "q1": "The information provided is lacking detail on what are proposers' skills, experience, or optionally team members.\r\n\r\nBased on the information, we can not assess the successful implementation, but some hints in the proposal are suggesting otherwise. (SPO, creating a video, or a test website in 3 months). \r\n\r\nRating given 3. ", "q1r": 3, "q2": "The provided key metrics, roadmap and budget described in a detail provides a sufficient level required for audit.\r\n\r\nNevertheless, one of the targets is to create a video - no costs assigned, and it is followed by \"to start a promotion\" - no costs assigned, therefore this is raising a question of all factors considered and described in the proposal. \r\n\r\nRating given 4. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "The general idea is a good one. I'm not sure how important the educational initiatives there are, because there already thousands of competant SPOs struggling for sufficient delegation to remain sustainable. Other platforms under development, such as stakeboard, have already made substantial progress and will be difficult to compete with. ", "q0r": 3, "q1": "The proposer states 6 months as an SPO as relevant experience. The task at hand requires a variety of skills beyond stakepool management. It will be difficult to gain traction in the segment when other similar projects are much further along and have strong technical teams. ", "q1r": 2, "q2": "The roadmap is combined with definitions for success but these are written in very broad strokes without technical detail regarding the functioning of the platform. ", "q2r": 2, "assessor": "z_assessor_67", "no_vca": 20, "ne": 0, "ng": 11, "nfo": 9, "vca_o": 1}], "solution": "Nossa plataforma de financiamento de multidões pode ser usada para expandir a conveniência e os benefícios tanto para SPOs quanto para os delegados.", "experience": "Durante seis meses como SPO, notei algumas áreas a serem melhoradas, tais como a forma de encontrar piscinas e coletar delegados."}