{"id": 382991, "author": "cole.vt", "title": "Sustainable SPO's Impact & Stories", "url": "https://cardano.ideascale.com/a/dtd/382991-48088", "category": 26246, "amount": 15000, "description": "Não há suficiente participação comunitária generalizada + compartilhamento de histórias sobre OPS no ecossistema Cardano em todo o mundo, encontradas em um só lugar.", "funded": 1, "upvotes": 27484447, "downvotes": 14258478, "votes_result": 13225969, "votes_cast": 108, "f6_no_assessments": 4, "f6_rating": 3.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Um centro que fornece uma imagem coletiva de SPOs de sucesso cria uma oportunidade de trazer inspiração para a vida na mente dos espectadores. Como a cadeia de bloqueio é um conceito estrangeiro para a maior parte do planeta, o objetivo desta proposta de colmatar a lacuna de entendimento através do relato de histórias é sólido, com a capacidade de introduzir SPOs potenciais a formas de engajamento não consideradas anteriormente. As histórias nos movem, e nos ensinam, muito mais do que as instruções ou as plantas. Assumir a tarefa de contar essas histórias tem o potencial de plantar a semente da ação dentro de futuras SPOs, e ajudá-las a ver o caminho mais claramente através da experiência daqueles que já percorreram a distância. Isto também tem o potencial de introduzir as SPOs em relações novas e significativas com os interessados de todos os tipos. Para enfrentar mais diretamente o impacto deste desafio, a equipe proponente precisaria examinar cuidadosamente as OPS envolvidas para ter certeza de que elas estão destacando os grupos que atendem aos critérios-chave do desafio. Todas as categorias estão representadas e destacadas como uma consideração fundamental? Elas estão bem dispersas pelo mundo? Estão devidamente destacadas? Usando a energia verde principalmente? Realmente, a definição deste enfoque levará esta idéia de bom para ótimo.\r\n", "q0r": 4, "q1": "O entusiasmo da equipe proponente é claro a partir de seu projeto. Sua experiência combinada e suas credenciais são bem adequadas para esta tarefa. O orçamento parece irrealista, uma vez que a produção de vídeos curtos normalmente é de US$ 1000, e este grupo pretende produzir 100 histórias com os diferentes SPOs ... haverá custos de viagem, equipamentos, etc? A comunicação parece ser um segundo desafio significativo - como a equipe fará contato com as equipes e terá a certeza de ter um espectro diversificado de SPOs de narração de histórias envolvidas? Dito isto, este projeto é, em última análise, um trabalho de graxa de cotovelo, esforço e resiliência, o que torna provável que duas pessoas tão comprometidas com uma missão perseverem e resolvam estes problemas ao longo do caminho.", "q1r": 3, "q2": "Esta equipe fez um bom trabalho ao pintar o quadro do que é possível através da narração de histórias, e a idéia é sólida. É ótimo ver a continuação do projeto do Fundo6 avançar. Não está claro se o núcleo apresentará principalmente artigos ou vídeos, ou ambos, e como isso será determinado. Isto também influenciará a forma como as mídias sociais e o marketing são projetados. Também serviria a uma visão de longo prazo para entender como a SustainableADA se conectará com os leitores/visitantes à medida que o conteúdo for sendo realizado. Certamente, este projeto é um empreendimento significativo e terá maior impacto em seu alinhamento com o desafio se conseguir uma ampla audiência e aterrissar em frente a potenciais SPOs que serão então encorajados a se envolverem e promoverem a missão. Além de atingir a meta de 100 histórias, o grupo poderia medir o engajamento em seus postos/estórias, dados do site, novo envolvimento de espectadores anteriormente não envolvidos, novos relacionamentos desenvolvidos, etc. Seria forte ter estes critérios determinados a partir do get-go para que o quadro completo do impacto pudesse ser mostrado. Isto pode preencher a lacuna entre ter histórias poderosas e histórias poderosas que estão movendo ativamente uma comunidade.", "q2r": 3, "assessor": "z_assessor_856", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "O problema apresentado é razoável e está dentro do escopo do desafio. A promoção de SPOs Mission Driven SPOs é um aspecto importante da descentralização de Cardano e esta proposta está assumindo esse papel.\n\nO objetivo de produzir conteúdo para 100 SPOs indica um bom impacto potencial no desafio, mas eu gostaria de ver mais informações sobre o tipo de material a ser produzido. A proposta mencionou o objetivo de produzir artigos/videos para 100 Missões Impulsionadas por SPOs, mas acredito que é importante estabelecer com mais detalhes o formato desses artigos, histórias/videos.\n\nTrês métricas relevantes foram definidas, mas a ausência de KPIs/ alvos nestes indicadores torna a avaliação de impacto mais subjetiva. Eu recomendaria a inclusão de KPIs com metas que indicam mais clara e objetivamente o que podemos esperar como resultado.", "q0r": 4, "q1": "A equipe descreveu a experiência e qualificações adequadas para conduzir a proposta com sucesso. A equipe tem parcerias com WADA e AIM, que têm boa reputação na comunidade por seu trabalho no ecossistema Cardano. Há fontes para verificar as informações.\n\nHá uma quebra no orçamento, mas há um ponto que suscita dúvidas sobre a viabilidade da proposta. Foi estabelecido um orçamento de US$ 100 para a produção de conteúdo promocional para cada SPO, mas não é especificado que tipo de artigo/vídeo/stório esperar. Existe uma estimativa de caracteres/palavras por artigo? Há uma estimativa de quantos minutos cada SPO terá em vídeo? Sem esta informação, é mais difícil avaliar a viabilidade do orçamento destinado a esta produção de conteúdo.\n\nMinha impressão é que a proposta se concentrou muito na lógica das OPS e cobriu pouco sobre como será a promoção das OPS, que é o objetivo do desafio, por isso eu recomendaria que se concentrasse mais no plano de criação de conteúdo.\n\nVários passos descritos no roteiro são desenvolvimentos que já foram concluídos e, embora seja importante ver que a equipe já está realizando o trabalho, pouco foi dito sobre o que será entregue como resultado desta proposta no roteiro apresentado, portanto, minha recomendação seria focar mais no desenvolvimento que será o resultado desta proposta. A meta de 250 histórias de SPO não está incluída no orçamento e não ficou claro se será um desenvolvimento futuro que precisará de mais financiamento.", "q1r": 3, "q2": "Há uma relação clara entre o problema, a solução e o desafio, há um bom alinhamento e a proposta aborda bem o objetivo do desafio.\n\nA meta de 100 histórias parece ser uma boa maneira de verificar a auditabilidade, assim como as três métricas descritas, mas eu recomendaria incluir os KPIs com metas, que podem verificar de forma mais objetiva o desempenho das histórias.\n\nNão há clareza sobre o tipo de material que será produzido para as SPO, eu recomendaria que ele fosse estabelecido com mais clareza. Há um prazo definido para a entrega das histórias, no entanto, o roteiro não contém informações suficientes relacionadas aos produtos/milestones relacionados a esta proposta (a maioria dos itens apresentados no roteiro são anteriores a esta proposta).", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposer has done a great job by putting up this detailed and interesting proposal. It addressess the challenge and has the potential of adding value to the ecosystem since the comminity will become much aware of the SPO roles, their sustainability and  how relevant they are in adding value to the cardano network.", "q0r": 4, "q1": "The proposer has a great team with the required experience to execute the project. The proposer has provided enough links that point to team members and their experiences which i think is applaudable. The budget is on point and reasonable to guarantee success.", "q1r": 4, "q2": "The proposer has stated the KPI's, a roadmap and has also described how success will look like when the project is executed. This i think is commendable.", "q2r": 4, "assessor": "z_assessor_799", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The Proposer wants to increase community participation through story sharing from successful SPOs. Their success stories when told within the community will encourage more participation and drive SPOs an stakeholders globally. Very laudable project recommended. The challenge is well addressed. ", "q0r": 5, "q1": "The team is made up of Educators, Economists, NGOs, sustainability experts, video editing experts, writing, Figma, Canva and AdobeCC experts who are capable of delivering. Their plan is detailed and comprehensible, such as, being specific in producing a story / video for \n100sustainable SPOs about their connection with Cardano blockchain and sustainability. They plan to have an article / interview with the major alliances and their members and work their way through the SPO list once funded. With their credentials and plan, the project can successfully be implemented. ", "q1r": 5, "q2": "They mentioned that they will share updates on the project through social media channels like twitter, linkedin, etc for easy auditing. The KPIs are clearly outlined as masuring the amount of community funds in ADA staked to projects, the number of verified unique hosting, etc. Measuring success based on a strongly motivated team willing to reach out to a minimum of 100 SPOs ; the budget breakdown is comprehensive and the timeline of 12 months broken down is also clear for easy auditing. Good proposal recommended.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}], "solution": "Facilitando o aumento da participação significativa com e de SPOs e partes interessadas a nível mundial.", "experience": "Educadores, Economia, Sustentabilidade, Ciências Humanas, Ciências Sociais, ONGs, Empreendedores Sociais, Escritores, Edição de Vídeo, Figma, Canva,AdobeCC"}