{"id": 383191, "author": "nvhieu", "title": "Simplify SPO operations in Vietnam", "url": "https://cardano.ideascale.com/a/dtd/383191-48088", "category": 26246, "amount": 19670, "description": "A maioria dos conjuntos de estacas estão funcionando em provedores de hospedagem comuns (AWS, GCP, Azure). precisamos de uma rede auto-suficiente em vez de ser agora.", "funded": 1, "upvotes": 42251770, "downvotes": 13787296, "votes_result": 28464474, "votes_cast": 150, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta proposta faz um trabalho muito bom ao abordar o desafio breve, que é ajudar na descentralização do pool de operadores da Cardano. Inicialmente, em minha primeira leitura da proposta, pensei que a decisão do proponente de optar por uma solução dupla (a. simplificar a configuração e fornecer guias de estacas & b. fornecer um kit de estacas de energia solar pré-configurado para o mercado) poderia ser exagerada. Entretanto, na verdade, pensando bem, há muito valor em uma abordagem combinada e isso também abre a porta para sinergias que são naturais. Eu diria também que a proposta é bem elaborada em termos de um plano de implementação com a minha impressão geral de que ela proporcionará uma boa relação custo-benefício se for bem implementada. Estou envolvido com o Projeto Catalyst desde o início e tenho sido um CA e vCA. Além disso, montei um Raspberry Pi e o usei (como um não tecnológico), além de ter trabalhado para montar um stakepool durante os dias do ITN em uma máquina Ubuntu (não Raspberry Pi) em casa (infelizmente não a finalizei). Eu provavelmente seria um exemplo de uma pessoa que poderia se beneficiar (se eu fosse vietnamita) de uma proposta deste tipo. Portanto, o que eu poderia ver como um pequeno problema é que a declaração do problema nesta proposta identifica corretamente que \"A execução de estacas em grandes plataformas de nuvens oferece conveniência ... portanto, a maioria das estacas estão funcionando em 3 grandes provedores de nuvens (GCP, AWS, Azure)\". Entretanto, parte da solução oferecida é implantar 1 sistema de pool na nuvem como exemplo, e depois gravar etapas como vídeos. Parece mais lógico implantar o sistema de pool no Raspberry Pi como exemplo (que já faz parte da proposta) ou pelo menos em um servidor físico Linux - a fim de melhor resolver os problemas reais que uma pessoa sem tecnologia enfrentaria. A própria proposta afirma que visa simplificar a configuração para pessoas sem tecnologia, portanto - minha sugestão seria focar na implantação sem nuvens como exemplo, e gravar vídeos deste processo que uma pessoa sem tecnologia com um Raspberry Pi ou computador doméstico poderá aprender mais. Efetivamente, poderia ser uma boa idéia mudar a ordem, portanto, em vez de começar a implementação com \"criar instruções simples, vídeos e configuração, scripts de operação em vietnamita\", que poderiam seguir depois que o kit de estaca de energia solar Bare-metal for criado e estiver operacional. Apenas ENTÃO faça um conjunto abrangente de instruções, vídeo que também abordaria as questões específicas para aquele kit de SPO solar e outras semelhantes, bem como questões gerais de configuração do stakepool. Isto geraria um maior impacto, pois o kit e as instruções estariam perfeitamente alinhados e compatíveis.", "q0r": 4, "q1": "O proponente fez um bom trabalho ao dividir o orçamento em componentes menores e para uma proposta com um horizonte muito bem visível, ele ajuda a visualizar o projeto também. Quando adicionei os componentes do orçamento, os custos totais não somaram da mesma forma que o proponente [(1)+(2)+(3)+(4)+(5)+(6)=750+650+600+350+15820+1500=$19.670] os adicionou. Meu cálculo deu um total diferente, com base na divisão do orçamento que o proponente forneceu. Entretanto, a soma a que cheguei foi de $19.570, o que é um erro de digitação imaterial por parte do proponente. Pode não haver necessidade de uma configuração dupla de um stakepool (em Cloud e em metal nu) se a idéia for promover configurações de SPO sem nuvens - entretanto, o proponente pode ter uma razão válida e eu não estou diminuindo pontos para isso. Eu seria interessante em descobrir se uma estaca de 150 dólares e um stablizer de 100 dólares seria suficiente como reserva para uma estaca de energia solar (ou talvez apenas para o produtor do bloco, não para os relés também?). Se sim, essa seria uma solução surpreendente. Portanto, elogio o proponente por incluir como parte do projeto um componente projetado para calcular o consumo de energia para o Raspberry Pi rodando um stakepool Cardano. A equipe proponente proporcionou grande transparência em termos de suas competências essenciais e esteve envolvida na fundação dos stakepools vietnamitas. Um deles é - de acordo com seu perfil Linkedin - especializado no projeto e fabricação de equipamentos (Python, C#, codevision, Solar LED lights, LED fishing lights) e a partir de 2018 esteve envolvido em pesquisas sobre blockchain e Haskell, com mestrado em eletrônica e engenharia eletrônica. A viabilidade parece ser um descuido. O que eu recomendaria é que a equipe tentasse se colocar na posição de uma pessoa não-técnica, pois eles estão fazendo toda esta proposta para tais \"consumidores\". De fato, seria realmente bom - se esta proposta não passar por este fundo - reapresentá-la com uma adição à equipe. Quem? Uma pessoa não-técnica com baixa familiaridade com Cardanoi. Esta pessoa não tecnológica seria parte integrante da equipe, apontando o que não é compreensível e o que precisa ser explicado melhor. O orçamento poderia ser aumentado de acordo, para cobrir o engajamento da pessoa não técnica (esperançosamente entusiasmada) (mas com uma taxa horária mais baixa) - como uma \"cobaia\" ajudando a garantir que os guias entregues sejam realmente compreensíveis para uma pessoa não técnica. A equipe identificou alguns riscos, tais como dificuldades para a implantação de um pool de estacas de metal nu no Raspberry PI - acho que as possíveis soluções deveriam ter sido analisadas com muito mais detalhes na proposta (e explicadas em mais do que apenas algumas palavras) - pois isto é crucial para o sucesso de um pilar-chave desta proposta.\n", "q1r": 4, "q2": "A equipe deu um roteiro geral muito bom para suas atividades planejadas. As métricas/KPIs parecem estar um pouco inacabadas. Teria sido bom medir o tempo que uma pessoa não-técnica requer para montar o pool final de estacas com 2 relés e 1 BP em Raspberry PI com energia solar - SEM qualquer ajuda do proponente. Isto também ajudaria a identificar pontos de dor antes da proposta de acompanhamento planejada para o próximo fundo - o que levaria à identificação de pelo menos 5 SPOs vietnamitas para participar da implantação. Alguns passos parecem um pouco difíceis de auditar, pois não temos um formato de entrega proposto. Por exemplo, \"Physical Packaging of the stake pool kit\" é uma definição de sucesso após 6 meses. Entretanto, não temos informações sobre o que seria uma \"embalagem física de sucesso\" e o que é uma \"embalagem física sem sucesso\". Ou \"configuração do hardware de redimensionamento\". Fornecer uma construção otimizada de materiais e especificações\" - parece ser um objetivo, mas como isto será fornecido? Um livreto/manual na \"embalagem física\"? Ou algo mais? Como alguém irá auditar estas etapas? Outro exemplo de uma definição de sucesso após 4 meses é: \"Gerenciar um pool de estacas com 2 relés e 1 BP em Raspberry PI usando energia solar\". Minha pergunta é: isto significa alimentá-lo e operá-lo por 5 épocas ou significará operar o stakepool com 2 relés e 1 BP em energia solar por 6 meses (como a proposta pede 3 IPs*6 meses ~ 250 USD)? Seria bom dar um cronograma preciso, para que o sucesso possa ser claramente auditado. Qual a probabilidade de que outra meta de sucesso seja atingida (\"O primeiro bloco é cunhado no conjunto de estacas de energia solar\") após quatro meses? Se soubermos que a cunhagem do bloco depende muito da delegação da estaca e a Fundação Cardano decidir não delegar parte de sua estaca para o novo pool? Usar um incentivo de US$ 1.500 para atrair delegados pode parecer um uso ineficiente dos recursos - e não tenho certeza se realmente funcionaria para substituir uma estaca da Fundação Cardano (então talvez você pudesse fornecer uma descrição de como os US$ 1.500 seriam usados especificamente). Outros produtos da proposta \"Cálculo do Retorno do Investimento\" (16 horas de trabalho) - parecem pouco claros em termos de entrega. A quem será entregue, como será apresentada, em que formato devemos esperar vê-la? Também \"Compartilhar como criar um pool de estacas com energia solar\" - isto parece um pouco vago... mais uma vez ajudaria a auditabilidade e clareza da proposta a especificar que tipo de material será compartilhado, onde, quando e será este componente um guia de vídeo, um documento eletrônico, um breve guia de dez etapas? Se a proposta não for aprovada este fundo, seria bom ser muito específico ao reapresentar a proposta - a fim de proporcionar passos mais claros e auditáveis. Tenho a sensação de que todas estas informações já estão disponíveis na mente da equipe proponente, então o melhor é colocar todo o projeto envolvendo os produtos a serem entregues - em papel. O fato de que a equipe reconhece que pode haver dificuldades para implantar um pool de estacas de metal nu no Raspberry PI - provavelmente significaria que o orçamento deveria refletir os possíveis custos envolvidos na busca de alternativas (há uma reserva para riscos na implantação, mas como foi obtida essa soma de US$ 1.500?) - ou explicar como isso afeta a solução proposta.\n", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "Great Idea and necessary for Vietnam.", "q0r": 5, "q1": "This proposal is so clear and detailed. Member in this team also have experience. I believe that this idea can successful. In other side, I wonder that are you sure that need so more money like above? $1 USD = 23,010 VND, $19670 is so much for one project in Vietnam. Moreover, $70/ hour is too much and did not appropriate.", "q1r": 4, "q2": "The information provided clear and detailed. Have left a lot of personal information to prove the authenticity of the project. The people who carry out the project are experienced, well qualified. I am also a student of Vietnam National University, Ho Chi Minh, although not in the same city, but in the same training place. I know better than anyone to be a lecturer in this environment is very difficult, must be really nice. ", "q2r": 4, "assessor": "z_assessor_756", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "I strongly agree this challenge is critical to achieve Cardano's decentralize mission. \r\n\r\nThe proposal addressed the key concern of of Vietnamese communitive. The more stake pool operates, the more decentralize the network will be. Bringing the renewable energy sources to operate the stake pool also great idea for sustainable development.\r\n\r\nIt would be great if proposer provide more information about how many percent of stake pool in Vietnam as compared with cardano's total stake pool then voters can image how can this proposal can impact to Vietnamese community.", "q0r": 5, "q1": "This proposal is very likely to be successful based on the definition of success set out in the plan. The proposers are currently Stake Pool Operator then they have all the experience in running it. \r\n\r\nThe budget is clear and reasonable for each items. The milestones are realistic and feasible. \r\n\r\nThe only point I would add is a deeper analysis about the solar solutions: ie: the average of energy consumption for each stake pool per month. If it is a big amount then the solar energy can help, bare in mind that the solar panel and battery are also not environment friendly.", "q1r": 5, "q2": "\"The proposal includes a roadmap with targets and a plan extending to June 2022 and the mass adoption will be consider in next fund which show a carefull approach of proposers. \r\n\r\nThe proposal shows detailed steps, milestone and deliverables that will be simple to check if the project is running on schedule. \r\n\r\nOn the material to run SPO in Vietnamese (including the documents as well as the video), i would suggest proposer provide KPIs for the audience reach (ie: subscriber on youtube channel, website visitor increase...)\"", "q2r": 5, "assessor": "z_assessor_819", "no_vca": 17, "ne": 4, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "In my opinion this proposal could improve the stakeholder participations in the Cardano community Stake Pool Operators and the developer work on cardano blockchain.\nThe proposal have the correct mix from building and deploying a new kind of stake pool (bare metal vs cloud), ecological solar power, passion for creating educational contents…\nHowever the objective of the proposal is interesting and it’s good for growth the Vietnamese community, but I think it's important to enrich the proposal with other kind of support for SPOs, because only building a new stake pool doesn’t enough to improve economics for Vietnamese communities.", "q0r": 4, "q1": "The proposer team has very good experience, because they are very well experienced Stake pool operators member. \nThe metrics for the assessment are given, so it’s possible to assess what the proposer wants to do and the success of his actions. Roadmap and milestones are described (date, actions, kpi).", "q1r": 4, "q2": "Roadmap and milestones are basically described. The budget’s information provided is described. There aren’t a lot of KPI to identify the proposal goal, but only deliverables. There are some details how the budget is going to be spent, also I'm trying to discover attachment to deep dive the solution. Futhermore there are basic information to asses.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "Simplificar a configuração e operar guias de estacas para que pessoas sem tecnologia possam fazer. Fornecer aparelhos de estacas solares pré-configurados para o mercado.", "experience": "Somos SPOs, moderadores da Eastern Townhall, especialistas em blockchain tech-savvies, eletrônica e automação."}