{"id": 383433, "author": "felixweber", "title": "Mission& Vision driven SPO Networks", "url": "https://cardano.ideascale.com/a/dtd/383433-48088", "category": 26246, "amount": 10500, "description": "As piscinas montadas para apoiar a construção da comunidade e infraestrutura catalizadora estão subrepresentadas no ecossistema.", "funded": 1, "upvotes": 32072743, "downvotes": 12978015, "votes_result": 19094728, "votes_cast": 157, "f6_no_assessments": 6, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta é uma proposta empolgante na medida em que tanto cria uma solução para o desafio rico em experiências, como promete um plano subsequente cuja aplicação permitirá o crescimento, expansão e aprendizagem em casos futuros. Ela aborda os objetivos do desafio na medida em que envolve entidades menores como SPOs e as une em uma rede de operação de modo que cada entidade individual possa capitalizar a experiência do coletivo e contribuir para ela. Além disso, essas entidades menores podem ser avaliadas por sua adesão às qualificações (missão, uso de energia verde, experiência) no início e sua adesão às melhores práticas para crescer dentro de um ambiente de SPO em rede. Parece que esta abordagem colaborativa poderia erradicar algumas das barreiras de entrada para futuras entidades, particularmente aquelas que são verdes neste campo e aquelas com menos órgãos e recursos para saltar a bordo sem infra-estrutura comunitária. A criação de uma tesouraria específica para a rede também mostra um pensamento de longo prazo em termos de governança e sustentabilidade.", "q0r": 5, "q1": "A muito experiente equipe de proponentes já tem muito a fazer, e está desenvolvendo o primeiro grupo de SPO com uma tesouraria desenvolvida e governada. Há uma mentalidade de base e um compromisso com o desenvolvimento de uma comunidade de apoio e unidade. Como muitas destas entidades já são versadas no aprendizado experimental crônico e na sua disponibilização global, é muito provável que esta equipe seja capaz tanto de navegar no processo de projetar e unir a solução de SPO orientada por Missão e Visão quanto de montar um projeto de vida abrangente, o que seria um presente para futuras organizações e uma realização chave para trazer mais organizações para servir como SPO. O cronograma é minucioso, e o orçamento é altamente detalhado para a alocação dos fundos solicitados.", "q1r": 5, "q2": "A natureza experimental deste projeto permite naturalmente alguma flexibilidade quanto à métrica. O roteiro de 90 dias tem resultados de alto nível previstos para janeiro - março. A confiança da equipe em seu trabalho e sua visão para esta solução se concretiza de forma brilhante nesta proposta. Como esta idéia tem tanto potencial para servir como um poderoso modelo de crescimento, ela contribuiria com alguma robustez para esta proposta de ter potenciais armadilhas antecipadas e soluções/táticas consideradas dentro da seção de viabilidade ou do roteiro. Por exemplo, o recrutamento de futuros grupos comunitários para se engajar na segunda, terceira e quarta redes pode se revelar um desafio significativo. Como isto seria abordado? Como a equipe prevê o marketing da oportunidade para aqueles que são novos ou intimidados pelo prospecto? Uma vez que a rede inicial seja bem sucedida e o processo seja documentado, como a equipe prevê aproveitá-la de forma mais poderosa para a construção da comunidade e infraestrutura catalizadora? Estas são considerações de longo prazo e talvez além do escopo desta proposta, entretanto, refletir sobre estes desafios potenciais poderia ajudar a formar uma corrida inicial mais forte.", "q2r": 4, "assessor": "z_assessor_856", "no_vca": 16, "ne": 9, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal addresses directly the challenge by crating synergies between SPO's and community.", "q0r": 5, "q1": "All information provided, including fully deployed prototype pool network, are easily accessible from the proposals page. The proposal is well edited and well thought through, with easy to follow line of development. The budget for this 3 month operation, is listed in detail and acceptable.\r\n", "q1r": 5, "q2": "The proposer states that, all records of projects, stake pools, delegation, rewards, and treasury disbursements will be tracked and audited. Planned pool network meetings, will be recorded and publicly available.\r\nI strongly agree and rate auditability with the highest score of 5. \r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The idea of SPO community treasuries is a powerful one.  Its easier to see the the connection to rapid funding than to the sustainable operation of stake pools. However in the future this may become more obvious. I think it is important to explore these governance mechanisms. ", "q0r": 4, "q1": "This is basically a proposal for research and documentation on a governance model. The proposers are deeply involved in Catalyst so should have a clear grasp of the task at hand. ", "q1r": 4, "q2": "Some KPIs refer to the Ryuuki project, so there is definitely some overlap here. It may be difficult to separate the two proposals when auditing. The other KPIs refer to the production of documentation and are not very specific as to form, quantity, or dissemination/marketing. ", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to create a network that will document the journey of SPOs from scratch to prominence. They stated that the impact is to help fund community project aside catalyst funding; run an experiment in mutual support and management of a community treasury. The challenge has been addressed effectively as I read the proposal.", "q0r": 4, "q1": "The team is made up of experts engaged in catalyst community project, SPOs, catalyst circle members, funded proposers, community advisors and mentors who will be able to successfully implement the proposal. The detailed plan outlined in the proposal, among others, will launch a prototype network of community stake pools; support the creation and oversight of grassroots treasury; explore and document the concept ; great SPO network that will form and further decentralize the Cardano network. All these facts can lead to a successful implementation of the proposal .", "q1r": 4, "q2": "The road map of the work to be done is clearly stated as from January to March 2022 with details outlined in the proposal. The budget is well broken down and will make auditing very effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal supports the greatest challenge that the Cardano community is facing in the next five years, namely the ability to self-govern and successfully manage the wealth that they together create and share. ", "q0r": 5, "q1": "The proposal is driven by highly experienced and respected community leaders who have dedicated their lives to this mission. While the challenge is enormous, and nobody managed to accomplish it before, these trailblazers are dedicated and willing to experiment and work hard with the engagement of the community to forge a path to a new \"societal operating system\" that supportive of human flourishing.", "q1r": 5, "q2": "Everything will be open sourced and accessible by the community, including in form of an accessible playbook.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Creating a network for SPOs is an innovational idea. It \r\n helps to overcome the disadvantage of large organizations'  pools which is lower level of intention/care for one particular ADA pool (as they have many pools for different coins). Though, it is unclear to me about whether 100% of the SPOs joining the network have to be committed to the Community Network Treasury, or there is a choice for them to not join in the Treasury (meaning that they can autonomically use their rewards while being part of the network). Overall, this idea can be scaled-up to address other challenges in the future.", "q0r": 4, "q1": "Given that a prototype pool network is already up and running, it can be implied that there is a high possibility that this project can be put into action. The proposers have done a great job as the budget plan is clearly stated in the proposal, however, there is a lack of information about the team members. Additionally, given that this project would help fund community projects outside of Catalyst funding rounds, so would this mean that the team have to do a whole assessing stage just like Catalyst do? That point should be put into consideration in order to utilize the effort.", "q1r": 4, "q2": "By using existing tools like Github, it can be easy for outsiders to audit both the project and the network itself. So the proposers have done a good job on assuring clarity.", "q2r": 5, "assessor": "z_assessor_936", "no_vca": 18, "ne": 3, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Criar uma rede inovadora de SPO focada em Catalisadores, trabalhar com construtores Catalisadores proeminentes e documentar sua jornada de SPO.", "experience": "Assembléia de Projetos Comunitários Catalisadores estabelecidos e engajados, SPOs, Membros do Círculo Catalisador, Proponentes Financiados, Assessores e Mentores Comunitários"}