{"id": 385059, "author": "abehazbunjr", "title": "Surface Abstraction Encoding", "url": "https://cardano.ideascale.com/a/dtd/385059-48088", "category": 26247, "amount": 65000, "description": "Las falsificaciones de arte en el mundo real son difíciles de discernir, al igual que la verificación de la propiedad mediante fichas.", "funded": 0, "upvotes": 16855113, "downvotes": 17255392, "votes_result": 400279, "votes_cast": 121, "f6_no_assessments": 8, "f6_rating": 1.375, "videos": [], "media": [], "f6_assessments": [{"q0": "Unfortunately the proposal has no plan, only a description and a promise to submit a plan. The proposer obviously ran out of time to finish the proposal. This should be withdrawn and not shown to voters.", "q0r": 1, "q1": "Unfortunately the proposal has no plan, only a description and a promise to submit a plan. The proposer obviously ran out of time to finish the proposal. This should be withdrawn and not shown to voters.", "q1r": 1, "q2": "Unfortunately the proposal has no plan, only a description and a promise to submit a plan. The proposer obviously ran out of time to finish the proposal. This should be withdrawn and not shown to voters.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 36, "ne": 0, "ng": 24, "nfo": 12, "vca_o": 1}, {"q0": "Digital art in the form of NFTs are obviously secured by the blockchain. Real-world art, however, is not. This proposal proposes AI-verifiable NFTs through scanning objects and transferring the scans on the blockchain in the form of a token (read NFT), which by my knowledge does not exist yet. \r\nThe need for such a system is limited to physical objects like paintings and sculptures and such. It can not be implemented for music or text unless they are physical manuscripts. So great idea, limited impact. \r\n", "q0r": 3, "q1": "The detailed plan has not been published by the end of the deadline for proposers. So at this point, there can't be made an assessment that does honor to this idea. Perhaps next fund it can be worked out more. Nonetheless, it is our task as CA to assess any proposal that has been filed and the only variables in terms of feasibility that are present are the requested funds, which cannot be assessed due to lack of a plan and the relevant experience which is a claim without anything to back it up. It needs some work in writing out what you're trying to do. ", "q1r": 1, "q2": "There isn't much information in terms of auditability. The github-repository hasn't been updated since August, which doesn't really give much confidence in activity. To turn this idea into a project it needs some organisation. It needs a roadmap, KPI, budget breakdown, etc… \r\nit's not bad, but it does need some work. Good luck!", "q2r": 1, "assessor": "z_assessor_113", "no_vca": 25, "ne": 2, "ng": 23, "nfo": 0, "vca_o": 1}, {"q0": "Draft proposal of only 52 words requesting $65k.\r\nThe proposer posted many proposals of which 5 are in the same state of unwithdrawn draft.\r\nSo my assessment of these proposals will be very similar. The proposer should have withdrawn these proposal to save time to the voters and to the community advisors.", "q0r": 1, "q1": "Draft proposal. A link to a GitHub account is given but almost nothing else. We also know that the proposer is a Plutus pioneer.\r\nLike in his 5 other draft proposals, the proposer completed the questionnaire telling the required information was provided while it is not the case.\r\n", "q1r": 1, "q2": "52 words cannot provide enough information for any Catalyst proposal.\r\nIt is written in the proposal that a plan was to be provided by the end of the week on 2021-11-28 but ultimately was not.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 20, "ne": 0, "ng": 14, "nfo": 6, "vca_o": 1}, {"q0": "Securing ownership of physical art by digitalizing it with pattern-matching AI and turning it into an NFT (I presume) certainly fits in the challenge. This would benefit all artists around the globe. It could even be used as ownership of your car or bike. ", "q0r": 4, "q1": "It saddens me to see that the plan has not been completely submitted. The proposer probably forgot to implement all the details. This could've been a great proposal is explained how the proposer plans on implementing it. I would certainly suggest proposing this again in a later fund. ", "q1r": 1, "q2": "As stated above the plan was not submitted. This makes it hard for us to assess this. Nonetheless, we do get a GitHub page where there might be a hint at the proposal. Unfortunately, we do not get any hints to this proposal. The proposal certainly has potential we just need more information on it.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 21, "ne": 0, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been voting since Fund 4 and have experience analyzing business requirements from 7 years of delivering software as a QA engineer.\r\nWhile I agree that counterfeits of real world art are sometimes difficult to discern, I'm not sure about what you mean when you say that tokenized ownership verification is as well. What's easier than verifying a digital signature of an NFT (which is what tokenized ownership makes me think of)? \r\nI have to say that as a layman, this problem statement and the solution to it simply confuse me too much.  Perhaps it would be better if these concepts were expanded on in a more detailed manner later in the proposal, but unfortunately, that is not the case here.\r\nThe proposal suggests the usage of AI in its solution, so it probably fits in this challenge, but due to the problems outlined above and the lack of any type of KPI or concrete goal, I have to strongly disagree that this proposal effectively addresses the challenge.", "q0r": 1, "q1": "One of the proposers mentions that he is a Plutus student and the notes on the provided github do reflect this, but there does not seem to be much other activity there, especially in the fast few months. Aside from this, two years of Cardano experience are mentioned - this is too vague in my opinion. Try to detail what exactly you have done in the ecosystem in the future. Lastly, 14 years of experience of web analytics and managing large technical projects are mentioned, but no references are provided to verify this. It's a good idea to try to add at least a Linkedin page to back you up. It would also be useful if we had information about the other proposer here.\r\nI strongly disagree that this proposal can be implemented successfully, due to the lack of information on the team who would work on this, no details on how the budget would be used, no risk analysis and no plan outlining the technical approach and the usage of resources concretely. As the proposers mentioned, the full plan was due at the end of November, but it does not seem to have made it unfortunately.\r\n", "q1r": 1, "q2": "There are no KPI's or a roadmap, due to the proposal being unfinished, so I strongly disagree that this proposal is auditable.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 22, "ne": 4, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "Great idea but it would be good to explain and present the problem a bit more and how to solve it. If this idea were elaborated in more detail, it would have a positive impact on the Cardano ecosystem. It would be good to work out how this idea would add value to the Cardano and Catlyst ecosystem. Every great idea, including this one, should have precisely elaborated KPIs. As KPIs are missing it is not possible to match the ones indicated in the challenge. This proposal in no way is able to scale and address future challenges.", "q0r": 1, "q1": "The more transparent each project is, the greater the chance that it will be funded. It would be good to put in the proposer more information about the bearer of the idea, knowledge, skills, experience needed to realize this idea. Maybe via LinkedIn or Github? The budget is clearly presented but it's not presented on what and how it will be distributed. As we do not have a clear insight into the budget allocation, the amount requested sounds unreasonable. In order to turn an idea into a project, it is necessary to have: detailed implementable plan, details of actionable tasks, realistic timetable to complete the work, necessary resources and technical aspects such as architecture, language and technologies needed to realize the project. And of course in the end we need to cover the possible risks.", "q1r": 1, "q2": "I would love to see this idea take professional form in the next Catalyst. For that, it will be necessary to prepare a detailed roadmap with milestones and a time horizon for achievement + missing KPIs as well as most of the information in this proposal. Unfortunately, due to lack of data, the community cannot track this idea.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 21, "ne": 3, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "This proposal focuses on abstractive encoding scans real-world objects into tokenized ownership with mathematical proofs assisted by pattern-matching AI. Because this proposal is not completed [since there is no roadmap, KPIs/metrics, and budget breakdown,...], the solution is still very abstract, not a clear impact on the Cardano ecosystem as a whole. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "The proposer's profile is briefly described as a full-time Plutus student with two years of Cardano experience and 14 years of web analytics and managing large technical projects, this is suitable for this kind of idea, with a GitHub link for verification. However, a detailed plan is not provided, therefore, there is no proof of feasibility. Based on the given information, I disagree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "This is an incomplete proposal [since there is no roadmap, KPIs/metrics, and budget breakdown,...] where auditability/transparency can't be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "Not a bad idea in our era. We all know that counterfeiting of works of art is not new in the world. And judging the quality of a work of art is also very difficult for experts. The use of AI to assess quality dates back to when people wrote algorithms to win intellectual property rights. I hope you will have a more specific solution so that we can build a catalyst community on this in the future.", "q0r": 3, "q1": "I hope you can introduce more about your profile as well as your achievements. Also if you have a team to build the project we would love to know more. Currently I think you should have a more detailed plan and roadmap for this project like in the short term how will you research or build community? What is the long-term goal to be achieved and how to standardize it. Good luck.", "q1r": 1, "q2": "I can see the amount of capital you call for up to 65000$, which is not a small amount. So what are you going to do with this money? What are the KPIs you set, detailing the ways in which you spend money on your project. thank you", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 16, "ne": 0, "ng": 13, "nfo": 3, "vca_o": 1}], "solution": "La codificación abstractiva escanea objetos del mundo real en propiedad tokenizada con pruebas matemáticas asistidas por IA de coincidencia de patrones.", "experience": "Soy un estudiante de Plutus a tiempo completo con dos años de experiencia en Cardano y 14 años de analítica web y gestión de grandes proyectos técnicos."}