{"id": 382480, "author": "huths0lo", "title": "Video content for CNFTHub.io", "url": "https://cardano.ideascale.com/a/dtd/382480-48088", "category": 26244, "amount": 6000, "description": "カルダノの偏った情報を得る方法は限られています。", "funded": 0, "upvotes": 15788662, "downvotes": 18638628, "votes_result": 2849966, "votes_cast": 96, "f6_no_assessments": 4, "f6_rating": 2.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims to create video content for the CNFThub.io. The problem statement is a little bit vague in its description, stating that there are limited options for unbiased information about Cardano. Here it would be massively helpful to rephrase the problem statement to make it more focused (not everyone speaks English, there is political bias, eco-chamber etc). The solution could also be presented in a slightly more tangible way. The solution states \"add video content to CNFThub.io\", but it is unclear why that would solve the problem. The proposal states further down in the detailed plan the importance of the hub as an information channel, and that many people don't have English as a first language. Focusing on those points would make the proposal address the challenge a lot better, in my opinion. The proposal does underline the hub as a way of getting new users introduced to Cardano, and inviting new members for discussions about Cardano and Blockchain technology which does align with the challenge briefing. Due to the abstract nature of how the problem statement and solution is presented, I disagree that the proposal effectively addresses the challenge. ", "q0r": 2, "q1": "The core team members for the proposal seems to be quite active as proposers in the Catalyst community. Here it would be very helpful if the proposal featured a further presentation about the team members and their expertise on the subject. The funding for the proposal is meant to go to hiring a professional video content creator, but the managing team is still very important to ensure the feasibility and organization of the project. Maybe a short presentation with some links that can verify each members activities and expertise related to the proposal? \u2028It would also be beneficial for the proposal if the budget breakdown featured an estimate of the working hours (for the one video per week for three months) of the video content creator. Is it 10 hours per week to create a video, or 20? What is the extent for creating these videos? Is it just to record and edit these discussions held with the community, or more information-like videos? Both variations are mentioned in the proposal, and in my experience of video editing it would be a substantial difference in workload between the two. It is mentioned that the remaining funds will be used for translation purposes, will these translators be hired from the community, or professional ones? Given that the proposal does feature what the project aims to do with the funding, it provides us with some information. But in order to make this proposal more feasible and credible, it would in my opinion require more detailed information, as explained above.", "q1r": 2, "q2": "There is an explanation of clear deliverables and success metrics within the proposal in the form of viewers and number of produced videos. The level of transparency is set to the limit of what is shown to the community/public. I would have liked to see a more detailed explanation of what problems or challenges that the team would face while developing this project. Is funding and the language barrier the only challenging aspect, and is funding the only solution? Here it would be very nice to have a little text about how these videos would be in detail, who are they aimed at and how will they be presented? Where will they be presented apart from Youtube? How many of the community members will have access to it, through which channels? Basically, how available will it be, and how does the team plan to make it as available as possible? In its simplicity, I believe that the project will provide some clarity, even though it could be more transparent and clear. Overall, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 20, "ne": 10, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The problem being availability of less options for unbiased ADA information. The proposer wants to add video content about everything happening in cardano ecosystem every week for 3 months. these video will also be available in spanish as well but this seems like a short term solution for the problem hence the proposal somewhat addresses the issue", "q0r": 3, "q1": "Based on the details provided on the proposal the proposer has enough experience to execute the proposal. The proposer will be hiring a video content creator and creating a unbiased content regarding cardano updates in English and Spanish as well. based on the plan presented it's highly likely this proposal will be implemented successfully but this would be a short term solution \r\n\r\n", "q1r": 4, "q2": "In proposal the proposer has given a rough budget breakdown and Hasn't provided a complete timeline. As mentioned in the proposal based on weekly video releases the progress and success of the proposal can be tracked.", "q2r": 3, "assessor": "z_assessor_419", "no_vca": 20, "ne": 2, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "This is a small proposal to ask for money to make videos from English to videos in some non-English speaking countries. This provides better access to content on the proposer's NFT website. However, a clearer strategy is needed in how to communicate with these content to ensure more people access the content.", "q0r": 2, "q1": "Proposal has experience in making content in English. And they only transfer content from English to other languages. Therefore, the proposal is highly feasible.", "q1r": 4, "q2": "It is quite easy to follow the content of these videos on the proposer's NFT website. I checked the content on it.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 17, "ne": 0, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "This proposal wants to create videos content for CNFTHub.io with no intention to moderate/ hold events/ facilitate users as a hub. Furthermore, I can't find any reference for the problem statement that our community lacks unbiased information about Cardano.", "q0r": 2, "q1": "I strongly disagree that this proposal will be implemented successfully because I can't find information about the proposers or the team, timeline, broken down budget, resources, challenge and risks. I think this proposal is not written completely.  ", "q1r": 1, "q2": "This proposal doesn't provide me sufficient information to audit its progress and success. Since it has no roadmap, milestones, key metrics to success and KPIs. ", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "CNFTHub.ioにビデオコンテンツを追加する", "experience": "cNFTプロジェクトのクリエーター。  CNFTHub.ioのオーナー/オペレーター。  各オーナーのIT経験は25年。"}