{"id": 383411, "author": "volibra", "title": "P2P:Trade Cardano tokens with Cash", "url": "https://cardano.ideascale.com/a/dtd/383411-48088", "category": 26243, "amount": 50000, "description": "¿Cómo podemos aumentar la adopción y el comercio de tokens de Cardano en África cuando el 90% de las transacciones se realizan en efectivo?", "funded": 2, "upvotes": 168758501, "downvotes": 2456039, "votes_result": 166302462, "votes_cast": 579, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Proposal identifies the problem of getting access to Cardano tokens in certain countries with Fiat because of regulations/restrictions. They will ad value to the Cardano ecosystem by giving more people access to the Cardano token. The key metrics of this project is in line with the Challenge as it is connecting more users to the Cardano blockchain. The project is able to scale well as this is a necessity in some countries. ", "q0r": 5, "q1": "Relevant skills and team is provided and proven via Github/LinkedIn pages. The budget is reasonable and broken down into identifiable items. The launch date is Q2 2022 which is very reasonable. They explain in great detail how the product will work but they don't explain the technical side of it. Like what is being used to build the frontend and backend of the application. Providing this info will show your technical approach and boost voter confidence in your skills. They consider the risk of identity and address it by implementing a reputation smart contract to track bad actors. In the future they will make use of Atala prism. ", "q1r": 4, "q2": "The roadmap they provided goes beyond the launch date to show an extra milestone of desired achievements. The KPIs they provided are measurable which makes it easy to track the progress and performance of this project. They identify the problem of access to the Cardano token in some countries and they solve this by building a peer to peer exchange where Africans can buy or sell Cardano Blockchain tokens with Local Fiat Currencies", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 25, "ne": 5, "ng": 20, "nfo": 0, "vca_o": 1}, {"q0": "This proposal able to identifies the problem, and able to explain their solution to this problem. Africa is a continent consist of developing nations, and recently have seen an increase in economic growth and activity across the continent. Crypto trading have become one of them, and it's growing rapidly. However the government are still somewhat blocking these activity (trading for crypto), and left the majority of people with cash cannot exchange their money for crypto through a bank. This is where the proposer provide a solution by building Cardano peer-to-peer exchange where people within a country and region can trade, and transactions can be done easily through cash or through mobile money which attracts less charges compared to banking transactions. This will increase Cardano adoption and allow people to buy and sell tokens in Cardano. Overall, the proposer able provide a solution and problem identification clearly, with data and reference links.", "q0r": 5, "q1": "The team, Volibra, is proven to have experience needed for this project (creating a peer-to-peer exchange platform using smart-contract for escrow), by checking on their Linkedin profile and Github. The team able to explain how to implement this platform, such as explaining how the escrow script work, following CIP standard for Dapp connector, etc. The budget is broken down into details with salary, work hours, contract audit, and resources needed. This proposal have identify the challenge risk, such as how to make a secure P2P because the lack of trusted ID data (and even planning to develop DID Atala PRISM solution in the future). All in all, everything that is needed to make this proposal a success is already laid out and explained clearly in this proposal, from roadmap, KPIs, and technical details. ", "q1r": 5, "q2": "This proposal have laid out the roadmap clearly, complete with KPIs and milestone for each month. They have a clear and understandable solution for the problem, and a clear success metrics into categories (user base, functionality, and usability). The auditor can track their progress from their platform development and their smart-contract on the blockchain. Overall, a well written proposal with feasibility of being audited.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal correctly identifies a problem within the challenge and provides a solution that will bring value to the ecosystem as a whole if executed succesfully.", "q0r": 5, "q1": "The team is clearly outlined with requisite links to LinkedIn provided. The funds requested are broken down accurately and the timeline is feasible. Due to the large amount requested a deep dive into potential challenges and pitfalls would be beneficial for the project.", "q1r": 4, "q2": "The roadmap and KPIs are clearly defined and the path from problem to solution is clearly outlined and definfed.", "q2r": 5, "assessor": "z_assessor_745", "no_vca": 19, "ne": 1, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "The proposal focuses on the problem about Cash payment, specifically in Africa. The solution is a P2P Exchange where local can buy Cardano tokens with local Fiat with a Hybrid CEX model. It is also questionable on the local authorities on KYC as the problem stated at first sight about regulatory issue. However, the solution also use the ESCROW Protocol to choose the \"rightful transactors\"", "q0r": 4, "q1": "Team is really well published with the credible expertise and experience in the industry. Both for Plutus and Full-stake software engenieer team. A first scan at the github and Linkedin of the team Volibra shows credential and real works already started before the team got funded. They also resbumit the proposal from Fund6", "q1r": 5, "q2": "The budget and milestones with KPI are very well presented and transparent in the next 12 months. The amount of the budget is really huge 20% of total challenge. However, it is a worthy proposal with clear implementation plan. A small note on the auditability part which consumes 6k, which is remarkable high compare to total budget spending of this project.", "q2r": 4, "assessor": "z_assessor_782", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Un intercambio Peer to Peer en el que los africanos pueden comprar o vender tokens de Cardano Blockchain con monedas fiat locales", "experience": "Equipo de 2 desarrolladores de Plutus, 2 desarrolladores de software y 1 consultores de auditoría contratados que trabajan en algunos de los nuevos proyectos innovadores de Cardano - JPG.store"}