{"id": 384443, "author": "ben.mesnik", "title": "Browser tool- How to use DeFi dApps", "url": "https://cardano.ideascale.com/a/dtd/384443-48088", "category": 26243, "amount": 49800, "description": "DeFi es difícil de usar y entender. Es un nuevo paradigma que requiere conocer cómo funcionan los componentes de DeFi y los errores pueden ser costosos.", "funded": 2, "upvotes": 68022355, "downvotes": 5717702, "votes_result": 62304653, "votes_cast": 159, "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "El problema y la solución descritos tienen sentido y están dentro del ámbito del reto. Para que una dapp DeFi sea funcional y útil, necesita una buena UI (interfaz de usuario) y esta propuesta busca mejorar esta experiencia, aportando una herramienta que pueda mejorar el uso de las dapps.\n\nAunque el concepto es prometedor, no está claro cómo se integraría esta herramienta de \"amigos\" en las dapps. Cada dapp tiene su propia interfaz y concepto, por lo que una herramienta \"buddy/wizard\" debe ser pensada individualmente para que sea apropiada para cada dapp.\n\nSe incluyeron métricas relevantes, que permitirían cuantificar los consejos para las dapps a los 3 y 6 meses y que ayudan a entender el impacto positivo en el reto, pero no está claro cómo se evaluarán estos consejos en términos de calidad. Cualquier dapp financiera necesita rigor con las propinas para los usuarios, y aunque se especifica que las propinas serán auditadas, no está claro qué significa exactamente esta auditoría. ¿Quién auditará esto? ¿Habrá una colaboración con los desarrolladores de las dapps?\n\nRecomendaría incluir más indicadores/KPIs que puedan indicar el impacto potencial del reto.", "q0r": 3, "q1": "El proponente describió experiencias que pueden ser relevantes para el desarrollo de esta propuesta, pero no hay fuentes o enlaces que permitan evaluar sus calificaciones. Recomendaría añadir enlaces a Linkedin y repositorios para que la comunidad pueda comprobar la experiencia/cualificación del proponente. ¿Participa en Plutus Pioneer? ¿Qué cohorte? ¿Ha completado el programa?\n\nEl presupuesto presentado parece razonable y realista, las tarifas horarias están dentro de los precios de referencia del mercado, pero la carga de trabajo presentada es difícil de evaluar ya que no hay un gran detalle técnico respecto al desarrollo de la extensión.\n\nEl importe del presupuesto establecido para la traducción no me parece sólido ya que no hay una estimación de caracteres o palabras a traducir, por lo que no hay forma de indicar si el presupuesto de traducción es adecuado o no.\n\nHay un calendario realista para el desarrollo del proyecto, sin embargo hay poca información sobre cómo funcionará la extensión. Cada dapp tiene una interfaz diferente, por lo que la extensión debe ser personalizada y esto crea una gran dependencia del proyecto en los desarrolladores de dapp.\n\nCreo que esta propuesta tiene un concepto interesante que puede ser aprovechado, pero necesita más aclaraciones sobre cómo se integrarán los consejos con cada dapp. La viabilidad del proyecto depende de la complejidad de la integración con cada dapp, por lo que este punto es una gran incógnita.", "q1r": 3, "q2": "Hay claridad en el problema y cómo se relaciona con el desafío, pero la solución necesita más detalles, principalmente en cómo se personalizará cada tutorial para cada dapp y si esto es factible.\n\nLas métricas definidas son indicadores aceptables para evaluar la cantidad de consejos, pero son indicadores de baja calidad. Recomendaría incluir KPIs/métricas que permitan evaluar el desempeño de los tips. Por ejemplo, un simple botón que permita al usuario decir si el tip fue útil o no. ¿Cómo se evaluará la seguridad de la extensión? Si un usuario pierde fondos debido a un consejo inapropiado, ¿cómo se contabilizará?\n\nHay una hoja de ruta con entregables razonables, lo que ayuda a la auditabilidad.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 21, "ne": 12, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposal satisfies none of the \"Key Metrics\" of this challenge. If we apply a strict reading of the challenge, there's not a lot room for ancillary DeFi resources that's not actual DApps. With that being said, quality education is key maintaining \"daily active\" and other ongoing user driven metrics after novelty wears off. In this sense, this proposal effectively addresses the challenge.", "q0r": 4, "q1": "It is clear that Sir Ben has the technical and leader skills to execute. What is not clear is Ben's chops as an education. It would be helpful for the community to know about who is going to being these videos as well more details about proposal thinking around the community curation of tips.", "q1r": 4, "q2": "The metrics are clear and easy to audit. The community should have no problem tracking whether or not there's 100 tips within 3 months or that there are  tips for 10+ projects. What isn't clear again is how the community might go about verifying that tips are audited before addition to the Tip Genius knowledge base. ", "q2r": 4, "assessor": "z_assessor_336", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The idea is great and could improve the usability of Defi d'Apps. However, I am not sure re the alignment to the challenge. The challenge focuses more on new Defi d'Apps than improving user experience and usability, which are important but maybe aligned better with other challenges. In addition, to show impact on Cardano ecosystem at this point you could have add also list of DeFi d'Apps that you can work with and give some specific use case examples. ", "q0r": 3, "q1": "While the proposer seems to have a great background and was part of plutus pioneer program there are no links to support it. The website tipgenius.info is offline and Linkedin profile would have been helpful. Again it will be helpful to have a list of DeFi projects they would like to support, discuss with the project potential partnership and maybe focus on this proposal on a first pilot use case. The roadmap is clear, but having the 3month break down will be recommended to be more clear on deliverables. Great to have a 12 months scope of KPIs and deliverables. The budget is well detailed. Good to have some risks and challenges although could be great to add how to mitigate it as well. ", "q1r": 3, "q2": "KPIs and deliverables are clear and could be audited. Could be good to add some KPIs on how the tips improve the usability of the DeFi app. Also for better audibility, especially in the first 3 month, it could be good to break down KPIs and deliverables on a monthly basis.   ", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 23, "ne": 2, "ng": 21, "nfo": 0, "vca_o": 1}, {"q0": "The proposer want to launch a video that will pop up on a browser extension that will explain how to use specific Defi dApps when interacting with them. ", "q0r": 3, "q1": "The proposer is the founder of Tip Genius, and a Plutus pioneer developer, and is capable of successfully implementing the project. The plan mentioned that they will educate people on how to interact with the Apps; translate tips to 6 total languages and then release Apps. All these facts will lead to successful implementation of the proposal.", "q1r": 4, "q2": "The road map is clear stating 3 , 6 and 12 months scheduled work with details. The budget is broken down in details to make auditing easy.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 25, "ne": 1, "ng": 14, "nfo": 10, "vca_o": 1}], "solution": "Consejos educativos integrados a través de una extensión de navegador emergente que explican cómo utilizar determinadas dApps de DeFi a medida que se interactúa con ellas", "experience": "Fundador de Tip Genius, un entrenador de videojuegos automatizado que muestra breves consejos en vídeo a través de una superposición en directo mientras juegas\nPionero y desarrollador de Plutus"}