{"id": 366912, "author": "", "title": "Catalyst Video Series w/Kaizen", "url": "https://cardano.ideascale.com/a/dtd/366912-48088", "category": 26106, "amount": 15500, "description": "Catalyst has hundreds of proposals being submitted and the average person lacks a simple way to understand the mission behind each project.", "f6_no_assessments": 6, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "it will add value to the cardano ecosystem. the problem is defined precisely and is easy to understand for the layman. with the existing experience, the explanation is well described. the reach is global. the costs for subsequent projects are not mentioned, but can be estimated thanks to the detailed data.", "q0r": 5, "q1": "the existing reach of the channel makes the project very likely to succeed. the existing experience is appropriate for the project. schedule and budget are broken down into understandable parts.", "q1r": 5, "q2": "the community can check the progress of the project through the existing youtube channel. delivery dates are clearly defined with 1 video per week. possible risks are not in the propsal, but have been considered through the existing experience.", "q2r": 5, "assessor": "z_assessor_260", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "While KeizenCrypto is a known youtube channel, I don't think this proposal effectively addresses the challenge. There are already more than 3 videos that teach how to participate in Catalyst. Also these particular topics \"- how to register - how to vote - how to submit a proposal\" are very simple. I would suggest you come up with better topics. And \"- 7 videos that showcase ideas proposed by the community\" - which ideas do you mean? Just 7 proposals? How you will choose them? Will it be proposals made by you or your friends & colleagues? ", "q0r": 2, "q1": "While there are no doubts that the proposer is a professional youtuber, the budget is high (more than $1500 per video) and it doesn't look that these videos will encourage bigger participation in Catalyst.", "q1r": 2, "q2": "No metrics are presented which will make it possible to audit the outcome of those videos.  ", "q2r": 1, "assessor": "z_assessor_328", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal effectively encourages meaningful participation in Project Catalyst for the next two funds through video content designed to engage the viewer at multiple levels. There is a balance struck here between content generation that will drive participation in registration, voting, and proposal submission as well as content that will bring more awareness to projects in a particular fund. ", "q0r": 5, "q1": "There is a high likelihood that this proposal will be implemented successfully because the Youtube channel has been making videos about Cardano for over two years totaling nearly 330 videos and has amassed over twenty-four thousand subscribers. The content is of high quality and suggests that future content will be as well. ", "q1r": 5, "q2": "There are ten videos that are promised and there is a goodwill statement declaring that planning began '...with the submission of the proposal.\" A total of two months will pass before all content is delivered but there will be opportunities for Kaizen to update us on his progress after each video he finishes. There was no specific date(s) mentioning when or how the content will be released, whether as each one is completed or after all are complete. But given the experience of the proposer, this is of no concern. ", "q2r": 5, "assessor": "z_assessor_364", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "Creating youtube videos to educate the community is a great way to tackle this challenge. This will allow existing catalyst community members to have a better grasp of the catalyst program in general. People need to understand how to be an effective CA and  provide better proposals. So the challenge has been effectively addressed by this proposal.", "q0r": 5, "q1": "This proposer has 4 years experience participating in the cardano community. He also managed a successful youtube channel.With his experiences, this propoper can easily implement the plan he provided.", "q1r": 5, "q2": "The proposal is filled with details about a detailed budget and a reasonable timeframe for a good execution of the plan.\r\nThe community can track the progress of this proposal within 2 month by checking out the youtube channel.\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "I like the quality of videos recorded, and it would be definitely a good idea to have guides on the topics described in the proposal, yet, the risk I see and the reason why I put 4 stars, is that it will be very hard to point out among the content uploaded daily.\r\n\r\nBut overall - the speech and video are in a pretty decent format. ", "q0r": 4, "q1": "watched video, I consider it as sufficient for implementation. ", "q1r": 5, "q2": "metrics of progress = videos posted\r\nmetric of success = views, likes, interactions\r\n\r\nhard to predict how many new people was onboarded", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "I think this is a marvelous idea, there are many technical projects that oftent times might get less attention but are very helpful to the Cardano ecosystem and could be left out of the spotlight without proper engagement and support. An educational side for catalyst would improve this gap in the system.", "q0r": 5, "q1": "Hard to know the level of expertise that the proposer can show other entry level individuals into Catalyst. Perhaps a breakdown of what type of content is going to be created as an example of the challenge. How to vote, submit proposal and such is a great start, but perhaps understanding the technology and the different topics like DAO, DEFI, Dapps, smart contracts and how it works could also influence.", "q1r": 4, "q2": "For the purposes of the project scope and solutions, there is a great breakdown of the funds, stages of development and kpis illustrated. More clarity on how each specific topic will be delivered and what time frame could polish its auditability.", "q2r": 4, "assessor": "z_assessor_594", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Create educational content to onboard new members to Catalyst with how to videos & provide a platform for participants to share their ideas.", "experience": "Cardano Ambassador, Kaizen Crypto Youtube Channel Owner, Stakepool Operator, KaizenNFT Owner\n\n4 active years within Cardano community"}