{"id": 367120, "author": "", "title": "In-Wallet Onboarding for ADAholders", "url": "https://cardano.ideascale.com/a/dtd/367120-48088", "category": 26106, "amount": 21000, "description": "Current wallet software separates utility and education, creating a barrier for people to enter and to trust the crypto space and Cardano.", "f6_no_assessments": 2, "f6_rating": 5.0, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=19389"], "media": [], "f6_assessments": [{"q0": "This proposal targets not only increased adoption and easy of use for new Catalyst users, but the use of integral functions in the Cardano ecosystem as a whole. Having a guide through the onboarding process of creating a wallet, staking and voting etc would be incredibly beneficial in regards to adoption. The users wouldn't have to learn from separate online resources or guides, since they would be incorporated inside of the wallet app, making the process much smoother. And once they are introduced to the voting process and project Catalyst, there is a good possibility that it affects the number of proposers, voters and advisors in a positive way. Inviting trusted wallets that support Cardano to cooperate is also a great way to further increase the trustworthiness and adoption rate for the product, it affects many parts of the community. \r\nThe problem statement and solution are crystal clear, and is in alignment with the challenge brief. The proposal is asking for little less than 1/3 of the total budget in the challenge, and considering the potential and quality of the proposal I would say that it is more than reasonable. ", "q0r": 5, "q1": "The team has experience of being funded in previous funds, which increases the level of credibility for the proposal. Having worked on and being a member of Adagov.org, implies great understanding of the Cardano community. In order to increase the credibility and trust of the team, maybe a list of the team members along with some LinkedIn-profiles could be listed, so that the experience and trustworthiness of the individual team members could be further verified. The team aims to have transparent communication during development with the community related to the project itself, but also with the catalyst community and GitHub, through channels like discord, catalyst etc. \r\nThe idea and project plan is presented in detail and includes purpose, time frame, deliverables (presented with time horizon), making the proposal easy to understand even for people that are new to the technology or community. The budget of the proposal is allocated clearly, but I would've liked to see how many people will work x amount of hours on the different parts of the project, to make things more transparent. The proposer seems to have a fair understanding of the challenges and risks during development, and has made sufficient adjustments to mitigate that level of risk. They are doing this by focusing on the most commonly used and trusted wallets for Cardano to implement the Social UX/UI, to start with. All in all, I strongly believe that this proposal will be implemented successfully. \r\n", "q1r": 5, "q2": "The roadmap for the proposal is clear, and the transparency is high due to the intended frequent communication with the community during the development phase. Gitbook documentation, workshops and a long list of milestones that are meant to share the progress with the community is provided in the proposal, there is clearly a detailed plan and intent for being auditable and transparent. The fact that all software will be open source further strengthen this. The proposal includes good examples of metrics that are measured for success that align with the road map, and features quantifiable numbers making it easier to measure. (For example, within 3-6 months, we aim to have onboarded 20 digital product designers from outside catalyst. Next step, We've doubled the social design academy discord from 50 to 100 members, etc…) I have not much critique to say about this, actually. There could of course be more specifics added, but all in all my opinion is that this proposal provides me with more than sufficient information to assess the progress in attaining its stated goals. ", "q2r": 5, "assessor": "z_assessor_349", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This lowers the barrier of entry for community members to participate in the cardano ecosystem and participate at a much higher/faster rate. New members will have a streamlined process on getting from newcomer, to project catalyst member.", "q0r": 5, "q1": "The team has the right experience, and the detailed roadmap they have laid out shows a path for a successful proposal. Given their Ui/Ux centrism, providing this service in an effective way is doable.", "q1r": 5, "q2": "They have laid out a clear and detailed roadmap for us to audit their progress and success. They have thought of the roadblocks and milestones from beginning to end and have laid that out for us to audit and review.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "By using chat-based onboarding in wallets we combine utility and information to create a user friendly and trustworthy experience.", "experience": "Sr. UX/UI Designer 10yr+. Social System Engineer. Member of Adagov. Re-inventing the UI for blockchain;conversational governance with Adagov"}