{"id": 367842, "author": "", "title": "The Catalyst School", "url": "https://cardano.ideascale.com/a/dtd/367842-48088", "category": 26106, "amount": 17500, "description": "Proposers, Advisors, Voters and other Catalyst members still struggle to understand how Catalyst works and how to play their roles.", "f6_no_assessments": 10, "f6_rating": 4.9, "videos": [], "media": [], "f6_assessments": [{"q0": "Catalyst School has become the entry-point for new and old members to take on a more active role within the Cardano ecosystem. The proposal is effectively written in that it directly and convincingly addresses the challenge.", "q0r": 5, "q1": "The proposal team is already doing the work. It is extremely likely that this proposal will be implemented successfully as well. The details of the plan (incl. an understandable and reasonable budget) make sense.", "q1r": 5, "q2": "The metrics are easily verifiable at all stages. The selected KPIs are an excellent fit for the challenge.", "q2r": 5, "assessor": "z_assessor_22", "no_vca": 12, "ne": 0, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "the challenge is explained in an understandable way. the idea behind the proposal is sensibly structured and understandable for the masses.", "q0r": 5, "q1": "after a zoom meeting i am convinced that this concept will reach many people. the entry is not directly realizable from the official channels. after the first meeting you feel confident in the implementation and can easily bring in your personal knowledge. the entry is very easy and you get the opportunity to promote it within your own community.", "q1r": 5, "q2": "the team is described in detail and the products are already delivered. the schedule is broken down into realistic blocks. the budget is acceptable and comprehensible. no apparent additional expenses.", "q2r": 5, "assessor": "z_assessor_260", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The goal of this proposal is aligned with the challenge. The Catalyst School brings good impact to the community, as they provide workshops for new people to understand & participate in Project Catalyst.", "q0r": 5, "q1": "The team member consists of well-known and veteran member of Project Catalyst. They have experience & knowledge necessary to share it with the community. The budget is reasonable. And I have attended several of their workshop. This project will likely to be implemented successfully.", "q1r": 5, "q2": "The Catalyst School documented their workshop accordingly, such as: video or minutes of meeting. And they have schedule in their Discord. So the community could keep track of the progress.", "q2r": 5, "assessor": "z_assessor_282", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This is exactly what is needed for getting to meaningful participation faster. My only concern is regarding the paragraph \"This proposal aims to provide the School sessions, workshops, 1-to-1/group support (in English) and a basic website. When funded, we will provide all these services for the next 2 Funds (Funds 7 and 8).\" This makes it sound like the website will be taken down if no further funding is given after Fund8. I'm sure that was not the proposers' intention. Make sure you not only word it correctly but provide proof that you really intend to \"go far together\".\r\n\r\nAlso, this should be coupled with outreach efforts to bring in \"new students\" into the school. Right now the school's success hinges on the assumption that Project Catalyst growth continues. Hopefully this will be considered for the next steps after this proposal is successfully delivered.", "q0r": 4, "q1": "This has got to be one of the most impressive teams I've seen so far. Having George Lovegrove in the team hopefully ensures that there is no need to create a yet another landing page but The School will be integrated to projectcatalyst.org (and/or cardanocataly.st).\r\n\r\nI have experience of many community-led projects that are poorly managed. This is definitely NOT one of those. I have full confidence in this team to deliver on their promises.", "q1r": 5, "q2": "Both the plan and budget are very well thought out. The costs are very reasonable. For instance the $180 price tag on a 2-person and 2-hour session is modest compared to events suggested in other proposals ($700-$900 price range). Perhaps that is because the cost breakdown is very clear for the tasks happening before and after the sessions.", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The issue of Catalyst members having difficulty understanding how Catalyst works has been identified. The solution was the Catalyst School project to increase the impact of Catalyst. The purpose of the proposal is in line with the challenge. Metrics were presented to monitor the project's success, thus allowing its impact to be measured. The project has not presented any financial plan beyond Catalyst so it is not possible to assess whether it will be financially sustainable in the long term.", "q0r": 5, "q1": "The proposer attached links and videos of his work already done, presenting evidence of his experiences. This shows that they have the necessary experience to achieve the purpose of the proposal. The budget is compatible and reasonable with the work to be performed. The budget was very detailed. The deadline set is realistic. The proposer presented the entire team of members participating in the project. The proposal does not pose major risks that prevent its implementation. The proposer presents a detailed plan of how the work will be carried out.\r\n\r\n", "q1r": 5, "q2": "The proposer presented a roadmap and milestones. Metrics for enable proposal auditability were also presented. The proposal can have a great impact on the community by helping those who are already members to do better in their work and new members.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This is a complementary proposal to the Catalyst School Website proposal (https://cardano.ideascale.com/a/dtd/368885-48088) but due to the symbiotic relationship between them, some aspects of the assessment require joint assessment. Despite the relationship between the two proposals, this one doesn't seem to depend significantly on the website being developed on the other, so the impact assessment remains high.\r\n\r\nThe problem and the solution are within the scope of the challenge.\r\n\r\nThis proposal has a very direct approach to the challenge, as it intends to be a school for new members of Catalyst (CAs, vCAs, proposers and other participants). The idea is to offer support, workshops and lessons.\r\n\r\nDefined goals and metrics are good impact indicators. ", "q0r": 5, "q1": "The Catalyst School team has been developing several improvement projects for Catalyst and has partnerships with Gimbalabs, WADA and Estern Town Hall. Catalyst School has already shown positive results in value onboarding, workshops have already been held and people have already benefited. There are details about the team members and their qualifications.\r\n\r\nThe plan presented is very well structured and detailed. The timeline is associated with Funds 7 and 8. The budget breakdowt is detailed and realistic.", "q1r": 5, "q2": "There is clarity in the problem, solution and alignment with this challenge.\r\n\r\nThere is a realistic roadmap, with milestones and clear goals. Relevant and auditable metrics were defined. My only recommendation is to include KPIs with targets to help indicate success and improve auditability.", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "a very detailed proposal, covering everything that a newcomer or a more experienced community member looking for some answers. \r\n\r\nGreat potential, we definitely need some platform, which will be UX friendly and will act as a crossroad for active members of the community.", "q0r": 5, "q1": "a solid team, well known, their projects are already running and some proposals were funded.\r\n\r\nVisited git + watched videos.  I have trust in this team.", "q1r": 5, "q2": "very detailed metrics are provided, which can result in a good audit-ability of the success of the project. \r\n\r\nProgress can be measured - well already running.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This proposal perfectly meets the main objective of the challenge, which is to engage community members to participate more actively in future funds. Here we have the creation of a virtual school, which will consist of a main site, teaching materials that will teach various subjects related to the Catalyst project (such as: how to improve proposals, how to evaluate proposals well, etc.), and individual monitoring for a limited number of people. In this way, community members will better understand the whole and also its specific parts, and a more enlightened group that has more solid knowledge about the Catalyst project will certainly act more actively in the next funds, and more, I believe that it will also attract new members once they fully understand the many advantages of the cryptocurrency/blockchain universe.", "q0r": 5, "q1": "I'm sure the team on this project is able to run it successfully. There are 11 members of a strong team, very different people, both in relation to where they came from and also about their areas of expertise. It has educators, IT, design, marketing, engineering professionals... And all of them claim to have an intense knowledge and performance with the Cardano universe, and some have even created apps and tools relevant to the ecosystem. There is really nothing to criticize here, because the team is complete and well prepared, unlike some proposals where there is only one author for a complex project, or the authors do not have sufficient technical knowledge to carry out the project.", "q1r": 5, "q2": "Regarding the project's applicability, everything is very well detailed. We know what the main goal is: to teach ecosystem members even more about a variety of subjects pertinent to the Catalyst project; how this will happen: through workshops, classes, preparation of teaching material, in some cases even individual monitoring, etc etc; we also know that this project has already started to be put into practice, and is in the testing phase. We are very minutely detailed what will happen according to the passage of time, both in weeks and what they intend to have acting with a certain amount of months. We are also told the metrics used to measure the proposal's success, which makes tracking the community simpler. And in relation to the financial breakdown, we have detailed for which small parts the requested fund will be divided, and each of these parts also has a lot of detail. So I believe the auditability is perfect.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 12, "ne": 10, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This effort is has already been exemplary for the concept of 'value onboarding'. The project behind the proposal is offering a full platform for new members to learn about Catalytst and all the roles. On top of that, with this proposal it will extend to more focussed guidance. The only part lacking from the challenge brief is a way to engage voters. The budget however leaves plenty of room for other proposal to cover that area", "q0r": 5, "q1": "The team has naturally been formed by active community members, based on their ongoing efforts to help onboard new members. There are a variety of members from across the globe. All members have participated in hosting similar events before. The plan is also clear and achievable. It is a continuation of work that is already being done voluntarily", "q1r": 5, "q2": "There are a number of metrics provided that would be easy to track and which would give some insight into the reach of the proposal. The result of this engagement, however is less clearly tracked. Perhaps in the future for this type of effort the KPI could include results of a survey among participants. The questions could focus on how well informed they feel. Other options could be reporting on participants in workshops becoming first time proposer.  The metrics on referees and voters also do not seem to be directly related to this proposal", "q2r": 4, "assessor": "z_assessor_587", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "I must say one huge thing that I missed in getting involved w the Cardano echo system was getting up to speed - and onboarding - not only newbies but also those that just want to revisit something.\r\nI am very much a big picture person - and from there I can navigate a lot easier - even if it is dig into detail or find my way.\r\nIt took me months and I am still trying to find my way.\r\nAs I look at the intent and the tractino so far on the school - it will definitely be a huge area to not only grow the community of Cardano, but also facilitate so many other areas related to the practical application in life and business where there are touch points.\r\nThe array  - 1-1 and Concise and informative - as well as longer sessions.\r\nAlso the more the echo system and the other elements of DAO and governenace will mature - I would see the need only growing.", "q0r": 5, "q1": "This is shoulder to the wheel and grinding out those needed content and engagements - and I do see it ramping up and building up momentum and therefore do have a good inclination that this is on a success path.", "q1r": 5, "q2": "The metrics seems complete - \r\nI would consider adding some element of feedback - it can be via polling, voting or even a step further for someone to voluntarily tip.", "q2r": 5, "assessor": "z_assessor_633", "no_vca": 10, "ne": 3, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Catalyst School, a place to enhance the impact of Catalyst as a whole by improving the contribution of all its different players and roles.", "experience": "Veteran advisors and proposal mentors, education professionals, very active Catalyst community members since early Funds and more."}