{"id": 368885, "author": "", "title": "The Catalyst School - Website", "url": "https://cardano.ideascale.com/a/dtd/368885-48088", "category": 26106, "amount": 10228, "description": "Education about Catalyst would benefit from a more fluid and tailored experience for new community members to help increase engagement.", "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Adding website for Catalyst School will improve their visibility & engagement with new member. This official website will give more information, where to look deeper into Catalyst School workshop, the event date, etc. I think this proposal aligns with the challenge.", "q0r": 5, "q1": "The team consists of well-known and veteran member. They already run the school for a while now. I have participated in some of their workshops. Adding a website would increase their visibility to the new member. Budgeting looks reasonable. This proposal will likely to be implemented successfully.", "q1r": 5, "q2": "KPI is quite clear and could be tracked by the community. The Catalyst School needs to provide the community on how many visitor they have every month, how many registered user per month, etc. But the information is quite good to be trackable.", "q2r": 5, "assessor": "z_assessor_282", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The Catalyst School is an already established project in the Cardano ecosystem and it's bringing basic education to the Catalyst newcomers. The proposal matches the main goal of this challenge and if implement as planned, will bring the value to Catalyst", "q0r": 4, "q1": "The team is big and experienced, with proven track of results and enough motivation and experience\r\n", "q1r": 4, "q2": "The budget could be more modest, especially taking to account that there are other proposals by Catalyst School. Also as the Catalyst School team is big, you could specify who will be responsible for which particular task in this particular proposal. ", "q2r": 3, "assessor": "z_assessor_328", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "This is a complementary proposal to the Catalyst School proposal (https://cardano.ideascale.com/a/dtd/The-Catalyst-School/367842-48088) but due to the symbiotic relationship between them, some aspects of the assessment require joint assessment .\r\n\r\nThe problem description is implicit, but analyzing it in context with the \"Catalyst School\" proposal, the problem becomes clearer. The solution presented is in line with the challenge.\r\n\r\nThe intention of the \"Catalyst School\" proposal is to educate proposers, CAs, vCAs and the general public about Catalyst and to increase their productivity and potential. This proposal will complement and serve to integrate the information present in Gitbook and other sources through an interaction interface for the community.\r\n\r\nThe concept presented in the two proposals indicate a great potential for impact\r\n\r\nThe goals, metrics and KPIs defined for this proposal indicate potential positive impact.\r\n\r\nAs the two proposals complement each other, it may be that this proposal is dependent on the \"Catalyst School\" proposal. This has not been explained, so the impact assessment becomes more subjective and uncertain.", "q0r": 4, "q1": "The team described relevant and relevant experiences for the development of the website. Team members have contributed to several projects in the community. Catalyst School has been a project in development for several weeks and has shown good results in value onboarding.\r\n\r\nThe plan is well structured. There is a realistic timeline for website development. There is a detailed and pertinent budget breakdown.\r\n\r\nThe technical aspects of how the site will be integrated into Gitbook, the necessary steps for development and the tools to be used were addressed.", "q1r": 5, "q2": "Although the problem statement doesn't make the problem explicit, when evaluating together with the \"Catalyst School\" proposal, the problem and the solution are clear and there is an alignment with the challenge.\r\n\r\nThere is a very detailed roadmap with objective milestones. Objectives, objective and auditable metrics/KPIs were defined.", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The challenge has been effectively addressed as a school can be a powerful way to onboard new users on the catalyst program. It can also help educate existing catalyst users. All of these benefits will, for sure, help increase the number of  proposers on the next challenges.", "q0r": 5, "q1": "I can see a detailed roadmap and a strong team on this proposal. This can easily be translated into a successful project. ", "q1r": 5, "q2": "With all the details provided, the website should be up and running in 14 weeks. The community should be able to audit the progress of this project based on the roadmap.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "- Courses and Workshops\r\n- Quiz & Test\r\n- Questions\r\n- Events and Calendar\r\n- Students registration\r\n- Multilanguage support\r\n\r\nif the website will contain these functions, it will definitely increase value onboarding by increasing the level of knowledge of community members. \r\n\r\nespecially, in the section of Courses and workshops. ", "q0r": 5, "q1": "the team is having more proposals, already funded, and some of their projects are already running. ", "q1r": 5, "q2": "detailed KPIs provided, both of progress and success. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "This proposal appears well thought out and is a great value proposition for Catalyst and Cardano, exactly what the community needs for continuity.", "q0r": 5, "q1": "The team behind the proposal is already well-regarded members of the community. The budget is provided but is off by 4 development hours or $200. The timeframe is provided, is reasonable and is measurable.", "q1r": 5, "q2": "Upon domain registration audibility is live. The proposal ties into another proposal, \"NFT Rewards\", without much focus on the interaction and technicalities between the two.", "q2r": 4, "assessor": "z_assessor_591", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Provide a enriched and more complete learning experience for Catalyst School students using a customized interactive web platform.", "experience": "Veteran advisors and proposal mentors, education professionals, very active Catalyst community members since early Funds and more."}