{"id": 369862, "author": "", "title": "Tutorchain.io - Catalyst use case", "url": "https://cardano.ideascale.com/a/dtd/369862-48088", "category": 26106, "amount": 5000, "description": "Finding an expert or monetizing your expertise requires centralized vetting services that limit your choices and control your access.", "f6_no_assessments": 3, "f6_rating": 2.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a nice idea, however is is not clear how it fits this challenge. It is an app to line up tutors with learners. The proposers have submitted a basically the same idea into 5 other challenges. In the metadata challenge it seemed to fit reasonably well but they have not stated how it fits with this challenge.  This specific submission is basically a perfect cut and paste as that submitted to the developer ecosystem challenge, it even has the same heading. The only difference is it is 1/3 the cost (likely as there is less money in this challenge).", "q0r": 1, "q1": "The proposer likely have the experience to set up the platform generally and it will likely be implemented as described, though the fact they have sent it into different challenges with difference costs makes me wonder about what the budget should really be? ", "q1r": 2, "q2": "Delivery of the platform is easy to audit, however what's really important for this use case is how it will impact Catalyst value onboarding. They have not covered how it is relevant that how can it be a success for the challenge?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 12, "ne": 3, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "If this project is successful it will drive not only new people to Catalyst but also people with newly acquired skills. Or even new tutors on it's platform that doesn't know about Catalyst. Therefore adding value to Catalyst by increasing the number of  people with skills on the platform.", "q0r": 5, "q1": "Already committed and active team on this project. They are already working on the project and are not waiting for funds to enable them. The funds will be used to build the user community around the project and providing good customer service. The amount seems sensible for this task. The timeline provided to complete the different tasks also seems appropriate.", "q1r": 5, "q2": "They have gone into great detail in how simple and effective the mechanics of their project is. How it will work and how they will build it. The solution they provide to solving the transparency in reviews is a sound one. Also solving the payment and minimal fees of the tutor in the process. The roadmap provided is simple and straight to the point with a possible launch date. Keeping track of this proposals progress and success should be easy to monitor. They have addressed some risks, like the zoom session that automatically records the session should there be a way to prove the quality of the session. As the project grows I think it should be noted that user feedback should become a part of your growing process. Feedback from the tutors and learners should be taken and solutions be voted on by them in order for this project to scale and survive future challenges.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 8, "ne": 3, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is just a duplicated one in the incorrect campaign. As far as Catalyst value onboarding: that of itself is a needed issue to address, as I found this confusing as well when looking to submit a proposal. I opted to become a CA in part to learn the process better. Anyway, I think another proposal from this proposer in another campaign is better suited for this project.", "q0r": 1, "q1": "I think this team can succeed once in the correct campaign, but don't think this has much to do with Catalyst onboarding.", "q1r": 3, "q2": "Information provided seems complete and thorough, but just not involving Catalyst. I do worry somewhat about this being a marketing attempt, as if their multiple submits we valid for each campaign then each duplicate would be more tailored toward that campaign. I am not sure the link between their project and Catalyst, however.", "q2r": 3, "assessor": "z_assessor_363", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Use smart contracts to store customer reviews that are verifiably associated with monetary exchange. Experts build reputations they control.", "experience": "Founders are a software engineer (crypto startup experience) and a physics professor—skills and connections to capture the tutoring market."}