{"id": 369983, "author": "", "title": "Catalyst 24h Streaming TV Programs", "url": "https://cardano.ideascale.com/a/dtd/369983-48088", "category": 26106, "amount": 30000, "description": "How to show new people Catalyst projects success, experience & benefits of involvement? How to entertain & motivate to make proposals?", "f6_no_assessments": 5, "f6_rating": 1.4, "videos": ["https://youtu.be/hwtLm8l0gOQ"], "media": [], "f6_assessments": [{"q0": "This is a generic proposal to create a 24x7 streaming channel of catalyst project information. There is no explanation as to how this will actually meet the challenge of encouraging meaningful participation in Project Catalyst from community.", "q0r": 2, "q1": "As with the other 9 proposals from the same proposers, the plan is relatively generic. Build a team, produce the content, expand. Its not clear the proposer has the experience to produce the content and run a channel.  This seems more like a salesman's document than a clear proposal of a project with details of what will be built. This just doesn't pass the smell test for me. \r\nIt really doesn't seem that 30,000 would be anywhere near  enough to make the content for a 24x7 streaming channel. ", "q1r": 1, "q2": "Whilst there is a road map, the deliverables aren't very specific. Build a team, produce content, set up hardware to run, expand, repeat. There should be some goals and metrics tracking the impact the provision of the services developed here have and how it adds to the success of the challenge. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Hmm, creating and disseminating relevant content to inspire new members is definitely a worthy goal. However, something tells me \"a central control centre\" is not necessarily the best approach in this day and age.", "q0r": 1, "q1": "This is another proposal from this proposer that calls for funding to recruit people who are nowhere to be seen yet.\r\n\r\nAs it says in the comments section there are other news and content related proposals out there - and there have been many in previous funds.\r\n\r\nI don't understand what the CHG token has to do with any of this. It is not explained anywhere, only copy-pasted from one proposal to another.", "q1r": 1, "q2": "I don't think that the \"project will be ready for partial launch within 4 to 6 weeks\" if the team is not even there yet.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Promotion of Cardano and Catalyst is definitely required and as such this proposal goes some way to meeting that objective. However it feels like we are funding something here that should already be up and running (at least as a POC). It USP seems to be that its going to be entertaining , there is lots of  entertaining crypto and cardano related content already available what this proposal doesn't address is how do we convert the lurkers and casual viewer into active participants ", "q0r": 3, "q1": "Coming from a programme mgmt background i am used to seeing and delivering multi faceted , multi year programmes. \r\nThe proposal give a very high level vision and outlines some milestones alongside a 12 month roadmap.\r\nWhat is missing specifically for this proposal is \r\n- is the $30k for the first 4-6 week or a longer period?\r\n- there is no detailed plan for the first 4-6 weeks (tasks vs resources vs budget)\r\n- no other resources other that the proposer are mentioned and an assumption need to be made by the voter that the proposer will lead the implementation. I see the proposer has 30+ other proposals in this fund so am struggling to see how this assumption holds true.\r\n- 'We' is mentioned many times but i don't see a team only the proposer.\r\n\r\nThe proposer should develop a POC (this won't cost much more than his time) or find a like-minded group to collaborate with and then possibly bring it back with something to show. I don't see this proposal as a good use of treasury funds in in this fund.\r\n", "q1r": 1, "q2": "Much more work needs to be done on measure of success set against the challenge brief. At best the the proposal is hoping to engage some people, targets should be set on number of new active participants (proposers, CA's, voters, etc) this proposal is able to bring on board.\r\n\r\nThe proposal also need to think about the risks and challanges to delivery involved here.for example \r\n- no team is yet engaged, can this be done and a have a working solution up and running in 4-6 weeks?\r\n- long term funding is dependant on the success of a new cryptocurrency. What is not clear is how much money is required to sustain the TV channel and what happens if the currency launch doesn't generate the required funds?\r\n-   \r\n\r\nriks - funding though CHG\r\nKPIs?", "q2r": 1, "assessor": "z_assessor_45", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "The proposal does not really fit to the challenge. In the light of the extensive content and information material already existing on Crypto and Cardano the big investment cannot be justified.", "q0r": 1, "q1": "While the plan is set up in a mostly detailed and correct manner, for several reasons, after some research the company does not seem up to the task. 1) The website and the social media does not match up to the self-acclaimed reputation and claimed size of the company (all media and social media coverage is selfmade, the wensite looks very unprofessional for someone who supposedly has been in the business for 23 years and the website discloses nothing about any staff member while there are apparently about 10 CH companies). Furthermore, taking a look into the UK business registry the company or versions of it was dissolved and re-found several times. The sheer amount of proposals from the proposer make it unlikely that he will be up to the task of finishing all of these. 2) Strike off requests from the company have been suspended or denied, which often means outstanding debt.", "q1r": 1, "q2": "While milestones are set, some of the targets are defined very open. Furthermore, the fact that the company was already dissolved several times in the recent year make ot unlikely that the proposal can be audited. How can you audit a proposer who regularily dissolves his business?", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "Dear vCA,\nOnly a personal opinion given: The assessor has decided they know the capabilities of the proposer based on a quick scan of social media and a misunderstanding about the status of the company, they have made a blanket judgement of all ten proposals based on incorrect judgements. There is no debt because the company has never traded, all assessments are copied and pasted on each of my proposals showing a general bias against all of my proposals.\nUnconstructive assessment: The UK Companies are all in good order, this assessor does not understand UK company law, the companies have not been dissolved even once, Notices were served to dissolve the company one time, when I thought about discontinuing the project but I decided to continue and filed the necessary document to continue the company. This does not indicate a lack of ability to complete the proposal.\nRegards,\nCarl Henry\n"}, {"q0": "Having continual streaming of content does address the challenge of value onboarding to a certain extent. It perhaps addresses other challenges better but it is a worthy endeavour to raise awareness of Cardano/Catalyst and the whole ecosystem if done well. ", "q0r": 3, "q1": "While Carl Henry himself appears to have the front-end media experience, it is an entirely different operation to set up a media outlet as well as find, curate and deliver content. Let alone on a 24/7 basis.  As someone who had to come up with original content for corporate training on a weekly basis for 10+ years, even with a part-time team of hundreds (equating to approximately a 25 person full time team), curating content (even user generated) and producing it took considerably more effort than  what is suggested here. I would like to see a much more detailed plan on how the proposer is going to source and treat different content types. Also how they are going to make it accessible on-demand in order to truly add value to the community.  ", "q1r": 2, "q2": "The roadmap, in my opinion, is overly ambitious for the timeframe. Additionally, the metrics are too vague to be auditable. \"adding more\" isn't a sufficient target and isn't measurable when considering funding. Finally, the funding amount of $30k is minuscule for what this project is proposing to deliver. I think there needs to be more of a detailed breakdown of all costs as this is a huge endeavour. I would seek the advice of people who have done each composite part of this process to get a better sense of timeline, budget and what is possible. ", "q2r": 1, "assessor": "z_assessor_620", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Build 24-hour streaming content showing Catalyst Projects, proposers, advisors, voters & results. New people will be invited to propose", "experience": "43 years experience in multiple businesses, worked in TV and video content production."}