{"id": 369927, "author": "", "title": "The Blockchain Class by Adatruth", "url": "https://cardano.ideascale.com/a/dtd/369927-48088", "category": 26106, "amount": 12000, "description": "Newcomers need education to understand the system + recognise scams. Lack of content on real world use cases explaining the vision + basics.", "f6_no_assessments": 3, "f6_rating": 2.777777777777778, "videos": ["https://vimeo.com/592379844", "https://vimeo.com/576882227"], "media": [], "f6_assessments": [{"q0": "This proposal goes a good way to meeting the challenge brief in educating and inspiring people which look perfectly aligned to the proposers comfort zone. \r\nWhat i would like to have seen is the proposal stretched to show how it would help people make the transition from 'lurker' or casual viewer to actively participant in cardano. In addition some more info about what would be included in these short videos would help provide clarity on value for money. The trailer is well made does show off the skills of the proposer and his team which is very encouraging, having people from all walks of life with  good skills in their field is essential. I hope the proposer takes this feedback in the positive way it is intended and finds the help he needs. ", "q0r": 4, "q1": "I have reviewed this proposal with colleagues who have many years experience in educational training, webinars, video production, marketing and project management.\r\nThe plan and resources to produce the videos is sufficient but the budget needs further breakdown. what is the $12k going to be spent on?\r\nIn addition the proposer should look for a collaboration with a social media marketing person. Such a person shouldn't been difficult to find and could help establish and market a channel for these video series. Assigning 3 stars as i like what i see it just needs a better route to market. ", "q1r": 3, "q2": "Once again the KPI and measures of success defined in the proposal are clear but need stretching to include their impact on Catalyst participation.", "q2r": 3, "assessor": "z_assessor_45", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "It's certainly true that newcomers need quality information to support them to get involved; but I'm not sure how far educational videos about Cardano fundamentals, on their own, will really impact on moving newcomers towards the \"meaningful participation in Catalyst\" that the challenge is looking for. The proposal seems to be arguing that newcomers *are* participating anyway, so increasing their knowledge will make their participation more meaningful; but I don't think this is necessarily the case – many newcomers don't really participate very much in Catalyst at all, and this challenge seems to be looking for work that moves people from passive engagement, to actually contributing to Catalyst. I'm not sure this kind of video will do that.\r\nThe impact of the proposal would be clearer if the proposal said what topics its three videos will cover, so we can see how they might ultimately help people towards meaningful participation. It would be even clearer if the proposer had done some simple research, such as asking newcomers in Catalyst – maybe via a poll on Discord or similar – what subjects they would most like a simple 4-minute intro to. It wouldn't be hugely scientific or anything, of course, but it would give a sense of whether the videos will be responding to an actual knowledge gap. \r\nThe trailer included in the proposal looks lovely, and is really nicely edited; But in terms of content, it actually uses a fair bit of jargon (\"...give people economic identity so that they can leverage it for valued governance\" is really not accessible language at all). Sure, it's only a trailer; but the proposer would not have included it if they didn't think it gave a flavour of the project; and sadly it suggests to me that the actual videos might not demystify things for beginners very much.", "q0r": 3, "q1": "It's clear that the proposer has the skills to make professional-looking videos, and would be able to make 3 videos in this timescale. The proposer also mentions having experience as an educator, but no detail about this experience is given; this feels like a big omission, as educating skills would be pretty crucial to this project's feasibility. \r\n\r\nIt's really good that the proposer recognises the need for professional marketing expertise; but since this hasn't been secured yet, maybe the project isn't quite ready - marketing is a pretty big part of its feasibility, so having that expertise on board already, and having a marketing plan in place, feel necessary. It's also not great that there is no budget breakdown, to say what the proposer will be paying themself and their TV crew, or a marketing professional. And whilst it's great that the videos will be bilingual and also subtitled into other languages , is the cost of translation accounted for?  A breakdown would be really helpful in assessing feasibility. \r\nThere's also no assessment of risk – what happens if few people view them, how will you intervene? In short, while I feel confident that some videos will be made, I don't feel sure they will do the job they are meant to do, or reach their intended audience.\r\n", "q1r": 2, "q2": "The proposal says \"If the Blockchain Class is a success, we'd ask for more funds to create more stories in Fund 7\" – but it doesn't say how we'd tell if it is a \"success\" or not. No metrics or KPIs are given to say what success looks like. Obvious ones would be numbers of views, clicks, comments, social media engagement – but none of this tells us if the videos are having the effect that the challenge is looking for, to actually get people involved with Catalyst. So I don't think there is enough info given to be able to audit success.", "q2r": 2, "assessor": "z_assessor_540", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal more or less dialogues with the objectives of this challenge, because it intends to create a series of videos of about 5-8 minutes educating people about what Catalyst, Cardano, cryptocurrencies, blockchain, etc. are, and how all this relates to the real world. This is very interesting for attracting new members to the community, but I don't think it would be as valuable to engage current members to actively participate in the next funds. I think this is because community members already have a good idea of ​​what the main concepts of the Cardano universe are, I think it would be important to deepen these concepts and unravel how it would be so that people could improve the performance of the activities they already carry out in the community, such as launch proposals or evaluate them. This proposal, in my opinion, fits more with the \"proposer outreach\" challenge than with the one it was submitted to.", "q0r": 3, "q1": "About the author's ability to execute his proposal, we know he has experience with the audiovisual area, and we can take the proof by seeing the pilot episode of the series, available on the attached website, which is really very good, it's 8 minutes explaining in an accessible way what Project Catalyst is. He says he has 15 years of experience with TV and Film and holds some awards, however, it would be positive if he had given some examples of previous work he has been involved with. Regarding the holders of knowledge about the Cardano ecosystem, who will be the speakers in the videos, from what I understand, it would be positive if they were also presented, who they are, what their backgrounds, previous experiences and where they currently work... We are not told nothing about them, and it would be important to know them so that we could establish more confidence in relation to the quality of the material that will be produced, regarding the knowledge inherent to the ecosystem.", "q1r": 3, "q2": "Unfortunately, regarding project auditability, very little information is provided to us. We know that a documentary series will be made, of videos of approximately 5-8 minutes, with different speakers for each video, that the videos are recorded in Prague and that they are bilingual. In other words, we have good information about the final product, but not how it will happen. We would need to know: how often the videos would be posted; how would their disclosure take place; what team would be involved, in addition to the author and the speaker; if the educational videos are intended to be subtitled in other languages, which ones; and mainly, what is not mentioned: how would the financing money be used? It is possible to know, through the attached website, that they intend to create 6 videos. But since we don't know how often they would be posted, we can't understand how long in total this project would be going on. Judging by the first episode of the documentary series, these videos would be very good, they would have quality to be shown even on TV, I think that if they are produced they will only bring benefits to our community, but it is necessary to detail the proposal!", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "Professional educational videos attract proposers, advisors + voters to learn about Cardano + Catalyst, increasing meaningful participation.", "experience": "\\- 15 years of TV & Film – mostly documentaries\n\n\\- Several festival awards for editing\n\n\\- Best Documentary Film Award (2020)\n\n\\- Educator"}