{"id": 370242, "author": "", "title": "Community Subscription Fees Recoup", "url": "https://cardano.ideascale.com/a/dtd/370242-48088", "category": 26106, "amount": 581, "description": "Some expenses this past year have been covered by individual members of the community. Discord, Zoom, Miro all have costs associated.", "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers already brought value to the community and that's of course fair that they don't need to pay for the tools from their own pocket, especially when Catalyst itself has a huge budget. ", "q0r": 5, "q1": "The proposal budget is very small compared to the overall budget and the listed tools are needed in work. \r\n", "q1r": 5, "q2": "Both ​Steven Aldrich and Swarm are known and very active participants of the community, this recognition might be the audit, and we can grant them some freedom to choose the tools which they need for their work. ", "q2r": 5, "assessor": "z_assessor_328", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The problem and solution are clear and within the scope of the challenge.\r\n\r\nThis is a retroactive proposal, the work has already been done and the team is requesting reimbursement of subscription costs for the following applications/services:\r\n\r\nDiscord Statbot, Miro, Zoom, WordPress Website, WIX Website, GitBook.\r\n\r\nThe tools mentioned above were widely used by the Catalyst community over the last few months and contributed to the value onboarding, however the team did not describe concrete metrics that allow to quantify the impact over the period.", "q0r": 4, "q1": "The Swarm + Steve team has been contributing a lot to the development of projects in the Catalyst community for several months now.\\\r\n\r\nThis is a retroactive proposal, so judging feasibility does not make much sense and the criteria established in the CA guidelines do not fully fit this criterion. Considering that the tools, funded by the team throughout the period, were very useful over the last few months and contributed to the challenge and the concept is just to pay for subscriptions, I think the rationale indicates feasibility.", "q1r": 5, "q2": "There is clarity in the alignment of the problem and solution with the challenge.\r\n\r\nThis is a retroactive proposal, so I believe that auditability should be available. While the Catalyst community has benefited greatly from subscription services/software, the team didn't provide metrics and KPIs to allow us  objectively judge the impact of subscription services/software on the community.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal effectively addresses the challenge because the growth of the catalyst community can be attested to the work done from those currently within the community. These people should be acknowledged for their commitment which will further incentivize innovation and growth. ", "q0r": 5, "q1": "Those who bore the costs initially have presented this proposal so the costs associated will be reimbursed to the initiators. Their costs have been projected and will be satisfied with payment. They also future proof costs for those who wish to further improve the community.", "q1r": 5, "q2": "The proposer could potentially add attachments of receipts or payments made which can provide transparency for the wider community. Costs are quite low however which should make this proposal easy to audit.", "q2r": 4, "assessor": "z_assessor_542", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "The community adoption has shown these venues and tools represent great onboarding value, let's pay back the expenses to the pioneers.", "experience": "**Early creators** (who bore the expense of the tools) to create the spaces for Community to gather, discuss, & learn about Catalyst."}