{"id": 370220, "author": "", "title": "WADA Uni Students Catalyst Registry", "url": "https://cardano.ideascale.com/a/dtd/370220-48088", "category": 26106, "amount": 7000, "description": "University students are the future of blockchain tech but they aren't fully engaged in the Project Catalyst program.", "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "There are two components of this proposal that address the challenge. It's target audience is university students & Africa. Both make up a significant part of Cardano's future.", "q0r": 5, "q1": "The WADA organization has demonstrated already their ability to implement. Combining their efforts with the Cardano School helps both organisations.", "q1r": 5, "q2": "KPI's are clear. Measurable and meaningful", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "Idea with  excelent value proposition and proposal is good. The problem statement is valid (how to increase presence of students in Africa?), in line with challenge, with clear return for African community (and Cardano community as a whole) and scalable to other regions of the world.\r\nHaving said that, it still lacks a bit of the \"how\" it is going to be done - thats why it didn't get 5 here. It could be clearer what content will be discussed, how to better engage with local entitities and students (parnetships), what kind of events and activities will be held and so on. Communication strategy should have more details. It could have also be included a mentoring program by Cardano SMEs to help those more interested and prepare them on technical and management aspects in blockchain and Cardano.", "q0r": 4, "q1": "The 2 people committed seem competent with experience and technical skill. However, as the target audience is broad, diverse and numerous, more people would be welcomed. \r\nBudget breakdown and timeline seem realistic and make sense within project scope.", "q1r": 4, "q2": "Clear and good milestones. The proposed kpis are great but it could have some targets over time.\r\nRisk management is also very well done.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal addresses the campaign brief by identifying a pertinent issue with its problem and solution statement which would encourage adoption at the grassroots. ", "q0r": 5, "q1": "From a feasibility standpoint, the team behind the proposal are quite active in the Cardano ecosystem and have provided a timeline on how they intend to go through with the project. However, I would wish to see their marketing plan included in the proposal as well as projections of how many students they would bring into the ecosystem to further gauge the proposal impact and meet minimum user adoption metric of 50% within two years. ", "q1r": 4, "q2": "The information provided is sufficient to audit the progress and the success of the proposal as it meets the project proposal brief, impact assessment and feasibility potential. Kudos!", "q2r": 5, "assessor": "z_assessor_410", "no_vca": 11, "ne": 2, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "This proposal has good alignment with the challenge and is clear on its objectives that are very specific ( get African Uni students onboard)\r\nfrom a voter perspective the first question that pops into my head is how do you know that Africa Uni students are not engaged? it would be good for the proposer to have supported this claim with some evidence but i don't think it should detract from the overall proposals which is good.", "q0r": 4, "q1": "i have run many workshops/hackathons/training session utilising eventbrite and meetup. The proposal is not clear on how many events we get for $2k. Also will the these costs cover all activities for the next 12 months, ie is the $2k resource cost for the proposers or to employ and local admin?\r\n\r\nA more detailed plan against resources(named if possible) and budget would help answer the questions above. My day job is managing project and running a consultancy business so spend a lot of time putting plans and business cases together.", "q1r": 4, "q2": "the milestones and metrics area easy to understand and will help the community know if this project is successful.\r\nI assume the proposal team will continue to mentor the new participates for at least 1 year so \r\nsuggested stretch targets are:\r\n40 people onboarded as CA's. These CA's are active and have assessed at lest 5 proposals each\r\n5 proposers onboarded and at least 5 proposals accepted into a voting round", "q2r": 5, "assessor": "z_assessor_45", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "Diversify Catalyst inclusion through onboarding, navigation events, and resource provision for university students in  Africa", "experience": "The Catalyst School\n\nWADA: Cardano Community skilled practitioners and entrepreneurs, located in hubs across Africa & the diaspora."}