{"id": 381622, "author": "volibra", "title": "Ada Donation Widget", "url": "https://cardano.ideascale.com/a/dtd/381622-48088", "category": 26250, "amount": 10000, "description": "Il n'existe pas de widget Ada Donation pour les sites web et les projets Github permettant de recevoir des dons.", "funded": 2, "upvotes": 87684778, "downvotes": 3025214, "votes_result": 84659564, "votes_cast": 285, "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": " Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In programming specific costs in budgets I draw my knowledge from research and university education in programming but not personal professional experience in the field of IT, hence this part of my assesments in this categeory will be more superficial and more focused on the general budget rationale with the research done in mind. The proposal identifies an interesting approach to the challenge in ist problem statement and manages to articulate a solution that not just adds value to the Cardano ecosystem but also beyond.\r\nThe key metrics and goals of the proposal align well with the outlined challenge settings.\r\nScalability should not be an issue in this type of proposal. Well done.", "q0r": 5, "q1": "The proposers are very transparent about their background and seem competent and up to the task. They provide extensive documentation of their qualifications. It is highly likely they are up to the challenge The budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic schedule to complete the work.\r\nThe proposal provides a sensible and realistic implementation plan. The resources necessary to implement the proposal are described. The only critiques in my opinion are that no plan for risks in implementation or for lack of funding are presented. Feedback: Do a bit of risk assessments for potential problems in your implementation and you'll be fine", "q1r": 4, "q2": "A roadmap with milestones and a time horizon for achievement, auditable\r\nsuccess metrics are  presented\r\nThe targeted problem and solution are described well. Overall, te proposal is really auditable.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 4, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": " \nThe problem needing to be solved has been identified and articulated namely There is no Ada Donation Widget for website and Github project  to receive donations.\n  \nThis proposal falls within the scope of the challenge brief by  creating simple and easy-to-use donation widget that can be embedded into your website to receive crypto donations in Ada or Native tokens.\n \nThis proposal shows clearly how it will add value to the Cardano System by having a   simple and easy-to-use donation widget that can be embedded into your website to receive crypto donations in Ada or Native tokens.\n \nKey metrics and goals of the proposal have been stated clearly namely\nNumber of Github Repo using the donation Widget\nNumber of Website using the Donation Widget\nTotal number of donation receive from the Widget\n \nKey metrics and goals of the proposal fall within the scope of the challenge. These include \n\nNumber of Github Repo using the donation Widget\nNumber of Website using the Donation Widget\nTotal number of donation receive from the Widget\nFunctionality:\n\nThe proposal cant be scaled to address future challenges because once this is built the job is over.\n\nThis project will have a positive impact on Cardano system\n\n", "q0r": 4, "q1": "  \nThe proposer has not provided evidence of relevant skills and experience needed to complete the project. No Linkedin or FB links are given.Simply has said a team of PLutus developers is involved. A company site is given.\n \nThese links arent sufficient \n \nI have visited these links but not contacted the relevant people\n \nI have not been able to assess their level of competence\n\nProposer has not said in an identifiable manner, the type and number of team members required to implement the proposal\n\nHe hasnt rationally and logically laid out his team structure and breakdown\n \n Budget has been outlined clearly and broken down into identifiable items\n \n Its hard to say if budget is reasonable to achieve the set goals\n \nProposer hasnt provided a verifiable plan if additional funding is required to implement the proposal.\n Proposal offers a realistic timetable to complete the work\n\nThe proposal doesnt provide a sensible and conductible plan for implementation that shows not only what is being done but also how\n \nYes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation \n \nNo the proposer hasnt considered challenges and risks relevant to a successful implementation", "q1r": 4, "q2": "\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\n \nThere is a clear roadmp with milestones and a time horizon.\n \n \n There are clearly defined metrics \n\n There is an understandable description of the problem\n \n \n there a clear understandable solution that addresses the problem/\n \n The proposer hasnt identified possible hurdles, challenges and difficulties\n\nHow does the proposer plan to deal with these difficulties?\n \n\nThere are no contingency plans \n \n\n\n", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 21, "ne": 4, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "Integrating a simple ADA donation option in websites would be a great way to increase the usage and value of the network, as well as helping people who do important work for the community to be rewarded for their efforts.\n\nThey have also included documentation and a tutorial in their project plan, which is very important for seeing actual adoption and usage of the widget. \n\nTherefore I see this proposal as highly beneficial for the Cardano community.", "q0r": 5, "q1": "The team provided enough information about themselves through LinkedIn and Github pages to conclude that they would be able to follow through and finish this project in the 3 months specified by the challenge setting. \n\nThey are asking for the maximum funding from the challenge setting, and that should be sufficient for completing the project.\n\nThe breakdown of their plan could have been elaborated a little further.", "q1r": 4, "q2": "They have provided enough information for the community to assess the progress and completion of the project. The problem statement and solution is clearly defined, so it is easy to understand what they will create, and what a succesful implementation would look like.\n\nTo assess the wider impact of the proposal, they could have quantified the userbase success metrics a little more, and might leave the question if they need more funding later to increase the adoption of their widget through marketing and informing people about it. ", "q2r": 4, "assessor": "z_assessor_73", "no_vca": 24, "ne": 5, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "The project will be a widget to accept payments and donations. Idea is to be easy to embed into websites. Proposal fits the challenge it's in. There are such tools out there already, but the more the better. Accepting payments is a prety basic necessity so I don't doubt the value this project will bring. Key metrics are right on the spot. Succinct but very accurate. Userbase and the adoption should always be the top priority, and in here, they are.  I don't see anything missing in this proposal, and it's plain to see the team is full of professionals.  As a developer, I don't have any concerns about the proposal. Overall a great idea and a great proposal to match. Good job!", "q0r": 5, "q1": "There are enough links provided and I was able to verify the people working on this project and their skillset is enough to match the work that needs to be done. IMHO this brings credability to the project in the eyes of the voters. The team members are already known, which is a big advantage compared to a lot of other proposals whish have no teams assembled. The budget is clear and broken down into identifiable items. It's reasonable if not underpayed. As a developer myself I can guarantee the timetable to complete the work is reasonable. There's a staightforward yet a sensible plan for implementation that shows easy steps to follow along.   One thing I was missing is described possible challenges to market and spread the knowlege to your peers and some mention of competition would be nice as well.  Overall I believe the project is feasible and can be implemented by the team mentioned. ", "q1r": 4, "q2": "There's a discord channel to keep the community posted for all future development and growth news so I have no doubt about the auditability of this project. As I already mentioned the KPIs are on point because they deal with addoption of the project which is the most important metric IMO when it comes to software development. There's a clear roadmap with simple milestones with a sensible timeframe for implementation.  The problem is clearly stated and the proposed solution is succinct but clear on the end result.  I anyone interested will be able to follow along with the development of this project. Good luck to you! ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 23, "ne": 9, "ng": 14, "nfo": 0, "vca_o": 1}], "solution": "Un widget de don simple et facile à utiliser qui peut être intégré à votre site web pour recevoir des dons en crypto en Ada ou Native tokens.", "experience": "Une équipe de développeurs Plutus, de concepteurs UI/UX, de développeurs de logiciels mobiles et Web travaillant sur de nouveaux projets Cardano innovants."}