{"id": 382218, "author": "manfo2021", "title": "Small Change Wallet", "url": "https://cardano.ideascale.com/a/dtd/382218-48088", "category": 26250, "amount": 9000, "description": "Au Cameroun, trouver la monnaie qui correspond aux achats de biens et de services quotidiens est un énorme défi pour les communautés locales.", "funded": 2, "upvotes": 63853427, "downvotes": 11189195, "votes_result": 52664232, "votes_cast": 232, "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": " Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In programming specific costs in budgets I draw my knowledge from research but not personal professional experience in the field of IT, hence this part of my assessments in this categeory will be more superficial and more focused on the general budget rationale with the research done in mind. The proposal identifies the problem of the lack of access to finance and provides a viable solution to adress it by providing infrastructure for microfinance utilizations. The topic of microfinance has been discussed by many economists to be a very powerful tool to self-empowered economic development and should be supported. Giving access to microfinance will be both beneficial for the Cardano ecosystem (by providing new markets) and to the borrowing sides, as with it, they will be able to borrow at much lower fees than from local moneylenders. The key metrics and goals of the proposal align well with the topic and I can confidently assess that WADA will be able to scale this proposal, as they are a big, competent organisation, and already from the setup the proposal is quite scalable.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": " A roadmap with milestones and a time horizon for achievement is provided. Metrics and KPIs that define the success of the proposal are presented.\r\nA Clear understandable description of the targeted problem is provided and a good, comprehensive solution that addresses the problem comes along with it. I'm confident this proposal can be audited well.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 6, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The problem and the proposed solution are interesting and necessary everywhere in the world. I'm not sure about how many changes that a family must be done in a day but every family in this world needs it. Therefore, if this idea going to succeed it will make a huge impact on the Cardano ecosystem with somehow can be a million users.  ", "q0r": 5, "q1": "Hope that the team can have more detail about their implementation plan that how they can get users on both sides because this is the hard part of this type of (D)app. If there is just buyers in the app, and the sellers or service providers don't use it, the problem now comeback. \r\nThe team showed their steps to develop the app but without a timeline. And their budget is also unclear. \r\nAs an experienced team in organizing many hubs of Cardano as they showed. They should have more detail about what they will do to help CA/ vCA/ voter easier to understand and support them.", "q1r": 3, "q2": "I'm not sure about their roadmap because it has no timeline. Their key metrics are very promising to see and I hope that they can get it. \r\nThey also have very detailed info about the problem that describes in examples, and they have a great solution explanation that easy to understand how it can address the problem. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The idea of ​​creating a native token and a wallet to help with small change collection, make sure to combine the exchange platform with microfinance businesses. I agree with this idea within the limits of Cameroon or a similar number of countries and regions. The proposed solution is clear and convenient for users when using the QR interface, of course this requires users to have smartphones and the internet.", "q0r": 4, "q1": "The proponent also clearly provided 3 implementation steps. In addition to the payment benefits, are there any additional benefits for token holders, in addition to that, converting from fiat to cryptocurrency also has legal related hurdles that proponents should also add.", "q1r": 4, "q2": "Timeline whether steps are parallel or sequential should also be provided. Building a cooperation model with microfinance enterprises is very necessary and what are the risks and challenges for this step?", "q2r": 4, "assessor": "z_assessor_697", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Créer un jeton natif et un portefeuille pour aider à collecter la petite monnaie en veillant à intégrer une plateforme d'échange avec des entreprises de microfinance.", "experience": "Équipe Wada d'architectes et d'ingénieurs en logiciels, collecteur de microfinance,"}