{"id": 382448, "author": "mqp", "title": "A Community Vesting Dapp", "url": "https://cardano.ideascale.com/a/dtd/382448-48088", "category": 26250, "amount": 10000, "description": "En décembre 2021, il n'existait pas de solution fiable, ouverte et incontournable pour l'acquisition de contrats intelligents au sein de la communauté Cardano.", "funded": 2, "upvotes": 29201344, "downvotes": 19810993, "votes_result": 9390351, "votes_cast": 106, "f6_no_assessments": 3, "f6_rating": 3.1111111111111107, "videos": [], "media": [], "f6_assessments": [{"q0": "A standard smart contract for vesting is a great idea, however the proposal does not show clearly how the project is close to completion and how there will be a usable product in 90 days. In my opinion, the proposal struggles to address the challenge because the proposal does not clearly show a path to an end product useable by end-users within 90days.", "q0r": 3, "q1": "The project has specified the features and fuctionality of the product. The team presented a logical flowchart to demonstrate the architecture. I would like to see a link to the previous projects completed by the lead developer in funds 4,5 and 6. ", "q1r": 4, "q2": "Although the developer is experienced and has delivered successful projects, I feel the proposal will be challenging to audit. I would like to see the budget broken down beyond a single line entry. I would like to see a clear timeline with milestones committed to set dates. Furthermore, it will be helpful if some of the KPIs can be named and connected to the timeline. ", "q2r": 3, "assessor": "z_assessor_358", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "The proposal accurately addresses a problem within challenge of limited functionality within vesting contracts. The key metrics upon completion align well with the challenge being within 3 months and under 10000 dollars", "q0r": 5, "q1": "The proposer appears to have the requisite experience but without a name or a github link it is impossible to determine. The funds requested are reasonable. however it would be good to see a slightly more detailed breakdown in terms of hourly rate.", "q1r": 4, "q2": "The project is auditable purely on the successful completion of the vesting contract and on chain voting. The proposer mentions tracking the project through github and individual component completion but it would be good to see these individual components mentioned and potential timeframes allocated.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "I believe the voting on the blockchain platform will create the most realistic results. Although we can imagine its way of voting, I need more descriptive information to envision how this Dapp will operate and what specific benefits it will bring to users and the community.", "q0r": 2, "q1": "I need more information how budget allocated. For this project to reach its goal, you need trust from community, also you have to contribute high community interaction to be able to success. You need to provide more plan with details how to develop the community", "q1r": 2, "q2": "Pretty good idea with useful information although quite simple. I'd like to hear the roadmap and milestones to be achieved, which are very important to evaluate the outcome of this project.", "q2r": 1, "assessor": "z_assessor_759", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "Ma solution consiste à combiner l'acquisition pionnière avec le vote sur la chaîne, permettant aux utilisateurs de voter sur n'importe quel paramètre d'acquisition pendant qu'ils sont dans un contrat d'acquisition.", "experience": "Je suis un développeur Plutus. J'ai été financé lors des tours 4, 5 et 6 du projet Catalyst. J'ai de l'expérience dans l'achèvement d'un projet à petit budget dans les délais."}