{"id": 382662, "author": "mybrandt", "title": "ODEURADA", "url": "https://cardano.ideascale.com/a/dtd/382662-48088", "category": 26250, "amount": 10000, "description": "Intégrer les senteurs dans la crypto.\nNous avons tous besoin d'un petit regain d'énergie par jour et quoi de mieux que d'avoir un parfum créé pour vous ?", "funded": 0, "upvotes": 14450385, "downvotes": 22022002, "votes_result": 7571617, "votes_cast": 92, "f6_no_assessments": 3, "f6_rating": 1.8888888888888886, "videos": [], "media": [], "f6_assessments": [{"q0": "It is difficult from an outsider to understand how a virtual scent can replace a real one as the perfume is what makes a scent adorable. Also it is unclear what is the meaning of \"webspot\" in this project as it seems to be associated with a way of device communication (google search).\r\n\r\nThe proposal lacks in providing relevant information for the project to be implemented successfully and doesn't like it's capable to add value to the Cardano ecosystem.", "q0r": 1, "q1": "The proposal looks more like a desire than as a working project. The proposer doesn't provide relevant info regarding her experience about web design/development. Being \"passionate crypto enthusiast\" isn't enough to make use of the functionality of a blockchain, and the Cardano ecosystem in particular. Hiring a person with the necessary skills to build a blockchain related webapp from the scratch is the best choice for the future of this project.\r\n\r\nThe proposal itself reads very poorly. It needs more editing so that it can be assessed properly given its direction. Perhaps reworking it and submitting it at the later stages will work.\r\n\r\nThe plan doesn't describe the resources necessary to implement the proposal (human resources, stationary, devices etc.).\r\n\r\nIf the project timeline overlaps between different Fund Campaigns the budget should be split accordingly.", "q1r": 1, "q2": "The proposer should take into consideration the possible challenges and risks relevant to a successful implementation of the project. (is there a demand for scent NFTs? how the competition performs?)\r\n\r\nBased on the info provided it is highly unlikely that the project will pass the proposal presentation stage.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 21, "ne": 3, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "The proposal lays out a 15month roadmap, the challenge requires a useable end product for users within 90 days. For this reason, the proposal fails to address the challenge. I would advise the team to enter again in F8 under DApps and Integration catagory.", "q0r": 1, "q1": "I would like to see links to LinkedIn or Github to validate experience presented. I would like the team to develop the plan in more detail by creating a shorter roadmap with detailed milestones. I would like the team to expand on the backend and how it will tie in with the Cardano ecosystem. ", "q1r": 1, "q2": "I would like to see the team breakdown the budget into more detail, furthermore, I would like to see the team simplify the roadmap and milestones to fit a 90 day period. I would like the team to consider funding/support for the site post development, how will they fund the next 2000 NFTs.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 19, "ne": 1, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "Creative idea of ​​bringing natural scents made from plants and trees combined into a blockchain and I agree with this idea. It brings excitement to blockchain who want to own a scent of their own. There is a point the proponent should clarify, the criterion of the challenge is to have the final product after 3 months of funding, in the timeline, the first NFT product will not be released until the second quarter of 2022. If the product launches in April, May, 2022, it still fits the criteria. What is the target product audience?", "q0r": 4, "q1": "The proponent has clearly described what will be done and the functions to be completed. The proposed amount is also detailed but needs to be more clear, for example: $3000 (scenting and web development) how many people do it and how long it takes, or $3000 (coding and interacting with community) will do the interaction.", "q1r": 4, "q2": "The proponent has stated the roadmap of the job functions and 2000 scents to be created. Wouldn't it be great for the proponent to state risky challenges eg: How can anyone tell the difference between actual scent and NFT ? Or marketing communication to people through which channels?", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Je crée un site web pour que vous puissiez vous détendre avec un parfum physique pendant vos recherches sur les crypto-monnaies.\nCombiné avec un NFT, votre parfum sera à vous pour toujours.", "experience": "En tant que développeur de parfums +20 ans et passionné de crypto, je voudrais combiner les deux.\n+2 ans dans Cardano et blockchain."}