{"id": 381318, "author": "manfo2021", "title": "Clubs+hackathons = Cardano adoption", "url": "https://cardano.ideascale.com/a/dtd/381318-48088", "category": 26234, "amount": 15000, "description": "Independent or one time events do not build a continuous relationship between Cardano promoters and the target audience.", "funded": 2, "upvotes": 96124996, "downvotes": 3570282, "votes_result": 92554714, "votes_cast": 384, "f6_no_assessments": 13, "f6_rating": 4.410256410256411, "videos": [], "media": [], "f6_assessments": [{"q0": "The concept of creating courses and hackathons to engage students is great because it encourages the next generation to engage with the cardano ecosystem and potentially develop future catalyst proposals. The events are a great way to encourage new community members to understand the ecosystem and potentially contribute their own ideas. Additionally, a competitive environment, such as a hackathon are a great way to bring out the brightest minds that are looking for a way to get involved with Cardano. One question that I do have is related to the key metrics of success. 3 high schools and 4 technical institutions isn't a high number, so how can good competition be incentivized if there aren't many participants? If the proposers could answer this question, it would strengthen the proposal. (score given: 4)", "q0r": 4, "q1": "The proposers have significant experience in software engineering, so the plan is highly likely to be implemented successfully. The budget of the proposal seems reasonable given the time that will be put into the project. Clarification on the prizes and how they would be distributed would benefit the proposal.\r\nThe proposers, however, did not provide much information regarding specific examples of content that would be taught in the min courses. What kinds of content would the students be learning? If the proposers could provide some concrete examples, it would make the proposal more clear. I am also slightly unclear as to how this proposal can help reach the proposers' future goal of developing a nationwide platform that connects people with missing items or people. If they could clarify this, it would help voters better understand the proposal. (score given: 4)", "q1r": 4, "q2": "The proposers have provided good key performance indicators in the proposal. They have set concrete numbers that they aim to reach after the end of the 6 month project. However, I do wonder how the proposers will encourage long-term engagement with the cardano ecosystem and project catalyst? After the hackathons, will students be encouraged to develop future proposals or become voters/community advisors? (score given: 4)", "q2r": 4, "assessor": "z_assessor_310", "no_vca": 22, "ne": 12, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "The idea here is very interesting, it differs from the other proposals of the challenge in that it wants to promote continuous contact with the target audience, promoting meetings/mini courses in educational institutions to introduce young people about what is blockchain, Cardano, etc. I found it very positive that they intend to do a piecemeal work, it makes a lot of sense, because all of this (our ecosystem technologies) is very new for most people, and a single event, however grand, is not the best way to build a solid interest in studying and adopting such technologies. If several meetings are held, the chance of being able to mobilize new people for a more solid participation in the community is greater. What I thought here was, how long would these sessions last? Because despite there being several, the authors did not specify how many, it would be important to have this notion to understand the magnitude of the project. It would also be important for us to know exactly how they would get students' attention to attend such meetings. It is known that there will be rewards, but which ones? Would they be in ADA, local currency? Who exactly would present the contents of these meetings? We have team members here, but we don't know if they would do it themselves or would outsource the service; I believe it's them, but we don't know if they are all, we don't know if any of them have contact with the world of education, in order to have strategies to transmit the teachings. Overall, the idea is very good, and it certainly fits the challenge of promoting events that benefit the Cardano ecosystem, bringing in new participants; I would just like more details in relation to a few things, as I mentioned here. It would also be very important for them to draw up a more detailed timeline for these meetings, as I will explain in the discussion topic below.", "q0r": 4, "q1": "The team involved seems to be very well prepared with regard to the knowledge inherent to the technologies of the Cardano ecosystem. We have several professionals with different areas of expertise, speakers of different languages ​​and most with many years of experience in the profession. It would be even more interesting if they told us some examples of past work in an individual way: we know that the Wada group is quite active in Catalyst (I've already evaluated several of their proposals), and they point out some milestones already made. It is positive how they present the names of those who would be involved in the project and their roles, making the team's understanding more solid. Another thing I thought was that this project also needs less technical work in the technology area, for example, in marketing, the logistics of meetings, the production of the event itself. Would these parts be made by themselves, or by other people? The marketing part is essential for success here, because outreach is as necessary as the content of the meetings, so someone experienced to do the job would be important. I also think there will be graphical content, both in the presentations themselves (they probably used slides, graphics, visual demonstrations of what they say), would that content be done by some designer? That would be the best option, in my opinion. I missed the mention of these two professionals in the project (advertiser and designer). About the script, the authors include what they will do more generally and the subjects that will be covered in the meetings. It is possible to have a preview of what will be done, however, there could be more detail. For example, we know that they will get in touch with some educational institutions (which ones?), that will promote meetings (if we already had dates, or at least we knew how often they would happen, it would be better) and also the topics covered in the meetings (They could divide which ones would be addressed in the first moment, and in the second meeting, so on). On the financial division, I think it was the most superficial part of the proposal, unfortunately, we don't have a very deep understanding of what will be done with each part of the money they mention. For example, 9k in prizes: what would be the value of each prize? Is it real money, or do the authors intend to buy equipment such as notebooks and give it to the winners? In the motivations of the team/misc. other motivations, it would be good if they included explanations of what this is about, I didn't quite understand. In general, the authors provided us with information about the team, script and financial division, but there could be more details in the script and especially about the money, for a better understanding of the project.", "q1r": 3, "q2": "The authors provide us with valid information so that we can carry out proper monitoring. Success here would be measured in two ways, in my opinion. At first, based on the data cited by the authors: the number of young people and institutions involved in the project. But also, we could follow what each participant would do post-events. For example, let's say that of the 42 students involved, 20 showed a strong interest in entering the community, whether through study in programming, the Catalyst project or other areas. It would be very worthwhile to monitor the progress of such young people, in this way we could also monitor if the project is bearing the desired results! In summary, I believe that the project's auditability is quite possible and not that complex, it is enough that some members of the community commit to following the data cited by the authors (or even provide feedback themselves) and that there is a follow-up after the events for those who showed interest in getting involved going forward.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "A great proposal that I reckon comes from the insight gained of continuously being involved in the Cardano community. There are indeed currently various events that act as placeholders but rarely are there events that attempts to enter non-Cardano communities such as this proposal. Seeing that education is key for Cardano, approaching education centers such as schools, universities through the creation of Cardano University Club logically aligns and is a non-invasive way to introduce Cardano. Being non-invasive is essential because educating tends to be invasive, educating on something new takes a lot of time. By integrating with the clubs ecosystem in the universities, although they all have their own topics, all interact and acts as a melting pot to get to know one another. This social aspect of introduction seems to be diluted in the current Cardano approach. Again, great proposal, totally see it being scalable and totally fits with the Challenge.", "q0r": 5, "q1": "Based on the information provided, the stated team has what it takes, although there are no links that proves so. Educating is a passion and the team majority being teachers themselves, add to that their software developer background, this proposal based on those specific data has the potential to be well-executed. Additional info such as what schools and education institute the team will approach would also help in gauging the teams assessment capabilities and the success of this proposal. Example; if the team where to target a school that is multiple steps away (from a basic academic skill perspective) from being exposed to blockchain technology, then this proposal will perhaps become ineffective. Unfortunately, as much as I love this proposal, all the budget components are not clearly broken down. Specifically the prize element with budget of $9000. $9000 can be in it's own a proposal itself, which merits the need to clearly state the use of. Then there is the motivation budget of $5000 and $1000. Perhaps this is just wording, but it would be more logical for the budget to be fleshed out, as an example; Guest Speakers invitation, educational and motivational videos on YouTube that can also act as your marketing materials or services for setting up the clubs in the universities. Such a shame the project management aspect of it is does not instill confidence of this beautiful proposal being executed well.", "q1r": 3, "q2": "This proposal also unfortunately does not have a clear roadmap and timeline on how it will achieve their deliverables. It is leaning towards -take your word for it- that this proposal will achieve the metrics it has put on themselves. Would have been great if the standard 0-3 months, 3-6 months metrics were available to look over. As mentioned there are measurable KPI's, although lumpsum it can be audited. The problem statement and solution has a strong interconnection and is spot on.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": " \r\n\r\nThe problem needing to be solved been identified and articulated namely that Independent or one time events do not build a continuous relationship between Cardano promoters and the target audience.\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief  \r\n \r\nThis proposal shows clearly how it adds value to the Cardano system as it would create a continuous relationship with local schools via clubs and prize driven hackathons \r\n \r\n  Key metrics are clear, reasonable and realistic. THese include  Number of schools, how many students in clubs, how many tech institutions, how many clubs,  \r\n \r\n \r\nThe key metrics and goals of the proposal fall within the scope of the challenge.\r\n\r\n \r\nProposal can scale to address future challenges by increasing the numbers of abovementioned key metrics. \r\n\r\n\r\nThis project will have a positive impact on Cardano system by increasing the awareness and skills in schools and tech institutions for Cardano Tech and skills\r\n\r\nI have given this proposal a 4 star rating because it has gone into detail and shown a realistic and reasonable understanding of the scope of work as well as a reasonable budget. \r\n\r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.", "q0r": 4, "q1": "\r\nThe proposer has   provided evidence  of himself  where he is has experience of various WADA projects that have got funding. \r\n \r\n \r\nLinks provided are sufficient.\r\n \r\n I have visited these links \r\nThe proposer is competent to organize and run this event.   \r\n \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\n\r\nThe proposal  gives  details of other partners from different parts of Africa.  \r\n  \r\nHe has provided the team structure of partners  \r\n\r\n \r\n The budget has  been outlined broadly and broken down into identifiable items. General  costs have been given for the various costs. Ideally a budget breakdown should be provided.\r\n\r\nIs budget reasonable to achieve the set goals?\r\nThe budget is   reasonable to achieve the set goals.  The only point of concern is that 9000$ for prizes and 5000 for team motivation is somewhat high.\r\n\r\n\r\n\r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required.  \r\nThere is no plan for additional funding  if objectives are not met. \r\n\r\nThe timetable is realstic to organize the event.\r\n \r\nThe proposal  does not  provide  a sensible and conductible plan for implementation. IT only has a broad outline of categories of costs.\r\nResources  necessary to implement the proposal are not well described beyond broad cost centres\r\nThe proposal has no technical aspects which have need to be addressed  \r\nThe proposer has not identified risks in this proposal  \r\n \r\n \r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\nGiven experience and plan presented it is possible this proposal will be implemented successfully hence I have given a 3 star rating. I would have given a 4 star rating if a proper budget and schedule of actual costs, and activities was given along with a timeline.\r\n", "q1r": 4, "q2": "There is a  roadmap with milestones and a time horizon for achievement  but with only broad goals.  how these are to be acheived is not laid out. \r\nThere are  clearly defined Metrics/KPIs that define the success of the proposal  they could define number of schools, how many students in clubs, how many tech institutions, how many clubs, how many new wallets.\r\n\r\nThere is a clear understandable description of the targeted problem  \r\nThe proposer has not identified possible hurdles, challenges and difficulties. \r\nAre there contingency plans in place for various outcomes?\r\n \r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\nThe information provided is sufficient to audit the progress and the success of the proposal hence i have given a 4 star rating. ", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 17, "ne": 4, "ng": 5, "nfo": 8, "vca_o": 1}, {"q0": "''Clubs+Hackathons=Cardano adoption'' the tile of their proposal shows how the proposers are pushing the idea one step ahead of common ideas on community events. I feel they would like to scale up the community members involvement and participation. This idea clearly aligns with the challenge ", "q0r": 5, "q1": "Metrics, KPI and budget are well detailed. What I feel is missing from my opinion is to describe how will those hackathon prizes be won. \r\nAlso, the universities and schools may have been described, and their level of involvement in this project as partners.\r\nHaving prizes for participants and other motivation would attract more people, and also would help students cover some of their school related expenses, which will encourage them to stay involved. And get them start using the Cardano, while receiving the ADA token through various prizes.", "q1r": 5, "q2": "WADA as a main partner in this proposal, is a guarantee about auditability and evaluation of the success.\r\n", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have organized various events and know about the importance of setting them up properly content-wise for them to be successful, so I am confident I can determine whether their concepts are set up in a meaningful manner. Since I am also Participating in catalyst since several funds I am competent to determine what kind of community events could be beneficial. The proposal identifies an important problem within the challenge which by adressing it, will bring an great benefit to the Catalyst community and the Cardano ecosystem - by increasing the traction and adoption of Cardano by continuous efforts. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": " Well-defined, detailed metrics are presented that define the success of the proposal. A clear, understandable problem description is supplemented by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 17, "ne": 4, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The club & Hackathon proposal will give the meaningful recurring events to promote Cardano. The example of which are content creation, Clubs & Hackathon events. It fits within the challange nicely.", "q0r": 5, "q1": "The Wada team has organized the monthly meetups regularly. The team has good track record to implement the project successfully. The roadmap,  budget and KPIs are mentioned in the proposal. The KPI should be revised upward to reach the full potential of this proposal. ", "q1r": 4, "q2": "The project budget is traceable as they will detail how much they will spend on clubs, hackathons etc. Suggest that they increase their reach in KPIs and address risk & challenge fot  the project. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The project team, Wada have initiated and supported a number of monthly introduction to Cardano meet-ups across hubs in France and Africa. This project is aimed at the introduction of Cardano and blockchain technology in schools in Africa, adding value to the Cardano ecosystem through diversifying particiaption and opportunity to young people that are seeking to leverage technology to grow their future careers. The project is aligned with the challenge and increases particpation and engagement through incentivised hackathons using Cardano technology. \r\n\r\nThe project has a local focus, however it is a model that could be tested and refined for other regions as mentioned in the proposal the WADA team have plans to implement this in the USA soon. \r\n\r\n\r\n", "q0r": 4, "q1": "Schools are notoriously difficult partners to engage so seeing that the team has two qualified Maths teachers involved from the outset gives some indiciation that there will be a solid understanding of how to engage and integrate this project within a school setting successfully. \r\n\r\nThe team have some impressive experience that is aligned with the objective & have demonstrated expertise through already working in this space in multiple locations. \r\n\r\nThe timeline and budget are clear and specific, project timeframe is 6 months with clear objectives within this period to be achieved, and attached to budget allocation. There's little discussed around risk, however it does appear the team have expertise relevant to working in school environments and would be able to handle this space. ", "q1r": 5, "q2": "The project timeline and budget are clear so there is a way for the community to ensure the project is on track. It is however very much locally driven which would require the project team to develop some way for them to report back to the community to share updates with the progress of their project. ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "I strongly agree with the proposers about the problem statement 'Independent or one time events do not build a continuous relationship between Cardano promoters and the target audience'. This is definitely within the challenge which need to be solved. The proposal clearly articulates how it will add value to the Cardano system as well as how it fits into the challenge.\r\n In my opinion, it is a great idea because the proposal's target audience are young students (in local schools, universities and technical institutions) who will be human resource potential for Cardano system, and because the proposal's purpose is create a strong and committed relationship between those people and Cardano ecosystem by reoccurring events in schools and universities through Hackathons sessions and Cardano Clubs. While single events introduce contents (about Cardano),  continuous events will make that contents go deeper in people's minds and surely make a good connection participants-participants as well as participants-Cardano system.", "q0r": 5, "q1": "I agree that the proposal is likely to be successfully implemented because of following points:\r\n- The proposal decribes in detail what being done in the past and present (success organizing monthly meet-ups with contents about Cardano, Project Catalyst, and Blockchain technology and success established active hubs in some African countries). The team also provide link to be evidence. Additional, the proposal provides type and number of team members and roles in the proposal. That means the team has ability and experience and relevant skills to implement the proposal successfully.\r\n- The budget is clear and broken down into identifiable items and reasonable to achieve the set goals.\r\n- The prosal provide a plan in which what is being and done as well as how to do in 6 months. (They also have already had connections with 5 local schools. That is an advantage for the success of the implementation.) \r\nHowever, I would recommend the proposal should add the timetable to complete the work in each step.\r\n", "q1r": 4, "q2": "The proposal has roadmap and clear understandable description of the targeted problem as well as the solution that addresses the problem. Metrics are also clear and easy to audit. Therefore I rate auditability with a score of 4. \r\nHowever I recommend the proposers should add milestones and time horizon in every two-week or every month , so that it is easier for the community and the challenge team to audit the proposal. ", "q2r": 4, "assessor": "z_assessor_714", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "As the goal of this proposal is to reoccur events in schools through hackathon sessions and club, this proposal fits into the challenge settings. If this proposal is implemented, Cardano undoubtedly will benefit. ", "q0r": 5, "q1": "With the information provided I believe the team is experienced and skilled. The budget is stated and broken down into identifiable items and for me that is good. The plan is reasonable to implement the proposal. The proposal has not expressly outlined challenges that may arise from the implementation of the proposal.", "q1r": 4, "q2": "The proposal provides a roadmap. Milestones are vague. The proposal has not stated a time horizon for implementation of the proposal. However, the targeted problem is well described.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Great initiative, I think the reward would stimulate healthy competition for an exciting engagement at events in Cameroon. The target group is one that has a lasting future and would impact meaningfully the lives of students.", "q0r": 5, "q1": "The team has great experience to deliver the project successfully. It is great to have an educator on board. This would help easy adoption and set-up club on campuses. Clubs are effective in creating continuous engagement. \r\n\r\nThe KPIs are specific and measurable as well. With a well-defined success, it would be easy to implement the practical step outlined in the proposal. ", "q1r": 5, "q2": "The proposal has a detailed road map of activities and has established partnerships within the community for easy tracking and auditing. I think this would impact greatly in Cameroon and should be supported.", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "I agree with the fact that developing a sustained interest about the cardano block chain in the minds of new community members requires incentives and a sustained hosting of hackathons events. Therefore this proposal is well defined to address the challenge.", "q0r": 5, "q1": "Taking into account the team leads work experiences and that of the experience of WADA in the Cardano community makes them ideal to handle this project. More importantly, the target audience that is the students, is well captured and there is a well-developed timeline for the proposal. Also, there are well outlined events scheduled within specific timeline for the project and a work breakdown structure is also incorporated within the proposal. The events scheduled for the proposal will definitely increase the cardano presence in the various selected schools in  Ghana and also increase the user base.", "q1r": 5, "q2": "By way of determining the progress and success of the project, the team intends to meet set targets. For instance, the team intend to engage;\r\n1. 3 high schools \r\n2. 4 technical institutions and also ensure that \r\n42 students are also present in any cardano event participating\r\n  3. create 7 cardano clubs in the schools.\r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is about continually hosting of training events with rewards mechanisms for competitions across various participating institutions  towards a particular targeted audiences. The idea within the brief and requirements of the campaign and its immense benefits to onboarding new members to the ecosystem ", "q0r": 5, "q1": "From the information, am convinced that with experience and skill presented by the team, it seems very obvious that this proposal is very feasible. A point to note is the plant to collaborate with other experts across the region(WADA). However, I would have expected that the proposal considers any potential risk factors that derailed the goals of the project considering the global health issues and having to deal with local institutions and schools across the country, this information will be helpful.", "q1r": 4, "q2": "The success measures to assess the progress of the project is adequate to monitor its success although a detailed roadmaps and /or stages of deploying would helpful in assessment of the proposal.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "Create a continuous relationship with local schools via clubs and prize driven hackathons to spark deep interest in the Cardano ecosystem", "experience": "Wada Cameroon team: Senior Software Architects and Teachers (15 + years experience)"}