{"id": 384017, "author": "erasmus", "title": "Conservation factory phase 1", "url": "https://cardano.ideascale.com/a/dtd/384017-48088", "category": 26234, "amount": 50000, "description": "Competing demands, eg. over fishing, bad agricultural practices leading to the degradation of a lake ecosystems affecting local livelihoods.", "funded": 0, "upvotes": 14710448, "downvotes": 23970197, "votes_result": 9259749, "votes_cast": 238, "f6_no_assessments": 16, "f6_rating": 1.3333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "While this proposal has in general a noble goal, teaching communities about conservation and protecting the environment, it does not mention at all how Cardano, or even blockchain in general are helping with this purpose. While it would definitely help communities in general, it doesn't present how it would impact the Cardano ecosystem at all. ", "q0r": 1, "q1": "While the proposer states several times through the project, that people will be educated on power structure, will be educated on how to monitor environmental impact and so on, it does not describe how that education will take place. How can we as a community evaluate if people have indeed been educated, if we don't know beforehand how that process will happen, in order to measure the effectiveness of the plan? There is also no detailed description of prior experience, only a profile name called \"Erasmus\" and claims of having 27 years of experience in Academia.", "q1r": 1, "q2": "While the proposal has a detailed budget, hidden in the attachment, but not present in the main text as well, it  lacks a detailed plan, roadmap, KPIs or other elements that could contribute in the assessment of the progress or success of the proposal. Since it also doesn't seem, at this point at least, to be related to the Cardano ecosystem, I would suggest a resubmission with a clearer focus on how the Cardano community would benefit and help and also include all the missing info that for now is not present.", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 23, "ne": 7, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This is just an idea not a proposal The idea itself is not a practical one and no details have been given as to how it meets the Challenge goals \r\nThere is no basis on which to assess this proposal as there is no link to the Challenge Goals or how this proposal provides a solution\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.I have done live event with guests in studio, discussing various topics on the State Broadcasting Channels for both National and International audiences.\r\n\r\n", "q0r": 1, "q1": "\r\nNo profiles or experience of team members are given, no budget is given, there is no breakdown of costs or anything at all\r\n\r\n\r\nI cannot give this anything other than a 1 rating", "q1r": 1, "q2": "\r\nThere is no timeline of activities, measurable metrics or KPIs or anyway to audit anything. There are no contingency plans, no auditable reporting or anything that can be tracked or assessed. I can only give this a 1 rating\r\n", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 21, "ne": 2, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "This proposal effectively address the challenge because it gives a clear solution to the defined problem statement. But from this point on, all other information is not suficcient to properly assess the proposal:\r\n- what is the link between this proposal and the cardano community? (How to leverage Cardano to achieve the goal)\r\n- Funds spending is not clear\r\nDue to the above I can't agree with this proposal.", "q0r": 1, "q1": "This proposal is not clear on the following points due to which realization of the proposal is at least questionable:\r\n- team is unknown\r\n- detailed plan (schedule) is missing\r\n- budget is not explained\r\nDue to the above I can't agree with this proposal.", "q1r": 1, "q2": "This proposal is not clear on the following points due to which realization of the proposal is at least questionable:\r\n- No clear deliverables (cardano connection with the project=?)\r\n- detailed plan (schedule) is missing\r\n- KPI not shown\r\n- Risks and challenges are not presented\r\nDue to the above I can't agree with this proposal.", "q2r": 1, "assessor": "z_assessor_605", "no_vca": 20, "ne": 0, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "This proposal unfortunately is situated in the wrong Challenge. The topic brought up by the proposer can fit the 'DApps and Integration' Challenge but the proposer needs to find a blockchain developer who shares the same passion and knowledge or a partner that is already into Regenerative Farming. The key here is, 'Regenerative Farming'. Add this keyword strategically into the existing proposal, would make it to a certain extent able to be review in the 'DApps and Integration' Challenge. With that imaginary scenario in mind, this proposal in it's current state can not be reviewed on it's IMPACT for there is no data. Recommend to seek out Catalyst School, starting with their YouTube channel to learn more about the methods in preparing and submitting a proposal.", "q0r": 1, "q1": "Again with the imaginary scenario as mentioned above, with the experience the proposer has, there is potential the proposer will be capable of implementing an education program on sustainable farming, if they were able to find a partner that is already involved in Regenerative Farming. Unfortunately, due to only providing the proposers experience and a very helicopter view of the budget, this proposal will most likely be unsuccessful. Please do reach out to Catalyst School and to study the topic on Regenerative Farming.", "q1r": 1, "q2": "Keep in mind this assessment is based on the imaginary scenario in the IMPACT section, this proposal does not provide a roadmap but does have some metrics although it will be very difficult to measure. Problem statement and solution are actually solid. Besides that, this proposal will not be able to be audited. Situation will change when this proposer studies on and find a partner already involved in Regenerative Farming. Add to that, participating in Catalyst School workshops, this proposal has potential to be one of its kind.", "q2r": 1, "assessor": "z_assessor_635", "no_vca": 22, "ne": 8, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "\"Environmental problems have always been a big problem for the whole world for a long time now and in the future as well. Therefore, solutions to help build ecosystems and habitats for species and humans in a clean and sustainable way are always solutions with high impact on the environment.\r\nBut this proposal is just ideas about things that can be done to make a positive impact on the environment such as education, Create awareness on economic opportunities that are environment friendly, Empower local community members to be responsible and maintain a sustainable environment proactively,...... I would like to see a more concrete plan and solution. From there, it is possible to assess the impact of the project on the environment and society.\r\nIn addition, the proposal doesn't seem to be a good fit for this challenge\"", "q0r": 1, "q1": "Proposer is a Natural resources manager with 27 years of functional experience from the public sector, NGO and Academia. But I don't see any evidence for this proposer's experience. Besides, everything of this proposal is still an idea, there is no specific plan or solution. Therefore, this proposal is not feasible", "q1r": 1, "q2": "As there are no deliverables or timelines, there is nothing that can be audited. No KPI's or goals have been set.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 20, "ne": 3, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The problem in this proposal is appearing anywhere in the world and within what this challenge wants to address. But the proposer just gives us some single ideas about the activities without a detailed implementation plan and key metrics or KPIs to know exactly what is this project will bring to people and Cardano ecosystem. \r\nSo I think this proposal has no impact. ", "q0r": 1, "q1": "My recommendation for the organizer is that they should have an implementation plan in detail that can describe what he wants to make in it, and what purpose he wants to do overall. For this idea, I think there are a lot of activities that relate to event organization, education, information delivery online and offline, marketing... \r\nThen after identifying what he wants to do, and having a detailed implementation plan, now he can break down the budget that he wants to be funded for running those activities. \r\nThat will help Catalyst assess this proposal. \r\nLacking a lot of basic above, can't approve that this proposal will work. ", "q1r": 1, "q2": "As I recommend in 2 previous comments, they should provide those infos. Including roadmap and key metrics, lacking these both can't help to audit. \r\nMoreover, the problem that he mentioned in the first place should be explained more, then show how his solution - here is education program can help to solve it. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 20, "ne": 2, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The proposal has a problem that within the challenge but has nothing in detail. It doesn't have info about how it will impact on Cardano ecosystem. \r\nIt also doesn't have any key metrics or plans to measure whether what this idea brings is meet the challenge or not. ", "q0r": 1, "q1": "This proposal lack all basic info for assessing the feasibility. The short brief is not enough for assessing. They should inclcude: \r\n- Detailed implementation plan for knowing what they will do with their solution to address the problem. Not just about the features, but also includes use cases, technology explanation, marketing, activities... the more detail is great\r\n- Detailed roadmap and budget to assess that are they reasonable with plan or not \r\n- Team info to clarify the ability to execute the plan \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. \r\n", "q1r": 1, "q2": "Cannot scoring the auditability of this proposal because it lacks everything for that. For auditing the progress and success of the proposal, it must have: \r\n- A roadmap with milestones and a time horizon for achievement. And metrics/KPIs that define the success of the proposal. Those 2 will help Catalyst track and audit in periods. \r\n- Clear understandable description of the targeted problem. And the clear understandable solution that addresses the problem. These 2 will help to know what is this proposal expects up front. \r\nThis proposal have none of them. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 20, "ne": 3, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The proposer shows nothing but only problem and solution statements. Also, he doesn't provide any key metric or info to prove that this solution will help the Cardano ecosystem. ", "q0r": 1, "q1": "This is a blank proposal, for proposing a good proposal and enough materials for assessing the feasibility they must give info about a detailed plan they will do, roadmap that with a clear timeline of activities will get, clarify team member info, the budget that is reasonable with the plan and roadmap, risk-relevant that team will face off.", "q1r": 1, "q2": "The proposer provide nothing in this proposal to audit it. \r\nNo plan, no roadmap, no key metrics in this proposal.\r\nThere is also no info about the problem explanation and no info to say how the solution can help to solve the problem.", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 19, "ne": 0, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "This proposal is about undertaking education programs for locals to appreciate the impact of negative practices on the ecosystem and the need for balance. This is a great/interesting idea in terms of sustainable development. The problem remains very abstract.\r\nThe solution is not clear enough / remains very abstract,  how problem and solution in the relation to the challenge and the Cardano ecosystem as a whole ?\r\nTherefore, based on the given information, I strongly disagree that this proposal effectively addresses the challenge, I rate it with a score of 1", "q0r": 1, "q1": "There is a lacks: (1) information of team/proposer; (2) information of demo/pilot is provided; (3) roadmap and KPIs; (4) budget breakdown; (5) Risks and mitigation. Therefore, based on the given information, I strongly disagree with this proposal's feasibility, I can rate it with a score of 1", "q1r": 1, "q2": "There is a lacks: (1) information of team/proposer; (2) information of demo/pilot; (3) roadmap and KPIs; (4) budget breakdown; (5) Risks and mitigation.\r\nTherefore, based on the given information, I strongly disagree with this proposal's auditability, I can rate it with a score of 1", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 19, "ne": 0, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "The proposal is good.  but then I don't see how cardano community would benefit from the proposal because it is centered on creating the awareness of people on their environmental issues. It would have been good you stated how the proposal would add value to cardano. ", "q0r": 3, "q1": "I think that the proposer is quite experienced(27 years). What I can't see is the evidence of your past education programs, it would have been good you added it. Another challenge I have with this proposal is that, there is no team for the execution of the proposal. \r\nI can see the budget but the budget is not further broken down into identifiable items.", "q1r": 2, "q2": "Milestones are not clearly stated and also the time horizon for the proposal execution is not given. Key metrics that define the success of the proposal are also not captured.", "q2r": 2, "assessor": "z_assessor_717", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "A great idea that seeks to directly educate local stakeholders on the negative impact of some degrading activities on the environment. It would be great for the proposal to focus on a specific community, the current state of the proposal is too generic with no plan to impact Catalyst", "q0r": 2, "q1": "The team has 27 years of experience in natural resource management which would be helpful for the successful implementation of the proposal. However, there are no specific deliverables in the proposal or metric to define success or measure impact.", "q1r": 3, "q2": "A good budget breakdown would have been more useful. Also, there is no in-built documentation of activities to ensure transparency and openness for auditing. ", "q2r": 2, "assessor": "z_assessor_727", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "A wonderful idea for the conservation of the environment but does not meet the goals of this particular challenge. please develop it further and seek guidance from the community on how to get it through.", "q0r": 2, "q1": "Great experience for the idea but the plan should also include the time schedules", "q1r": 3, "q2": "The budget will need to be broken down further to show what amount will be going into what", "q2r": 1, "assessor": "z_assessor_728", "no_vca": 16, "ne": 0, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The problem statement is not well defined. Aside that, the proposal fails to provide guidelines on how the project will impact the cardano ecosystem. Therefore I am of the opinion that this proposal, though provides a solution for the problem, the solution is not enough, especially taking into account its value addition to the cardano ecosystem", "q0r": 2, "q1": "Taking into account the nature of the proposal, the experience of the team lead is great. Additionally, the proposal provide a detailed breakdown of the budgetary allocation for each event the team seeks to undertake. However, there are no timelines for executing each event. More importantly, there is no work breakdown structure that outlines how the project will be executed from start to finish. Base on the lack of proper planning outlined in the proposal, it will be difficult for the project to be implemented successfully.", "q1r": 3, "q2": "The details required in respect of metrics to gauge and track the progress and success of this proposal when funded is not sufficient. Ideally there should have been a database for all trainees to monitor their progress but the proposal failed to provide that.\r\n", "q2r": 2, "assessor": "z_assessor_732", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "the message of conservation is an important message to the planet today but this message does not meet the goals of this challenge. As good as the idea is there is no plan to bring people into the ecosystem, increase number and quality of proposals etc.", "q0r": 1, "q1": "The plans and experience of the proposer is great and matches the proposed idea but unfortunately may not work for this challenge", "q1r": 1, "q2": "the proposal presents an auditable plan but the shortfall is that it is not meant for this challenge.", "q2r": 1, "assessor": "z_assessor_733", "no_vca": 19, "ne": 0, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "A very noble plan, however, the proposal doesn't really address any of the objective of the challenge. Much more detail is required here with reference to how this proposal meets the challenge brief of community events.The rating reflects this.", "q0r": 1, "q1": "Unable to assess the feasibility of this proposal, $50K has been asked for but no details on plans, deliverables, resources and budget breakdown have been provided.  The proposal seems to be in its infancy .", "q1r": 1, "q2": "Unable to assess this section as no metrics, KPIs, risks etc have not been articulated. The score reflects this. ", "q2r": 1, "assessor": "z_assessor_774", "no_vca": 20, "ne": 2, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "I think this proposal (by somehow) was put in the wrong challenge and it was not written completely. The proposal is planning on educating people that bad agricultural practices will degrade our natural ecosystem. There is no signs of blockchain/ Cardarno/ Catalyst community get involved. ", "q0r": 1, "q1": "Since the proposal doesn't address the challenge. I rate its feasibility the score of 1. ", "q1r": 1, "q2": "This proposal doesn't provide me sufficient information to assess. ", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 23, "ne": 1, "ng": 12, "nfo": 10, "vca_o": 1}], "solution": "Undertaking education programs for local to appreciate the impact of negative practices on the ecosystem and the need to for balance.", "experience": "Natural resources manager with 27 years of functional experience from the public sector, NGO and Academia"}