{"id": 381053, "author": "jaitnez", "title": "New d-EdTech Platform for LatAm", "url": "https://cardano.ideascale.com/a/dtd/381053-48088", "category": 26242, "amount": 51040, "description": "Milhões de pessoas na América Latina são afetadas pelos baixos padrões e distribuição desigual da educação, e pela precariedade da indústria do trabalho.", "funded": 2, "upvotes": 109327718, "downvotes": 6268567, "votes_result": 103059151, "votes_cast": 300, "f6_no_assessments": 10, "f6_rating": 4.666666666666666, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=12695"], "media": [], "f6_assessments": [{"q0": "A equipe da proposta argumenta que as lacunas educacionais entre as classes sociais podem estar contribuindo para a baixa presença da América Latina no ecossistema Cardano, como uma latino-americana que esteve no sistema educacional público e privado em mais de um país da região, concordo plenamente com a afirmação. Embora já tenha sido explorado em outros ecossistemas, a equipe planeja abordar este problema criando uma plataforma educacional que utilize o módulo Learn-to-Earn pode ter um impacto significativo sobre o ecossistema CARDANO. Apesar de ser um projeto ambicioso, a equipe o separou inteligentemente em 5 fases principais que permitem à comunidade avaliar o impacto que a equipe planeja ter em cada fase. Entretanto, um aspecto que poderia ser melhorado nesta proposta é que ela começaria a ter um \"impacto real\" depois de 2 anos desde que se planeja ter conexões com a indústria e professores participando. Eu recomendaria que a equipe incluísse como um produto a ser entregue do MVP (12 meses) um teste piloto do MVP com métricas de sucesso como resultado do teste.", "q0r": 5, "q1": "Os membros da equipe conseguiram reunir um conjunto muito diversificado de habilidades e experiências em uma ampla gama de disciplinas. As referências no LinkedIn foram fornecidas, de modo que a experiência pode ser verificada a partir dessa perspectiva. Um ponto crítico que talvez esteja faltando na equipe de proposta é uma pessoa com formação educacional/pedagógica, eles descrevem nos comentários da proposta que contam com assessor com tal experiência relevante, mas infelizmente não forneceram nem a descrição nem os links de referência a ela. Eles fizeram um excelente trabalho em relação à descrição do orçamento, também em relação à identificação de riscos futuros que tentam com uma implementação bem sucedida.  \r\n", "q1r": 4, "q2": "Eles fizeram uma descrição muito boa das cinco fases desde o curto prazo (3 meses) até o longo prazo (após 3 anos), cada uma com uma breve descrição do que acontecerá. A equipe deu um passo adiante, explicando à comunidade exatamente o que aconteceria no curto prazo, incluindo as ações de recrutamento, desenvolvimento e pesquisa. Além disso, a equipe identifica em detalhes que métricas de sucesso espera ter, que considero relevantes, particularmente a partir do segundo ano, pois serão estas que terão um impacto tangível. Outro elemento que acrescenta a auditabilidade é a natureza de código aberto da plataforma. Isto permitirá à comunidade compreender em detalhes como o projeto está progredindo e em que direção está se dirigindo.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 25, "ne": 15, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Esta proposta dialoga muito bem com o objetivo do desafio de incentivar o desenvolvimento na América Latina, através da criação de uma plataforma educacional voltada para a tecnologia, o que certamente ajudaria na questão da precariedade educacional e das oportunidades de emprego no continente. No entanto, gostaria que os autores esclarecessem como a cadeia de bloqueio Cardano se encaixaria aqui, certamente dentro dos ensinamentos tecnológicos que nosso ecossistema seria muito abordado, assim como o uso do DID, que também se relaciona bem com um desafio de fundo anterior ( Atala Prism). Apesar disso, senti uma falta de segurança sobre como este projeto traria feedback para a comunidade Cardano; sei que este feedback existirá, mas seria ótimo ter detalhes sobre isso. Quanto a fazer a diferença no continente, não há dúvida de que tal projeto é muito necessário e promissor, os autores também poderiam especificar qual público-alvo pretendem atingir em princípio, em qual país da América Latina, em qual faixa etária, etc. Outro detalhe sobre o qual eu estava em dúvida seria o custo dos cursos oferecidos pela Academia Ayllu. Por qual moeda, ada, moeda local eles seriam pagos? Qual seria o preço médio dos cursos, e a quem este lucro seria destinado? Seria interessante saber melhor como funcionaria esta parte mais financeira da plataforma, embora eu saiba que eles são detalhes, mas detalhes relevantes. Como um todo, o projeto corresponde ao que é exigido neste desafio.", "q0r": 4, "q1": "A equipe aqui envolvida está certamente qualificada para realizar bem o projeto; sabemos quem são, seus nomes, um breve histórico de suas origens e experiências anteriores, e também seus perfis no LinkedIn, onde podemos conhecer cada um deles com mais detalhes. Seria interessante, entretanto, que os autores tivessem demonstrado um maior interesse em se preocupar com a parte de usabilidade da plataforma, ou seja, construir um design UX que fosse simples e ergonômico, para aumentar ainda mais os benefícios do projeto, fazendo com que o público alvo tenha facilidade de navegação. Outra coisa é a questão do marketing, não está claro se eles pretendem contratar alguém que seja profissional e encarregado de realizar esta parte do projeto, ou mesmo uma equipe de publicitários, como seria esta publicidade, etc.? É um projeto enorme, portanto, precisa de muita publicidade para chegar ao público. Com relação às etapas que comporiam todo o projeto, os autores especificam muito bem o que aconteceria em um determinado período de tempo. É sempre vantajoso traçar um cronograma de atividades a serem concluídas, em paralelo com o sucesso alcançado ao longo dos meses, como eles fazem em grande detalhe. E em relação ao orçamento, também é explicado em muitos detalhes, de modo que temos um sólido entendimento de como o dinheiro solicitado seria utilizado, quais partes custariam quanto e assim por diante.", "q1r": 5, "q2": "Esta parte da proposta é muito completa, temos os KPIs necessários para entender se o projeto está alcançando o que pretende, sabemos quais são as ambições da equipe, mesmo em relação ao número de estudantes na plataforma. Achei muito interessante como eles elaboraram um cenário ideal, ou seja, o contexto no qual tudo estaria acontecendo da melhor maneira possível, o que envolve auto-sustentabilidade e assim por diante. Também sugiro que haja algum canal de comunicação entre a equipe e a comunidade Cardano durante a execução do projeto, pois é enorme e envolve vários aspectos (programação, design, educação, marketing). Poderia haver reuniões periódicas ou mesmo a entrega de resultados parciais, com os quais poderíamos avaliar o progresso das coisas. Mas isso é uma sugestão bônus, eu acho que a auditabilidade aqui é muito boa.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 19, "ne": 15, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The key metrics and goal of this proposal also align with the challenge settings, that is developing application that might be useful in other parts of the world. And also this proposal will give impact on their local communities, by adding value to increase the education by giving Plutus course in Spanish for LatAm community members.", "q0r": 5, "q1": "The team consists of several Plutus Pioneers and also experience management team. And they provide valid LinkedIn profile. Budget is outlined clearly and broken down properly. And the sum is still reasonable in my opinion to develop an educational platform. Moreover, the team also include realistic time frame to complete the work that they mention in the proposal. The proposal clearly describes the resources necessary to implement the proposal, such as development team & academic advisor on it. If funded, I think this team could implement their proposal accordingly.", "q1r": 5, "q2": "The team break down their roadmap & phase into several parts. And I think this helps the team to achieve their milestone in a good way. The metrics and KPI are defined clearly in 3 phases, such as short/medium/long term goals. It would be great if they could also include GitHub or website link, so that the community could track their project progress if funded.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 19, "ne": 2, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "The New EdTech platform for LatAm will help to draw new community members into Cardano Ecosystem by deploying the Learn-to-earn model. The EdTech platform is very much needed for LatAm community and has a very high potential to scale.", "q0r": 5, "q1": "The proposer team is comprised of 4 individual team members from different countries in the region give the broad perspective of scaling the product into this region. The budget is broken down in detail although it seems quite high for educational content creators. The proposal outlines a realistic timetable for the implementation but did not go into detail about platform and technical know-how required to build the platform. This could pose potential challenge to implement the proposal successfully. ", "q1r": 3, "q2": "The project will be open-source. It also has milestone and timeline to split project into phases making it easy to audit and monitor the progress. It should elaborate more on the technology aspect and the edTech platform features that would be included...", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "What a great way to grow Cardano's impact in Latin America. Having Spanish-language open-source education is the most important first step.", "q0r": 5, "q1": "This team has an incredible amount of experience in software development. Through their qualifications you can see that this team is experienced, organized and ready to start building. Additionally, their proposal has KPIs, a project schedule, and a budget breakdown that proves the team can be effective.", "q1r": 5, "q2": "This proposal outlines their kPIs, project schedule, and budget breakdown. From this information, the Foundation and community can audit the project's progress.", "q2r": 5, "assessor": "z_assessor_668", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This proposal is about building an EdTech platform that incentivizes participation to promote growth in a technology-oriented educational landscape, and relevant job industry. This is a great idea (an open-source Learn-to-Earn). The problem is clearly described, and explained in detail with the context in LatAm. Solving this problem is fit for this challenge.\r\nThe solution is clearly defined with a timeframe for the short, mid, and long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is clearly described with suitable skills, experiences for implementation. however, it would be better if the information of demo/pilot is provided. The roadmap is clearly defined with short, mid, and long term. The budget is clearly described (with a total budget, items structure, and explanations of calculation base). There is a lack of risk and mitigation.\r\n\r\nTherefore, based on the given information, I agree with this proposal's feasibility, I can rate it with a score of 4", "q1r": 4, "q2": "There is full of information provided, with external links for verification. However, there is a lacks: (1) information of demo/pilot; (2) Risks and mitigation. \r\nTherefore, based on the given information, I agree with this proposal's auditability, I can rate it with a score of 4. If the missing information listed above was fulfilled, I would give this 5 points.", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 12, "ne": 2, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to create a platform that will help the transfer of knowledge to keep individuals ready to work, and to keep a healthier pace in the life cycles of the industry. The challenge is quite addressed.", "q0r": 4, "q1": "The team is made up of Plutus Pioneer, 20 years experience in software engineering, 15 years and above as DevOps expertise, marketing advisors, who will be able to successfully implement the proposal. The plan mentions market and product, new recipe for transferring knowledge derived from industry, content in Spanish, technology oriented topics, tokenized incentive mechanism, native token incentives for learning. All these will make the implementation successful.", "q1r": 4, "q2": "The roadmap mentioned is clear from January 2022 to March 2022. The budget is well broken down for effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal addresses the challenge very effectively and delivers a thorough plan to create an educational technology platform for people in Latin America to become job-ready individuals and for the growth of Cardano ecosystem in Latin American countries. In my opinion, the author clearly understands these issues, is competent, motivated, and shows profound engagements with Latin American community as well as Project Catalyst and Cardano system.", "q0r": 5, "q1": "I strongly agree this proposal is likely to be successful implemented. The proposal provides all characteristic of a feasible proposal: evidence of relevant skills and experience of the team needed for the implementation and team members' information; fairly budget is split into items very clearly and be reasonable to achieve the set goals; a sensible and conductible plan with realistic timetable to complete the work; the necessary resources are described in details in the proposal in short term phase of the plan (to develop and implement a Proof of Concept (PoC)). In addition,  the project is bilingual (English and Spanish version, as we can see in the proposal and the AYLLU ACADEMY files attached in the proposal), so that language barrier is no longer the problem for people in Latin American countries of technology-oriented education. \r\nIn my opinion, it would be greater if the proposal considers challenges and risks relevent to the successful implementation (might be in the short term success, not a whole)", "q1r": 5, "q2": "In my opinion, the proposal is fully auditable because of the following points:\r\n. The proposal has a roadmap with milestones and time horizon for achievement; clear understandable the description of the targeted problem (Basic features of PoC) as well as the solution that addresses the problem.\r\n. Metrics/KPIs that define the success of the proposal are set clearly, easy to see and easy to audit (we should focus on the short term success to assess the Auditability as the proposal's current plan).\r\nThere is a small mistake in Phase B of short term roadmap and KPIs: I believe the author means Phase B in 4 month mark instead of 7 month mark.\r\nSince I extremely agree with the proposal, I would like to see more details about how to distribute this platform for the people in the proposal.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 15, "ne": 7, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "-Quality technical training in spanish is both a great use case for Cardano and a powerful way to expand it's awareness and adoption in Latam, therefore a stong alignment with the Challenge is evidenced.\r\n-The proposal is highly scalable to a have global reach in the future.\r\n-Would be great to see a more specific commitment to include Cardano/Plutus/Marlowe content in the description since as it is written there is no assurance of providing Cardano focused content.", "q0r": 5, "q1": "-Evidence is provided of a very strong team behind this proposal. They have a strong bond to LatinAmerica as well as the adecuate set of experience credibility and skills to deliver.\r\n-The proposal is thourough and well structured, a complete and detailed implementation plan is in place.\r\n-The budget provided is clear and reasonable.\r\n-Clear goals are set.\r\n-Future funding will most likely be required for next stages.\r\n-In the future team could benefit from bringing in a Marketing/growth/sales talent to support a good scaling speed.", "q1r": 5, "q2": "-Delivery on the proposal's plan is verifiable in each stage and the KPIs proposed seem to be a good way to measure success.\r\n-In order to track progress it would be great to include in the proposal some means of progress reporting.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is bringing a much needed decentralized EdTech solution to LatAm a region in great demand for this type of tool to help advance its societies. The proposal is perfect for this challenge.", "q0r": 5, "q1": "The team members come from technical software engineering backgrounds, are SPOs and have completed the Plutus Pioneer program. They also delivered a proposal containing an overview, timeline, KPI and other key information such as cost breakdown and definition of success. ", "q1r": 5, "q2": "The team is already heavily engaged in Cardano technical processes and their proposal is complete/well packaged. All info needed to audit progress is included.", "q2r": 5, "assessor": "z_assessor_764", "no_vca": 16, "ne": 2, "ng": 7, "nfo": 7, "vca_o": 1}], "solution": "Plataforma EdTech que incentiva a participação para promover o crescimento em um cenário educacional orientado à tecnologia, e a indústria de empregos relevantes.", "experience": "Plutus Pioneer, 20+ anos de experiência em engenharia de software, 15+ anos de experiência DEVOPS, assessorado por consultores comerciais e de marketing."}