{"id": 381139, "author": "spiralway", "title": "Nourish LATAM: Spirulina & Cardano", "url": "https://cardano.ideascale.com/a/dtd/381139-48088", "category": 26242, "amount": 50000, "description": "A desnutrição na LATAM está em seus piores níveis, a COVID-19 ameaça a disponibilidade de alimentos e o acesso econômico a alimentos de qualidade.", "funded": 0, "upvotes": 14841985, "downvotes": 22414535, "votes_result": 7572550, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 2.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Segundo o autor desta proposta, a COVID-19 exacerbou o acesso a alimentos de qualidade, resultando em altos níveis de desnutrição na região, e sim, eu concordo com a hipótese. No entanto, eu esperaria que este tipo de proposta fornecesse dados relacionados para apoiar suas declarações. Como solução para este problema, a equipe já desenvolveu um foto-bioreator de baixo custo para produzir spirulina, que será distribuída na região para promover a produção descentralizada. A proposta também menciona planos de integração com a Coti-Pay, a criação de um DApp e integração com a SingularityNet para a geração de modelos ideais de cultivo da Spirulina. Na minha opinião, a proposta é extremamente ambiciosa, mas se implementada com sucesso, tem um alto potencial.\r\n", "q0r": 4, "q1": "Pelo link fornecido, parece que o negócio está em operação, por isso, desse lado, parabenizo a equipe. Entretanto, não foram fornecidos links para verificar as habilidades e a experiência do proponente e da equipe. Em relação à indústria da espirulina, não estou preocupado com o conhecimento e a experiência do autor; no entanto, quando se trata de sua experiência em Haskell, Plutus ou SingularityNET, não há evidência das habilidades da equipe, nem de outro membro da equipe. o detalhamento do orçamento mostra 3 seções principais onde uma delas é destinada ao desenvolvimento de uma empresa, mas novamente não está claro quantos desenvolvedores estão planejando contratar nem o tempo que esperam que o desenvolvimento ocorra. Isto dificulta a realização da avaliação de viabilidade. Para futuros ciclos catalisadores, recomendo que a equipe apresente um projeto faseado de forma que permita à comunidade avaliar a viabilidade com precisão.", "q1r": 2, "q2": "No que diz respeito à auditabilidade, apenas se afirma que se espera que a tecnologia esteja pronta até meados de 2022. Infelizmente, não há menção de nenhuma métrica específica de sucesso em relação ao impacto que eles estão buscando. Por exemplo, quantos PBR's eles planejam construir? Aproximadamente quantos PBR's eles esperam ter distribuído? Na seção de idéias, eles mencionam 3 desenvolvimentos (que, da minha perspectiva, podem ser considerados propostas separadas). Você talvez possa descrever em que estágio de desenvolvimento eles estariam naquele momento? Qual seria a estrutura do relatório? Para garantir que a comunidade seja capaz de auditar a implementação do projeto, recomendo que a equipe se faça estas e muitas outras perguntas nos futuros ciclos catalisadores.\r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 21, "ne": 11, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Malnutrition in Latam is at an alarming rate, the proposal refers to creating a quality food source to improve immunity for the people here. The given problem statement is defined and involves most aspects of the challenge. Growing spirulina in decentralized bioreactors could be the solution to boosting the immune systems of millions of people in Latam. The solution given is reasonable and solves the problem", "q0r": 4, "q1": "This is a really good proposal, however, to get funded I think I need to have a clearer plan of the roadmap, the indicators to measure success, as well as the people who make the proposal. this. It seems that it is necessary to seek more cooperation of experienced people to make this project more feasible\r\nThe proponents did not provide any information about their skills and experience. More background and proof of your experience is necessary for the community to believe. The proposal does not take risks into account.", "q1r": 2, "q2": "As stated, auditability is low because it does not show the roadmap with development plan, detailed explanation of each step, milestones and delivery of each part. Not having a KPI would make it more difficult for us to audit.\r\nThe budget is not reasonable and is not broken down into identifiable amounts. In order to receive funding, I recommend clarifying the allocation of funds, the more detailed the better", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "I fail to see how this proposal is alligned with the challenge. It seems like a good business plan based in Chile and scalable to other countries in Latam but I don't see how it helps to grow Cardano's community or adoption (other than the payment to PBR operators and opening payment for product in ADA)", "q0r": 1, "q1": "The proposal doesn't provide any details on the market they plan to sell to. It would be a good adittion to the plan to talk about the demand they expect and the price the customers would be willing to pay. Comparing this to their estimated cost of productions could give the reader a better understanding of the feasibility of the project.\r\nIt would be good to see clear KPI's are provided that can be used to assess success torwards growing Cardano in Latam.\r\nThe budget requested (50,000) seems elevated and no details are provided so justify the amount.", "q1r": 1, "q2": "The proposal could use a section adressing how the community could verify the promised use of the funds and how the implementation and success go.", "q2r": 1, "assessor": "z_assessor_740", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "A Spirulina cultivada em foto-reactores de forma descentralizada poderia ser a solução para fortalecer o sistema inmune de milhões de pessoas na LATAM.", "experience": "Empresário com anos de experiência no cultivo de spirulina e IoT, tecnologias de cadeia de bloqueio e foto-reatores."}