{"id": 381165, "author": "danbonfil", "title": "Latam Community DID Research", "url": "https://cardano.ideascale.com/a/dtd/381165-48088", "category": 26242, "amount": 30300, "description": "Os SSI/DID são pouco conhecidos na LATAM, muito menos seus benefícios. Se não houver empoderamento da comunidade ou sentimento de pertencer; a adoção não se seguirá", "funded": 1, "upvotes": 41329002, "downvotes": 18054775, "votes_result": 23274227, "votes_cast": 129, "f6_no_assessments": 3, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"q0": "O problema a ser resolvido aqui é esclarecido nas primeiras linhas: de fato, na América Latina, a adoção de identidades descentralizadas ainda é muito baixa e este problema precisa ser resolvido. O que se propõe aqui é fazer uma espécie de pesquisa, compreender as especificações do público e impulsionar a adoção de DIDs. Creio que é uma maneira muito boa de promover o uso desta tecnologia, pois não faz sentido querer \"forçar\" um determinado grupo a começar a adotar tal tecnologia sem que ela se adapte às suas necessidades. É muito positivo, pois o autor da proposta define alguns acrônimos que ele adota nesta proposta, desta forma há uma espécie de nivelamento entre todos os leitores e as ACs e vCAs podem entender mais completamente o que é dito. É também um ponto positivo, pois o autor especifica quais metodologias de pesquisa usaria (no total, 3), isto nos permite ter uma visão mais sólida do tipo de atividades que seriam realizadas a partir daqui, e não apenas uma compreensão abstrata da pesquisa do público. Em resumo, creio que é uma proposta que geraria um impacto positivo e relevante se financiada, atendendo bem os objetivos do desafio, beneficiando tanto os habitantes da América Latina (ao criar tecnologias mais necessárias às suas necessidades) quanto aumentando a adoção de tecnologias do ecossistema Cardano.", "q0r": 5, "q1": "O autor da proposta tem poucos detalhes sobre si mesmo. Teria sido melhor se ele tivesse incluído algumas informações sobre sua formação (sabemos que ele é da área econômica e política, mas seria importante entender se ele tem algum trabalho relacionado a Cardano, como ele conheceu o ecossistema, etc.). Entretanto, é possível resolver estas dúvidas acessando seu perfil vinculado. Entretanto, na minha opinião, o ideal é sempre incluir uma breve descrição sobre o proponente, uma breve história e focalizada na relação desta pessoa com Cardano + o perfil do linkedin. É ótimo que ele tenha várias parcerias, o networking é forte, são mencionadas 4 organizações que certamente agregam muito valor e confiança à equipe geral. Entretanto, também acho que seria importante conhecer um pouco mais sobre as pessoas envolvidas aqui, individualmente. Quem da d-EdTech estaria envolvido, por exemplo? Sobre um roteiro, o autor não fornece um roteiro cronológico tradicional, mas divide o trabalho em 3 partes de aproximadamente 3 meses cada. Podemos entender o que seria feito em cada uma delas, o que constitui um roteiro, de certa forma, embora tais atividades pudessem ter sido ainda mais detalhadas. A repartição do orçamento é disponibilizada de acordo com estas partes, e você pode entender clara e diretamente como o dinheiro solicitado seria devido, para que cada parte seria utilizada e qual porcentagem de cada parte respectiva representa o todo. Finalmente, gostaria de dizer que, em termos de viabilidade, temos excelentes informações, embora não perfeitas, o que transmite muita confiança na equipe, no processo e no financiamento solicitado.", "q1r": 4, "q2": "A proposta é extremamente auditável. Acho que isto acontece porque o autor divide o trabalho em partes e lista algumas atividades desenvolvidas em cada uma delas, dando-nos a possibilidade de monitorar o processo com precisão. Ele também dedica dois tópicos especialmente à auditabilidade: como é o sucesso e as principais métricas e objetivos. Há material suficiente para monitorar este projeto, tanto o processo quanto os resultados. Mas uma coisa que pensei aqui: como teremos acesso aos resultados finais da pesquisa? O autor declara no extrato de métricas/metas: \"Compartilhe insights com parceiros e comunidade para integrar e adaptar os resultados às suas próprias necessidades\". Através de qual plataforma? Acho que seria interessante definir melhor esta pergunta. É super importante que a comunidade, especialmente os membros da América Latina, possam ter acesso a tais informações para validá-las, assim como outros desenvolvedores da tecnologia Atala Prism. Além disso, esta é apenas uma pergunta pessoal, porque o autor nos fornece, como eu disse, tudo e um pouco mais do que é necessário para auditar este projeto muito especificamente.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 26, "ne": 14, "ng": 12, "nfo": 0, "vca_o": 2}, {"q0": "Distributed Identity solutions like Atala are new and the use cases are not clearly understood or appreciated around the world. The project aims to carry out a research project to identify and analyze the requirements for DID from a LATAM perspective. I feel the situation can be extrapolated to any part of the world. Research in any form can produce material that will help in taking better business decisions, therefore this is a viable and a required project. ", "q0r": 4, "q1": "The proper has more than ten years of experience with excellent management education. The idea presented also has a sound rationale, and the proposal will likely be implemented in earnest. ", "q1r": 5, "q2": "Research projects are inherently difficult to audit and measure the quantum of success. The methodology suggested is viable and the team behind it has experience and qualification. The budget also looks reasonable and justified. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nBest,\nDaniel Bonfil"}, {"q0": "This proposal will have a great positive impact on the LATAM community. But, in what language these reports will be delivered is not mentioned. The objective is everyone in LATAM can access and understand these reports clearly.  ", "q0r": 4, "q1": "The budget plan's elements are not described in detail in each post. Is the proposer going to hire team staff? How's the hiring process? Who will be the experiment's target? How many users are needed in those experiments? From how many countries? The proposer doesn't have any blockchain-related background and is not active in the Cardano community. The time frame plan makes sense, but it needs to coordinate several people at once to deliver the project.  And this research can't be one time only, but a continuous project as the DID technology itself will keep developing.", "q1r": 3, "q2": "The reporting period is only every three months. But, to give LATAM communities better insights, it should have other channels to show the progress in detail. Not to mention, the proposer should be active in the Cardano communities to better communicate his works. In that case, the proposer can gain respectful insights from other community members to polish the research even better. ", "q2r": 3, "assessor": "z_assessor_647", "no_vca": 18, "ne": 3, "ng": 10, "nfo": 5, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment, with respect to the language, it will be all based in English. The final insights reports available for the community will also be available in Spanish and Portuguese. With respect to the reporting, there is a report update every two months aligned to the key metrics and goals, schedule and budget.\n\nThe research project will be carried by the proposer in its entirety, however I will receive support from one Research Assistant (RA) in Brazil and one in Mexico, along with the feedback and/or suggestions of Atala Prism Pioneers partnerships and mentors.\n\nSince this will be a web-based research carried out in the Crowdsourcing platform Amazon Mechanical Turk, we can access most of the countries in Latin America. However, using the Scientific Method; in order to select the countries and segments properly we need to identify the at least the specialized literature in the region and then start with an initial batch for example with the capital cities in the most populated countries or a general approach for raw findings in all 30+ countries. The experiment is intentionally divided in 2 batches to consider the exploratory analysis first and then continue with the larger research should the results prove to be worthy of further study.\n\nFinally, with respect to the sharing and reporting channels, I am recently starting to become more active in Cardano Community and Discord channels. Along with sharing the insights in Cardano Forums and our Partnerships, we will be feeding the Cardano DID Community which is proposed as a joint effort in our Latam Community DID  proposal where we will display current campaigns, insights and an invitation for others to join and use our standardized approach. https://cardano.ideascale.com/a/dtd/Latam-Community-DID/381158-48088\n\nThank you for your consideration.\nBest,\nDaniel Bonfil"}], "solution": "Compreender as necessidades e valores com uma base estatística, a fim de alinhar a solução aos interesses e exigências da comunidade", "experience": "Msc Economics focada em Finanças Quantitativas, Incentivos e Blockchain\nJaneiro 2022: Doutorado em Gestão com foco em Política Comunitária"}