{"id": 381248, "author": "phuffyking", "title": "Newcomer Resources en Español", "url": "https://cardano.ideascale.com/a/dtd/381248-48088", "category": 26242, "amount": 8000, "description": "Cardano Education, News & Resources for NEWCOMERS é escasso em qualquer idioma - & esp. Espanhol! Necessidade de fornecer boas informações para as pessoas comuns.", "funded": 2, "upvotes": 74687537, "downvotes": 1316841, "votes_result": 73370696, "votes_cast": 290, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "Estou feliz em reencontrar esses autores. Avaliei a proposta que eles apresentaram na F6, para traduzir o conteúdo em swahili, estou feliz em saber que eles conseguiram o financiamento. Acredito fielmente que esta proposta é autovalorizada e fala diretamente ao objetivo deste desafio, que é divulgar o conteúdo do ecossistema Cardano aos nativos da América Latina. Os autores já têm um trabalho de divulgação de notícias e conteúdos relacionados à nossa cadeia de bloqueio, por isso já têm experiência na criação, tradução e articulação de conteúdos escritos e de áudio. O fato de eles já terem feito um projeto que visava traduzir o conteúdo existente para um idioma diferente, o fato de que isso já está acontecendo e que está recebendo feedback positivo é a melhor prova que poderíamos ter de como esta dupla gera trabalho com impacto. e atende plenamente ao que estamos procurando no desafio. Penso que essa proposta poderia ser resumida pela passagem que eles escreveram: \"Estamos construindo uma rede de colaboradores que compartilham idéias técnicas complicadas para pessoas comuns e entregam notícias relevantes em mordidas rápidas\". A partir deste trecho, podemos inferir qual é o objetivo aqui, enquanto detalhamos a proposta entendemos o que seria feito: conteúdo escrito/áudio, conteúdo para iniciantes e também para pessoas com mais experiências e também interativo, ou seja, os leitores do site podem deixar comentários sugerindo novos artigos ou apenas dando feedback sobre o que você leu, o que segue muito bem a filosofia de Cardano de que trabalhar coletivamente é sempre melhor. Portanto, acredito que esta proposta terá um alto impacto e cumprirá plenamente o que é solicitado aqui.", "q0r": 5, "q1": "Acredito que os autores estão bem preparados para realizar este projeto com sucesso. Eles nos dão uma breve descrição de quem são, e também anexam seus perfis interligados, onde podemos fazer uma análise mais detalhada de suas trajetórias. E, claro, eles já têm experiências em projetos similares, primeiramente já têm um website pronto com vários conteúdos, e também (como eu disse) eles fizeram com que a proposta de traduções swahili fosse bem sucedida. Com isto, a segurança total é transmitida a eles e em sua capacidade de realizar mais um projeto bem sucedido no campo das traduções. Eles fornecem um roteiro, medido em meses, no qual podemos observar o que aconteceria ao longo do tempo para atingir o objetivo final. O bom é que a plataforma aqui já está pronta e foi projetada com antecedência para ter seu conteúdo traduzido em vários idiomas, o que está faltando é, literalmente, traduzir. Embora eles lhe informem quanto conteúdo seria traduzido na parte em que explicam a divisão das despesas, gostaria que você desse mais detalhes sobre esta parte da tradução propriamente dita. Por exemplo, quantos tradutores seriam contratados? Como eles seriam selecionados? Exatamente com que freqüência estes conteúdos seriam liberados? Sabemos que existem cerca de 30 artigos, ou seja, 30 traduções, em um período estimado de 6 meses. Portanto, eu gostaria de saber como eles pretendem distribuir o lançamento dessas traduções, e também como eles fariam a ponte com os falantes nativos de espanhol, porque tão importante ao gerar as traduções é torná-las conhecidas para o público alvo. Com relação à divisão financeira, acredito que as informações divulgadas foram suficientemente detalhadas, sabemos quanto dinheiro seria destinado a cada parte do projeto. Mas, repito, seria essencial que os autores reservassem parte desse dinheiro para investir em algum tipo de publicidade, talvez estabelecendo contato com algum grupo no ecossistema Cardano que já está bem estabelecido entre os falantes de espanhol. Devido a estes detalhes, acredito que algumas coisas poderiam ser melhoradas, embora tudo esteja indo muito bem.", "q1r": 4, "q2": "No caso específico desta proposta, a auditabilidade é simples, na minha opinião. Os autores estabelecem os marcos do sucesso, através dos quais podemos ter uma idéia mais ampla do que se pretende aqui. Entretanto, também estamos cientes de detalhes como: quantos artigos seriam traduzidos, em que formatos, e o tamanho médio estimado para cada produção, por isso é ainda melhor acompanhar o progresso do projeto por menos. O que eu sugiro para melhorar ainda mais a auditabilidade é que sejam estabelecidas freqüências fixas do lançamento da tradução, por exemplo, 2 artigos traduzidos por semana, e também um plano de divulgação. Assim, seria interessante eleger alguns membros do ecossistema (de preferência falantes de espanhol) que poderiam se reunir periodicamente com os autores e monitorar se tudo está sendo feito de acordo, levando este feedback à comunidade em geral. Desta forma, será possível estar absolutamente seguro do correto andamento do projeto, estabelecendo uma sólida auditabilidade. Em resumo, temos elementos que permitem que a proposta seja monitorada, mas em minha opinião, outros precisam ser acrescentados para que o monitoramento funcione de forma otimizada.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "https://www.lidonation.com/ is a website that focuses on educational articles about the cardano ecosystem. They have already a site up and running thanks to previous successful funding rounds. The proposer wants to add the Spanish language on the website. Since the website is up and running, the only cost will be content creation which will mostly be translated content. The Spanish speaking audience can benefit from this content to learn the ins and outs of the cardano ecosystem. This will certainly have a good impact on the cardano ecosystem. Furthermore I have noted that the key metrics and goals of this proposal align with the challenge.\r\n", "q0r": 5, "q1": "Since this proposal is the scaling stage as the project was already funded in a previous round, I think that evidence of relevant skill and experience shows in the website they have built. The budget in this proposal is broken down in identifiable items and seems pretty reasonable based on my blogging experience. However what I would've liked to see in this proposal, is the metrics such as traffic, user retention and how much of those uses translated into cardano users. I suggest to the proposer to add these metrics so that the community can learn from this experience. Apart from that, I have high confidence that this proposal will be successfully implemented.", "q1r": 5, "q2": "The proposer has added all the information necessary for a successful audit. The proposal includes a roadmap with reasonable milestones for the translation, UI design and content publishing. Furthermore the metrics definition of success are added on the proposal and most of them are pretty strong. However I would suggest to the proposer to add a number of visitors they want to attract in a timely manner. Other than this little improvement, I think that the proposal has checked boxes to be successfully audited.\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 17, "ne": 6, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Allow diverse people to have access to information about the Cardano ecosystem in their language will facilitate its promotion. Through this proposal, the intention being to provide information on  Cardano basics, current events, and insights for newcomers. This goal aligns with the challenge", "q0r": 5, "q1": "The proposal is submitted by a group of people who have been involved in the Catalyst for a while, and have seen their proposal funded in cycle 6. It's a sign that they know how the community platforms runs but also have experience of use of funding obtained.\r\nThe team of proposers has experience in translating and the LIDO Nation Community is a proof of their work.\r\nThe plan is clear and the budget detailed, but I would see this proposal seeks more fund that $8000. The extra money may be used to solidify the future stage of the project implementation.  ", "q1r": 5, "q2": "The LIDO Nation Community will be used to follow the process of the project implementation. Risks are low for my opinion as the team has experience in such project implementation, and the success for this type of proposal is related to financial resources availability (funding). ", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 17, "ne": 3, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is about building a library of original educational articles and news in Spanish, to include Cardano basics, current events, and insights for newcomers. This is a great idea. The problem is clear and convincing. The solution fits the challenge and is clearly defined (with a clear roadmap), showing potential impact to the Cardano ecosystem in LATAM communities. My advice is, for better understanding, you can consider explaining more about the problem with evidence and proof.\r\nTherefore, based on the given information, I strongly agree with this proposal's impact , I can rate it with a score of 5", "q0r": 5, "q1": "Proposer and her team show their abilities is suitable for implementing this proposal, with external links for verifying. Through this website (https://www.lidonation.com/en/), I can see proof of feasibility. \r\nTherefore, I strongly agree with this proposal's feasibility, I can rate it with a score of 5", "q1r": 5, "q2": "Team profile is described enough for understanding with links for verifying. For better understanding, you should consider providing some explanations of the calculation base for each item. If possible, you should consider integrating budget and KPIs into your roadmap.\r\nBased on the given information, I agree with this proposal's auditability, and give it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to set up a library of educational materials in Spanish to include Cardano basics, current events and insights for new comers. The library will have Cardano educational content available in Spanish. The challenge is addressed effectively.", "q0r": 4, "q1": "The team is made up of trained Spanish teacher and translator, 14 years experience, Software and Cloud Engineering, blockchain development, technical writing and they are capable of successfully implementing the proposal.  The plan mentioned that the library will have Cardano educational content available in Spanish; Translated resources include both written and audio versions; website in Spanish will cover Cardano network basics, etc. All these details, among others outlined in the proposal, will lead to successful implementation of the proposal. ", "q1r": 4, "q2": "The road map is clear showing 6 months of work schedule detailed in the proposal; Translated content (KPI) being viewed in native Spanish speaking parts of the globe. The budget is well broken down to make effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Biblioteca de artigos educacionais originais e notícias em espanhol, para incluir noções básicas de Cardano, eventos atuais e insights para os recém-chegados.", "experience": "Professor e tradutor de espanhol treinado; mais de 14 anos de Software e Engenharia de Nuvem, desenvolvimento de cadeias de blocos, consultoria empresarial, redação técnica."}