{"id": 381256, "author": "sessionizill", "title": "Decentralized Music Platform LatAm", "url": "https://cardano.ideascale.com/a/dtd/381256-48088", "category": 26242, "amount": 30000, "description": "Os artistas latino-americanos só têm acesso a um mercado musical global, como o Spotify, que é um gigante de streaming.  Eles precisam de opções mais favoráveis.", "funded": 0, "upvotes": 15844399, "downvotes": 20454490, "votes_result": 4610091, "votes_cast": 117, "f6_no_assessments": 5, "f6_rating": 2.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "A equipe de propostas pretende resolver o problema de que os próximos artistas não possam acessar o mercado musical global através de plataformas de streaming, como Spotify. Embora este possa não ser um problema específico para a América Latina, é um problema generalizado no negócio da música, eu concordaria que se a equipe puder desenvolver uma maneira viável de aproveitar as características Cardano, pode ser uma solução que mude a vida dos artistas e revolucione a indústria musical em geral. Este problema será resolvido com uma solução SAAS (que é proposta no DAPPS & desafio de integração), e o pedido de orçamento é para um conceito de validação dessa solução para a América Latina.\r\n", "q0r": 4, "q1": "Embora os nomes mencionados como \"parceiros\", ou \"contatos próximos\", sejam pessoas muito importantes e possam ser verificados sem a apresentação de referências. As informações apresentadas sobre o proponente são muito limitadas, o que limita a capacidade de verificar as habilidades e experiência descritas na proposta. Como o objetivo do orçamento é a contratação de executivos de música de alto nível na América Latina, posso entender que não há nenhuma quebra no orçamento. A contratação de executivos de música é esperada, e embora eu não possa garantir que seu orçamento seja adequado, entendo que estes são valores que são tratados nesse contexto. Neste ponto, para mim, há muito risco associado à dependência da proposta em relação ao financiamento de outras propostas. Portanto, não posso concordar ou discordar sobre a viabilidade neste momento. Eu recomendo que me concentre na proposta \"Dapps & Integrations\", uma vez que você tenha um MVP e provas de implementação. Estou certo de que a comunidade concordará plenamente em alocar recursos para testar o conceito não apenas na América Latina, mas também em outras regiões.\r\n", "q1r": 3, "q2": "O autor da proposta menciona que, se os fundos forem alocados, ele contataria imediatamente esses executivos para fazer uma proposta para validar o conceito da aplicação na América Latina, no entanto, não há menção de quando a comunidade poderia ter o resultado desse exercício. Com base na proposta principal, o primeiro piloto desta aplicação será concluído dentro de 3 meses. Nesse caso, eu esperaria que o proponente esperasse o sucesso do piloto para que, com um MVP em mãos, eles possam se aproximar dos executivos e fazer uma proposta formal de validação. Na minha opinião, todos estes fatores dificultam o acompanhamento desta proposta pela comunidade. Também é mencionado que uma métrica de sucesso \"poderia ser\" para chegar a um acordo com uma gravadora latino-americana e fazer com que eles carreguem sua biblioteca de conteúdo para a aplicação. Eu preferiria uma métrica associada ao número de artistas a bordo do aplicativo (que ainda não conseguiram aproveitar os benefícios de plataformas como Spotify), pois isto está mais associado ao problema mencionado.\r\n", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 22, "ne": 12, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Embora esta proposta tenha o objetivo de implementar um programa musical para uso individual na América Latina, eu não entendo bem como este projeto atrairá novos membros para a comunidade cardano. Quais são os incentivos para que os usuários da nova plataforma utilizem este programa sobre um serviço de reputação estabelecida, tal como música de maçã ou spotify? Há algo nele para os usuários que eles não podem obter em outro lugar? O que esta proposta pode fazer para melhorar a vida das pessoas que a utilizam? Se o proponente pudesse abordar algumas dessas questões, isso fortaleceria muito a proposta. (pontuação dada: 2)", "q0r": 2, "q1": "O proponente só tem a condição de ter mais de 20 anos de experiência na indústria musical e de ter um amigo administrando um grande artista latino-americano. No entanto, esta informação por si só não me dá confiança nas capacidades do proponente porque eles não especificaram que tipo de experiência eles têm com a indústria da música. Será que eles conhecem o funcionamento interno das gravadoras e o negócio de streaming? Além disso, eles têm o conhecimento da informática para desenvolver uma plataforma para este projeto? As respostas a estas perguntas não são claras no estado atual da proposta.\r\n\r\nTambém não sei qual será a repartição dos fundos - eles estão pedindo uma grande soma de dinheiro, por isso é importante que eles forneçam informações sobre como ela será utilizada.  O proponente poderia potencialmente elaborar mais sobre o que os executivos farão para o projeto. Entendo que eles têm outra proposta em um desafio diferente, mas incluir mais algumas informações sobre esta proposta ajudaria os eleitores a entender melhor esta parte do projeto multipropostas.\r\n\r\nTambém não há muitos detalhes nesta proposta sobre o funcionamento do projeto. Mais uma vez, incluir algumas informações da outra proposta seria útil para os eleitores.\r\n\r\nUma preocupação que tenho com esta proposta é o conceito de cobrar da carteira uma taxa por córrego. Este conceito não castiga as pessoas que transmitem mais música? Se uma pessoa ouvisse uma quantidade significativa de música e depois tivesse que pagar uma taxa por stream, ela efetivamente drenaria sua carteira de fundos. Não consigo ver as pessoas se posicionando por trás deste modelo de negócio. (partitura dada: 2)", "q1r": 2, "q2": "O proponente não forneceu boas métricas para medir o sucesso desta proposta. Eu não notei nenhum KPI fornecido nesta proposta para ajudar os eleitores a ter confiança na auditabilidade do projeto. Vejo que o proponente ligou sua outra proposta que está ligada a esta, onde eles listaram apenas um indicador-chave de desempenho: a inclusão de def jam a bordo. Não vejo isto como um KPI viável por ser tão incrivelmente variável. Um KPI singular que depende muito da decisão de um grupo de indivíduos não pode ser uma medida confiável de sucesso - ou é bem sucedido ou falha sem que seja possível no meio. Assim, eu encorajaria o proponente a encontrar alguns outros KPIs que possam ajudar a comunidade cardano a auditar a proposta e a ter mais confiança nela. (pontuação dada: 1)", "q2r": 1, "assessor": "z_assessor_310", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The Problem being LATAM artists having only access to global marketplace and need for more favorable options. The proposer has crated two proposal in one they wants create a Direct to consumer music streaming platform for record labels and In another they would want to onboarding Latin American Music executives.  In this proposal they would like to focus this proposal onboarding Music executives. Both these proposal together does addresses the problem", "q0r": 5, "q1": "Based on the details provided the proposer and their has required experience to create the music streaming platform and make it work by onboarding Latin American's artists.\r\nThe proposer have given a complete plan and steps they will be taking. This proposal can only be executed once the streaming platform is ready. ", "q1r": 4, "q2": "The proposer has given a timeline and have set goals to achieve within the mentioned time period but in another proposal. It would have helped a lot to audit the proposal if they had provided a detailed budget breakdown, Key performance metrics and roadmap with milestones in this proposal. Therefore the details provided in this proposal won't be sufficient to audit the progress and the success of the proposal", "q2r": 2, "assessor": "z_assessor_419", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This proposal will specifically focus on showcasing LatAm artists. This is a very good project that will solve an immediate need quickly and simply, so it will have a pretty big impact. The proposal is a great idea to build a Direct Consumer online music player for record labels. The given solution completely solved the problem.", "q0r": 4, "q1": "Proposal lacks information to properly track development after funding. The proponents do not provide any information about their skills and experience. I don't see the members' biographies so I can't judge the group's abilities\r\nThere are no obvious risks identified in the documents provided. Since it's not possible to test the proposal, I'll give it a 2, even though it's a great idea. Hope to see your recommendations for funds later with a more complete, positive recommendation that we can easily test", "q1r": 2, "q2": "Multiple smaller milestones within each core milestone will indicate more confidence in the expected delivery to be successful.\r\nI want to see the budget broken down into monthly spend, and I want the team to connect KPI milestones and roadmaps with spending, specific tasks and tasks that employees must deliver and when they must. assignment - this analysis will give a clearer indication of the feasibility of the work done and matching the delivered products with the labor cost. A budget is given but without any explanation of how the budget will be used. Therefore, it will be difficult to audit\r\nAlso no KPIs are presented. To better understand the project better to add your focus KPI (number of fans/listeners, singers, artists) engaged in your app", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 21, "ne": 4, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "To make a fair review of the proposal at hand, the idea is really interesting and addresses a special class of people, the artists, and musicians. However, the proposer makes no point over here regarding the impact it could have on LatAm as a whole. With the likes of Spotify and other huge giants who already allow people to publish their works, the additional impact this particular proposal could bring is not something to look forward to. Moreover, the proposer also makes it clear to have submitted a proposal based on the same application in another challenge, which seems like a better match to the proposal. And how exactly would this Dapp uphold the strength and capabilities of Cardano in particular? And why make a music app that is decentralized? What are the vulnerabilities that the current music apps face having been deployed under conventional networks? With the above doubts, I strongly believe it's quite difficult to measure the impact of this proposal on the LatAm people and on the Cardano ecosystem.", "q0r": 3, "q1": "The detailed plan the proposer provides in the attachment makes complete justice to the proposal under the \"Dapps and Integration\" challenge, but fails to provide the readers the insights into how the additional funds will be required and why need it now? There is also no visible roadmap nor a viable team experience under the proposal. I strongly recommend the proposer provide more details regarding the marketing and publicity approach that requires 30k USD for the community to gain trust and credibility in the project. I would also suggest that if funded in the other challenge, the progress using that could be shown during the further funding rounds so that it adds more value to the 30k being requested now and makes it easy for the community to decide on it.", "q1r": 2, "q2": "The only KPI that the proposer mentions is to sign up 1 Latin American record label and onboard their entire library of content over time. Apart from that, there are no measurable metrics that will provide the auditors the information about the quality, user experience, acceptance rate, number of active users, the outreach of the application. And the metrics provided tend to be a little off compared to the essential metrics of the challenge that measures the increase in traffic across LatAm that comes together to provide more contributions to the Cardano Ecosystem. Thus, I feel this proposal would have been a winner had it been submitted in other challenges such as \"Community events\" or  \"Miscellaneous challenges\".", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Construiremos um leitor de streaming de música Direct2consumer para gravadoras. Esta proposta se concentrará especificamente em artistas da América Latina.", "experience": "Mais de 20 anos no ramo da música. Meu amigo tem anos no biz especificamente na América Latina, gerenciando um grande artista da América Latina, Anuel AA."}