{"id": 382317, "author": "heikki.ruhanen", "title": "DID market study & deployment", "url": "https://cardano.ideascale.com/a/dtd/382317-48088", "category": 26242, "amount": 30000, "description": "Falta de compreensão nas soluções DID e validade das credenciais na América Latina.", "funded": 1, "upvotes": 57104112, "downvotes": 8485286, "votes_result": 48618826, "votes_cast": 126, "f6_no_assessments": 6, "f6_rating": 3.722222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "A idéia se alinha bem com os objetivos do desafio, pois pretende criar soluções para a descentralização da identidade, para que tais informações possam ser tratadas por diferentes tipos de público, como estudantes, profissionais em busca de emprego, e assim por diante. De fato, na América Latina, a adoção do Cardano ainda é lenta (o que justifica a importância do desafio atual) e quando se trata de DID, é ainda mais. Isto cria uma grande necessidade de investir nesta área, que é o que a proposta em questão busca. Fornecer serviços digitais para alavancar a atividade de outras empresas ou mesmo de usuários solitários é uma forma de se fazer tal investimento. Achei muito interessante quando os autores falam de várias possibilidades nas partes \"se você...\", porque dessa forma temos uma boa visualização de quais estratégias seriam traçadas. Os habitantes da América Latina certamente se beneficiariam desta iniciativa, pois teriam suas identidades circulando de forma virtual, com o objetivo de alcançar várias vantagens e não apenas focalizar uma ação. Por exemplo, nas universidades geralmente existem websites onde os estudantes podem baixar seus históricos acadêmicos para comprovar sua filiação à instituição. Por que isto não poderia acontecer, por exemplo, também para uma busca de estágio? Penso que seria esse tipo de atividade desenvolvida aqui, e a cadeia de bloqueio se beneficiaria, pois soluções descentralizadas usariam o Cardano para trabalhar através do Atala Prism.", "q0r": 5, "q1": "O que seria necessário fazer para realizar o projeto é muito detalhado, desde o estudo de viabilidade até a implementação de soluções. Sobre a compreensão e a ordem das próprias atividades, creio que tudo é bastante adequado. Entretanto, algo que eu acho que seria melhor se tivessem incluído o tempo que cada uma dessas atividades levaria. A maioria das propostas estabelece fases, isto foi muito importante aqui, porque entendemos bem o que aconteceria mas não quando aconteceria, ou seja, quando cada coisa começaria e terminaria, o que é essencial para uma compreensão completa das atividades. Sobre a equipe: A empresa Fairaway parece altamente qualificada para o projeto, pois tem profissionais de diferentes áreas e também já tem experiência com identidade descentralizada. Além disso, eles têm uma rede forte, o que é sem dúvida importante para qualquer projeto. No entanto, seria mais apropriado se cada membro fosse apresentado individualmente. Saber quem é quem, seus nomes, funções profissionais, como se relacionam com Cardano (individualmente), seus perfis vinculados, etc. Dessa forma, haveria uma compreensão mais clara de quem eles são, aumentando o nível de confiança na equipe. E sobre a divisão financeira: havia falta de detalhes. Por exemplo, quando eles pedem 8k para \"revisão de aquisição de clientes\", eu não entendo bem o que isso significa ou porque isso custaria esse preço. Perdi mais explicações.", "q1r": 3, "q2": "Acredito que os autores até pretendiam propor uma auditabilidade, mas isto foi feito de uma forma muito superficial. Eles estabelecem métricas trimestrais de sucesso, mas a informação é muito curta, o que não permite uma compreensão profunda do que está planejado para os resultados. Acho que seria mais apropriado que houvesse um monitoramento contínuo deste projeto, em outras palavras, alguns membros da comunidade, de preferência latino-americanos, acompanham de perto o progresso de todas as etapas. O primeiro passo para isso seria definir um cronograma, que está faltando nesta proposta, estabelecendo datas. Através deste acompanhamento, eles poderiam fornecer feedback à comunidade Cardano, a fim de esclarecer se o que foi prometido está realmente acontecendo. Também seria interessante se a própria equipe da Fairaway realizasse uma pesquisa para descobrir como está indo a adoção de identidades descentralizadas. Está tudo correndo como planejado? As pessoas estão usando DIDs? Qual foi o impacto deste projeto em sua vida acadêmica e/ou profissional? Acredito que uma análise mais detalhada da própria equipe com o público poderia ser feita, e tais informações deveriam ser divulgadas, por exemplo, na prefeitura, dialogando com outros projetos na América Latina, como a Escola Catalítica LATAM, por exemplo.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 12, "ng": 3, "nfo": 1, "vca_o": 2}, {"q0": "I agree that performing market research and then deploying a solution based on a finding is a proper step. \r\n\r\nI find this challenge in accordance with the challenge goal.\r\n\r\nRating given 4.", "q0r": 4, "q1": "Based on the experience and skills stated plus visiting the website, which looks awesome, I am confident they can implement the proposal successfully.\r\n\r\nAlso, the team consists of 6 members, which seem to possess the expertise in relation to the proposal.\r\n\r\nRating given 5.", "q1r": 5, "q2": "More details would be welcomed about planned studies.\r\n\r\nNevertheless, the stated roadmap can serve as an orientational subtask checklist, and the budget is divided, so this can be audited too.\r\n\r\nThe success is described so the final outcome can be compared to the plan.\r\n\r\nIt would be nice to see some other metrics e.g. new users etc.\r\n\r\nRating given 3.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "The challenge is possible but lacks explanations of how it will be done, what resources are needed, or how they will be applied. I like the idea but this proposal needs further development to ensure successful implementation", "q0r": 3, "q1": "The proposal requires more examination information and is clearer about the problem it is intended to solve, as well as about the solution provided. Although your proposal is quite lengthy, it does not provide the factors to evaluate the feasibility of your proposal. If this fund you have not been funded, I hope the following fund will continue it with more specific and clear items such as who the proponents of the proposal include, their experience, the route you will take. How will the KPIs be achieved?\r\nWhat are the relevant skills and experience required to implement the proposal? It would be better to have one or more social network links to determine who the project members are, qualified to carry out the project or not. Failure to include the members suggested above would make it difficult to determine the extent of the project's success\r\nNo challenges and risks are presented.", "q1r": 2, "q2": "The stated budget is reasonable enough to be allocated straight to the target.\r\nNo resources are provided to allow the community to monitor ongoing activities. The proposal sets a target of 3,6.9 months, but there is no specific roadmap, no delivery products. Since there is no blueprint, no KPIs or metrics, there is no way to gauge the progress and success of the proposal.", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 17, "ne": 2, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "Fairway accurately identifies a problem towards mass adoption of DIDs and concisely sets out a plan to address this challenge within the Brazilian market. It clearly states how it will bring value into the ecosystem.", "q0r": 5, "q1": "The team has the requisite experience and knowledge to execute the proposal. The breakdown of funds is rather vague and could use some refining in terms of where exactly the money is going.", "q1r": 4, "q2": "Whilst the proposal does provide a definition of success it does not mention how this data will be published or shared and provides no other metrics with which to evaluate the success of the proposal.", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The idea to bring inclusive technology that provides fair and equal opportunity for anyone to participate in the job market is promising since it offers great opportunities for job seekers to easy promote themselve on the market. The solution also make good use of the advantages that the blockchain platform brings into a field that is familiar with any person: job seeking/ recruitment. However, implementing such a complex project requires more certainty and information. Therefore, market research is essential and the market place they choose is appropriate for this challenge and their goal.\r\n", "q0r": 4, "q1": "The team have relevant experience with diverse background and already success in  creating a company which the service already in creating Ethiopia and integrating Atala PRISM technology to their software. The project is implementing the same systems as they are implementing in Ethiopia, so there's a good chance they'll do it well. The proposal includes clear roadmap, which make it more persuasive that they will be success in implementing the project. ", "q1r": 5, "q2": "The proposal includes clear roadmap with clear goal, and have a clear budget allocation for each member. Therefore it ensure the transparency of the project which make it auditable.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Problem statement adequately captures an issue that needs to be solved. The proposal straddles two campaigns, the Grow LATAM and the Atala Prism challenge and as such the proposers have an additional proposal more focused on the project technicals in the Atala Prism challenge. \r\nThe project has a clear path to adding value to both the Cardano ecosystem and the LATAM community, initially focused in Brazil. Onboarding users into Cardano through something as fundamental as recruitment is a good way to attract people and maintain them as users. The initial target of finance, banking and insurance targets a user base likely to recognise the opportunity provided to them and also likely to delve deeper into the Cardano ecosystem. Its also clearly a user base the proposing team have connections and experience in through Matti.", "q0r": 4, "q1": "Team are already developing the product for use in Ethiopia, it is unlikely to need major technical change so deployment is feasible. Team seems to have the required connections and expertise to conduct thorough research into the local market and get potential opportunities for pilot clients/programmes. \r\nBudget is broken down by activity but it is not clear exactly what this is to be spent on, for example market research in Sao Paolo, is this to pay staff to conduct activities, incentives for survey participants, workshops etc. Better breakdown would enable better assessment of how reasonable the budget is.\r\nTimeline of 6 months to forming an entry strategy and 12 months to having users onboard seems reasonable for a product already developed.", "q1r": 4, "q2": "Measures of success are not quantified, what is the goal number of responses in the market research, what is the goal number of clients/job seekers on boarded to the program after 12 months? A better set of KPIs would make this project much more auditable and traceable. ", "q2r": 2, "assessor": "z_assessor_902", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Realização de um estudo de mercado em São Paulo e Rio de Janeiro para recrutamento baseado em DID nas áreas de bancos, finanças e seguros", "experience": "A Fairway (Empresa por trás da apresentação) está criando o serviço já na Etiópia e integrando a tecnologia Atala PRISM ao nosso software."}