{"id": 383185, "author": "cardosco17", "title": "🔰 dVote - LATAM 🔰 AtalaPRISM", "url": "https://cardano.ideascale.com/a/dtd/383185-48088", "category": 26242, "amount": 98489, "description": "A falta de uma plataforma única, facilmente auditável, onde as pessoas possam curar, apresentar ou votar em iniciativas populares.", "funded": 1, "upvotes": 25272942, "downvotes": 20949797, "votes_result": 4323145, "votes_cast": 148, "f6_no_assessments": 5, "f6_rating": 3.1999999999999997, "videos": [], "media": [], "f6_assessments": [{"q0": "O objetivo desta proposta é consertar a falta ou a ineficácia de uma plataforma confiável onde as pessoas possam propor, curar e votar em iniciativas populares que possam se tornar leis. A questão aqui levantada tem suas raízes na história da política latino-americana. Práticas corruptas. Portanto, seria benéfico encontrar uma maneira de facilitar a organização das comunidades de forma descentralizada. A equipe está buscando fundos para desenvolver uma plataforma utilizando as características do AtalaPRISM para propor, melhorar e votar em nova legislação. Em um ano, a meta é registrar 1% da população brasileira, o que representaria aproximadamente 1,15 milhões de indivíduos, que é exatamente o que o desafio exige. Entretanto, a proposta afirma que este protótipo está em conformidade com as leis da América Latina, mas se refere apenas às leis brasileiras. Seria interessante descrever qual a base legal deste mecanismo no resto da região.\r\n", "q0r": 4, "q1": "Infelizmente, a proposta não apresenta apenas a descrição das habilidades e experiência da equipe, mas também a referência para verificá-las. Como parte do orçamento, eles propõem a contratação de pessoas com habilidades relevantes, mas eu recomendo à equipe que pelo menos um membro central da equipe tenha uma formação técnica. Em termos de orçamento, praticamente todo o valor solicitado destina-se ao pagamento de horas profissionais e, em comparação com outras propostas dentro deste desafio, os custos por hora são consideravelmente maiores; portanto, eu também recomendaria que o proponente apresentasse os critérios utilizados para a alocação de custos. o autor desta proposta afirma que as leis foram rejeitadas no passado porque as assinaturas digitais não foram aceitas. Assim, com base na minha leitura da proposta, não entendo se é necessária alguma validação prévia para que as entidades governamentais reconheçam a validade dos votos que saem da plataforma. Para futuros ciclos catalisadores, recomendo que a equipe leve em consideração para fornecer uma declaração clara de que esta preocupação foi considerada.\r\n", "q1r": 3, "q2": "A proposta apresenta marcos de 3 e 6 meses, mas na minha opinião, esses marcos devem ser descritos de forma a permitir à comunidade compreender quais serão as atividades, por exemplo, em vez de dizer \"marketing de mídia social\", eu recomendaria que a equipe descrevesse quais plataformas serão utilizadas, que tipo de atividades serão utilizadas e quantas serão realizadas. Acredito que esta proposta é o fator comunidade é indispensável, portanto deve ser parte do núcleo da estratégia deste projeto. Em relação às métricas de sucesso que considero relevantes são o número de cidadãos registrados, número de propostas criadas, número de estudantes e advogados locais participantes, número de eleitores, entre outros, o que considero apropriado.\r\n", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 22, "ne": 13, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "Com relação ao impacto, esta proposta é muito forte. A idéia é criar uma plataforma na qual os brasileiros possam navegar pelas iniciativas populares, visualizando as que já existem, votando e curando as que desejam. A iniciativa está intimamente ligada ao ecossistema Cardano, pois pretende utilizar o AtalaPRISM como fonte de identidade, o que aumentaria muito a segurança dos dados aqui envolvidos, utilizando a cadeia de bloqueio para armazenar as informações presentes na ação. Pensei que era uma idéia muito forte porque, de fato, a segurança e a privacidade são frágeis para este tipo de ação, de fato, não existe uma plataforma completa para realizar estas consultas/votos, e é também um assunto urgente no país. A política brasileira é extremamente problemática e permeada por muita corrupção, acredito que se a população tivesse mais autonomia na gestão de suas próprias iniciativas, isso seria um grande benefício para o país, favorecendo assim uma importante localização na América Latina, como o desafio busca. Em outras palavras, quanto à relevância do projeto para o Brasil e os benefícios que ele traria para Cardano, acredito que tudo esteja bem claro, a questão aqui é: como os brasileiros conheceriam esta plataforma, como aprenderiam a utilizá-la? É preciso ser simples, porque uma das coisas que desestimula as pessoas a se envolverem na política é o fato de que tudo é muito burocrático, e me preocupa como a idéia chegaria a uma população local tão pouco familiarizada com a cadeia de bloqueio. Acho que houve uma falta de esclarecimento em relação à parte prática da idéia, os autores se dedicam a discutir bem o porquê de tudo isso ser importante, mas não explicam exatamente como o uso diário da ferramenta se daria. Também acredito que o preço pedido é muito alto, entendo que a complexidade do projeto é intensa, (vou analisar mais de perto a questão do orçamento no tópico abaixo), mas será necessária muita análise por parte da comunidade para escolher investir tanto em um único projeto, por mais interessante que ele seja, como é o caso.", "q0r": 4, "q1": "O pessoal não fornece muitas informações sobre quem eles são. Eles anexam um website, que deu um erro quando tentei acessar, e fazem uma breve descrição sobre as áreas de especialização dos membros envolvidos na parte relevante da experiência, mas não é um detalhe exato de quem eles são, porque não sabemos quem faz isso, por exemplo. Também não temos nenhuma informação aprofundada sobre cada profissional individual, seria necessário entender um pouco do feedback de cada um, ou seja, seu trabalho anterior, seu treinamento, como cada um deles se conectou com o ecossistema Cardano, e assim por diante. Quanto à descrição das etapas, também não há detalhes, o período total de 6 meses é dividido em duas grandes partes e cada uma delas tem uma pequena lista do que será feito no período. O problema é que é realmente muito curto, por isso não temos um entendimento detalhado do que vai acontecer. Eu recomendaria que os autores dividissem o tempo por mês, e dentro de cada mês explicassem melhor o que seria feito, dessa forma teríamos um quadro completo do todo. Finalmente, com relação ao financiamento em si, acredito que os autores forneceram detalhes suficientes para que entendêssemos firmemente como este dinheiro seria utilizado. Pena, continuo com este pensamento e reforço que poderia haver ainda mais detalhes em algumas partes do financiamento. Penso que seria essencial para eles mencionar quem seria cada profissional aqui e como seria sua rotina de trabalho, em outras palavras, que tarefas o anunciante faria para a comercialização do projeto? Como seria a construção da UI/UX que o designer faria? Pensei que os valores, por serem altos, precisavam de mais informações sobre cada profissional e suas atividades, não acho que seja desproporcional, mas que mais detalhes seriam necessários a fim de transmitir segurança no investimento. Em geral: não sabemos realmente quem é a equipe, as fases são muito resumidas e a divisão financeira está presente e muito detalhada, por isso acredito que é necessário que os autores aumentem sua proposta em detalhes.", "q1r": 2, "q2": "As métricas de sucesso são a parte mais detalhada da proposta (além da discussão sobre o porquê de ser interessante gerar tal plataforma). Com isso, temos informações suficientes para monitorar o progresso do projeto. Acredito que como este é um projeto muito particular na área, seria necessário que alguns membros da comunidade brasileira monitorassem de perto o progresso das coisas. São 6 meses de atividades complexas e caras que precisam ser monitoradas e passadas para o resto da comunidade Cardano, sugiro um pequeno grupo de brasileiros envolvidos na cadeia de bloqueio e com um senso político que é suficiente para monitorar o progresso do projeto. Não é preciso ser tão profissional, mas é um fato que, infelizmente, muitas pessoas no país não têm envolvimento político, esta é uma característica cultural do Brasil, algumas pessoas são muito engajadas, mas acredito que a maioria delas são um pouco alheias ao que acontece neste cenário, por isso seria interessante para as pessoas que iriam exercer audibilidade aqui ter um interesse no assunto, até mesmo para gerar mais energia para acompanhar o projeto e tornar esta mudança realidade. Em resumo, temos informações para realizar a auditabilidade, cabe agora a nós, na comunidade, acompanhar as coisas.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 18, "ne": 13, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "It's great when everyone has the power to propose and vote for what need for their community. I believe that citizen is the one that knows clearly that what need for their friends, family, and their communities. The idea of making a voting platform for Latin American countries like this will be supported by a lot of people who live there for proposing things that help their life better. The team showed a very inspired number about voters in their success key metrics that I believe will make some change in the future. ", "q0r": 5, "q1": "I hope that the team can write more detail about their implementation plan, there is just content about their overview, case studies, some featured questions, and answer about the personal data of users. For this kind of project, I have a lot of questions about: how the citizen can win on proposing new rules, who are the ones that deliver the proposal in their platform to the government, is there any template that can suit the condition of all countries in Latin America... \r\nBy the way, their roadmap in 6 months is so confusing to me because I cannot understand why they have to do these tasks? \r\nThat is the reason why I will say that the budget is unreasonable for what they showed in the proposal. \r\nI also try to get into their website and browse but can't see anything except some event info. ", "q1r": 1, "q2": "The roadmap is nonsense, so I think there is nothing for auditing. But their success metrics are very promising, if they can make it successful, it will make a big move to these countries. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 19, "ne": 2, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "This project will help to grow Latin America a lot. It makes a voting platform that helps citizens vote for their suggestion to make new laws or fix some laws that are not suitable for the current situation of the citizen as the proposer mentioned in the proposal. \r\nI believe this project will have a strong effect on the Cardano ecosystem in the future, but I think the proposer should tell how this platform will add some value to the Cardano ecosystem. \r\nThe proposer also provides detailed key metrics that align with the challenge setting. ", "q0r": 4, "q1": "The proposer just gives some brief info about the features of the platform and some answers that relate to security. I think the proposer should provide some more info like: detailed explanation about the features by user story for easy understanding, technology will be used in the platform, detail about the mechanic... and can be more other activities that will affect directly to the key metrics like: event organization, marketing, content production... \r\nIt's hard to give a high score of feasibility when CA/ vCA can't see anything that makes the project publish to the world successfully. Moreover, some info about the team with experience and roles will help a lot. \r\nLacking a lot of things, that is the reason why I rate this project with 1", "q1r": 1, "q2": "The roadmap is so short and can't clarify for what this project will be executed. That means it is not sufficient to audit the progress of this project. Good thing is that their key metrics is clear and align with the challenge setting.  \r\nHowever, the proposer has a good awareness of the problem and explains well how this project can help to solve that. But I hope that he can discover some risks on the plan then show here in the proposal. ", "q2r": 3, "assessor": "z_assessor_671", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This proposal focuses on developing a platform with the benefits of the Cardano blockchain where citizens could submit proposals, vote, or curate. This is a great idea. The problem statement is quite abstract, however, in the detail, it is explained carefully. The solution is clear, fits the challenge, clear impact on the Cardano ecosystem.\r\nBased on the given information, I strongly agree that this proposal effectively addresses the challenge, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is provided, and described enough for understanding, with skill and experiences that suitable for implementation, however, without the external link for verifying the ability of each member [ex: through reference/proof (documents/links,...]. Besides, there is no information on similar works/demos/pilots done by this team. On the contrary, the budget is clearly described with structure and explanations of calculation base. Similarly, the proposal's roadmap and metrics are clearly defined; in terms of this, my advice would be: metrics should be more specific [in number and integrated into the roadmap]. Risk is defined [AtalaPRISM launch delay], but without any mitigation/risk management.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of information [(1) The budget with structure and explanations of calculation base; (2) clear and detailed roadmap; (3) Measurable KPIs/metrics. However, there is a lack of: (1) Risk (and mitigation); and (2) Team profile description with external links for verification on each member.\r\nTherefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 15, "ne": 3, "ng": 5, "nfo": 7, "vca_o": 1}], "solution": "Desenvolver uma plataforma com os benefícios da cadeia de bloqueio Cardano, onde os cidadãos poderiam apresentar propostas, votar ou curar.", "experience": "Revolução da cadeia de bloqueio, educador, criador de conteúdo, operador de estaca, gerente de comunidade, alta experiência de trabalho com o público."}