{"id": 383175, "author": "matifalcone", "title": "Grow ALDEA, Grow Latin America", "url": "https://cardano.ideascale.com/a/dtd/383175-48088", "category": 26242, "amount": 24780, "description": "Apesar de ter criado uma comunidade para impulsionar a adoção de Cardano na América Latina, o crescimento maciço e o alcance ainda é muito difícil de ser alcançado.", "funded": 2, "upvotes": 53148830, "downvotes": 4471579, "votes_result": 48677251, "votes_cast": 200, "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"q0": "A idéia desta forma um pouco prometida e as propostas de propostas para aumentar o grupo de atividades chamadas em paralelo, todas as propostas concebidas em grandes grupos de atividades, o número de estudantes com diversidades. A equipe exemplifica algumas de suas realizações até agora e argumenta que precisa de financiamento para continuar realizando atividades e desenvolvendo novos projetos. Eles fornecem um pequeno histórico do que aconteceu até agora e explicam o que seria feito em cada parte do ecossistema (twitter, telegrama, instagrama e etc.). Não posso realmente definir minha opinião, acredito que o impacto será positivo, pois uma vez criados novos projetos e perpetuados e melhorados os projetos existentes, o ecossistema Cardano certamente será beneficiado. No entanto, em relação à América Latina, especificamente, esta relação é um pouco abstrata. É verdade que é um DAO da América Latina, mas não está muito claro para mim quais países são trabalhados aqui, quem são as pessoas envolvidas, como, exatamente, eles são beneficiados... Não estou dizendo que esta proposta não está de acordo com os objetivos do desafio, pois é um grupo latino-americano que realiza diversas atividades que promoveriam Cardano naquele lugar. O problema é precisamente que há muitas atividades, muitas coisas diferentes acontecendo em diferentes plataformas, de modo que não é possível entender profundamente cada uma delas. Não consigo visualizar exatamente os ganhos que seriam obtidos. Talvez o impacto fosse mais claro se, além de listar as atividades realizadas em cada plataforma, os proponentes explicassem quais grupos de pessoas estariam envolvidos e como eles se beneficiariam individualmente. Em geral, há muita informação que é confusa, em minha opinião, e não gera uma compreensão completa do impacto que seria gerado para o continente e para Cardano.", "q0r": 3, "q1": "Sobre a equipe, penso que durante a descrição da proposta não está muito claro quem são e que atividades desenvolvem. No entanto, no final, eles anexam perfis vinculados, mas a melhor maneira de conhecer e entender cada membro foi através do site fornecido (https://www.aldea-dao.org/about-eng.html). Lá, temos informações individualizadas, fotos e uma breve descrição de cada membro da equipe, que, juntamente com os perfis vinculados, geram uma grande e profunda compreensão da equipe, garantindo assim a confiança em seu trabalho. No entanto, seria importante, a meu ver, entender quem exatamente faria o quê. Como mencionei na Impact, é uma proposta que engloba uma série de coisas: atividades variadas e diversificadas. O que cada um desses membros faria? Por exemplo, na parte do youtube, eles prometem o seguinte: \"criar vídeos educativos animados simples explicando os principais conceitos de cadeia de bloqueios e Cardano\". Quem o faria? Como no exemplo citado, eles poderiam ter informado quem ficaria pendente para cada uma das outras tarefas. Desta forma, teríamos uma compreensão completa de quem faria o quê, o que geraria uma percepção mais organizada do processo. E por falar em processo, não nos é fornecido um roteiro detalhado. Mais uma vez, eu digo: por haver tantas atividades e tão diferentes, seria importante organizar algumas etapas a serem realizadas. Por exemplo, a fase 1: focalizada no youtube e no linkedin (hipoteticamente). A pessoa \"X\" faria a atividade \"Y\" para obter o resultado \"Z\". O que temos são os resultados esperados para 3, 6 e 12 meses (falarei mais sobre isso em auditabilidade), mas isso não é uma explicação para o processo. Essa parte deixa algo a ser desejado, infelizmente. É sempre essencial compreender as partes que compõem o todo, especialmente quando este todo é tão complexo, como é o caso. E finalmente, falando em financiamento, acredito que esta parte foi muito boa, eles compartilham como o dinheiro seria utilizado de acordo com as plataformas. Por exemplo, sabemos o quanto será necessário para promover as atividades \"Twitter, Instagram & Telegram\", e por que essa quantia é necessária. Da mesma forma, entende-se como as outras parcelas seriam utilizadas. Em resumo, acredito que, neste tópico, o que era mais necessário era a presença de um roteiro altamente detalhado. Caso contrário, temos muita confiança na equipe (embora pudesse ser melhor dirigido quem faria o quê) e uma grande compreensão do orçamento.", "q1r": 4, "q2": "Acho que é um projeto muito auditável. Como afirmam os próprios proponentes: \"a métrica chave aqui é o quanto o DAO cresce e a participação da comunidade em suas futuras iterações\". Precisamos monitorar como o público está engajado nas diversas redes sociais e se, como resultado, novos membros latino-americanos estão entrando e permanecendo ativos no ecossistema Cardano. Minha sugestão é que a própria equipe se encarregue de coletar e analisar tais dados; estes dados devem, naturalmente, ser divulgados de forma simples e direta ao resto da comunidade Cardano. Alguns infográficos poderiam ser feitos, alguma apresentação visual que reunisse dados de um determinado período de tempo (mensal seria ótimo, creio eu), e tais gráficos deveriam ser enviados à comunidade, seja através da participação em uma prefeitura ou alguns membros da comunidade poderiam ser selecionados para promover tal monitoramento. Seria interessante para os proponentes criar um roteiro detalhado com as fases a serem completadas, orientado no tempo, para que pudéssemos analisar o processo e não apenas os resultados. Como já é um grupo muito ativo e experiente, acredito que eles são capazes de reunir as informações prometidas (dados da mídia), criando novas facetas qualitativas que aumentariam a qualidade deste acompanhamento e estabeleceriam uma ponte entre eles e a comunidade, a fim de divulgar os resultados.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 25, "ne": 14, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "The proposal is within the objectives of the challenge. It is important to have financial resources to make ourselves known as a community. The problem that ALDEA has not yet defined is what it wants to do as DAO. If you are going to advertise something, you must have that something.\r\nI can contribute an idea, maybe you could produce and finance a documentary about blockchain and CARDANO or its history or something similar, or a short film. It would be excellent publicity.", "q0r": 4, "q1": "The experience is proven and we can meet the people behind the proposal. I believe that creating broadcast content would help us to make our niche bigger and bigger in LatAm. Clearly, if the objectives are achieved, it would generate an impact in the community in general, attracting new participants.\r\nThe project is reasonable, but it is important that we know the productions, perhaps in their next \"Iteration\" they will decide to create a specific site for \"grow aldea\" where we can know the progress of their productions.", "q1r": 5, "q2": "The project is perfectly auditable, both during and at the end of the projected term. The team members are well-known people in the community and participated in Fund 5.\r\nThey have a website and a community, which we must take care of and make it grow.\r\nI could see that on your website they only mention Fund5 ....., this interesting proposal must have a place in ALDEA.\r\nGreetings", "q2r": 5, "assessor": "z_assessor_743", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "The proposal addresses correctly the challenge, given though ALDEA's growth in social media will potentially make Cardano's latin american community grow as well, especially if they generate quality content about Cardano's ecosystem in practically all social medias, as they're planning to do.\r\nALDEA's marketing onboarding proposal could potentially grow extraordinarily the Cardano's hispanic community in social medias, and attract a lof of newcomers to its ecosystem, which is lacking of good-quality content through various social media platforms for the time being, and \r\nI think there's a demand of such content.\r\n", "q0r": 5, "q1": "Regarding team experience, ALDEA's core team have a wide range of IT and business expertise, and has shown a long-term community commitment with Cardano's project. However, it's not completely clear to me how each participant mentioned in the proposal will get involved in each role, and what are the professionals that they'll onboard for these marketing campaigns across various social medias aside from the CORE team (but I imagine they'll reach out to community members once the project get funded).\r\nApart from that, the plan details are well described and there's a clear road to follow for how approach each social media.", "q1r": 4, "q2": "Budget breakdown is well detailed, and success for the project is described through a 3-6-12 months period. KPIs are also displayed by the team, and it'll be clear if they succeed or not, given that all the platforms in which they'll promote the DAO have built-in metrics and analytics to measure its growth. So the auditability part is in place in my opinion.", "q2r": 5, "assessor": "z_assessor_833", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "While the general idea behind this proposal is well aligned with the challenge metrics and the plan is well described, I feel like this entire project is a bit too broad and tries to cover too many areas without going in-depth into any of its branches. I cannot find an exact suggestion at the moment, but I do commend this proposal, and I hope the team will be able to find the core that will make their project unique.", "q0r": 4, "q1": "The team have taken the time and care to craft this proposal. From the details of the plan, one can tell that this is indeed a long-term project that has already come a long way. This, coupled with the team’s prior experience and skills lead me to conclude that this proposal can be successfully implemented.", "q1r": 5, "q2": "The proposal has carefully included all the required self-assessment checkmarks and detailed each sufficiently. The budget is sensible and comprehensive. While the metrics are clear and easy to track, as the proposers mentioned, more important is the quality, not quantity of their metrics and that will be harder to assess, but not impossible.\nAs such, I can safely presume that the project can be easily and successfully tracked by the community.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 24, "ne": 2, "ng": 21, "nfo": 1, "vca_o": 1}, {"q0": "The concept of using a DAO to drive cardano adoption in Latin America might seem like a great Idea and if implemented well can Impact the ecosystem. The Team is already collaborating with other SPO and Developers in Latin America which shows their passion towards building a vibrant community hub for that region. I could see how their effort can be used to  onboard new users to the cardano ecosystem. In my opinion , I believe the problem statement and the solution can be improved  to capture and articulate  the Idea very well.  The problem statement recognises that there is an ongoing effort in solving the problem , one would expect the proposed solution to bring in a different approach to solve the same problem. I believe the concept of DAO is that different approach ,  I am Assessing the Idea itself and not how it is structured .", "q0r": 4, "q1": "The Team plans  a 12-months Communications and Inbound Marketing across major social networks with great details in each of the networks. What is lacking is an actionable step by step roadmap to achieve this plan. How many weekly posts to expect in each of the social media? How many Youtube videos and medium blog posts?\nThere is identifying information about the members of the team and experience , I have checked the team website as well for other information , I believe the Team has what it takes to complete this project.\nThe expected public launch date is defined. In general , it's a good Idea and the plan could be improved to increase the feasibility.\n", "q1r": 4, "q2": "The definition of success is defined for 3 ,6 and 12 months. Using quantitative metrics like specific number of followers & subscribers  in 3 months would have greatly improved auditability.\nit is not clear which deliverables will be delivered in the 3, 6 and 12 month periods.\nI like the strategy and the 12 month marketing plan and would also love to see risk evaluation.\n\n", "q2r": 3, "assessor": "z_assessor_430", "no_vca": 20, "ne": 1, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "Com um plano agressivo de comunicação para alcançar o ecossistema usando plataformas de mídia, a ALDEA trará atores-chave para o ecossistema e estará pronta para o futuro!", "experience": "Equipe Central ALDEA, Comunidade FALCO SPO & ALDEA"}