{"id": 384117, "author": "benzvibenjamin", "title": "Spanish courses for universities", "url": "https://cardano.ideascale.com/a/dtd/384117-48088", "category": 26242, "amount": 4440, "description": "Os estudantes da América Latina não estão bem informados sobre o Cardano e o Catalyst", "funded": 1, "upvotes": 48610816, "downvotes": 14870133, "votes_result": 33740683, "votes_cast": 181, "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "A proposta se alinha muito bem com os objetivos do desafio, pois procura criar um curso cujo objetivo é declarar os estudantes de negócios sobre Cardano e Catalyst. Se bem-sucedido, este projeto certamente beneficiaria tanto a América Latina quanto o ecossistema Cardano, já que, para o continente, promoveria um incentivo econômico através do financiamento de projetos e, para nossa cadeia de bloqueio, traria novos usuários para usar nossas tecnologias e, assim, ampliaria o alcance do Cardano. Entretanto, tenho algumas horas de trabalho a fazer aqui. Primeiro, não conhecemos muitos detalhes sobre o curso. Conhecemos o principal, que seria Cardano e Catalyst. Mas quais são os assuntos específicos de cada aula? Quanto tempo duraria cada aula? Em que plataforma seriam hospedados os vídeos? O curso seria gratuito ou pago? Qual é a duração total do curso? Não conhecemos os detalhes que dizem respeito à parte mais básica do projeto. Eu também estava me perguntando como estas reuniões presenciais estão relacionadas, se dois dos três membros da equipe estão morando na Europa. Onde seriam estas reuniões? Qual é o número médio de estudantes que eles pretendem encontrar de uma só vez? Quanto tempo duram estas reuniões presenciais? Em geral, eu gostei da idéia, mas acho que faltaram detalhes. O impacto é certo, mas para ter ainda mais segurança, precisaríamos entender exatamente do que estamos falando aqui.", "q0r": 3, "q1": "A equipe envolvida não parece ser muito capaz de executar o projeto com sucesso. Benji e Viktor estudam negócios na França; e Paco é um jornalista. Eles afirmam que são todos novos para a comunidade. Como então eles teriam a preparação necessária para promover este curso? Eles não nos provam que já compreendem bem a cadeia de bloqueio, eles seriam capazes de criar aulas com conteúdo de qualidade e profundo sobre o assunto. Penso que a idéia funcionaria muito melhor se contratassem alguém que já estivesse na comunidade a tempo, que já trabalhasse com Cardano e que tivesse domínio das partes técnicas. Não entendo exatamente o que os estudantes de negócios poderiam fazer aqui, entendo que o papel da Paco seria divulgar o projeto (gostaria de saber o que é RP), mas infelizmente esta equipe não me dá confiança para trabalhar com a criação de um curso . Acho que, como mencionei, eles poderiam incluir pessoas especializadas na cadeia de bloqueio e depois, sim, dividir tarefas, para que pudéssemos entender quem faria o quê e então teríamos a confiança necessária. Sobre o roteiro, os autores incluem alguns passos que seriam necessários para o desenvolvimento do projeto, mas acredito que faltam detalhes. Não fomos capazes de visualizar em profundidade como seria o processo. Por exemplo, na primeira etapa, \"criar um curso\": todos aqueles detalhes que mencionei no tópico anterior vêm à mente, sobre assuntos, duração, plataforma e assim por diante. Em \"promoção e marketing\": seria necessário detalhar quais universidades pretendem abordar (não sabemos que país seria, provavelmente a Argentina, mas isto não é explícito), como seria e como seria e como seria e como seria a estratégia de marketing nas redes sociais, etc. E finalmente, quando se trata de finanças, algo semelhante ao que vemos nas etapas acontece. Temos informações básicas, mas não detalhadas. Cada um dos tópicos poderia ser melhor explicado pelos autores.", "q1r": 3, "q2": "Os autores fornecem informações que podem servir bem para monitorar o projeto, mas tudo se resume a resultados. Seria, em resumo, o escopo do curso: quantos alunos foram ensinados, quantas propostas lançaram pós-curso, formação de centros de pós-curso, etc. Mas também seria interessante se tivéssemos os meios para avaliar o processo, e não apenas os resultados. Portanto, pensei que as informações fornecidas aqui são um pouco superficiais, cobrindo apenas uma parte da análise. Seria ótimo para a equipe permanecer em contato com o resto da comunidade, para reunir os dados que selecionam aqui em um relatório e apresentá-los ao resto da comunidade, durante uma prefeitura, por exemplo. Também seria ótimo se qualquer comunidade de língua espanhola pudesse participar do curso para classificá-lo e trazer esse feedback à comunidade. Em outras palavras, acho que existe aqui um princípio de auditabilidade, mas ele deve ser aprofundado.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "O problema declarado e a solução está muito bem alinhado com o Desafio, pois visa aumentar os níveis de conscientização das pessoas na América Latina sobre Cardano e Catalisador. A abordagem de solução tem um alto potencial de impacto positivo porque, de acordo com várias pesquisas em todo o mundo, as pessoas mais jovens, especialmente os homens, são mais propensos a se envolverem em atividades cypto/blockchain. Em minha experiência como brasileiro do Rio de Janeiro, a maioria, se não todos, os estudantes universitários já ouviram falar de moedas criptográficas e correntes de bloqueio, mas a maioria deles não sabe como fazer parte desta tecnologia, ou não entende os benefícios que poderiam obter com ela. Proporcionar um curso em espanhol sobre Catalisador nas escolas de administração deve provavelmente despertar o interesse desses estudantes, criando valor para o ecossistema Cardano/Catalisador, para si mesmos e para seus países. Eles são a próxima geração de líderes empresariais e toda esta informação sobre Cardano e Catalisador lhes dará meios para construir novas infraestruturas empresariais e sociais prontas para as próximas décadas. Os KPIs correspondem perfeitamente ao desafio indicado pelos KPIs, uma vez que buscam atrair novos membros para a comunidade e apoiá-los na elaboração de novas propostas no próximo ciclo de fundos. Eu sugeriria apenas acrescentar um KPI para medir a qualidade dessas propostas, com base nas pontuações dadas, como indicado pelo desafio. Acho que é uma grande idéia e poderia ser expandida para incluir outras áreas como estudantes de engenharia e economia, assim como uma versão em português para estudantes brasileiros.", "q0r": 5, "q1": "Eles já contam com uma equipe de 3 estudantes de negócios latino-americanos que podem se relacionar com seu público alvo. Há uma descrição detalhada das horas de trabalho necessárias, um plano claro passo a passo com ações e prazos específicos, o orçamento faz sentido e leva menos de 1% do orçamento total do desafio. Eles identificaram os riscos e ofereceram possíveis soluções para mitigá-los. Acabo de perder informações sobre como o curso será conduzido, como pessoalmente ou on-line, ao vivo ou gravado, em qual plataforma ou lugar, gratuito ou pago, bem como informações sobre as habilidades que possuem que os ajudarão a construir um curso eficaz. De qualquer forma, acredito firmemente que é completamente viável. Acrescentar as informações mencionadas me faria dar a 5ª estrela.", "q1r": 4, "q2": "Eles forneceram um roteiro com marcos e horizontes temporais. Entretanto, acho que poderia haver mais especificações sobre o curso, como a duração em horas e o que esperar de seu conteúdo. Isso tornaria mais fácil acompanhar o progresso do desenvolvimento do curso. Além disso, eles poderiam especificar quais Universidades estarão promovendo o curso no início para dar ao passo 2 um melhor acompanhamento do progresso. Os KPIs fazem sentido e definem claramente o que significa o sucesso neste projeto.", "q2r": 4, "assessor": "z_assessor_951", "no_vca": 21, "ne": 12, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "A proposal is a well-laid-out approach to the challenge at hand. The challenge is Latin American students not having enough knowledge about Cardano and Catalyst. The proposal wants to resolve it by creating a course about Catalyst for Latin American students. This clearly addresses the challenge", "q0r": 5, "q1": "The team appears to be well versed with the requirements and has the essential expertise to make this proposal a reality. The team has provided the voters with a clear action plan with steps needed to be taken. The proposal was also given a detailed budget breakdown and the fund requested also appears to be reasonable hence the possibility of the proposal being implemented successfully is high", "q1r": 5, "q2": "The proposal consists of well-laid-out steps and KPIs that auditors can use to track the progress of the proposal. the team has also mentioned possible challenges and risks the team might face during the implementation and has also given a complete fund allocation all this information will be enough to track and audit the progress of the proposal successfully.", "q2r": 5, "assessor": "z_assessor_317", "no_vca": 19, "ne": 5, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal certainly fits the challenge of acquiring more users and adoption for Cardano. Bringing common knowledge about Cardano to students of universities in Latin America. Creating a catalyst for Latin American students in business schools. The given solution completely solves the problem.", "q0r": 5, "q1": "Clear, detailed plan and proposed milestones seem very easy to achieve the set goals\r\nA number of potential risks and challenges have been identified and the proponent offers solutions to address some of them. Offer to give clear step by step plan with different milestones as mentioned earlier as well as potential challenges or risks he may face\r\nThe downside of this suggestion is that you don't provide enough information, it would be better if you add background and need proof of your experience for the community to believe", "q1r": 4, "q2": "A clear roadmap with 3-month milestones is provided. A reasonable timeline and solid goals were presented.\r\nAn entire section with easily tracked KPIs along with a list of plans after the first 3 months will increase the transparency of this project and proposal. I agree that the suggested data and success criteria are accurate for measuring progress in the challenge\r\nThe stated budget is reasonable enough and it makes me completely agree that the team can tackle the challenge. Very well thought out and presented budget", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is addresses directly the challenge through elevating Cardano's awarenes in the business school students communities in Mexico and Argentina who in turn could turn into multipliers and active members of the Cardano Community. I believe this is a powerful way to expand in Latam eventhough the scale of the proposal is somewhat small limiting it's initial potential it has a huge potential to scale into a significant force.", "q0r": 5, "q1": "-The team seems to have a clear idea of how to implement the proposal and have identified risks.\r\n-No evidence has been provided of the team's knowledge and capacities to create content a course on Cardano.\r\n-The budget seems reasonable for the proposed task. It would be great to see how the initiative would scale in future funds.\r\n-The proposal has a detailed implementation plan with defined timeframe, KPIs and goals.\r\n", "q1r": 4, "q2": "- The proposal is implementation and success is easily verifiable as the course would have to be produced but also by verifying the existance of the community and it's activity.\r\n- Proposed KPIs and goals make sense and can be used to asess the success of the proposal's implementation.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "Oganizing course for young people in universities is a great way to expose them to Cardano ecosystem. Since the first attention, they can be attracted to become new member of Cardano Catalyst community. The students community is also sensitive with information like that, so hopefully they will spread the information to their peers. Plus, organizing course in universities is a traditional way, simple but effective. ", "q0r": 5, "q1": "The proposal includes detail plan with actionable steps. The project is quite simple and familiar with university student so he might handle it well with preparation and support from Catatlyst (He just need some money to start!). The budget also be explained well. There is only a risk that his ability is not good enough to organize such event but I assume optimistically that it's a small risk.", "q1r": 4, "q2": "The KPIs is clear with quantity numbers for each goal. I'm looking forward to these young people to join the community and their attribute afterward.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Criar um curso sobre catalisador dedicado a estudantes latino-americanos em escolas de administração", "experience": "Alunos de escolas de negócios\nOrigens latino-americanas (Argentina e México)\nFalantes de espanhol"}