{"id": 384127, "author": "sbpabon", "title": "Technical school for Latin America", "url": "https://cardano.ideascale.com/a/dtd/384127-48088", "category": 26242, "amount": 7500, "description": "As pessoas na América Latina (desenvolvedores também) têm um entendimento errado sobre a tecnologia da cadeia de bloqueio. Demasiados golpistas que vendem especulação de óleo de cobra.", "funded": 0, "upvotes": 16278050, "downvotes": 25765118, "votes_result": 9487068, "votes_cast": 121, "f6_no_assessments": 6, "f6_rating": 3.277777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Ter plataformas de e-learning para as pessoas aprenderem sobre a cadeia de bloqueio é essencial, mas a proposta carece de informações sobre como esta plataforma funcionaria.\r\nSeria desenvolvida do zero ou usada uma plataforma de e-learning já existente? Haveria alguma taxa para usos? Em caso afirmativo, deveria haver alguns espaços gratuitos para pessoas de baixa renda.\r\nEm segundo lugar, qual conteúdo (ou programa) será fornecido aqui? Quais formatos (textos, vídeos, podcasts, palestras ao vivo) seriam utilizados? Os idiomas que o conteúdo estaria disponível também deveriam ser mencionados na proposta, a fim de melhor avaliar seu impacto. Além disso, como a comunidade interagiria com esta plataforma? Seria possível submeter ou solicitar conteúdo? haveria um lugar para discussões? Todas estas informações deveriam estar disponíveis desde o início.\r\n\r\nPor último, antes de desenvolver a plataforma, há um passo de aprendizado pago para a proposta. faz com que o projeto leve muito mais tempo para agregar valor à comunidade (1 semestre de atraso). Há outras propostas para desenvolver plataformas de aprendizado com resultados mais rápidos. Uma coisa interessante a fazer é desenvolver a plataforma à medida que o proponente aprende em sua, compartilhando como este processo está indo e trazendo perguntas e discussões entre seu curso e sua plataforma de e-learning. Se ele já fosse um professor, como descrito, esta interconexão não seria difícil de fazer.", "q0r": 2, "q1": "Há uma única pessoa já dedicada a este projeto, mas com aparente pouco conhecimento sobre o que ele pretende ensinar (este conhecimento seria desenvolvido na primeira etapa do projeto). Isto torna este projeto um pouco arriscado em termos de viabilidade técnica (thnking about the quality and low experience from proposer).\r\n\r\nHá um plano/roteiro com datas (isso é bom!), mas o prazo para a conclusão é bastante longo, pois envolve um passo de aprendizado antes de realmente iniciar o desenvolvimento.\r\n\r\nA discriminação de custos está listada, mas poderia ter mais detalhes sobre a parte principal do projeto: como os 5k USD seriam utilizados no desenvolvimento da plataforma?", "q1r": 2, "q2": "Existem de fato bons marcos, mas não há KPIs - o que está listado como KPIs na proposta são realmente marcos, não algo que você possa medir quantitativamente. Como verdadeiros KPIs, poderiam ser medidas as notas nos cursos (elas deveriam ser altas, pois a comunidade estaria pagando por seu curso e para trazer valor de volta à comunidade), número de usuários da plataforma, número de conteúdos gerados e assim por diante. Todos com metas relacionadas ao tempo.\r\n\r\nComo risco, o principal seria não obter conhecimento suficiente no curso para realmente fazer conteúdo para esta plataforma.", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 19, "ne": 10, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Unfortunately, there is a lack of information in this proposal. \r\n1) How the platform will actually work? Is it going to be developed from scratch or are you going to use an existing one? If you're going to develop, why are you doing it since there are several others?\r\n2) Since you're creating a 'course', are you planning to monetize it or, since you're thinking in a cultural, caring and developing manner it'll be free? If this have a cost, how much is it going to be?\r\n3) Which country of LATAM you're thinking to reach first? The ones with Spanish language, Portuguese, etc.?\r\n4) the proposal is much more focused in your learning step than developing the community.\r\n", "q0r": 1, "q1": "There is no explanation of the methodology that will be adopted in the course, no syllabus, no country/language reference (since LATAM has several languages within it). There is not a detailed explanation of e-learning platform approach. It needs more detail in the timetable. \r\nThe lack of information makes it hard to know if this proposal is feasible besides the scholarship part.\r\n", "q1r": 1, "q2": "The KPIs is not a metric, nothing that can be measured objectively. A KPI would be # positive feedback using the platform, # feedback of syllabus, # people using the platform, etc. The timetable is not detailed as well.", "q2r": 1, "assessor": "z_assessor_25", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "The proposer wants to build a learning platform that will teach the blockchain technology to latin american people. This proposal has effectively identified a problem within the challenge. The problem the proposal is trying to solve is the miseducation of certain people on the blockchain technology. I would suggest to the proposer to be more precise on the subject that will be treated on the platform. The proposer should also be more clear on the type of content that will serve as learning material, whether it will be articles or videos. Apart from that, I think that this proposal can add value to the cardano ecosystem by bringing new users who can help build it. Furthermore, I think that the proposal can scale in future challenges.", "q0r": 4, "q1": "The idea in this proposal is very interesting. However, there is a lack of information that can compromise its feasibility a little bit. Providing these information can greatly improve the quality of the proposal hence its chance of being funded. The budget should be broken down into identifiable items. In addition to that, the proposer should include a plan for future funds if needed. Furthermore the  proposer should include challenges and risks relevant to a successful implementation. I have a neutral note on the feasibility of this proposal based on the amount of information provided in that regard.", "q1r": 3, "q2": "The proposal includes milestones but it is really vague. The KPIs are not very strong in my opinion but they are included. I think that the proposer should focus on providing more information on what steps are needed to build the platform. Failing to do so will result in a difficult auditability. My note is neutral in the auditability as it needs improvements.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 18, "ne": 4, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is about bringing people closer to blockchain technology. This is a great and meaningful idea. The problem is clear, suitable to the given challenge and clearly explained in detail, and the proposed solution is quite well-prepared [with a specific milestones, budget breakdown, and KPIs,...], showing potential impact on the Cardano ecosystem as a whole. Therefore, based on the given information, I agree with this proposal's impact, I can rate it with a score of 4", "q0r": 4, "q1": "Proposer profile is provided and described enough for understanding, with suitable skill, experiences, and local background [very important for this kind of work] for implementation, with reference/proof (https://github.com/sebpab) for verifying. Moreover, the plan is specific and well-prepared. So, this convinces me of feasibility. However, for a better understanding of feasibility, the risk management should be defined. Therefore, based on the given information, I agree with this proposal's feasibility, I can rate it with a score of 4", "q1r": 4, "q2": "This proposal provides plenty of information. The plan is clearly described. However, for a better understanding, risk management should be defined. Based on the given information, I agree with this proposal's auditability, I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "This proposal sets out a clear problem which is clearly linked to the challenge criteria and deliberately linked in the sections \"How I address the Challenge question?\" and \"How my proposal impacts the challenge metrics? Thus the desire and reflection of a positive impact in the Latam ecosystem is clearly developed. And allows one to imagine the positive impacts on the Catalyst community as a whole with this goal to  make like a bridge between Cardano technology and the most important problems in the Region. which may not be clearly stated in the KPIs, which rather address technical implementation issues, but which is still understandable, as it has already been stated beforehand.", "q0r": 4, "q1": "The participant experience and skills are clearly described with links to his profile and videos. The budget is clear and looks realistic, but perhaps could have been a little more detailed regarding the construction of the platform.\r\nThe roadmap is not clearly stated even if  appears implicitly through the Milestones and the definition of success after 3, 6 and 12 months. The technical aspects and contextualization are well explained in particular in the objectives of the beginning\r\n Overall, the project seems realistic, particularly in terms of temporal realization. But the possible risks have not been addressed.", "q1r": 4, "q2": "The informations given emphasizes the benefits of this project for the Latin American ecosystem, its direct relationship with the criteria of the Challenge as well as its positive impact in local terms. Unless I am mistaken, perhaps it would lack more precision especialy with details of how the progress of the project would be transmitted and communicated to the community at large. Even if it´s seems posible to follow it on github. The KIPs and metric values ​​could also have specified the quantitative objectives in terms of educated people, to give more idea on the number of people concerned, which would have specified the impact at the local level of this project. But a time horizon is given with an Expected public launch date of the platform in August 01, 2022, which is a good point.", "q2r": 4, "assessor": "z_assessor_739", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This is an amazing education initiative and effectively addresses the challenge. ", "q0r": 5, "q1": "The proposer's GitHub shows they have begun some level of plutus pioneer training, as well as other repos in various languages. The plan included has KPI's, milestones, roadmap and a budget.", "q1r": 5, "q2": "The proposer has described their plan to build a technical learning platform for blockchain enthusiasts in LatAm in solid detail within the proposal. The info provided is sufficient to audit the progress of the proposal. ", "q2r": 5, "assessor": "z_assessor_966", "no_vca": 25, "ne": 1, "ng": 12, "nfo": 12, "vca_o": 1}], "solution": "Descarte completamente o campo de vendas da cadeia de bloqueios para aproximar as pessoas da tecnologia. A solução não é convencer, é ensinar.", "experience": "Empreendedor Social na Colômbia (meu país) nos últimos 20 anos. Professora. Desenvolvedor. Estudante do Atala Prism Pionner. CA."}