{"id": 384299, "author": "seedstars", "title": "Democratising Blockchain in Latam", "url": "https://cardano.ideascale.com/a/dtd/384299-48088", "category": 26242, "amount": 50000, "description": "Blockchain é um mundo de nicho reservado para aqueles que têm experiência. Isto deixa uma lacuna para que os talentos em potencial entrem em ação e colaborem", "funded": 0, "upvotes": 16674719, "downvotes": 19819013, "votes_result": 3144294, "votes_cast": 116, "f6_no_assessments": 4, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta proposta está teoricamente bem relacionada com os objetivos do ecossistema, pois beneficiaria a população do continente latino-americano, ao promover uma série de eventos / workshops, e também o ecossistema Cardano, enquanto tais reuniões seriam centradas na transferência de informações sobre nossa cadeia de bloqueio . O problema aqui seria que o continente não tem tanta atividade da cadeia de bloqueios e o acesso é difícil para iniciantes, o que é verdade. Entretanto, todas as informações aqui apresentadas, a fim de resolver tais problemas, são dadas de uma maneira muito superficial. Não sabemos em detalhes como funciona a Seedstars; assisti ao vídeo, no qual foi transmitida a mensagem de que, basicamente, a Seedstars é composta por profissionais distintos que estão ansiosos para fazer a diferença e ir mais longe em suas áreas de especialização. Tudo bem, vamos entender o perfil dos participantes; mas o que eles fazem, exatamente? Na parte relevante da experiência, o autor da proposta afirma que o grupo ajuda os investidores através de treinamento e investimentos. Mas não é possível entender em detalhes como é essa ajuda, e seria importante entender também o impacto da proposta. Não sabemos realmente o que eles fazem, então é um pouco difícil entender como seriam essas ações na América Latina, quais seriam os assuntos tratados nas reuniões, em que país (ou países) elas ocorreriam, qual seria o público-alvo (provavelmente seriam empresários que não conhecem Cardano) e assim por diante. Não está nem mesmo claro como as Seedstars estão diretamente relacionadas com nossa cadeia de bloqueio, não se passa muita segurança nesta ponte, portanto, nossa confiança no impacto do projeto também é abalada. Penso que seria necessário reformular a proposta, incluindo 1) links onde poderíamos aprender mais sobre o grupo Seedstars, sua vida diária e suas ações 2) como eles conhecem Cardano 3) como esta proposta poderia dialogar mais especificamente com a América Latina. Pensariam eles sobre as especificidades do público, as necessidades da demanda?", "q0r": 2, "q1": "A descrição dos membros da equipe tem até detalhes, mas é insuficiente, na minha opinião. Podemos compreender os principais papéis de cada membro da equipe e o que eles fariam neste projeto, mas não sabemos coisas muito importantes, tais como: o que eles fizeram até agora em suas áreas de especialização (um pequeno currículo) e, especialmente, qual é sua relação com a cadeia de bloqueio Cardano. As únicas duas pessoas que citam Cardano (indiretamente) em suas descrições são Paula e Romulo, mas não é possível entender muito bem como eles conheceram a cadeia de bloqueio, há quanto tempo e o que eles estudam e/ou trabalham dentro do ecossistema. Gostaria que esta relação fosse mais esclarecida, e em um conhecimento mais profundo de cada um deles, isto poderia ser resolvido se eles anexassem seus perfis interligados (se eles tiverem um). Sobre o roteiro, ele é bastante detalhado, embora não seja ideal. É positivo como eles determinam quais atividades seriam realizadas e com quais objetivos, mas tais atividades poderiam ser muito mais detalhadas. Por exemplo, no mês 1: \"estender a mão à comunidade e alcançar as partes interessadas para iniciar o engajamento na iniciativa\". Como elas alcançariam a comunidade? A propósito, que comunidade é essa, exatamente? De que país, faixa etária, nível de educação? Como este contato seria estabelecido? Da mesma forma, há uma falta de detalhes para entender as especificidades sobre as atividades de todos os outros meses. É um problema que eles definam um intervalo tão longo entre eles: \"mês 3 - mês 7: Execução de eventos\", e deixaram tal lacuna nesta parte do projeto em termos de detalhamento da atividade mais importante da proposta, a execução dos eventos . Teríamos que entender uma série de coisas. Entendo que a idéia deles é, após o financiamento, definir onde os eventos ocorreriam e quais são as questões, mas para nós seria muito melhor se esses detalhes fossem estabelecidos de antemão e apresentados. Desta forma, teríamos muito mais confiança se o investimento seria válido ou não. E quanto ao orçamento: faltavam muitos detalhes; por exemplo, na parte seguinte: \"comm, PR & Marketing = $15.000\". O que seriam \"com\" e \"PR\"? Por que a 15k encomenda para estas peças? Qual seria o aspecto da campanha de marketing? Isto seria muito importante para o sucesso ou fracasso do projeto, portanto, seria importante entendê-lo profundamente. Da mesma forma, não podemos entender porque cada quantidade foi escolhida para cada coisa, seria preciso mais explicação e profundidade para transmitir a noção de que sim, a quantidade pedida seria justa.", "q1r": 3, "q2": "É bastante válido quando dizem que após cada evento haveria uma análise das atividades e seus resultados, e isto seria compartilhado com o Catalyst (não seria com a comunidade Cardano, já que o Catalyst é nosso programa de financiamento e não necessariamente nós? ). Mas não sabemos quem faria esses relatórios, como eles fariam e qual seria a plataforma de contato entre essa pessoa e a comunidade Cardano. No final, eles também prometem realizar uma pesquisa geral, que analisaria os impactos do projeto para Cardano, Seedstars e América Latina. Também seriam necessários mais detalhes para entender o que seria feito aqui, como esta análise seria construída, com base em que estatísticas e como seria apresentada à comunidade. É ótimo que eles se proponham a realizar a auditabilidade, porque a maioria dos autores/equipas não tem esta preocupação, mas a forma como a informação nos é passada, não podemos entender de forma sólida como estes feedbacks seriam feitos. Portanto, sugiro que eles incluam com mais detalhes como as análises seriam feitas, e para que possamos ter certeza de que a proposta será auditável adequadamente. Pelas informações propostas durante o roteiro, não o considero um projeto facilmente auditável porque, como disse, o roteiro não tem atividades muito detalhadas, o que dificulta saber exatamente o que deveríamos estar monitorando.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 19, "ne": 13, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "The identified problem starts from a false premise as \"the blockchain\" being a niche world, thus the statement of what problem is to be solved remains vague. Since 2009, when Bitcoin was released in the wild :), the use of blockchains has exploded via the creation of various cryptocurrencies, decentralized finance (DeFi) applications, non-fungible tokens (NFTs), and smart contracts. Today, is hard to find a real world use case that cannot fit into the blockchain technology.\r\n\r\nAnyway, the solution aims to give people the knowledge they seek about the blockchain through training, workshops and events but is unclear what are the benefits for the Cardano ecosystem, in particular.", "q0r": 2, "q1": "The team has four members and each of them has a role assigned and there is a brief description of their experience. Unfortunately, is unclear which one has the necessary expertize for providing training/workshops to various people.\r\n\r\nEven the proposal has a timeline defined it is unclear what are the deliverables of each stage, as they are presented in a generic manner.\r\n\r\nNo KPIs/metrics are defined to measure the success of the expected outcome (who is the target audience? how many people are expected to attend trainings/workshops/events? what are the main topics related to the Cardano ecosystem that will be presented to the audience? is there an increase of users using apps related to Cardano? The proposal aims to give the necessary info and expertize to onboard SPOs in the Latam region? etc.).\r\n\r\nThe plan doesn't describe the resources necessary to implement the proposal. The budget is broken down into identifiable items but lucks in providing relevant info on what the funds will be spending (it is unclear what \"Comm, PR & Marketing = $15000\" means in terms of inputs/outputs)\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation", "q1r": 2, "q2": "The proposal itself reads very poorly for an outsiders. It reads like a concept more than an executable proposal. It needs more editing so that it can be assessed properly given its direction. Perhaps reworking it and submitting it at the later stages will work better. ", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 21, "ne": 2, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "Impact-wise, the proposal is a clear winner. The proposer addresses the problem of blockchain being reserved to those who possess the expertise and is quite a dark realm for those who don't dwell much on technology. The proposer appears to rectify this inadequate outreach amongst the crowd. The proposer states to provide a series of workshops and events in order to foster the creation of multiple hubs and eventually drive varied contributions across the Cardano ecosystem. Therefore, looking at the bright side, this proposal could be the key to providing a lot of resources to the masses which lacks the required expertise to excel on the blockchain.", "q0r": 5, "q1": "The plan howsoever being a great initiative, is deficient in multiple sections. The proposer provides the readers and voters with a detailed monthly agenda, however, the success definition for these milestones seems to be missing. The team however appears to be well versed with the requirements and to have the essential expertise to make this proposal a reality. The possible risks and obstacles involved are not being mentioned and there is no information provided with how the team expects to reach out to the people. Thus, I feel the proposer has overestimated the plan a little, and keeping the time horizon mentioned in the manifesto in mind, I strongly feel the funds requested could be rectified and a portion of it could be requested in the further rounds showing the progress as a shred of evidence. ", "q1r": 3, "q2": "The proposer writes a separate section on how the auditors could track their progress and monitor the success. The team plans to provide regular reports for the same purpose. However, stating a few foreseeable KPIs that the community could look forward to could have added more weightage to the proposal. Metrics such as estimated number of active users of services, the monthly increase in the percentage of new members enrolled in the courses and events, the number of contributions that are initiated and etc., would have provided the readers with a rough estimate about the outreach and impact this would have on people especially in LatAm. Hence, I feel the missing details on key metrics make it tough for the readers to assume the success and impact rate of the proposal, and similarly, it would make the audit process difficult to compare its outcomes to the challenge's outcomes.", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses perhaps the most relevant issue regarding blockchain community growth, that is reaching non technical people who does not have expertise regarding this subject. Their intent to promote series of trainings, workshops and events in Latin America could certainly help increase awareness in this region. However, based on the information provided on this proposal, and their website, the contents of such events does not include the Cardano ecosystem specifically, it talks about blockchain in general. Surely, increasing awareness about blockchain in Latin America would increase awareness about Cardano, but not directly. Their KPIs do not match the ones indicated in the challenge, because they don't measure Cardano community growth, increase in transactions processed or formation of new SPOs. The KPIs indicated in the proposal only measure the events success. For that, I cannot agree with the impact of this proposal on the Cardano ecosystem in Latin America.", "q0r": 3, "q1": "The proposal shows a 4 members team, managers of their respective areas, and their responsabilities. All 4 positions are already delegated, but there is not information provided about their experiences and skills.  I could find links to the LinkedIn of 2 of them on seedstars website, Romulo and Alejandra, but not of Paula and Camila. There is a timeline with tasks and objectives that seem feasible, judging by the seedstar's website informations, content and previous events. They are requesting 15 thousand dollars for Comm, PR & Marketing but do not specify how it will be spent. It is not informed which Software & Tools will be used. Therefore, there is need of more detailed information to justify the request for 10% of the challenge total budget.", "q1r": 3, "q2": "The proposal provides a timeline with tasks and a time horizon, but the objectives are not quantified, so it is not possible to measure the success of each step. There are KPIs that measure the events and reports success, none of them regarding Cardano, but they do not have a specific goal, so it is not possible to know what success mean in this project. For a better auditability, the proposal needs measurable objetives, specific goals for their KPIs and include KPIs related to the Cardano ecosystem, like Cardano community growth, increase in transactions processed or formation of new SPOs.", "q2r": 2, "assessor": "z_assessor_951", "no_vca": 23, "ne": 10, "ng": 13, "nfo": 0, "vca_o": 1}], "solution": "Série de treinamentos, oficinas e eventos para os atores do ecossistema em Blockchain, utilizando nossos Espaços de Sementes para criar comunidade.", "experience": "Seedstars está ajudando os empresários em +90 Mercados com programas e investimentos de desenvolvimento de capacidade. Temos uma comunidade vibrante em Latam."}