{"id": 384295, "author": "joseiadicicco", "title": "Platform for Cardano Solar Farms", "url": "https://cardano.ideascale.com/a/dtd/384295-48088", "category": 26242, "amount": 14400, "description": "San Juan é uma das áreas mais pobres da LATAM Argentina, com maior exposição solar, falta de água e energia levam a más condições de vida.", "funded": 2, "upvotes": 102884538, "downvotes": 2645246, "votes_result": 100239292, "votes_cast": 310, "f6_no_assessments": 6, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"q0": "Acredito que esta proposta é de alto valor e está muito bem alinhada com os objetivos do desafio. A idéia é criar uma fazenda de energia solar, através da qual os investidores possam usar fichas para investir no projeto, por meio da cadeia de bloqueios Cardano. Com isso, tanto o continente se beneficiaria, já que o projeto trabalharia com energia limpa e renovável, e utilizando características já presentes na cidade escolhida, que tem uma alta projeção de luz solar; quanto o ecossistema Cardano, já que o foco seria investir através de fichas, o que aumentaria o número de nativos digitais em circulação e promoveria uma maior adoção do Cardano. É um pouco preocupante que o financiamento aqui solicitado cubra apenas a primeira fase deste projeto, mas isto é compreensível, já que a geração de energia é sempre muito cara. Portanto, acredito que apesar deste detalhe, a comunidade deveria analisar cuidadosamente esta proposta e considerar a votação, penso que investir em energias ecologicamente corretas também dialoga com os objetivos gerais de Cardano, em termos de promover um futuro melhor para todos.", "q0r": 5, "q1": "A equipe monta um roteiro dividindo o tempo total de 12 semanas pela metade; na primeira metade, eles detalham exatamente quais seriam seus objetivos e quais atividades seriam necessárias para alcançá-los, cronologicamente. Esta informação também é seguida pelo número de horas trabalhadas (240 horas) e a remuneração por estas horas. Eles também afirmam que duas pessoas trabalhariam neste primeiro passo: seria interessante apresentar quem eles eram. As mesmas coisas acontecem no tempo restante da semana de 6 a 12; sabemos o que aconteceria, quantas pessoas trabalhariam e sua remuneração. Achei esta forma de organizar o projeto muito simples e eficiente, entendemos exatamente o que é esperado, dando-nos a possibilidade de visualizar o processo com muita precisão. Além disso, os autores também discutem o que aconteceria depois, demonstrando que eles têm uma visão completa do projeto, embora o financiamento aqui solicitado corresponda apenas à primeira fase. Finalmente, no que diz respeito à equipe, eles detalham muito bem quem são, seus nomes, papéis no projeto, incluem uma breve mas suficiente descrição do que fizeram até o momento. É extremamente positivo que, além de suas profissões tradicionais, eles tenham um contato sólido com o ecossistema Cardano, através do desenvolvimento de piscinas e assim por diante. Desta forma, é transmitida muita confiança na equipe e em sua capacidade de executar o projeto com sucesso.", "q1r": 5, "q2": "A auditabilidade aqui é boa, mas não tanto quanto os itens analisados acima. A equipe nos mostra quais seriam os resultados esperados nos períodos de 3, 6 e 12 meses. Mas, como este é um projeto um tanto complexo, seria importante ter mais detalhes. Cada uma destas métricas é bastante simples, curta. Seria mais interessante se eles tivessem acompanhado uma semana, ou seja, elaborado 12 tópicos demonstrando quais seriam os objetivos específicos para cada semana de trabalho. Eles poderiam realizar reuniões mensais com a comunidade Cardano, a fim de discutir como o projeto estava sendo realizado, em tais reuniões poderiam ser mostrados relatórios com dados organizados sobre os resultados daquele mês. Por ser um projeto muito específico e diferente, creio que seria mais apropriado que a própria equipe trouxesse este feedback que elegemos alguém da comunidade para acompanhar este projeto... A menos que você fosse uma pessoa com experiência em energia renovável, isso seria muito interessante! De qualquer forma, acredito que sim, a equipe nos fornece meios para monitorar o progresso do projeto, mas eles são insuficientes para realizar uma auditoria de qualidade.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 18, "ne": 12, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "I see this proposal as having a lot of potential in bringing value, not only to the local residents of San Juan, Argentina, but also to other places around the world in need of the invaluable resource that is electricity, and as such it will bring value to the entire Cardano ecosystem.\r\nAdding a successful tokenomics system to the building and usage of solar panels is a great idea and a high likelihood of bridging the gap between blockchain investors and residents of the small communities where these investments will be made.", "q0r": 5, "q1": "The team already has experience in the solar energy domain, local knowledge, from being residents of Argentina and as stake pool operators they have knowledge and investment in the Cardano blockchain. All these aspects give a high chance of success to the proposal, not just from the knowledge and skills they possess but also from their financial and personal investment into the well being of the Argentinian and Cardano community. ", "q1r": 5, "q2": "Their timeline, KPIs and budget are sensible. They present the knowledge they have, but also the one they do not. The budget for this first phase of the project is to set up a reliable foundation for a project that could be used all around the world. Research into the necessary roadmap for setting up a solar farm and research for a tokenomics system, that will be the one incentivising investors from all over the world to participate in this endeavour on the Cardano blockchain.\r\nThe project should be easy to evaluate for progress.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 19, "ne": 6, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The proposal effectively addresses the challenge by onboarding new cardano users in latin america through a green energy program. The proposers will develop a platform for worldwide investment in green energy in latin america. I believe that this model can be incredibly effective because it encourages latin american citizens to get into green energy and blockchain (specifically cardano), while also providing an investment opportunity for individuals abroad. Thus, this project has the potential to greatly benefit people living in latin america by providing more income to small solar farm owners and also decrease pollution by generating electricity through renewable means. (score given: 5)", "q0r": 5, "q1": "The proposers both have lots of experience with cardano and the energy sector, both of which will hugely important when implementing this project. Given the experience information they provided, I believe that they will successfully implement the project.\r\n\r\nThe proposers' plan to visit energy farms in the San Juan region and then develop their business model and tokenomics seems achievable in the given timeframe. They listed a lot of good detail that indicates that the proposers will be dedicated to making this project a reality. Additionally, they have listed a good budget with strong reasoning for the exact amount requested. Overall, I believe that this first phase of the project will be successful. (score given: 5)", "q1r": 5, "q2": "The proposers provided sufficient information to audit the progress and success of the proposal. They have listed the key milestones for each period of the project (roughly 3 month chunks). The final report from the first phase can also be a good way for the cardano community to check on the progress of the proposal. I would, however, have appreciated some more details on other key performance indicators that the proposers can keep the community updated with, such as number of solar farms potentially involved with the project and number of investors. These are metrics that can potentially be added in the future as the project develops. Also, the proposers should clarify how they will keep the cardano community updated (what means of communication) and how frequently they will submit reports to inform the community. These are minor concerns, but addressing them would take the proposal from great to amazing. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 20, "ne": 10, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement being San Juan which is considered one the poorest areas in Argentina which has highest sunlight exposure but lacks good living conditions. In the proposal the proposer will be developing a Platform which allows investor to participate in the project by offering a GREEN token. This GREEN token represents watts of energy. By utilizing the local weather condition to produce electric energy which would help improve local living conditions and also helps to stop climate change. The proposal addresses the problem", "q0r": 5, "q1": "The proposer have provided a complete detailed plan each with timelines and also targets to achieve them within a time period. The proposer and their team based on details provided has required experience enough to implement the proposal successfully. Therefore it's very much possible this proposal will executed successfully  ", "q1r": 5, "q2": "The proposer has provided a detailed phases that they will be carrying out and each with a timeline this will be very helpful to track the progress and they have given a detailed budget breakdown required to carryout each of the phases hence the information given should be enough to audit the development and success of the proposal.", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 19, "ne": 3, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "The proposal is laudable aiming to solve the weather challenges in San Juan (Argentina) through the creation of a platform that will allow investors to participate in the project through GREEN network. The proposal mentioned that SanJuan has the longest sunshine hours and the best solar production, although there are already some solar farm in place, they are not available for small investors to participate via blockchain. Their aim is to setup a model called Cardano blockchain solar farm . The challenge is addressed effectively.", "q0r": 4, "q1": "The team is made up of 2 experts who have SPO (ADA ONE Pool), more than 20 years experience, telecommunication projects, both of them organized Cardano Summit 2021, and they have the capability to implement the project successfully. The plan mentioned 3 phases of work schedule for the project.", "q1r": 4, "q2": "The road map is 12 months timeline for the project and the budget breakdown is comprehensive for effective auditing .", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "I believe this proposal can answer the need of energy for the residents in Argentina LATAM. However, I would think that the proposal should spell out the responsibility of operating and maintaining the solar farm. ", "q0r": 4, "q1": "The proposal lays out their detailed plans of actions for the first phase and it also lists out the pointers for the second and third phases.  I have confidence that with the team members experience and expertise, the proposal can be implemented with success. However I failed to see their plan as to how to reach out the investors.\r\n", "q1r": 4, "q2": "I believe there should be also a measure of success as to the amount of investment gathered for to meet the budget of setting up a solar farm.  That I did not find it in the proposal. ", "q2r": 4, "assessor": "z_assessor_968", "no_vca": 26, "ne": 2, "ng": 12, "nfo": 12, "vca_o": 1}], "solution": "Criar uma plataforma que permita aos investidores participar do projeto através da ficha VERDE (representa X watts de energia) na Rede Cardano", "experience": "Especialista em TI, SPO, Telecomunicações, Energia Solar, Infra-estrutura, Engenharia e Sistemas de Gerenciamento de Redes."}