{"id": 384421, "author": "chrobilliard", "title": "Endorsing the marginalized", "url": "https://cardano.ideascale.com/a/dtd/384421-48088", "category": 26242, "amount": 37000, "description": "O sistema financeiro atual não sabe como confiar nos desamparados. Altas taxas de inadimplência, e nenhuma confiança em instituições legadas.", "funded": 1, "upvotes": 53195351, "downvotes": 9045041, "votes_result": 44150310, "votes_cast": 170, "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Como latino-americano, sou totalmente a favor desta proposta, pois ela procura resolver o problema de uma grande porcentagem da população da América Latina que está excluída dos serviços financeiros tradicionais devido à natureza de seus empregos. Só isto está totalmente alinhado com o espírito Cardano. Uma solução de nano/microcrédito já foi implementada da maneira tradicional. No processo de garantir fundos da dívida e melhorar a capacidade de empréstimo, eles planejam utilizar os benefícios da implementação do ISPO. Espera-se que os titulares da ADA sejam atraídos por seu modelo de negócios, oferecendo seu TOKEN nativo em Cardano. Em 12 meses, eles esperam ter 2000 portadores de ADA com mais de 100M de ADA apostados em suas Piscinas de Estaca. Sua população alvo são aquelas pessoas cujas características sócio-demográficas dificultam ou proíbem o acesso aos benefícios do sistema de financiamento tradicional. Entretanto, do ponto de vista da descentralização, sugiro à equipe que melhore as características da proposta. Por exemplo, descreva se na segunda / terceira fase do projeto, a equipe está considerando a implementação de um contrato inteligente para operar toda a solução proposta. Isto aumentaria o alinhamento com o que Catalisador e o ecossistema Cardano estão procurando.\r\n", "q0r": 5, "q1": "O fato de que o modelo de negócios já está no mercado há 8 meses e tem mostrado excelentes resultados nos dá alguma visão sobre as capacidades da equipe. Além disso, a adição de excelentes parceiros como MELD, VENT e ADABLUE lhes permitirá utilizar as características da Cardano para melhorar seus modelos de negócios. Com relação às habilidades e experiências, a equipe fornece tanto uma breve e apropriada descrição como links de referência para seus perfis. É apresentado um orçamento simples, quase inteiramente dedicado ao desenvolvimento. Seria ideal, entretanto, se eles também tivessem apresentado o custo de uma hora de desenvolvimento, o perfil que estão buscando e onde pretendem contratá-la (considerando o custo de uma hora de desenvolvimento varia muito dependendo do contexto no qual é contratada). A ausência de referências às pessoas ou contatos dos parceiros mencionados é também uma área a ser melhorada.\r\n", "q1r": 4, "q2": "Em vez de apresentar marcos de implementação, a equipe decidiu apresentar uma descrição dos produtos, a primeira após um mês e a segunda após seis meses. Do ponto de vista da auditabilidade, acho que a equipe deveria ter feito um esforço maior para descrever para a comunidade quais seriam as etapas ou atividades durante a implementação. No entanto, devo dar-lhes crédito, uma vez que eles forneceram uma excelente descrição das métricas de sucesso do projeto. Um total de oito métricas é apresentado, dividido em quatro períodos de tempo, sendo o primeiro no início do mês, e o último nos 12 meses seguintes.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 21, "ne": 12, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "This proposal is spot on aligned with the challenge. It does not only help grow the Cardano ecosystem in Latin America but even helps relieve human suffering. Every individual that doesn't have to go to greedy loan sharks is a success story. Perhaps the next step is to turn the loan sharks in to ADAentrepreneurs. :)\r\n\r\nAlready Grameen Bank proved that unbanked and underbanked communities are trustworthy and now this type of modern \"Collaborative Credit Scoring\" mechanisms help popularize that fact.\r\n\r\nI like the team's ready-for-collaboration thinking: \"We can even facilitate our credit scoring to other Cardano dApps who can benefit from our credit scores.\"", "q0r": 5, "q1": "A solid team with 10 members publicly listed in LinkedIn, a reasonable expansion roadmap and already existing product. What more can you ask? Well, you can ask partnerships. They have even those. A word or two from Ken Olling (MELD) would have helped legitimize the said partnership but I guess we'll just take your word for it. \r\n\r\nThe only open question remaining is this: What can the ISO/ISPO participants do with the native tokens? In the comments section the answer is \"Our token will be used by our users to get endorsed to get the loans in stablecoins / fiat\" but what will I do with the token if I'm nowhere near in Latam region? If you can answer that convincingly, I might just become one of those ISO/ISPO participants.\r\n\r\nLater the plan is to move the off-chain microloans on-chain but the team needs to come up with a sidechain or state channel solution to make sure the fees are kept to the minimum. They reveal in the comments an interesting detail: \"we are lending even bus tickets\".\r\n\r\nRegardless of these possible caveats, I am confident in the team to implement this initial plan and to find answers in the open questions.", "q1r": 4, "q2": "Although there's not much detail about the deliverables and KPIs, it's a fairly straightforward plan: employ one developer to set up the stakepools and another one to take care of the native token minting and distribution. The team hasn't budgeted anything for themselves. This tells me the company is already well-funded and functioning (running on 5% profit margin). Auditability comes from the fact that results speak for themselves. It is indeed the Cardano community who literally votes with their wallets whether or not to participate in Kashin's early steps.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 19, "ne": 6, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This would, if carried out properly, align perfectly with the goals of both this challenge and Cardano as a whole.  By providing opportunities for persons with need for small loans an opportunity to build credit where no useful/dependable/fair credit system exists, Cardano will be entering into a market in which it may very easily become a critical financial system while simultaneously improving the lives of members of the society.  Additionally the setup and operation of stake pools connected to this endeavor will increase decentralization of Cardano into Latin America.", "q0r": 5, "q1": "Based on the information provided by the proposers team, it appears that not only do they have considerable experience in financial management and app building but they are planning to integrate Cardano into an already-existing successful lending infrastructure, including an existing app already utilized by persons in multiple countries.  Based on information presented it appears highly likely that this will be a successful proposal.", "q1r": 5, "q2": "Progress and success are suggested to be audited by growth of connected pools and distribution of native tokens.  The numbers they intend to have on two stake pools within a year are respectable and if achieved should represent a considerable foothold in Latin America.  It seems that this would be easily verifiable and represents good potential for Cardano expansion.", "q2r": 5, "assessor": "z_assessor_708", "no_vca": 15, "ne": 4, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The problem raised by this proposal is clear and also related to the needs of the challenge, in the sense that its solution works to solve problems that would bring concrete solutions on a local scale and progressively on a wider scale in South America. Although the positive impacts for the Latin community are clearly stated, those concerning the Catalyst community are a little less explained, but it is possible to understand this implicitly, especially since the KPIs provide clear evidence of the overall contribution of this project. ", "q0r": 4, "q1": "The explanation at the beginning is an advantage and a confidence booster. The team members are clearly identifiable and supported by links on their linkedin profiles, as well as the accuracy of their mentors and partners. The budget is clear and combined with timing indicators, it seems reasonable. The timetable also seems realistic and clear. What is appreciable is that the technical aspects are addressed in an understandable way. The risks are not discussed, which could have been a benefit. ", "q1r": 5, "q2": "All the information given is clear. It is interesting to propose the KPIs in this way: \"Our project will be successful if\", which gives concrete indications so that the community can attest the success of the proposal. The website is provided and allows for more explanation. This project could benefit from offering more ways for the Catalyst community to follow its progress, which could perhaps help them in their desire to launch their project in Cardano.", "q2r": 4, "assessor": "z_assessor_739", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Estamos dando empréstimos à economia informal; nossa pontuação de crédito colaborativo é melhor na avaliação de risco e nossa taxa de inadimplência é 2x menor.", "experience": "Nossa equipe de liderança tem forte experiência nos setores financeiro e de mobilidade, tendo liderado empresas globais no mercado da América Latina."}