{"id": 384439, "author": "jrv97", "title": "Networking/Education LATAM", "url": "https://cardano.ideascale.com/a/dtd/384439-48088", "category": 26242, "amount": 53000, "description": "O conhecimento dos projetos e visão de Cardano é baixo na América do Sul como um todo, mas quase inexistente entre os investidores no Paraguai e Equador", "funded": 2, "upvotes": 66385528, "downvotes": 12113193, "votes_result": 54272335, "votes_cast": 182, "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a very complete proposal, although I have to say that it could have been better organized. It appears that the team has chosen to focus on investors (and from what I understand, traditional investors), but an emphasis is placed on universities' student population. We propose two main solutions: holding periodic events where there will be networking (among other activities), and developing a curriculum that will then be recorded with a professor and made available on platforms such as Coursera. It is related to this challenge since it is targeting Latin Americans, and its metrics are aligned with what this challenge seeks, for example, \"Number of student proposals submitted\".\r\n", "q0r": 4, "q1": "The team is composed of 3 members and a mentor. While their skills and experiences are described, no references are presented to verify them. However, one of the advisors is listed as Humberto Baquerizo, who is President and CEO of MentorU. This, in my opinion, compensates a bit for the previous flaw. A monthly budget is presented with an appropriate breakdown that basically includes the necessary items for the execution of an event, however, I find a discrepancy between this and the description of the activities. Since events will begin in the third month, why are they requesting a budget as if they are going to perform 12 events? As a positive element I have to recognize that there is a very good description of the program.\r\n", "q1r": 3, "q2": "The team provides a good description of milestones organized into three, six, and twelve-month timelines, including a brief description of success metrics. In this case, I recommend that the team independently wins or does not focus on developing success metrics. As an example, instead of stating \"Planned out events with partnered universities...\", I recommend stating \"Performed XX events for which we have XX follow up contacts in order to have them participate in future seminars.\"\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 21, "ne": 8, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The proposer directly works to address the challenge questions by providing keynote speakers for university students in Ecuador and Paraguay. This proposal will not only bring in new students into the cardano ecosystem, but it will also encourage students to develop their own proposals that will benefit the entire community. The curriculum plan is very strong and will provide students with the necessary background knowledge to enter the cardano catalyst community. As the proposers mentioned, teaching the young adults in these latin american countries will result in a chain reaction that will bring in more and more new individuals with their own ideas for how we can improve the cardano ecosystem. Another aspect of the program is its lasting impact because the lessons will be posted online for all to view. Thus, the project's impact will last beyond just the scope of the courses taught in person. I believe that programs such as these will be critical in the continued expansion of cardano into new countries. (score given: 5)", "q0r": 5, "q1": "The proposers have the necessary background knowledge to successfully implement this proposal. Combined, they have many important skills, such as previous fund alumni, education professional, etc. \r\n\r\nThe proposers also provided a very detailed plan for how they will go about bringing this program to life in Ecuador and Paraguay. They have a roadmap that lays out the exact actions and milestones they hope to reach. Their budget seems perfectly reasonable given the scope of the project and work that will need to be put in. One question I do have is with regards to the student projects and continued funding. If I understand it correctly, the funding from this proposal will be staked and the dividends will be used to fund the students' proposals. If this is the case, I would encourage the proposers to potentially elaborate more on this system or reword it so that it is clearer to voters because it took me a while to understand what it meant. Otherwise, I think that the plan is very strong. (score given: 5)", "q1r": 5, "q2": "The proposers have provided sufficient information to audit the progress and success of the project. Not only did they have a detailed roadmap, but they also listed some key performance indicators that the cardano community can use to ensure that the proposers have achieved their intended goals. The number of students enrolled is an especially important metric because it can directly correlate to potential impact in latin america -- more students enrolled means more potential people to create impactful proposals that will help the community. However, I would recommend that the proposers also include the number of successful/impactful student proposals in their reports to the community because these are key parts of the challenge. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 20, "ne": 9, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Increase Cardano awareness and visibility to investors in Paraguay and Ecuador. I completely agree that this proposal effectively addresses the challenge facing the developer ecosystem.\r\nHeld at each university, this class will cover all the basics of Crypto. I certainly think that the given solution can accomplish the stated goals.", "q0r": 4, "q1": "Looking at the presentation of the proposal, I believe the team has put a lot of effort into raising awareness among South Americans about Cardano. All plans are presented clearly and in detail, in addition, the team that successfully raised capital at Fund 5 makes me more confident in my ability. There is no doubt that this high profile will succeed\r\nThe proposal team consists of 4 people, however, the proponent only lists past qualifications and experience but fails to create a link to a public profile where these credentials can be checked. More complete information will make the proposal more evaluated for feasibility", "q1r": 4, "q2": "The proposal has a clear roadmap and timeline, provides transparent objectives, and provides sufficient means for successful project evaluation.\r\nThe stated budget is reasonable enough to be listed in great detail showing the honesty of the proponent. KPIs and funds are transparent, and schedules for delivered products are a great way to track project progress.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is a clear and direct match for the challenge. It is inspiring to see the cross-continent collaboration and use of programming that has worked in one place be initiated in another. The relationship building among students will begin to develop the next generation of blockchain technology community members and help these young people to learn about Cardano in a fulfilling and rewarding way. This is an accessible and viable opportunity for students to be enrolled in a long-term learning environment where they they take part in the very core opportunities that this technology provides: governance, financial well being, responsibility to others and to community, entrepreneurship, and decentralized decision making. There is also a clear plan for growing the educational opportunities to a broader audience with a map for making the rollout sustainable. Merging current enthusiasts with future enthusiasts will also ignite inspiration in both groups as they come together to learn, share and grow. ", "q0r": 5, "q1": "One of the best precursors for success is previous success. Kudos to the proposing team for taking and implementing something that has already proven to work in Ethiopia. The proposers have a strong set of experience that meets the criteria for this kind of an effort, and relationships with the key people who would be able to forward the execution of the courses. The proposal paints a vision of equipping these students with learning that is relevant and current, while also developing within these students a sense of the long-term opportunities they might look forward to in the future. The proposer's timeline is realistic, is attached to budget so funding can be anticipated, and is numbers driven and measurable. The proposer also lists the key tools and resources that will be utilized (personnel with specific traits, Coursera technology, etc.) It is also strong to see the proposed budget include further funds for translation to other languages. ", "q1r": 5, "q2": "This is a particularly auditable proposal, and includes thorough expectations for course content and completion, for student enrollment and involvement, for location targeting, for timing and for 12 months of execution. It shows a clear understanding of the problem and challenge criteria, and directly addresses how it will solve it. It also draws on prior experience to build on what's working, and can deliver on its metrics easily through simple evaluation of the program's numbers. I would hope that the program also strives to share the anecdotal evidence of its success by chronicling some of the special, personal outcomes students experience so that they can be expanded upon as well. It might be nice to have these stories shared at the Catalyst group level. One last idea - it would be great to have a method to invite and involve these students in the Catalyst groups moving forward and to have them present on their own experience. Would love to hear that firsthand :) Good luck!", "q2r": 5, "assessor": "z_assessor_856", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Eventos de Rede Universitária/Programas Educacionais de Blockchain/ Estágios em Blockchain em Assunção, Paraguai/Cuenca, Equador.", "experience": "Conexões BoE no Paraguai. Comercializador digital. Gerente de projetos, OSI. CEO Mento U. Especialista em Educação NJMS. Comissário Hispânico-Newark."}