{"id": 396649, "author": "dkkm10", "title": "Proof of Article (BIG ASK)", "url": "https://cardano.ideascale.com/a/dtd/396649-48088", "category": 26435, "amount": 200000, "description": "Currently Cardano does not have a strong foundation to make any change in any country as the freedom of speech does not exist universally.", "f6_no_assessments": 8, "f6_rating": 2.7083333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal makes the case that increasing freedom of speech increases confidence in government, which would allow more development of dApps for nation building. Whether or not that pans out, it is several steps away from building dApps for national registries. \n\nthe proposal is to design and implement a new consensus mechanism for Cardano. This is much more than a dApp, which runs because of the underlying consensus model. \n\nThis is a rather esoteric proposal. The authors try to shoehorn the idea into this challenge, but it's not real convincing.", "q0r": 3, "q1": "There is no bio information for the team. The proposal mentions 25 team members, but only one name is given, and no links to their bio. This project calls for professionals in several field besides journalism. It needs computer scientists, social scientists, computer engineers and marketing specialists. The proposal is asking for a lot of money, presumably to hire these folks. Perhaps this is a catch-22 where the project needs the money to hire the team and needs the team to justify the money, but I don't think so. A project of this size should have a few people who will put their names on it before asking for such a large amount of money.", "q1r": 2, "q2": "Major milestones have been listed on the way to the end goal - three years from now. This is probably not realistic as we can expect a lot of things to change in that time \n\nThe first big hurdle is hiring the team and there are no auditable tasks listed for that. \n\nThe audit-ability section reads more like aspirations than measurable steps. ", "q2r": 3, "assessor": "z_assessor_1336", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This is a vast and ambitious proposal to build and protect free speech based on blockchain technology. Journalists can speak out publicly about pressing issues anonymously and still receive commensurate compensation for their efforts. Readers can access information transparently, verify its credibility and benefit from advertising costs. Transparent, decentralized communication channels will prevent corrupt governments and fraudulent businesses from counterfeiting, interception, or manipulating news. This model sounds promising at first glance and could change how information is created, provided, accessed, verified, and consumed, not just limited to developing countries. Therefore, it fits the criteria of the proposed challenge.\n\nHowever, the proposal focuses more on explaining the economic interests of journalists and audiences and less on the core issue: protecting freedom of expression and transparency of information. In addition, relevant technical and legal issues, relationships, and potential conflicts of interest among journalists, readers, and moderators need to be considered and explained more carefully.\n\nBased on the information provided, I give it a score of 3.", "q0r": 3, "q1": "Technically, Proof of Articles that build on layer 2 is a theoretically viable way of validation. However, how to balance the parties' interests while ensuring security, stability, and scalability? The community needs to know more about how it works and the motivation to hold this token.\n\nEconomically, regardless of future hires, the $200,000 budget seems insufficient for the current 25 people over a 3-year timeline. Thus, the proposer should state an ISO plan with more specific tokenomics to forecast the proceeds and use this resource.\n\nThey are a team of 25 experienced people but don't provide any links or references. Their website has not been professionally designed and has historically low traffic. Roadmap only shows what is being done but not how, especially technology still vague.\n\nBesides that, there are a few points that need to be clarified:\nWhy can journalists post anonymously, but readers have to register to vote and comment? Solutions to IP problems (faking, authentication, management, security)?\nWhy should the SPO have permission to edit articles? Benefits and risks?\nWhat are legal issues related to advertisers (e.g., the possibility of tax deductions for advertising costs)?\nWhat are the advantages of using a layered token system rather than a single token?\nWhat are solutions in case of conflict of interest? For example, the journalist mentioned that a factory pollutes the environment, yet it provides jobs for many local people. Since this model suggests that only locals are allowed to vote, what if they go against the article for their benefit, even if it's true?\n\nTherefore, I rate feasibility with a score of 2.", "q1r": 2, "q2": "The team outlined a roadmap and budget breakdown with auditable milestones. However, I suggest a more transparent and more detailed explanation. For example, the plan for 1st six months is to \"find technology already built on ADA and implement it into the project.\" So what is the expected technology here? Please name a few as they already exist.\n\nAs mentioned above, there are still many questions the team needs to answer to provide the community with more insight. That helps to improve the clarity of the proposal. In summary, I give a score of 3.\n\n", "q2r": 3, "assessor": "z_assessor_1459", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "I know that Cardano in recent years is developing very strongly. but it can be said that it is not very popular yet. There are still many people who do not know or understand about Cardano, in this project the team has the idea to create a solid foundation for Cardano so that it has the power to change any country. I think this idea is very good, I saw in the group project that issues like Cardano not having a solid foundation, slanderous lies about blockchain technology spread in the media, not yet. When I say there are a lot of countries that don't accept cryptocurrencies, I find the problems very well defined. The problems are also well suited to the challenge. I found these to have answered most of the questions in the challenge. I think this is a great proposal that needs to be scaled up to address future challenges. In the description of the group solution, there are not many solutions to solve this problem. And I found the problem raised by the group did not completely solve the problem that the challenge posed. In the section on group risks, three main risks are also mentioned, but no plan to deal with those risks has been given. I would like to export more because many countries in the world have not yet agreed to use cryptocurrencies on the project, and there are still many disadvantages. My solution is to promote cryptocurrency strongly and then put it into wide practical applications so that everyone can see the benefits of cryptocurrency.", "q0r": 3, "q1": "in the progress presentation of the project. The team has identified a very specific milestone, which is to be completed in three years, has clear goals to aim for. I think with this timeline is reasonable to complete the tasks set out. but I find the progress of the project is not easily tracked and checked by the community. I hope the team will have a link for the community to easily follow the project. on the budget presentation with almost 30% of the total budget challenging and broken down. I find the distributions to be very reasonable. I would like to add more because the project has been implemented for a very long time, so it is necessary to leave a certain amount of estimated budget in case additional budget is needed or there is a specific plan to supplement, in the information section. information about team members. I see that the group has raised a lot of members and has assigned specific tasks to each person. However, the experience and certification of the members have not been given and the member's identity has not been verified, and no documents have been attached. I hope the group will add more", "q1r": 4, "q2": "In the description measure the progress and development of the project. I see the group has listed 3 main indicators. Indicators have also been clearly defined that will be completed within 3 years and specific targets to be achieved have been set out. However, the indicators are not easily tracked and checked by the community. The success of the project has also been stated that is. will allow anyone in any country to be rewarded by blockchain technology for providing useful information through the news media. I see success in relation to the challenges of the campaign. This is a new project that has not yet been approved and funded. However, I think the project is quite good, I hope it will be approved in the near future.", "q2r": 3, "assessor": "z_assessor_1486", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This proposal wants to implement a proof of article on the Cardano Blockchain, meaning that one can submit an article on the blockchain and based on votes from other users, it will be allowed to create a block and thus be compensated. \nWhile this proposal criticises blockchain technology, stating that while it does have some form of logic “No cryptocurrency has sought to redefine the way in which we come to logical conclusions” it also creates a very strict set of rules regarding this “proof of article” that go against the mindset behind cryptocurrency and democracy: The voting is limited to someone’s geographical location, meaning that it goes against two concepts: 1. (partially) revealing one’s identity and 2. limiting his ability to vote, not based on his knowledge but just as legacy systems do today, based on his physical location on a certain spot on this planet, creating thus an artificial division. For example, can someone from the UK not be much more informed on the political situation in the US than a US citizen? Why should that person then be restricted from voting on an article?\nThen the author goes on to describe how articles will be rewarded and how much permission they’ll have to be submitted to the blockchain. This is a metric based on popularity and gives an example between a sports article that will have more views than a gardening article and as such “the sports story is more valuable” and will not have “a temporary window to add to the block-chain before it falls out of favor with the audience” like the gardening one might have.\nThis is a rule that limits a journalist’s/person’s ability to upload information on the blockchain, based only on the fact that it’s not very popular. Let’s say, there is some atrocity happening in a remote corner of the world, but because it is much less popular than (as the author gave in his example) a sports story, then that person will have only a limited time to submit a second article regarding that story, just because it did not have enough time to propagate and not enough people have had the chance to read about it. Does that mean that the story about the atrocity is less valuable than the sports story? Isn’t this solution more like censorship, based on likes ?\nThe author also describes other set of rules for journalists, and in one of them he’s stating that if a journalist is sued for one of his articles, his tokens will be locked until the injunction is over. How could this be accepted? If this can happen on the blockchain with someone’s tokens, what’s the difference between banks in a dictatorial regime and this “proof of article” system if your money can be locked if you write something that displeases someone?\nAs a conclusion, I find the proposal does not offer a viable solution compatible to the challenge brief.", "q0r": 1, "q1": "The detailed plan offers sufficient information to visualise the steps needed to implement the proposal.\nThe budget is broken down in 2 main categories “80% research and development (160,000 ADA)” and then each section has a percentage linked to it from the entire amount. However, there are no further explanations offered on why those numbers, especially since they are expressed as percentages are needed, and as such I cannot assess the proposal budget for feasibility.\nThe team is very loosely described as skills needed, they will probably all be hired after the proposal is funded, we have no one on the team who can be verified as having some kind of prior experience that would prove his ability to implement this proposal.\nAs such, there is too much information lacking and I cannot assess its successful implementation.", "q1r": 2, "q2": "The project progress is well described, with milestones defined and easy to follow. What would have been another important factor is a description of how those steps can be independently assessed by the community.\nAs for the question regarding success, the community needs to also have some metrics, not just a statement “The ability for anyone in any country to be rewarded by blockchain technology for providing useful information through news media” by which to verify if the proposal has had positive outcomes, ex.: number of articles published, number of views per article, number of views for all articles, number of journalists willing to participate etc.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "To begin, without expressing opinion on the idea itself, the stated objective seems unattainable for Catalyst, hence will not be impactful.\n\n\"Keep everything the same about PoS on ADA as it is, but change this one thing. If say for example the article has a 70% approval rating after x votes, then it has a .7/(Total Articles Eligible) chance of adding to the blockchain (category dependent). As a result, the journalist would be eligible to generate a block and receive a reward.\"\n\nSorry the mechanism of changing the Cardano Protocol belongs as a CIP, not a catalyst proposal.\n", "q0r": 1, "q1": "For almost the same reasons, this proposal requires changes to the SPO function, and as a Catalyst proposal it is not feasible to expect that to happen. This idea (whether with merit or not) must be advanced or proposed to the community via other avenues.", "q1r": 1, "q2": "To be successful the idea requires changes to the Cardano protocol and functionality of the Stake Pool Operators. There is no indication in the proposal how that would be accomplished. The timeline for implementation (6 months) addresses development of technology, but does not address a change to the Cardano Protocol or SPO functionality.", "q2r": 1, "assessor": "z_assessor_251", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal aims to create a proof of article system that rewards journalists all over the world based on their merit. Despite providing long texts about the potential impact, the scope of the proposal is far to wide. It is not clear how \"poorer\" nations would directly benefit from the proposal. The authors try to create a new kind of consensus mechanism that creates blocks of their own currency based on merit, somehow connect it to DJED, make journalism more free and fight against crypto FUD. All in all it doesn't sound substantial.", "q0r": 2, "q1": "Overall the feasability of this proposal is very low. It is not clear who belongs to their team. They state they have over 20 journalists in their team but a) don't provide any personal information b) even on their website it is not clear what kind of entity is behind it c) for a network of journalists there are way too many mistakes in the proposal. All in all, one should be highly sceptical, especially because they demand over 200k without any credentials.", "q1r": 1, "q2": "Although the team proposes 3 and 6 month goals, they don't seem realistic. They want to research a tokenomics system and implement it in the 3 month afterwards. Somehow it should be based upon L2 ZK, which is not further explained. Furthermore it is not clear how they plan to create a network of journalists that is willing to participate in this global experiment. All in all too many questions unanswered.", "q2r": 1, "assessor": "z_assessor_380", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "\"This is an unusual idea in journalism about content management that promotes true information from across the community of journalists in many countries. Although I cannot fully imagine how this idea will work when it comes to reality, but as we can see if there is a newspaper that people do not have to worry too much because their interests are affected when telling the truth. then that's great. Because at that time the press was doing its right.\nThis proposal needs to be more detailed about expenses up to $800k as this is not a small grant, to see the team working responsibly with this amount.\nIn addition, if possible, you should make the identities of the group members public.\nAnd if possible, this idea can be combined with a team of programmers to create a separate token for the newspaper, and as an internal currency to pay content creators.\"", "q0r": 5, "q1": "\"This is an encouraging idea; However, I see in the brief plan that you plan too long (3 years) but there are no details in each of those years what you will do. This is quite unreasonable, hope you will add more details if you continue to apply for funds in the next funds.\nIn addition, the plan to allocate money is not reasonable when 70% of the money is for research, but only 10% for salary in 3 years. So the financial plan is not okay.\nYou should break down, detail the work plan and apply for each part, and should give a fair amount to the content creators because that is the essential part of a newspaper.\"", "q1r": 5, "q2": "\"With this idea, if it is further improved, it is not too difficult to check the progress of the newspaper's content development. However, it is still suggested that the presentation team should shorten the main content, bullet points instead of explaining too long.\nIn particular, the team needs more detail on how to approach the team's work results. And you should improve the detailed technical part, the daily work plan as well as the money allocation if sponsored, to help the community see the responsibility and be ready to vote for this idea.\"", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "Proof of article is proposing to provide a platform where new articles are published and rated based on the votes they received. Ideally the votes received will reflect the authenticity and verfication of the content therefore becoming a self verfied system. The rewards will be distributed to the authers/publishers SPO/ readers for veficiation. \nThis proposal has received a mention from CH and can provide a liberating tool against global media which dictates the narrative. Also can help become a factual base information stream. \nThe impact for such a project is global and would help people of minority and people searching for true news publishers. I would imaging if it is based over the cardano network the impact on the cardano comminuty in terms of utlity is great as well. ", "q0r": 4, "q1": "The description of the proposal in detail has helpful to understand the magnitude of this project. As it requires a heaving prgramming side as well as journalistic knowledge. \nThe teammembers of this project are composed mainly of journalistic background and programming. In addition the group recommends to involve the end users with the fact checking and publishing in the future by creating an ecosystem. \nFinally they will involve IOHK for oversight and help drive the integration onto the ADA ecosystem and blockchain. \nThe timeline / roadmap of the project is details in several steps. Since this is a new venture and no work was built yet there is a phase of research and testing mentioned. \nAlso the funding is very well analyzed and has a contingency of 5% which will be helpful as this research project may face some uncertainties or revise their objectives as the project matures more. \nFinally they offer a token in the future and listed their tokenomics to further fund and grow the project.", "q1r": 4, "q2": "This project is starting from the ground up and the team emphasizes on the research part the first 6 month. Within their plan they commit to provide detailed updates and follow the roadmap they have placed. Within the next 6 months willbe a time where the auditing can be acheived to see some of the final product in action. \nOverall this is a long term project and will only launch after 2-3 years of building, therefore if an audit is needed we should take note of that and request to participate while the research/building phase is ongoing. \nThe team has offered to place 1 IOHK member for oversight which is a great commitment. ", "q2r": 4, "assessor": "z_assessor_785", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Change can only come with the free expression of ideas. in order to promote this, we must change the way in which \"Logic\" is interpreted.", "experience": "Team of 25 with 50+ years of experience in journalism/editing/media.\n\n2 Team members with extensive experience in ADA\n\n1 Front end developer\n\n2 Marketing experts."}