{"id": 397645, "author": "mrnicksmith", "title": "Dapp: Water Quality Platform", "url": "https://cardano.ideascale.com/a/dtd/397645-48088", "category": 26435, "amount": 115000, "description": "People don’t know that their water is contaminated until it is too late.\nCentralized authorities can’t be relied upon to provide this data.", "f6_no_assessments": 19, "f6_rating": 4.3157894736842115, "videos": [], "media": [], "f6_assessments": [{"id": 4104, "q0": "Your proposed solution, CLEAN, is not clarified enough other than the purpose to implement decentralization in water testing. Specifically, in the very first small task of the Impact segment, the description of the proposed solution lacks a host of key factors to determine its efficiency such as features and functionality of the CLEAN Stake Pool, technical components of it, and main operation, and so forth. More importantly, I did not see any subjects mentioned in the proposal, which is essential to the impact of the proposal. I see that these missing factors are listed in the description as to how to address the challenge, including problematic situations, vision, project activities. Therefore, perhaps reorganization in the more proper segments is welcome. Maybe readers can be perplexed whether CLEAN is aiming at who other than what, the word “people” needs to be exactly narrowed down regionally or else to provide a specific vision. As for the key metrics, you could clearly figure out which key metrics are aligned with which KPI/ key metrics of the challenge. Despite this, you include some use cases as cooperation with other platforms, which is quite obvious for readers to visualize the outcomes. However, it is encouraged to dissect the final results after finishing off the project. Concerning the foreseen challenges or risks, they are well-prepared with potential solutions and impacts on Cardano ecosystem are mentioned, but a little more information on it will have more influence on readers.", "q0r": 3, "q1": "It is impressive to attach a link of detailed project plan in this section, the plan is well-prepared despite being a draft version, but it can offer readers an overview of your plan by showing duration, individual tasks and due dates. About the roadmap, personally, I think it is quite well-structured and proper, there are timeframes that describe tasks which need to be done, yet at least some interpretation or explanation of these headlines can be added to elucidate each task. Hence, the community, especially the non-expert, can catch up with what you are trying to deliver. About the budget, each headline is presented clearly with estimated expense, but as for me, I believe that if you could attach an estimated budget to smaller task, it can help build your proposal stronger (not necessary to write the exact number). About providing details of your team members required, you did well in this segment, full information of each member, including portfolio, linkedin, etc., giving rise to your proposal feasibility and credibility as what these high-profile people, who specialize in medical health, can massively contribute to it is highly prospective.", "q1r": 3, "q2": "Firstly, there are a number of measurements to monitor the proposal progress. These units can be regarded as milestones to know which phase the progress is at, so they need to be inextricably linked to the roadmap mentioned above. It means that listing a number of measurements is not enough to determine if the proposal can be done progressively or not. For example, in the line “Number of water quality published: Our goal is to record 2000 test results to the blockchain”, what if this goal either could not be achieved, let’s say, under 2000 samples after several months, can this be counted as a success – meeting the demand of the route? Therefore, your proposal will prove auditability if these key metrics comply with the roadmap, adding predicted timeframes to key metrics as indicators of progress accomplishment is extremely constructive. What’s more, it would be great if you can estimate the number of participants (enough as you may think to have influence on media and the public), so you can keep your plan under control as expected. Concerning how the success for this project looks, it is not obvious enough to meet readers’ demands. For example, can these outcomes be the criteria to assess the final successes you gain or not? These “growing” results can be more solid if you can supplement them with clear definitions, interpretation or at least overview. Or are they parts of the whole picture or just it? Hence, from my point, these results can be more persuasive, obvious and influential to others. More importantly, you seem to miss a significant segment of Auditability – information provision on references or previous information of this project. It is worth noting that there are not any counterparts to make a comparison, all of which is to give rise to the credibility and chance of funding or success if funded. If this is the first one ever, it is encouraged to jot a few meaningful lines in this segment, showing your unique innovative idea.", "q2r": 2, "assessor": "z_assessor_1704", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2525, "q0": "The proposal is very interesting in identifying the inherent manipulated problems of the centralized system of water quality of authorities in developing countries, has a unique solution to solve problems in distribution the water quality testing and reporting process, aligned with the outlined challenge settings.\n\nIt uses ADA and Cardano native tokens to attract user, so will add value to the Cardano ecosystem and able to scale up to future challenges.\n\nThe proposal described clearly all technical aspects, so I have not many things to concern. I just suggest to provide a scheme to describe all work flows to make more clear about the technology process of solution.\n\nThe proposer has mentioned many risks and how to deal with, this will increase the impactful for the community.\n\nSo I think this proposal has feasibility and deployed successfully if it's controlled in right way.", "q0r": 4, "q1": "In my opinion, the proposer describes the resources necessary to implement the proposal except the experience gaps Atala Prism Developer and  Plutus needed to be filled. I can easily identify their capacity by provided references on Linkedin.\nThe roadmap of this proposal is clear and specific identified, easy to track and follow the progress by the website for the community. But the proposal offers an unrealistic timetable to complete the work because there are so many works to do. It will enhance the feasibility if the proposer considers to prolong to at least 6 months for preventing the risk in recruiting developers.\n\nThe budget is outlined clearly and broken down into identifiable items for auditing but some items is still overall to justify they are reasonable or not to achieve the set goals, such as: Web app development, Smartphone app development, Plutus smart contract development,... I suggest to improve it by calculating engineer working hours. And it's missing a futher scaling plan so I don't know if additional funding is required to implement the proposal after 3 month.\nAbout the technical aspects, I concern how to input testing results from Kit tests into application, manually or automatically. I hope the proposer think about choosing the technology for helping accurary and trusted result of testing and data collecting from smartphone such as: electronic ID Kit test with replacable sensor probes which connected to smartphone directly by wire or indirectly by wireless (could be bluetooth) methods. So it will help to eliminate error or fraud in data inputting, enhancing the confidence for the community.\n\nAbout the community building, I look forward to seeing a marketing plan to outreach to government agencies, universities and organizations in detail about: what advertising campaign, what communication methods, frequency, budget for each promotion periods and so on.\n\nIn general, I neither agree nor disagree the feasibility of this proposal.", "q1r": 3, "q2": "KPIs of the proposal are identified, easily measured and tracked within the first 3 months after it's funded. It needs a KPI in improving water quality or increasing recycling and safe reuse globally as SDG subgoals 6.3, I think this is a good goal and cost of the problem that this proposal needs to achieve.\nAbout the communication strategy with the community, besides the website for updating the progress of the project, I suggest establishing a channel on Twitter or Telegram for connecting and exchanging information any time the community needed. \nIn anyway, I suppose this proposal still has auditability for the community.", "q2r": 4, "assessor": "z_assessor_1518", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 3558, "q0": "The proposal addresses the limitations of the existing systems of clean water data testing and data management of which are deemed inadequate to inform communities of water contamination in a reasonable time as such to prevent health hazards.  A decentralized platform dapp (named CLEAN) for water quality testing and reporting is proposed which will reward participants (via ADA) and empower communities to monitor their water quality, store and disseminate the water quality data via Cardano blockchain. \nThe assessor views this as an excellent idea as a readily available database of water quality, collected by communities, will go a long way into improving living standards. Water quality data is often not available easily, either due to scarce presence of testing in a given area or difficulty is accessing water quality records. Communities will not only benefit in regards to health from the easy availability of such data. Water quality data can also assist and increase productivity for economic activities such as farming and animal husbandry which are highly reliant on water.\nThe proposers have provided an informative list of project activities. The list clearly describes processes from initial procurement of equipment and recruitment of testers, to development of the dapp and method of data validation, establishment of a DAO and minting of Cardano native tokens to reward participation in the program. It is very encouraging that the proposers  are also collaborating with another developer (Orcfax) that is focusing on delivering real word data for use by smart contracts. The collaboration between developers can expand functionality of both CLEAN and Orcfax. It is interesting that the proposers also mentioned that the water quality data system can also assist valuation of property which can be a service that can be monetized and possibly support the further scaling up of the system. \nThe challenges described by the proposers are valid. Indeed there may be parties that may see the information provided by CLEAN to be a threat to their interests. Creating a strong community that benefits from the system can be an answer. The initiative could also be helped by approaching key persons in the government or NGOs that can be sympathetic to the program. The challenge of validating the collected data is also true. The proposers seem to have a solution to this which is enhanced by the collaboration with Orcfax. The third challenge stated is the financing of tests. While ADA rewards can be a good incentive, perhaps the CLEAN program could also provide special services that are payable in addition to the freely available water quality data to support the scale up and maintenance of the program. \n", "q0r": 5, "q1": "The proposers have provided a detailed timeline of activities which can also be viewed visually via Gant chart. The proposed activities are reasonable. However, the timeline for the initial phase (purchasing water testing kits, contracting labs, community building, etc) might be too short to achieve good results, unless the activities have already partially been started. The assessors would also advise that community outreach also involve an initial approach to the government as the second phase will involve access to government data. \nThe budget is broken down into three components : \n-\tSoftware development\n-\tAdministration, Management, Community Building\n-\tMaterials, Equipment, Fees, and Expenses\nThe budgets for software development and administration, management, community building are based on estimated work hours and cost per work hour. While a list of activities for each component is provided, the cost of each activity is not described. It would be better if it were. Also, the proposers should clarify which team member is responsible for each component and activity. \nThe proposers currently focus on water test kits for lead and pesticide content. Presence of harmful biologicals such as E. Coli within the water supply should be an important part of water quality testing. Why did the proposers not include this?   \nThe team members themselves have credible backgrounds capable of executing the plan to a degree. However, at the moment there are still open positions in the team for an Atala Prism Developer and Plutus Developer. Nevertheless, the assessor views that timely recruitment of the required members is possible. \n", "q1r": 4, "q2": "The proposers have specified quantifiable metrics for assessing the progress of CLEAN. This includes the number of monitoring participants, quantity of samples collected, number of tests published on the blockchain, number of queries, and the size of the contaminant database. \nIn regards to the number of participants, while the total proposed numbers are reasonable, the proposed demography of the participants is interesting. Why did the proposer choose students, faith based organizations and non-profit organisations to be members? And why were the groups divided evenly? The assessor asks this because the above sections of the proposal did not mention this. \nThe vision for the success of CLEAN involves the presence of a working dapp, growing number of users and communities participating, and growing number of partnerships. How many users? And at what rate of growth?  It would be better if the proposer provided these numbers. \n", "q2r": 4, "assessor": "z_assessor_1662", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 7308, "q0": "The idea is very good, it has some positive aspects and others not so much. Simply put, the proposal is based on making testing the purity of water (whether it is contaminated or suitable for use) accessible to everyone. People could test the water, through, as the author of the proposal puts it, “providing low-cost field test equipment and building a network of third-party labs.” They would build a Dapp, where this information would be stored on the Cardano blockchain. On top of that, whoever did these surveys/analyses would receive tokens as a reward. The author also states that in the future this project may become a DAO. In other words, only advantages for the Cardano ecosystem, countless positive points. However, what worries me is whether this proposal aligns exactly with the objectives of the challenge in which it was launched, since at no time is it emphasized how developing countries and the most disadvantaged populations would be targeted. Even to exemplify how the situation of water quality testing is precarious, the author cites the United States. Shouldn't they aim to promote good among the most needy? This challenge seeks to strengthen nations through improvements in “basic” sectors, such as health, education, security, identity, etc. Health would be the case here, something of course fundamental. But I believe that if the author gave examples of how economically disadvantaged communities would benefit from this, the objectives of the challenge would be better achieved. How could a person who doesn't even know what blockchain, Cardano, tokens, etc. be part of the project? Would this app be fully accessible to all audiences? That's why I'll give it 3 stars, I think the idea is very good, but it lacked focus on what we're really looking for in this challenge. Perhaps this project could better fit the Dapps challenge, for example. \n", "q0r": 3, "q1": "There is a roadmap here that is divided based on months (30 days - first month, 60 days - second month and 90 days - third month). In these time periods, which activities would be developed are listed. It is a satisfactory way of understanding the process, but it is not exactly complete. We do not know, for example, how long each of these activities would last or who would work on them. Some parts are very well explained, such as the user registration. You can fully understand what things would result in that record and how people would use Dapp. The author also describes what would happen in the future on the part of future deliveries, it would be interesting to have a perspective of how long such things would take to happen (nothing exact, because I find it complicated to be so inflexible, but at least a projection of when the project would unfold). I think here would be a good space to explain how people who have never had contact with the cryptographic world would get to know, understand and use this Dapp. How could these people understand how digital wallets work in the first place? Anyway, the script is present, but it could be more detailed and include more explanations, such as the less educated public's adherence to cryptography. Regarding the budget, 115k are requested. A very high value! So I would like more detail as well. 45k for software development, the author even explains what would be done within this general block of activity, but I would like to know, for example, which professionals would be involved here, what would be the salary of each, how many hours of work they would have in total and how that time would be distributed. Likewise with the other part of the money, the 36k that would go towards various things, for example marketing. What would the strategy be adopted here? About the kits, how much would each cost? How would users go about accessing them? What about the reward token, how much would it be worth? Would it be enough to encourage people to do such an activity? Although there are details about the use of the money, even more would be necessary for us to have security in its use, since it is a very high amount. Regarding the team, there would be a total of 4 people, two of whom are already known: in this case, their presentations are very good, we know their names, roles and a little of what they have done so far, we also have linkedin profiles to prove the information said. However, the other two vacancies: it would be better if we already had selected professionals, since the investment here would be high, it would convey more security. Overall the feasibility is good, it would just need more detail to look great. \n", "q1r": 4, "q2": "All data presented as process auditability are in relation to numbers. That is, how many monitored water collections, how much data uploaded to the blockchain, how many volunteers, etc. This works for us to understand how big the project is becoming, but I don't think it's enough for us to measure the human impact of the thing. It would be interesting to promote research in the selected areas in order to understand: did this project have a positive impact on the communities? Have people's lives been changed for the good? Did the volunteers receive fair rewards for their work? Did it help needy communities to support themselves better, live healthier? What happens when the analyzed water is unfit for consumption? Is there any kind of water treatment? I believe that the project team itself should promote these more qualitative analyzes and bring the results in a simple and direct way to the Cardano community. This can be done by preparing some reports, containing infographics, etc. It would also be necessary for the community to accompany the development of the project, if the volunteers would be able to understand how to use Dapp, if the steps were being carried out accurately. We know what would happen each month, so it is possible to monitor the development of the situation. Some community members could be responsible for this, and always be in touch with the project team. In general, the author provides us with quantitative data to audit the process, but I believe the analysis here needs to be more human than numerical. Now, speaking of the final results, the qualitative information that I talked about is provided. My question is more about how all this can be objectively monitored, how these consequences would become measurable and how the Cardano community could perceive them. In my view, it is necessary for the team to make this data scalable for us, making this information easy to understand. So the auditability is good, but it still has some details to improve. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 8, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 4537, "q0": "This would be great idea to deliver the people whether they are drinking healthy water or not , and with help of the dApps people will get to know much about blockchain and cardano impacts in the future. \nThis idea is not only helping people about the health, but also helping them to understand their how much their muncipal is working efficiently towards the society. hence proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team has great experience working towards health of the people, that would be major advantage for completion of the task effectively.\nThe task mentioned wont be much of difficult to complete since it mainly relys on ,orders and partnership with government municipal the dApps can easily be spread across the  people by providing block chain incentives hence  plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer should have mentioned about the other key indicators that will be used, other than that the proposer has proposer has given clear vision of road map.\nThe proposer has shown us that, the main vision is to improve the health of the people instead of business partnership, he has given us the idea on kits and materials that will be required clearly in the proposal hence information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9860, "q0": "This proposal aims to deliver a decentralized platform for water quality testing and reporting, solving the problem that data from the centralized authorities of their water quality and the community are untrusted. It will be very clear and confident if author provide some evidences about the quality of water of the current system  and negative impacts of the unqualified resources  on community health in developing world countries.\nThe proposal clearly identified problems within the challenge which needs to be solved, this platform could engage community volunteers in water quality monitoring by collecting and testing water samples, submitting results  of home and public water sources, help protect human and social capital, build economic wealth, enabling sustainable prosperity  as the challenge setting.\nBy using ADA and Cardano native tokens, Atala PRISM for DIDs, authentication, and issuing and verifying credentials,... this proposal will add value to the Cardano ecosystem.\n\nThe proposer implied some risks during implementation and ways for mitigating them such as: opposing government and industry in concealing information, team experience in Atala Prism DID & Plutus, data trustworthiness , Laboratory fees and expenses,... I only concern about the accuracy of GPS location that another application encountering and hope to have a suitable solution in recalibrating periodically for example.\n\nBut anyway, this proposal is very interesting and hope its will be funded for community health.", "q0r": 4, "q1": "The roadmap and timeline are identified clearly and rationally, with Gannt chart regularly updated and easy accessed on the website for the community. \nWith the reference links on Linkedin, we could verify relevant experiences of team in leading diverse international teams, with international water-related projects, with developing laboratory systems and integrations,... but I cannot find any reference and proof of work on blockchain dApp development in common except  Atala Prism Developer and  Plutus Developer opened need to be filled.\nThe budgets is outlined clearly into items but it will be improved for identify the required budget is enough by breaking down into detailed number of working hour for each work, for example: 80 hours for Web app development, 100 hours for Blockchain development. If could, please divide each item into sub-items such as what works to carry out for Smartphone app development.\nThe proposal basically explained technical aspects related to the solution, but it'll be more clear if the proposer provide a sketch/diagram to describe how works in flow visually, enhancing the feasibility for the community.\nAbout the community marketing, the proposer has plan to outreach to universities and organizations but not mentioned how to campaign and by what type of media or channel. It will increase the confidence for the community if the proposer give out an overall marketing strategy.\nIn  short, I believe this proposal will be implemented successfully.", "q1r": 4, "q2": "The KPIs of the proposal are auditable or available, but it just plan for the first 3 months of project funding. It would be perfect if the proposer gives out the KPIs for next  we plan to attain and exceed the following measurable goals:\n such as: Number of registered/ database queries, Number of water quality samples collected/tests published,... It's more positive if the proposer give out KPI values about the water quality improvement index by a statistic tool as an important goal of this proposal. The team also designate a website with Gantt chart for providing regular updates to the community. I suggest to add some more items/statistic on this website beside this chart and build a closed communication channel with the community such as: Discord, Slack or Telegram,… The proposal somewhat defines what success means and somewhat derived from their KPIs. In common, I suppose this proposal is auditable enough for the community tracking the progress.", "q2r": 4, "assessor": "z_assessor_777", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 9762, "q0": "This idea is awesome!\nThe issuance of native tokens on the Cardano for people with knowledge or well trained to take water samples around the world helps anyone at everywhere knowing the water’s quality they are using.\nBlockchain-based real-time water’s quality transparency will make it easier for many people to access what they are using every day. This is something that governments, especially in developing countries, rarely do because of short-term conflicts of interest or lack of funds to do so.\nI believe this is a very good dApp and it will grow rapidly thanks to the communities of geologists, people with knowledge of analytical chemistry, chemistry teachers and students,... Pay attention on how to have a rigorous process to control the actual quality of the evaluation samples.\nThis project will be a good model for many similar environmental projects in many parts of the world to be implemented.", "q0r": 5, "q1": "This is a great project, invested by experienced people. The works is implemented clearly and specifically, so it is easy to follow the work to be completed.\nProject Leader is a person with experience, prestige and willingness to share, so I believe this project will be successful. In addition, his team includes experts in laboratory systems, health care technology as well as environment.\nMost important, the team members provide clear information that I can follow their activities instantly and understand what they are doing. I believe this project will be successful.", "q1r": 5, "q2": "The proposer lists everything they need to get work done in a clear, intuitive timeline so anyone can read and check the results of the project. I can easily understand what they will do, when and for what results, so I really believe in success of this project.\nThe cost allocation is also very appropriate and professional. Particularly, the cost of software development including Web app, Mobile app and Integration, in my opinion as a software developer, it's quite reasonable or giving a bit tight.\n", "q2r": 5, "assessor": "z_assessor_759", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8451, "q0": "This proposal has idea about delivering a decentralized platform for water quality testing and reporting. Water contamination is global issue as it directly affect human health. Therefore, it is urgent for each of us to act quickly and together to save our water or our planet. Any volunteers or participants in community will be encouraged to use ADA and Cardano native tokens. Also, this project will incorporate Atala PRISM which promote credibility and legitimacy of the collected data. I appreciate the proposal and team members's effort for their deep research of this project.  ", "q0r": 5, "q1": "The proposer gives a very detailed plan for each job. Their plan is broken down very clearly into 30, 60 and 90 days with focus on main tasks. Also, I am very pleased with their presentation of the project's costs. It shows the proposer's seriousness and deep research of this project before presenting to the community. In addition, team members are very qualified and have experience in diverse field. However, the proposer knows they need more developers to complete this project. I hope this project get funded and support from community and government. ", "q1r": 5, "q2": "It is absolutely possible to measure the progress of the project by visiting websites. Having the number of registered volunteers, collected water samples, published quality tests,...Also, by checking some milestones such as functioning web and smartphone app release, partnerships with commercial and university laboratories. Moreover, the information of water quality is available and shared publicly for community benefits. ", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 7575, "q0": "The proposal aims to provide a decentralized platform for water quality testing and reporting. This is essential for human health everywhere in the world. Many parts of the world lack water and many places have water but it is tarnished by many factors, information about water quality must be very little or not public leading to many harms to human health. . Even a powerful country with strong economic development, the quality of water sources have not been given due attention. The suggestion is great and suitable for this challenge. The solution offers CLEAN aims to deliver a decentralized platform for water quality testing and reporting. People are empowered to sample, test, and submit results for water quality in their homes and communities. Results are stored on the blockchain. Incorporates DID and reputation management to ensure data accuracy. The solution solves the most logical problems including those associated with Atala PRISM solutions. The proposal ignorant 3 main risks (possibly opposed by those in government and industry who want to make people of environmental pollution / low data reliability/laboratory costs) experience) and have also come up with solutions to limit these risks.", "q0r": 4, "q1": "The proponent provides a detailed table of tasks to be done and for how long, when to finish, very professionally (https://clean.watercontaminationdata.org/clean-project-planV2.html). I appreciate this. The proposed cost is described in 3 main categories with time and number of personnel, and the number of complete equipment. (Software Development/Administration, Management, Community Building) should add more details with each implementation object to help the project be more transparent. The information proponent has 3 main members of the project and the partners are developers, information about experience, expertise, and social networking site links are complete and easy to find, helping readers trust the team. project team.", "q1r": 5, "q2": "The project has five key metrics that are easy to measure. It would be even better to add data reliability metrics, which will attract more users. The project identified its greatest success as the introduction of a working web and smartphone application that supported the hierarchical collection of water quality samples. This is not a sequel to a previously funded project in Catalyst.", "q2r": 4, "assessor": "z_assessor_610", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 5487, "q0": "The aim of the project is to build a decentralised platform for testing and reporting water quality and submit all the data on the Cardano blockchain for everyone to have access to the information. The testing and reporting will be done in a decentralised approach, by independent sources, in random places, where people consume water - in their homes, schools, businesses etc.\nThis way of testing will ensure a constant flow of data and visibility for everyone to see and monitor.\nI find this proposal to be very impactful not only for the Cardano ecosystem, but for all involved communities and if successful could lead to an expansion of both blockchain technology and vital information access.", "q0r": 5, "q1": "The roadmap is very detailed and reasonable. The team have designed several steps for working proof of concepts, so as to always have a function Dapp, that in time will feature additional functionalities for water testing and reporting. The budget is reasonable and sufficient for such a task. The team members already involved have sufficient experience in domains relevant to this project, building trust that with the additional two developers needed, will be able to successfully deliver the project.", "q1r": 5, "q2": "The progress measurement criteria is on point and clearly verifiable by anyone, since almost all the info will be present on the blockchain. The success of the project is realised through the launch of the Dapp and its continuous usage by a growing community. ", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 359, "q0": "The central idea of ​​the proposal is to create a decentralized application that facilitates the monitoring of water quality in certain regions and increases the reliability of this information. This is a real problem for third and second world nations and it also affects major global powers like the US. We have then that the proposal fits the goals of the challenge in which it finds itself.\n\nProblems with the quality of water used by the population of several countries are historical and the lack of confidence of the inhabitants, regardless of the country, in government information is undeniable. So the application proposal is innovative. With adequate funding, this idea has the potential to help solve the problem described so far, with very positive impacts in the medium/long term, both for the people who use and benefit from the apps, and for the Cardano ecosystem.\n\nOne of the main negative points that we should mention here is that perhaps the requested budget is not the most adequate, $115,000. This point will be addressed further in the continuation of the analysis.", "q0r": 4, "q1": "As for the team responsible for executing the project, there seems to be no doubt about the capacity and qualification of the professionals involved in carrying out the work. In order to confirm that this is really a well-structured idea, a link to a website was made available:\n\nCardano CLEAN Stake Pool (watercontaminationdata.org)\n\nIt is possible to find well-structured project ideas and their motivations. Additionally, the professionals involved made their professional profiles available; for example, project leader Nick Smith's LinkedIn is:\n\nhttps://www.linkedin.com/in/mrnicksmith\n\nFurthermore, it is interesting to note that the skills of professional Christian Kapend, also involved in the project, are quite plural and match this project. Among such skills is experience in training users in health laboratory systems.\n\nThe downside in the plan on how to deliver the solution really seems to be in the total capital being requested, and especially in its distribution. Given the innovative nature of the project and all the technologies and integrations that are required by it, perhaps a better approach would be to direct more efforts to the validation of the concept than to its actual implementation.\n\nOf the $115,000 requested, $45,000 will go towards Software development, ie approximately 40% of the funds. And as described by the authors themselves, this will be a pretty dense idea, involving the purchase of quality test kits and partnerships with local labs. It seems then that given the complexity of the project, more funds should be allocated so that the idea was actually validated, both at a conceptual level and in relation to public adoption, so that so many resources were destined for the actual implementation. In this regard, we realize that the amount allocated to community construction ($36,000) is less than that allocated to development.", "q1r": 3, "q2": "Regarding the parameters that were established to measure the possible success of the project, we realized that they are valid and relevant in terms of measuring the scope of use of the application and its adoption. It is interesting to note that very detailed quantitative metrics were established, which measure the use of the tool by people from the most diverse sectors, such as volunteers, school and university students. Also, in relation to the tests that will be carried out on water samples, we also observe a concern of the team in considering different scenarios. In addition, regarding the perception of the project's success, we have taken into account not only the use of the application, but also the growth in the number of users, evidencing the team's attention to the future of the project.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4382, "q0": "I would like to commend their project presentation, the necessary information listed is quite complete, easy to understand. This is a project to build a platform called CLEAN so people can provide samples and test the water quality where they live, thereby improving the environmental quality and health for everyone. I appreciate the project's community purpose. They have stated that once the project is completed their labs will be open to accept Ada and then Cardano native tokens as payment for equipment, materials, and services. I would like them to put more effort into describing the potential of the project for Cardano with specific KPIs. The plus point is that the proposer gave clear concepts and specifications, they also gave their case study so that readers can refer to and verify the credibility of the project. In this section, the author introduces the project activities but does not focus on introducing the details and core functions of the CLEAN platform. They analyze the risks that the project will face and measures to mitigate them, I appreciate it because they focus on research to verify and secure information for users. For this part, I will give 4 stars.", "q0r": 4, "q1": "They provide a clear roadmap of time, goals and results to be achieved in two short-term milestones of 30 days and 60 days. They also provide a link to a draft version of the project plan for the community to refer to, which I greatly appreciate. The budget plan and cost allocations for the planned activities of the project are simple and easy to understand. The author describes the professional competence, experience, and skills of each member, the team also provides descriptive links for readers to easily verify, each member of the team has considerable competence and experience that can help with the project they are pursuing. Some members have not been updated with full reference information, I hope they will soon add to the project. In this part, I will give 5 stars because the information they give is simple, complete, and easy to understand.", "q1r": 5, "q2": "Once again they emphasized the milestones and goals they will achieve in 9 months, I appreciate that they clearly define the goals they pursue and convert with specific metrics, the community can easily track the progress and development of the project through KPIs + the link to the project Web site + Github. In addition, to increase transparency and auditability of the project, I hope they will add an audit report plan to the project. Overall, I think their proposal will effectively address the challenge. I will give this part 4 stars.", "q2r": 4, "assessor": "z_assessor_1724", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 826, "q0": "This project's scale is large, but appropriately located in the Nation Building Dapps challenge.  Tthe idea is an interesting approach to a clear problem (water quality) delivering a solution that both utilizes and expands on the value of Cardano.  The solution offers a scalable outcome which can be expanded to have a wider global impact in areas that are more relevant to water quality issues, however I agree that the initial test market is more simple for MPV testing and scaling base.", "q0r": 4, "q1": "While I agree that the team is well positioned to implement this project and contains a wide diversity of perspective, there is still some implementation assurance doubt due to the fact that they have not identified any technical members for their team, and a failure to do so will render them unable to integrate with the blockchain.  The budget and timelines are reasonable well thought out and organized, however the bulk of the project (almost 75% of the budget) is aimed at development work, so those tech roles are really going to be key.", "q1r": 4, "q2": "The proposal author's metrics for auditability are entirely quantitative, however I think that a key metric for auditing this project in the early phase will be to ensure they can attract, onboard and retain the appropriate technical assistance to implement this project.  If they are not able to do that at a very early stage, then the remainder of the delivery metrics will be negligible.", "q2r": 3, "assessor": "z_assessor_1224", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4046, "q0": "The proposal is very well written and raises an interesting problem. According to the team, people are not able to clearly identify that their water is being polluted so they need a decentralized platform for water quality testing and reporting. In order to solve this problem, the team has developed a solution by clearly projecting activities such as collecting samples for water quality testing from the central municipal water treatment facilities to where people consume water; then integrating with Atala PRISM to publish trustworthy data in a way that verifies and substantiates previous samples; etc. I can easily recognise the impact of this project since it affects both people’s health and property value by allowing users to get access to data on potential pollution problems with properties. The proposal also inspires a list of use cases within the same topic, within the same platform that you could choose to get water quality certification for businesses, schools, restaurants or get environmental training certification as a monitor and I believe that more uses can be achieved. Besides, the team also plans to find counterparties that accept Ada and later a Cardano native token as payment, which can bring convenience to users. All in all, the proposal does address the challenge, engaging and scaling up local communities, possibly bringing new members, and has potential to raise different and fruitful results for the problem.", "q0r": 5, "q1": "The prensent 3 members of the core team cover an impressive area of complementary expertise and experience in the field related to the proposal. Both from the perspective of being active members and contributors to the Cardano Ecosystem and having experience in working in the health field. Sufficient information on each team member is provided through reference links. I am still hoping to see the last two potential members of the team as soon as possible. The budget is quite costly but makes sense considering that the proposers want to launch a project on this massive scale within the timeframe of 3 months ( and maybe later). The allocations of the budget are presented clearly and sensible. The timeplan is laid out in a clear and structured way with 3 different stages. The tasks provided to reach success are also reasonable and logical.", "q1r": 5, "q2": "The proposal includes a roadmap with milestones included, presented in a clear and understandable way. They also provide some key metrics and KPIs that would help people have a better understanding if the milestones are achieved or not.", "q2r": 5, "assessor": "z_assessor_1702", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4018, "q0": "The proposer provides CLEAN - a decentralized platform for water quality testing and reporting, People are empowered to sample, test, and submit results for water quality in their homes and communities. The author has provided the main activities of the project and this project will have the impact of helping people to check and report on whether the water they are using is hygienic. at the same time, pointed out the importance of clean water and the current state of water pollution, especially in the United States, to see the importance of this project. Their goals are also very clearly stated in addition to collecting water samples for testing to ensure reliable and authenticated data. The management and administration of Clean will evolve into a DAO (Decentralized Autonomous Organization) The Clean DAO will underwrite the management, administration, and community development through transaction fees paid with the clean token. The risks encountered by the project are also detailed and accompanied by the proposed solutions, such as efforts to find more human resources with experience in integrating Atala Prism DID. Increase trust by finding ways to leverage the use of supporting technologies such as proof-of-concept and trust but verification or repair financial problems with a native token will be accepted as payment for field testing kits and equipment. Additional costs associated with analysis in certified labs will also add to the cost of collecting and testing samples.\n", "q0r": 5, "q1": "I really like the presentation of the roadmap of this proposal. First of all, updated drafts can be reviewed, so anyone following this project will have an idea of the progress made, the work in phases, and each task in each project. All projects are clearly stated, and there are results to be obtained in each phase and how to implement each activity, this is a very intuitive and easy-to-understand roadmap. The writer also states the costs and their purposes. In addition, specific figures on the number of hours and equipment required are provided.The core team is all excellent members from many fields, so it will help the project to run smoothly and achieve results such as Nick Smith, Project Leader who has experience in implementing medical solutions will and has With his leadership skills, work ethic, and vision to help the Cardano community achieve widespread acceptance as well as a successful Clean plan, Mark Lancaster, Community Ambassador is sure to take on the duties well. negotiating, signing contracts, or looking for volunteers... Besides, they are all excellent personnel in the field of information technology.\n", "q1r": 5, "q2": "Determining specific numbers for evaluation is the point where I find this project to be doing very well, for example, the goal is to recruit at least 100 volunteers, so it is easy to determine whether goals are developed or accomplished if less than one 100 is incomplete, 100 or more complete can move on to the next stage. however, I think it would be better if the writer was more specific about the success criteria such as how many % increase in traffic compared to the previous month or quarter to be considered successful.\n", "q2r": 5, "assessor": "z_assessor_1701", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3237, "q0": "The proposer has raised many concerns; the impact scope of the problem is relatively large. Reading the project, I see that the two most important problems are human health and water quality. The current state of water pollution is alarming and seriously affects human life and health. Meanwhile, not everyone knows that the water they are using is contaminated until too late. Water quality measurement policies and data are currently managed by a centralized authority. CLEAN aims to provide a decentralized platform for water quality testing and reporting. People are authorized to sample, test, and submit results on the water quality in their homes and communities. Results are stored on the blockchain. Combine DID and reputation management to ensure data accuracy. When reading about this project, I was like, wow wow... this is such a great one. It will drive the Cardano ecosystem's growth.\nTo address the project's problems, the proposer made valid arguments describing solutions such as reporting water quality in homes and communities as necessary as registering properties for financial capital. They provide data and evidence to prove that people cannot rely solely on centralized government and bureaucracy to protect their water resources.\nHowever, every project undertaken has challenges or risks. In this one, the proposer has outlined three main threats, and the solutions to these risks are particular. That is: Their project could be opposed by those in government and industry who want to keep people ignorant about environmental pollution, data reliability, and the challenge of lab fees and costs.", "q0r": 4, "q1": "Detailed plans, clear timelines with specific goals updated regularly on their website, are what I first noticed on this project. The budget for this proposal is less than 20% of the challenge's total budget. All expenses are listed in detail and explained particularly. Proponent divides the budget into 3 categories: $45,000 for Software Development; $36,000 for administration, management, community building; $34,000 for materials, equipment, fees and expenses. Besides applying for funding through the project's catalyst, the team is also trying to fund its activities through the proceeds of its fledgling equity pool. This shows that the team is very determined to carry out this project.\nThe project is carried out by a qualified and experienced team in line with the objectives of the proposal. Identity is easy to verify. But I haven't seen the division of work for each person yet. I checked their identity easily through Linkedin.com. They are all passionate, ethical, and visionary. Competent and experienced in medicine, education, and information technology.", "q1r": 4, "q2": "Auditing is an essential part of evaluating the success of the project. With this proposal, the proponent has provided metrics and KPIs that are easy to measure and check. However, it does not meet the requirements. This is one of my favorite projects, it's a relatively large scale, but the KPIs of some items are low within the first 3 months of funding. I suppose the project should increase the number of items. The abundant resources can be considered from high school and university students, who are knowledgeable, accessible, easy to propagate, and rapidly expand the community. The marketing should be optimized to attract more organizations, businesses with voluntary activities, non-profit organizations... The number of water sampling locations should be increased, including industrial parks, high water quality areas, ponds, lakes, residential areas...\nThis is a new project that has never been funded before in Catalyst. I haven't tested it, but based on the proponent's description, I can quickly determine the project's success. Provide a working web and smartphone app with a backend side-chain supporting the decentralized collection of water quality samples; this is completely decentralized, so citizens no longer have to rely on institutions' centralized authority to provide this data. The growing number of volunteers, the increasing base of user proves the rising level of data reliability and people's trust. The rising list of active partnerships with commercial and university labs boosts ADA adoption and ADA use for payments. This has had a positive impact on the Cardano ecosystem.", "q2r": 3, "assessor": "z_assessor_1631", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 2394, "q0": "Surely everyone knows that water is an invaluable resource for humans, everything cannot live without water to live. Therefore, water plays an extremely important role for all things in general and people in particular. But we may not realize that maybe the water around us is polluted. with the idea of ​​including CLEAN to provide a decentralized platform for water quality testing and reporting. is a very good idea. Essential for everyone. In the team's proposal, the team highlighted the importance of water and explained very well how to test when a water source is contaminated runs on blockchain technology. This problem is well-suited to the challenge. It answered all the questions of the challenge. also answer the question of how to manage clean water. I think this proposal is very good, it should be replicated so that people can use clean water. an invaluable resource, in the solution description, the team has given very specific solutions, with 9 project activities that will help people self-assess the water source where they live. I find All the solutions given by the team are reasonable. The group has provided relevant evidence, studies, arguments, and grounds. In terms of risk management, the group also outlined certain risks it may face, such as possible objections from government and industry insiders, and data and security not being enough. , the lab fees are high and the costs and some other risks are commensurate. However, the group also pointed out specific options to deal with that risk. I found the content of the project quite detailed and complete.", "q0r": 4, "q1": "with a description of its progress measurement and development. The group has identified a specific milestone. The roadmap for this funding round is divided into three phases. that is 30 days, 60 days, 90 days. The group has identified specific goals with five set goals. I think with the timeline mentioned above, it is very reasonable to complete the proposed tasks. The progress of the project is very easy to be tracked by the community. on budget presentation, with the requested budget being: $115,000 and calculated broken down into reasonable amounts. however, the team needs to make a contingency plan in case of lack of budget or supplement the budget when necessary. about their team member presentation. The group has listed three members and has assigned specific tasks for each individual. Although the number of members is still lacking, the three members mentioned above have very rich experience, they have a high degree of intellectual property certification, have announced their identities, attach their references at the link to add easy tracking authentication.", "q1r": 5, "q2": "About the presentation of the progress measurement and development of the project. The group calculated and identified five main indicators. and divided into sub-contents in each major indicator. What I am more satisfied with is that the team sets out a plan to meet and exceed the goals mentioned above. This shows that the group shows great determination with their project. The given indicators are also very easy to check and track by the community. About the successful presentation of the project. The group identified four successes. Each success is described very clearly as stated in the proposal and has specific results to be achieved. I find success very closely related to the challenges of the campaign. This is a project that has been studied by the team for a long time. The project is very well founded, however it is not a sequel to a previously funded project in Catalyst. In my opinion, this is a very good idea, it is very suitable in a present and future society. I highly appreciate this project, I hope it will receive a lot of support from the community. for the project to be approved and soon put into practice.", "q2r": 5, "assessor": "z_assessor_1486", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2196, "q0": "This is a well-thought-out and detailed proposal. It is up to the challenge because it is scalable and applicable to developing countries to improve people's quality of life and build transparent governments. However, the community may expect to know the next step after determining water quality. The proposal is likely to significantly impact the US and other Western countries, where there are advanced democracies. When people speak out with social media press, governments or businesses will have pressure to take action immediately. However, it is different in developing countries, where the lone voices of a few individuals or a minority are easily ignored or silenced. Or, possibly, people and governments may perceive problems with water quality, but natural conditions or national resources do not allow them to solve it. Thus, thinking about possible solutions may be even more important than identifying the problem. The group needs to take one more step because it won't make much sense to point out the problem if we can not solve it. However, this is still a great project, so I give it a 4.", "q0r": 4, "q1": "The way the proposed model works is technically feasible. In terms of ideas, it is not difficult to attract volunteers and train them to test water quality build web and mobile apps to store data. Applying Atala PRISM to build Water quality certification is quite a unique idea, expanding use cases and enhancing value for the CLEAN token. My recommendations are to explain better how to use the test kit and ensure the accuracy of the results when taking a water sample and sending it to the laboratory. The team should also further explain the role of blockchain technology in data storage and authentication.\n\nEconomically, the amount requested is reasonable, and the budget breakdown is clear. Only a few details are missing, such as how much to spend on Web app development or how much each kit test costs. Information on the specification of the test kit, the manufacturer, and the intended laboratories should also be published. Besides, whether there is any sustainable motivation to hold the CLEAN token long-term should also be analyzed. How will the project's Tokenomics work to be sustainable? Other than Catalyst funding and community support by ADA staking delegation, where will the revenue come from?\n\nAll members have rich knowledge and experience to carry out the proposal regarding the team. The proponent provided reference links for verification, and that's a plus. However, the team should reconsider the type and number of team members required. In addition to Atala Prism & Plutus developers and volunteers, the team may need to add many other positions when implementing a massive project like this. Help from professional accountants, legal counsel, environmental activists, and local influencers might be necessary. Those things will require the team to start planning financially and contacting potential candidates right now.\n\nThe roadmap and timetable are detailed and realistic. What is missing is which cities and countries the project intends to apply it to first.\n\nFrom the above statements, I give a score of 4.\n", "q1r": 4, "q2": "The proposal provided an understandable description and solutions to the targeted problem. Proposer also identified process and success measurements for this project. Metrics/KPIs lack a bit of granularity but can be easily added in the process. Generally, this is a well-presented and auditable proposal with a clear roadmap and milestones. Therefore, I gave this criterion a 5.", "q2r": 5, "assessor": "z_assessor_1459", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10264, "q0": "This is a very interesting proposition, it has global implications. Currently, the problem of environmental pollution (soil, water, air,...) is being given top priority. This proposal delivers a decentralized platform for water quality testing and reporting. People will be empowered to sample, test, and submit results for water quality in their homes, businesses, schools, and neighborhoods.  Results will be stored on the blockchain using a smart phone app. Participants will be incentivized using a combination of ADA and Cardano native tokens.", "q0r": 5, "q1": "Your team consists of members with many years of experience in the field of community, health,... Their records are provided fully and transparently. Besides, they have achieved so much success that I could not list them all. With such a strong team, I believe they are fully capable of leading and implementing the project. However, the team has yet to find Atala Prism Developer and Plutus Developer. Hopefully the group will quickly find people with experience in these fields.\nThe roadmap, the jobs are described very clearly. I looked at the Gaant chart you provided, this is a very clever way of providing information, it is really detailed, it makes it easy for me to keep track of the tasks you will be doing in each specific time period. You have identified the risks, the challenge and how to deal with it (Atala Prism Developer, Plutus Developer, trustworthiness,...) This shows me you have an overarching vision. The budget is allocated reasonably (determining the number of working hours, the salary for each hour). In addition, the success evaluation index is listed specifically, based on which CAs can monitor and evaluate the success of this project.", "q1r": 5, "q2": "This is a project with great potential, it has tremendous value. It will certainly attract the attention of organizations, especially health and environmental organizations. The information provided is sufficient, I believe this project will be funded. If that is true, it will certainly bring great value to the community, health is more precious than gold, this project will be the foundation for sustainable development.", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "CLEAN aims to deliver a decentralized platform for water quality testing and reporting.", "experience": "Experience in leading diverse international teams\nExperience with international water-related projects\nExperience with developing laboratory systems and integrations\nExperience with rolling out major systems in developing world countries\nFirst-hand exposure to water contamination"}