{"id": 397649, "author": "karl", "title": "Hello Future - Digital Time Capsule", "url": "https://cardano.ideascale.com/a/dtd/397649-48088", "category": 26435, "amount": 25000, "description": "Delivering information to a person or persons in the future is problematic in an unpredictable world with human factors and forces of nature", "funded": 1, "upvotes": 30967033, "downvotes": 24683728, "votes_result": 6283305, "votes_cast": 171, "f6_no_assessments": 8, "f6_rating": 1.7916666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 4472, "q0": "The transmission and storage of information is critical. Data is synonymous with knowledge. Good data gives irrefutable evidence, however anecdotal evidence, assumptions, or abstract observation may result in lost resources as a result of acting on an inaccurate conclusion. Data will assist you in explaining (both good and negative) actions to stakeholders. Whether or not your tactics and judgments provide the desired results, you can be certain that you built your strategy based not upon guesses, but good solid data. As a result, this project has the potential to reach a certain segment of the public. It is not just a legacy, but it may also be used for confession, similar to online letters. This is an intriguing concept in theory, but we will need more evidence to establish its impact. The author should clarify on the predicted user metrics, the important KPIs that the project intends to achieve with this application, and the clear effects of the mentioned metrics on the growth of the Cardano ecosystem. When it comes to data, security is the top priority. Another problem in data storage is automatic backup functionality. It is more convenient if we provide backup automatically. Those that do not provide backups, on the other hand, provide users with a safety net in the case of unexpected data loss. How do you intend to address these issues?", "q0r": 2, "q1": "The author makes no mention of the project's practicality. To have high feasibility, the author must have a plan with a clear timeframe for each task that must be done in order to complete the project. Both the method and the technical components should be described. The projected budget must also be split down and clearly marked for each amount that will be spent. In terms of team members, the author must have a detailed strategy in place to recruit employees, and this proposal must explicitly list team members with the relevant experiences, skills, or qualifications to deliver the intended product. Since it is presented quite poorly, I do not appreciate the practicality of this project.", "q1r": 1, "q2": "Using Reddit Sub to track the project is one option, but we will need to demonstrate a clear and competent tracking method to the community. The proposal must provide detailed numbers on the project's development, how the plans are completed in a given time frame, and how the success of the tasks is measured. Although the author's viewpoint on success is intriguing, without specific metrics, reports, or comprehensive plans, everything becomes unrealistic and difficult to achieve the intended objectives. Specifically, the project's success must be linked to the success of the Cardano ecosystem, such as enhancing the community's effect monetarily, intellectually, or compassionately.", "q2r": 2, "assessor": "z_assessor_1726", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2197, "q0": "This is more of an ambitious and daring idea than a viable proposition today. The proponent did not provide preliminary evidence or research, so the proposal remains very abstract. Keeping and passing on information or assets to future generations without the need to trust a 3rd party sounds great, but it doesn't fit the criteria of this challenge. (Rating given: 2).", "q0r": 2, "q1": "The proponent admitted that he was not aware of the technological and financial viability of the proposal. The concept of \"custom AI to locate and verify the recipient or recipients\" is very general. Current AI technology may not be ready for that yet. If so, it's probably still in the draft or the lab, and it will take a lot more time and money to perfect and put into practice.\n\nNo evidence, roadmap, or realistic timetable to complete the work has been given. It's all just an idea. My suggestion is to research AI technology more to see what problems it can currently solve and combine it with blockchain. (Score given: 2).\n", "q1r": 2, "q2": "The proposer did not offer an understanding description and solution to the problem, roadmap, milestones, and metrics/KPIs. (Score given: 2).", "q2r": 2, "assessor": "z_assessor_1459", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4383, "q0": "The main aim of the project is to create a software that Non Profits can use to connect their donors with the end-user. This project is still in the concept sketching stage and the proposer is simply presenting their idea. The information provided does not have a high reference value and is not enough to confirm the feasibility of the project. However, I can see a certain similarity between the core purpose of the solution and the Challenge problems, I encourage them to do a good job of preparing to be able to implement the project as prototype software development, present core features and software operation, make project development plan and product marketing plan. They raised challenges that hindered the development of the project but did not offer mitigation measures, in addition, the biggest challenge of the project was the technical problem when the proposer had no experience or technical skills in this field, and at the same time, there is no technical staff in the team. But I still appreciate this idea, I look forward to seeing a finished project of the team in the next fundraising rounds.", "q0r": 2, "q1": "They have not built and are not sure about their project development and implementation plan, all just stop at the intended, so I cannot determine whether the project is successful or not. As for the budget, they only show the activities that will take place to develop the project without giving specific costs and total budget. Auditability for this project is almost non-existent, I encourage them to develop a detailed budget allocation plan that includes the following information: key activities/tools for the project, number of participants involved in the project, the positions in the project, the number of people in each position, the number of hours worked, the amount allocated to the individuals, and the activity/equipment. I cannot verify the identity of the proposer, for projects, the information about the proposer is very important, the reader can verify the competence of the proposer and the trust level of the project. I encourage the proposer to provide his/her Linkedin profile or CV. Regarding personnel, they are still in the seeking phase, but they do not have a specific recruitment plan, there will be costs incurred for this recruitment.", "q1r": 1, "q2": "Since the project implementation plan, budget and personnel have not been developed yet, this project cannot be audited. The way and KPIs so that the community can track the progress and development of the project are missing, they are very important for any project so that the community can get excited about the project. As for tracking, the proposer can build project information channels on social networking sites or blogs. For this project KPI, I can take a simple example as follows, 3 months after the software is operational, the team sets a goal that there will be 15 non-profit organizations using the software, 50 IDs of the kernel is integrated, 50 people are registered to use the software.", "q2r": 1, "assessor": "z_assessor_1724", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 4447, "q0": "I sympathize with the situation you presented at the beginning of the proposal. The idea of developing a blockchain to manage information is not a bad one. However, in describing how your proposed solution will solve the challenge, you need to explain your proposal, its benefits, and what it will bring to users and Cardano ecosystem. This means that your presentation is not clear enough for the viewers to understand.", "q0r": 3, "q1": "you have not provided a detailed plan and budget even though at the top of the proposal you requested a funding of 25000 USD. It is difficult for us to check the feasibility of the project when the information is lacking. Also, you don't have a team member yet. It is better to seek professional help to review your idea and define your plan.", "q1r": 1, "q2": "I can not judge a project without a specific plan. What will you report and update in the future? The project will not be measurable. Investors do not put money into a project but can only \"speak to the future\". Think about the detailed plan, the timeline, the roadmap, the milestones, the metrics then describe the project's success first, then you can come back here. ", "q2r": 1, "assessor": "z_assessor_1725", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7576, "q0": "This is a good idea, the proponent wants to send information to future generations using AI and Blockchain. The proposal is clear but unrelated to this challenge and it is more suitable for challenging DApps and Integrations. The problem is obvious but the solution proposed by the proponent is not obvious. How will AI be used in this case? How to determine the future relationship? descendants how to receive messages or data?. Risks are not clearly defined. If the time set for the future is too far away, is current technology still in use at that time? The person who needs to receive the information is dead, what will the system do? Is there any impersonation to get information?\n", "q0r": 1, "q1": "The proponent has not specified the implementation timeline, so it is difficult to assess the feasibility of the project. The proposed cost of additional information to be used for what and how many people will be used in that job and for how long. Proponent and team information is important for identifying technical skills\n", "q1r": 1, "q2": "The proponent should add KPIs to be achieved for the project such as the number of users. The project has the goal of implementing a user-friendly dapp that functions as intended. This is a proposed new project that has not been funded before\n", "q2r": 1, "assessor": "z_assessor_610", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 8198, "q0": "Proposer believes that in the future in an unpredictable world will be a problem delivering information to a person or persons due to the human factors and forces of nature. He offers a solution through a decentralized data storage blockchain to manage the information that uses custom AI to locate and verify the recipient or recipients followed by information delivery. That would be the Hello Future digital time capsule. It would be good if the proposer worked out how this project will impact Cardano ecosystem and how it will add value to the Cadano ecosystem. Proposer does not list KPIs so it is hard to compare KPIs with challenge setting and proposal is not able to scale to address future challenges.", "q0r": 3, "q1": "It would be good for the community to have information on who is behind this idea. I suggest that the proposer presents his skills, knowledge and experience via LinekdIn or Github and works out what he needs in order to turn this idea into a project. It would be great to make a budget break down and work out a detailed work plan to give the community an insight into what will be done. The project should also have a time frame within the work will be completed. Perhaps to list the resources needed to implement this idea as well as the possible risks and challenges that may arise. ", "q1r": 2, "q2": "This proposal lacks data that would meet the criteria for drafting proposal. Roadmap with milestones, KPIs proposer does not state. One of Catalyst’s missions is to help people who have phenomenal ideas to turn them into successful projects so it would be great to get in touch with Catalyst members who will surely help.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9763, "q0": "The proposer wants to implement AI and blockchain technology to solve the problem of verifying the future recipients of assets that is stored on the blockchain platform for your descendants or future generations. This is a great idea and needs development.\nI just donot understand how the proposer will build and operate dApp, because to do this you must well understand or need support from AI and blockchain expert; as well as how to attract users to participate in using dApp.\nAlthough the proposal doesn’t address the tasks of Challenge, it is still a good idea. This is possibly one that adding value to the Cardano ecosystem and needs further improvement.\n", "q0r": 3, "q1": "First of all, the proposer needs team members, who are Information technology experts with knowledge of AI, storage, dApp programming; sociological Researchers, Marketing experts, System analysis and U/I U/X Designers.\nThis project roadmap does not yet exist. The proposer needs to give a clear and detailed implementation schedule such as what work will be done and when; what will be the results which can be presented by specific numbers. \nThe budget need to be calculated based on the jobs done, additional costs to pay the staff, buying the tools to carry out that project.. etc …. \nThe proposer need to have a list of tasks and based on that you can find right people, discuss your ideas and work with them to make a proper proposal for next Fund run.\n", "q1r": 3, "q2": "This proposal needs KPIs; timeline to complete the work and the results with specific numbers. \nThe proposer needs team members with experience in AI, Computer Science, Programmers and Researchers in sociology. The proposer should provide members profile (Telegram or LinkedIn) so experienced reviewers can support you to address tasks of Challenge.\n", "q2r": 3, "assessor": "z_assessor_759", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9849, "q0": "The problem in delivering information to a person or persons in the future is defined but all other aspects of the proposal's impact is missing. I hope to see the desired outcome, evidence, cost of the problem modified for the community know impact of the problem. I could guess the proposer would like to make a digital testament for leaving information to next generation such as: causes of death, desire,... especially in the same events/incidents as the author encountering recently. I hope the proposer clearly express ideas, impacts and event why the AI technology need to apply for unpredictable situations.\nIt'd be better if the author enrich the competitive advantage, growth potential, and staying power of the solution.\nThe proposal addresses relevant issues that may share a solution with the issues discussed in the challenge brief but do not address the challenge's requirements directly. Additionally, it doesn't do a good-enough job of justifying its relevance. References and additional justifications either do not exist or have no relevance whatsoever.\nThe vision is not easy to follow and its benefits are not at all communicated clearly.\nThe proposal didn't give out any risks during implementation but just vague wonder if AI could help to verify and deliver the data exactly. It'd be better if the proposer argue the way and how to improve the data validation and some more risks could encounter.\nIn common, although the problem defined but I could not see the impact enough for the community of this proposal.", "q0r": 2, "q1": "Only one person without any reference link to verify relevant experience regarding the social and technical challenges of the proposal. The Author also unaware of any shortcomings in their composition and clearly identifies a path to addressing these staffing/expertise shortcomings. So I doubt about the feasibility of this proposal.\n\nBudget is not outlined clearly and not broken down into identifiable items with budget needed. It'd be better if the proposer break down what works need to do and detailed number of working hour and cost for each work. If so, the community could find it is clear whether the requested amount is enough.\nSo I could not say that the budget is reasonable or not for implementing successfully this proposal.\nThere is no KPIs and how to measure them. I suggest some KPIs and the associated values such as: how many users attracted to trial using the platform to post experimental data and how to track or record it.\nIn addition, the marketing information is missing, and not mentioned how the advertising campaign would be carried out, I suggest to consider the marketing strategy, what type of media, channels and target audience for example.\nWith all reasons above, I don't see any feasibility for the community confident to vote.", "q1r": 2, "q2": "It's a pity that roadmap are not listed in this proposal for community tracking. I hope in next Fund, it would be modified with milestones and KPIs for the community can monitor how the project is progressing.\nThe proposal's KPIs and other measures of success can be reasonably considered to not be auditable or available. For the community auditing their measures, it requires deep involvement, if at all possible.\nThe proposer intend to create a reddit sub to release project updates and milestones with detailed expenditure reports and verifiable development progress. But it's positive if the author create this reddit sub before submitting this proposal, give out the roadmap, milestones or even the whitepaper for bringing the confidence and hope for easy auditing.\nAlternately, the proposal's definition of what success means is missing, hope to make details in the next fund.", "q2r": 1, "assessor": "z_assessor_775", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "A blockchain to manage the information that uses custom AI to locate and verify the recipient or recipients followed by information delivery", "experience": "In November 2021, I thought my abusive spouse was going to kill me.  It made me wonder things like how can I give my young child important information if I'm not around, such as a seed phrase or media. What if my child or any future descendants can access and contribute forever?"}