{"id": 398983, "author": "dimitri777", "title": "5 Loaves 2 Fish Feed The Hungry App", "url": "https://cardano.ideascale.com/a/dtd/398983-48088", "category": 26435, "amount": 300000, "description": "Good food goes in garbage. It adds to landfills, and CO2. Hungry people who could eat the food have no access. There's no way to track it.", "f6_no_assessments": 3, "f6_rating": 3.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"id": 830, "q0": "I thought the problem/solution match was interesting, but I'm still hesitant to agree if this proposal qualifies as a \"Nation Building\" initiative.  I'm also not sure that traceability and transparency of a blockchain solution are essential to ensure a simple solution of delivering highly perishable food waste from point of discard to needy families.  The NFT solution creates unnecessary cost and blockchain transaction volume that may add a cost element to the project which, although good for Cardano, may create unnecessary cost and complexity for your project's effectiveness.  There are already a variety of projects doing this in a non-blockchain format, many of which I have worked with in my local startup community who have achieved a high level of venture funding and corporate partnerships to help scale.", "q0r": 3, "q1": "There's a high level of detail available in this proposal related to implementation, but overall funding request seems low when compared with the scale of ambition, resources, and timeline required to get this project moving in the right direction.  I think the blockchain element may actually cause unnecessary complexity getting off the group, and recommend to the proposer to consider a non-blockchain solution as MVP implementation, and perhaps consider how a blockchain implementation at later phases could benefit the progress made in getting the business started.  I also don't see any staffing allocation for sales, which could be essential to develop the food source pipeline.  From my experience in F&B these businesses require a large degree of communication to sign on to new CSR initiatives, and entrepreneurs often fail to account for this complexity of communication in their staffing buildout.", "q1r": 3, "q2": "Funds are purposed for building out an operation team rather than a tech product, therefore I believe traditional business expenses are also relevant here, for example there was no budgeting for an accountant that could help with bookkeeping essential for an audit.  There's also no github repository where an open and transparent project coding forum can be audited, but perhaps this will come at a later stage.", "q2r": 3, "assessor": "z_assessor_1224", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 1284, "q0": "The proposal addresses important topics. It addresses urgent needs faced by people around the world. Namely hunger and inequitable food distribution.\n\nThe Challenge calls for development of dApps to be used in developing countries. The proposal mentions use of NFTs, but it is a minor part of the whole program.\n\nThe proposal draws a clear line from wasted food to climate change, but that aspect is ancillary also. \n\nReally, this project is asking for funds for vans, equipment,  and pay for labor. The technological part is secondary, and there is not a good reason for why a dApp would help. ", "q0r": 2, "q1": "The group has a lot of experience. Experience working in this field and experience working in teams, and working for the common good. \n\nThe program they describe can be run with very little capital. In fact similar programs run in many places. \n\nIf the question is \"Will this group be able to distribute food around Colombo with this plan?\", then, yes, they can succeed. ", "q1r": 4, "q2": "Yes. The group has a clear list of measurable mileposts, goals, and dates. \n\nThe plan seems well thought out and methodical. They can enact this and have high confidence in the auditability.", "q2r": 5, "assessor": "z_assessor_1336", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1}, {"id": 8149, "q0": "This proposal is a great and humane idea. According to the author, currently the leftovers of restaurants are dumped a lot in landfills, while the number of hungry children and adults eats a lot. Such discarded food is not only wasted but also pollutes the environment. The solution is to get food from restaurants and deliver it to beneficiaries, orphanages, elderly homes, homeless people, street people, slums, low income homes. According to what is presented in the proposal, it represents his vision, ability and enthusiasm for this proposal. He listed several possible solutions to the proposed problem. It also presents a lot of challenges and risks to this project and also gives very reasonable methods to be able to solve those challenges.\nThe proposal also provides great detail on how it fits the challenge, as well as how it will add value to the Cardano Ecosystem. A great suggestion, I totally agree.", "q0r": 5, "q1": "The proposal has a very detailed plan of how they will execute the project step by step. A 3-month roadmap is given with timelines associated with specific goals. The budget is also very clearly described, making it easy for the community to check how financial funds will be spent in a very specific way. However, I think the proponent forgot to adjust the requested budget. The cost he needed for this proposal was $46,800 and was explained very well, but the general description he asked for was $300,000, this seems to be a mistake, hope this confusion is released.\nAbout the project team of 5 members with specific descriptions of the team. The experiences they provide here give us confidence that they can deliver on what they promise. The track record of individuals involved in this proposal demonstrates their passion, affiliation, and willingness to make this project a success.", "q1r": 4, "q2": "There is clarity in problem descriptions, solutions, and suggested ways of linking to them. A clear roadmap, well-designed budget makes it easy for the community to track the progress of the proposal. I strongly agree that success criteria and KPIs are in place to measure progress in addressing the challenge. For the reasons above, I completely agree that this proposal will most likely succeed.\nThis is a brand new proposal not yet funded by Catalyst. Besides this proposal, the author also wrote 4 other proposals in fund 8. All of these proposals are related to each other. Thanks to whoever suggested this great idea. I hope your suggestions will receive a good response from the community.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}], "solution": "We pickup food from restaurants, and deliver to beneficiaries, orphanages. elders homes, homeless, street people, slums, low income housing.", "experience": "I have been involved in social service projects for over 36 years, On planning committees and packing teams for distributing dry rations during recent lockdowns. I also obtained a special pass to distribute of food rations from restaurants right through the curfew and lockdown"}