{"id": 399648, "author": "nzola8", "title": "Lokole/Cardano community Networks", "url": "https://cardano.ideascale.com/a/dtd/399648-48088", "category": 26435, "amount": 45000, "description": "Because 40% of the world's population cannot access internet to due to poverty, building another online Dapp won't still reach out to them.", "f6_no_assessments": 9, "f6_rating": 4.407407407407407, "videos": [], "media": [], "f6_assessments": [{"id": 4106, "q0": "The description of the proposed solution is ensured to cover some sufficient information such as functionality, features, main operation, potential subjects, instruction for use and so forth. These can somehow cast light on the notions and provide communities a foundational understanding of the proposed solution. For instance, the proposer provided a background problem to show that his product is a perfect fit for data communication in Africa, presents how it works and how to use it, etc. Furthermore, the benefits of Lokole in terms of cost-efficiency and resource-saving are apparently advantageous for the poor, vastly and positively impacting the users’ life, which is very pragmatic and convincing to implement the project. Besides, it is immensely impressive for the project to embrace the potential challenges as well as highly practical properties of the system to resolve them, which evokes a persuasiveness among communities. The proposer also did a great job in showing possible challenges in implementation as well as well-prepared plans for it. However, I see that the description lacks a list of key metrics as measurements of accomplishment to compare with the challenge KPI. Also, the proposer did not cover the potential impacts of the project towards the whole Cardano ecosystem such as popularity, number of users, positive impacts, etc. More key information and interpretation about the KPI and impacts on Cardano in the description can get the proposal to be clearer and better.", "q0r": 3, "q1": "It is encouraged to break these two quarters into smaller stages so that the project is able to become easier for the proposer and the communities to monitor and assess. For instance, Q3 includes 3 months, which can be considered a considerable period for manufacturing 100 Lokole boxes. In my opinion, the proposer could break the progress into small stages, for example, 30 boxes would be produced and used for a pilot test in the first month. If the short-term and real-life results are positive, the manufacturing process can be accelerated for the rest of time in order to meet the needs. By this way, the project can be regarded as safer, more thorough and robust. Similarly, the same strategy adoption can be applied to the marketing and sales process. What if by the end of Q4, the proposer would have not sold out 100 boxes? If this really happens, it cannot be a success in the roadmap or worse, it can delay the planned roadmap.. Thus, the roadmap should be more specific and thorough. As for the detailed budget breakdown, it is hard to believe that the only spending is focused on manufacturing expenses. It is possible that incurred costs can emerge, which is worth noting, during the manufacturing process, let alone marketing expenses. However, this lack does not mean that this project is unpromising, especially with assistance of an experienced and skillful team. These experts are capable of promoting the proposal's potential.", "q1r": 3, "q2": "The key metrics presented in the proposal are practical, comprehensive and can totally be indicators of success. They are correlated with the number of users and their attitude via surveys, and other related-user data. Therefore, it is conspicuous that the close relationship of success and users is significantly important. Besides, this information is in line with the proposer’s plan, showing his seriousness and effort in implementing the project. About the success that the project can bring, the proposer covered a lot of useful and sufficient information in terms of criteria of accomplishment, social impacts, convenience in distance, and so forth. All of them can positively, diversely and massively contribute to the living conditions in the remote areas of Africa, which is very persuasive to help the communities visualize the project outcomes.", "q2r": 5, "assessor": "z_assessor_1704", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2199, "q0": "It is a great project, looking to solve the problem from the root. It has excellent potential to help poor people access information and improve the quality of education in many developing nations. By definition, it may be more about building the foundation. Still, the effect it brings can go far beyond conventional Dapps. Therefore, I still consider this proposal to be entirely up to the challenge and significant impactful. (Rating given: 5).", "q0r": 5, "q1": "The technical solution offered is workable and has since been developed into an actual product. It would be perfect if an attached video showed how the Lokole box works in more detail. In addition, I recommend considering how to emphasize Cardano's role in bringing this product to communities, not just a part of the general digital library.\nFrom an economic point of view, the required amount and budget breakdown are perfectly reasonable. My suggestion is to consider and show the community how the project can generate income from local users and entrepreneurs so that it can scale.\nIn terms of personnel, the team is knowledgeable and experienced. The only thing I wonder is if the team needs more support or staff shortly. (Score given: 5).", "q1r": 5, "q2": "The information and solutions in this proposal are logical, convincing, and thoroughly documented. Roadmaps, milestones, KPIs are standard. It would be great if the team would specify areas and locations to send the first 100 boxes. (Score given: 5)", "q2r": 5, "assessor": "z_assessor_1459", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2314, "q0": "The impact of the challenge states that Lokole / Cardano Community Networks is a shareable system for connecting unconnected individuals and communities locally and with the world web.. This project can be human. change the game to expand and build a Daaps to connect the world community because 40% of the world's population can't access the internet due to poverty, building another online Dapp still won't reach be with them. Especially when the expansion process is as active as the current development program. The proposed team has a holistic view of the community and with that impact I will support this project ", "q0r": 5, "q1": "The proponents have substantial software engineering experience, so the plan is most likely to be successfully implemented. The budget of the proposal seems reasonable and detailed given the time it will be put in place. project.Lokole /Cardano Networks targets the African market, because its technology and operations are relevant.Powerful and responsive to the challenges mentioned here.Clarification about awards and how they will be distributed would be beneficial to the proposal..this technology on application-integrated registration system exists and it is currently being deployed across rich countries.why is it not implemented Because the people of these countries are poor and cannot afford the costs of activities like transmitting big data over the internet, etc.\nWith the team members and the experience that the feasibility of this project is guaranteed, I will support them.", "q1r": 5, "q2": "This proposal is a variation on the project \"Lokole Education Center in CONGO\", funded in Challenge 7.And challenge 8 they have enough information provided to audit the progress and success of the project. offer. The proposals have provided a roadmap of their progress, which will allow the community to track its development. There are also good key performance indicators of particular value that can provide insight into the success of a project. From the information in the proposal, it seems that the proponents will be transparent about the progress of the project, so I believe they will provide regular updates to the community. ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 3714, "q0": "Cardano has become essential part of today life which includes both as currency and stable economy development. The proposer suggests the very good idea of integrating his platform lokole with cardona to provide internet and other services to the poor nations. This is very helpful for the nation to grow economically and help them stand among other nations with the knowledge they gain by using this platform to access the internet at a very sustainable cost. The proposer has also mentioned that there are other technology on integrated registry systems applications which does the same application but his idea of making it cheaper for the poor economic countries stand out as the proposer uses compressed and encrypted SSH tunnel with appropriate authentication which reduces the bandwidth usage and will be more effective. The proposer has also mentioned about the security of data which will be provided and there will not be any data loss and data theft, hence the network is reliable. I strongly agree that for world to be a better place this application will serve its purpose.", "q0r": 5, "q1": "The proposer has already laid out the plan of work, they will consult experienced software developers who will be able to develope the network as required by the company and also to add the compression of data to save the bandwidth to make it affordable and and Cardano Ecosystem developers to share and learn how both topologies work. The proposer has also mentioned about the challenges/risks they will be facing during implementation of the project and also has the solutions to the problems addressed and hence I feel they are ready for the implementation of the project from all perspectives as they have laid out the budgetary plan for the course. The purpose of this application is for a social cause and I strongly believe the proposer will implement this succesfully.", "q1r": 4, "q2": "The proposer has request funds of 45000 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more users which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4056, "q0": "Congratulations on this very good idea and well written proposal. The problem statement is clear and the proposal points out solutions for it accordingly. The author has clearly explained the background reasons and also presented the usefulness level of the tool as well as Lokole device’s functions. Developing a device, which can help bring the Internet and advancements to developing countries, is actually very meaningful and crucial. I like the fact that it can give people opportunities to interact and get access to information and knowledge to improve their lives and the next generation’s education. I do believe that if there are more humane projects like this being funded, they will have a great impact on the Cardano Ecosystem since developers and contributors are motivated to create quality projects solving real problems for people living. Any technology has drawbacks, however, the team has actually converted the disadvantage of using cheap material and made it beneficial by giving the fact that if any particular part is broken, it can easily be replaced because that material is cheap and modular. I believe that this solution is smart and effective. They also give 2 more possible risks, which are cellular network failures and security and data privacy, then come up with detailed solutions for each. Besides, I have a minor suggestion that if the team can provide an approximate number of the device’s price, it would be better and increase the quality of the proposal. All in all, the proposal does address the challenge, engaging and scaling up local communities, possibly bringing new members, and has potential to raise different and fruitful results for the problem.", "q0r": 5, "q1": "There is a committed team with experience in such activities proposed. It is also possible to verify the information and members’ achievements due to the reference links provided. The team also gives some proof that their product positively impacts people’s lives to prove their point of actually having people and communities are willing to pay for the product, which I think is great since it helps strengthen the reliability of the project and increase the quality of the proposal. The timeplan is quite brief, concise and sensible since the whole plan is mainly divided into the last two quarters of 2022 and having one main task for each of the quarters. The budget breakdown is understandable. However, I think it would be better if the team can provide more information on the amount of money required for building each Lokole Box. For instance, which sum is needed for buying materials, which is for building and assembling parts, which is for hiring employees. In summary, the project seems feasible with a sensible plan and a budget allocation and a potential team with required abilities and experience to successfully carry out the project.", "q1r": 5, "q2": "There is a clear plan on how to execute the proposal, even though the road map is not presented in an usual manner, it is still possible to understand the development of the process. The KPIs of the proposal are not explicit, but they are mentioned in the text, which would be the number of accounts created, the number of active users and more might be achieved.", "q2r": 5, "assessor": "z_assessor_1702", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4399, "q0": "This is a very large community-based project, its core purpose and success will be to positively impact social inclusion and economic development in poor countries with no foundation to stand on sustainability, in particular countries in Africa. The main aim of the project is through the Lokole/Cardano community network to connect the unconnected individuals and communities locally and to the world web, reducing data costs for low-income people, opening up many opportunities for these people to have access to digital technologies and integrate with the development of society. The proposed team has done a good job of preparing for the successful implementation of the project, including surveying the project implementation area (Africa), assessing the potential and challenges of the work area, explaining the technique, presenting the core features and operating methods of the product. Risks and mitigation measures are also analyzed and presented in great detail, I appreciate it very much because the author has focused on reducing the risk of data loss and privacy for users, a big challenge that many dApp developers often fail to focus on, and mention in their projects. However, even though the proposer shows how to use the Lokole system, I still cannot determine if it is available, it would be nice if they could provide the link address of this system. Overall, the core idea is great, solves the problems of the challenge, so I'll give it 5 stars.", "q0r": 5, "q1": "Their project development plan is already full of necessary information such as timelines, key activities to take place, goals/products to be completed. However, it would be nice if they could provide us with a marketing and sales plan of 100 boxes of Lokole which includes information: what is the main marketing activity, what is the main region/country in Africa is marketing and sales of Lokole in schools and community centers will be implemented? As for the allocated budget, to increase the auditability of the project, they should provide the necessary costs to pay for equipment/personnel/working time to create a Lokole box. Regarding personnel, the proposer has made an effort to provide us with biographies of members and Linkedin profiles to validate what they describe. I realize that all members have multidisciplinary knowledge, working, and research experience that can ensure the good operation of the project.", "q1r": 4, "q2": "The auditability of this project is easy to check because they have provided us with two important information, firstly, the way for the community to update the progress and development of the project (via GitHub) and how they will do to measure project growth and user feedback (digital email-survey, check stats of our Lokole web app users, keep in regular communication with the ambassadors that are running Lokole -kiosks). However, I have yet to see them come up with a roadmap that includes the specific KPIs they target, which will help investors assess the feasibility of the project and determine what's the project can bring to the Cardano ecosystem. For their proposal, the KPI could be the number of people using the system, the number of Lokole boxes that they aim to achieve in a milestone.", "q2r": 4, "assessor": "z_assessor_1724", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7183, "q0": "It is not difficult to establish the alignment of the proposal with the goals of the challenge and with building better communities.  Putting the proposal in context, in one way or another the proposal will impact each of the UN Sustainable Development Goals and that is simply because the Internet access it will provide opens the door to education and interaction with the outside world. It opens the door to possibilities.  Easy and practical technology in the hands of people living in remote and socially, economically and geographically difficult areas. I agree, what is argued by the proposal can do the job. ", "q0r": 4, "q1": "Relative to Feasability,  these are the most important point in the proposal :\n\n- In the topology graphic and in the text of the proposal in general, the absence of the use of Cardano technology is notable and the proposal does not pose a near horizon in which the ecosystem technology will be used.  The active beneficiaries will be the communities (as Cardano ecosystem that is our purpose) but the passive beneficiaries will be the Amazons and Microsofts of the world without the heart, soul and skin (in the game) to engage a project like this.  I would like the proponents to set up plans to bring the Cardano ecosystem into the heart of the project, not just as funds provider. For example, traffic to our blockhain would be great for us.\n\n- About the plan and timeline for delivering the solution: 1) please provide more information about the manufacturing process in terms of activities and time per unit.  Describe the manufacturing process more widely. 2) If the Lokole boxes are gonna be sold, please provide information about the selling plans: price, destination of the sales money, type of client support post-selling that the proposal will provide to customers (how the customer can request technical service, type of guarantees over the product, etc).\n\n- About the detailed budget breakdown: 1) please provide a relation of the manufacturing activities and the rationals about the 50% Markup. 2) [$ 447.45 * 100 = $44745], [$45000 - $44745 = $255].  Please adjust the numbers.       \n", "q1r": 3, "q2": "I think the proponents are clearly open to the auditability process.  However, please build more specific KPIs that provide more quantitative information.  These KPIs could be based on the statistics of the Lokole web app (mentioned by the proposers in the auditability section: \"Check the statistics of the users of our Lokole web application (How many accounts have been created? How many are actively used? etc.). We will then be able to measure the number of people using Lokole and infer the increase in the number of people using ICT/email in remote areas in the most impoverished places in Africa.\"). If you have the data, you have the material to build more accurate measurement tools. The basic KPIs \"Number of Lokole devices manufactured per month\", \"Number of Lokole devices sold per month\", \"Number of users trained in the use of Lokole devices\" would do a great job. ", "q2r": 3, "assessor": "z_assessor_541", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8695, "q0": "The proposer has stated that the Lokole /Cardano community networks are a shareable system to connect the unconnected individuals and communities locally and to the world web.\nAddressing the challenge, the proposer has stated that this technology on integrated registry systems applications exist and it is currently implemented across wealthy nations, and can also be implemented in the poor nations as well.  Lokole network is an offline portable web and email network server which runs on a single board computer to provide an internet experience when offline in remote regions of developing countries around the world where data costs are prohibitive to the low income population. \nThis idea and proposal is awesome because it can and will solve many internet issues in the developing countries , thereby improving lives in remote areas of poor economies. \nThe main challenge /risks are theft or equipment damage from climate, cellular network failures, and security and data privacy issues. This proposal has addressed the challenge effectively. My rating is 4.", "q0r": 4, "q1": "The timeline in the proposal is clearly stated as Q3 and Q4 being the implementation period of the project, and also to market and sell 100 Lokole boxes to schools and community centers within the period stated.\nThe budget breakdown is detailed showing materials cost and productions costs. The total budget request of USD45000 is reasonable since each box will cost almost USD450 and therefore cab=n sell 100 boxes to 100 members of the community to improve their businesses and lives in general. \nThe team  is made up of 4 people with Nzola being the team lead. They have varied skills in full stack software developer, software engineering, automation technologies, etc. to make them capable of delivering. The information given in this proposal is likely to make implementation successful.\n", "q1r": 4, "q2": "The proposer states that all recordings will be on GitHub for reference; check statistics of Lokole web app the number of active users, the number of people using ICT/emails; conduct digital email-survey among Lokole users, keep regular communication with the ambassadors that are running Lokole kiosks, etc.\nSuccess of this project will be seen in multiple ways in which the innovation has impacted peoples' lives ; the students can participate in distance education via email; the sick who cannot walk to a clinic can receive a diagnosis from a remote doctor; local entrepreneurs can grow their businesses by reaching a wider captive market et. \nThis is a new proposal. \nI believe the information given is sufficient for successful auditing of this proposal. ", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10272, "q0": "This proposal makes a lot of sense. It minimizes the amount of data that is required to be transferred over an available internet connection which thereby reduces the cost of bandwidth on users and allows them to combine monetary resources to achieve better economies of scale when purchasing bandwidth. This has a positive impact on the lives of people in rural areas with poor living conditions. Everyone there can access blocks of knowledge including: algebra, history, chemistry,... without expensive bandwidth fees.", "q0r": 5, "q1": "Information about the team is very clear and transparent, the profile of each team member is also listed specifically (linkedin link). With the knowledge, skills, and experience provided, I believe this team is fully capable of carrying out the project. In particular, being born and raised in Africa, it helps you understand the difficulties and deprivations that people here have to endure. That increases the practicality of this project, getting to the heart of the matter.\nThe next job to do is to create 100 Lokole boxes with Cardado information, then market and sell them to schools and community centers. How will you market? Since the infrastructure (electricity, internet,...) is limited, I think you will face some difficulties in marketing. The budget is allocated specifically, the price of a Single Lokole Digital Box is quite reasonable ($447.45).\nIt seems that your device is getting a lot of positive feedback from the community: \"Already many non-governmental organizations in the DRC are keen to purchase the Lokole to make their operations more efficient.\",... This is good signal, foreshadowing a resounding success.", "q1r": 5, "q2": "You have identified the risks and challenges encountered in the implementation process (theft, damage,...) as well as how to solve it. This will be a necessary condition for the project to survive in the long run. Also, I've watched your videos on youtube, I've seen the product. It looks compact and easy to use.\nThe information provided is enough for anyone to judge the success of this project. If it gets funded, I'm sure it will be a huge success. From there, it will have a great impact on rural areas, supporting economic development, hunger eradication and poverty reduction. Thank you for a great proposal!", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Lokole/Cardano Community Networks are a shareable system to connect the unconnected individuals and communities locally and to the world web", "experience": " I was born and raised in Africa, lived and worked in many African countries. I have now been living in North America. I am a professional electronics technician. I conducted many radio communications projects in different countries. I now work for the Canadian Defense Dep (Navy)"}