{"id": 400038, "author": "rohingyaproject", "title": "Learn & Earn for Refugees", "url": "https://cardano.ideascale.com/a/dtd/400038-48088", "category": 26435, "amount": 80000, "description": "Rohingya and other refugees lack formal education and financial access in refugee camps and host countries, leading to social inclusion.", "f6_no_assessments": 6, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 2402, "q0": "Solving the problem of refugees is never easy. A country with a lot of refugees will slow down its development, and theft will increase. With an idea Inspire a learning culture for refugees. I think this is a very good idea. in the group proposal raised the plight of the Rohingya people, the issues raised were very relevant to the challenge and it solved the problems of the future challenge. The solutions the team came up with were very specific. Hosted courses, providing an introduction to blockchain, and tokenomics, as part of their pre-stub course. I found the solutions that the group offered very reasonable, it solved the problems of the challenge. The solutions have also been studied and argued quite specifically, besides that, every project must have certain risks. In this section, the group has raised three main ideas. it's digital literacy, Internet and computer access, and Course Keeping, and also outlines methods to deal with those risks, so I think it makes sense, but I want to add is. the lives of refugees are very difficult, they also have to take care of problems such as food and money, so convincing them to spend time studying is very difficult. In addition, their economy is very difficult, so the means for them to access technology are also very difficult", "q0r": 4, "q1": "with the section providing the plan and time. The group has identified specific milestones as. divided into four main phases. In each stage there are specific goals to be achieved. will be completed in about 24 months. I find with the above timeline, and having been divided into such small stages, it is very reasonable. I believe that with this time, the group will complete the set tasks. The progress of the project is also quite easily tracked by the community. with a budget of 10% of the total challenge budget. has been subdivided into five subheadings. So I think it makes perfect sense. I just want to add that. The group needs to have a contingency plan in case of lack of capital. with presentations about team members. I see the group has listed four members who are experts who have been assigned to each specific job. with many years of experience and seniority in the field. I think the scheme is very detailed. However, their identity is not easy to track and verify by the community", "q1r": 4, "q2": "in the description of measuring progress and development. The group has given specific measurement indicators that are. There are 4 metrics. The indicators all have a clear goal of having 8-10 courses completed by the end of the year, at least 70-80 refugees enrolled, and the ADA Reward Token distributed as a reward for course progression. I think doing it this way will attract refugees in Africa to study. In the description, I see that the group has mentioned certain successes such as. maintain a large number of participants in the courses, and be connected with job opportunities, towards establishing a viable value ecosystem for refugees. I find the success of the project very connected regarding campaign challenges. it will change lives for refugees. However, this project is still an idea and has not been tested. this is a new project so it has not been funded yet, but I find this project very interesting and meaningful. need to be developed and voted for for the project to come into reality", "q2r": 4, "assessor": "z_assessor_1486", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4117, "q0": "According to the proposal team, it is essential to create a secure digital social and financial inclusion platform for the Rohingya population because of the desire to improve the lack of formal education and financial access in refugee camps. thereby leading to social integration. I strongly support this idea and believe that this will be a promising project to accelerate the development of the Cardano ecosystem.\nResearching and understanding the Rohingya community, the proposal team conceived of a project that provides a foundation of education and skills development services. The features of the platform were clearly stated by the proposers. The goal is to target stateless refugees. The presentation of the proposal is very specific, meeting the requirements of the challenge. The solution section is very detailed and explains the technical aspects in depth. In addition, the proposal also presents very clearly how the project works and the impact on the potential audience that the project is aimed at.\nThe results that the project expects to achieve are generally consistent with the key metrics of the challenge. The results are described very specifically and presented in a way that is easy to grasp. Each part, each stage of the KPIs proposed by the project is presented very clearly. This helps the project to be appreciated in terms of its impact on the refugee community in particular and the Cardano ecosystem in general.\nDigital Literacy, Internet and computer access, and Course retention are the three main challenges the project will likely face in its implementation. The team has carefully researched these difficulties and proposed appropriate solutions to be ready to cope.", "q0r": 5, "q1": "The project is divided into 2 phases with set timelines for completing detailed work items. The project implementation roadmap is very clear, providing an overview of the project's development progress. Viewers can easily assess the suitability of the plan for the project's goals. The work items are described specifically the requirements upon completion and explain in-depth the technical and technological aspects required to implement the project.\nThe basic spending plan has shown a reasonable budget allocation and is consistent with the detailed plan set out. The proposal refers to the number of people required to complete the project. Therefore, I think the budget plan should be more specific in terms of expenditure items including the part to pay staff salaries.\nThe project brings together people with specialized knowledge and skills in the fields needed to develop the project. Under their leadership, the project promises to bring desirable results and will have the potential to grow the Cardano community.", "q1r": 4, "q2": "Project development is measured by items with specific numbers. This is great for the community to track project progress and gauge how successful the project is. The specific numbers show that the team has seriously implemented the goals set out in the proposal.\nThe success of the project is clearly stated in the maintenance of the courses of the participants. This is also one of the challenges that the proposers mentioned above. However, with a reasonable solution, the team will achieve the expected success.", "q2r": 5, "assessor": "z_assessor_1709", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4238, "q0": "The Rohingya project this time is divided into 3 services including R-Academy, R-ID, and R-Coin with different but closely related functions. In particular, I really like the feature they intend to implement of R-Academy. Instead of focusing primarily on educating Rohingya refugees, the proposer also provides opportunities for people interested in learning about this little country to learn. This not only preserves but also promotes the Rohingya traditional culture without investing a lot of money. In addition, the use of ADA coins in R-coin service for rewards such as gift vouchers and necessaries for life is also a good idea. Ensuring that the number of users using the service does not have a deficit, as well as increasing the amount of ADA being traded. However, 1 of the 3 solutions proposed by the proposer mentioned at the end makes me feel that it is still not really suitable for that challenge. Being refugees means that they can hardly connect to the world via the internet or laptops, so providing data for them to access remotely is almost impossible. Instead, the proposer should come up with another option, say a cheap laptop rental periodically, and the user will return it by ADA in the wallet", "q0r": 4, "q1": "The proposal divided the project into two major stages, the first of which focused solely on R-Academy services and ended within 8 months. Furthermore, in the following more than a year, in addition to the development of R-Academy, the proposer will deploy the remaining two services to assist the upkeep of the project's primary features. As far as I can tell, this is a reasonable strategy, and the timelines are appropriate for the project. Because to carry out such a plan, they already have a lineup with bright members from many fields. They have, in particular, Muhammad Noor, the executive director and a Rohingya who has been successful in developing apprentices and teaching pupils. Even that academy is highly appreciated by the people of the home country for its long-term contributions. This advantage, obviously, will greatly assist in improving the quality of R-Academy services. Finally, they have a clear strategy for how they will spend and use the money for each activity. And I have nothing to add to this part.", "q1r": 5, "q2": "I enjoy how they provide particular statistics on each course and the number of participants to help with the assessment process more accurate. This is really rare compared to other projects. However, I continue to encourage them to add extra completion dates in order to receive a higher grade from the experts. Also, for the success they anticipate, I only need the proposer to underline the advantages to the Cardano community for the duration of this project's operation. With just adding the factors mentioned, I believe the project will do well in the appraisal process", "q2r": 3, "assessor": "z_assessor_1713", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7584, "q0": "The Rohingya and other lack of formal education and access to finance in refugee camps and host countries, leading to social inclusion. I understand this project will support training and job opportunities in the financial/blockchain sector for citizens of poor countries who have to go as refugees. This also helps to expand the community that knows and participates in Cardano in general. The solution is to create a secure digital social and financial inclusion platform that provides services required by the Rohingya. R-Academy: Community-developed skills and education services provided virtually, due to the denial or underfunding of formal services in refugee camps and host countries, providing social inclusion.\nR-ID: A secure Blockchain ID, due to the undocumented status of many stateless refugees, providing proof of claim and access to the platform.\nR-Coin: Tokens to incentivize refugee learning on the platform and can be exchanged for services, with an initial reward offering to be provided in ADA coins directly to refugee participants. Detailed information is sent in 3 attachments with quite a complete description. . The proponent also highlights 3 risks and offers limited solutions. Should additional risks be added after training, how the development of the trained people will be, how can the outcome of their knowledge as well as their development be assessed?.", "q0r": 3, "q1": "The roadmap is implemented in 2 phases in a period of 24 months and the tasks will be performed in detail according to the months with the goals to be achieved. 24 months is also quite long and some tasks can be done in parallel. . The proposed cost rules (Online Training, Rewards and Certifications $35,000 / Tutor and Teacher Fees $25,000) needs to be appropriate in more detail what the rewards are and how the bonus is planned, teacher fees Also need to add clearly how to calculate. The team has 4 main members with clear experience and skills in the field and assigned positions, but it is difficult to identify because there is no link to each member's social networking site. I recommend the group publicize their information so that the community can easily contact the group.", "q1r": 4, "q2": "The team started 3 metrics but there is an ADA Reward Token index distributed as a reward I think should be changed to the number of people who will receive the ADA Reward Token. The success of the project aspires to blockchain and tokenomics education for refugees as an important trendsetting experience and a first step towards establishing a viable value ecosystem for refugees.", "q2r": 3, "assessor": "z_assessor_610", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8063, "q0": "I believe that this project will have a big impact on the Rohingya people around the world. This idea will not just give them the tool to access the knowledge and living skills by their R--Academy, by also the learn and earn feature will help to enhance their life. The content of the proposal also detailed clearly the course in their first phase that impacts Rohingya people reasonably step by step. These courses will provide the basic environments, skills for their audience to go further in the future and I think they're the most necessary things in their first phase. So, this project really impacts the challenge because it affects a lot of Rohingya in hard situations in dozen countries around the world as the proposer described. Moreover, the learn-to-earn model is one of the most important features that will motivate them for a better life. This will increase the adopter to Cardano community and transaction. The proposer also shows some challenges and short strategies to over them, but one of them is a general problem that they should think more about the solution because they're really hard. ", "q0r": 5, "q1": "The content shows clearly the milestone and some key activities in their road to go. These milestones are suitable with what they describe above the solution sessions. But I hope that they can give us more detail about which parts of their roadmap will cost how much money. I really don't know the required budget is used for which timeframe. If it will be used for the whole of their roadmap, I believe that it's insufficient, for ex: platform development. The key actor of their team and their experiences I believe that it's enough to start this project, moreover, they also have experience in their pilot programs in 2019 and 2020. Hence I believe that they can make it. ", "q1r": 4, "q2": "They're determined on their vision for this project. They have a clear concept about what they will do and inspire KPIs to help the community that I believe they can get them. They also have a clear roadmap with milestones in the feasibility session that can help track them well. But I hope that the team can provide some tool, place for the community to audit their goals. ", "q2r": 4, "assessor": "z_assessor_651", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9132, "q0": "This proposal is an integral part of the efforts that the Rohingya leading innovators have spearheaded to fight for the most elementary rights to be given to the Rohingyas, namely identity. It is for me, and I am sure for the majority of people who were born under the normal circumstances of a nation state, almost incomprehensible to make sense of the fact that people can be refused identities… which gives a whole new dimension to this project and to the social impact that blockchain technologies can have. In this regard Atala Prism, the self-sovereign identity product that IOG has developed becomes an existential technology for the Rohingya population. I could not imagine a proposal more appropriate for addressing the challenge.", "q0r": 5, "q1": "The elements that are determinant for the success of this proposal have been thoroughly thought by the proponents. The details of the plan are abundant and clear. The education focus transpires from the curriculum for the educational process aiming to elevate the Rohingya population by giving them access to knowledge of the empowering technologies that will support them to take full control of their lives, starting with the economic identities.", "q1r": 5, "q2": "The specially dedicated \"Auditability\" section of the proposal provides clearly all the milestones and measures of success that can be envisioned at this stage.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Inspire a learning culture among Rohingya and other refugee communities through online skills delivery and a tokenomic reward system", "experience": "After our pilot programs on token rewards and conducting courses for refugees in 2019 and 2020, we are now combining skills delivery with token incentivization as we expand our R-Academy for Rohingya and other refugees in Malaysia and Bangladesh."}