{"id": 400234, "author": "fsamvura", "title": "Genealogy registry in Goma, DRCongo", "url": "https://cardano.ideascale.com/a/dtd/400234-48088", "category": 26435, "amount": 18600, "description": "Dem. Rep. of Congo is one of a handful of countries with no national ID implementation. Crypto Know-Your-Customer is thus unachievable", "f6_no_assessments": 9, "f6_rating": 4.518518518518518, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=13267"], "media": [], "f6_assessments": [{"id": 1074, "q0": "This is a well-thought-out proposal about an oft-overlooked part of the world that could some day prove to be important beyond the proposer's wildest dreams. It's a fascinating innovation to try and synergize family genealogy in DRC with the utility of Atala Prism. The potential applications for nation-building are both direct and immediate, with possible long-term developments possible due to positive attention it could bring in from major organizations.", "q0r": 5, "q1": "The price tag is more than reasonable for such an ambitious project, which looks like it is organized in a creative way (offering early bird bonuses to young adults with tokenized DIDs). The roadmap has some reasonable milestones set and the team appears to have a few accomplishments under the belt building Cardano in the developing world and this is a logical next step.", "q1r": 5, "q2": "These are active community members and they propose multiple methods for reporting on their progress, should the proposal receive community approval. So the auditability of this project looks strong.\n\nThe YouTube series could turn out to be a highlight for the community in the long run (and you can see the video linked in the proposal for a taste.)", "q2r": 5, "assessor": "z_assessor_1275", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1285, "q0": "This is right at the core of the challenge to build dApps for nation building. Identification is central to citizenship. The history someone can build by having a recorded identity opens up many opportunities for more financial well being.\n\nThis proposal seeks to use Cardano native tools - Atala Prism - to build a national ID system in a decentralized way where the individual is responsible for providing their ID information themselves. This project is exactly the type of project that can be replicated in other countries after it gets going in Congo.", "q0r": 5, "q1": "This appears to be one of those rare \"right place, right time, right people\" convergences. The team members are from the community, have been trained by community programs, is in a targeted region - Africa.\n\nThe team understands the problem and has the tools to create a solution. They have strong ties to the community which will help develop the trust necessary to gather people's personal information. \n\nPeople want digital identities and this project is well suited to provide them to the people of Congo, and beyond.", "q1r": 5, "q2": "Between the youtube updates and the website the project provides ways for community members to audit and monitor the project. \n\nThe goals and metrics are clear enough to be audited and have some flexibility to allow for changes to the plan. \n\nSome of the metrics are number of people participating and how many records get digitized. These are measurable mileposts and are sufficient to audit the progress and success of the project.", "q2r": 5, "assessor": "z_assessor_1336", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 1909, "q0": "The authors properly describe how several initiatives of UN and World-Bank 'failed to generate reliable public administrative capabilities' in D.R. Congo. This is despite Congo being on the verge of becoming the strongest emerging market in Africa.\nThe proposal lays out that the intention of a governmental member to create a blockchain linked genealogy, could be the catalyst for the proposed DApp and hence foster the growth of Cardano in Africa.\nThe KPI align closely with the participation goals of the given challenge.\nIf the proposal succeeds then it could be a role model for other nations or even world wide adoption.", "q0r": 5, "q1": "Each team member provides information that underline its capabilities.\nSome of the items could have been described a more in detail or visually connected. E.g. it is not entirely clear on first site to what the on-boarding sites relate. It will clear up once the reader jump back to the roadmap.\nOverall the budgeting to create a MVP including Marketing and onboarding seems reasonable and is broken down in digestible chunks.\nAs the proposal suggests being a MVP, the voter can expect to see another proposal to strengthen the positive learnings of implementing DIDs as first level proof-of-identification.\nWhile the chunks are reasonable broken down, it could be explained how they tie together on a timetable (what will be done at the simultaneously, what will be done subsequentially).\nAs previous attempts from established organizations already have failed, the proposal lays out the main concerns being reliable adoption, valid data caused by fluid family structures, and system interoperability.", "q1r": 4, "q2": "The problem is stated well while the solution summary is striking.\nThe proposal makes (also the western) reader aware of how the lack of a national ID affects the underbanked even in Crypto;\nand broadens the sense on how Atala-Prism could foster the underbanked by tackling the lack of a national ID.\nTherefore it is an excellent example off a summary in conjunction with the given challenge.\nThe team is an active group of four students and trainers in the Cardano Ecosystem and comprises the field of Business, Computer Science.\nWithin Cardano they are involved as Plutus Pioneers, Stakepool operators and are active Atala-Prism participants.\nThe budgets are appropriately laid out .\nEven though it is just a small part of the requested funds, the proposal also considers legal advice, which I personally find is too little acknowledged in other proposals.\nApart from the aforementioned the roadmap and budget are concise, reasonable and generally clearly expressed.\nMetrics are well defined and YouTube-protocols will update the stakeholders frequently.\nThe proposal could be leveled at SDG 3, 8, and 16. It is to mention that the authors responsibly pick up criticism against DID, the potential abuse of DID, and how 'by the people for the people'-projects could reduces biases.", "q2r": 4, "assessor": "z_assessor_1426", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4241, "q0": "For a country that cannot afford to access national ID, the DID is proposed by this project will be more feasible. Because one of the international organizations has its headquarters in Goma, as the proposer stated, the usage of DID is even more significant and required. The initiative primarily focuses on issuing DIDs to residents in Goma, DCR, particularly young people, allowing them to obtain a driver's license or use it for voting. Further, the government intends to utilize Dapp for storage, so if this project is successful, it would undoubtedly bring Cardano a lot of value, such as growing the number of Dapp users or the Goma Cardano Hub gaining notoriety from many people here. Everything, however, is great except for the remedy offered by the proposer. It's not quite obvious yet, and I believe it won't be appropriate to address the issue in the future. So, attempt to discover another approach by conducting a further study that will assist the project in receiving approval as quickly as possible.", "q0r": 4, "q1": "The project has succeeded in dividing the project plan into 2 areas including roadmap and milestones, which are hard to find in many other projects. For the roadmap, the proposer provides full information along with a very detailed month-by-month implementation period. As for milestones, besides setting up DID for people in Goma, the project mentions 5000 early birds who join are helped to create their DID at the Wada Hubs and receive tokenized DID free-of-charge, a very specific number. Even how they intend to spend the funds is demonstrated with clarity and appropriation. Moreover, the project will be conducted by a team of reputable and experienced staff. However, I note that the proposer includes marketing charges in the budget breakdown section, but I have not seen anyone on the team who is capable of managing this. If the proposer does not intend to hire extra marketing professionals, they should explain how they intend to spend the $1500, whether through social media or government assistance", "q1r": 5, "q2": "I hope the proposer could include a timeframe for the project's progress. Difficulty tracking and wrongly evaluating progress are the consequences of missing this important milestone. Nonetheless, I appreciate their thorough listing of the project's accomplishments. It is ideally suited to the project's aim and function. My only regret is that if they discuss more Cardano's virtues, it would attract more investors", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4894, "q0": "\"The proposal starts with an impressive list of proposer's experiences relating to Cardano ecosystem and Cardano Local Community Center. The impact description part is well written with an introduction to the context and the current issue of the community from which the project is born. The solution is described with a comprehensible list of requirements; nevertheless, this part could be better and clearer if the proposer can provide more specific information about the product and how it works technically. \nThe linkage of the solution and the challenge is clearly showed as the proposer lists out and explain carefully key metrics of the challenge and how this proposal achieve those metrics. They show a very high potential of developing and bringing positive impacts on the Cardano ecosystem. The proposal also gains another plus point in creating impact by demonstrating how the product can serve the commnunity through the 'Timely solution' and 'Commercially viable' parts. \nIn addition, rather than just giving the foreseen challenges, this proposal also offers solution for those risks, which is another strong point.\"", "q0r": 4, "q1": "\"The proposer has done a very good roadmap and milestones. The roadmap is extremely detailed with time duration for each step, which matches well with the milestones below. The budget breakdown part seems to be quite logical, clear and specific enough. \nThe highlight of this part is the introduction of their team members and their experiences. All of them are learning or have learnt Plutus and Haskell, and have relevant experiences relating to Cardano ecosystem. They also possess capacities to be able to implement the project. For example, Akilimali has the ability to develop front-end and back-end design that's in need to building their app. Paul can create and issue DIDs and seems to know well about Atala-Prism, on which they based to develop their DIDs. In general, their abilities are evidently showed with strong connections to Cardano ecosystem and that makes this proposal a strongly viable one.\"", "q1r": 5, "q2": "\"For this part, the proposer has given some quite visible products that can be utilized to measure their project in the future such as the videos or the website. Howerver, this part could have been done better if it is more quantitative. They can give some more details about the project's results matching with the roadmap and the milestones mentioned earlier in the feasibility part. \nThe SDG rating part is a minor plus point for this proposal.\"", "q2r": 4, "assessor": "z_assessor_1796", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7190, "q0": "Not only is the proposal aligned with the objectives of the Nation Building Dapps challenge and the UN Sustainable Development Goals, if one reads the proposal carefully one realizes their willingness to dive into the depths of the problem they wish to address.  Their victory will mean a better world for all.  A triumph for the human spirit. \n\nBased on the proposal, it could be stated that they know how to attack the monster (for ex. “On-board high school students at final examination centers”) and that they have a long-term view of benefits (for ex. \"Identification at a young age allows a user to build a credit history or any other reputation-based assets\").  Also, the proponents put in the battlefield of the proposal the Cardano ecosystem, so for better or worse, as a community we will be involved (it is not a secret that many proposals seek mainly funds for their own projects and want to keep Cardano away from the action and why not say it, from the benefits).  \n ", "q0r": 5, "q1": "- Mrs. and Mr. Voter: after being CA in several funds and witnessing budget figures 3 and even 4 times higher in proposals of this type, a warm feeling began to run through me. Then, when watching the video in which the proposers record the process of purchasing an HP server, even the moment in which the salesman makes the invoice, my suspicions were confirmed: we are dealing with serious people here. If people are willing to record in detail, on video, their budget spending process, it is because they really want to honor their commitments.  It may seem a bit over the top (videotaping a purchase, taking it so seriously that it goes so far as to set it to music) but in my world, that's called having all the skin in the game at a level of heat so high that it can incinerate to the bone marrow.  And although it may not seem like it, these things are not about the money.     \n\n- As I said, the budget with respect to numbers and description is well defined.  The Roadmap describes a proper rationale, which makes the activities described make sense to each other.", "q1r": 5, "q2": "My recommendation to the proponents: complement the measurement elements you are providing with more precise KPIs, which put in the hands of the auditors real sharp performance measurement tools.  “Family linkages extending beyond second generation in the first 3 months” is an example.\n  \n", "q2r": 3, "assessor": "z_assessor_541", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7939, "q0": "Congo is one of the few countries without identification. A group of young people want to use the benefits from Atala Prism to create a citizen information management technology on this local blockchain. The absence of identification will deprive a citizen of a lot of the rights that a citizen is entitled to, hinder the management of citizens, and create conditions for criminal activities that cannot be controlled. In a country with a large population but still underdeveloped in technology, this is an important step forward.", "q0r": 4, "q1": "\"I agree with your ideas, but the plan and details of your technology solutions need to be more convincing. In particular, I wonder why you guys put the policy that each user wallet needs to allocate 1 ADA, because ADA is the foundation coin, it is not an NFT for information management. You can easily spend the issuance of tokens as NFTs to manage user information, at a super cheap cost.\nIn addition, there are only a few member profiles here, so, that doesn't say anything, you need to detail member experience, or previous jobs, or current qualifications. Since this determines the feasibility of the project, you only get paid when you actually complete the work.\"", "q1r": 5, "q2": "Through meetings and processes, catalyst is the solution you offer to demonstrate the project progress. For me this is not enough, you need to have your own website, have a channel to post project code and be ready for the community to check or use it to spread the application. In addition, reports need to be detailed after each month/quarter period and sent back to receive funding. Hope you will improve your working team and idea plan.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8464, "q0": "This proposal suggests idea about national ID implementation in Congo in Africa by Atala Prism which offers reliable DID solution for genealogy tree maps. A country without nation ID might be out of control and could lead to various issues in citizen management, crime increase, and civil right problems. Therefore, this project is necessary for Congo country in the future. I hope this project could help young citizens get access to blockchain technology. ", "q0r": 4, "q1": "This proposal includes group of young-spirit students with background in computer science and interest in blockchain technology. However, this team do not show rich experience which helps community to assess the feasibility of the project. The proposer provides quite clear roadmap and milestone and required budget. My concern is why each wallet is allocated 1 ada insteading of Token issuance to manage user info at low cost. After all, I appreciate their idea of bringing changes to their Congo country. ", "q1r": 4, "q2": "The tracking of this project could be possible when their website and youtube channel are available. However, these channels are not available until now. I would like to see more done works from the proposal and team members which shows their seriousness in implementing this project.  Besides, community could check their work development on Github and updates from Catalyst meetings. ", "q2r": 3, "assessor": "z_assessor_678", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 9775, "q0": "This proposal address the tasks of challenge. It benefits many people in the Congo especially when combined with government agencies. The use of DID for personal identification can also open the door to connecting with many different systems based on this platform.\nBuilding this system on the blockchain platform helps it develop faster with very low initial infrastructure investment costs. This will help the community know more about Cardano and the cost of this project's services will become much cheaper. In the long-term run, the system can operate itself from service fee, then it can be expanded to many other countries and regions.\nThis project promises to develop very strongly and create many opportunities for many people.\n", "q0r": 5, "q1": "The proposal is presented in detail and professional way with specific roadmaps. The milestones have specific results, so it's easy to track and evaluate the results of this project\nThe proposal’s team with the leader having a lot of experience in developing front-end and back-end systems as well as operating Cardano’s stake pool. Other members with experience in programming Haskell and Plutus will make it easier to build smart contracts on dApps. Some of them are Wada members, which is also a plus point.\nThe budget is properly allocated; the costs are separated into each specific job with a clear and detailed presentation. \nThe construction of the font-end and back-end may needs more time as this is dApp with many extensions later on.\n", "q1r": 5, "q2": "The jobs are listed in detail and have clear completion milestones, easy to follow to each specific job. I see the clarity in the workflow and the team with a lot of professional experience in the field of blockchain and Haskell /Plutus programming will be an advantage for this project.\nThe budget is clearly allocated. The costs are reasonable for the jobs and personnel.\n", "q2r": 5, "assessor": "z_assessor_759", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Atala Prism can offer reliable DID solution in Goma by offering genealogy tree maps. DIDs self-owned and transfered to children are viable.", "experience": "Goma Cardano Hub:\nRegular Haskell and Plutus training since Sep 2020Goma Cardano Stake Pool running several Testnet Nodes in Goma4 developpers and technical professionalPlutus and Atala-Prism Project based learningWeekly meet-up since Oct 2020 to promote Cardano Blockchain"}