{"id": 400251, "author": "fsamvura", "title": "Mining traceability in a war zone", "url": "https://cardano.ideascale.com/a/dtd/400251-48088", "category": 26435, "amount": 25000, "description": " The DRC has strategic mining reserves: GOLD, Coltan, cobalt, uranium whose exploitation does not benefit the population following smuggling", "f6_no_assessments": 7, "f6_rating": 4.3809523809523805, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=15058"], "media": [], "f6_assessments": [{"id": 1075, "q0": "This proposal is a clever application of Cardano's blockchain tech for addressing a real-world injustice that few people are even aware of. I believe Google has been working on something similar called Minespider (https://www.minespider.com/). This could turn out to be a very productive project that could help DRC establish new practices to ensure the mineral resources in their country become local wealth, which is more-or-less exactly what this Challenge is looking for. \n\nHowever, since this is a new issue to so many people, a little more education from the proposers might help strengthen the argument behind its impact statement. The proposers could tell us a little about how mineral tracking works, practically and scientifically, and share a source or two on the subject. Still, this doesn't detract much from the proposal, which describes the issue and their resolution with decent clarity.", "q0r": 4, "q1": "The roadmap is well-composed, and includes reasonable goals for this ambitious project. The asking price of $25k is reasonable, the budget breakdown is good (though I'd like to see more detail on exactly how the proposers plan to onboard miners. Are they going to go direct to the mines or mining communities and simply offer the tool door-to-door?) The team has solid experience for such a project. ", "q1r": 4, "q2": "I'm very much liking the idea of using their YouTube channel and regular videos to routinely update the community on progress, with visual proof. This could turn into something that not only improves the community's capacity to audit the project but, if successful, help strengthen Cardano's international reputation. Otherwise the proposers offer to do all the tasks for complimenting auditing efforts that one could reasonably expect.", "q2r": 5, "assessor": "z_assessor_1275", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1983, "q0": "This proposal is aligned with the Challenge statement as it is trying to solve one of the Democratic Republic of Congo’s (DRC) national problems in the mining industry. Due to the smuggling and violence, the small-scale miners in DRC are not getting a fair price and the payment made by the foreign sellers is largely going to the intermediaries. The proposer wants to establish blockchain-based mining traceability in the mining industry in the Democratic Republic of Congo.\nBlockchain-based traceability solutions are being explored worldwide in supply chain systems. But Cardano has an extra edge over other blockchains, especially in ‘supply chain’ related matters. The Cardano blockchain apart from being the best also has 'Atala prism identity solution', which will help in establishing good traceability by utilizing the Atala Prism.  \nThis proposal will have a good influence in DRC as well as in Africa if the proposer can successfully implement and help the small miners and quarry operators in obtaining the maximum benefits.", "q0r": 5, "q1": "The team appears to have the experience required to develop the software for the proposal. They have a good plan to map quarries, and register/onboard the miners & quarry operators. The team’s skills and experience can be checked on their given LinkedIn profiles but it is skipped for a few members.\nThe roadmap specified in the proposal is on monthly basis with the tasks to be accomplished in those months. I think it will be better if more details are provided and the plan can be broken down into weeks, which will assist in tracking the progress.\nThe provided budget is reasonable and it is broken down into specific tasks to be done. I suggest the tasks be broken down and allotted to the concerned team members who are supposed to do them. Then the fund required by a specific member along with the funds required to acquire the resources can be written beside them. \nThe proposer seems to be aware of the risks and challenges posed by this proposal but I have my skepticism about the onboarding process and violence. Hopefully, the marketing will help in the onboarding process.\nReflecting on the above facts the proposal is likely to be executed successfully.\n", "q1r": 4, "q2": "The proposal can be audited by following the proposal’s progress on Youtube videos, Github repository, and website with quarry and project details. The proposer will update all the progress statuses on all these portals. But as I mentioned above if the proposer can split the tasks among the team members and then provide the funds required by each member to achieve the tasks it will help the auditor to audit/track the progress with specifics.\nThe milestones are laid out such as mapping of quarries, issuance of Decentralized identities, issuance of Cardano-based certificates, onboarding of miners and quarry operators. All these can also be tracked for performance evaluation.\nThe delivery dates are provided in months which starts in April post-funding and ends in Aug-2022 with proposal execution. As I suggest these deliverables should be split into weeks with more details for active tracking. Otherwise, the timeframe seems to be reasonable for the execution of this proposal.", "q2r": 4, "assessor": "z_assessor_1444", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3378, "q0": "The team has described the main goal of the solution to create a DApp for the traceability of minerals by using blockchain technology. Following the alignment with Challenge KPIs, they clearly identify the main features of the project and how they gonna address the posed challenge. The outcomes of their project are expected to contribute to the growth of the Cardano community. The proposal also provides some useful local insights, helping the team prove the necessity and potential development of their solution. This will help the community get a broad overview of their project and assess its impacts on the Cardano ecosystem in general.\nThe main risks along with some strategic solutions are displayed in the proposal. This helps them decrease the liability and lengthen the life of the project. Good risk management as mentioned is also a solid base for the community to evaluate the team’s ability to operate the project and maybe to be more interested in working with them.\n", "q0r": 5, "q1": "A very detailed roadmap and milestones are provided in the action plan. This is very helpful for the team to organize the work and set clear deliverables for each period of time. By looking at this roadmap, the community can determine the accomplishments and have a clear view of the project’s development at all times.\nBy providing a detailed budget breakdown, the proposers have enabled the community to effectively track expenses and follow their plans. These spendings are also in tune with their delivery plan, ensuring the clarity and effectiveness of their financial allocations.\nThe team members are well portrayed, covering their current positions, considerable working experiences, and LinkedIn accounts. The community can access reference links that are included for further consideration. They make a strong team with qualified members, which will bring benefits to the project operation. \n", "q1r": 5, "q2": "Some important outcomes to assess the progress and identify the development of the project have been illustrated in the proposal. These promising results are directly linked with the objectives of the project, allowing the community to closely follow the development path. There are also updates provided by the team through Catalyst meetings and sites, guaranteeing the timeliness and regularity of information. The visibility of the project’s success has been well built via specific goals. They know the probability of its success, which empowers them to stay focused and follow a clear direction to get the best of the project. \n", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4118, "q0": "The situation of illegal mineral exploitation does not bring benefits to the people. The proposal team proposes a solution to create a DApp for traceability of minerals to reduce smuggling. I think this idea will get a lot of support and I personally love the idea.\nThe proposal has proposed a solution but has not yet outlined detailed product features and functions. Proposers should also state how the project will work. The solution should be technically described or use case studies as explanatory examples of how the project works. At the same time, the proposal should also clearly state how this project affects the potential audience, thereby showing the impact of the project on the Cardano ecosystem.\nThe project's KPIs set out in detail each part of each stage. Proposers have clearly shown that the relationship between the project's KPIs and the challenge's Key metrics is completely consistent. The desired project outcomes are also specifically mentioned. Readers can clearly visualize the impact of the project on the Cardano ecosystem community.\nThe proposal team has predicted two main challenges when implementing the project: Integration of certification and Tracing. The team has clearly analyzed these possible risks, thereby providing appropriate solutions for the above problems.", "q0r": 4, "q1": "The roadmap proposed by the project is very clear and specific to every detail. The roadmap outlines the realistic timeline for completing work items. Technological and technical aspects are also covered for those work categories. Important milestones are also presented very clearly. This proves the potential of the team to complete the goals according to the set schedule.\nThe budget plan is laid out in great detail. The proposal has indicated the necessary locations to implement the project. The budget is broken down very well into the investment items and presented in a very easy-to-follow way with bullet points. This makes it easy for viewers to get an overview of the project's blueprint. In general, the budget is reasonable with the original plan.\nThe project is led and developed by an experienced management team. With the experience and knowledge that the management team has, the project promises to bring expected results. Furthermore, the profile of managers that the project provides will also add credibility to the project.", "q1r": 5, "q2": "It is a bit difficult to evaluate when the project does not provide clear quantitative indicators. Please visualize the specific numbers when the successful project will be obtained. This will demonstrate that the team is seriously pursuing the set goals and make it easy for the community to follow throughout the project's progress.\nThe success of the project is also clearly defined by the proposal team by the results that the project promises to achieve. This provides the community with direction to evaluate project outcomes. In general, the proposed project results are completely consistent with the detailed plan.", "q2r": 5, "assessor": "z_assessor_1709", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4242, "q0": "The only missing point that I don't see in this section is how it will directly affect the Cardano ecosystem, what benefits the community will gain. For the rest, all ideas are carefully considered before recommending this project. With the goal of eradicating mineral smuggling in DCR, the proposal allows small-scale artisanal miners to register at a quarry and will receive a certificate for their work. This not only helps small miners make money but also helps buyers ensure the quality of the product through mineral traceability. Furthermore, the way they approach potential future issues is incredibly sensible and reasonable. Specifically, in the case that the operator wants to move the working place to another, the proposer can also meet. Miners have since remained certified at the new place as well as the application maintaining the number of users. So, just to reiterate what I said previously, the initiative will undoubtedly be praised by specialists.", "q0r": 4, "q1": "Having stated that, I don't want to modify or add any specifics in the project's feasibility stage. Despite the lengthy project schedule, which is divided into five phases and concludes in January 2023, no detail is extraneous. For August 2022, the proposer is dedicated to modifying manufacturer DIDs to ensure authentic information, thereby avoiding being cheated or profiting from scammers. To do this, they recruit individuals with master's degrees and graduates from prestigious colleges. One of them, in particular, kicked off the project by gathering crucial information regarding small-scale miners who would be onboarded, demonstrating that with approval, the entire team would be ready to begin the project in no time. Even the spending budget is filled with important information. Perhaps, I wish the proposer could break down specific numbers for each action, although I know this is quite difficult.", "q1r": 5, "q2": "Maybe the project will be more complete if the proposer adds a timeline in the measure the progress and the development of the project section. The lack of a specific time period will make the project not an accurate assessment of the level of success as well as development progress. In addition, the proposal has my complete agreement when it comes to the successes they expect. All the ideas mentioned in this section I believe are possible with the specific plan they mentioned in the previous section. Even so, the impact on the Cardano ecosystem is not present until the end of the post. So I hope the proposer will soon find out its positive effects on this community.", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7940, "q0": "An idea that allows traceability of minerals, ore deposits, precious resources through information management technology on blockchain. In any country, fighting resource exploitation and smuggling is not easy, and almost impossible for poor, technologically weak countries in Africa. The promotion of commercial transaction transparency, asset management through blockchain opens a more reliable future for mankind in this field. So these ideas I highly recommend.", "q0r": 5, "q1": "\"I agree with your ideas about managing national resource information using blockchain technology. However, I do not sympathize when you only mention a few member names without a detailed introduction of work experience, or any evidence for a person's profile.\nMoreover, the technology solution you come up with is a completely new idea, without any actual research, nor does it give details of the technology you apply to implement it.\nYou need to add these details to be able to receive support from the community.\"", "q1r": 5, "q2": "Protecting national resources on blockchain is an urgent matter. However, you need to understand the local laws, have to shake hands with the government to do the same. Also need a period of time to research and test the technology. And all that information must be public, reportable, have a verifiable code in order to receive funding. Hope you will improve the content better in the next rounds.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8465, "q0": "The proposal and team members are based in Congo, Africa where illegal mining of minerals happens. Therefore, they suggest creating a Dapp on Cardano for the traceability of minerals to fight with smuggling through certification of mining quarries and small-scale miners. I support their idea in this field as exploitation of minerals is a hot issues around the world and especially in poor countries without technology assess. ", "q0r": 4, "q1": "Although I support their idea, the proposer and team members do not show much of their related experience as it this project requires deep understanding in law, government collaboration. Also, the proposal is still at the idea phase without showing any pratical or done jobs to show your seriousness and confidence. I hope the proposer could explain more about their technology to implement the project in the next round. ", "q1r": 3, "q2": "Well, as the proposal is still at the idea phrase so the website or youtube channels for updates are not available at present. Besides, community could check Catalyst meetings or on Github for updates. However, Iwould like to see more pratical tasks in technology from the proposer to show their deep research and seriousness. ", "q2r": 3, "assessor": "z_assessor_678", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Create a DApp on Cardano for the traceability of minerals through the certification of mining quarries & artisanal small-scale miners (ASM)", "experience": "Goma Cardano Hub:\nRegular Haskell and Plutus training since Sep 2020Goma Cardano Stake Pool running several Testnet Nodes in Goma4 developpers and technical professionalPlutus and Atala-Prism Project based learningWeekly meet-up since Oct 2020 to promote Cardano Blockchain"}