{"id": 400207, "author": "adiuvat", "title": "ADIUVAT: Find your place.", "url": "https://cardano.ideascale.com/a/dtd/400207-48088", "category": 26435, "amount": 76100, "description": "Sedentary digital user, content consumer, and little purchasing power: replaces life situations that strengthen the human spirit as juncture", "f6_no_assessments": 9, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem described in this proposal is aligned with the challenge, Although Cardano has, it is important to note that, The proposed solution is intended to facilitate, The metrics/indicators/KPIs", "q0r": 5, "q1": "“First of all, Stakeboard is already a project in full development and with several deliverables completed before\nreceive financing from Catalyst, which indicates a reliable and productive team”\nInformation about the team, the described experiences and the work already\ndone, The budget breakdown\ndescribes 3 elements, there are few details about, The definition of $5,000 for\n\"UX\" seems vague to me, I would like to see\nmore details indicating the amount of work for each step/time required x the corresponding remuneration.\nI think the amount requested is reasonable,\n”The plan itself does not present great technical complexity or barriers,\n The only point that I see as a risk and that raises doubts about the viability of the\nmarket is", "q1r": 4, "q2": "Claridad, solución y cómo se alinea\nFacilitan la auditoría de la propuesta.\nSe eligieron bien las métricas y los KPI y creo que son buenos indicadores para evaluar el éxito, ya que los resultados \nelegidos indicarían claramente la cantidad de usuarios", "q2r": 5, "assessor": "z_assessor_1582", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The proposal is actually good for cardano implementation. Adiuvat talks about registering businesses, that is to say that they will be in charge of promoting registrations of establishments in their system, which they promote as bubbles on the map. I think of this as if I open the Application and there are bubbles of businesses or establishments that are open and accept my TIPS token, when I open each bubble I can see the content that the trade creates or the experiences that have been made, which seem to be cheap at be based on human principles...\nAdiuvat raises the current systemic problems such as debt, inflation and scarcity to determine that the lower-middle class has little purchasing power and therefore when they leave, they spend their resources on activities that are the first step of the Maslow pyramid (psychological source) ... With this, they seek that each business registered in the Dapp encourages the user to use ADIUVAT so that the service or experience is more economical and complete (that is to say that in addition to eating, at the same time I can participate in an activity where I can interact and earn at a similar cost), they speak of each social category so that each company administrator can create their Partner profile (have their bubble).\nFor the added value: The experience, ADIUVAT allows each registered user to apply as a Talent and to communicate with an establishment to create content/experience in the service. Products are not created but it is a service that connects peers, so it is a worked system and it is not an idea out of nowhere because it feeds back into itself, that is, the work is actually outlined: Enroll businesses to their terms and conditions and developing the Dapp and tips. But what I love the most is that your TIPS token will be accepted on every trade and exchange so Cardano network usage will explode. ADIUVAT is a brand in itself that could make me enter with my native cardano token to every bubble in every part of the world, so I am a decentralized user!", "q0r": 5, "q1": "Adiuvat presents not only his idea but also the website, the prototype of his Dapp, visuals, his YouTube channel and all the networks that we habitually use, they know that the budget is initial and that they will then have to risk it according to the value generated. of his company, his metrics are realistic and focus on two specific situations: The legalization of his token to operate in exchanges and register businesses to the waiting list that will position them. It is a realistic and achievable plan over time, they do not leave the context and they know the KPI metrics to advance step by step, it is clear that the future of ADIUVAT is very clear, these guys have impressed me.", "q1r": 5, "q2": "If it is enough, the data of the team and the scope expected by it is absolutely measurable, that is, if they hire 20 people to register at least 4 businesses a day each, in 3 months their database could be valued at 6000 or more, 4 deals seem like very little to me in 8 business hours but it makes them look conservative so they are committed to impressing. The prototype of the Dapp through the youtube video is easy to elaborate (I am a Software engineer) and the tips under cardano can actually be the global payment method, I like its generic name. They promised not to deliver everything but what is necessary to get the project off the ground. I searched for the aforementioned JIRA tool and it is a management tool that can help the CEO to see everything from a big picture, and that is not all, cardano can to be there. I suppose that to generate the decentralized world we need everyday use cases and I definitely prefer to do it in a simple way like when I order a car with Uber.", "q2r": 5, "assessor": "z_assessor_1646", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposers have  effectively got the insight of their targeted customers (people looking for a casual outing), thus offering a very detailed solution. They have described how their solution (Adiuvat) works, the key features, and the main functionalities. Using the decentralized technologies in their project, they genuinely increase the number of Dapps users, registry accounts and generate Dapps impact on economic development. Furthermore, they intend to develop a token in the Cardano blockchain to help clients control their assets, making their Adiuvat’s impact far-reaching. \nThey make it very clear about the types of problems and then how they gonna address these problems with their Adiuvat. Several sources of the problem are provided in both form blogs and books, allowing the community to have a broad view of their solution. Their website is also included in the proposal, enabling the community to easily access and review their platform. \nThey have illustrated the main challenges they have to confront during the operation process. Together with the Cardano network, they are able to address these nicely and mitigate the potential losses in the future. Their presented plan in the proposal empowers the community to precisely assess their ability and initiatives in risk management.", "q0r": 5, "q1": "The proposers reveal their vision for hiring staff in the future including technical experts and lawyers who take care of the legal issue. The action plan has been divided into specific milestones coming with the expected deliverables. Based on this plan, the community can evaluate the effectiveness of their implementation process and track the accomplishments of the project. The community can also detect any delay that may happen and at the same time foster adjustments if needed. \nTheir budget is split into some main sections as follows: asset rotation (2 systems engineers and 2 layers), external operators cost, service employees (20 people), and the cost for increasing the waiting list. These spendings are fine-tuned according to their delivery plan, ensuring the transparency of their financial allocations. \nApart from the hired force, the team members are mentioned in the proposal with some basic information and their occupations. However, it would be better if they could provide some relevant working experiences or skills of their members. Instead of some personal social media such as Facebook or Instagram accounts, they can replace by LinkedIn accounts. These contact addresses will help them look more professional and the community can also have more information to evaluate their ability to run this project.\n", "q1r": 5, "q2": "To measure the progress and the development of the project, they will use a task management tool (JIRA), which can be managed by both Cardano and Adiuvat. This can help the team increase the reliability of the report and assure the clarity of the audit program. A small suggestion from me is that they can give a brief description of the main features as well as some key metrics of this tool. Reading this description will help the community clearly visualize the tracking strategies and identify the specific statistics to evaluate the development of the project.\nTheir goals for remarkable success have been firmly set in the proposal. These outcomes are expected to successfully achieve the key metrics of the challenge. Their vision of success will keep them motivated and stay focused, which can directly benefit them in the execution process. \n", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Your opening is super interesting and a bit funny but it leads to a very creative application (Adiuvat). I am very impressed with it. You have explained very well the application you intend to develop. How it works and its goals have been explained in great detail. In addition, other aspects have also been carefully analyzed. In general, the required parts of a proposal are covered.", "q0r": 5, "q1": "Your roadmap and timeline are extremely detailed and easy to understand. With this roadmap, I highly appreciate the feasibility of the project. You have explained very well how each grant will be distributed and used. However, I think it would be better if you present it in a different layout so that it can be easier for viewers to grasp. Because, if presented as in the proposal, it takes me a while to read before I can grasp the information. Still, I appreciate your thoughtfulness in explaining the matter. Your team members are still at a relatively young age. Hope with talent, passion and enthusiasm, you will contribute to the success of the project.", "q1r": 5, "q2": "I am very much looking forward to the success of this project because your description of success is very appealing. The project is expected to bring many benefits to users and also Cardano. According to what you mentioned, JIRA will be a tool for monitoring progress as well as setting tasks. In general, all information is provided in full.", "q2r": 5, "assessor": "z_assessor_1725", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Generally, I believe the plan meets the challenge, and I personally like the idea. By spending native tokens. a service decide what suitable for us to do can help save time in this fast life. But in order to establish a relationship/registration by each social business around the world, Adiuvat intends to position itself on the Web in a forceful way. So Audiuvat is not a real product and by utilizing other platforms, Adiuvat will spread faster around the world. However, there are risks that have a negative impact on Adiuvat, such as Crypto Restrictions, and the proposer will provide a management plan to address these. It would be fantastic if the proposer could incorporate this management plan into the roadmap. According to the proposer, businesses must hold 9 events every month, accept crypto currency, and be trained to produce Dapps. I am curious whether there is too many conditions for those searching for a casual outing and business to register to Adiuvat or not, and what the strategy is to attract users to this platform. I think the proposer is overly focused on external sales forces, and the rewards users receive are not proportional to the effort expended because Adiuvat is still in its early stages and lacks resources.", "q0r": 4, "q1": "The roadmap is extremely detailed in terms of the timeline but not in terms of the plan. I expect the proposer to provide more information on what work needs to be done in order to achieve those goals. For example, what kind of employees or members do they expect in June 2022, and how do they plan to complete the website, have the token available, and implement the process of making contact with neuroclinicians, psychologists, and sociologists? This plan must show how the task will be completed within the specified time frame. The budget breakdown, on the other hand, seems reasonable. It is meticulously measured and divided into three major categories. The budget breakdown would be easier to follow if the proposer synthesized and summarized all costs into bullet points. And I note that the team members are fairly young and have little expertise in the field, but they are described as being highly enthusiastic about this project. They shown considerable competence and ambition in developing this plan, and they did a good job in terms of budget breakdown as well as identification of future risks.", "q1r": 4, "q2": "Though I admire you for having a long-term vision with annual plans, there is a lack of information regarding the auditability components of this proposal. The proposer can refer back to the roadmap and provide some metrics that will be useful in auditing the proposal. For example, how many businesses the proposer planned to register with Audiuvat. What was the process for using JIRA to measure goals, and what goals were to be measured? The community will based on these information to audit the proposal so it need to be more informative.", "q2r": 3, "assessor": "z_assessor_1934", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The project aims to deliver a dApp tied to a native token that could be used to buy things in shops but also to get extra experiences and entertainment. It’s an ambitious project ideated by a team of three young people that want to create a service with the scale of Ubber or Netflix. The proposed dApp is planned to have plenty of features such as a way to find commerce globally, see other people in those places, interact with them, join scheduled activities, payment systems, and much more. They planned to mint 1 billion tokens and launch an IPO. It is clear that the spirit fits with the goals of the Challenge however there are some aspects that the challenge have specifically stipulated that are not met. First of all, the team has a great idea but they have no proven experience. Minimum challenge requirement is a small team with relevant background, and for that case the project should be considered as a research with a budget capped at USD10000. That’s my main reason for giving a low score in this section. I strongly recommend to this passionate team to keep developing the idea and convert it into a feasible plan. That initial step could be the development of a whitepaper detailing how the tokenomics will work. Also I recommend scoping the project in small phases, where activities can be planned with more details. Joining a mentorship program would be really useful to help organize and move from a great idea to a project plan.", "q0r": 3, "q1": "There are several missing parts of the project that make it difficult to be qualified as a feasible project. That does not mean that the idea is not feasible, I’m just mentioning that the project needs to be developed with more details to make us feel confident that it can be executed successfully. I’m pointing some of these missing pieces as references for the proposers to improve. First of all, a project of that size needs to be backed up with some expertise or previous experience; one suggestion is to team with others. Secondly, big projects are hard to tackle, it would be more appropriate to go in little steps with the full project goal at the end. A final suggestion is to develop a detailed project plan, with a list of concrete tasks that need to be achieved, estimating duration and costs. Putting all the details is not an easy task, you may find it useful looking for guidance and mentoring in the community.", "q1r": 2, "q2": "The project has a roadmap with some big outcomes, but gives no detail of what are the deliverables as a result of the requested budget. Tracking and auditing long term projects is difficult. And complexity is added when there’s a plan to mint tokens, create legal entities, inscribe as regulated financial institutions and hire many employers. As described before, I consider that this proposal is a great idea that needs to be developed further. A recommendation to the team is to explore all the missing parts, find help and split the project into small pieces. For example, a smart project can be the research of one of those topics that require more elaboration. Other option is to hire someone with the knowledge.", "q2r": 2, "assessor": "z_assessor_554", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Our declarations are based on four components: the desired result (people who will have a pleasant, complete and economic informal exit) while the problem of blockage (the little purchasing power as a result of inflation, debt and scarcity at a global level) is addressed. the costs of the problem (which are defined in the departments of: Software/token, fees and external sales force) are quantitatively described in our proposal.\nThe evidence shown from official sources such as Reuters, the World Bank and the International Monetary Fund, as well as books presented so that the essence of the problem can be understood based on the current USD debt system, give us a robust reason in terms of context.\n\nOur solution solves a fundamental problem that can mark the new course towards economic and human development in a decentralized manner. The comments that there is no need for a token under this system proves that the tester does not take into account the context of decentralization that the Cardano community yearns for.\n\nOur solution includes an explanation of competitive advantages such as having physical establishments in the cardano network, promoting content and p2p interaction of people through Realization and fulfillment experiences, being decentralized and highly interactive in the real world. It is an App delivery!\n\nAs Founders: We bring our personal experience and work history to the project by presenting a brand that has a management, commercial and globally scalable system, demonstrating that at the time of founding the model, only work on the general objectives described in the proposal should be worked on. The objectives are rooted: Have the token and the necessary legal documents (2 developers and 2 lawyers with their respective technology and necessary documentation such as the presentation of trademark, chamber and commerce documents, financial superintendence of Colombia and national registry of issuers) to carry out an IPO (Initial Public Offering on exchanges such as Binance or coinbase), a database (registered by our 10 external sales force operators) with businesses waiting to be bubbles on the map and an elaborate game plan by our operational team (20 people) who are waiting to have an organization founded by Catalyst elevator.. All this was included in the proposal.\nWe reject the enticements that we are young but deeply understand your desire to know more about us. We also long to be able to really belong to the Cardano tribe, we gave our social networks in order to imply that we are not Robots, we attached the Linkedln of our CEO to establish a better contact but we hope that by being founded we can have a good and a great impact on participation in the ecosystem.\nOur idea/project is of the type: Commercial development.\na roadmap and a needs analysis is presented so that only those objectives should be focused on, which will be drawn up in JIRA for the project audit. First of all. Our solution works because it adheres to the global reality of growing Apps deliveries due to the covid 19 pandemic, purchasing power has been reduced: This means that when they leave, they concentrate their activities on the first step of the Maslow pyramid, which is food, shelter and sex. Maslow's pyramid is a psychological instrument that measures human needs, for this reason, Maslow's pyramid shows us how people choose priorities. And the data from the sources shows how they are chained to the first step. (sources cited and displayed)\n\nThe market that we have identified has not been previously accessed or prioritized by the Cardano community and can be a real catalyst for network use since the token will benefit merchants by eliminating intermediary costs.\n\nOur roadmap towards user and platform acquisition is clear and well thought out.\nOur monopoly is that the businesses on the waiting list (of which we expect 6,000 after 3 months of operation) of 10 people who sign up at least 4 a day, in a work shift of 8 hours a day, which will be incentivized with the minimum payment + boificacion for registration in our country) must comply with terms and conditions (described in the proposal) in which the establishment must hold a minimum of 9 events per month, They must accept the token as a means of payment, encourage people to use ADIUVAT to access and be open to talk with any talent that wants to apply to develop an activity on your site.\nIt is understood that you can start working immediately once the funds are received because we make it clear that our management system is separated by departments which are described and can be classified in the JIRA audit tool. This is where our 3-month resolution to have a legal token to help us finance ourselves to finish the Dapp, hire ZenDesk for customer support, etc. comes into play. with a waiting list that allows us to sustain the value generated. in addition to the game plan that will help us train establishments as proactive creators of experiences and content in their establishments and the Dapp.\n\nKPIs:\nAcquired users we will go looking for them for three months of work of which 6000 are specifically expected (described in the proposal\nProduct capacity built is defined as the established brand, the legal documents to make an OPA (Described), waiting list of merchants (described) and internal operation of the service (also described)\nREFERENCE POINT OF PERFORMANCE ACHIEVED measurable in the JIRA work tool which has defined the specific and general objectives for three months of work\nNetwork stability achieved in 3 months of measurable work on the TIPS Token, DAPP prototype and website.\n\nDefinition of Success identified.\nAbout cannabis, we only emphasize that there will be bubbles (establishments) that tolerate this type of product that is being legalized everywhere globally. We will cater to these types of consumers as well."}, {"q0": "Creating an application for information about entertainment, dining, travel... is not a new idea. However, it is completely not on the blockchain - where information is secure and transparent, not manipulated because it cannot be edited or deleted. Therefore, applications that move from practical dapps to blockchain applications to manage data will save resources and human resources, and promote the global economy in a more civilized direction to serve humanity. A lot of documents are cited for further reference, I am impressed by this.", "q0r": 5, "q1": "The team plans in detail for 2 years, has a clear personnel record. I appreciate the detail, and the ability to manage the work of the writer of the proposal, compared to many other proposals this is quite sketchy. You know how to combine with experts and technicians as well as psychologists, and people with experience in information management dapps like a Grab company. These are the good factors that pushed this project to its planned execution.", "q1r": 5, "q2": "Work progress reports will be available on JIRA: A convenient task management tool. It is the number one tool in Software development, for planning, monitoring and distributing workgroup tasks. I appreciate this transparency. In addition, you should share on a public code website so that the community has the opportunity to learn. Because that's the general culture of the cardano platform.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "The proposal suggests idea about creating decentralized application that delivers services to users on Cardano blockchain. As far as I'm concerned, there are many application providing services for customers, but, not on blockchain where information could not be changed or manipulated. Therefore, this project helps to bring positive effects to the world economy and human. ", "q0r": 4, "q1": "It is a big project and the proposer gives a two years plan and clear timeline for each task. Also, this is a very young team members, but shows their diverse background and experience in law, technology, design. Moreover, the proposer asks for an amount of funding for company operation and explain this cost for each task. I appreciate their passion,  efforts and confidence to carry out this project.  ", "q1r": 4, "q2": "We can track the progress of project on JIRA-task management tool in Software development to plan, monitor and distribute the tasks of Adiuvat team. The community could check development by visiting their website, social media channels too. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "In my understanding, this proposal builds a dApp on the Cardano platform, in the form of P2P. It allows end users to find and apply to the best activities near their locations; bring pleasant and homely habits to users. It will connect end users and service providers in transactions at reasonable costs while removing the middle-man and advertising costs. This dApp works in many fields from fashion, cosmetics, places, healthcare, medical, etc... dApp towards Web3.0, promoting interaction between users and service providers to increase trust between them.\nThis dApp also has its own token to make transactions on this platform. They focus on game theory to offer low-cost transactions without focusing on specific product development (similar to uber, grab,...)\nThis is a very good proposal. if successful it will be one of the dApps running on a decentralized platform with a very large number of users everywhere. It will help the community to recognize Cardano a lot. The huge transactions on dApp will also help Cardano grow further. This is a proposal fit for the challenge.\n", "q0r": 4, "q1": "Although this proposal is presented very well, however the team members’ information isnot enough to ensure the transparency and potential completion of this project. The proposer should provide additional information such as working experience /profile in LinkedIn /Telegram ..etc… \nIt is recommended the proposer to cooperate with experienced personnel such as Project Managers, Experts on Haskell, Plutus, Marketing, etc… \nAlso, I want to know more how the proposal attracts and develops its network of service providers and users.\nRefer to the budget, I have not seen cost allocation in details? It will be better with a list of specific jobs with performance-based costs and numbers with timelines, so it's easier to evaluate the proposal results.\n", "q1r": 3, "q2": "This is maybe a good idea, but I need committed results with detailed enumeration: number of users, registered service providers, daily web viewers by timelines.\nBetter to have proposer’s profile to be given so that the evaluator can easily contact /support to complete the requirements of the challenge. In addition, the budget should also be listed clealy in details according to the work results.\n", "q2r": 4, "assessor": "z_assessor_759", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Connect experiences to people through commercial establishments with content based on human principles a bit or no extra cost to basic p2p.", "experience": "Want to go out today? Are you going to eat, drink, have a coffee or see an event? search our Dapp that is online around you and the world. we have an added value for each thing you choose to do that'll make you look beyond basic consumption. Can be alone, couple or family/friends"}