{"id": 400588, "author": "mavster04", "title": "Modern Hospital Management System", "url": "https://cardano.ideascale.com/a/dtd/400588-48088", "category": 26435, "amount": 63500, "description": "Hospitals in developing countries still use inadequate systems. It also lacks security, data privacy, and interoperability.", "f6_no_assessments": 9, "f6_rating": 3.9629629629629637, "videos": [], "media": [], "f6_assessments": [{"id": 1910, "q0": "By developing an easy deployment of technical infrastructure for healthcare within a few clicks, the proposal addresses the improvement health coverage - as a part goal of SDG3.\nThe platform will integrate its private side-chain into the Cardano blockchain and developers will get incentives to create smart contract templates and open-source them to others via the smart contract platform of Clarity. This could really ease the entry-barrier for developers. The how it will integrate into Cardano could have been more elaborated in the proposal itself.\nKey-metrics and goals do support the project thesis in alignment with the challenge settings.\nThe foundation for the proposed System is already set, and the attached API promises further growth for the future.", "q0r": 4, "q1": "The team of Clear Contracts is working with MLabs and has already been funded in previous catalyst rounds. The team also has other (funded) proposals ongoing. The given links are show-casing a landing-page, a demo-CMS, the current status-quo of HIE (Health Information Exchange) in a whitepaper, and explainer videos of how the Hippocrades platform will work as an infrasctructure as a service (iaaS).\nThe core team comprises of one experienced IT-management founder and three technicals. They complement each other as full-stack in frontend, backend, server, and relevant blockchain skills.\nWith a total headcount of 10 and a pool of tech consultants the team should be well prepared to tackle the technical challenges. Above that the team has been working since the last 5 years on digital health care projects.\nBudget and and breakdown on team members are given in an identifiable manner.\nThe budget is reasonable as rates are more calculated like wages. The contrary would be a US/EU consultant day-rate of several hundreds.\nIf the team is continuing to deliver on this round as on the previous rounds. I would highly expect an additional round of funding in F9.\nThe timetable is well structured and set at a modest pace. But this modesty is sourced from the stated drawbacks, as the team suffered from Covid cases during the execution phase.\nImplementation follows a good development cycle-flow lead by agile methods.\nThe resources are focusing on describing the needed man power, running costs for infrastructure are currently not given.\nIf you are reading the whitepaper and know the focus of MLabs, then you could potentially derive the technicals. However, this could be addressed a bit clearer in the proposal and if it is just to make it the technical reading more inconvenient for reader.\nThe team greatly loops back on unforeseen challenges since the last round and now implements a more conservative timeline. However, as progress and growth continue it could be argued that legal constraints should be considered as well.", "q1r": 4, "q2": "Problem and the solution are well summarized and at present a great fit for the current challenge to create nation wide solutions for Cardano. One of the biggest challenges Cardano currently faces is the adoption of Haskell and Plutus. The eased onboarding process for developers via the Clarity smart contract framework could have already been mentioned in the summary. The major concerns which should be addressed as early as possible is if and how the team wants to move its infrastructure to a decentralized state. The debate is happening in the whitepaper.\nThe writers clearly state that the team already has experience within the area of digital healthcare, decentralized infrastructures, and Cardano.\nThe baseline for the requested funds is later properly outlined in the roadmap.\nThe proposal provides a seven months roadmap with measurable milestones in months one, three and six.\nThose milestones align very well with the evolution within the challenge to build Cardano into an accessible ecosystem.\nIf I understood it right, Hippocrades is based on the Clarity smart contract framework, thus basing the given metrics on adoption, user activity and retention seem to be the right KPI. Especially the expected increase of open source projects can be a transparent KPI. The proposal lays out that other metrics will be explored.\nTo provide more clarity the proposal could have provided stronger details about the current status-quo of Health Information Exchange in Blockchains. For new readers this would have provided an even stronger foundation for the development thesis and the underlying issues.\nThe proposal is describing a template system that enables developers to upload reusable smart contracts. Everytime one of these smart contracts is getting called, a small fee will be forwarded to the developer. This incentivizes building and open-sourcing projects within the Cardano ecosystem. This seems to be a quite unique and vauable approach.", "q2r": 4, "assessor": "z_assessor_1426", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 2406, "q0": "As life is developing, the needs of hospital services are also being paid more attention. Everyone knows that systems, security, and data are currently overloaded with the idea of ​​a modern hospital management system that is secure, private, interoperable and works with the chain. Cardano blocks. is a very good idea. In the description of the group solution, the current difficulties are mentioned, namely, At least 400 million people do not have basic health care and 40% lack social protection. and solutions to that problem by offering a series of solutions as mentioned in the article. I found the problems raised very well, it answered the questions that the challenge posed. I think this idea should be extended as it is suitable for future challenges. in the description of how to solve group challenges have given specific methods I see these solutions have solved the problems of future challenges, besides a good project there is always a good project. potential risks that the group may face, I see here that the group has not mentioned many risks and has not stated clearly about the plan to deal with risks but only in general. I would like to add that to do this will require a huge cost", "q0r": 4, "q1": "when to provide about the plan and time. I see the team has given a clear timeline, which is 7 months. and is divided into 4 different stages, the stages have been divided in detail with each sub-category, I think with this timeline is reasonable to complete the proposed work. The progress of the project is also quite easily tracked by the community. with your budget presentation. with a budget of less than 10% of the total challenge budget, and has been broken down into 4 phases. I find that very reasonable. I see that the group has not yet outlined contingency plans in case the budget needs to be supplemented. with a team of more than 10 members who have been assigned specific tasks for each member. The team members are all leading experts in each field. They have advanced degrees and a lot of experience in the profession. I believe that with a strong team of members, it will solve all problems in the proposal, but I see that the group has not provided a link to track and verify each member.", "q1r": 4, "q2": "refer to the measurement and development part of the project. I see the group has outlined specific metrics. that is in the past 5 years the team has built healthcare applications, and has very good development. The development is shown in the description. Indicators are easily checked. The success of the project was clearly described in the proposal. I find the success of the project very much related to the issues in the challenge. this is really a continuation of a previously funded project in Catalyst this is a good project. I hope the project will receive many votes in favor. I believe the project will have great success in the future.", "q2r": 3, "assessor": "z_assessor_1486", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3720, "q0": "An efficient health care system can contribute to a significant part of a country's economy, development, and industrialization. Health care is conventionally regarded as an important determinant in promoting the general physical and mental health and well-being of people around the world. The proposer has uniquely identified the need for Modern hospital management system and has also worked towards the implementation which is impressive and it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has also mentioned the key metrics which will be helpful in the success of this proposal. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 5, "q1": "The proposer has a very innovative idea of introducing Modern hospital management system and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and his team seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. he proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 63500 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more buyers which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4060, "q0": "This proposal is very well-written and effectively addresses the challenge. I can see the real value in this project since it provides a modern hospital management system that is secure, private, interoperable, and also works with the Cardano blockchain. By using this system, any nations or healthcare organizations can create and set up healthcare infrastructure and no longer have to build a separate hospital application or solution. If this proposal is successfully funded, it could provide an impact on hospitals in developing countries still using inadequate systems which are not securable and interoperable. Medical information is inherently personal and leaking that info can cause significant emotional and sometimes physical harm. The protection of this personal information is essential to any deployment and this proposal has it all. Besides, it also brings the interoperability with existing medical systems, which is necessary for mass adoption. I have no doubt that if successful, this project can be a game changer.", "q0r": 5, "q1": "Starting with the team presentation, an extensive description of each team member is made, so that we can know their identities, their roles in the project, their experience and achievements and so on. They also provide some reference links for verification purposes. The team seems to be very well prepared, having the necessary technical capability to carry out the project successfully. They have had a previous project to get funded and successfully developed Health Tech Infrastructure on the Hippocrades platform for local and national governments, which strengthen the credibility and competence of the team. There is a timeline presenting the details of actions that will be carried out, which I find to be reasonable. And about the budget list, i think it is pretty well broken down. It is basically about the salaries of professionals and also hosting fees, so we know who would earn how much and by how much it would be multiplied in terms of time.", "q1r": 5, "q2": "This proposal clearly describes 5 deliverables.The indications for success are also relevant and align with the challenge. The team also provides a social platform where voters and the community can track their development. One extra suggestion is that if there had been a roadmap with milestones and estimated time frames added then merged with the KPI info, I think that would increase the quality of the proposal.", "q2r": 5, "assessor": "z_assessor_1702", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4246, "q0": "To talk about the highlight of the project, they develop a system on an existing platform called Hippocrades. As stated by the proposer, Hippocrades is a system that assists local or national governments in swiftly developing and deploying powerful health technology infrastructure in their jurisdictions, including features such as electronic medical records (EMR), clinic management, and pharmacy management systems. This is a strong foundation, in my opinion, that is ideal for the development of a modern hospital management system. The proposal also specifies up to 72 characteristics that the new system will include. That is an incredible figure for a management system. Despite the integration with the Cardano blockchain, I have not yet seen the proposer point out the positive effects of the project on this community. This is rather unfortunate for such a well-planned project. Also, I don't quite agree with them that they can only predict one challenge in the future. Perhaps, investing a little more time researching the proposer will find out, avoiding hindering the success of the project", "q0r": 4, "q1": "The proposer proposes to finish the system in seven months, including four significant milestones. Phases 2 and 3 include QA and internal testing, which is a feature I really enjoy. As a result, the system will be refined based on both internal and external ideas, improving flaws while retaining strengths. Plus, the staff is likewise of very high caliber. They have Hippocrades inventors and programmers, therefore developing a new system on this platform is not difficult at all. The proposal specifies that the funding is divided according to each member's salary over a period of 3 to 7 months. Although this is not a bad idea, proposers should offer a description of what the money entails. For example, if a team leader is paid 1.5T per month, the proposer should specify what the team leader will perform and how much money will be paid for each of those actions. This will ensure that investors are happy with how the project intends to spend its funds", "q1r": 4, "q2": "There are two crucial sections missing, thus I'm only giving them 3/5 on the part. The first is a timeframe for project development progress evaluation. The proposal just said that they would monitor and manage the operation without specifying how they would do so. For example, how long did it take them to create stable code, simple code, and other steps? Secondly, I still can't envision the success forecast provided by the proposer at the conclusion. It is quite confusing and does not get to the heart of the section's criteria, as well as lacking what the project's success would offer to the Cardano ecosystem", "q2r": 3, "assessor": "z_assessor_1713", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5219, "q0": "This proposal is too detailed. By that I don't mean there's too much transparency in the proposal. There is a lot of information that is not necessary to the evaluation of funding. Furthermore, the amount requested is extreme compared to the impact of what this funding is supposed to accomplish. If I understand it correctly, they are requesting $63500 just to create the app that corresponds with an already completed website. While the proposal sounds important, I'm not convinced that it warrants the requested amount with the information provided. ", "q0r": 2, "q1": "They provide lots of links to products that have been completed, and they give brief bios for each of the team members (I would prefer LinkedIn profiles). My issue is they give a roadmap/timeframe that describes what is done in that timeframe and how much money is spent. However, it doesn't give any detail on what that money is spent on in that timeframe. With this amount of money, I definitely need those details to consider. ", "q1r": 1, "q2": "There's got to be more quantifiable KPIs that can be listed here. I get the sense that the only real demonstration of success is the completed product. I'd like to see data on how much the completed product is being used. That would be a solid start.", "q2r": 2, "assessor": "z_assessor_1896", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7587, "q0": "Hospitals in developing countries still use suitable systems. It also lacks security, data privacy, and interoperability. Proposing a solution to build a secure, private, modern hospital management system that can interact and work with the Cardano blockchain. This is essential to personalize the patient-managed health check-up system. A lot of blockchain applications have been developed and for Cardano, there are also a lot of solution ideas already in the works. This proposal is up to the challenge and can be extended to use in all countries. The Hippocrates team built a decentralized healthcare infrastructure for Cardano. The team was selected in the first batch of the Arab/Ipaddis Incubator program in Africa supported by Cardano. The solution will continue to build a Web3.0 Ready Hospital Management System which is secure, interoperable, and integrated with the Cardano blockchain. The modules and features listed are very complete and detailed. Hippocrates in particular is perfectly suited to this challenge as it has built a health infrastructure that countries and governments can rapidly deploy. The team mentioned the impact of project time due to covid effects, in addition, the difficulties in working with hospitals and the government should also be taken into account.", "q0r": 5, "q1": "The detailed plan and implementation time are broken down to each month, and version 1.0 will be released in July. The proponent also submitted a visual demo clip (https://demo.hippocrades.org/cms/launchpad/main). Proposed budget clearly according to completion time of main items, would be great to have more details by modules. The core technology group information proponent has 10 people and has detailed information on some key members, so it is recommended to add enough other members.", "q1r": 5, "q2": "The project progress and development metrics outlined in the proposal, it's even better when the metrics are measurable. I appreciate the Testable Code metric (works like documentation so changes will immediately show an error). The success that the proposal is aiming for is that the hospital application is deployed and available in the Hippocrates infrastructure for users to manage.", "q2r": 5, "assessor": "z_assessor_610", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8115, "q0": "The Modern Hospital Management System proposal addresses Nation Building DApp challenge well by offering modern hospital management system. Hippocrades team will add this feature of their already built health tech infrastructure. The solution has the potential to be used wide spread in the developing world. Their goal aligns well with the challenge goal. The solution is counted as foundational registry solutions. They have included the sample deployment of dApp and documentation of health care API in the proposal. The solution will increase DApp usage in developing nations.", "q0r": 5, "q1": "The proposal duration is 7 months with the main development activities in early part. The team behind Hippocrades is accepted into Ariob Incubator/ Iceaddis program which enhance their credibility and capability to bring this project to finishing line. The cost of each role for this project is detailed. Different role will also cover different period in the project making effective usage of working hours in the process. The proposal will improve if they can provide reference/link of team members. They have requested fund in fund 6 and fund 7 previously. The amount they requested in fund 8 will cover their operation for the longest period (7 months). It is a great sign that the team has budgeted well. The requested budget is reasonable considering the timeline of the project.", "q1r": 4, "q2": "The team uses GitHub as the platform to track project progress (identified tasks as pending, ongoing and done). They should have provided the better KPIs in quantifiable term. Although it's good that they have their internal module tasks to tick off, it would be more transparent to know these module tasks account by how much of the project. They should also consider other forms of reporting ie. online meetings or bi-weekly report so that the community is informed that the project is on track. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8748, "q0": "This is a really important and worthy project to improve healthcare by using the Cardano blockchain in developing nations and exactly what the challenge setting calls for. By providing fully integrated management of all functions and operational aspects of healthcare management and making use of web3 technology and Cardano blockchain, this proposal is highly suitable to have positive impact for the perception of Cardano in Africa and the world, onboarding of more users, follow-on proposals and a growing MedTech ecosystem inside Catalyst. The nation building aspect is potentially also powerful, with property rights and possible improvements discussed by DeSoto addressed by the Hippocrades project and the features of its Nightingale module. I am therefore assessing 5/5 and am quite impressed by the alignment of an existing project like this and our challenge goals.", "q0r": 5, "q1": "The proposers have been selected by the Ariob Incubator (Cardano Africa) and have a working product with rich features and complete blockchain integration and whitepaper. It is a pity that the profiles of the team members are not provided, but given the validation by IOHK (I have checked the Ariob website and confirmed them being part of the 1st cohort) and the incredibly smooth and professional experience of the wesite, I give them the benefit of the doubt. Their Twitter is dormant, but that is not an issue in itself. I \"only\" give 4 out of 5 stars because I think it is very important amid the anonymity and global character and lack of accreditation / credentials (yet!) on-chain, we should do our utmost to create confidence that this is not just some elaborate scam. I do not believe that Hippocrades are, not at all! It all looks solid. This is just my advice: the more you can provide in terms of your profiles, portfolio etc. the better it would be! ", "q1r": 4, "q2": "The Auditability sections lacks the strength of the other two section. The proposers state that they want simple, working code and have been doing this for 5 years and so on. This is all good and even credible. But what the Catalyst process (and most people assessing your business plan for that matter!) require is some serious thought and effort going into metrics and timeline and how you manage your funds and project progress and make sure that the money is deployed to good effect. Building a great product that can help millions of people potentially makes numbers \"pulled out of a hat\" kind of unsexy, I understand that. But please for the sake of respect for the voters make some attempt like \"we should have x % of the testing done by this and that date\". \"We aim for 4 partnerships with hospitals in Africa by this date, and 8 by that date\". It is not a distraction from the fun work coding the project, but really helps to stay on target.", "q2r": 3, "assessor": "z_assessor_692", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "A modern hospital management system that is secure, private, interoperable, and works with the Cardano blockchain.", "experience": "We are from the Hippocrades Team that has built a decentralized healthcare infrastructure for Cardano. We have been selected in the first batch of the Ariob Incubator / Iceaddis program in Africa which is supported by Cardano for high-potential startups."}