{"id": 400721, "author": "ronhill.m4", "title": "Haitian Economic Growth Initiative", "url": "https://cardano.ideascale.com/a/dtd/400721-48088", "category": 26435, "amount": 45000, "description": "Haiti has 108 political parties.\nOver-the-top socialist face off with purely corrupt politicians.\nPro-growth candidates need backing.", "funded": 1, "upvotes": 28200030, "downvotes": 18986401, "votes_result": 9213629, "votes_cast": 117, "f6_no_assessments": 6, "f6_rating": 2.5000000000000004, "videos": [], "media": [], "f6_assessments": [{"id": 3790, "q0": "It is obvious that your proposal is now poor in the detailed introduction of the platform’s features and functions, albeit you manage to directly identify the target users of the project. From my perspective, you should describe more about this fundraising Dapp, including how it will finance rule-of-law candidates and operation principles of the platform. For the most part, I don’t think your key metric meets the standards of the challenge since you only mention the initial idea of backing candidates on the island of Gonave off the west coast of mainland Haiti without other relevant information, and this is not considered one of the given key metrics in the campaign brief. More importantly, even if you were capable of putting forward rather concise solutions to the predicted problems. Yet, there appears one essential matter in this section, the foreseen risks. I mean you couldn’t clearly specify what obstacles your team could confront while conducting the project. It can be seen that you just mention “Haiti is fraught with risk, but risk needs to be met with risk takers” without naming what these risks could be. To illustrate, you had better supplement all the risks that RealFi or Web3 technology can tackle well to help Haiti candidates. By the way, I can't deny but admire your dedication to this proposal, especially when you are willing to leave your house in the USA to move to Haiti and invest $20,000 of your personal finance with the aim of implementing this project. Truly respect!", "q0r": 2, "q1": "Which specific time will you start the project and attain every milestone? That is the point you need to focus on in this section, for the most part. Actually, the timeline you set for achieving your milestones is mentioned but they are not explicit enough for the community to follow your project. For example, with reference to launching the dApp, you had better present clearly when or in which months your platform will be run on the Internet and accessible to the Cardano community, and the same goes for other goals. Plus, personally I think this project should provide more detail related to its work plan, such as what your team will do to launch the dApp and the political party. What’s more, reading your budget breakdown, I think the personal living expenses are not suitable because in your roadmap of the project, you don’t mention anything pertaining to this “activity”. And if you want to make this request become acceptable, my advice is to supplement it with the work plan, as a way to prove that living expenditure in Haiti is indispensable for the progress of the project. Besides, more detail of the budget report is required, such as you should demonstrate that the cost of living in Haiti is cheap by providing specific figures on average costs there. Also, showing the voters how many members your technical team will have and how much they will be paid monthly (even hourly), the marketing and promotion campaign will include which activities, associated with their costs. The more precise information you supply, the more transparent your project will be. Likewise, which positions will your working team contain to work for the project? Please name them so that the voters could evaluate the developmental prospects of your project.", "q1r": 2, "q2": "With all sincerity, I cherish all your attempts to back Haitian, but on top of that, if you would rather the community pin their faith on your project, you had better show them your work progress which can be kept track of by certain measurement tools. Sad to say, this proposal has no appearance of any tools that can be applied for tracing the project. Moreover, it is vitally important to elucidate the success metrics of this project (since all the criterias you provided are vague, to some extent) so as to build greater trust among the community. You said that RealFi projects could be the real game changer, so the case now is what could they alter? In this section, I highly suggest you convince the voters by claiming what the achievements your team could reach in view of the economic growth initiative, which is the title of this proposal and also your main objective of your proposed solution.", "q2r": 2, "assessor": "z_assessor_1675", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 7415, "q0": "In theory this proposal meets the objectives of the challenge, but in practice I do not believe that this is done so clearly. The present challenge aims to finance projects that involve our blockchain, in order to popularize it, increasing the number of investors, Dapps, NFTs, Ada being bought and etc, while helping developing countries to prosper. These goals are identifiable in the proposal, because the proposer wants to create an application that, through blockchain technologies, can raise financial funds for government candidates in Haiti who are in favor of science, progress and capitalism. This seems to be great, as certainly candidates with this mindset would help the country to prosper both economically and in terms of human development. However, I identified two problematic situations in the proposal. The first would be in relation to Cardano. It is not explained, at least in the impact part, how our blockchain technologies would be used in building the Dapp. Would investments be made in Ada? Would financial transfers be through smart contracts? It is not clear how this project would benefit our ecosystem, which is one of the pillars of this and all challenges. The other question is about the political part of the thing: we, from outside Haiti, don't know the political scenario very well, so we can't understand exactly the problem that is being faced and what proposals from the candidates that this Dapp would support. It would be necessary for the proponent to summarize what has happened in recent years in the country, to have attached some reports, so that we could have a more informed opinion about the changes he is supporting. I would also like to know who are these candidates who would promote the changes, their proposals, what ideologies they work with (we know who the thinkers the proponent aligns with, but not those of the candidates). In general, I think it's a little uncertain for us who are outsiders both what is happening and the changes that are being suggested and how this Dapp works within Cardano's technologies. Therefore, I am not sure that this proposal will be of high impact, which makes me need to suggest that the proposer reformulate his proposal, including more details. \n", "q0r": 2, "q1": "The viability of the project is not good, unfortunately. Starting with the absence of a roadmap, the proponent claims that in 3 weeks after funding the Dapp would be operational and accessible to everyone. But what would the process of creating this Dapp look like? It would be necessary for him to detail what small tasks would be necessary for him to go from idea to a reality. The time of 3 weeks in my opinion is very short, compared to the other proposals, both for this challenge and for the Dapps and applications, all projects take about months to be ready. It would be necessary for the proponent to explain what would be done in the first week, by whom, how, in what order. We would need to understand all the technical parts involved here, how design and programming professionals would work together in order to deliver the intended results. It would be necessary for him to explain what would be built little by little each week. As described, it is not possible to reliably understand what the development process of this application is like. Regarding the budget, 45k are requested and that are explained in a very superficial way. 15k would be reserved for the proponent, which according to him would support him for an entire year in Haiti. 10k would be reserved for his team, which raises the question of why 15k would be needed for just one person, while a lesser amount would be shared for several. We don't know how many people would make up this team, what their salaries would be, how long they would work, what their duties would be... I can't understand if this amount of 10k is fair; at first it seems to me disproportionate that a single person has a higher salary than several together. He asks for 20k for marketing, but again, there is no detail on how this amount would be spent, what the marketing campaign would be developed, why this investment would be necessary, how the Dapp would be publicized, we don't know what its characteristics would be as a brand ( colors, UI/UX design and etc). In other words, regarding the budget, we were also unable to understand exactly what would be paid and why this amount of financing would be necessary. And in relation to the team, this part is even more complicated, the author says he will hire other professionals to develop the project, but we don't know who they would be, what they would do, how many there would be. We do not know who the team would consist of, and for us to have confidence that the project will be successfully executed, it would be necessary to know who the team members are in detail. This included, in addition to their names and professional positions, how they would act on the project as well as a small resume of what they have done so far, so that we could get to know them well. \n", "q1r": 2, "q2": "The proposal is not auditable, the proposer informs us that his plans are to have a voice in the government and to build a better developed country, with more economic opportunities and so on. But how can this advance be measured and monitored? The proponent lacked details such as: number of innovative proposals that he and his team would launch; how they would help the local population (for example, if they worked on the renovation of a hospital, school, if they promoted improvements in the nutrition of needy students, in short, what changes were established in favor of the Haitians); which scientific projects they promoted; etc. That is, direct ways of perceiving this advance, we know that they intend to promote a change of scenery, but what indicators would be used to understand if this was real? Regarding the process, it's not easy to monitor the progress of a project where we don't have a sense of what the work schedule would be like to build Dapp. I suggest that this script be created, detailing what activities would be done each week, which professionals would be working in which phase, how the project's dissemination/marketing phase would take place, etc. That way, we would have material to check, you know? It would also be necessary for the proponent to establish direct contact with the community, providing feedback at each time period. This would be interesting not only for the process of creation and expansion of Dapp, but also for us to know its achievements with the local government, to understand the partial results, how, little by little, the change would be becoming a reality. Therefore, I think that this part of the proposal also needs a new elaboration, in order to give us more tangible material to be audited. \n", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 5224, "q0": "There is not enough information here for me to justify even considering this proposal. $45k is an enormous amount of money and requires deeply researched information, LinkedIn profiles of all those involved, websites, an explanation of what impact this money makes, and convincing articulation of why this proposal will be successful. There's no objective information for me to go on AND this proposal is extraordinarily expensive. ", "q0r": 1, "q1": "There appears to be an extreme level of poor thought into this proposal and there's no way I can justify putting this amount of money into it with the reliability demonstrated. The explanation of the situation and choices made by the author does not provide assurance that this money would be well spent.", "q1r": 1, "q2": "There's simply no measurable means of providing progress of success. Which communicates that there are no real objective goals and no strategic plan.", "q2r": 1, "assessor": "z_assessor_1896", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5539, "q0": "The aim of the proposal is to build a Dapp that would enable people to raise funds in ADA for the political candidates of their choice in Haiti, as for now the corrupt system favours politicians with money (where doesn’t it?).\nThe proposer mentions “I don’t think people outside of Haiti fully understand how easy it is for a candidate to win with just slight backing.” But, even if the Dapp backs up only young, energetic and good willing candidates, as the proposer suggests and aims with the proposal, continuing the old system of corruption by enabling the amount of money a political candidate has, to increase his chances of winning, is not a value in accordance to blockchain and web3 views, who are disruptors of the old system, not an update to it. However, I do not have a solution to this, and I agree with the fact that one has to be on the ground to be able to implement real changes.\nFor the purpose of the proposal and how well it fits the challenge brief, I will consider it as positive, however, I suggest to the proposer to consider these small mentions and take them into account for the cause he is fighting for.", "q0r": 4, "q1": "The plan is not described in detail, “Within 3 weeks of funding the Dapp will be up and running” is not enough information to fully assess the possibility of the plan being implemented successfully. There are no technical details regarding the dApp, no team members assigned to develop it “I am currently in talks with members of the Haitians in Tech organization on finding local technical talent to supplement talent in the US.” \nThere is mention of having a political party formed, though there is no info related to its scope.\nThe budget lacks any clear details, and there is no info regarding team members, not even any details about the proposer and his skills or links to his previous work that can sustain his expertise in implementing this project.\nWith the documentation provided is hard to properly assess the feasibility of the project.", "q1r": 1, "q2": "The progress question has not been addressed: “It should take no more than 2 months for the Haitian Ministry of Justice to approve our application”, the proposer should have offered some concise KPIs and a method on where those KPIs could be monitored.\nThe same applies to the success description, as it stands it is idealistic and has no verifiable milestones, that the community would be able to independently verify.\nI highly suggest resubmission in a future fund with all these questions addressed.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7951, "q0": "Hello. I feel serious and want to develop dapps about to assist in stabilizing manipulation and getting public opinion on political issues especially electoral justice in your locality. I want to contribute more for you. The idea is good, but you need to have a detailed understanding of the local legislation, and the resources you have available, you need a solution that can be accepted by local governments at different levels your application. Or in your work team, there must be someone with that connection ability.", "q0r": 5, "q1": "I see an unjustifiable twist in your plan. Developing an application to apply to national politics took only 3 weeks. In addition, you have not made a convincing argument about how you will build credibility, how to attract the local community to participate. The costs are also not detailed. For example, how much is the staffing part, what are the deployment tasks, and how much money is needed per hour... Be perfect and don't overdo it in your dapps deployment plans.", "q1r": 5, "q2": "I hope that decentralized applications are increasingly widely used to make the voting results transparent and secure user information. So I'm very supportive of your projects. However, you need to have an official communication channel of an individual or organization, ready to publicly share what you have done through your dapps applied to community governance and political cleaning. how. You also need to make the code public so that the community can replicate faster building similar dapps.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8467, "q0": "The proposer plans to create a fundrasing Dapp and launch \"Haitian Economic Grow Initiative\" party to finance candidates that back the merger of science, technology and capitalism in Haiti. I think this is a promising idea. The proposer shows his effort, seriousness, belief and understanding of Haiti political situations in implementing this project as he has already reallocated outside of Haiti and will invest his own money into this project. This project will bring positive changes to the growth, justice to Haiti and avoid manipulation on political problems. A good understanding of local procedures and available resourses, and good relationship with local government will help proposer execute this project better. ", "q0r": 4, "q1": "Well, it is confusing with the plan of running Dapp within 3 weeks. The proposer should make clear about each task regarding building the Dapp: technical concerns, credibility and other marketing strategies to using of Dapp,.. In addition, I find the required budget is not detail in each task for community trust. In addition, I would like the proposer to make clear plan about launching political party and how to field the candidates. I support your idea but I would like to see more efforts putting in this proposal regarding personnel recruitment too. ", "q1r": 3, "q2": "Well, I suggest the proposer should provide official communication channel for community to check your progress of the project and community engagement. Through your proposal, I do not see any references or links to keep track of your project or to get updates on what have you finished to your Dapps. I am very supportive of your idea as it helps voting more transparent and secure with the help of decentralized technology. I hope the proposer could dig deep more into your technology solutions, detailed plan and marketing strategy for community checking. ", "q2r": 3, "assessor": "z_assessor_678", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "The Haitian Economic Growth Initiative will be a fundraising Dapp designed to give pro-growth, pro-innovation candidates needed backing.", "experience": "Political Science Major\nSpecialized in Political Research\nFounded an Digital Marketing company\n++Most importantly, I have left my home in the United States and will be on the ground in Haiti for he foreseeable future.++\nThis is MANDATORY in order to accomplish anything!!"}