{"id": 400702, "author": "gonzalocamps", "title": "DAO Displays for Public Spaces", "url": "https://cardano.ideascale.com/a/dtd/400702-48088", "category": 26435, "amount": 28750, "description": "Public Spaces gather every stakeholder of society; but its information-displays have been sold to big advertisers, rejecting local contents.", "f6_no_assessments": 5, "f6_rating": 4.7333333333333325, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal does meet many of the requests for this challenge setting.  This project can help build and grow communities through a dApp.  The lone limitation is that this project is working on building a solution for a targeted DAO that is built in a particular community limiting the scope that can be impacted.", "q0r": 4, "q1": "Considering the outreach that this project is attempting to work for (LATAM) there may be some challenges with having enough infrastructure or enough knowledge locally to support and maintain the project once built.  This project does have some basics behind it which would make development and implementation complete, but challenges could arise in the targeted areas for the reasons mention above.", "q1r": 4, "q2": "This project has a roadmap, breakdown of resources, and some KPIs set to measure how the project can be developed.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "I agree that as a challenge setup for the Daaps proponent to build a country, this proposal belongs to the Aggregate challenge setting and provides value to the Cardano ecosystem. The proposal is well-written and organized, the intent is clear, and the methodology is transparent. The Cadarno community should have the opportunity to discover and conduct consistent research encouraged through catalyst funding. This project will be expanded in the future ", "q0r": 5, "q1": "The community's ability to tackle an open research challenge should not be underestimated, especially given the early age of the Cardano ecosystem. DAPP develops and integrates in a new innovative environment like Cardano Blockchain with its unique features, which requires a great level of participation. This project KPI is provided from, time-listed proponent on fieldwork, Dapp development and implementation,Dapps impact social/financial inclusion,Dapps impact economic development,Variety of Dapp use cases .I strongly believe the Cardano community is capable of doing so", "q1r": 5, "q2": "As an open-ended research challenge, one could argue how irrelevant the proposed metrics and success criteria are. The challenge proposal outlines clear success criteria, key metrics, or research models that should be followed. I believe this proposal is clearer and more informative to voters about the research standards to be followed. We have built a Platform with all the necessary tools, which we will be able to test in low-cost fashion at www.node.cooperativalocal.org. After Beta testing, we look forward to integrating cardano operability.\n. The challenge team will have an additional opportunity to clarify and provide additional details to suitors once the challenge proposal is approved by a voter. \n", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "As mentioned by the proposer the advertising in digital domain will cost a lot and mostly used by big companies to promote their products and they can afford the advertising cost, but for the local advertising small companies may not be able to afford that kind of advertising and thats where this application of DAO displays for public places come into picture. The proposer has uniquely identified a need for DAO displays for public spaces to make it easier for the local advertisement and has also worked towards the implementation which is impressive and it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has also mentioned the key metrics which will be helpful in the success of this proposal. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 5, "q1": "The proposer has a very innovative idea of introducing DAO Displays for Public spaces and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and his team seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. he proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 28750 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more users which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "\"Nowadays, the mass marketing method of using public physical-digital display just forces you to see what you don't like is just annoyed. And this project will help us to solve that problem by using their idea with the DAO by helping local communities to choose the temporal advertising mix that their OOH displays will broadcast. The proposer show very detailed content about their solution, how it can be used, and advantages to the old model of digital display. It's not just about the feature and function, but also the detail about their implementation plans to develop the technical mechanic, to deploy and design their own display in business. More than that, this project is a game of the chicken and eggs, it's hard to deploy at the beginning but they have detailed strategies to attract users to engage with the platform and increase the number of their displays locally fast. \nThe proposer also outlined some bullet points and the key metrics that I believe that it strongly align to the challenge settings, and more than that this idea will make a huge impact on the Cardano ecosystem because it solves one of the hardest problems of all businesses that the proposer also state out at the first part of this proposal.  \nMoreover, the team has good awareness about their challenges when doing this project. From my experience in the marketing industry, this kind of project will meet a lot of challenges that relate to local authorities, resources, scaling, performance... but the team state out more than what I think and they all have ideas for mitigating them. \"", "q0r": 5, "q1": "The team has a fully detailed roadmap of 5 phases, the first phase was funded in fund 6. The outlines of the roadmap are easy to understand what they want to do with numbers and outputs. Moreover, the budget that they require is reasonable that used for human resource payment in 6 months from May to Dec. I believe that their team members in the proposal have enough ability to make this project successful, they all have experience and skill for solving the tasks in the roadmap very well. ", "q1r": 5, "q2": "The team determined their successful picture very clearly. As their provided content, I believe that if this project succeeds, it will help a lot of businesses to reach the local people and be better. Moreover, it will elevate the performance of outdoor marketing and be a game-changer in the marketing industry. The proposer also provides full detail of KPIs to help the community track their progress and succeed. And I think all of them are match the plan and challenge. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is very valuable, it has a great impact. It effectively addresses the challenge posed: Dapps impact on social/financial inclusion, Dapps impact on economic development, Proposers lead time on field research, Dapp development and implementation,... Local people, communities and businesses can showcase their contents and Initiatives to Public Spaces through DAO Digital Displays. Thereby positively impacting the quality of life of the local community.", "q0r": 5, "q1": "Information about the team provided, their knowledge, skills, experience is enough to carry out this project. However, it seems that the linkedin profiles of \"Matías\" and \"Rafael\" are missing, you need to supplement to increase transparency for the team. In particular, your team has had certain successes, the team is an active startup company funded by fund6. This will be a solid basis to contribute to creating confidence in future success.\nThe roadmap provided is very clear, the jobs through each quarter are clearly defined. The success evaluation indicators are also mentioned, it helps people easily assess the success of the project. The required budget is quite suitable. More specifically, you have identified the risks and challenges that will be encountered during the project implementation.", "q1r": 5, "q2": "The information provided is complete, I see your enthusiasm in this project. It's a pity that this project is not funded in fund7 (out of budget). I have reviewed your proposal at fund7, at fund8 you have had many positive additions: more risks and challenges to be met, clearer budget allocation,... Besides, , in fund8 the budget has increased many times, I am sure your project will be able to be funded. This is a viable project, if it is successfully implemented, it will definitely bring a great value to the community.", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Local people, communities and businesses can showcase their contents and initiatives to Public Spaces through DAO Digital Displays.", "experience": "We are an operating start-up funded by F6 that will launch in Q1 a web-app to tokenize localities on emerging countries. For two years, we have explored this model and lead local adoption of Blockchain uses. A world's top-10 accelerator helps us to achieve market-fit at Latam."}