{"id": 400838, "author": "tatzmiki", "title": "INDIGO, AFRICA & FUTURE FASHION", "url": "https://cardano.ideascale.com/a/dtd/400838-48088", "category": 26435, "amount": 50000, "description": "• Fashion must find a way to be sustainable to fight environmental issues\n\n• Africa needs a driving force to unlock its economic potential", "f6_no_assessments": 6, "f6_rating": 3.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is very well summarized by the excerpts “our project aims to create a flow of truly sustainable fashion, starting from Gabon, where global warming is progressing, and using organic indigo dyes derived from plants that grow only in the tropics” and “our mission is to combine organic indigo dyes from the majestic land of Gabon with traceable blockchain technology.” That is, the idea of ​​the proponents is to combat unsustainable fashion by growing a plant called Indigo, which will be cultivated in Gabon, an African country. After the plant’s cultivation process was complete, they would extract the blue dye and dye clothes, and all the information about that piece, such as “origin of the fashion product, such as production areas, raw materials and date on which the fashion items have been dyed” will be minted on the Cardano blockchain. The proponents also explain that each time the same piece is dyed, a new NFT will be generated. The idea is, in short, to produce clothes and fashion accessories in a more conscious way, proponents argue that the heart of the matter is to fight the pollution generated by the traditional fashion industry, where most of the dyes that dye the clothes are from petroleum derivatives; and we all know how bad this process is for the environment. As interesting as the idea is in theory, I disagree that it's a high-value proposition for Cardano, and I also don't think it fits well with the goals of this challenge. Let's go: first, I don't think people will be so curious about information as specific as where the plant that gave rise to the color of your clothes was grown; this seems to be an interest of a more select public, people who like fashion and sustainability. It doesn't really seem like a common curiosity among the general public. So I don't think there will be as much engagement around the NFTs that will be generated. Secondly, the proponents themselves claim that they still do not have an exact development plan for the software that will produce this technology, they admit that the greatest difficulty of the proposal will be to integrate the fashion world, the color extraction process and the Cardano blockchain. During the team's description (I won't go into this now, but just to make my point), we see that only Osamu Takahashi is involved with blockchain, but apparently he's not that knowledgeable about Cardano in particular. For these reasons I am unsure how much this project will impact our blockchain, since even the integration is uncertain. Now talking about the specific objectives of the challenge, in this challenge our purpose is to fund Dapps that benefit a specific country/community. Gabon is mentioned here, but it is not clear whether its inhabitants would contribute to this project and how they would benefit. It seems to me something that would generate benefits mostly for the specific team, but not for the local population. So unfortunately I think the impact here is low. \n", "q0r": 1, "q1": "Unfortunately, the viability of the project is low. Let's look at each of the main parts individually. Starting with the script, the activities to be developed are not described in detail, nor do we have a temporal notion of how long each phase of the process would take. Proponents report that it is difficult to predict the exact time of harvest, I agree, we have no way of controlling nature, but they could have given an idea of ​​how long it would take for other tasks (team work) to be done. For example, “dyeing the fabric, etc. using the extracted pigment”; Could the bidders have said how long this would last, 2 weeks, 1 month, 2 months? Who would work on it? It would be really cool if we knew how this process would be done, what pieces of clothing they intend to dye and etc. In other words, the script is too superficial, we have no way of understanding how long this would all take in practice. Regarding the budget, I also found this part explained in an inadequate way, very superficial, asking for 50 thousand dollars, a very high amount; and the explanation of the parts is very basic, lacking in detail. For example, “Prototyping Product: 20,000 USD”. Why would this process cost $20,000? Who would work here? What would you do, how is the creation of a prototype in practice? Even, from the way it is said, we thought that only one model of clothing or accessory would be dyed, but on impact I had understood that there would be several. I think that the financial explanations are not enough to have an accurate view of how the money would be spent, we don't know, for example, the exact salaries of the professionals involved, nor how much time would be dedicated to the project (how many hours per month, for example) . Thus, we do not have a good idea of ​​whether the asking price is fair or not. Finally, speaking of the team, I also think that the explanations provided about the 3 team members are basic. We don't know examples of their previous work, all we are told is in which professional area each one works. It is also unclear whether the blockchain enthusiast has any specific knowledge about Cardano, as I said at impact. Therefore, trust is not conveyed in the team, it would be important to have examples of what they have done before (for example, a portfolio with the articles dyed by the indigo specialist, examples of projects that the blockchain enthusiast has already been involved in, etc). \n", "q1r": 2, "q2": "The auditability of the process is very low, the proponents claim that “every detail of this manufacturing process will be recorded”, so that the information that will be minted on the Cardano blockchain can be gathered in the future. Okay, but where exactly would these records be made? Will they use some data sharing application, such as google docs? How would the Cardano community have access to such information? In addition to data on the cultivation, extraction, dyeing and finishing of fashion products, how will the tasks behind it be monitored? That is, how would we be aware of the work routine of those involved, how would we know if the plans, whether monthly, weekly, etc., were being duly obeyed or if there was a problem? In the way it is explained to us, auditability is still very abstract, remaining in a very theoretical field. Now, for the final results, bidders also very imprecisely state how this auditability would be done. They reinforce the success scenario, said since the impact, being “the essence of future fashion that we envision is an unprecedented sustainable fashion, with unalterable information about the origin of things, such as raw materials and manufacturing processes”. But how can we perceive the impacts of this, in a measurable way? How can we understand if fashion has become more sustainable, even if on a local scale (Gabon)? The profits generated from the dyed accessories, which will be handmade so I imagine they will be a little more expensive than items sold in fast fashion, where would that money go? How exactly can we measure the return of this project to Cardano? Also, targeting the specific objectives of the challenge, how would this project help the local population of Gabon? How will all this data become accessible to the Cardano community? Unfortunately, I think that everything that is said is very much in the theoretical field, we do not know exactly how this project can be audited, lacking objective data to be achieved, methodologies on how they could be analyzed and form practices through which our community would have knowledge about everything. \n", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The environment is increasingly polluted, people create a lot of things for life such as the invention of dyes from petroleum products, but this also trades off a lot of the living environment. INDIGO, AFRICA & FUTURE FASHION is an interesting idea to change the way people live with products from nature, thereby creating a part to protect the increasingly polluted living environment. Gabon may be a small country in Central Africa with a population of over 2 million but I think if this proposal is successful it will have a huge impact on the fashion industry in the future. Thereby, it will prove the value of Cardano to the community, people will know more about Cardano through this meaningful work.", "q0r": 4, "q1": "Tatz Miki, Benjamin Mendou, Osamu Takahashi are all experienced in related matters. I believe you will do well with this proposal. However, I suggest that you need to share more details about the information of each of your group members so that the community can know what you introduce about yourself is correct. You can provide Linkedin, Telegram, Twitter or whatever so that the community can know you.", "q1r": 2, "q2": "The roadmap you give needs to be more specific about the timelines. It may not be completely accurate, but it is also a basis for the community to track your work progress. In addition, I think you also need to be more transparent about the use of the $50,000. Example: $25,000 spent on natural indigo. This account needs more detail and transparency. The more transparent you are about your finances, the more the community will appreciate it.", "q2r": 2, "assessor": "z_assessor_1213", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "\"The solution demonstration begins with a broad view of the world context and problems in fashion industry, from which the proposer expresses their high awareness and passion for not only the field but also for contributing to community. The background information about the beneficiaries, their motivations and how their ideas work are clearly stated. The writing style is relatively professional and persuasive.\nFor the second part, the explanation of the proposer is impressed in the way that they have done a very careful research and calculations on the environment, community, population, and even foresee several risks such as the obstacles of aquiring farmland in advance that might affect the idea implementation. Alongside, the proposer also analyse the potentials of development for Cardano ecosystem in the focused country. In general, the proposer has expressed themselves as enthusiastic contributor and changer to the fashion industry and environment, who owns great vision about a more sustainable future and a critical realistic look into the current problem. For this part, my only inquiry is the technical information about how they technically built their app or web in order to serve their idea, but they also mention that those information will be finished later on. \nOther than that, they state their foreseen risks very thoroughly with clear explanation and the guided solution for those risks, too. The technical information and operations of the software is not crystal clear, but their way to demonstrate it seems to match so well with their main solution and their high priority for traceability and transparency. \"", "q0r": 5, "q1": "\"All the steps needed during the implementation of this project is distinctly listed with an estimation for time of completion. The proposer seems to have a great deal of experiences in manufacturing indigo-dyed clothing so there is not much in need for commenting on that process. The budget breakdown is succinctly and reasonably demonstrated.\nThe team members of the project is quite wholesome as they own an professional artist in indigo dying, an expert who knows well about the market, and a person in charge of blockchain. With these passion and thorough information, detailed presentation as in this proposal, I believe they have done enough to prove the feasibility of the project to the certain point that creating a prototype and not yet discuss much on the software establishment. \"", "q1r": 5, "q2": "In this part, the provided information from the proposer is quite enough for me. The success illustration is clear from of a pioneer with hope and vigour. Yet, I personally think that it could still be better if they add some more metrics related to their planned timeline, or how often the recorded information would be sent, then the auditability can reach a higher level. Otherwise, the current information is again quite enough. ", "q2r": 5, "assessor": "z_assessor_1796", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Currently as the second most polluted industry in the world, sustainability issue in the fashion industry has been rising a concern and most of the time the industry still looking for the end-to-end formula to be able to provide fashion transparency instead of just green-washing the consumers. This issue is relevant to the world’s circumstances, and promoting mindful consumption for fashion consumer with blockchain could be a good sustainable value for Cardano’s blockchain. Although it is so challenging to do this project to be able to really using the blockchain technology to actually applicable realistically and meet the consumer needs for transparency and mindful consumption, this proposal has a valid background problem and the proposer has relevant experience to run this project in natural-fabric as well as team that understand African environment and blockchain. Potentially, it could shape the future of sustainable fashion.\n", "q0r": 4, "q1": "The team in this project has relevant experience and skill in fashion as well as technology and it is important. As this kind of thing has not yet becoming the concern of the biggest fashion manufacturer, To connect between the digital and physical technology is innovative and risky at the same time, after all it is also important to ensure the utility of this project and to be more consumer-focus too. \nThe general cost breakdown is covered, but lacking the detailed cost, timeline and roadmaps estimation, as it is important to verify if the budget is reasonable for the timeline. If succeeded, this project will be feasible in the long run and will need a budget continuation in the next project catalyst. As the project seems like it will be running quite long, maybe it will be better to split the timeline and budgeting of the prototyping and software development.\n", "q1r": 3, "q2": "The proposal stated the main problems and challenges, and how it could contribute to the industry. However the roadmap and key metrics/KPI is still not clear other than saying it will record the process and starting the prototype in 1.5 years. As suggested before, as it will be in the long run, it might be better to split the project to shorter project and make the timeline and roadmap more details. For example, the developing parts of the indigo plants and NFT conversion about the crops, the next part is finalising the prototyping and NFT conversion of the proposal until it will be ready as a commercial dyed fabrics.It will be easier like that for auditor to check the progress KPIs.", "q2r": 2, "assessor": "z_assessor_1852", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "I really love this type of project,, because it not only can help to enhance poor people's life in under developing and developing countries but also protect the natural environment sustainability. I can tell that the team wants to make a sustainable supply chain of fashion with indigo dyes in Africa by involving directly developing the resource, production, and blockchain technology for tracing them. The team has a very good acknowledgment of the context of the society, environment, and resources for the project in the target area - here is Gabon, a small country in Central Africa. They also show us very detailed info about their advantage of developing this project compare with the petroleum-derived dyes fashion industry, some of their value propositions I believe will make a big impact on the fashion industry in the future. Moreover, to beat the challenges that they describe in the proposal, the team has shown a well-prepared plan for their future development. Unlike the traditional model, applying blockchain into the supply chain will help them solve them easier and they have a good awareness about that in their product strategies. ", "q0r": 5, "q1": "In the scope of this proposal, the team's main mission is that help stabilizes the resource production, make the prototype, then complete the whole process to be smooth in the future. So, I think their roadmap is a little short but the outlines are enough to figure out what they do and acquire. The proposer also tells that it's hard to have an accurate timeline because it depends on nature and I think it's reasonable. In addition, the budget they required is detailed into group activities to serve their development and I see it's suitable with the roadmap. However, the proposer should provide more info about the position and roles they need for this project because it will be complex with a lot of work to complete that timeline. The proposer only provides the info of 3 people that belong to technical development but not the production and business development which is the most consuming part of their plan. ", "q1r": 3, "q2": "The team has a clear vision about their success in the fashion industry with this project and they determined their goal very specific. The proposer also provides some metrics that they will use to measure the performance of their project. But I advise that the proposer should give us more ways to track their progress in detail, not just so generally like that. That also helps the community to support their plan for getting better result. ", "q2r": 4, "assessor": "z_assessor_651", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is really a big project and is going to take a long period of time for successful implementation and learning  that Organic indigo dye \nis extracted from the plants by crushing the leaves and soaking them until they ferment and release the indican, which was precipitated and dried that means a lot of work will be done for successful implementation. From the information  provided  wants to propose a mechanism for sustainable fashion starting from Gabon, which is supported by blockchain technology. In doing this the proposer identified a problem within the challenge which needs to  be solve. It also articulate how it will add value to the cardano community by letting us know from the information  that the use of block chain and cryptocurrencies in Garbon is new and with the project starting in Garbon , the project will help to make  the people know  more about cardano. With this informations I think the proposal is scale to address the future  challenges. ", "q0r": 5, "q1": "From the information provided the proposer provided evidence ( link https://drive.google.com/file/d/112BpU6BUq76rTjiWHi6TVIqQ5ePVQTsi/view?usp=drivesdk) of relevant skills and experiences needed to implement the proposal. The type and number of the team members required to handle the project is mentioned  and their roles stated. The budget outline is broken but needs further breakdown e.gSecuring farmland, securing labor, and other physical costs associated with cultivation: 15,000 USD, I would have loved to see securing of land will cost this, securing of labour  will cos that etc. I think the budget  of 50,000 Usd is reasonable know a lot of work and expenses  are going to be involved for a long period  of time. The proposer did not mention that the will be need for additional fund and knowing that  project requires growing of the tree which will take long time , I thing a period of 1 and half years for the project is realistic and obtainable. There is a step by step plan mentioned by  the proposer for implementation  and the risks and how to overcome  them is also mentioned.  Given the experience and plan presented is highly likely this proposal will be implemented in. ", "q1r": 4, "q2": "The proposer team was able to map out a clear roadmap with milestone and time horizon for achievement of the proposal. Metrics and kpis that measures the success of the proposal is also stated. There is a clear understandable description of the targeted  problem  which is   finding a way to be sustainable to fight environmental issues that addresses and understandable  solution that addresses  the problem which is a mechanism for sustainable fashion starting from Gabon, which is supported by blockchain technology. With this I think the information is sufficient for auditing. ", "q2r": 4, "assessor": "z_assessor_744", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Fashion can evolve by blockchain. Our goal is to make sustainable indigo dyes in Africa and make traceable circulation in fashion with them.", "experience": "We have abundant experience in;\n\n• Making natural indigo dye by growing indigo plants in several countries\n\n• Teaching people how to grow indigo plants and to extract the pigment\n\n• Making indigo dyed clothing / fashion items using the pigment we made"}