{"id": 400847, "author": "jessejunior6448", "title": "DApp for Tech Repairers", "url": "https://cardano.ideascale.com/a/dtd/400847-48088", "category": 26435, "amount": 74500, "description": "How do we make tech repairers accessible to individuals for easy repair of damaged devices using DApp?", "f6_no_assessments": 8, "f6_rating": 3.9166666666666665, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=11982"], "media": [], "f6_assessments": [{"id": 7419, "q0": "I really liked this idea and I think it fits perfectly with the objectives of the challenge. Here, we seek to fund projects that are beneficial to both Cardano and developing countries. And in the case of this proposal, this is exactly what happens: the idea is to create a Dapp that would serve to connect customers with broken/defective technological devices with repairmen/professionals who work with the repair of these devices, be it a cell phone, a computer, a tablet and etc. This would certainly benefit the locality, as it would help these informal workers to get more services and clients, thus helping to generate income for the inhabitants of Ghana; it would also make it easier for the general population to have access to this service, as the intention is to register as many repairmen as possible on Dapp, and according to the proponent, this type of service is not so easy to find in the country. Therefore, the objective of benefiting the local population of a developing country would be directly served. And, on the other hand, the Cardano ecosystem would also benefit, as this platform would use the technologies of our ecosystem in different ways. All contact between customers and repairers would take place through smart contracts, so that all services and payments would be easily traceable, transparent and inviolable. Repairmen would have DIDs, through which customers, as I understand it, would be able to consult a series of information about them, and in this way they would have more knowledge when choosing the appropriate professional for the service they wish to perform. In my view, it is a very practical, very everyday and palpable way of using blockchain, if this project is right, I believe it can be a good example of how blockchain technology is useful and applicable to the everyday life of ordinary people. My only concerns here are how these repairmen would be found, how they would be taught how to use the Dapp, it is said that they would receive a small reward in Ada for signing up. But the question is how they would learn to register, for example, create a DID and so on. And in the same way, as these teachings would be passed on to the inhabitants of Ghana, in my opinion it is not common for people to know how to use Dapps and carry out transactions on the blockchain, especially in countries where this technology is not so famous. Therefore, the question of instructing both repairers and customers could have been clarified. \n", "q0r": 4, "q1": "The feasibility of the project is good, but there are some things to improve. About the script, we know what will happen as the months pass, but I identify two problems here. First, the time chosen to divide the steps is very large, the activities that will take place every 4 months are listed! Generally, proposals divide their stages into quarterly, which I already consider to be an extensive interval, let alone 4 months. In my opinion, this division should be at least monthly (ideally, activities should be divided into months and those into weeks). With that, we would have a very solid notion of the process as a whole, because the way it is presented, for example in the first 4 months, we don't know when an activity would need to end for another to start, if some could happen in parallel, etc. Now speaking of the activities themselves, we know what will happen, but very superficially; it would be important for the proponent to further explain each of these activities. For example, in phase 3: “Start marketing strategy”, how would this be done? Through which strategies would this Dapp be publicized, would it be through social media, traditional media? How would we go about reaching a population that doesn't have so much access to the internet, which often isn't all family members who have their own smartphones? In 'Organize educational outreach', what would that look like? Would it be the case to publicize the project in educational institutions, or teach how to use Dapp, as I suggested in Impact? Anyway, some activities needed an extra explanation, I don't think the script is built properly. The same thing is repeated in the case of the budget, the amount requested in total is very very high. $74,500 is requested, and the breakdown of the whole is not so detailed. What would be the fees quoted under “Company registration and legal fees - $5,000”, and why would this amount be necessary for that? Why would research and design cost $7,000, how long would professionals in this area work to assemble the interface, what would the UI/UX design of the project look like? And finally, speaking of the team, I think the presentation in this case is good, we have the names and a small resume of each of the members involved, so that we can get to know them better and get a sense of what they've done so far, professionally. It is also positive how the bidder attaches their linkedin profile, because that way we have proof of what is said. It would also be nice if they better defined who would do what in the project - the roles are not very clear. So the script is present but superficial; as well as the budget explanation; the team presentation is the most complete part of the feasibility, but it's not perfect either. \n", "q1r": 4, "q2": "I think we already have the basis for what is needed to audit this proposal, and the only thing that remains pending is how this information would reach the Cardano community. Regarding process monitoring, all the indicators suggested by the proponent are great, they are simple and direct ways to understand if the partial results were in fact obtained. Other than that, I suggest that they also do an overview of how the team worked that month, if, in addition to these things were achieved, the process to achieve them was developed in the right way. This report can be organized and made available together with the indicatives cited by the proponent, through any of the various means of communication of the Cardano community (or by telegram, discord, email, etc.). And regarding the final results, I would really like to congratulate the proponent and his team, as they have a very complete look at the final panorama, exploring the qualitative rather than the quantitative characteristics to be obtained. It is extremely relevant that this is done, as it generates a more human and not just numerical analysis. The final objectives are quite clear and, when seen, have a real and positive impact for Ghana, namely: to facilitate the population to find professionals suitable for the type of service they wish to perform, to promote an increase in the income of repairmen, they will have more customers and services through this platform that would facilitate the contact between the parties and the reduction of electronic waste. So what I suggest again is that the proponents find a simple and complete way to collect such data and bring it to the Cardano community, in my understanding this can be done through, first, an internal research among them: “ we will understand if all this was achieved and how, and we will collect data to prove it”. And then, they could create a presentation through illustrated slides, containing testimonials from repairmen, customers, data that indicate the decrease in electronic waste in the country, graphs that demonstrate the growth in the number of transactions on Cardano's blockchain from this project. and etc. All this could be presented to the community during some Town Hall, for example. In short, I think auditability is very good, just clarify how the information collected would be presented to the rest of the members of our ecosystem. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 8, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 397, "q0": "We realize that the proposal idealizes a solution to a recurring problem in Africa and also in many countries that still do not have a high degree of technological evolution. In fact, the smaller the development in this area, the smaller are other adjacent services such as electronics repair. Still in this context, technicians specialized in these services often charge high prices due to the lack of clarity exposed to customers, whether about the real problem of a device or simply because of the bad faith of charging exorbitant prices for simple repairs. All these factors indicate that there really is a pain to be resolved and so we have no doubts about the usefulness of the application in question.\n\nWith this, it is possible to affirm that the goals of the challenge are fulfilled by the proposal in question and that there is a real possibility of a positive impact for Cardano with the success of the project, since the technologies of the ecosystem would be used in a beneficial action and that, additively, it also helps to achieve some SDGs related to the environment. However, despite the qualified team involved in the project, we realize that a very considerable amount of funding is being requested, of $74,500. With that in mind, perhaps some parameters that contributed to the success of the project could have already been better worked out.", "q0r": 4, "q1": "In the feasibility stages, we were able to find a detailed plan, covering several points so that the application project is well executed. We noticed a concern not only with technical factors but also the investment in the development of the application itself. There is also care in addressing other actions such as conducting a design survey, contacting repairmen interested in participating in the project and carrying out marketing. This demonstrates a comprehensive view of the process by the team to make it successful. But it is worth mentioning that it would be interesting for a marketing strategy to be treated more preliminarily, not just in phase 3.\n\nOne feature that makes us believe in the project's feasibility is its wide operating possibilities. As we have seen, not only people who seek the service are benefited, providers and local businesses are also favored. Regarding the budget breakdown, the capital allocations seem to make sense, noting that one of the biggest expenditures, AtalaPRISM development ($15,500), is with a very important part of the application, to promote the unique identification of repairmen. However, a point worth mentioning is that the requested budget is quite high, and despite all the organization exposed in the proposal, it would also be interesting if a more detailed research had been carried out or that prototypes of the product were already available; this would even help in a previous generation of engagement around the project.\n\nAs another positive point, we see that there are curricula available from the professionals involved in the project, and the different areas of activity of these professionals are quite complementary for a good execution of this proposal.", "q1r": 4, "q2": "The ideas conveyed in this section are very clear and consistent with everything that was planned. It was not only indicated concepts of what was planned to be achieved, this was also quantified, by monitoring the number of users of the application and services performed, for example. Just as important is the understanding on the part of the team of the positive consequences of these metrics being achieved, and this was also made explicit when commenting on the accessibility and prevention of waste of waste that can be avoided.\n\nAs an additional observation, there is a suggestion to also define goals (along with the indicators discussed previously) to measure the initial performance of the application, it seems interesting to keep in mind an expected number of users in the first months or a revenue goal to be achieved , for example, in the first half after launch.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1009, "q0": "Using Atala PRISM as a business directory will bring a lot of Impact to the Cardano blockchain. The main challenges like the proposal described  is the difficulty in enrolling repair specialist unto the DApp platform. By achieving this goal, it will be easy to get other people interest in Atala PRISM and also in using ADA as a currency.", "q0r": 5, "q1": "The main challenge is enrolling repair specialist unto the DApp platform. There need to be high rewards for repair specialist to use the DApp platform. In this proposal, $7,500 of the budget is provided for Onboarding Tech Repairers and $10,000 for Marketing campaigns. The project can be a huge success,  if a certain threshold would be achieved.", "q1r": 3, "q2": "There is clarity in the description of the problem, the solution and how the proposal is aligned with them. \nThe metrics (Number of Registered Tech Repairers, Services Contracted, Users and\nReview from Users of the platform) were well-chosen, and I believe they are good indicators for evaluating success.", "q2r": 5, "assessor": "z_assessor_1252", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4578, "q0": "Finding Tech Repairers is always a big issue, if found one the cost estimated by the repairer would be very high. hence the mentioned idea helps in bringing both Repairers and customers in a same platform is a great idea.\nThe mentioned idea can be utilized to spread all over the world where the whole future definitely rely on tech people , hence tech repairers demand also increases gradually So this would be fantastic idea for the challenge mentioned. ", "q0r": 5, "q1": "Since the proposer has experience in all the field such as  Software Development, Risk and Compliance, Business Development, Research and Marketing he could have marked all the do's and don't do's in his list.\nThe proposer has also mentioned his task calendar manner in very much organized manner hence completion of task is likely to implemented successfully with the presented plan.", "q1r": 5, "q2": "Proposer has failed to explain about the partners working with for development and hasn't mentioned about the linguistic needs of the customer so this might concern a bit. \nOther than that he has  clearly mentioned  about his team plans, key indicators and smart contractors in the proposal  which is sufficient to audit the progress and the success of the proposal", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5541, "q0": "This proposal aims to build a Dapp that would connect tech repairers with individuals in Ghana and using smart contracts, it would enable people to easier find competent technicians and have their devices repaired in a transparent and simple way.\nThe proposal certainly addresses some important factors for people in Ghana, having already used devices, the need and necessity for repairs increases. However, I also see some other factors that might come in: if the only owned device is broken, how can the Dapp be used? Why isn’t there any “offline” marketing done? Is it illegal to repair devices? If not, are the stalls not clearly marketed as such? How big is the repair technician community? The situation is not clearly enough presented as to enable me to assess the impact it could potentially have on the local community as well as on the Cardano Community at large.", "q0r": 3, "q1": "The timeline is well presented and looks complete. The budget is broken down in several segments, each with a fixed amount next to it, but without any further details on how that amount has been determined, for example there are no number of hours and rate per hour given, that would justify the sums. \nThe team members have described their skills and given sufficient details and have provided LinkedIn links for verification.", "q1r": 4, "q2": "The team has provided a list of KPIs for the project’s progress, that are reasonable. However, no description on where those KPIs will be monitored is provided.\nThe success description is very comprehensive and proves that the proposers have given a lot of thought about the potential positive outcome of their project. However, for the purpose of auditability, these outcomes should have also been provided with some clear, identifiable milestones.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7198, "q0": "In my opinion, the proposal has the potential of addresses mainly one of the most important environmental problems on the planet, especially in developing countries: the bad practices in the disposal of cellphones and electronic devices that increase the level of E-waste in the environment. Work around enhance the tech repairs supply chain can impact the natural ecosystem in a serious way, reducing the the levels of irresponsable polution caused by the consumer and the producer of electronic devices.   Unlike other forms of concertation, trade has the real ability to organize wills around mutual benefits and responsibilities.  Clealy, this proposal can impact the objectives of the challenges and the UN sustainable development goals (14) Life Below Water, (15) Life On Land. My recomendation to the proponents: focus the proposal more on that aspect, commit your work to that issue and speak to the community from that scenario. The funds and the technical support will follow you. Because, in its current state, the proposal is closer to identifying and working around a business opportunity in the services sector than it is to the key aspects of the Nation Building Dapps challenge and the UN Sustainable Development Goals.\n    ", "q0r": 4, "q1": "A proposal with that amount of budget and that duration (1 year) needs to be more detailed about its process in relation to the Roadmap and Budget. The activities in the Roadmap and the items in the budget are too general. They are like the \"headings\" of a necessary explanation. As it stands, it is not possible to connect and understand the relationship between the Roadmap activities and the Budget items and to conclude the feasibility of the proposal.", "q1r": 3, "q2": "Good KPIs. Include KPIs on the reduction of electronic waste and KPIs related to environmental issues.  KPIs should be clearly measurable, like water coming out of a pipe.  Interesting fact: as a CA I had classified this proposal as belonging to another challenge, until a minute before drawing my final conclusion, I read the small paragraph discarded to the farthest corner of the proposal (in the subsection \"What does success for this project look like?\" of the section Auditability): \"Reduction in E-waste\n\n\nIn Ghana, the difficulty in getting quality repair services due to proximity and cost of transport compel device owners to prematurely dispose off their devices into the environment, increasing the level of E-waste. This platform seeks to discourage this practice by providing damaged devices a new life so as to prevent device owners from resorting to dumping old devices into the environment for new devices.\"   That change completely my position about the proposal.  And remember, I'm not only CA: I'm member of Catalyst.  And Cardanist.  You should know how picky people like us are about the \"doing good in the world\" thing. ", "q2r": 3, "assessor": "z_assessor_541", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8469, "q0": "Local people in Ghana with poor conditions rely on used electronic devices to do their daily activities on the internet. This proposal offers repair solution for these devices, connecting tech repairers and individuals in Ghana. This is pratical needs and could help certain people in Ghana accessing technology services, even though its impact is not huge. However, I appreciate the proposer's idea as it is the real demand of people living in poor conditions. If executed successfully, this Dapp could help improve environment by reducing of E-waste and create more jobs and convenience for local people, increase their standard of living. ", "q0r": 4, "q1": "The proposer and team members are qualified enough with years of experience as developer, finance and marketing manager and business development. The plan is given within a year with 3 phrases, but I would like the proposer to give more detailed information of who will be in charge of each job and clearer timeline for finishing it. Regarding required budget, I am not sure how the cost is calculated for each task, so it's better if the proposer could give the expenses for each worked hour, for example. ", "q1r": 4, "q2": "Community could check the development of project through statistics from Dapp such as number of tech repairers, number of users, numbers of complete agreements, feedback from users. However, this project is still at the early phrase. I would like to see more done jobs from proposer and team members which shows their seriousness such as created website, social channels for marketing this project to communities or the interface of the Dapp whether it is easy or convenient for users. \n", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9779, "q0": "This proposal is to write a dApp that connects the tech repairer and the person who wants to fix their broken tech devices. This address the tasks of challenge, that to makes it easier for the community in Ghana to access repairing service and helps to increase the income of Tech repairers. On the other hand, it minimize tech trash.\nBuilding a dApp and encouraging users and service providers to use this dApp is a challenge. The proposer suggests smart way of marketing to use ADA as rewards for dApp enrolling, not only get more members, but also introduce Cardano to bigger community.\nIf this project is implemented successfully, it will be case-study for communities in other parts of the world to recognize the same needs in their own country and will develop variety dApps on the Cardano to help more people.\n", "q0r": 4, "q1": "This is a proposal with a good idea. It indirectly helps low-income people access technology at a reasonable cost. This is a big project, requires not only a lot of experience in programming but also other abilities such as project management, marketing plan, finance, company operation.... The proposer should provide more details on how this project will roll out to the market.", "q1r": 3, "q2": "The project implementation is clearly divided into 3 specific phases. Proposal’s team members have a lot of experience in information technology projects. The milestones with specific works is easily followed up and audited.on what the results are. \nHowever, I think it is necessary to measure the results with specific numbers: how many Registered Tech Repairers / Users / Service Contracts do the proposers expected in short and long term run?\n", "q2r": 4, "assessor": "z_assessor_759", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "To create a DApp that identifies tech repairers for quality and cost-effective repair of damaged devices of individuals in Ghana.", "experience": "Combined 20 years’ experience in Software Development, Risk and Compliance, Business Development, Research and Marketing.\nFund 7 Community Advisors and active participant in WADA events\nin Ghana."}