{"id": 400812, "author": "digifarm", "title": "Open ledger for agricultural land", "url": "https://cardano.ideascale.com/a/dtd/400812-48088", "category": 26435, "amount": 55000, "description": "Current problem is outdated & inaccurate agricultural field boundaries created, managed and updated by national Cadastral agencies manually.", "f6_no_assessments": 9, "f6_rating": 4.5555555555555545, "videos": [], "media": [], "f6_assessments": [{"q0": "I think this project sounds great, a reasonable approach to a well versed problem having plenty of detail in both proposal text and attached documents to evaluate the company strategy and business model.  I agreed vs strongly agreed because it seems like the project is aimed at building on Cardano, although the first phases in M1-M6 covering grant funding from Catalyst F8 are aimed at preparation for Dapp building, while the later phases may be funded by VC, revenue, or later grants (not sure).  While there is a business model there is not financial model to explain that sustainability model, but overall I think it's an excellent proposal with the potential to scale massively to new markets - evidenced by the teams capability to secure multiple patents and knowledge about a wide variety of markets.", "q0r": 4, "q1": "This proposal defines a strong, relevant team and a business model with a well structured timeline and budget for research, development, and rollout.  I believe there is a high assurance for implementation with the only exception that I'm curious how the project will achieve sustainability since their F8 funding would be completed in M6 and the project likely requires more resources to continue building.", "q1r": 4, "q2": "Comments presented in the auditability section of this proposal show that the team clearly intends to use the open and transparent development resources typical of good quality project, with regular progress reports to update on the status of their project.  Since this project merges discovery, imagery, development, and customer engagement, I think there are a variety of metrics that can be used effectively to measure this project's success, and if they return for funding in later F9 or F10, it will be interesting to see how those metrics develop.", "q2r": 5, "assessor": "z_assessor_1224", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "Great question re. M6+ sustainability post F8 funding: the highest cost of delineation is processing the Sentinel-2 imagery across all 13.5 mill. ha's in Tanzania (as the initial pilot region) in addition to super-resolving this to 1m per pixel and training deep neural network models for delineating field boundaries - which both require high-performing GPUs and HPC-kit (secured through partnership with Uninett, Norway's national HPC infrastructure) along with R&D work on building the model, this is built-in to the first 6 month sprint, additionally, once field boundaries have been delineated the remaining work remains on the (a) calibration of data, testing against ground truth data and validation (b) piloting the technology (c) securing clients post M6+. Lastly, once we've closed our targeted B2B and B2C clients, this will fund the further expansion as the field boundary dataset will have additional and wider impact and value to the agricultural value chain - land management, national grain inventory, large-scale yield forecasting, assessment of sustainability, traceability and carbon mapping which will enable wider commercial impact and financial longevity. Our value add is the ability to use free, publicly available Sentinel-2 imagery data at 10m resolution from the European Space Agency (ESA) and increase the resolution by 10x in order to get commercial-satellite equivalent accuracy and quality (such as Planet, Maxar and Airbus) at a fraction (10%) of the cost, which in turn makes our field detection tool not only higher accuracy and resolution by 10x but also significantly cheaper (25%) than existing solutions (commercial). "}, {"q0": "The team tries to create an automatic detection of field boundaries and seed acres using Artificial Intelligence. The proposal has considered potential risks that may hinder proposal implementation and give thorough methods to overcome them, be it for the technological risks or cost risks.", "q0r": 5, "q1": "The proposal has stated clearly a roadmap of how and what will they be doing on each step. The budget information is calculated on an average of 65$/hour, however, professional fees such as legal and accounting should be broken down into more details. The team experience and relevant skills were also elaborated clearly.", "q1r": 5, "q2": "The proposal is able to explain their goals in a measurable manner, e.g, accuracy goals, the number of farmers within 9 months, and secure 5 lending from institutions. The team also gives an update through GitHub commit after each sprint thus making the community able to track the progress.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "Your idea proposal was fun to read. Thanks for sharing. Also congrats on the progress so far.\nI like the general idea, the project proposal and jointly defined activities and milestones sounds like a sensible idea to me, not only for the required investment value but also for the project proposal. overall project. In addition, the concept and construction of the project seems well designed, and I will also be available as an expert in the field to assist with the concept and implementation of the project. DigiFarm's solution impact project will enable highly accurate and unbiased agricultural land classification using up-to-date ultra-high resolution satellite data (1m per pixel) to automatically detect field boundaries and seed samples. The solution will address the \"Property Registration\" part of the challenge. Furthermore, this solution will allow smallholder farmers to have easier access to finance, agronomic advice and build their credit profile. Furthermore, with nearly 80% of households in Tanzania engaged in agriculture and at least a third of their income from agricultural activities, access to finance for small-scale producers is a major catalyst for economic growth on a large scale. with those impacts this project will be successful in the future.", "q0r": 5, "q1": "As an active community member, I am confident in saying that the community is, certainly, capable of taking on the challenge. Hosting for the project site and code repositories is available for free through Github. Outreach will be done through Linkedin, Facebook and YouTube accounts (free of charge) along with Project Catalyst media channels.\n  There have been numerous proposals that align with the goals of the proposed challenge setting, and it is certain that the success of the challenge will attract many new and innovative ideas.\n", "q1r": 5, "q2": "Progress is provided in great detail and with overall results assigned to each milestone, the KPIs provided are linked to the goals in the challenge goals. The recommended metrics are very good indicators. well they are specific, realistic and can be measured to track successful progress. As Swarm activities are widely accessed and community participation is very public, I think although the project can tracked and tracked to understand that it delivers the value committed, but it would be better to have those numbers\n\".", "q2r": 4, "assessor": "z_assessor_1477", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "The KPIs of the project are: (a) delineated field boundaries across country-wide coverage in Tanzania (13.5 mill. ha's) at an accuracy of 0.95+ (b) secure 1,000 smallholder farmers (B2C) and (c) 5 lending institutitions. Additionally, have added (d) reducing monitoring and underwriting cost of the lending institutions by est. 5-10% (b) reducing financing burde of the farmers by 5-10% by increasing terms and conditions of crop-input financing (mainly seeds, fertiliser and crop protection)"}, {"q0": "The proposal addresses the problem of loans access for smallholder farmers in Tanzania because of unregistered land ownership. The proposed solution does align perfectly with Cardano essential value which is to provide economic identity. The proposer have also mentioned future challenges (technological and cost risks), but they have already planned the mitigation for each of those risks. However I am a bit concerned with the decision to set up their own infrastructure because HPC system costs a lot of money upfront so it might even increase the cost significantly on the short term, therefore my suggestion would be to still use third party services atleast for the next few months or years, and try to reduce the costs using other strategies.", "q0r": 5, "q1": "The proposer have listed their own experiences and indeed some of them have been in the agriculture tech sector for years, however it would be more verifiable if they also listed their profiles such as LinkedIn, Facebook, or any other platforms. The budget is outlined clearly alongside implementation plan and the timeline seems realistic. There seems to be a mismatch between the budget breakdown total ($58,850) and the requested fund ($55,000), perhaps it is overlooked however this should still be cleared out later.", "q1r": 5, "q2": "The proposer have outlined the success of the project using quantitative measurable metrics and those metrics are indeed representative of the targeted problem. It also contains how they would measure the development progress. However I disagree with the number of Github commits being the metrics to measure aforementioned progress because from the development side, it does not capture the meaning of progress quite well. For example, it is possible that a huge amount of features are being added on a single commit, vice versa, it is possible that a single typo or hotfix is added on multiple commits. A better alternative would be to “held a meeting with Catalyst members once a month” or other activities that could add auditability.", "q2r": 4, "assessor": "z_assessor_1522", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposer does an excellent job identifying the problem of agricultural property registration, specifically in Tanzania. Land ownership data collected from Tanzania's bureau of statistics (2018) shows that out of 8.7 millions farms, only 18% were registered. The proposer comprehensively explains how DigiFarms will add value and address the challenge; the solution will enable farmers to easily access financing, agronomic advisory, and build their credit profile. I am giving this section five stars because the proposal effectivly addresses an issue within the challenge of Nation Building DApps and articulates how DigiFarms aims to provide solutions to small-holder farmers with property registration. ", "q0r": 5, "q1": "The proposer clearly breaks down the timeline of the proposal with extensive milestone details that are aligned to a monthly cadence. The budget is broken down by monthly tasks and the hours it will take to accomplish those tasks, as well as professional and project management fees. The budget requested seems reasonable given the amount of work required; however, there was a delta between the requested amount from the proposal (55,000) and the budget total (58,850), I would like to see the proposer clear this up as it is unclear if the requested amount will cover the entire proposal budget. If the requested amount will not cover the enitre proposal, I would like to know where those additional funds are coming from and how crucial they are to the success of the project.\n\nThe proposer lists a core team of 10 from DigiFarm, all with very extensive credentials that are associated with the skills required for the proposal. There are no links to the team members for the community to verify authenticity. I am giving this section four stars because of the lack of links to LinkedIn, CV's, etc. for the community to validate the team's credentials.", "q1r": 4, "q2": "The proposer indicates that there will be comments for each sprint (four weeks) posted on GitHub, reports and deliverables at each milestone, prototype and web app, and onboarded users and feedback looped. \n\nThe proposer also does an excellent job at defining what success of the project looks like with detailed target metrics after the development of the proposal has completed. I am giving this section four stars because I like the plan for auditability by the community during the development of the proposal, but I would like to see more detail on the plan for reports and deliverables. Please indicate where the community will be able to find the reports and deliverables as this is a significant factor in the auditability of the proposal.", "q2r": 4, "assessor": "z_assessor_1576", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "There are many quarrel among the farmers regarding boundaries of their land, where judgement is not provided by the superiors on time, which has been serious issue among the farmers, hence this implementation acts as an excellent idea where it helps farmers to solve their issue without requirement of any 3rd party members, and also helps in knowing the seeded areas more effectively. hence this proposal effectively addresses the challenge\n", "q0r": 5, "q1": "This is actually quite difficult challenge where proposer has to check all the details from the government and mark the boundaries based on the provided data , sometimes some people wont be accepting the boundaries provided by digi farm .\nApart from that proposer is using right tools to mark out the boundaries and bringing harmony among the farmer which can implemented successfully using satellite images.", "q1r": 4, "q2": "The audit has failed to mention, how it convinces the government agents to get all historical data of farmers and how people accepts the boundaries provided by the digi farm.\nOther than above mentioned points proposal has very clearly mentioned about all the road map working on each month and how budget break down is done on each phases of the road map , it has also mentioned about key indicators that will be used for regularly checking its development. hence The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal adequately addresses the criteria for the challenge and while the primary focus begins in Tanzania the platform solution is applicable across multiple countries.  While the proposal is tackling a daunting task it is focused on the true value of what the Cardano ecosystem and Dapps can impact which brining power and resources to those in need.  The proposer outlines multiple risks (technical and cost) and proposes reasonable mitigation measures.", "q0r": 5, "q1": "The proposer is building off an existing solution and experienced team.  The proposed roadmap and milestones are thoughtful and align with the project.  The budget is broken down into monthly hours needed to complete each milestone/task.  I would recommend the proposer provide more detail between what is technical (model and imagery development) and service (local coordination, blog post, etc.).  The hourly rate, while on the low side, seems rational.  The team has the expertise and has a successful history. ", "q1r": 4, "q2": "The proposer provides both a method to track progress and high level KPIs.  I would recommend the proposer provide more detail (e.g. outreach to 25 farmers per month with 10-15 agreeing to participate, validate comparison on imaged data to ground truth data, etc.)", "q2r": 4, "assessor": "z_assessor_1807", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This initiative has the ability to aid in the making of critical agricultural choices by providing high resolution and accurate data. Depends on the data I received regarding agriculture in Tanzania, I believe the proposer has a solid foundation for launching this project. Deep neural network models and super-high-resolution satellite photos can provide open access to many benefits, which are also the key metrics of the proposal, and they suit the challenge's \"Property Registration\" part. There are two types of dangers listed: technological and financial. The risks are described in detail and in an informative way by the proposer. Additionally, the solution provided is closely related to the dangers. I looked it up and discovered that there is another competitor named Cropin who uses the similar technique. So I would like to question the proposer how they believe their idea would outperform Cropin, and what distinguishes DigiFarm from them.", "q0r": 4, "q1": "Not only is the roadmap in Fund 8 incredibly helpful, but so is the roadmap after fund 8 that follows. This indicates that the proposer and their team prepared thoroughly. I am impressed with this plan and offer my compliments. The budget is divided into hourly paid, and the proposer estimates the work time required to meet the deadline. The project is hosted by the proposer using a free platform and social media. The marketing role is also impressive because the team has experience in agricultural technology and SaaS-models. Given 15+ years of farming expertise and collaboration with Felleskjpet, among other things, this idea has a strong probability of success. DigiFarm's core team members are also fully competent of carrying out this project. It would be fantastic if the proposer could give a link to prior works of the member.", "q1r": 5, "q2": "The team has supplied great explanations of the sections that are crucial to determining the proposal's auditability. It includes the information needed to comprehend the immediate activities that will be taken following the allocation of funding.  This section, in my opinion, is appropriate and consistent with what the team is going for. The success measures are good because the metrics are related to milestones over time. ", "q2r": 5, "assessor": "z_assessor_1934", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The issue raised is outdated & inaccurate field boundaries created, managed and updated by national Cadastral agencies manually. This is true for poor countries where the administrative are not developed enough to manage land adequately, even developing countries in areas where land management is not good. Even in big cities, land is not uncommon, affected by bad cadastral management. Proposal is suitable for this challenge. The solution is Automatic detection of field boundaries and seeded soil samples using unbiased, highly accurate SatEO using up-to-date Ultra High-Resolution Satellite data (1m per pixel). ) to automatically detect field boundaries and seeded soil samples. The solution will address the \"Property Registration\" part of the challenge and allow smallholder farmers to more easily access financing, agronomic advice and build their credit profile. I am especially impressed with the use of technology to collect verifiable data instead of using human resources which would be limited and take a long time to implement. The proponent presents two main risks and provides solutions for these two risks. with risks where field boundaries are often small and dynamic, due to wide variations in agricultural practices and variability, topography, crops, agricultural practices, and weather (cloud cover) limit the scale interpreting image data correctly and accuracy leads to low field boundary detection then the solution is to implement DigiFarm super-resolution Sentinel-2 resolution from 10m to 1m per pixel however it is not thorough, should supplement studies or coordinate with local authorities to determine the measurement.", "q0r": 5, "q1": "The roadmap provided by the proponent implements month by month for 12 months with clear mandates to ensure project completion. I appreciate this. The proposed cost is calculated by working hours with each task is clear, with different resources and professional experience, so it is necessary to add different unit price information to be transparent in spending for each task. each position. I have read the information provided on the web (https://digifarm.io/aboutus/) is very complete to each member of the project. Experience, professional skills, and clear work assignments, you guys are a professional team, I greatly appreciate this information.", "q1r": 5, "q2": "For the project metrics mentioned, it would be nice to include more metrics related to the results of places using this system. I am very impressed that the project has been started before and there are successful test results.", "q2r": 4, "assessor": "z_assessor_610", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "Automatic detection of field boundaries and seeded acres using super-high resolution SatEO initially in Tanzania open to smallholder farmers", "experience": "DigiFarm has developed deep neural network models for automatically detecting field boundaries and seeded acres at 12-15% higher accuracy and in-season agricultural land using super-resolved SatEO (Sentinel-2) imagery at 1m per pixel."}