{"id": 400945, "author": "tarun", "title": "PropX :- Property Exchange", "url": "https://cardano.ideascale.com/a/dtd/400945-48088", "category": 26435, "amount": 199500, "description": "Real Estate is an illiquid asset, which means that trading is a lengthy and bureaucratic process; ownership does not swap hands quickly.", "f6_no_assessments": 6, "f6_rating": 3.2222222222222228, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=13999"], "media": [], "f6_assessments": [{"id": 2751, "q0": "While the proposer does identify the problem with illiquidity in real estate and has potential to bring value to the Cardano ecosystem, the proposal does not directly address solutions outlined in the challenge of Nation Building DApps. The proposal indicates that in order for properties to be eligible for instant swap, they will have to be sold for 10% lower than the market price, this seems to bring value to investors of PropX but not impoverished nations that Nation Building DApps aims to help. I have given this section two stars because, with the way the proposal is written, PropX could find a place within the Cardano ecosystem but I do not believe it fits under Nation Building DApps. I would like to see the proposer include additional information on how PropX will benefit the people within impoverished nations.", "q0r": 2, "q1": "The proposer clearly breaks down milestones for development across three quarters which include six months for technology development. The budget is clearly broken down by developer specialty (6 months) and marketing (3 months). The budget requested seems reasonable given the market rate for developer skills and the amount of time required to deliver the proposal. \n\nThe proposal indicates that the forecasted challenges faced are liquidity in the PropX ecosystem and connecting smart contracts to real world data and real world data back to smart contracts. I like that the proposer is anticipating these hurdles; however, I would like to see a contingency plan in the scenario that the team needs additional time and budget for unforeseen hurdles. \n\nThe proposer indicates the team will consist of two groups, one of them being Blue Earth Homes, which will handle marketing, real estate listings, developer relations, investor relations and Data Oracle generation. The proposal does not provide any details on the developers required. I am giving this section three stars because given the current information, I cannot make a decision on the likelihood of success from the team. A five star rating would include information on the developers and their history along with links (CV's, resumes, LinkedIn, published work, ect) or a talent pipeline with specific list of skillsets that they will look for in developers. I would also like to see linked information on Blue Earth Homes included in the proposal, as it seems they are crucial to the success of this proposal but there is little information outlined or analysis present in the proposal regarding why Blue Earth Homes was chosen, what value they bring to the table over their competitors, the terms of their agreement with the proposer for this project, etc.", "q1r": 3, "q2": "The proposer has clear milestones broken down per quarter across three quarters and clearly defines metrics for measurable success after the proposal has been completed. The proposal is missing auditability for the community to track progress during development of the proposal. I am giving this section three stars because the proposal needs to include a plan to inform the community of progress updates during the development of the proposal. A five star rating would include progress reports via medium articles, blog posts, ect.", "q2r": 3, "assessor": "z_assessor_1576", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "About the impact, the instant swap is one of the feature of the PropX ecosystem. It also has a general decentralized marketplace where users can post listings at their own price. The instant swap is only for people who want to sell a property. And for the 10% price depreciation, in order to sell a property instantly, there should be a risk-free incentive for the buyer. If we go less than 10%, then I'm afraid people will not have enough incentive to facilitate instant swap. Apart from instant swap, there are many other features that are required to build nations. Like a decentralised mortgage to finance properties, decentralised insurance, decentralised real estate market place, property management, fractionalization of real estate. Using the fractionalization, users can also run INITIAL PROPERTY OFFERING. There are endless features and deep use cases other than the instant swap.\n\nAs for the feasibility, PropX plans to do token sales in order to receive further funds for Liquidity and Oracles. PropX will have a yield farming program with good incentives to attract liquidity apart from the in house liquidity that will be generated through token sales. There also will be an Oracle Provider Incentive Program, through which data oracles would get attracted and connect the platform to the outside world, in return, they will be incentivized with minimal fees that will be collected for every price evaluation.\n\nAs for the auditability, the project's website and social media pages are just around the horizon. They will be released in the coming days. Once Reddit, Discord, Medium and Twitter will be live, the project will be as attached with the community as possible."}, {"id": 4897, "q0": "First of all, this proposal is mainly based on crypto system so it might create a big profit to the Cardano ecosystem. The proposer also mention it pretty clearly in the project. It could be said that in addition to being a computer scientist, the proposer of this project is kind of a professional in   finance and real estate industry as well or at least have done a large number of research on these fields. They explain very carefully about their plan, how the system works, how the property is valued, and about all the elements and features included in the system. They are providing a distinctly package full of clear information about all the details that they already planned. Each features or elements of the PropX has their own clear, understandable, well-prepared contents that contributes to make the proposal more and more persuasive. With all of the detailed description and vision of PropX, I could not agree more on the impact of the project. But for one minor detail, the proposer could provide some more information about how they would address the foreseen risks to make the proposal more perfect. ", "q0r": 5, "q1": "\"As for this part, the timeline matches really well with all the features and elements of the project. It is also devided clearly into 3 stages with tasks needed to be done in each stage, and those tasks is seemingly divided based on level of importance. \nThe budget also shows that the proposer has calculated very carefully with a melticulous plan for the project. It has three clear parts of spending, which include smaller divisions of each spending. \nThe team members introduction is also a good section as the proposer can divide the roles of the team with high clarity and details. \nThe professional writing style of the proposer is a plus point to strengthen this proposal's reliability. \"", "q1r": 5, "q2": "\"The audibility of this proposal is well listed and the description of the success appears in a visible way with great example. Still, I do think that this part would be more persuasive if the listed progress and development of the project is more mearsurable. Specifically, the success of the project could be measured by how many properties would be listed in a period of time, for example, 1 million properties listed in 1 year. Or for the daily transaction volume could aslo be measured and targeted in specific numbers, too. In that way, the auditability rate could be way higher.\nOther than that, the proposer do list out several SDGs that they could achieve by launching this project, which add a minor plus point into this part.  \"", "q2r": 4, "assessor": "z_assessor_1796", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5936, "q0": "The proposer has identified a problem and a solution to the problem but it seems that the proposal doesn't fit well into the Challenge brief, as \"swapping a villa in Italy, for ADA\" is not addressing the people in need for helping them out of poverty.\nA goal for this type of proposal (real estate properties) could be the creation of a land registry using DID for a rural area in a country from Southern Africa.\nAs it is, the proposal seems that is not adding any real value to the Cardano ecosystem.", "q0r": 2, "q1": "From the info provided seems that the team posses only experience regarding properties sales so it is unclear what experience has Tarun Karamchandani to be a Lead developer (as it stated in the proposal).\n\nThe budget requested (almost $200k and 25% from the entire Challenge fund) looks like is not based on solid facts as the timeline provided is not making very clear what is to be done and what are the deliverables to be expected.\n\nThe proposer has not considered challenges and risks relevant to a successful implementation. I see a lot of legal constrains for this type of activities (owners have to be registered for paying taxes (globally), many countries around the world don't accept cryptocurrency payments etc.)\n\nThe proposal doesn't explain technical aspects like architecture, language and technologies if they are crucial for implementation. (Mobile development - Android, iOS or both?)", "q1r": 2, "q2": "No KPI/metrics are defined to measure the success of the implementation (how many users are expected to onboard the platform? How many are expected to stay?)\nThe proposal, as it is, looks more like a concept than as a working product. Also it is not for the purpose this Challenge is expecting. ", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "About the impact, one of the major building blocks of any nation in this world is property ownership. The project solves this problem in the most efficient way possible, by putting all the land ownership data in a trustless blockchain. There is no better way to give clear title and solve this major issue in 3rd world countries. The instant swap is one out of many of the features of the PropX ecosystem. Apart from instant swap, there are many other features that are required to build nations. Like a decentralised mortgage to finance properties, decentralised insurance, decentralised real estate market place, property management, fractionalization of real estate. Using the fractionalization, users can also run INITIAL PROPERTY OFFERING. There are endless features and deep use cases other than the instant swap. This project will reduce the complexity of real estate drastically and make everything very convenient for an everyday human being."}, {"id": 7592, "q0": "The problem the proponent presents Real Estate is an illiquid asset, which means that trading is a lengthy and bureaucratic process; ownership does not swap hands quickly. This is a current problem in many countries, the procedures to sell a land property are cumbersome and time-consuming and for many people, they will have to hire a third party who is an experienced broker to carry out the process. the loss of brokerage fees from 1% to 5% of the total property sold. Many similar ideas and projects have been implemented on blockchain and they can be applied globally. The solution proposed by the proponent provides our users with an instant swap tool where they can swap their real estate for ADA or any other token instantly. Includes solutions (Property Swap / Fractional Ownership of Asset / Auctions / Manager Roles / Rental Contract / Decentralized Mortgage / Decentralized Insurance / Inheritance / Global Trading ). The problem is that the property will automatically be listed on the PropX market at 5% less than the market price generated by the AI ​​valuation algorithm, so it will only attract those who want to sell. get property quickly although if they hire an outside broker it can take as little as 2% commission. The identification of assets as well as verification of validity are also not covered in this proposal. . The proponent has proposed 2 risks and solutions (Data Oracles / Create liquidity) There is another risk that the proponent needs to take into account that is Fractional Ownership of Asset, especially for assets that someone wants to buy. actual use but because they only hold a certain percentage and some others do not sell their shares, then how will the actual use be decided?.", "q0r": 5, "q1": "The project implementation roadmap is implemented in 3 quarters from the third quarter of 2022 to the end of the first quarter of 2023 with clear tasks to be performed. The proposed calculated for specific assets (Technology Development / Oracle Data Generation Setup / Marketing) and token costs are also clearly stated in the attached document https://cardano. ideascale.com/a/idea/400945/53148/download. The team consists of two groups. One is a very reputable real estate company based in Dubai called Blue Earth Homes. This team will handle marketing, real estate listings, developer relations, investor relations, and Oracle data generation. However, credentials about groups or group members are not included in the proposal, it would be nice to have more complete information about participating members.", "q1r": 3, "q2": "The measurement indicators are also fully stated by the proponent, there is an indicator of Accuracy of market assessment, for which there will be a way to properly evaluate this indicator. Within minutes the user swapped his mansion for ADA and his investment in that company, this is the definition of success.", "q2r": 4, "assessor": "z_assessor_610", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8068, "q0": "\"Property ownership is one of the most headache problems in the world for every nation. The idea of this project is like making an exchange platform that is not just for swapping handly quicker but also helps them enhance the ownership power & utility. There are some basic features in the platform that I believe are vital for the real estate industry that people will love to experience, including fractional ownership of assets - unlike other real estate platforms - this function is awesome that can help the owner to sell a part of their property easily, or auctions or ultimate management tool with awesome mechanism will help the owner to manage their property manager team better... and more. The content about the feature that the proposer provides is very detailed and easy to understand with case studies and flow explanations that I believe will attract and drive more need of this app in the future because of its convenience. Besides, the proposer also states clearly how their idea impacts the world by helping solve real estate problems. But I hope that they can give more metrics to show more impact on the ecosystem. \nLastly, some risks were listed at the end of this session but the team didn't suggest any solution yet for solving them. Hope that they can overcome all of them. \"", "q0r": 4, "q1": "\"The roadmap that the proposer provided is short with outlines but I think it's enough because they have a good explanation about the feature and solution at the beginning. But my advice is that they should have a detailed plan about how they will do the marketing to attract users because this will affect the assessment of the marketing budget and the key metrics that they provide in the auditability session. However, the budget is broken down into monthly payments is good, but for making people less confused about the monthly rate, they should tell us which amount is used for how many people in a single position. About the team, the proposer just give us the name of the founders and a brief about cooperate team for this project without experience and ability.\nSo, after all the info the proposer provided is so hard to assess with high feasibility. \"", "q1r": 3, "q2": "The key metrics that the proposer provides are aligned with their solution and objectives. And they're very easy to track on their platform when it's finished. But I think that the proposer should list some tools or channels to help track their development progress if it's funded by the Catalyst project. Moreover, it's great when they can tell a success story by a case study of a user that uses their platform. It's very easy to understand and visualize how it works well on success. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8227, "q0": "Proposer presents the issue of selling and buying assets as a lengthy and bureaucratic process and that ownership does not swap hands quickly. An elaborated solution to the problem is offered through the PropX platform which, according to the proposer, will make this asset class as liquid as possible by providing an instant swap feature in their ecosystem. It would be good to present how this project will have an impact on the Cardano ecosystem and how it will add value to the Cardano ecosystem. 5 KPIs are listed of which 2 align with the outlined challenge settings.", "q0r": 3, "q1": "It would be great for this project but also for the Cardano community if the proposal provided links from which we could get more information about the team, skills, knowledge and experience needed to implement this project. Given that the total budget of this challenge is $ 800,000 and the team is asking for $ 199,500 in my opinion it is very unreasonable. Budget break down to the items was made. It would be good to have a more detailed work plan so that the community has an insight into what will be done within the given real time frame of 9 months needed to implement the project. I would like the team to work out the possible risks and challenges that may arise while working on the project.", "q1r": 2, "q2": "Proposer presents a road map from which we can see when work on the project would begin and when the project should be finished. The KPIs listed need to be adjusted and elaborated in more detail to align with the outlined challenge settings. In the challenge settings we have 11 key metrics and in the proposal we have 5 of which two correspond to the challenge. It would be difficult for the community with such KPIs to monitor the development and success of this project.", "q2r": 3, "assessor": "z_assessor_656", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "One of the major building blocks of any nation in this world is property ownership. The project solves this problem in the most efficient way possible, by putting all the land ownership data in a trustless blockchain. There is no better way to give clear title and solve this major issue in 3rd world countries. The instant swap is one out of many of the features of the PropX ecosystem. Apart from instant swap, there are many other features that are required to build nations. Like a decentralised mortgage to finance properties, decentralised insurance, decentralised real estate market place, property management, fractionalization of real estate. Using the fractionalization, users can also run INITIAL PROPERTY OFFERING. There are endless features and deep use cases other than the instant swap. This project will reduce the complexity of real estate drastically and make everything very convenient for an everyday human being.\n\n"}], "solution": "We will provide our users with an instant swap tool where they can swap their real estate for ADA or any other token instantly. ", "experience": "I am a Computer Scientist by education. I have been in crypto for 3 years now. I have worked for a blockchain technology provider company where we built various DeFi protocols for clients. Before getting into crypto, I was part of my family real estate brokerage business."}