{"id": 401010, "author": "migamake", "title": "AdaSign", "url": "https://cardano.ideascale.com/a/dtd/401010-48088", "category": 26435, "amount": 76000, "description": "We need easy way to put legal documents, and basic smart contracts on Cardano with no code.", "f6_no_assessments": 9, "f6_rating": 3.7777777777777777, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal fits well with what the challenge seeks, although it does not seem to me to have as much impact on the social/beneficent bias, which from what I understand is one of the fundamental pillars of this challenge. The project here is about creating a Dapp that, in the author’s own words, provides an “upload of legal documents (if necessary)”, that are easily read by users, and are minted on the Cardano blockchain via smart contracts. . The purpose of this new platform would really be to facilitate document attachment in various cases (it would be interesting if the proponent could cite some examples of using Dapp. houses, I don't know?). It seems to me to be a platform that is quite versatile, and precisely because it has so many usage options, it would be useful for the proponent to explain with practical examples how Dapp would work for people. This project is certainly very beneficial for Cardano, because it would allow a series of documents to be minted on our blockchain, payments would be made in Ada as well, that is, a practical way of how our technologies could be used would be generated. This would be a gateway for new people to get to know Cardano and maybe become adept at the facilities that our blockchain provides, that is, I realize that this Dapp would be a good way to popularize Cardano. My biggest doubt in terms of impact would be how it aligns with the objectives of the specific challenge, to mine here we want to finance projects that have a strong social nature, that help the economies of developing countries prosper, that are able to facilitate and benefit the lives of those who are most in need, either through different types of aid. I think this Dapp is going to be very beneficial for Cardano and also for its end users, but I'm not so sure about the more social impact as I said at the beginning of my review. Therefore, I will give 4 stars for the impact of the proposal, precisely because I still have doubts about these more humanitarian applications of the project, which in my view are what differentiates this challenge from that of Dapps and applications. \n", "q0r": 4, "q1": "The feasibility of the project is ok, we generally know information about the roadmap, budget and team, but they could be described in more detail. In the case of the script, first, it says the tasks that would be done so that in the end the Dapp would be ready and complete. Each of these tasks is also explained better, even if they are just summary topics. In fact, the project is very technical so not all CAs will understand this process from the information that has been provided, but at least the proponents are concerned with placing us on the process. What remained pending was a better established temporal notion. We don't know exactly how long each of these tasks would take, so it was difficult to understand the phases. It would be important that, together with the presentation of the tasks, the proponent inform us in how long, approximately, they would be executed. Would each one take weeks, or months to complete? Would they all happen next, or maybe some could run in parallel? These notions were a little abstract, I always indicate that the script contains a good description of the tasks to be performed as well as deadlines to be obeyed. Now talking about the team, I thought this part of the proposal was great, we know who those involved are and information about them such as their names, roles, professional experiences, etc. It's positive that some people here have experience with Cardano, as it gives more security that the technologies in our ecosystem are executed correctly. My suggestion is for everyone to attach a link where we could see more of their work in practice, as happens with Michał in gitlab. In this way, trust in the team would be further emphasized. Finally, regarding the budget: the asking value is considerably high, however the project is complex, many professionals would be working here and many tasks would need to be performed. With this, the need for a large investment is justified. The explanation of the parts is good, it is known about each part of the budget, how much it would cost and why, although some parts, especially the more expensive ones, such as the “environment for uploading and signing documents in Cardano” (which would cost 20k alone) should have been better detailed. Thus, we would understand the reason for the requested value for them. So I think feasibility has strengths, especially in the team presentation part, but it could also make some improvements to make it perfect. \n", "q1r": 4, "q2": "The auditability suggested by the proponent would verify the success of the project objectively and accurately, but not completely. As a success, the scenario outlined by him was that people sign documents on his platform, SaaS automated tests are established and at least 1 large organization uses AdaSign to sign their contracts, eliminating the bureaucracy. In fact, these are very direct statistics by which we can get a sense of whether the project is being embraced, that is, if its use is being done as planned. But in addition to how many people used this new technology, a user satisfaction survey could be carried out. That way we would know what these people would be thinking of the new functionality, if they genuinely achieved the goal of dispensing with the bureaucracy that involves reading and signing documents, if they started to adopt Cardano's technologies for other things too, such as if they are investing in Ada or using the blockchain to mint NFTs... Finally, to understand what impact this proposal had on the lives of these people, both in relation to AdaSign and through external means. The proponent does not suggest how to audit the process, I suggest that, as I said before, he includes dates in the elaboration of the roadmap and also that he establish a direct contact with the Cardano community, in order to provide gradual feedback on the progress of the process. This can be done either through the preparation of reports (monthly, for example), or in meetings through video calls, which could take place in specific rooms to follow up on funded proposals after the Town Hall sessions, in short... different ways to establish this bridge, the important thing is that we are constantly updated on the status of things. So I don't think the bidder suggests us specific ways to track and audit his bid, despite doing so by basic means. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "They proposal has indicated the main features of the product, how their solution will operate to address the raised problem by providing English description of smart contracts. This solution is projected to have direct impacts on Cardano and encourage the migration of national bureaucracies to digital domain and blockchain application, which are well aligned with the key metrics of the challenge. \nThe main problem they will encounter is the acquisition of customers, as mentioned in the proposal. However, there is a need for them to make it clear about steps taken to improve the customer engagement. Once their strategy is presented, the community will have a solid base to assess their ability to decrease the liability and keep their project going strong.\n", "q0r": 5, "q1": "All the main tasks and subtasks are illustrated in their action plan. These tasks are written clearly and in a logical order, allowing the community to grasp the series of required activities. However, it would be better if they pointed out the dates or specific durations to mark their occurrence over a particular phase. By doing this, they would give the opportunity for the community to monitor and detect any delays that may happen. \nFrom their ation plan, they expect some promising deliverables coming along with a concrete budget breakdown. This proper breakdown will benefit the community in assessment process related to their spending strategies, transparency and allocations of resources. The team members are well presented with highly working experiences and abilities. The reference links of members for further consideration are also provided. \n", "q1r": 4, "q2": "The specific KPIs are provided to measure the progress and the development of the project. These indicators are closely linked with their expected deliverables, helping the community to track the accomplishments of the project. One small thing might be necessary is the specific required number for each KPIs to be defined as successful. By achieving these numbers, they will prove the effectiveness of their strategy and the potential for sustainable success. The clear goal is firmly set in the proposal, helping them stay on track and keep every member effectively commit to the work.\n", "q2r": 4, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to simplify having documents notarized. I think it can bring many advantages through brief and concise explanations for the impact, such as it reduces the time and the complication of generating English text that describes contract behaviour and provides transparency, provides a conventional record, let users analyze smart contracts behind each document by using English description of the policy, allows the bureaucracy to move entirely onto ADA blockchain, etc. After all, it will result in an easy migration of national bureaucracies to the digital world and increase the scale of the ecosystem.", "q0r": 5, "q1": "I suggest the team add a time-framed schedule telling what tasks need to be done at which period of time to achieve the goals listed at the end of the proposal. Just providing the tasks is not enough, I might say. The budget list is quite clear and offers enough detail on how the needed sum of money would be used. This helps to understand the rationale behind the numbers and check its plausibility. The team experience mentioned is quite vague and could have provided more detail such as some reference links to verify their background and previous experience.", "q1r": 3, "q2": "There are 2 final deliverables but one of them is not clearly described. Some metrics could be added for the “People will sign the documents using the AdaSign” to bring the community a better visualization of the success. For instance, how many people will sign the document using AdaSign? The same with the KPIs section, I expect some estimated numbers would be included to provide insight to the success of the project. And by which method or through which channel can the community track the development of the project? I suggest a channel where the community can interact with the team members and follow the progress of the project would be add.", "q2r": 2, "assessor": "z_assessor_1702", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The idea proposed by the proposal team is to improve the simplest way to integrate legal documents and smart contracts into Cardano. And the team created this project as a way to improve and develop the problem posed. I think this project has a lot of potentials to develop and make a positive contribution to the Cardano ecosystem community.\nAs for the Solution, the project has set out very clearly about the features as well as how the project works to influence the potential audience leading to the development of the Cardano ecosystem. The proposal team explained the solution in great detail. It is specific to each technical aspect. This clearly shows the impact of the project.\nThe content to show the project in accordance with the key metrics of the challenge is still quite basic and sketchy. The impact of the project on the Cardano community is not clear. Please explain more about the KPIs proposed by the proposal. It should be specific to each part, every detail. This will increase the credibility of the project.\nIt seems that for this simple project, the biggest challenge is attracting users. The team also anticipated this challenge. Through that, the proposers also propose a solution to acquire customers. The team has seriously considered the development direction and calculated to minimize the barriers when implementing this project.", "q0r": 4, "q1": "The project management team is comprised of members from different fields. They are all experts in those fields. With the existing knowledge and experience, they promise to develop the project according to the proposed proposal. On the other hand, the development of the project also contributed a lot to the expansion of the Cardano community.\nHowever, the project needs a more specific roadmap. Roadmap should be divided into specific timelines. Each milestone must state the tasks that need to be completed. A realistic timeline to push the project to completion is essential for the project to be assessed as having the potential to achieve its goals. The work items to be completed should also be described in technical detail and examples can be drawn from case studies.\nThe budget plan is logically divided and presented clearly and easily with bullet points. I consider this proposed budget to be fully in line with the detailed project plan. However, I think if possible, consider the number of people needed and the important positions for the project to be implemented. The budget plan should also include a section for staff salaries.", "q1r": 4, "q2": "Proposal should clearly show quantitative indicators so that the community can easily track the progress of the project. Please replace the phrase \"number\" with a specific number so that the community can capture the exact number of contracts and the number of customers the project wants to attract. Through that specific number, viewers can see the potential of the team's project implementation. In addition, the results that the project is aiming for are also very specific and clear.\nSince this is a simple project, the success of the project is also defined in the simplest terms. Looking at it, the community can easily assess that the team has seriously implemented the set goals if the indicators are in line with the detailed plan.", "q2r": 4, "assessor": "z_assessor_1709", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The main purpose of the project is to build Allow Transformation of National BureauCracy Into Blockchain Applications with Notarization and Cloud Storage of the Signed Documents. Through the analysis of the proposed person, I saw the suitability between the proposal and Key Metrics of Challenge, decrease inequality between developers by decreasing threshold on entry, contributing to promoting innovation and growth of dApps Cardano ecosystem. The author did very well in describing the core features and product operations, analyzing the positive impacts that the project brought to the community and Cardano after success. Risks and solutions are also fully mentioned. In general, I think this proposal will solve the problem that the challenge poses.", "q0r": 5, "q1": "Although they have listed the main working categories and objectives/products that will be completed in the project development route in a very detailed way, but the proposal has not yet presented timelines, even if this is a long-term project, the proposed person should still shape the milestones working and complete the product, which will make the community evaluate the ability to realize of project. The plus is the proposer has provided a budget table in detail the categories of the work of providing solutions and budgets allocated to items in accordance with the project development plan. Their group includes members with knowledge and skills related to the field of the project they are pursuing. Not only is understanding and exciting participation in the Cardano community but also provides other initiatives and projects for Cardano. However, only a few members attached to the records can be confirmed, I encourage the proposal to update the valid records soon for all members to consolidate what they describe, the records may be LinkedIn, CV, or records of projects that members have successfully implemented before. In general, I found them preparing quite well for the project development plan, they shaped what they would do, only a few shortcomings as I mentioned.", "q1r": 3, "q2": "There are a few KPIs that give specific indicators to measure, a few KPIs do not have specific indicators. Take the KPI of Number of Customers and Smart Contracts signed for example, they should give some specific numbers that they calculate will be achieved after the project is successful. Because the project implementation time has not been determined, the ability to audit and measure the success of this project is quite low, it will be difficult to know when the project and KPIs are completed. Furthermore, the proposer has not yet provided us with the information channels/tools/environmental so that the project lovers can access the information on the progress of the project. Lack of information channels about the project and specific KPIs are always a big problem that most projects encounter. Basically, the core idea is good, but there are more information to be supplemented and perfected.", "q2r": 3, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Through their proposal, the team wants to build a notary Dapp where everyone could upload their legal documents onto the blockchain and attach basic smart contracts to them, thus in time eliminating the need for bureaucracy and speeding the time needed to complete many tedious tasks. \nWhile this is a splendid idea, as everyone would like to get rid of unnecessary bureaucracy, that cannot happen unless these smart contracts are being recognised in legal procedures. And that requires input from the government. This is a long-term goal, indeed, and things need to get started, but without it, these short-term actions have little value.\nHowever, the main purpose of the proposal fits into the challenge brief and has the potential to positively impact the Cardano ecosystem", "q0r": 4, "q1": "The team has provided adequate information regarding their expertise and for some of the team members even links to prove it. The plan and deliverables are detailed, the budget is broken down per deliverables, however there is no other metric used to define the numbers in the budget and to prove how these numbers have been deemed correct. For example: “ Environment for uploading and signing documents on Cardano” does not have any details on what is needed to build this environment, how many hours, what skills etc. Or, “tutorial: atomic swap for multi-party contract”, is it related to the already existing service https://atomic-swap.io/ and the amount of $3k is for a screen recording of how the service works, etc? An incomplete budget cannot be correctly assessed, and as such it is hard to evaluate the successful implementation of the project.", "q1r": 3, "q2": "The KPIs are few and only partially complete, would have been important to have more input on that. The succes, even though succinct, it looks achievable, though some objective numbers would have helped in better defining it - how many people signing with AdaSign is considered a success: 10, 100, 1000? That would have given the community the necessary data to impartially determine the success of the proposal.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "\"Attach legal documents and information to the blockchain to form a notarized signature for administrative, procedural and paper handling processes of government agencies.\nThis is basically the idea of allowing description and information management of smart contracts that can be read and translated in English. They will create ready-made templates to use in describing the contract, making it more transparent and providing information faster to users.\nThey will develop an English and Plutus compiler incorporating MVP technology, allowing payments and authentication with cardano. This is not a bad idea, when we need to speed up the process of applying blockchain to legal document management and administrative handling in the government.\"", "q0r": 5, "q1": "\"They will provide signed and co-operative documents. Includes payment of expenses (IPFS storage of these documents).\nThis is a good sign that the reputation of members developing on cardano is getting clearer and easier to verify. The budget they give is detailed and clear enough, the cost is reasonable. The team has many years of relevant experience. This shows the feasibility of this project.\"", "q1r": 5, "q2": "They will use the number of users, the number of government agencies and the number of papers processed to evaluate the progress and success of this project. They have an automated progress checker called SaaS. The criteria are not as clear as the target number. They also do not have much survey data about the previous situation.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The project idea is close to actual needs, meeting demand of majority users around the world who want to use simple smart contracts but do not know how to code. This project address Fund 8 Challenge.\nIntegration with Saas applications will make successful deployment easier. Uploading common formats such as Word, PDF, ... and allowing signing will help expand the scope of use by everyone. If this project can be successful, it will meet the needs of many users. Acquiring initial clients will be a challenge but I believe those with experience on this project can do it.\n", "q0r": 5, "q1": "I see here an experience team with numbers of resources which are very strong. The required budget and expenses allocation are reasonable. The technical issues in the project are presented at a high level of expertise. No more to say as this is a very professional and experienced team. I believe this project will have a high potential of success.\nThe deliverables of the project are quite numerous and detailed to the single point. \nHowever, I would like to see timelines with completed tasks more clearly.\n", "q1r": 3, "q2": "This is a good project with strong team who is professional and experienced. \nHowever, the KPI metrics needs to be more specific. Each phase must have clear timelines for easy tracking and evaluation. Each outcome must be specific numbers to be achieved.\n", "q2r": 4, "assessor": "z_assessor_759", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal intends to create a Software as a Service (SaaS) application to put legal documents, and basic smart contracts on Cardano with no code for moving bureaucracy entire onto ADA blockchain. It's a good idea IMO, but it will be clearer if the proposer show the evidence of bulky bespoke bureaucracy especially in developing countries as a cost of the problem that this proposal need to impact.\n\nThis proposal has a competitive advantage and growth potential however it mostly depends on the citizen/customer and government. It'll be more convinced if the proposer deeply and clearly explains about the intention in attracting people before affecting the government in radically simplify the bureaucracy.\n\nBy providing decentralized solution to people/nations infrastructure, the proposal justified its relevance to the challenge brief but it's better if the proposer tries to emphasis the problem of current bureaucracy that the need this solution.\n\nThe proposal identifies a desirable outcome that is relevant to the goals of the challenge and clearly addresses the problem statement.\nThe proposer forsees some challenges/risks and gives out solutions for them during implementation but it'll be more positive if provide some ways attract/acquire customer to increase feasibility.\nIn generally, this proposal has impactful for the community and Cardano ecosystem.", "q0r": 4, "q1": "The team consists of 3 developers, and 4 expert but only Michał has Gitlab link, it lacks reference link of Julian Ospaldfor for showing experiences and works, information and link about another members are missing. It's very good the proposer modifies linking directly to detail experiences and works of whole team for enhancing the feasibility of proposal.\n\nAs mentioned, the most important works of this proposal are publicize the solution and acquire customers but I could not find any member has experience in marketing that the proposer need to aware and pay much attention for implementing this proposal successfully.\n\nThe budget is outlined clearly and broken down into identifiable items but it's better if the proposer breakdown more detail into number of working hour and their salary for the community clear know if the requested amount is enough.\n\nThe progression of KPIs and their associated values are either missing and not sufficiently measurable. It will be more convinced if the Author give out the detail step-by-step KPI such as: 1K customers joined with at least 1K smart contracts signed and displayed on the front page during the first 3 months.\n\nThe proposal lacks an explanation of the technical aspects for implement successfully the proposal, such as: technology for user identify such as ATALA PRISM, what encryption mechanism for signing documents.\n\nThe author implied marketing tasks to campaign and acquire customer but unfortunately it lacks of a marketing plan with detailed media, channel and target audience.", "q1r": 3, "q2": "It's a pity that roadmap are not listed in this proposal for tracking. It'd be better if the proposer modify milestones and timeline for the community could monitor how the project is progressing.\nThe proposal's KPIs and other measures of success are not very auditable or available. It  requires the community a significant amount of effort for auditing these measures.\nThe team does not designate any point of contact  for providing regular updates to the community. If could, the proposer make a communication plan and method for updating information via website or communication channel such as: Discord or Telegram,…\nThe proposal somewhat defines what success means but somewhat not derived from their KPIs such as: at least one big organization will use AdaSign instead of bespoke bureaucracy solution due to notarization capabilities.\nIn totally, this proposal is very hard for the community auditing and tracking.", "q2r": 2, "assessor": "z_assessor_775", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We want to upload conventional documents on Cardano and attach basic smart contracts to them.\nThis way we have a notarized signatures.", "experience": "Our team consists of 3 developers, and 4 expert reviewers in the domain of document mgmt, law, programming languages, and blockchain."}