{"id": 401357, "author": "petervg", "title": "A People's Cadastre in Mozambique ✊", "url": "https://cardano.ideascale.com/a/dtd/401357-48088", "category": 26435, "amount": 98450, "description": "The rural poor in Mozambique do not have an accessible and affordable way to assert their land rights using government systems.", "f6_no_assessments": 7, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 1288, "q0": "This hits the nail on the head. Establishin land rights is one of the biggest obstacles to people around the world. Blockchain is very well suited for land registries. This project is really bringing the best of Cardano to do great work. \n\nThis is exactly the kind of project that can be replicated in other countries. In fact, this is building on a project in another country, Ghana. ", "q0r": 5, "q1": "This seems like the perfect team for this. They have shown commitment to the problem, as well as tenacity and creativity in trying to solve it. \n\nSeveral very experienced people are leaders of the team. The project is showing success in it's pilot program in Ghana. ", "q1r": 5, "q2": "There are very clear data points to measure. The calendar is very detailed and extensive. The authors have listed detailed estimates of hours required per task and accounted for reasonable wages - enough to attract good talent who want to do good work. Really excellent planning.", "q2r": 5, "assessor": "z_assessor_1336", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2200, "q0": "It is an exciting and potential project in the field of land management. It aims to take advantage of blockchain technology to make land registration easier, more transparent, accurate and reduce the risk of disputes. From there, people have opportunities to use land assets as financial leverage to participate in the DeFi market and help them out of poverty. The broad applicability is also relatively open to African countries with similar cadastral policies. Therefore, this proposal is entirely suitable for the challenge presented. (Score given: 5).", "q0r": 5, "q1": "The technical solutions outlined above are highly complex, especially in ensuring data accuracy but are relatively feasible. Using Landano's technology is a good idea. It would be more convincing if the team could present evidence to prove the 80,000 DUAT records are accurate, legal, and undisputed.\nEconomically, the amount demanded and the capital use plan are reasonable; what is missing is the long-term financial plan. The challenges in project implementation are also clearly and accurately recognized. However, legal issues and lobbying for the project's output to be recognized as legally valid have not been discussed and analyzed carefully. A qualified team led by an experienced lawyer is adequate to execute this proposal regarding human resources. (Score given: 4).\n", "q1r": 4, "q2": "The problems and solutions in the proposal are presented quite clearly and clearly. Roadmap, milestones, and metrics are also realistic and easy to audit. There is only one point that the \"complete migration of 80,000 DUAT records into Landano\" is a complex task and may take longer than six months. If the team has a specific plan to ensure this is resolved, please add it. (Score given: 4).", "q2r": 4, "assessor": "z_assessor_1459", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4963, "q0": "This proposal satisfactorily address the impact section of the challenge by clearly proposing a platform which assist those individuals in a poor nation to leverage land rights for their economic benefit and free them from the bureaucracy and legal/governmental barriers.  In addition, the proposer has aligned with legal sources in the local Mozambique market so it is highly likely the proposal will achieve success since they are definitely aware of the local challenges and deploying solutions.  The team has thoughtfully developed the proposal and has identified potential risks and begun working on solutions.  Another key item to the proposer’s success is the proposal is built off a prior successful proposal which has met prior challenge criteria.", "q0r": 5, "q1": "The proposer has provided a solid roadmap and upon further review aligns with the proposers previously successful Fund7 project so I’m confident they can achieve success.  The hourly rate of $75 does seem low for DevOps team however they indicate they already have buy in from the team.  I was impressed with the team and bios and to me they are well versed in African business needs and committed to a critical endeavor.", "q1r": 5, "q2": "It is obvious the proposer has experience in developing these proposals from the outline of specific KPIs which are easily measurable and the outline of success.  Simple and clear I’m confident the project can be managed and measured to completion.", "q2r": 5, "assessor": "z_assessor_1807", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7595, "q0": "In Mozambique, there is no accessible and reasonable way to assert their land-use rights using the government system. Solution Importing Mozambican land rights documents into Cardano to generate People's Cadastral using Landano for NFT minting, maps, and web storage3. This will help poor countries that do not have underdeveloped land management systems, but for developed countries, it will be more difficult to change the system of processes in use. Landano Solutions is an independent registry of land rights that provides legal tools on the Cardano blockchain. It also provides web3 archive archiving and discovery capabilities, providing open, trusted data to aid land management in an easy-to-query, mobile-friendly interface powered by maps, permanently store records, and check the integrity of the blockchain. . . The proponent raised the main risks (Miscoordination between the People's Cadastral and Landano teams / Complexity of DUAT source data / Time to map, export and quality control / Project launch depend on delivery schedule Landano MVP / Users with low education level, owning a smartphone, connecting to electricity, internet / It is necessary to bridge the gap between the end-user mobile payment system and cryptocurrencies) However, the solution to reduce the risk should be more detailed such as creating channels or training programs to improve understanding. know and use, coordinate with mobile payment systems if available.", "q0r": 4, "q1": "The roadmap is clearly stated every month and after 6 months with each clear and specific goal. . The proposed cost is calculated according to the unit price and implementation time, but the work items and professional skills are different, so the unit price is different. Storage costs also need to be clear for how long and how much space. The team has 6 employees, information about each employee is provided fully in terms of professional skills and social networking sites, and the job assignment is also clear.", "q1r": 5, "q2": "The KPIs are clearly stated to ensure the quality of the project (Number of codes committed to the DUAT interface / Number of imported DUAT records / Number of imported cadastral data points / Number of DUAT records generated / Gigabyte of space used for DUAT records). . Well-defined success (All existing DUAT records and data objects have been imported into Landano / Landano provides a Portuguese interface for accessing DUATs / DUAT owners can verify the use of their land in Landano). The project is a continuation of the https://cardano.ideascale.com/c/idea/381957 project that was funded at fund 7.", "q2r": 5, "assessor": "z_assessor_610", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7961, "q0": "A proposal to help the rural poor in Mozambique have fully documented land rights claims through NFT management, maps and web hosting3 on the cardano platform, since there is no access to this paper easily.\nTo implement this project, the team (including cardano software developers, lawyers, community activists) collected 80,000 land use right declarations into a cadastral platform. custom.\nIf the project is implemented it will aim to help more than 20 million people in Mozambique.", "q0r": 5, "q1": "Your team's working progress in 6 months and 1 year is quite reasonable. The group has the advantage of having lawyers who understand the local cadastral well, with many years of experience. If possible, you can tell the community more about the local government's acceptance of cadastral management technology on blockchain. Are they really open and supportive of this issue?\nThe proposed budget is detailed enough because it is calculated by the number of hours worked and by each task of the job.\nAnd especially before that, the group has successfully collected more than 80,000 records of land use rights, showing their experience and willingness to develop ideas into reality.", "q1r": 5, "q2": "The progress and success of this project is measured through: the number of DUAT tokens (land use rights management), the number of DUAT records, the number of households updated with information on land use rights. (project target is more than 20 million people in Mozambique).\nOwners can verify their usage rights with DUAT NFT.\nThey have experience reporting on catalyst tool guided from fund 7.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8470, "q0": "This project is about giving solution for rural people in Mozambique with 20 million people using Landano to have access to land administration system. The first phase is to moving current land right declarations (DUATs) into Landano. The Landano will import these on-chain as Cardano NFTs with web3 storage. I think, by having trustworthy land management helps people in Mozambique to grow rural farming economies and is key factor for stable government. By holding weekly meetings to coordinate between People's Cadastre and Landano team, I hope this project could solve the challenges.", "q0r": 4, "q1": "Well, the proposer gives quite clear plan and timeline for delivering the project. Also, the proposer and team show that they have experienced and qualified in laws, software development which show the feasibility of the project. However, the team has to face with a lots of challenges which need effective solutions such as close coordination betwwen People Cadastre and Landano team, risk management tool,..Also, the team do not clearly clarify about their expenses for executing each job. I would like to them to make it clearer to community. ", "q1r": 4, "q2": "I think it is possible to check the development of the proposal based on key metrics mentioned by the proposer such as No. of DUAT records imported into Landano, minted, gigabytes of storage consumed,..by visiting their website, social media channels for more updated information. ", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8858, "q0": "I agree with the author on the issue that it is not easy to access and use the information system on land use rights of the poor in Africa in general and Mozambique in particular. If the project is funded and successfully implemented, it will not only be popular in Africa but can also be applied to many other parts of the world. A great project to me, as it identifies many of the problems that need to be solved in this challenge, it covers almost all of the problems the challenge posed, it can scale quickly and large to many places, they can solve problems that arise in the future, this is a very good project, it brings great development value to the Cardano ecosystem. I want to see this project again in the next Fund if the project is not Funded in Fund8.\n\nGreat solution when proposing to digitize land ownership, digitize land management system (DUAT), create NFT into Landano using Cardano's blockchain technology. A modern, highly transparent, and permanent technology like Blockchain applied to land management will help people understand and have full decision-making power based on the assets they hold. In addition, I was impressed by the next phase of this proposal, which is the financial services that follow, it shows the author has a master plan, based on a long-term plan for localization. the people in Mozambique. This solution is amazing, it identifies almost every problem in this challenge, the author's arguments are logical and clear.\n\nThe project has highlighted some risks when implementing, the author also mentioned many solutions for all those risks, which makes the project's risk management from the community if it is Funded. more convenient and clear. Educating people, especially the poor about the usefulness of Blockchain technology in asset management is no small challenge, I agree with the risks and solutions that the author mentioned, however, in my opinion, the author should also mention the risks of inflation and currency devaluation in Mozambique, in addition, I agree with the author on the above issues.", "q0r": 4, "q1": "Great when the project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project aims at are also very specific and completely achievable. The timeline is relatively clear and specific, in addition, in my opinion, the author needs to insert more time for the goal of testing and quality assessment for DUAT when they are integrated on Landano.\n\nThe budget is less than 20% of the total budget of this challenge, compared to the information the scheme provides, some of the project expenditures need to be clarified if it is Funded. Based on the expected completion time of the project, we can also easily calculate the number of hours to deploy DUAT, however, in the Storage fee section, the community needs to be more specific in this section (eg fee: fee) How long is this storage, is there a recurring charge or not?...).\n\nThe implementation staff has been assigned specific jobs, clearly and logically, the experiences listed are suitable for each member's ability with the project, in addition to the members' identities, which are easy to verify clearly. A great team. The transparency of this project is excellent, when most of the information about the project implementation team is clear and transparent, for me it is great confidence when the author provides clear personnel information like so. Besides the LinkedIn links, there are also links to CaVaTeCo, ORAM, and landano.io for us to learn more.", "q1r": 5, "q2": "The KPI information, success indicators as provided by the author are completely easy to determine on Landano. Does the project provide KPIs, metrics that determine the success of the project, overall goals that are easily measured against the information the project provides, are clear and easy to check these things?\n\nThe fact that Landano is conducting a pilot project of Fund7 in Ghana shows the experience of this team in project implementation, in addition, the risks of the pilot in Ghana will help them to be more successful with the DUAT proposal. This is for Mozambique. The scheme has clearly defined success, the information from the scheme showing what is being done and how it is being done and testing has had significant initial success, which is amazing.\n\nThis is a completely new proposal, it was suggested by an author with Catalyst experience when the author had a project funded in the Fund before. It shows the experience of the author and the team in presenting and implementing the project when it was funded.", "q2r": 4, "assessor": "z_assessor_709", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}], "solution": "Import Mozambican land right documents onto Cardano to create a People's Cadastre using Landano for NFT minting, maps, and web3 storage.", "experience": "We are experienced lawyers, community activists, and Cardano software developers. The Mozambique team has already collected over eighty thousand land right declarations into a custom Cadastre system. The Landano team will use its platform to mint and store these as Cardano NFTs."}