{"id": 402385, "author": "yojo", "title": "🔥Regulation-as-code for DApps", "url": "https://cardano.ideascale.com/a/dtd/402385-48088", "category": 26435, "amount": 111100, "description": "Nation Building DApps will need to comply with regulations that are not yet available 'as code' consumable by humans or machines.", "f6_no_assessments": 5, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 2335, "q0": "Opens alternative research streams in prominent topics, such as scalability, interoperability, integration, new design paradigm network protocols, and more. will pave the way for further innovation, growth, acceleration, acceleration, and development of the Cardano ecosystem. Having a dedicated challenge is definitely worth it. DAAP at the moment is at the forefront of Cardano research. Expanding the scope of research and resources through catalytic proposals can strengthen the DAPP ecosystem and development. The Cardano community should have the opportunity to discover and do consistent research encouraged through catalyst funding", "q0r": 5, "q1": "The community's ability to tackle an open research challenge should not be underestimated, especially given the early age of the Cardano ecosystem. DAPP develops and integrates in a new innovative environment like Cardano Blockchain with its unique features, which requires a great level of participation. I strongly believe that the Cardano community is capable of doing so. We are in good hands with longstanding Project Catalyst community members, legal expertise, global government and citizen services, along with members of the open government, open government, global RAC communities. demand in the challenging group, is more able to motivate and inspire that effort. \n", "q1r": 5, "q2": "As an open-ended research challenge, one could argue how irrelevant the proposed metrics and success criteria are. The challenge proposal does not clearly outline the success criteria, key metrics or research models that should be followed, e.g. a formal peer-review approach. I believe that in this case the proposal would be clearer and more informative to voters on the research standards to be followed (like the IOG that has set the research standard for Cardano on peer review methodology) . However, the challenge team will have an additional opportunity to clarify and provide additional details to suitors once the challenge proposal is approved by the voter. ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 3459, "q0": "The main ideas of the Impact section are clearly divided, making it easy for voters to follow the information sections. First, the proposer introduced the solution specifically, such as introducing the characteristics of the project, how the project impacted Cardano and Cardano development. Moreover, the proposer has outlined the strengths and needs of the project to be able to show the importance of the project and how this project can deal with the outstanding problems. The risks that the project may face have also been identified along with solutions, which will reduce the risk when the project goes into operation", "q0r": 5, "q1": "A detailed roadmap has been provided for voters to easily see the progress of the project. In addition, the information related to 'detailed budget breakdown' is quite good. The proposer provided information regarding the project completion time and from there framed the spending. However, the proposer can still make the spending plan more detailed by providing subtotals for each activity, for example, providing subtotals in the Software Specification & Engineering section or payroll sections. Profiles of members are also given very clearly when providing information related to work experience.\n", "q1r": 5, "q2": "Proposer has provided the criteria to evaluate the project development within 1 year, including mentioning specific target numbers such as 5% increase in the first year. This is a public point because so the voters will easily see the goal of the project.", "q2r": 5, "assessor": "z_assessor_1652", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4249, "q0": "I’ll explain why I appreciate this project so much. First of all, the main audience that the project targets are Dapp users in the Cardano ecosystem. Any project that aims to improve the quality of Cardano is very detailed and effective and this project is no exception. Recognizing the diversity in national legislation, the proposer intends to improve Dapp by integrating and updating regulations from multiple countries consistently. Even in the case where too many regulations lead to confusion and inconsistency, the proposer also offers a RAC platform to minimize this situation as much as possible. For persons who have been hurt by legal disparities, the project includes an example Dapp that allows them to regain confidence in registering for and receiving what they are entitled to, in partnership with a social services organization. Needless to say, this will produce a favorable impression on consumers and considerably boost the number of users for the Dapp. Finally, the proposer's suggestions are extremely clear and thorough. It makes great sense in my perspective and will solve the challenges they expect", "q0r": 5, "q1": "With the information provided in this section, I believe the project success percentage is very high. The proposal contains all of the information that investors and specialists require. From the executed strategy with a clearly defined monthly roadmap, the comprehensive budget with a percentage linked, to the team operating with many years of industry expertise. Nothing should be criticized in this part", "q1r": 5, "q2": "Each of the ideas presented here is entirely applicable, extremely cohesive, and rational. The proposal not only states that it would assist users but also claims that it will aid in the development of the Cardano community's capacity. A characteristic that is uncommon in other projects. Particularly, precise data such as 100+ persons contributing to the RAC or a 5% rise in the first year are included in the evaluation of the project's success and development. This tremendously assists investors in determining what the project will accomplish. Although I am aware that in order to prepare so fully, the team had to conduct an extensive study and devote significant time and effort. Nevertheless, within those 12 months, the proposer should perhaps specify how long each achievement will take to complete", "q2r": 5, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6274, "q0": "This project very strongly addresses the challenge of Nation Building Dapps.  One of the biggest challenges for developers is to build a global Dapp that is able to meet local jurisdictions.  I believe this is one the most important projects ever in this category because it will benefit future projects in Nation Building Dapps and in all categories dealing with different nation-states and local governments.  It will allow Cardano Dapps to integrate with varying local regulations and codes to successfully implement their projects.", "q0r": 5, "q1": "This is a new project idea but this team is very experienced in working with Cardano and the Catalyst community and has experience in legal and government services and in writing rules as code.  The plan presented is well-detailed roadmap that is well-prepared to address the stated challenges.  The short-term plan is to write all the regulations as code and then later store these on an immutable blockchain.", "q1r": 5, "q2": "It is easy to check the 1,3, and 6 month roadmap for auditability of this project’s success working with 2-3 Cardano Dapps.  This will also include the creation of a RAC whitepaper.", "q2r": 5, "assessor": "z_assessor_385", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6396, "q0": "The proposal addresses the challenge in a revolutionary way because deal with questions that every citizen has to deal. Because of that, the proposal impact can be huge if it's implemented correctly. The proposer explained clearly what are the implementation risks and how mitigate them. The goals were well exposed and are coherent with the final expected result. ", "q0r": 5, "q1": "The roadmap created by the proposers is clear and coherent in face of the result that they want to achieve. The proposer explained the milestones and the deadlines that guides the project and they are reasonable and clear. The budget was presented in a clear way and seems to be reasonable if it's compared to the activities that would be done. The members were exposed basing on their characteristics like experience and kind of especialization and these characteristics are coherent with the job to be done.", "q1r": 5, "q2": "The proposal is possible to be audited through the metrics that measure its success. The proposers make this information clear in the proposal and give some of these metrics as example. In addition, they explained some of these metrics using numbers of the goals. It's very helpful to facilitate the audit. The success idea of the project was presented by the proposers in a clear and coherent way. Furthermore, the proposal is very clear and reasonable when explains the milestones, roadmap and metrics. As a result, it's is possible to audit it.", "q2r": 5, "assessor": "z_assessor_409", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Community-created open-source platform & DIY manuals for anyone to turn any laws/regs into code for everyone to contribute and build on.", "experience": "Global Rules-as-Code expert, contract team incl.3-4 dev/design/legals, intercultural, community building, self-sovereign identity & records management/standards expertise + https://veracity.wgtn.ac.nz/, https://salsadigital.com.au, https://www.venturecentre.nz."}