{"id": 402471, "author": "shirogat", "title": "Curb Crime by capturing Data", "url": "https://cardano.ideascale.com/a/dtd/402471-48088", "category": 26435, "amount": 20000, "description": "Motorbike riders have recently been linked to a wave of criminal activity in Kenya ranging from Robbery with violence to Sexual assaults.", "f6_no_assessments": 7, "f6_rating": 2.6666666666666674, "videos": [], "media": [], "f6_assessments": [{"id": 7437, "q0": "This proposal is confusing, the idea itself seems good to me but its explanation is not clear and not enough details are provided to understand the Dapp itself. I'll try to explain what I understood: a Dapp would be made whose main objective would be to collect data from motorcyclists, to avoid the increase in crimes associated with this portion of the population (according to the proponent, from robberies to sexual crimes). The logic would be that the more data we had on motorcyclists, the less chance we had that these were criminals. And this data would be somehow related to the Cardano blockchain, I don't know if DIDs would be made for each biker, it's not clear how the technologies from our ecosystem would be used here. But to me, this idea doesn't make much sense, I don't think people who would be likely to commit crimes would spontaneously register on this Dapp. In my opinion, this is a good idea so that Kenyan motorcyclists can form a unified community that is constantly in contact with each other, that their personal information is transparent and inviolable to everyone, so whatever problems they have (for example if were accused of something unfairly), the data on the blockchain could act in their favor. However, I don't see how the “2. Make it easy to track rogue pilots” would be done, I think these crime-prone people would prefer to remain anonymous, go out of their way to go unnoticed. Therefore, I think that this proposal is not of high impact, I don't think it has been explained in a sufficient way for us to be convinced that the objectives of the challenge will be achieved. In this challenge, we are looking to fund projects that: 1) Benefit developing locations, working to improve security is really a benefit to Kenya. However, as I explained, I don't see much sense in these suspicious people joining the blockchain, so I'm not sure, unfortunately, whether its intended goal would be achieved. 2) It is also necessary for the Cardano ecosystem to take advantage of the situation, in which case, as I said, it is not clear how the technologies in our blockchain would be used. We don't know if DIDs would be created for motorcyclists; what information would be minted from smart contracts; whether there would be any transactions in Ada; if somehow CNFTs would be related to this project. Anyway, unfortunately, from what is shown, the impact does not seem very safe to me. \n", "q0r": 1, "q1": "There is no roadmap for carrying out this proposal, all we know is what will be done in general: “carry out a survey of boda boda pilots in an area of ​​Kenya and collect relevant data on identity documents, certifications and training and relevant experience in the rule of law”. Who would carry out this research? In which cities in Kenya? How would motorcyclists be enticed to participate in this, how would they be approached? What questions would be asked? What kind of information would be added in this Dapp? It would be necessary for the proponent to draw up a schedule detailing which activities would be carried out and within how long, which deadlines would need to be respected, etc. In the final part of the proposal, in auditability, we know that the research phase would take 4 months to happen. What would happen in the first month, and in the second, and so on? It would be necessary to identify what would be done, by whom, in which weeks and with what specific objectives. The Dapp development part would take another 4 months, so I would like to understand who the tech professionals involved here would be and what they would do. How would the Dapp programming, UI/UX design, advertising, in short, everything be done... And in terms of money, a total funding of 20 thousand dollars is requested, which are divided into small parts, but each one of them should be more detailed so that we have a more concrete idea of ​​how the money would be used. Why would interviews cost $2,000, how many people would be interviewed, so what would be the value of each individual interview? That training that would cost a thousand dollars, who would be trained and to do what? Because the dissemination of research results would cost 2 thousand dollars, where would this content be disseminated, in order to reach how many people? And finally, talking about the team, we have a good breakdown of who they are. We know a little bit about what they have done so far professionally, examples of previous work, their linkedin profiles (not everyone, it would be important that everyone had provided this data), I would also like to know what roles they would play in the project. In general, trust is conveyed in this team. Therefore, I believe that the feasibility of the project is ok, but still with parts to improve. \n", "q1r": 3, "q2": "The auditability of the project is also ok. Regarding the KPIs raised, I think they make sense, we know important data to be verified and that summarize the partial objectives of the project well. The question remains, how would these data be presented both to the local population of Kenya, which according to the attached youtube video needs as much support, as much as the Cardano community would be aware of this information gathering? I think it was necessary for the proponent and his team to collect such data monthly, or at least at the end of each work cycle, and make them available as well as a brief summary of the process that was necessary for data to be obtained. For example, I would like this document, containing the partial results, to be posted in the “Project Catalyst” group, on the telegram, and for it to be forwarded to local Kenyan newspapers, some local means of communication that allow the inhabitants of the country to learn about what is happening. it's being done. Regarding the final results, “clearer understanding of the issues from data collected about riders and created an identity solution on Cardano to facilitate a smoother running of this unregulated industry”, how will this understanding be done? Through the surveys and data minted in Dapp? How will an analysis of the overall picture be carried out, so that we can understand if the intended objectives were actually met? I missed a better explanation in this part, I would like to understand not only what is objectified but also how it will be perceived. And as with the auditability of the process, that of the final results must reach the knowledge of the local population of Kenya and the members of the Cardano community, we need to understand if not only the objectives regarding the improvement of security in the country were achieved but also whether this project actually benefited our blockchain. Therefore, I would like this part to be more detailed and the bridge with the Cardano community and the population of Kenya to be securely established. I will give it 3 stars because I believe that the auditability is the best part of the proposal, but there are also things to improve. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 11, "ne": 8, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 404, "q0": "The central idea of the proposal is in line with the existing goals of the challenge. A really compelling national problem was identified, and an attempt was made to establish a decentralized solution, using Cardano technologies to try to solve it. With the success of the project, Kenya's national security would be enhanced in the sphere in question, as well as the Cardano ecosystem would also gain more visibility. It is true that a successful execution of the proposal would even fulfill the indicated SDG objectives, however, we were able to perceive that the solution of the problem may not be as simple or direct as mentioned, which jeopardizes the possible impact of the project. Also because of this, it seems that the requested amount of $20,000 would not be enough to resolve this situation. We will address more of these points later in the feasibility analysis.", "q0r": 2, "q1": "The central idea of ​​the proposal to reduce the insecurity of the public transport in question would be based on obtaining data from drivers so that their actions could be better monitored. In fact, this makes sense, because if an irregularity occurred, there would be direct ways to locate the person responsible. The problem, however, is that it might not be so easy to get this information for a few reasons. To name a few of these, and also making a justification:\n\nHow to identify offenders?\n\n           - It seems rather unlikely that those malicious people who use this means of transport provide data for a registry base. And if they do, it also doesn't seem simple to confirm the veracity of this data.\n\nPossible legal barriers\n\n           - It is likely that there are considerable legal barriers to obtaining and registering information from pilots of this means of transport. During the feasibility plan, a clear way to overcome these barriers was not identified.\n\n \n\nA positive point is that the CVs of the professionals involved in the proposal were made available, as well as their experiences and main attributes were described. Regarding the budget detail, we can see a plural distribution of this so that the research takes place, the result is published and the Daap developed. Considering the total amount in question of $20,000, we see that it was consistently distributed among the aforementioned actions, but in addition it is worth mentioning that it would be important to separate an allocation of capital for the treatment of legal issues. However, there is a caveat that even with this procedure being successful, the problem seems to be very comprehensive and dynamic for an adequate follow-up to be built and maintained with the amount requested in the financing.", "q1r": 2, "q2": "We were able to find ways to measure the success of the project, among which several benefits were mentioned that would result from a successful execution of the project, such as an easier tracking of pilots and also greater assurance that they have the ability to perform this function. However, considering all the variables for the execution of the proposal in question, it would be interesting if some more defined goals were present here.\n\nSome metrics could be defined, for example: An expected reduction in incidents involving pilots. The average number of people who want to register information in the database. An average increase in pilots who have the necessary skill to perform this role.", "q2r": 2, "assessor": "z_assessor_1146", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2529, "q0": "This proposal addresses the problem about rogue riders in Kenya. By identifying these riders, not only we could easily trace them if they were involved in criminal activity, we could also provide a sense of safety for the community. The proposer planned on building a DApp to identify these riders as the solution, which aligns with Cardano essential value proposition, “an open platform that seeks to provide economic identity to the billions who lack it by providing decentralized applications to manage identity, value and governance”. It is a very impactful idea however this proposal has not outlined how it would eventually onboard the huge existing 2 million riders so it is still unclear how the this proposed solution would scale up.", "q0r": 4, "q1": "The proposer have outlined the budget based on the implementation plan and provided the timetable which takes 4 months. Though the budget could still be broken down more into details based on the number of the team and work hours spent on each of aforementioned implementation plan. The proposer which consists of 4 members have listed their relevant experience, two of them have been involved in the previous Fund 7. I personally think they are capable of developing the DApp prototype given enough funding however from this proposal I can’t give a solid agree because as a developer it is hard for me to determine the feasibility of developing an app if it is just written as one step: “developing DApp prototype”, I think the proposal could be improved significantly if each steps in implementation were to be explained in greater details.", "q1r": 3, "q2": "This proposal has outlined tangible milestones for each step in implementation plan. However I can’t give a solid agree because there is no mention of communication between the Catalyst and the team member in the proposal so as of now it is unclear how the project could be audited.", "q2r": 3, "assessor": "z_assessor_1522", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4064, "q0": "It starts from a valid and noble problem statement but the given solution is not clear what action should be taken to lead to the expected success. The team’s tendency is to conduct a survey and create Dapp which brings law enforcement and social protection. However, I suggest more detailed information should be provided such as what are the activities developed in there, how it will attract new members or users, etc. The proposer could also try to quantify the impact a little bit. It could have been mentioned here how many people are targeted to join in the survey or use the app, etc. I also think that it would be better if some communication plans to advertise the project are included", "q0r": 2, "q1": "The team has experience with having proposal funded in Fund7, which speaks of the credibility and competency of the team. There are some reference links provided for verification purposes. The plan of conducting a survey in 4 month is sensible and easy to understand. However, it would be good if there were more details about how the financing money would be used. I can see that there is a breakdown of the money in certain purposes but the author could clarify more about how each of them would happen. For instance, what would happen in the “Interviews” parts that cost 2000? or why does “training” cost 1000? It’s not very clear what it means here.", "q1r": 3, "q2": "There is a very clear time frame with targets which help to evaluate the progress as it evolves and have a reference whether the success is achieved or not. However, the proposer did not mention any KPIs or a channel to follow the progress of the project, so I suggest that clear practical KPIs and a channel where voters can interact with the team should be provided to enable the Cardano community to help and understand the whole idea of the project.", "q2r": 2, "assessor": "z_assessor_1702", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4250, "q0": "Although I like the idea of this project, there are a few concerns I hope the proposer would consider. The developing issue in Kenya highlighted here is that criminals on motorcycles and bicycles target innocent citizens, making it harder to track down the offenders. A rather painful problem for a country that already has many issues. As a result, integrating boda boda users' personal information via Dapp will assist the police or the victim in tracking down the crime, as well as reducing the number of persons committing this crime as much as possible, providing a safer environment for people. However, it appears that the proposer failed to demonstrate the repercussions to the Cardano ecosystem. If they want to utilize Dapp, they should underline if the number of individuals using Dapp will grow. Furthermore, they have not proposed a clear remedy to the problem they have raised. In addition, I'd like to know how they can guarantee that the personal information they collect from consumers is completely accurate. I think that by just adding the suggestions listed above, the project will be accepted by experts.", "q0r": 3, "q1": "The proposal’s plan is not as thorough as I had expected. The proposal simply provides a 4-month timeframe with three key activities but does not specify when or how many days each activity must be completed. Even a survey of boda boda users in Kenya did not provide a definite figure. However, it contains a lot of useful information for the budget and team members. The actions that are associated with it are the exact amounts that are incredibly transparent and appropriate. They also have a Haskell/Plutus developer and course creator with Fund 7 experience, as well as a Lecturer at the European Business University of Luxemburg. Or a Ph.D. candidate in Computer Science with a research interest in Security who has graduated from a Kenyan institution. Such a team is unquestionably a good fit for the project's goals.", "q1r": 3, "q2": "In comparison to the previous, I am quite pleased with the information provided in this auditability part. The proposal specifies a time frame for the project's development progress, which is extremely beneficial in tracking and assessing the most accurate progress. Perhaps it would be better if they provided more particular statistics regarding riders. Furthermore, I believe that the success that the initiative seeks to achieve absolutely fits the fundamental goal of this project. I only have one suggestion that hopes the proposer can provide, and that is how this project will benefit the Cardano community.", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4898, "q0": "Firstly, the proposer shows us the strength of this project by listing the multiple experiences that they possess relating to Cardano ecosystem as well as their connection with developers working in the focused area of the proposal which is Eastern Africa. Secondly, the proposal has a very specific and clear list and explanation of its solution that enhances readers understanding on the content of the solution itself. Moreover, the interpretation of how the solution will address the challenge sticks very close to the campaign brief of the challenge, which performs that the project is well matched with the challenge. Despite of all strengths, I still find that this proposal could become better if the proposer could suggest some of the ways to resolve the problems that they foresee instead of merely listing them out. By doing that, the proposal would be more persuasive.", "q0r": 4, "q1": "The proposal would have higher rating of feasibility if the proposer can give a more detailed plan and timeline for the solution. It would be better if they can give out the milestone for each stages such as conducting survey, collecting data or training, and how long each will last. If the plan is specific enough, it is also easier and has a more concrete basis to evaluate the budget breakdown. Speaking of budget breakdown, it seems to be quite itemized. The details of team member is relatively ok, but if it shows more about each individual's capacity, it will be more impressive. ", "q1r": 3, "q2": "In this part, the proposal makes a pretty good list of KPIs that they will achieve in this project, they are understandable and create a uniformity with the solution description. However, this proposal could still have higher auditability if it points out more specific numbers in its KPIs. For example, how many drivers would be collected data or how many users they would gain through the Dapp, or how they can assess the skills and effectiveness of the training given to the drivers. Besides, this proposal also refers to the SDG that they can achieve and it is a plus point. ", "q2r": 4, "assessor": "z_assessor_1796", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7598, "q0": "This proposal is intended to help people and government to know about scammers, it can be used widely around the world. The solution does not specify how information is collected, it needs to be connected to the surveillance camera system, updated information from participants, in addition to violation information from actual departments. law enforcement. Identifying the ID of each person is also an important factor to add to the solution, it will help the information to be updated accurately to each object. Recommendations may be subject to some risks such as incorrect or unverified updates. Information about violators will be saved forever on the system, which will affect their reputation because those people have changed for the better. Especially, how to convince the governments of other countries to participate in projects and apply technology in management\n", "q0r": 2, "q1": "Information about the project implementation time, the timelines for handling the above jobs has not been added, so it will be difficult to know when the project will be completed. The proposed cost is clearly divided according to the content of the work performed, but it is also necessary to specify, for example, how many meetings and interviews to organize to help readers understand the cost is reasonable. Information about team members should be supplemented according to each person's expertise, skills and social networking sites. This will give the reader confidence that the team is capable of completing the project\n", "q1r": 2, "q2": "An unclear KPI will make it difficult to determine the success of each work item, the proponent can give the number of users, the number of local government organizations will apply. The project has no trials and is in the early research phase. This is a proposed new project that has not been funded before\n", "q2r": 1, "assessor": "z_assessor_610", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "Conduct a survey and Dapp on compliance to requirements of licensed boda boda riders to help law enforcement and social protection", "experience": "\nResearch and analytics to conduct the survey and create the training modules (VLS)\n\nCardano DApp developer Atala Prism pioneer, CA VCA Haskell/Plutus Trainer\n\nMore than 20 years Experience in project management teams and product development , Ed Tech expert, Trainer, CA"}