{"id": 403695, "author": "yogo", "title": "21st century Agri supply chain", "url": "https://cardano.ideascale.com/a/dtd/403695-48088", "category": 26435, "amount": 22500, "description": "Agricultural supply chains are broken resulting in poverty for smallholder farmers and environmental degradation.\n", "f6_no_assessments": 11, "f6_rating": 4.484848484848484, "videos": [], "media": [], "f6_assessments": [{"id": 7512, "q0": "The proposal is quite ambitious and if successful will have a large impact both in Ghana but the broader African economy. However, it is unclear how it aligns with the success metrics and objectives of this particular challenge. The proposal is largely focused on the development of a new supply chain, as opposed to what the challenge requests which is the development of foundational registry solutions. As such, if there was a link made around the way this solution could interact with existing government bodies or whether it plans to entirely replace the need for government interaction was made unclear. \n\nIn order to turn this from a good to an excellent proposal, I suggest narrowing the scope to truly address the key problem statement at hand. For example, narrowing down on one of the key activities such as 'gathering farmer information' and putting this on-chain would be a sufficient proposal. This could then capture information on the farmer, farm details, crop information, etc… In the process of providing a lot of information for the proposal, the key takeaway and objective is left lost for the reader and voter. \n\nA key strength in the proposal from an impact perspective is the collaboration with the stakeholders (farmers). However, this again falls short in describing how it aims to build a strategy to engage governments, other partners and organisation's. ", "q0r": 3, "q1": "One of the strengths of this proposal is the demonstration of the depth of skills and experience in the execution team. Roles ranging from project , product and business model leads. However, there appears to be a gap for someone that strongly understands the application of blockchain technology.  \n\nThe budget of $22.5k USD makes up a smaller proportion of the total $800k allocation for the challenge.  The budget is high-level and is not clearly broken down at a detailed level. For example, if you are requesting $2000 USD for the business proposal, how many days are allocating to this activity? How many people are allocated towards building this out? These same questions can be applied to every other budgeted item. \n\nFinally, the proposal does not  clearly address the key challenges to deliver the project successfully.  It mentions that it has already addressed the potential challenge of building trust. However, from past experience running projects both technical and strategy, it is vital to have a log of risks to watch out for, whether that is related to delivering the project on time, communication challenges, iterations requirements as product strategy evolves, etc… Highlighting what these biggest challenges that they could face would provide a realistic colour to what lies ahead and what actions are required to overcome them.", "q1r": 2, "q2": "The proposal can benefit from going into more detail when addressing the ability to audit the progress. For example, whilst there are high-level comments on how to track the progress such as having 'monthly-status documents', having a detailed roadmap that clearly links to the key value drops and how long it will take would give the community an added layer of comfort that the project will be properly managed and delivered. Further, there is a lack of specificity in the metrics used to track progress. For example 'increased income by > X%' is not a metric. What is the percentage value increase you are truly after? Can you select more direct metrics for value-add such as 'signing up 1500 farmers on to the platform' or 'signing up 10 different produce types.'", "q2r": 2, "assessor": "z_assessor_586", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1249, "q0": "The Nation Building Dapps challenge mentions two broad directions proposals can take: First; assist with basic government services where these are insufficient, such as governance, welfare, education, utilities and so on that can be bootstrapped from inadequate to world-class web3, and Second; increase the number of Dapp users in developing countries in general, and increase human development outside government services can also be seen as a decentralized layer of Nation Building. This proposal has potential in both, but it more relevant in the second. It explicitly mentions the potential for Dapp usage after the proposed research and the arguments presented are highly credible. Essentially, small-holder farming and agricultural supply chains in Africa (Ghana initially) operate very inefficiently and unfairly for the farmers, and can bring a lot of people to use Dapps and improve their livelihoods with decentralized web3 building blocks.\nThe proposal is the starting point for a much larger project envisioned. It will not have any Dapp launch or improvements \"on the ground\" as the desired result, but wants to accurately measure the status quo and potential. This will be done collaboratively with involvement of WADA, the Pond Foundation, Earthworm, AIM and C4C and the findings will be made available to the public / Townhall.\nThe proposal ticks all the boxes, but will \"only\" result in another proposal if successful. While this boosts feasibility and auditability, it comes at the cost of impact. I still assess this as a good fit and effectively addressing the challenge in terms of overall impact.", "q0r": 4, "q1": "The large and highly experienced team of proposers showcases Catalyst collaboration at its best, bringing together leaders and pioneers in impact investment, NGOs, Africa-specific knowledge and web3 solutions. The proposal is highly realistic, limiting its scope to research and creating a much more ambitious roadmap for the actual web3 integration as a long term goal. It is well structured, backed up by references and milestones, and shares insight in project management tools and metrics. Given all the information presented, I consider it highly likely that the vision for success described can be achieved.", "q1r": 5, "q2": "This proposal has over a dozen KPIs. It is highly detailed about how progress will be communicated back to the community and stakeholders. It is also good that immediate success of the presented proposal is compared to and treated separately from the longer term project.\nThe product metrics presented demonstrate how much thought has gone into the proposal and all of them seem highly relevant to improving agricultural supply chains and the livelihoods of farmers.\nI would have liked to see a separation of phases 1 and 2 under auditability and a discussion of the timeline with regard to auditability. Overall, I am highly confident that the progress towards success will be communicated clearly.", "q2r": 5, "assessor": "z_assessor_1329", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 1290, "q0": "Getting food to market is essential for any nation. This proposal works within the challenge to use technology to record and trace information that is important to the society. \n\nThese tools being developed can be reused and repeated in other developing countries. \n\nThe team shows a long term grasp of the issue and is addressing it head-on.", "q0r": 4, "q1": "The team has many years of experience working on similar issues. Some of them have experience together. Some of the groundwork of making local connections with stakeholders has already been done. These things together give the team a leg up in accomplishing their goals.\n\nThe team shows a clear understanding of the problem, as well as a proven track record of coming together to solve complex problems. \n\nThe plan is detailed with many opportunities for oversight. The plan has a high likelihood of success.", "q1r": 5, "q2": "Yes, the timeline and measurable points are very clear and understandable. There are several ways for the public to follow the progress through the google drive repository and town hall meetings. \n\nThere is an extensive list of metrics the team will be using. Auditing and tracking progress are quite sufficient to maintain accountability.", "q2r": 5, "assessor": "z_assessor_1336", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1494, "q0": " To my understanding, this proposal helps consumers and farmers connect directly without going through broker or retailers. Farmers therefore can sell their product with better price. I therefore agree that the project owner that this project is significant and if successfully implemented will improve the life of farmers in argicultural countries which are aligned with SGD goals", "q0r": 5, "q1": "Team profile shows their potential and qualified to implement this work. Team lead has very long time working in argriculture and food supply and they also have a technical lead who is an expert in IT and Cardano blockchain. The proposed activities in project timelines looks reasonable and sticked with project goal.", "q1r": 5, "q2": "There are proposed KPI metrics that are not feasible to measure quantitatively such as the amount of reduced CO2 or chemicals, increased interest of brands and investors. The remaining criteria looks good and reasonable. Cost estimation and timelines are included in the project content but they are not sticked together so it is not easy to track the cost that they plan to spend in each period.", "q2r": 3, "assessor": "z_assessor_1385", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1987, "q0": "The proposal involves the ‘research and solution concept testing’ for the subsequent development of various DApps for the Agricultural products supply chain. This proposal falls under the Challenge because the Agri-products Supply chain problems are the national problems being faced by many African countries. \n The solution being developed will have a big impact on the lives of many people and on the ecology as well.\nThe solutions proposed under this proposal will have the ability to scale as it is being prepared on the ground-up approach. The proposer will be considering all the probable issues faced by the people and the whole supply chain and provide suitable solutions for them. Hence once completed the proposed DApps and the platform can be scaled to include larger geography.\nThis proposal will likely be bringing many users to the Cardano ecosystem in the guise of various parties involved in the Agriculture production and its supply chain at least in the farming of “Bambara Groundnut” in Ghana and hopefully, this project progress to include other Agricultural products and a lot of farmlands across Africa in the future.", "q0r": 5, "q1": "The team is qualified to carry out the proposal as it is the team of well-known organizations i.e., ‘Pond foundation’ and ‘whatif-foods’ company. The execution team will also include some Cardano community members from WADA. The pond foundation founder and this proposal lead Mr. Scott Ponynton is a well-experienced individual whose works range from no-deforestation, forest protection, regenerative supply chains, and various collaborations and efforts to fight climate change. ‘Whatif-foods’ is one of the world-leading providers of sustainable agricultural products.\nThe roadmap for this research phase has been divided and described into identifiable tasks. The budget also seems to be reasonable. It is distributed into the different tasks to complete Phase 1. \n I think that the tasks to be completed can be further elaborated and the given timeframe of 3 months for phase 1 should be divided on weekly basis.\nThe proposer did not describe how they will arrange the funding for Phase 2 and Phase 3. It will be better if that also can be stated.\nThe proposal is likely to be completed in view of the above positive contributors.", "q1r": 4, "q2": "As stated by the proposer the proposal can be audited by examining the study reports and attending various Catalyst and other meetings regarding the status of the proposal.\nIn my opinion, if the tasks to be completed can be split up into weekly tasks that will help for easy follow-up and auditing.\nKey metrics and milestones are defined clearly by the proposer but being the research phase this proposal’s metrics are limited. We have to wait for the subsequent phases to get completed to witness the true impact and other sustainable goals of this project.", "q2r": 4, "assessor": "z_assessor_1444", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2259, "q0": "The proposal is very well structured and fitting for this challenge. Focussing on the \"Research and solution concept testing\" phase is indeed a wise way to build up momentum, deliver quantifiable results that the community can review and potentially contribute to. Even if the team is already well experienced and connected, it would be interesting to see how community members can contribute to this initiative as at the end of the day, the concept if that of a \"supply chain\", where different groups can potentially provide services like ecommerce, marketing, data and analytics etc...\n\nUltimately, the proposal can lead to design patterns for such sustainable supply chains that could be composable from a set of decentralized microservices.", "q0r": 5, "q1": "Given that the budget estimate is for Phase 1 only, the team well established and the breakdown of deliverables provided for Phase 1, this structure is clear. \n\nIt would be useful however to understand who is working on what, at what capacity for efficiency. Potentially investing in a  collaboration platform from day 1,  can also help organize resources / deliverables to ensure that a geographically distributed team can work efficiently.", "q1r": 5, "q2": "With regards to auditability, the KPIs provided are clear and usage of the community Cardano4Climate is a wise way to build momentum and really engage with the community as well.\n\nIt would be useful to clarify the expected deliverable and KPI related to \"Business proposal, considering also unique models related to blockchain such as tokenization and NFTs \"\n- This could potentially benefit from a community brainstorming session to come up with some alternatives\n- The brainstorming session, with a draft business model proposal could be a KPI itself .", "q2r": 5, "assessor": "z_assessor_1470", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3793, "q0": "What could  I say now? Very perfect! This proposal succeeded in persuading me to vote for it thanks to its transparency and detail in information. The description of your proposed solution completely meets the requirements of the challenge, comprising the key features, components of the projects, its target objects and their benefits that can be reaped from this project. Everything is very explicit and convincing. On top of that, you were capable of introducing the backgrounds and necessary information related to your partners, which shows your team’s professional and meticulous work level. Specifically, the main objective this proposal focuses on ideally matches with the key metric of the challenge (increasing the social and financial inclusion of farmers). Moreover, your team astounded me because you are not only able to foresee the hurdles of the project implementation but also apply many methods to tackle them. And it proves to be kinda effective when your team succeeded in attracting over “1,000 farmers to register their interest in The Pond Foundation-WhatIF Foods project”. In general, from my viewpoint, this is a highly potential and promising project!", "q0r": 5, "q1": "This is another excellent section! The team has a very explicit roadmap with adequate information about each phase to deliver the proposed solution well. If you would like to make this work plan perfect, my suggestion is to specify which month each phase will be entirely completed. The second plus point is that your cost breakdown to the phase 1 of the project progress is reasonable, transparent and extremely linked with the given milestones. Not many proposals could present such a good budget allocation like yours. Thanks to this content, I could have a solid awareness of how your asked money will be used. In relation to your team members, one more time, I was surprised by the profound working experiences of your core staff accompanied by their precious relevant accomplishments. In addition to that, you could succinctly introduce the background of your partner, AIM team, and it’s reckoned to be eligible for this project.", "q1r": 5, "q2": "Great job! Not only providing sufficient measurement tools for the community to keep track of, typically Google Drive with research findings and interviews, but you also put forward plenty of key metrics to monitor phase 1 and 2. Next, your team was capable of defining what success of the project would be like, hence, we have enough content to supervise. However, I recommend you name which positive impacts decentralized technology will exert on nature with a view to let the voters figure out how nature can be improved thanks to your project. ", "q2r": 5, "assessor": "z_assessor_1675", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4065, "q0": "This proposal is very interesting. The team is about to create an Agri supply chain which helps to increase the social and financial inclusion of farmers by decentralized building blocks as core infrastructure. Through the given explanations for its impact and the background reasons, I believe that this project will bring great effect if it could be funded. With the help of blockchain technology and Cardano, the project can bring transparent and traceable information between farmers and consumers and supply them with reliable fresh and clean products, which is absolutely great. These days, more and more people tend to care about the food that they consume, so I think this app can be useful for its marvelous impact on the health field. It also brings farmers more effective agriculture practices and better accession to services such as microinsurance and microfinance, as the proposer mentioned. This project has a great effect on a variety of aspects such as social, finance, and economic development and it can result in the economic development of poor nations and increasing Dapp usage on Cardano. Overall, i think that this is a very fascinating idea and can greatly benefit the Cardano Ecosystem and the community in many ways,", "q0r": 5, "q1": "The core team is certainly qualified to carry out the project very well. There is a brief history of their background and previous experience. I was totally impressed by Scott Poynton, as the Project Lead. With his experience and achievement as a real social and environmental leader for the last 30 years and as an active member in the Cardano Community, I strongly believe that he has the ability to lead this project to success. There are also some reference links for verification purposes. About the roadmap, the author specifies very well about what would happen in a given period of time. It is alway beneficial when a timeline of activities is clearly drawn. And in relation to the budget breakdown, it’s also explained in a lot of detail so we have a solid understanding of how the required money would be used, which parts would cost how much and more.", "q1r": 5, "q2": "This part of the proposal is quite completed. We have enough information on how can we track the development of the project (Google Drive with research finding, Post Townhall breakout rooms for discussing findings and ideas, WADA is for providing transparency of the progress) and the results from the proposal will be announced to the community through a joined meetups by Cardano4Climate and WADA. A list of deliverables are also publicly provided to the community. I would only ask if it is possible to include real estimated numbers, rather than words like “the amount of” or “increase” when referring to the number of proposals under the KPI and Key metrics part. If it could be done, I think it would increase the auditability quality of the proposal.", "q2r": 5, "assessor": "z_assessor_1702", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4129, "q0": "The proposal team is working on a project that addresses the problem of restoring and developing the agricultural supply chain and has the common goal of reducing poverty for smallholder farmers as well as reducing environmental degradation. I think this project has great significance for the development of the community and the potential of the project is also great.\nThe proposal explains the concept of the project very well with illustrations. How the project works is also described in great detail and presented in a way that is easy to grasp. In addition, the impact of the project on potential audiences is also mentioned very specifically in the proposal. The solution section is extremely detailed and explains the technical aspects in depth. Overall, the proposal met the requirements of the challenge in terms of impact on the Cardano community.\nThe results brought by the project are aimed at improving the agricultural situation and are presented in great detail. These results show the synchronization with the Key metrics that the challenge has set. The results also show the economic and financial development potential of the project when completed. From there, you can also see the impact on the Cardano ecosystem.\nThe proposers assumed that the project would not present significant challenges. Due to a very clear grasp of the situation, the proposal proposes small challenges that are likely to form during project implementation and also offers appropriate solutions and workarounds to minimize risks when implementing the project.", "q0r": 5, "q1": "The roadmap is divided into 3 phases by the team. Each stage is accompanied by specific timelines for completing the set work items. The work plan is specific and reasonable, stating the requirements for the work items. The presentation is also very clear for viewers to easily follow. But the proposal still does not mention the positions and the number of people needed to participate in the project. If possible, think about this and add that information to the proposal.\nPhase 1 with a total budget of 22,500 USD is divided into investment items. The budget plan is presented very clearly and it is easy to track the spending of the project. However, as mentioned before, I think there should be a part of the budget for staff salaries and it should be listed in this budget plan.\nThe project management and implementation team consist of people with high professional knowledge and extensive experience. With their background knowledge and experience as well as skills, the team promises to execute the project according to the given plan.", "q1r": 4, "q2": "It will be easier for the community to track and evaluate project progress if the proposal provides specific metrics and clear quantitative indicators. Based on these indicators, the community can assess the success of the project.\nThe success of Phase 1 of the project is clearly visualized through the criteria to evaluate the success of the project. The information that the proposal provides is very complete. The results are generally in line with the blueprint. This shows the seriousness of the group's implementation of the set goals.", "q2r": 4, "assessor": "z_assessor_1709", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4592, "q0": "Agriculture is the main source of income in countries like Ghana, where they do not have idea to connect with proper people, so the provided model helps in connecting the farmers effectively and providing knowledge of supply chain ,maintaining ledger and facilities available farmers , certification and maintaining the bench mark.\nThe idea of dApp helps all the farmers to get connected easily and can also raise voice when some laws go against the farmers , with this farmers also get to know the market value price of their product.", "q0r": 5, "q1": "The main challenge of this model is convincing the farmers to buy a new device(mobile phone) and letting them know how to use the device, as data cost is very high in countries like Ghana, there won't be much flexibility in using the dApps.\nSince the proposer has experience as farmer for 20 years and as a developer for 10 years, he knows what are the important things to be covered in ground level, As Scott has even started some of the phases of the work, which will definitely minimize the strategical time for the model, with experience provided and passion towards project  plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The presented plan has clearly mentioned every aspect from the current status of Ghana ,till how each step of model helps in people of Ghana .\nThe proposal has provided details of all the people with whom project will be coordinated with, since all the members has expertise in their own field with experience more than 20 years, the presented model wont be much difficulty in completing.\nThe proposer can also create some groups among farmers which will help them to interact among other farmers, which will be beneficial in both ways of clearing doubts and building confidence among farmersj, therefore the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7966, "q0": "The working team has experience in agricultural development. They want to apply the ADA blockchain to managing information and data related to plants, seedlings, smart contracts between gardeners, customers, and farmers. This is a good sign that a real economic entity promotes blockchain application in the agricultural sector. They have sensors to monitor seedling quality, AI devices... I see your potential through videos introducing gardeners and your available work. We hope that you are serious about researching and modeling and are willing to share experiences and transfer technology to other localities or countries if funded.", "q0r": 5, "q1": "They have quite detailed work goals and implementation progress. Group membership is completely public. They have their own website, they have an existing agricultural research facility. This is a good premise that many really quality individuals and organizations are coming to cardano. They are the driving force behind the development and wider application of the cardano platform, especially in the agricultural sector.", "q1r": 5, "q2": "\"Sustainable green agriculture is essential wherever climate change is evident. Modeling agricultural information management on blockchain is a multi-step process. Here I have seen that you have the necessary facilities available, and a team of professionals with many years of experience. Those are the factors for success.\nYou guys should have a public channel for these technologies, as it's sponsored by a global community organization. These technology publications, if successful, should be replicated. It is also how we receive and give.\"", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "An Agri supply chain increasing the social and financial inclusion of farmers, through decentralised building blocks as core infrastructure.", "experience": "20+ years experience working with farmers in developing countries, supported by 10+ years of digital product development experience and 20+ years of entrepreneurial expertise. Supported by local teams in Ghana.\n"}