{"id": 404344, "author": "dkkm10", "title": "Proof of Article (SMALL ASK)", "url": "https://cardano.ideascale.com/a/dtd/404344-48088", "category": 26435, "amount": 40000, "description": "Currently Cardano does not have a strong foundation to make any change in any country as the freedom of speech does not exist universally.", "f6_no_assessments": 3, "f6_rating": 3.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 3466, "q0": "This proposal deals  with all requirements for the Impact section. Fisrtly, Proposer has provided specific information about the solution when it comes to the features of the solution, giving examples to illustrate comments to help readers better understand this project. In addition, the proposal also contains information related to the impact of the project on Cardano and also has detailed examples to demonstrate what is mentioned in the proposal. Compared to the Impact section of main ask, the information of this section has been shortened but still gives important information. However, the proposer only mentioned risks, but did not offer solutions to minimize risks for the project.", "q0r": 5, "q1": "Proposer provided a roadmap for the first phase of the project which took place over 6 months. However, the proposal should provide more detailed activities to take place within 6 months, such as activities the founding team will carry out to research or deploy projects to complete layer 1 technology. And, Just like what the proposer mentioned above, this proposal is just a small version of the main proposal. If in the original, the proposer provided the whole process including many stages, in this small version, it only provided information of the 1st stage. Proposal provided a fairly detailed spending table for the smaller ask when providing all the details. subtotal. However, information about group members is also not specifically shared. Proposer should provide more information such as name, work experience, work achievements instead of only job position so that voters can better understand the founding team, thereby having confidence in the project. more than.", "q1r": 4, "q2": "The information of the new auditability section shows a way to measure the progress of the project and the goals that the proposer wants to set, but there is no specific information related to the criteria for evaluating the success of the project or the objectives. specific goals by the project's KPIs/Key metrics. Proposer may consider to add this information.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5745, "q0": "This proposal, boiled down to what the proposers say is the essence is a hard fork of the Cardano protocol for the sole benefit of journalists who may may not be Cardano community members. \"What does success for this project look like?\nProof of Stake is replaced by a Proof of Article mechanism where journalists can gain a blockchain reward for submitting a user approved article.\" That would be huge impact, but not for the benefit of Cardano community.", "q0r": 1, "q1": "The proposal mentions three devs who will rewrite the cardano protocol in 3 months. (after research complete). \n           \"A. Have the main Layer 1 Technology complete (6 Months)\n                 1. This means having research done 3 Months in\n                 2. Have the system implemented at 6 months.\n3 Developers\"\n\nBut includes no information about or links to the qualifications of these devs.\nCompletely infeasible considering the effort and resources it has taken to produce the Cardano Protocol. Also there is no mention of auditing this new protocol. Or community interaction.\n\n", "q1r": 1, "q2": "For a project that proposes to rewrite Cardano Layer 1, there should be detailed information about GitHub as normal in development of code. There are no metrics provided. The proposal is focused on how Proof of Article will change the world but little detail about they will change the protocol. ", "q2r": 1, "assessor": "z_assessor_251", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "The assessor seems to be too focused on the ADA community in a Fund called \"Nation Building DAPP's\" and then gives an overly harsh assessment based off of their lack of understanding of the words \"Nation Building DAPP's\".\n\nUnder feasibility, if that's all up to qualifications from past job experience developing projects, might as well just limit this whole \"Project Catalyst\" thing to people who know how to code. The feasibility or probability of a projects success shouldn't be solely determined based on job qualifications but the technology and resources available when it comes to actually getting the thing done which there is an abundant supply of.\n\nUnder auditability, how can one even know what they are auditing when they don't even know if it will work yet? Nobody has done this before. Expecting that detailed of a way to take accountability is unrealistic if there is nothing to compare the project to."}, {"id": 9658, "q0": "The problem and the solution statement is clear and reasonable  and it identifies a problem within the challenge which needs to be solve. From the information provided the proposal is the continuation of previously funded project in the catalyst (  https://cardano.ideascale.com/c/idea/396649 ) proof of article (BIG ASK) which is about providing a means for people to be rewarded by block chain technology for providing a useful information through a news media while this one is titled (the proof of Article ( SMALL ASK)  is to ensure that \nProof of Stake is replaced by a Proof of Article mechanism where journalists can gain a blockchain reward for submitting a user approved articles. I think  this idea is going give opportunities  to those who has being looking for ways to contribute positively to the society through writing to be able to do so and in doing so, they will be rewarded.  Also since the rewards will be given in cardano  ADA, it will create awareness and thereby increase the number of participants in the cardano ecosystem. \nWith this I think the proposal clearly articulate how it will add value to the cardano ecosystem.  Therefore I strongly agree that this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The proposer team stated that they have the necessary experiences  by providing a link( https://news.jornlrmedia.com/ ) which shows their  works and achievements. The proposer  identifies the number of team members (25) required for the implementation of the project.  The budget is outlined clearly and broken down into identifiable items e.g20,000 Research and Development\n\n    10% to technology and equipment (2000)\n\n    10% to experiment (2000) etc. The budget of 40,000 is reasonable to achieve the set goals. From the information provided the proposal is an extension of a previously funded project, it's like an additional fund. The implementation plan provided did not only show what is being done but also how. The technology to be used is stated with the challenges and risk relevant to a successful implementation.  Therefore I agree that it is highly likely that this proposal will be implemented successfully. ", "q1r": 4, "q2": "The proposer provided a clear milestones and defined time horizon of 6 months for the implementation of the proposal. The metrics and kpis that measures the success of the proposal is not well detailed and I recommend you do so for better auditing.  The proposer also stated a clear understandable description of the targeted problem with a clear understandable solution that addresses the problem.", "q2r": 4, "assessor": "z_assessor_744", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Change can only come with the free expression of ideas. in order to promote this, we must change the way in which \"Logic\" is interpreted.", "experience": "\n---------------------------------------------------------------------------\n\nTeam of 25 with 50+ years of experience in journalism/editing/media.\n\n2 Team members with extensive experience in ADA\n\n1 Front end developer\n\n2 Marketing experts.\nWebsite/GitHub repository (if relevant)"}