{"id": 404575, "author": "darynell", "title": "Operationalizing Human Security", "url": "https://cardano.ideascale.com/a/dtd/404575-48088", "category": 26435, "amount": 34000, "description": "How can we operationalize a people centered security approach, identifying risks and mobilizing effective and timely preventive action?", "f6_no_assessments": 6, "f6_rating": 3.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Safety and security are fundamental rights. This proposal addresses the basic principle that individuals themselves define when they feel safe and when they need assistance. \n\nGovernments have an important role in helping people feel safe, but they have to get the information about what people need and how they need it from the people themselves. \n\nThis proposal would create tools that can be used around the world to create better communication and trust between citizens and law enforcement.\n\nIt squarely addresses many of the goals of the Challenge.", "q0r": 5, "q1": "The authors have relevant experience and a clear plan.\n\nThe phases of the plan appear well thought out and manageable. The budget was thoughtful, complete, and reasonable. \n\nOne author was part of an earlier, successful Catalyst Challenge, which says that they have a good assessment of how long the project will take and the need for several stges.", "q1r": 5, "q2": "This has a very methodical, long term vision. There are very clear tasks and milestones listed. \n\nIt will be obvious if they meet the 2 goals for success  - (1) Needs assessment completed\n(2) Plan for the development of the app defined", "q2r": 5, "assessor": "z_assessor_1336", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "In this project, I can easily perceive the main aim and function of the chosen application. Protecting freedom from fear, hunger, and indignity is a relatively recent concept in the field of human security. The proposer also incorporated issues raised by economist Hernando de Soto to show how protecting the three fundamental rights is critical to making the initiative viable and appealing. Also, the proposer listed a number of successful apps similar to ECOWARN or SAT, proving that the project will also follow in the footsteps and become the next successful application in this field. However, until I finish reading this section, I am unable to determine the name of the application. Perhaps the proposer hasn't settled on an appropriate name yet, but it would be preferable if they have a fallback name for investors to remember. Further, the project does not target a specific audience, but rather a generic public, making it impossible to conceive if the application is appropriate for which region. Importantly, despite the use of the Cardano blockchain, it does not demonstrate the project's influence on the Cardano ecosystem. So, incorporating the aforementioned suggestions as soon as possible will improve the project's prospects.", "q0r": 3, "q1": "Compared to many other plans, in general 2 members of the team can complete the assigned work in this project. Therefore, I see that with only 2 characters with this bright profile, the project will achieve what is expected. The execution plan is structured into five stages, with two main in fund 8, which include strategy formulation and analysis as well as planning. Each stage contains details actions to be carried out. However, the proposer failed to include the time intervals required to finish each phase. It may not be necessary to specify a time limit for the last 3 phases, but if they only focus on the first 2 phases of this project, it is extremely important to give a timeline. It makes evaluating and monitoring the project easy for stakeholders. Furthermore, the budget split has not yet been stated clearly and just provides a multiplication along with the overall amount necessary. Instead, the proposer can specify how much money is needed for each action and can utilize estimations or exact numbers to spend money more wisely.", "q1r": 3, "q2": "The project delivers a substantial amount of information required for the project's last stage. The proposal illustrates development progress in eight particular phases, as well as a projection of future success that closely fits what they said in the feasibility section. However, once again, the proposer has not been able to provide a time frame for the activity's execution and completion. It does not have to be hourly, but it would be preferable if the proposer could demonstrate to prove whether or not the development is timely. Also, I have yet to see any mention of the project's influence on the Cardano community in the project's success section. As a result, the project will lose a significant number of expert evaluation points.", "q2r": 3, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "While this sounds like a good idea and that it should be beneficial for the security of any nation, the execution plan doesn’t seem clear. However, I think that the proponent has done a great job explaining the idea. Basically, the proponent wants to create a dapp that will allow nations to detect early signs and insecurities so that they can move quickly to find solutions. The main benefit should be the capability to maintain peace in nations by handling threats faster. The proponent has provided similar applications that are already working. I think that altogether, the idea is good and that it should add value to the Cardano ecosystem if it’s built on it.", "q0r": 5, "q1": "Although the idea is good, I’m not confident in its successful implementation because the proposal lacks crucial details such as a timetable to complete the work. The budget is broken down but it's not precise. I suggest the proponent break down the budget a little bit more into identifiable items. It seems that the proponent knows the team needed to complete the work, but it’s not clear how they came up with the 14000$. Further explanation is needed. On the other side, the proponent has provided linkedin profiles of the 2 team members which is positive. Altogether, I would say that the proposal needs to be improved by adding a timetable to complete the work and a better breakdown of the budget", "q1r": 3, "q2": "The proponent has included steps achieved, but there is a lack of timing on the delivery of these steps. I can say that the proponent has included a roadmap, but there is no time horizon for achievement. I suggest to the proponent to include this information in order to improve the proposal. Moreover, the proponents have provided metrics/KPIs that define the success of the proposal. However, I suggest to the proponents to add the expected number of users as measure of the success of this proposer. Furthermore, I recommend them to add marketing and user acquisition in the proposal because products need a solid strategy to acquire users. Other than that, the proponents have done a good job explaining the project but the execution part needs to be improved.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The idea itself is interesting, but it is not at all clear how Cardanos' technologies would directly relate to the proposal. In general, it is about creating an application (a Dapp in this case) that would support an early warning and security system, from the bottom up, tracing threats to human security on 3 scales (from fear, neediness and indignity) . These aspects dialogue with the Sustainable Development Goals, something very targeted by our blockchain. But how would Cardano be involved here, in practice? Even if the proponents report some cases similar to their idea, they should have made it clearer how our blockchain would act in the project, if the specific goals of the challenge would be achieved and how. Therefore, unfortunately the impact is very low, because even if it is a good idea it is quite difficult to understand from the explanations given what the direct consequences would be for Cardano and how its technologies would be used in practice.", "q0r": 1, "q1": "There is no actual script here. We know that the project is divided into 5 main parts (and they are explained in detail) and that this proposal would cover the first 2 parts. However, there is no good temporal notion here, that is: we do not know what would happen when, who would do it, how and with what specific goals. It is not possible to have a good visualization of the process through the information given. The explanations about the budget are pretty average, because the total is divided into parts, but these are not so well explained. For example, we know that they would have two experts in conflicts and legal issues; and that per month they would receive 2500 dollars each; but we do not know how many hours per week they would dedicate to the project, so it is not possible to calculate the price of their working hours, nor are the activities they would develop in detail explained. Finally, speaking of the team, it is actually a duo; we are very well introduced to the two professionals, we know in detail what professional area they work in and examples of previous work. This gives a lot of confidence in the duo. In general, the topic is average, as there are good parts but also many others to improve.", "q1r": 3, "q2": "Many metrics are plotted as a way of analyzing progress. I think the proponents don't fall short in terms of the amount of information; however, the question remains how so many KPIs would be organized in a simple way and these reports, let's say, would be made available to the entire Cardano community. I would like this point to be better clarified because in my view it is the only thing that is pending here. Unfortunately, with regard to the final results, the situation is already more precarious, and a detailed success scenario is not outlined. The proponents are based only on the completion of the project phases but do not think about the consequences (even if partial) for Cardano. And that should be measured and reported to the community. So, I think the proposal was doing well in terms of progress, but it has a lot to improve in terms of the success scenario.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "Human security is definitely a problem worth solving. The proposers wish to “create a decentralized, bottom up, early warning mechanism to gather and process people’s security concerns and provide rapid responses”. The scope of this proposal does not include the actual development of the app but, rather, it focuses on laying the foundation through careful strategy, analysis and planning. An expected outcome is a needs assessment and a detailed plan for the app development. It is still possible that the findings from this initial exploration lead to a conclusion that such app is not a feasible solution after all. For these reasons, the actual impact of the proposal is still a bit of question mark.", "q0r": 4, "q1": "This is a strong proposal that meets the brief and goes above and beyond what is expected in the Nation Building dApps challenge. The strategy work is conducted by the proposers themselves. Based on that, a scrum team is formed that includes a Product owner, a Scrum master and a development team. Together, they will carry out the planning and analysis stage to arrive at technical requirements for the app. As said, the actual development work is out of scope in this proposal. The proposers are clearly capable individuals to implement this plan and their credentials are impressive.", "q1r": 5, "q2": "Measurement of the long-term success of this initiative is a tough nut to crack because, if they are successful, nothing out-of-the-ordinary happens. There are multiple destinations (the dreams and aspirations of people) and the shared end goal is noble: freedom from fear, want and indignity. So, what matters here is tracking the success of the common journey. Since the app development happens only later, the focus should be on the auditability of the initial stages: strategy development, analysis and planning. As for those, deliverables include: identification of stakeholders, a conclusion report from the consultations, a strategy session, a strategy paper, validation workshops, viability analysis as well as definition of use cases and detailed functional requirements. In this proposal everything else has been nicely laid out but what is missing is an explanation of the scrum team formation. Do they already have a partnering company identified? What is the $14K spent on specifically? Who are the product owner, scrum master and developers? Leaving these questions unanswered erodes trust in this otherwise brilliant proposal unnecessarily.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The proposal wants to build a warning mechanism that gathers recognised threats by the community and categorises and prioritises them so actionable items can be taken and executed. This seems like a great idea for developing countries and they can greatly benefit from such implementation. The idea and proposal seem to be in line with with the challenge settings because this will leterraly be a nation building app, forming a reliable security and threat prevention system. I've seen other social media to be used the same way, namely when there was an earthquacke in Japan, most of the people used social media to warn the surrounding people from their network about the risk to their seccurity from the second and third wave and thus further life loss was prevented. I imagine this future application would have simmilar and more functionality because it would be more purposeful. The proposers seem to have a lot of experience in this area and I've no doubt this is a good idea and would bring value to the community affected.\nOverall I like this idea and it's impact in the future.", "q0r": 5, "q1": "Both team members have a strong background and relevant skills to solve this problem and create a usefull application for people to use. They've provided the necessary credentials and I was able to verify their skills match with the listed ones in the proposal and the skills look to be relevant to the problem that needs solving. The budget is pretty straightforward - basically salaries for the work that will be done. And the salaries fall inside the recommended guidelines for the work. A good roadmap and phases to the project describing the start of it that will be funded in this round and the continuation for the following ones. To sum it up - strategy and consultations aboutt the problems being tackled will be discussed this round and the application will be done with future funding. This proposal is usefull by itself as well.\nThere's a realistic timetable, although as a developer I'm no expert on how much time strategising and consultation work need, but I'm good at analizing data and this timetable is reasonable to be sure. Overall a good and feasible proposal as long as they manage to find the team they need to build the app to bring the whole idea to it's success. Goo luck!", "q1r": 5, "q2": "The deliverables for this project will be documents regarding the meeting notes done on each consultation or an aggregate of them as well as the final strategy and a plan for development of the app. A clear and understandable problem with a planned out solution to be executed. The metrics could use a little more polishing, but at this stage of the proposal these are good enough to form a good oppinion for anyone tracking the progress of this proposal. One thing I found lacking is a link or a site where anyone interested would be able to follow along. My suggestion to the proposers would be to have a linked site or a gitbook or a google document that will hold all the information in the proposal to help people bookmark it for easy reach.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a decentralized, bottom up, early warning mechanism to gather and process people’s security concerns and provide rapid responses.", "experience": "International public affairs, peacebuilding and conflict prevention specialist.\nhttps://www.linkedin.com/in/darynell-rodr%C3%ADguez-torres-2b8249/\n\nLawyer and magister in public policy.\nhttps://www.linkedin.com/in/carlos-eduardo-gonz%C3%A1lez-fern%C3%A1ndez-23b27055/"}