{"id": 404715, "author": "checkpoint", "title": "Liberated Global Education", "url": "https://cardano.ideascale.com/a/dtd/404715-48088", "category": 26435, "amount": 60000, "description": "Every nation needs a free and relevant education system - class and geopolitical circumstance define the type of education accessible", "f6_no_assessments": 8, "f6_rating": 3.9583333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal tries to expand Checkpoint, a free digitally-interactive media brand that covers video games and their influence on society, culture, education, and politics. With the proposal, the team tries existing content into metaverse and can be accessed through any device. The team does not provide a potential risk in creating content as the main risk is the one that they want to solve and expand itself. However, the team still needs to foresee potential risks in terms of the transformation that they want to do.", "q0r": 4, "q1": "The proposal has a detailed plan and roadmap on the website they attach to the proposal. The team provides general budget information but is not broken down enough and should be written in more detail. For example, how much and what kind of equipment do they need? how much and how much money is needed to create a single lesson plan database? I also think 5k$ for contingency is too much except if stated for specific potential risks. The proposal gives details information regarding the background and experience of each people on the team. However, it would be even better if they also provide a LinkedIn profile for each team member. ", "q1r": 4, "q2": "Metrics for success are defined as the number of schools engaged and the number of submissions by the kids. However, It would be better if success indicators are more specific and measurable and time-bound, for example, have 100 readers in the second month, 20 schools engaged, more than 15% increase of readers each month, or 10 submissions each month from kids.", "q2r": 4, "assessor": "z_assessor_1342", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Education is the major disrupter in most societies from the status-quo of access to privileged people. Vision of global education is empowering like crypto breaking the central banking system.", "q0r": 4, "q1": "Global education is a grand challenge, as it goes across cultures, languages, govt systems and being recognized across govts requires brand identity which is good for checkpoint in USA. To reach beyond and reach the remote parts would be possible using the game based and NFT based system. Team is presented currently as single member (strong journalism work) and hope with more core members joining to enable the development, web platform can be built in phases (definition of phases would depend on the core team), and is not clear now. ", "q1r": 3, "q2": "Website is functional as MVP with some features enabled. Roadmap is defined and core part is creating the db for learning material and requires right team to take-on this dream challenge.", "q2r": 4, "assessor": "z_assessor_1461", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "I have already checked the website and found out that this is just a brief and concise description for this project, there is more detailed information on the website. People usually think gaming is just for entertainment and distracts their children from academic study. However, the team's intention is to fix that misunderstanding and provide a free education system that uses analogue education methods to teach digital literacy for a digital world and provides free digital learning materials online. It targets a variety of users from children to adults and develops suitable contents for each age group. Not only it shows the value of gaming when it becomes an interesting method of studying, but also helps people in the industry to get a wider understanding that games are providing more impact in other ways than just entertainment. In my opinion, this project is quite interesting and beneficial to the users, especially to the future generations in the technology field. Since it also helps nurture and train their intrapersonal skills, develop resilience, fact checking and so on, this system is quite supportive in preparing the younger generation for the future. In addition, the income of this project will not only depend on the blockchain or crypto but also come from the revenue stream, which I think is quite effective and unique. After all, I believe that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "There is a very clear roadmap on the website with detailed targets for each quarter from 2022 to 2024. The budget list is quite short and brief but the reasons behind each sum of money can be extracted from the proposal and the website, so I think the budget breakdown is sensible for me. The team members are very potential and committed, their experience and achievements are clearly showing that they have the abilities to successfully carry out this project. However, I think it would be better if some reference links can be provided for verification purposes to increase the quality of the proposal.", "q1r": 4, "q2": "There is clarity in the problem statement, solution and in the alignment with the challenge. The given key metrics seem to be good indicators for tracking the development of the project. One suggestion is that some clear and objective milestones with estimated KPIs should be added in order to make checking deliverables and the process easier for the community.", "q2r": 4, "assessor": "z_assessor_1702", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "To talk about the purpose of the project, it is obvious that it has a positive effect on education, especially in places where tuition fees are high. The use of Checkpoint - a digitally-interactive media brand is a fairly new method to convey education to users. However, it appears that this is all the project has to give in this section, while several crucial components are lacking. To begin with, the proposer stated that they couldn't find any future issues, but as far as I can see, it doesn't. For example, how do they verify that checkpoint users understand what the project is trying to communicate, or that the material they provide is acceptable for all ages? In general, the proposer should learn more in order to provide particular solutions and minimize needless risks. Also, the proposer stated an attachment with information about their work, but I can't locate it anywhere. Before submitting this proposal, proposers should carefully double-check all information. Most significantly, I don't see how it will have any impact on the Cardano environment. This is a significant minus point for the evaluation process of investors.", "q0r": 2, "q1": "According to what the proposer mentioned in this section, the project can be completed in 2022. For an educational assignment, this was a relatively rapid procedure. However, there are three aspects that I hope the proposer can explain or enhance in order for the project to be completed. To begin, the proposer should provide a specific timeframe for each stage. It does not have to be hourly, but it must indicate how long each project activity takes. The benefits of this include getting things done on schedule and being able to easily follow progress, thus I hope the proposer can add it soon. Secondly, the proposal includes a $5,000 contingency part but does not clarify what it is for. It may not be mandatory to say it, but giving an example of it is not necessarily a bad option. Finally, as previously said, the proposer needs funds for marketing. Not to mention whether it is pricey or inexpensive, but as far as I can tell from the project team, no one has any expertise pushing a project. As a result, the proposer should recruit additional individuals with knowledge in this area to guarantee that the money is used wisely.", "q1r": 2, "q2": "Overall, it seems the project hasn't really lived up to expectations. The proposal could not define a schedule or the number of schools that would participate. It may be impossible for the proposer to provide exact statistics, but it is feasible to estimate 20-30 schools in order to create a good impression on the sponsors and to keep the entire team motivated to achieve what they propose. Also, given the results listed by the proposer, I still don't see how it assist the Cardano ecosystem. This is a really unfortunate aspect of such an excellent project title.", "q2r": 2, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Not even children ,even adults are also mostly interested in games ,so the proposed model helps in bringing ,new age community for learning new things where they can explore the data in the form of video games or other digital materials , where they can get use to NFT ,and also understand the importance of cardano in upcoming future projects, hence This proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has a vast experience in the field of journalism and as well as gaming community, putting together all the experience he can implement the task without much difficulty.\nCheckpoint is also providing all the games and NFT contents, for free of cost which will definitely attracts the people, with all digital media knowledge provided in the proposal ,plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer hasn't mentioned what kind of games he is going to introduce, whether it is aggressive fighting games or Intelligence interesting games.\nExcluding the above mentioned point , the proposal  contains excellent manner in bringing the solution to the challenge, he has also introduced the team with whom he'll be working with  in the proposal, hence the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Using the blockchain to provide education online will help bring numerous advanced and unique experiences to future interactions with content. The primary audience for this initiative is children. They can easily reach their target consumers, which are children and adults, thanks to their experience in the game sector. However, I do not see two examples of the work they already do for schools and home learners attached, so the proposer can add this information later. Seeing these examples will provide readers with a full understanding of the impact of Checkpoint on influence in education. The proposer provides comprehensive information about how Checkpoint gaming affects educational content to attract children, and all of it is provided for free. I recommend that the proposer provide some key metrics to address how they relate to the challenge. They can make it apparent that they provide numerous methods of learning and how they expect children approach these methods. According to the proposer, there are no risks other than the need to complete the project as soon as possible in order to own the area. I presume this is fair because the proposer is already carrying out the work; bringing digital education closer to children is one of the numerous effects Checkpoint has.", "q0r": 5, "q1": "Those are the milestones anticipated by the proposer, but not a roadmap. They must describe clearly the roadmap's timeline and what work they will undertake within that timeline. The proposer should offer a more detailed roadmap so that the budget breakdown estimate is more accurate. Furthermore, writing down the roadmap might assist in identifying the target and creating deadlines. I recommend that the proposer create a roadmap based on the budget breakdown. For example, when will the lesson plan database be updated, what equipment will be required, and what marketing approach will be implemented? Otherwise, the team members' information presented appears to be fairly informative and relevant to the project. To boost reliability, I recommend that the proposer attach a link to some of the member's history and experience.", "q1r": 3, "q2": "More might be said about project metrics reporting, in my opinion. For example, include information on the number of global schools that the proposer expects to gain. Make it clear how statistics and tracking concerning the number of submissions to the Kids magazine will be collected and shared, as well as how digital literacy will be updated globally in what way. I recommend that you construct bullet points in the plan first, then add a brief narrative underneath to make it easier to understand.", "q2r": 4, "assessor": "z_assessor_1934", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Every nation needs a free and quality education that can be accessible by all. In other to provide solution to the problem the proposer team created checkpoint which provides free digital learning  materials  online. Using analogue education  methods to teach digital literacy for a digital world. Thereby identifying a problem and also providing solution for them. The proposer  articulate how it will add value to the cardano ecosystem  by the use of NFT cards. The key metrics and goals of the proposal  aligned with the stated challenge settings  and it also addresses future challenges through the use of check point which is  free online learning  where kids can learn and share knowledge.  Therefore I strongly agreed that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team made us to know that their project ( checkpoint) is a multi-faceted, digitally- interactive  media brand that covers  video games, and their influence on the society, culture, education and politics. They provided a YouTube link (https://www.checkpointhub.io) where you can view their work. They also tell us about their team members , their skills and experiences and the role they will be handling. There requested for 60, 000 USD for the project which I find reasonable  and it is broken down to an identifiable items. The timeline for the project. I recommend you provide a realistic timetable like when is the program start, the period of time it will run for etc. The implementation plan is sensible and conductible.  The plan describes the resources necessary to implement the proposal and they explained the technical aspects like the technology needed for implementation. The  challenges were also considered . With this it is highly likely that this proposal will be implemented successfully ", "q1r": 4, "q2": "From the information provided shows that it is sufficient to  fully audit the progress and the success of the proposal. There is a clear description of the problem, the solution  and how the proposal is aligned with them. The roadmap and the time horizon is clear for achievement. The metrics/Kpis  that defines the success of the proposal.  Therefore I rate audit with a score of 4.", "q2r": 5, "assessor": "z_assessor_744", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This is a great initiative! The problem itself is clearly outlined and the proposed solution can indeed address the problem. However, I do believe that there are three areas affecting the scale of impact that may benefit from a certain degree of re-evaluation, and they are:\n\n1. The problem itself can be more succinctly defined. \nIn the problem summary, the proposer stated that \"Every nation needs a free and relevant education system - class and geopolitical circumstance define the type of education accessible\". However, it's not clear what does a \"free and relevant education system\" entail, and why current education systems are not up to the task. This causes confusion for readers of the proposer as to what exactly is the problem that the team's trying to solve with the project: Is the target audience children? If so, what exactly is it that they're lacking under our current model of education that is in urgent need to be fixed? Is this problem specific to a specific country or region? Is this project a good-to-have-but-not-critical one, or is it really fixing something that dearly needs fixing?\nInstead of saying that every country needs a free and relevant education system, explain what exactly in our current model of education is in need of urgent fixing. Be specific. For example, I can identify the problem as: mindless learning of students in countries with high-stake standardized testing (eg. China, Korea) where students forget what they learnt immediately after the exam has passed; they do not know why they're learning certain things and view learning only as a means to an end - achieving high marks in exams.\n\n2. It's hard to pin down the unique selling point of the product as it's too broad.\nThe product seems to be trying to do a lot of things at once and as such, it confuses readers of the proposal on what exactly is the unique selling point of the product. i.e. why would people use this over the other competitors out there. When reading, I've been trying to actively look out for a unique selling point but can't see if it's the children-focused nature of the content, the interactivity of the content, emphasis on learning through gaming or anything else. This overlaps with the first point. Identifying a unique selling point would be ideal to cement dominant position in the market. \nPerhaps a good unique selling point would be the family-orientation. Instead of saying that this product is for both kids and adults, let's orient it as a playground for families (playground, because there is a suite of different sub-products like games, podcasts etc under it). Couple it with the interactivity across different medium and it'll be great.\n\n3. Scalability.\nFrom the proposal, it seems like the content creation will be primarily done by the team apart from the one for the kid's magazine. This model is not scalable. Instead, it might be good to experiment with other models - for example, by eventually positioning the product as a portable infrastructure for relevant content creators to reach the audience base that the product has gathered. This model is similar to how MOOC platforms like edX and Coursera are run. However, this links back to the point again: we need to be specific on who exactly our target audience is.\n\n4. There's little contribution made to the development of the Cardano ecosystem.\nApart from launching the NFT collection on Cardano, there's little reference back to the usage of Cardano's infrastructure for this project. Furthermore, as the audience are largely in the Web2 world, having an NFT collection requires them to have a web3 identity which may be a hurdle to overcome for it to succeed. This requires some consideration. \n\nThese are my two cents after reading through the proposal, hope it helps!", "q0r": 4, "q1": "Based on the founder's experiences as accomplished journalists and teachers, there is reason to believe that the team can deliver for the quality of content created given their ability to put themselves in the shoes of the audience to better see what would appeal to them. However, that's if the product is to remain primarily as a content creation and distribution medium. \nAs stated earlier, the content creation model may not be scalable and an infrastructure model may do better to enhance scalability. However, if the suggestion has been taken, it's related more towards operations and logistics and less so for content creation. If that happens, a new team member with the relevant experiences may be necessary. \n\nIn the short run, however, the team should still continue this model so as to build a dedicated audience base and establish itself as an incumbent in the space. As such, what is its unique selling point will need to be considered.", "q1r": 4, "q2": "As a content-creation platform, this is easily auditable as we can track the progress of the contents created and see if they're going as according to schedule, and easily audit the quality of content created. To assess the quality of the content created, a routine feedback mechanism may be good where feedbacks from the users can be collected and shown to the wider Catalyst community for accountability. \nThe number of schools engaged will be a good metric too to measure the success of the proposal. However, it'd be better if the nature of engagement can be outlined in detail in the proposal as well - what will the engagement entail, how will it create more value for the students and if it's feasible to replace time for the main curriculum to this.", "q2r": 5, "assessor": "z_assessor_912", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Checkpoint provides free digital learning materials online - using analogue education methods to teach digital literacy for a digital world.", "experience": "I've been a journalist for over 20 years and have come from a BBC and Guardian background - broadcast journalist (award winning). I have been in the games industry for over 15 years working and launchings some of the most recognisable gaming sites specialising in audiences."}