{"id": 404970, "author": "matthiasksieber", "title": "Property Registration for Housing", "url": "https://cardano.ideascale.com/a/dtd/404970-48088", "category": 26435, "amount": 98400, "description": "Governments & nonprofits are not effectively solving the housing crisis. Private citizens that want to open their homes face many barriers.", "f6_no_assessments": 7, "f6_rating": 4.285714285714286, "videos": [], "media": [], "f6_assessments": [{"id": 3794, "q0": "Bravo! You have described your proposed solution in the most detailed way. The project, yes, has its own target users, namely displaced and homeless ones, and its features are relatively obvious and perspicuous. It seems that they and other people in difficult circumstances could receive much assistance from your project. Introducing your partners is also known as an indicator of a professional working style. The second plus point is that most of your key metrics align reasonably with those of the challenge. But there are some tips I want to give you in this section. With regards to the Dapps impact on social/financial inclusion and economic development, you shouldn’t provide such scant information like that because you know, influences of dApp on social, financial and economic growth are known widespread as crucial factors for these proposals to reflect their possibility of success. For this reason, I believe you should add more information about your project’s impacts to these factors instead of only expressing some words like “Very positive” or “Good”. If you can present how positive these effects can be, it means that your project completely has the ability to tackle the challenge. Finally, concerning the risk that your team could encounter, you said that it’s very low thanks to your previous experience of a successful shared housing application. Obviously, the rate of risk is low, yet it’s not zero, isn’t it? Thus, in my opinion, you should try your best to predict which hindrances your team can get into in the working process concomitantly with the best solutions.", "q0r": 4, "q1": "Awesome! Upon reading the introduction of your working team, I find it very detailed, to the fullest extent, and I genuinely believe that with such in-depth working experience in the relevant field, your team is highly regarded to make headway with the project. And even it would be perfect if you can attach LinkedIn links into every introductory part of your core members to demonstrate the authenticity of your words and persuade the voters well. Your requested budget is broken down explicitly and linked with your roadmap, which is presented in a well-organized way. From my viewpoint, I have read many proposals related to this topic, and I was truthfully satisfied by the very detailed way they provide their work plan, including activities within every milestone. I admit without doubt that your proposal provides adequate information about the timeline and goals of the project, but as I said before, if you could name several typical activities in the milestones, the voters will be able to see the transparency in your schedule.", "q1r": 5, "q2": "Your success criteria is easy to capture and sticks to the reality, the housing crisis. You manage to figure out the success for this project by giving a specific number of prosperities (100) listed after 3 months of the platform launch. Regarding the methods you use to measure the project development, you were able to come up with some initiatives to assess it, like retrospectives and sprint planning. You declared that the community could measure the project progress based on your milestones, too. However, on the technical side, you failed to let them know which measurement tools they can access to keep track of easily. This is also the most essential content, so please put forward at least one or two tools for the voters to supervise your project thoroughly. Anyway, I wish that your project could flourish and succeed as fast as possible.", "q2r": 3, "assessor": "z_assessor_1675", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 7457, "q0": "This proposal is extremely necessary and can be very useful for society and also beneficial to expand the Cardano ecosystem. The idea is to create a “one dapp for homeowners to register their properties/properties for housing programs. These programs may include long-established voucher-based housing programs, time-sensitive temporary housing (to serve people displaced due to natural disasters, refugees due to war, etc.), or the common rental market.” That is, a platform that will help people who are experiencing some type of vulnerability to register their homes, while using technologies relevant to the Cardano ecosystem, as the data will be recorded on the blockchain. I believe it is an idea that aligns very well with the proposal, since it will have a very strong humanitarian impact, and this challenge from what I understand is to help promote Dapps that are beneficial for Cardano but also help people from developing nations or those that are experiencing a problem (in this case, whether social, if they are trying to link to affordable housing programs, or environmental, in case they have been affected by natural disasters). Several points are positive here: some bidders already have previous experience with the property registration issue; the project will be developed by the team of the company Loxe Inc., which is extremely skilled in the technical aspect, has already won other financing and they already have projects being executed (such as the Win Win platform) with our blockchain; another positive point is that they have a lot of networking, connections and important partnerships that are certainly a differential to increase the quality level and the future success of the proposal; etc. In other words, I think the proposal makes a lot of sense with the challenge it was submitted to and has a high chance of having a truly positive impact. \n", "q0r": 5, "q1": "The feasibility of the proposal is very good, starting with the script, which activities would be carried out over the months are explained. In this way, it is punctuated in a very exact way how the project development process would be, making it simple for us to understand the steps that would need to be taken. In relation to the budget, the amount requested is high, however it is well explained, it is basically the salaries of the professionals involved. There are a lot of people who would be working on this project, so it's justified because the requested amount is needed. My suggestion for making this part of the proposal even clearer is: it could be better explained how the work routines of those involved would be. Would everyone dedicate themselves full-time, or just part-time, to the project? Would some spend more time working on it than others? I think that if we knew how many hours each one would dedicate to the realization of this Dapp, we would have a more solid understanding of how the money would be used, since we would know the price per hour of work of those involved. Now, speaking of the team, this is the best part of feasibility. We know a lot of information about everyone involved: their names, academic backgrounds, areas of professional activity, so they relate to the Cardano ecosystem (we have experts in Plutus and people who have developed important tools for our community, such as CA and vCA tool, for example). There is a lot of confidence in the team and in its ability to carry out the project successfully. Therefore, I believe that my only suggestion is to add the working hours information from the budget part, this would be an addition to improve what is already good. \n", "q1r": 5, "q2": "It is possible to follow the project development process based on the steps provided by the roadmap, but it would be interesting for the team involved to make their weekly analyzes (or part of them available to the Cardano community). With this, it would be possible to understand if the small objectives of the smaller time periods were reached, if the established KPIs and goals were being achieved. However, it is not very clear, in my opinion, if this weekly analysis would really be shared, how the Cardano community could have access to this information, how we could safely understand if the tasks were being accomplished at the right time and in the right way. So in my view, even though the team has provided information about the feasibility of the project, it is not so clear how it would reach all of us, requiring a review of this part of the proposal. Regarding the final results, the main objective is to help solve the housing crisis, as the proponents say, and this can be seen by the number of houses registered in Dapp (the goal is 100 properties in 3 months). I believe that as properties are registered, this social benefit will occur as well as the popularization of Cardano, after all, more people will be getting involved with the technologies of our ecosystem, knowing them and understanding their advantages. So my opinion is that the process of auditing the progress could be better detailed and clearer, but the final results part is more tangible and simpler for the community to follow. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2201, "q0": "This proposal is to effectively solve the housing crisis, making renting and leasing easier. It can be considered a proposal that somewhat fits the challenge's criteria, as it helps improve people's lives. However, the project may have to develop much further to apply on a national scale. Also, the author only mentioned that he would cooperate with two other projects, Landano and Homeless Hub, without explaining how this model will work and the appropriate technical solutions. (Rating of 3).\n", "q0r": 3, "q1": "It isn't easy to assess the technical feasibility of the proposal when the author only gives general concepts. But based on the information provided, I assume that technical solutions are possible.\nEconomically, the amount required is average, not high but not low either. The budget breakdown is specific and reasonable. My recommendation is to explain how to generate sustainable revenue for the project.\nIn terms of human resources, the team has relevant knowledge and experience in building a similar project before, which is a great advantage. Still, through that, it is not convinced that the project has a low risk. (Score given: 3).", "q1r": 3, "q2": "Regarding clarity, the concepts mentioned are too general and vague. The roadmap, milestones, and KPIs are realistic and acceptable in terms of audibility. However, I suggest more clarification and detail. (Score given: 3).", "q2r": 3, "assessor": "z_assessor_1459", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4068, "q0": "The proposal aims to create a permissionless system which helps poverty owners to join in the housing program. The team has already developed a shared housing application before and now they want to upgrade it by building with the actual stakeholders and without an intermediary. I think this is a great idea since it gives people who do not have a house to live in and solve the housing crisis at the same time. The team also specifically notes the impact of the project and shows how effective it is based on the challenge key’s metrics. However, I think that the team should provide more information on how it can come to this success. For instance, by what action/ factors can it bring positive impact on the social/ financial inclusion?, etc.", "q0r": 4, "q1": "There is an already committed team with experience in such activities proposed. However, I suggest the team should provide some reference links for verification purposes (Linkedin, for example). There is also a solid time-framed plan divided into three main phases and noted with specific tasks, which I think is very good. There is a sensible budget breakdown which is clearly broken down into project activities and hours required; and it also matches with the timeline. I strongly agree that this project will be implemented successfully.", "q1r": 5, "q2": "I think you should provide more clear information on which ways you can measure the development of this project. The key metrics are clear but you could add some more estimated KPIs which help to define the success easier. It’s also possible to extract some good milestones from the timeline provided which help the voters and the community audit the project easier. However, I suggest a channel where the community can follow the process and interact with the team members would further increase the level of auditability of the project.", "q2r": 4, "assessor": "z_assessor_1702", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4262, "q0": "When combined with organizations like Landano or Homeless Hub, whose projects concentrating on homeless shelters have been submitted to prior Cardano funding, the proposer appears to have made a wise decision. This is advantageous since the proposer will learn from the predecessors and improve the inadequacies in this area. As a result, rather than focusing just on homeless individuals, this project also includes persons who are only temporarily housed as a result of natural catastrophes or war. This is a wonderfully humane project. The proposer, in particular, underlined the influence of Dapp on financial and economic growth, which perfectly aligns with the challenge's KPI. Overall, everything is good, but I still hope the proposer could specifically state the project's influence on the Cardano ecosystem. Whether it is a rise in the number of individuals engaging in the community or the number of Dapp users.", "q0r": 4, "q1": "From the staff to the implementation plan, and the proposer's way of using the budget, I believe that nothing can stand in the way of the success of this project. First of all, about the team members, they have all worked together and developed a shared housing application as well as a questionnaire app for a large housing service provider in Los Angeles. They will benefit the project much in the future since they understand one other's working ways, know each other's strengths and shortcomings, and comprehend the working attitude. Plus, the project is specifically planned for the last 7 months of 2022, with a series of activities outlined in a very well-ordered layout. Finally, I appreciate that they specify a monthly amount and then multiply it in installments. This makes budget management transparent and assists the team in spending money in the most cost-effective manner possible.", "q1r": 5, "q2": "Specific information about the properties is supplied in the successful delegation section. It appears to be brief, but I believe the proposer has mostly satisfied the standards for this section. It should, however, be linked to its influence on the Cardano ecosystem to emphasize that this project is acceptable for development in this community. Additionally, rather than simply saying \"measure and assess development,\" they should demonstrate how to do so, as well as timetables. From there, investors can monitor the project's operation.", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5332, "q0": "Renting an apartment in a big city necessitated a permit process and important paperwork. The team's goal is to create a permissionless system that will enable property owners to engage in housing projects. The team completed a project for a shared housing app in 2021 and is certain that this proposal will be risk-free or low-risk. I recommend that the proposer offer a link to earlier work as well as some material to back this up. And, as feedback on the Loxe Inc. project comes in, the team will make improvements to this initiative. The team proceeded forward and discussed for months with the Landano team and several experts, and even the partner the team is working with can aid in some way. I sincerely appreciate the proposer's efforts in preparing the project, and I am confident that the work will contribute to the project's success. The main metrics for the challenge are provided in close proximity to the challenge KPI.", "q0r": 5, "q1": "This timetable and plan correspond to the metrics in Impact. The first month will be spent on preparation, and the project will be ready to launch in the next three months. However, because the proposer is confident in the project, which is a positive thing, they should include a testing process in the timetable to ensure that everything goes as planned. On the other hand, the proposer specifies a team and knows who they will need, which is quite good in comparison to other proposals, which frequently do not indicate how many people would be needed to accomplish the work.", "q1r": 5, "q2": "The project will be evaluated on a weekly basis based on milestones. I can see the milestone set to be solid enough to audit the proposal's progress and success. Weekly evaluations will have an impact on how the team focuses on their task. This project will be open and honest. A tangible goal is also provided, however it would be fantastic if it could be extended, such as the target in 6 months or 1 year. This project, in my opinion, is completely auditable.", "q2r": 5, "assessor": "z_assessor_1934", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7972, "q0": "A platform that connects benefactors wishing to give charity to the right recipients in Africa. The charity everyone wants to do, but the financial transparency as well as through too many complicated administrative stages of many government agencies or for some other reason, it does not reach the hands of the people in need. This is why a development team in Africa is proposing a platform that makes all of this public. They manage information on the blockchain and verify the information of the needy and the aid can go directly to those in need.", "q0r": 5, "q1": "The work goals are clear according to the months, the total implementation time is 8 months. They have a team of 9 available with prior Haskell and Plutus training. At the same time it is one of the most active groups in Africa and has worked on several projects before. The idea of making charity transparent is not new, but only when blockchain is applied can we realize it. Due to the nature of storing information and accessing information, it is not limited to a global scale and only requires an internet connection.", "q1r": 5, "q2": "They will create a tool to accompany the project to measure activities on the charity platform. From there, assess the project progress, impact and real demand for this platform. The community will be the verifiers, the information of the charity recipients will also be made public so that it can be verified by the local authorities themselves.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}], "solution": "A permissionless system that allows property owners to participate in housing programs.", "experience": "Loxe Inc. Experienced team with developers and designers that deployed a shared housing app in 2021 that served hundreds of formerly homeless people in Los Angeles."}