{"id": 405294, "author": "scinstitute", "title": "WadaDex|Facilitating Capital Access", "url": "https://cardano.ideascale.com/a/dtd/405294-48088", "category": 26435, "amount": 80000, "description": "Onboarding to Ada and other cryptocurrencies is complex in emerging markets; accessing capital to finance projects is costly and difficult.", "f6_no_assessments": 8, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 9722, "q0": "The proposal embraces the challenge at hand beautifully. The proposer understands the requirements and the expectations of the challenge and has narrated their plan in a simple and understandable manner. The idea to target the African countries and involve the government and other major organizations like African Development Bank gives the proposal more validity and effectiveness. The proposal plans to make the adoption of Crypto across the poor countries faster and also bring in capital for various projects through their platform which in turn will improve the infrastructure and the quality of life of people in these countries. The involvement of huge public entities and community hubs will eventually bring more players into the ecosystem and also a lot of capital which the government alone could not bring, and therefore the development in these countries will revamp.", "q0r": 5, "q1": "The fine detailing provided by the proposer regarding their action plan and the plan being stretched over 12 months shows that it is not an overestimated project and the team clearly has plans to continue attracting funds in the upcoming rounds. The 4 monthly road map is a reasonable plan and looks sensible in every way. The Wada team being a recognized catalyst community player and the expertise they carry around their shoulders makes the plan all the more valid and interesting. There lies no doubt in their experience and also the team is aware of the challenges and risks involved in the successful implementation of the project and also seems to know their way around them.  The requested funds of 80k with the breakdown along with it looks practical and necessary considering the 12-month road map the team has in mind. So I would make no reservations in providing 5 stars for the feasibility of the proposal.", "q1r": 5, "q2": "The proposer understands the success of the project and has laid out the possible performance indicators that the community can use to track its progress. The KPIs are in sync with the challenge's metrics. The strategic and operational metrics and the proposer's intent to measure even the unsuccessfully funded projects show the proposer's intent to inform the community of every outcome. The proposer also mentions the success of the project be it the involvement of government entities or the number of individuals onboarded or the ease of use of the product, all are aligned with the challenge. And the proposal having the experience of going through previous funding rounds shows that the community already trusts the team and their work to a huge extent. Hence, given the openness of the metrics and visible outcomes, it shouldn't be hard to audit the proposal's success.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2202, "q0": "This project fits the challenge since its goal is to simplify the crypto world's accessibility to the average African users, thereby helping them alleviate poverty. The promise of its impact and scalability is quite significant. Thus, it is an attractive, detailed, and well-invested proposal. (Score given: 5).", "q0r": 5, "q1": "Technically, the development and implementation steps are fully covered, logical, and highly feasible. Explicitly explaining the technical solutions might be too long for the post, but summing them up and providing a link for interested readers would be perfect. The required funds and the budget breakdown are also apparent, specific, and reasonable. The current team includes verifiable quality members who have a lot of related experience and capabilities to carry out the project. However, in terms of numbers, a large project like this will likely require additional staffing or outsourcing, which will add costs. I also suggest considering explaining the quality control of listed projects and training users to make informed investment decisions rather than FOMO. In general, aspects of the implementation plan are relatively exemplary. (Score given: 4).", "q1r": 4, "q2": "The proposal provided an understanding description and solutions to the problem to be solved. Roadmaps, milestones, and KPIs are specific and realistic, making it easy to audit. (Score given: 5).", "q2r": 5, "assessor": "z_assessor_1459", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2355, "q0": "The goal of this project is a fiat and mobile accessible platform that simplifies entering the crypto market and facilitates access to capital for projects for the Cardano community. WadaDex, is Two-tier liquidity-maximizing exchange to simplify participation and facilitate access to project capital through a frictionless micro-capital market.WadaDex is designed to achieve two goals:\n+To simplify participation in the cryptocurrency ecosystem\n+ Facilitating access to capital for projects that would otherwise remain unfunded due to rising inflation, high interest rates and foreign exchange fluctuations that pose risks. This project is fully aligned with the Challenge KPI knowledge - especially the challenge's core principle is that \"for poor countries without a foundation, National Building Dapp solutions will be the building blocks that enable sustainable prosperity.\nWith those impacts, this project will be successful in the future to support the growing community. ", "q0r": 5, "q1": "Based on the information provided, it looks like this proposal will be successfully implemented. WadaDex is in the fortunate position of being able to put WadaDex principles into action with Project Finance's ongoing fundraising commitments in emerging African economies. This gives more clarity to platform goals, functions, and objectives.\nProponents also outline partnerships with other organizations/groups, which gives me confidence that they have some grounding to lay for the development proposal. In addition, the proposals created a Progress for the project, which shows that they worked on the plan. Also, Wada has been managing their coffers, so they have related experience with catalytic payments.\nThe proposals outlined a reasonable budget for the project. Given the time and effort that will be put into it, I think the financial incentives are sufficient. ", "q1r": 5, "q2": "Sufficient information was provided to audit the progress and success of the proposal. The proposals have provided a roadmap of their progress, which will allow the community to track its development. There are also good key performance indicators of particular value that can provide insight into the success of a project. From the information in the proposal, it seems that the proponents will be transparent about the progress of the project, so I believe they will provide regular updates to the community. ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 3391, "q0": "The main features and objectives of the solution are clearly displayed in the proposal. Their goals are to simplify the crypto market participation and facilitate the capital access, directly affecting the Cardano ecosystem. They also provide the process flow via an attached presentation slide, enabling the community to have a broad overview of their project.\nThe proposer has proven the useful functionalities of the WadaDex platform, what this platform is capable of and how this project will create positive prospects. The team also firmly ensures the perfect alignment between the project and the challenge KPIs. Very clear project outcomes are indicated, showing their intensive understanding and strong determination to successfully execute the project. The community can take this into their assessment process to have wider perspectives.\nThe main risks and challenges are well foreseen together with some solving orientations. The community can clearly see 4 main risks that need to be addressed as mentioned in the proposals. Effectively forecasting these challenges, the team has taken the proactive steps in managing strategy. This will help the team prevent any future failure and assure the expected impacts of the project.\n", "q0r": 5, "q1": "Their action plan is very specific and detailed. They have divided the operation process into different periods of time followed up by the main tasks and subtasks. All the information is presented in a logical order, making it very clear to understand. The community can base on this timeline to assess the attainability of this plan and monitor the deliverables of the project. \nBased on their action plan, a detailed budget breakdown is being proceeded accordingly. How much they need, how they gonna use the fund, and for what sections are elucidated in the proposal. This will help the community examine the effectiveness of their financial allocations and better track where the money goes.\nThe proposal has provided a good description of their team members including their positions, relevant working experiences to the blockchain technology, and their LinkedIn accounts. \n", "q1r": 5, "q2": "All the key metrics to measure the progress and the development of the project have been presented. These KPIs are directly linked with the expected deliverables of the project, allowing them and the community to closely monitor the development path. If they set the specific required numbers that can be marked as successful for some of the KPIs, it would be much easier for the community to assess their success. In the meantime, their vision of the project’s success is very clear. They know what they aim for, which empowers them to stay focused and follow a clear direction to get the best of the project.\n", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4132, "q0": "The problem that the proposers are looking for a solution to is to simplify participation in the cryptocurrency market, leading to expanded access to capital for projects. The solution is to establish a platform that is easily accessible on phones and fiat. I think this is a great initiative and this project has a lot of potentials to accelerate the development of the Cardano ecosystem.\nThe proposal team has set a goal for the project. The goals that this project aims to achieve will have a direct impact on the Cardano community and accelerate its growth. The strength here is that to be even more specific, the proposal provided details about the platform's features. How the platform works were explained very well. The proposal also provided a comprehensive view of the project's approach and impact on its potential audience. However, proposers should also be a bit more specific about who the potential audience is and how the project benefits them.\nThe project presented the desired results in a specific, easy-to-understand manner. At the same time, the project's KPIs are also explained very thoroughly and completely match the Key metrics of the challenge. The presentation of the proposal is easy to follow up because it separates each part and details it clearly.\nProposers have seriously recognized three main challenges for the project: Regulatory Risk, Inadequate Project Capitalization, and Feature Phone Integration. With practical experience, the team has also given directions to minimize risks and also solutions when these difficulties arise during project implementation.", "q0r": 5, "q1": "The project implementation plan within 12 months is divided into periods. The project's roadmap is presented very specifically, has a clear realistic timeline and clearly outlines the required products of each period. Roadmap is very clear but if possible go deeper into the technical and technological aspects required to execute the project.\nThe $80 000 budget is broken down into investment categories. The budget plan is quite reasonable for the tools or techniques needed during the implementation of the project. The presentation of the budget plan is also very easy to follow. Expenditure items are assigned an amount and presented in bulleted format. However, I have a question, which important positions are needed in the project implementation process and how many personnel are needed? In terms of personnel, it can be considered as part of the spending budget to pay salaries for employees.\nLooking through the profile of the project management team, these are people with extensive experience in the field. They also master the skills to manage and operate projects. With solid background knowledge, the management team is trusted to bring the project to development on schedule.", "q1r": 5, "q2": "The development progress of the project will be monitored by the community based on specific quantitative indicators. Imagine what specific indicators will be when the project is successful. Please provide those numbers clearly. This proves that the team has seriously pursued the set goal.\nThe definition of project success is clearly stated through the achievements that the project promises to achieve after being funded. Which is divided into 2 aspects of success in technology and in traffic attraction activities. Based on this information, the community can regularly check and evaluate during project implementation.", "q2r": 4, "assessor": "z_assessor_1709", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4964, "q0": "The proposal does not sufficiently address the Nation Building challenge nor does it provide enough detail and support to indicate to voters there is high likelihood for success.  The primary goal to facilitate capital access is admirable however I would recommend the proposer scale back the proposal and address a specific need within his overall plan.  The challenge states proposals cover foundational registries which the proposer does not appropriately address.  Great idea but needs more work.", "q0r": 2, "q1": "The proposer and team do not have the complete background nor historical experience to warrant the fund request and the project’s feasibility is questionable.  The proper provides a roadmap which is a significant amount of work and I question the ability to complete.  The budget while segmented by milestone and timeline should provide more detail especially hourly scope for technical needs.  I would recommend the proposer collaborate with a Cardano development firm to scope the project since the rounded numbers, to me, are a red flag.  It appear the team has experience and knowledge within this area and the proposer should be able to identify a focused and specific solution which can provide a basis for Wadadex to build upon.", "q1r": 2, "q2": "The proposer does provide a significant list of KPIs (operational and strategic) which is good however the number of milestones which need to be achieved seems doubtful.  The proposer has not articulated a means of communicating progress and a review of the website shows a static page.", "q2r": 3, "assessor": "z_assessor_1807", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6273, "q0": "The proposal aims to create a Decentralized Exchange that serves two goals: create efficient capital liquidity for projects and onboard new users to crypto. The current financing structure is not optimal for projects who need liquidity due to the time and administrative constraints that come with Catalyst. The proposed platform could help in this regard. It is not clear however, how creating another Dex besides all the other Dexes creates additional value for new users in crypto. The proposal wants to develop a wallet with a direct FIAT interface. But is not clarified if this feature is the solution for the challenge of onboarding more people. The Wada team could have a marketing impact with their connections in different countries.", "q0r": 4, "q1": "Wada is already an established team that has multiple successful proposals. However, this proposal tries to solve multiple problems with very large solutions in a short period (4 months) by building a Wallet with Fiat On-Ramp, a Dex, a lending plattform, governmental deals etc. without a clear regional focus for just 80k. All though they have their boots on the ground in different locations in Africa and some financial expertise in their team + an established partner (Joget), the goals of this proposal seem very ambitious over that time horizon. It is more likely that creating a sustainable solution for both day to day crypto users in Africa and project financing in collaboration with governments will take rather years (e.g. look at IOHKs Africa track record)", "q1r": 3, "q2": "The proposers want to measure both operational and strategic goals such as numbers of wallet users, projects financed and government partnerships in different regions. Furthermore the team provides a roadmap with different milestones. Unfortunately risks and challenges were not sufficiently addressed in the proposal. A clear description of the risks regarding compliance and legislative / political concerns as well as onboarding new customers are not sufficiently addressed. (Maybe due to the fact that there is no regional focus and hence no connection to specific compliance regulation)", "q2r": 3, "assessor": "z_assessor_380", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7045, "q0": "In order to onboard to Ada in emerging markets and easily access capital to finance projects, the team presents WadaDex, a fiat and mobile money accessible platform that simplifies crypto market participation.\nIn particular, the objective of the team is to engage with the African Development Bank and other Development Finance Institutions, local street preaching pastors in markets like Ghana.\nFurthermore, one of the main reasons WadaDex was created was to create a secondary market for Catalyst projects that have received one funding round of capital.", "q0r": 5, "q1": "The team is part of Wada, a Cardano-based community network of 25+ professionals with 20+ funded proposals focused on connecting the world to Africa, hence the team has the relevant experience required to deliver the proposal. For example, Josh Fielding - Global Lead @Wada. Has a combined 10+ years’ experience in fintech and startups, focused on banking, payments and lending across Europe, APAC and African continents.\nThe team is also well aware of the risks of the project and know how to tackle them.\nFor example, the regulatory risk, the Slow Adoption, as in promoting WadaDex, a significant educational component is required, the inadequate Project Capitalization, as the projects that list on the platform must have access to capital in order for the platform to be successful, and feature phone integration are important and represent a risk of failure - should the feature phone operations not work, the platform would still be robust and fully functional.", "q1r": 4, "q2": "The info are complete (see rationale below). One small note: the website linked seem not working (just starting page) and the power point linked contains a video and not a workflow. \n\nrationale for 5 stars:\nHalf of the budget will be used to Build - Design, Technical Implementation, Deployment, focusing on activities such as token and NFT Minting and Management\nCrypto Onboarding to WadaDex Wallet?Financial Modeling, Quantitative Analytics, Risk Management and Design\n?\nThe other half of the budget will be used to Deploy - Populating, Outreach & Awareness, Sustainability, in activities such as: establish key Momo Mobile money partnerships in Ghana and Nigeria, establish key Forex partnerships in Ghana and Nigeria creating simple asynchronous courses and video explainers to highlight components of WadaDex.\n\nThe team also divided their KPIs in strategical and operational measure for progress, such as number of government contracted parties using WadaDex as a primary raising platform and number of individuals with WadaDex wallets.", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "WadaDex: a fiat and mobile money accessible platform that simplifies crypto market participation and facilitates capital access for projects", "experience": "Wada is a Cardano-based community network of 25+ professionals with 20+ funded proposals focused on connecting the world to Africa using blockchain and AI. SCI develops financial and blockchain applications with an emphasis on Trusts, Risk Management, and Financial Engineering."}