{"id": 350676, "author": "YaySwap", "title": "Decentralized exchange on Cardano", "url": "http://app.ideascale.com/t/UM5UZBiOx", "category": 25941, "amount": 65000, "description": "Token holders want to be able to trade their tokens and easily earn from like they would in a high-yield saving account.", "no_assessments": 46, "rating": 2.347826086956522, "videos": [], "media": [], "assessments": [{"question": 1, "note": "This project is likely to bring hundreds of thousands of users of the Cardano blockchain through automated token swap for low fees. If the app is up to the task, the influence of a decentralized exchange platform is potentially huge in terms of growth in transactions. The different features seem to be very complete, I particularly appreciate the smart wallet enabling to swap between main cryptos.", "rating": 5, "c_fb": 2, "no_vca": 6, "reply": "", "pc_fb": false}, {"question": 1, "note": "It might be helpful to talk about the security of funds on your platform. How will token holders receive a share of the transaction fees?", "rating": 5, "c_fb": 1, "no_vca": 7, "reply": "", "pc_fb": false}, {"question": 1, "note": "The overall project idea is definitely in scope of the challenge. However, I'm not sure whether the scope of this proposal is. The only thing I found is \"the money we are requesting will go toward promotion and listing\", which amounts to saying \"Just give us more money\". ", "rating": 2, "c_fb": 1, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 1, "note": "This one of the first dex's to launch on Cardano and the proposal is complete however the timeline to implement is way too far out. Alonzo goes live in 3-4 months and this challenge is for solutions that will go live in the next 6 months.", "rating": 3, "c_fb": 2, "no_vca": 4, "reply": "", "pc_fb": false}, {"question": 1, "note": "This is good idea, but the proposer was not reply some questions from community comment, such as: How will you custody the BTC and ETH that you're wrapping? Where does the 0.25% fee come from? is it based on some network parameters? profit feasibility? How does this compare against existing ethereum DeFi apps and Liqwid? or some thing like that.", "rating": 3, "c_fb": 3, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 1, "note": "This project will bring additional options to expand Defi into the Cardano ecosystem and will be impactful for those looking to leverage Defi options.  Scalability and future plans are questionable since the funding of the project will begin with donations as well as private fundraising outside of Catalyst.  ", "rating": 3, "c_fb": 2, "no_vca": 4, "reply": "", "pc_fb": false}, {"question": 1, "note": "A decentralized exchange to swap Cardano native tokens will improve the circulation and utility of the tokens. There is a strong need to establish Native Token DEX as soon as smart contracts are in place.", "rating": 4, "c_fb": 1, "no_vca": 4, "reply": "", "pc_fb": false}, {"question": 1, "note": "Obviously there is a need to swap the native tokens on cardano. Developing a decentralized exchange on cardano is a fantastic idea. However as this is one of the most known applications for smart contracts there is going to be other proposal DEXes that try to achieve the same.  It is hard to see from this proposal how exactly YaYswap stands out. I think expaining in detail how your edge against competitors will benefit cardano could really help the value proposition!", "rating": 3, "c_fb": 3, "no_vca": 4, "reply": "", "pc_fb": false}, {"question": 1, "note": "While a DEX sure is a useful thing, this proposal is not the most professional of proposals in this category. It mentions a lot of blockchain-y keywords, while a proper explanation about functions and implementation is not provided. Some of the promised functions seem unrealistic.", "rating": 2, "c_fb": 2, "no_vca": 4, "reply": "", "pc_fb": false}, {"question": 1, "note": "While the idea is nice, there are more attractive tools in the works to accomplish similar things. I would see the project in a more positive light if the proposers could better demonstrate their qualifications and a technical roadmap. ", "rating": 1, "c_fb": 1, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 1, "note": "Exchange will be an essential piece in bootstraping the Cardano ecosystem. With the combination of AMM and book order, I believe YaySwap will have a large share of the market, and will solve the important problem of token exchange in Cardano ecosystem.", "rating": 5, "c_fb": 1, "no_vca": 6, "reply": "", "pc_fb": false}, {"question": 1, "note": "The funding requested is not intended to go towards building or integrating a Dapp, but toward promotion. \"the money we are requesting will go toward promotion and listing\"", "rating": 2, "c_fb": 2, "no_vca": 6, "reply": "", "pc_fb": false}, {"question": 1, "note": "The proposer's submission for creating a platform to swap native tokens aligns very well with the challenge - but there is more than just alignment in order for a proposal to be effective (read below). \r\n\r\nYes, the proposed decentralized exchange is a good idea - in line with the spirit of the Cardano ecosystem. The team has stated that it is working toward launching one that would be built using smart contracts. \r\n\r\nHowever that is not all. \r\n\r\nThe F5: DApps & Integrations challenge text states that novel AND viable (!!) applications get built of top of Cardano attracting users. \r\nThe problem that I have with this proposal is whether it is viable? So this is novel, but is it viable?\r\nWill the team manage to attract users to the platform? WIll their efforts result in new, viable applications built on top of Cardano ... if they are unable to overcome legal hurdles? See below.\r\nMembers of the proposing team in their Telegram group (link provided in the proposal (http://t.me/yayswap) have stated that some legal concerns exist (\"Due to legal concerns, the team has chosen to be semi-anonymous at the moment. More info. about the team will be shared with the community once those concerns are resolved. Please be patient.\") and (\"At the moment we are semi anonymous until we have settled everything and have legally the right to operate a DEX\") and ( \"A DEX is not something easy to legally start this is why we are not fully public yet\"). Hence the team members have publicly expressed that they are facing legal issues regarding the possibility of  operating a DEX and that these issues have not been resolved yet. \r\nThe owner of the Telegram group stated: (\"Having & operating a dex has a lot of issues & legal issues which we are not fully prepared for at the moment\"\r\nHence, a key word from the challenge \"VIABLE\" applications - seems to be an issue with this proposal and the owner has confirmed that the proposal is not ready yet at the moment . Maybe it would be best to sort out the legal issues, drop anonimity and resubmit in the next funding challenge, if voters do not approve the proposal in Fund 5. \r\n", "rating": 3, "c_fb": 4, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 1, "note": "The problem statement doesn't indicate a problem but an affirmative statement, I recommend the team to modify this point so that the proposal is clearer in its purpose.\r\n\r\nThe solution described in the proposal is within the scope of the challenge. A decentralized exchange is an extremely useful dapp and one of the most popular today.\r\n\r\nThe goals are within the expected for the challenge, but no metrics or KPIs have been defined, which makes it difficult to assess the impact of DEX.", "rating": 3, "c_fb": 2, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 1, "note": "This proposal addresses the challenge, but is not being open about developments and actively supporting decentralized governance at this stage. Self promoting by offering air drops, alleged early backer token sales, no code available on the github, anonymous and unverifyable skill sets, centralize the power into who ever has the keys to the wallet with the YAY in reserves. this is not decentralized at all.", "rating": 2, "c_fb": 4, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 2, "note": "The chances of the project being successful depend directly on the low transaction costs and times of the Cardano blockchain. The team claims to be made up of students with experience in smartcontract crafting and Haskell development, but they only identify as anonymous crypto-enthusiasts. In addition, the team says it will have to strengthen itself to achieve the goals, which exudes a certain transparency but leaves doubts about the chances of success.", "rating": 3, "c_fb": 3, "no_vca": 6, "reply": "", "pc_fb": false}, {"question": 2, "note": "The proposal asks for $65'000 for \"promotion and listing\" but doesn't mention how the success would be measured. \r\nNo basis to assess the team's qualifications. The team chose to remain anonymous and does not mention any references.\r\nGiven that the overall project is quite ambitious, I have low confidence in their ability to execute.", "rating": 1, "c_fb": 5, "no_vca": 7, "reply": "", "pc_fb": false}, {"question": 2, "note": "The project plan presented is somewhat complete but there is o WP or technical docs describing the protocol.", "rating": 3, "c_fb": 1, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 2, "note": "Hard to asses likelihood of success. It would be great to see some proof of expertise (Who are the proposers, LinkedIn Profiles?). Do they have any financial markets experience?", "rating": 3, "c_fb": 4, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 2, "note": "-There is no any public profiles of Dev team members.\r\n-The Idea submitter has replied in a community comment that he has developed a smartcontract on Ethereum, but there is no way to check it out.", "rating": 1, "c_fb": 2, "no_vca": 7, "reply": "", "pc_fb": false}, {"question": 2, "note": "This proposal has a lot of development and questions related to the team formation, the timeline to build the infrastructure for it, and ultimately supporting the tool beyond the first-year funding is created.  The funds requested may only support one year of operations and currently, this project is relying on private fundraising and donations.  The core team based off statements in the proposal would seem to have the expertise to execute a project but will need to flush out additional developers to complete it.  There still seems to be a lot of unknowns in the project as the team members' identities are still unknown and just a lot of questions to be answered about who and how this will be developed and implemented.", "rating": 1, "c_fb": 4, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 2, "note": "The proposers are operating anonymously and have said that they have to hire people for implementation.  It is not possible to assess the capability in this setting and one can just hope that it may get implemented.", "rating": 1, "c_fb": 3, "no_vca": 6, "reply": "", "pc_fb": false}, {"question": 2, "note": "When I saw this project for the first time I got excited and signed up for the upcoming airdrop. But to be eligible you had to follow this project on reddit or telegram ( a tactic that is being used from a lot of projects that are advertising with airdrops). So the official reddit sub of YaySwap is full with new accounts with almost no karma that write really short comments. I know nobody is able to fully control a subreddit but there is no official information or anything on this sub. \r\n\r\nThen I came here and in the comments it is exactly the same. There are a 100 comments but all of them are really short and don't really provide any content. There are just a few that are asking critical questions but nobody answered them. \r\n\r\nIt would really benefit your proposal if you would expain who these 4 MCGill Alumni are or even better just introduce the whole team. Maybe provide a link to your Linkedin page. It always helps to built trust in a project If you know the people that are behind it. I visited your website to look for further information but I couldn't find anything there regarding your team/company.\r\n\r\nThere is a comment stating: There is no technique documents, there is no any person to develope. But request too much money (1 mill at first time, then 250k, 100k, now 65k). It just focus to attract people to its channels and collects data. - Why did you reduce your budget again and again but after you got feedback from the community there is still no budget in the proposal. It is important for the funder to see where the funds are going and how they are allocated. \r\n\r\nThen a DEX needs a lot of coding. I was looking for your github link in the proposal but I did not find one. A proposal should not only mention on what is going to be done but also on how it is going to be done. If you explain some technical aspects this is going to help to build trust a lot.\r\n\r\n", "rating": 2, "c_fb": 6, "no_vca": 7, "reply": "", "pc_fb": false}, {"question": 2, "note": "There is no credible information about the proposers available. Literally nowhere their names can be found. The whole project related accounts have only been created recently but have loads of traffic with low effort comments. Same with the comments here on catalyst, a lot of them don't have a lot of substance. This really catches the eye, especially considering that the actual proposal text is pretty short and does not give a detailed outline of the project or the plan how it's going to be implemented.", "rating": 2, "c_fb": 6, "no_vca": 6, "reply": "", "pc_fb": false}, {"question": 2, "note": "The team is implementing the first dex on Cardano but the timeline for implementation is too far out to give this 5 stars.", "rating": 4, "c_fb": 1, "no_vca": 6, "reply": "", "pc_fb": false}, {"question": 2, "note": "The proposers do not give convincing qualifications and their proposal does not relay a technical understanding of what is a very ambitious project. They claim to have acquired funding from other sources but want 65k from Catalyst for marketing. If they want funds from Catalyst I suggest they provide a more professional and nuanced roadmap that shows they understand the problem they are trying to solve, before asking for funds to market an incomplete product.", "rating": 1, "c_fb": 5, "no_vca": 7, "reply": "", "pc_fb": false}, {"question": 2, "note": "As noted in the description, the dev and testing are already done. The team also seems strong, and with the extra funding, I believe they will be able to ship the product to the market successfully.", "rating": 5, "c_fb": 0, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 2, "note": "No experience or details are provided. It seems as if the funding will be only utilized to promote the platform, which itself seems suspicious given the large number of bots obviously supporting the project on Ideascale. The whitepaper is quite vague and specifically has a disclaimer attempting to absolve themselves of \"reliance on any information contained in this document\"", "rating": 1, "c_fb": 4, "no_vca": 6, "reply": "", "pc_fb": false}, {"question": 2, "note": "The team does provide a vision of the project's implementation. I will quote here\" YaySwap is more than just a platform to swap assets; here are some fascinating features about our project:\" \r\n\r\nHowever, the features in my view are too general and lack meat on the bones. This is primarily a technical project (DApp) and it should be heavy on technical aspects if it is to compensate for the lack of the documented experience of the team. \r\n As it stands now, it seems like the proposers do have the vision for what could be a solution, but lack a full blown technical and operational plan. \r\n\r\nReceiving and sending crypto requires compliance with some rules and also requires support teams that are available and also could lead to legal exposure if problems are incurred. Some aspects of the proposal gloss over the risks and challenges. \r\n\r\nUnfortunately, for a project of this scope it may seem unsatisfactory that the team is anonymous and that the team apparently needs to outsource all key technical components (\"If you have experience with Plutus, developing smart contracts, react, java, c++, or a good UI/UX designer and like our project, send us your resume \").\r\n\r\nAs regards anonymity, the telegram group of the proposal states that \"Due to legal concerns, the team has chosen to be semi-anonymous at the moment. \" - which indicates a problem of legal nature - which undermines the likelihood of this proposal's successful implementation.\r\n\r\nBefore submitting a proposal for a DEX that will involve other people's assets and funds, I would expect the proposers to resolve any outstanding legal issues that require them to retain anonymity. \r\n\r\nThe risk to the proposers may be grave, serious or minor, but as the proposal stands - the risk of jeopardizing Catalyst treasury funds - is then equally serious. This unresolved legal jeopardy for the proposing team makes it unlikely the proposal will be implemented successfully, as the issues has not been resolved by the time of my assessment.\r\n\r\nFurthermore, this legal issue should have been well presented, detailed and fleshed out in the proposal itself. The fact that it is not addressed well in the proposal itself, is a problem. I had to search through the Telegram group to find these risks and threats to the project. \r\n\r\nAs it stands, the proposers are only hinting to it in general terms in the Telegram chat group (http://t.me/yayswap) - which means that I can only guess about how serious it is. This reduces the likelihood of the proposal's viability to a minimum in my eyes. \r\n\r\n\r\n\r\n", "rating": 2, "c_fb": 5, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 2, "note": "The experience described in the proposal covers the team's qualifications in - Computer science / Software engineering, Full Stack Development, Crypto Experts.\r\n\r\nThere is no information about the team's experience in developing smart contracts, there is no information about the team's experience with Plutus or if they are participating in the Plutus Pioneer Program.\r\n\r\nThe people who will participate in the project have not been described and there is also no reference or link to check the team's qualifications, which makes it difficult to judge the team's viability and aptitude in successfully executing the proposal. I recommend that this is detailed and that it is informed how many people will develop this project and details of these people.\r\n\r\nThe plan describes a clear roadmap with objective goals, but several details need to be clarified:\r\n\r\nWhat is the purpose of launching a token before dapp is released?\r\n\r\nThe plan lacks some information to be viable, such as:\r\n\r\nThere is no definition of an economic model to be implemented at DEX and this is one of the main factors in any DEX.\r\n\r\nThe described wrapped assets model is extremely centralized, which creates dependency on contract administrators. Wrapped tokens are an unresolved problem, at Ethereum there are several BTC tokens, but most involve centralized solutions, where developers have access to the private key of the original BTC and could simply apply an exit scam and take all the money. The point is that wrapped assets do not yet have an ideal model and it is important to make the risks clear, mainly because we are talking about DeFi and the idea is decentralization and not pseudo decentralization.\r\n\r\nSeveral security risks were not considered, such as:\r\n\r\n-Lack of audit on smart contracts.\r\n-Risk of centralization of smart contracts in developers (so far they are anonymous and this is a considerable risk)\r\n-There is no definition of an economic model to be implemented at DEX and this is one of the main factors in any DEX.\r\n\r\nConsidering the fact that the purpose is to be a fully decentralized DEX, there is no mention of creating a governance model. A dapp controlled by the developers is not DeFi, it is true that a project needs centralization in the beginning to be developed, but the absence of a governance distribution plan is a problem that needs to be addressed.\r\n\r\nAn important point to note is that the YAYSWAP team conducted an IDO on the Exmarkets lauchpad (https://exmarkets.com/launchpad/yay-btc) that week and raised $ 600,000 USD. According to the link, 2,040,000 YAY tokens were sold, with a soft cap of $ 60,000 and traded at a price of $ 0.25USD, for a total of 240,000 YAY tokens sold in thatsoft cap amount. The rest of the tokens (1,800,000) were sold for $ 0.30USD. This can be verified in the link above.\r\n\r\nI am not taking into account the fact that the team raised money in an IDO, this aspect does not influence my score. The reason I am including this information in the assessment is for transparency to voters, as the team raised a considerable amount of funds outside of Catalyst and this is not described in the proposal, although the team has published it on Twitter.", "rating": 2, "c_fb": 5, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 2, "note": "Given the plan and experience it is unlikely that the proposal will be successfully implemented. The team behind the project doesn't provide any proof of skill's needed to successfully implement the extensive scope of this project. Wrapped assets are a major feature, Swap contracts are a major feature, and innovation fund is a major feature, etc. and the budget is awfully short for that. The budget isn't detailed out into categories at all, which signals an increased risk of missing the budget. The economics of this project are also not clear, and without having them locked in a multi-signature contract there is high risk of remaining coins to be sold off in an untasteful way.\r\n", "rating": 1, "c_fb": 5, "no_vca": 7, "reply": "", "pc_fb": false}, {"question": 3, "note": "The development stages of the project are well described and will allow the development of the project to be followed. The ambition of the team is to officially launch the decentralized exchange platform within a year, and this requires in the short term to complete the team.", "rating": 4, "c_fb": 0, "no_vca": 4, "reply": "", "pc_fb": false}, {"question": 3, "note": "The proposal does not contain any information about the current status of the project, what was achieved so war and what the requested funds will be used for specifically to further the goals of the project.", "rating": 1, "c_fb": 0, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 3, "note": "The lack of documentation for a complex dapp as well as lengthy timeline need to be better addressed. ", "rating": 3, "c_fb": 1, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 3, "note": "There is not enough information on how the wrapped token are secured. Are the original BTC and ETC held to 100% back the wrapped tokens? Otherwise this risks being a wrapped token printing machine. There is little detail on how and when all the mechanics are being done. A more detailed plan with benchmarks would be useful to allow auditing of progress and thus asses likelihood of success.", "rating": 3, "c_fb": 5, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 3, "note": "Has no any details to explain how to use the budget.", "rating": 1, "c_fb": 1, "no_vca": 8, "reply": "", "pc_fb": false}, {"question": 3, "note": "For the funding requested and the roadmap laid out, there is a plan for how the project will be executed.  More information to help understand project development and a roadmap defined will be important to measure progress.", "rating": 2, "c_fb": 1, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 3, "note": "The proposal has a relatively detailed road map. However, there is a lack of information on the requirement of budget and rationale for a ambitious time plan. The proposal also claims that \"The platform will be deployed once that smart contracts are available on Cardano and we have completed all the development and testing\". The statement that development and testing have been completed is conflicting with the requirement of money and the quantum of fund projected.", "rating": 2, "c_fb": 4, "no_vca": 4, "reply": "", "pc_fb": false}, {"question": 3, "note": "The proposal tries to achieve a lot. It provides a short roadmap which is helps to get an idea on how you plan to do your progress. To really do a good assessment for the voters it would help if you submit a well structured step-by-step plan with clear milestones. Possible challenges are not included in the proposal.  The proposal could overall be a lot more detailed which would help to see in which direction the development is going. ", "rating": 2, "c_fb": 5, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 3, "note": "The timeline consists of items and milestones that are pretty open to definition, which makes it hard to evaluate the progress properly. No rationale for the budget is provided, no details on how the money is used. This makes it difficult to audit the progress of the proposal.", "rating": 2, "c_fb": 4, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 3, "note": "The proposers say \" the money we are requesting will go toward promotion and listing\" but this gives little confidence that the funds will be allocated efficiently. If the project is not executed on a technical level, the Catalyst funds will be wasted. ", "rating": 1, "c_fb": 1, "no_vca": 6, "reply": "", "pc_fb": false}, {"question": 3, "note": "Since the project is blocked by the smart contract launch, the progress will not be fully controlled by the team, so it will not be easy to be able to audit the progress. In the timeline, it was mentioned that the team would do token launch in April 2021, but it appears that they have missed this milestone, as they just finished the public sale and airdrop events. This isn't a major concern, though.", "rating": 4, "c_fb": 1, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 3, "note": "The team's proposal spends a good deal of time outlining the project, then only includes a single sentence at the end stating that the funds are used for promotion of the DEX, not development. No guidelines for success, explanation of why they need $65k for promotion, or checkpointing metrics are provided.", "rating": 1, "c_fb": 4, "no_vca": 7, "reply": "", "pc_fb": false}, {"question": 3, "note": "With the purposeful anonymity of the proposers according to the proposal's Telegram group, (\"At the moment we are semi anonymous until we have settled everything and have legally the right to operate a DEX\") and ( \"A DEX is not something easy to legally start this is why we are not fully public yet\") - it will be difficult to audit the progress and the success of the proposal. \r\n\r\nThe team may be forced to operate from the shadows if the legal situation and status remains unresolved, which will make it very difficult to assess the proposal's progress - if they are afraid of disclosing their identities. \r\n\r\nI have a big issue with the unresolved legal ramifications of running a DEX - receiving other people's money - with the team based in what may seem to be a crypto-unfriendly jurisdiction that requires anonymity for the team. \r\n\r\nWhy is this important for auditability?  \r\n\r\nWell, the criteria requires \"a clear understandable solution that addresses the problem.\" \r\n\r\nA DEX with an anonymous team that faces legal jeopardy is not \"a clear and understandable solution to the problem\", it is a partial solution (the idea may be good, but the proposing team may not be able to deliver) that is bringing along other problems - legal uncertainty as indicated by the proposing team. \r\n\r\nHence, it would probably be best to address all legal concerns first and publish a legal opinion on the proposal's viability and auditability, as legal compliance will now be an important factor for this team and their proposal - as they have raised the issue themselves. \r\n", "rating": 1, "c_fb": 5, "no_vca": 5, "reply": "", "pc_fb": false}, {"question": 3, "note": "The proposal describes roadmap and goals, but there are no metrics in the KPIs and there is no budget breakdown. There is no information about the team members, which is a big problem and completely compromises the audit of the proposal. I recommend that the information described above be included, especially details about who is behind the proposal, as it is an essential point of auditability.", "rating": 1, "c_fb": 7, "no_vca": 7, "reply": "", "pc_fb": false}, {"question": 3, "note": "There team plans on using bug bounties to audit the non-existent code in the github, and not put the project through a security audit which shows that it is it can't be audited. There is no clear budget to judge progress against, and no clear timeline with dates.", "rating": 1, "c_fb": 4, "no_vca": 6, "reply": "", "pc_fb": false}], "solution": "We would like to launch a fully decentralized exchange that would run on the Cardano Blockchain, swap Cardano tokens and reward users.", "experience": "\\- 4 Mcgill alumni  \n\\- Computer science/ Software engineering  \n\\- Full Stack Developers  \n\\- Crypto Experts  \n\\- Team is Recruiting"}