{"id": 381931, "author": "felixweber", "title": "Eastern Town Hall", "url": "https://cardano.ideascale.com/a/dtd/381931-48088", "category": 26234, "amount": 12000, "description": "东半球的Cardano和Catalyst社区需要一个与Project Catalyst取得联系的入口处。", "funded": 2, "upvotes": 66576166, "downvotes": 6958708, "votes_result": 59617458, "votes_cast": 294, "f6_no_assessments": 11, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "this proposal perfectly meets the demands of the challenge. the eastern town hall has already been a powerful force in growing the catalyst and Cardano community in the eastern hemisphere.", "q0r": 5, "q1": "this proposal team has been providing the proposed event now for several months now. there is every reason to expect them to continue to provide excellent and continuing returns on this proposal and the requested funds.", "q1r": 5, "q2": "the ability to audit this proposal is extremely high. like the regular swarm sessions, and the catalyst as a whole the participation in the eastern town hall is easily tracked and continues to grow.", "q2r": 5, "assessor": "z_assessor_218", "no_vca": 23, "ne": 2, "ng": 16, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is aligned with the challenge settings, where they want to onboard and integrate new people into Project Catalyst in their own native languages. It's also an events that help keep the community together and produce ideas & proposal to the Catalyst itself. The proposal clearly articulates how it will add value to the Cardano ecosystem by encouraging and empowering community member in Eastern Hemisphere countries to be active in Cardano governance.", "q0r": 5, "q1": "Budget is outlined clearly and broken down properly. And the sum is still reasonable in my opinion. The team also consists of experienced people in Project Catalyst and has several Cardano Ambassadors (Community Manager). And they already do this Eastern Town Hall meetup for several months. In my opinion, this proposal will be implemented successfully if funded. Moreover, the proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how it will be done.", "q1r": 5, "q2": "Roadmap and milestones for each month are clearly defined in the proposal. In addition, the team describe the KPI and targeted problem clearly. It would be nice if the team could also include the link the Eastern Town Hall GitHub or to their website, so the community could track the project progress and see the past results. The rest, I think it's quite clear & easy to be measured accordingly.", "q2r": 3, "assessor": "z_assessor_282", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely The Cardano & Catalyst Communities in the eastern hemisphere need a entry place to get in touch with Project Catalyst\r\n.\r\n It is clear that this proposal falls within the scope of the challenge brief by organizing a place where local communities can meet and connect\r\n This proposal shows how it adds value to the Cardano system by creating such a place. \r\n   Key metrics  would be  number of participants,  number of breakout rooms, number of participants in each meeting, number of new proposers and voters.\r\n \r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n  \r\nProposal can be scaled up to address future challenges by adding more rooms and events\r\n\r\nThis project will have a positive impact on Cardano system by increasing the collaboration between community members in meetings, breakout rooms, new collaborations, presentations and discussions.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.\r\n \r\n", "q0r": 5, "q1": " \r\n \r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Town Hall and After Town Hall events as well as previous Ideafests. \r\n \r\n The links are sufficient.   \r\nI have visited these links and contacted the relevant people\r\n \r\nThe proposers are well experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is stated.  \r\nThe team structure is listed and experienced.\r\n The budget has  not been given in detail. \r\nThe budget is  reasonable to achieve the set goals. \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\nThere is no plan for additional funding  if objectives are not met. \r\nTheres a realistic timetable  to complete the work\r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n\r\nResources  necessary to implement the proposal are described.   \r\nThe proposal has technical aspects which have been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully  \r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   ", "q1r": 5, "q2": " There is a roadmap with milestones.  \r\n There are  Metrics such of number of participants a and number of presentations and discussion rooms.  \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n The proposer has not identified possible hurdles, challenges and difficulties.\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 17, "ne": 4, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "I'm from Malaysia, and quite new to the cryptoverse, and I was lucky to be part of Catalyst as a CA when an Indonesian friend of mine told me about it. As we all know, cryptocurrency is a vast space that allows great alternatives in finance, gaming, the growth of NFT(s) and even opportunities to actually create self-sustaining jobs for people around the world. I whole heartedly support this funding and suggest to broaden the community by adding Malaysia into the space.", "q0r": 5, "q1": "As stated in the proposal, the proposers need the fund to continue and expand the Eastern Town Hall. The KPI(s) are clearly listed, and I believe this will really add value to new comers into the Cardano ecosystem. The most important factor mainly for me is on the marketing side, as an entrepreneur, how do we reach out to expand the proposal objectives? how can we create an education about real world events and improve quality solutions into the Cardano ecosystem? How do we captivate a mindset for learning as an asset? How do we give ourselves the identity that we are supposed to achieve by  participating into these events? ", "q1r": 4, "q2": "The budget breakdown for a 3-month development appears consistent. The proposal lacks a detailed roadmap and progress metrics that should be offered to enable a monitoring by the community of the progress. I recommend the proposer to consider this question of what metrics and reports should be included in the proposal (even though all activities and operations are recorded, tracked and documented so that new CA(s) can have a glimpse of its auditability.", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 17, "ne": 5, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "I strongly agree the proposal is within the challenge completely because the proposal addresses most of the challenge's Guiding Questions:\r\n            -  The proposal increase meaningful participation in Project Catalyst among all stakeholders\r\n            -  The proposal increases voter-proposer interaction\r\n            -  The proposal onboard and integrate new people into Project Catalyst\r\n            - Active participation in events be increased\r\n            - The number of participants in events be increased\r\n            - The proposal helps keeping the community together.", "q0r": 5, "q1": "The proposal team are Catalyst Community members (fulltime); besides, they have organized the Eastern Town Halls successfully since Fund5. Therefore, feasibility of the proposal should not be a problem. The budget is outlined clearly and broken down into identifiable items and be reasonable to achieve the set goals. I was a newcomer joining an Easten Town Hall then breakout room, and watched Eastern Town Hall Youtube videos since I could not arrange the schedule to join live. So I completely agree the proposal is going to be successfully implemented. \r\nI recommend the proposers should provide links (videos, documents) of hosting breakout rooms and the results (number of participants, number of submitted proposals by Eastern Town HALL participants, number of funded proposals by Eastern Town HALL participants) in each Fund since the first Eastern Town Hall in this proposal.", "q1r": 5, "q2": "I strongly agree the proposal is fully auditable since they provide a transparent and understandable process by publishing documents in Eeastern Town Hall github. Roadmap with milestones and time horizon are provided clearly. The targeted problem and the solution is describe in understandable details.\r\nI recommend the proposal should provide the Github repository link.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "Good proposal here. However, the problem statement should have been given more explanation for a better understanding. However, if the proposal is achieved, it will bring value to Cardano ecosystem.", "q0r": 3, "q1": "The proposer has some level of experience and skills but it's difficult to determine because there are no links, references or attachments to this claim. The budget is well presented. I appreciate the fact that the proposal has a team. The detailed plan of the proposal is comprehensible enough for the implementation. It would be great if the team included the risks/challenges involved in the implementation of the proposal.", "q1r": 3, "q2": "It's very good that the proposal has captured in some necessary additional features. Roadmap and KPIs for the successful implementation of the proposal. However, time horizon for the achievement of the proposal is not clearly stated. My challenge with this proposal is that it has not given an understandable description of the targeted problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This is welcoming to breaking language and cultural barriers as well as contributing to expanding catalysts community through Eastern Town Hall event. This is great.", "q0r": 4, "q1": "The team undoubtedly has the requisite experience for organizing a successful event. The team is sourced from different cultural background which is a positive signe for such a culturally diverse project. Also, hosting a bi-weekly event (whether twice in a week or once every two weeks) is unclear and could be exhausting considering the fact that there will be little time to plan for another. However, since the team has done successful events in the past, I would be rooting for them to make it a success. ", "q1r": 4, "q2": "The project has most of its activities documented and I think it would be easy to track and audit it. Also, the KPIs are measurable, achievable, and impactful. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The knowledge on project catalyst is still growing among the cardano community, therefore the idea to get a space to house community members in Eastern Town Hall for the advancement of the cardano ecosystem is laudable.", "q0r": 4, "q1": "The Eastern town hall team has enormous experience for this project. Also, the team has a clear target to sustain the community meeting as far as possible. Aside that, the project provides a clear work breakdown structure outlined to execute the proposal from the start to the finish. Additionally, the project provides a clear timeline for each event, with a set target for both the short and long term. Finally a detailed breakdown of budgetary allocation is provided for the proposal. I'm clear in my mind that this project will be executed successfully when provided the fund.", "q1r": 5, "q2": "By way of determining the progress and success of the project, the team intends to capture the number of successful held Eastern Town Hall Event, number of Participants, number of Breakout Rooms, number of new integrated communities and the number of submitted proposals by Eastern Town HALL Participants. ", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 19, "ne": 4, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This is a good proposal and is already happening. The proposer tackles the relevant problems of the challenge brief of growing the Cardano community and creating a diversity of community members, and created a space for them to meet and collaborate. ", "q0r": 5, "q1": "The events have been happening, but no links are provided to follow and gain more insight. I believe the plan will implemented successfully, but would have liked to see more links in the proposal itself to provide more insight on the experience and skills of the team as well as the past events. I did some research and found some links, it was quite easy to find. The proposer mentions that they have been hosting successful events and this proves their capacity to execute the proposal.  For new assessors and voters it would be good to provide links as proof.", "q1r": 4, "q2": "A very basic road map and KPI is provided. If there is more information available somewhere around this, again links would have been a good idea. I believe this project to be a good one and that is will continue to grow. I just hope to see more details in the proposal itself for assessors and voters to make a more informed decision. ", "q2r": 3, "assessor": "z_assessor_795", "no_vca": 18, "ne": 1, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "I agree that this proposal addresses this challenge. And this Eastern Town Hall is helping many newcomers get in touch with The Project Catalyst/ Cardano officially and trustfully. According to my knowledge, this team is hosting Town Hall voluntarily, meaning whether this proposal will be funded or not, the team is still doing it. ", "q0r": 4, "q1": "One of the main goal is to expand and focus on the Chinese and Singapore communities, but I can't find any action plan how to reach out to this community. Furthermore, the team remains the same size, meaning they haven't recruit/ invite new member from China and Singapore. Budget is mentioned, but they haven't broken down into detailed and reasoned why they request that much funding. Since the proposal doesn't present its plan very thoroughly, it's hard to be implemented successfully. I advice the team to work more on it.", "q1r": 3, "q2": "Roadmap has not been filled up and there is no milestones as well. Key metrics to success and KPIs is not specific into figures. This proposal needs to be completed more, if the team wants to be voted and funded. ", "q2r": 2, "assessor": "z_assessor_836", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal has a clear defined terms of problems within the campaigns and the solution is requesting funds to follow up on continuing the services and huge benefits from funded past proposal.  ", "q0r": 5, "q1": "The proposal is a follow up funding request of a proposal that have been administered since fund 5. So there is no doubt that the team has requisite experience  and skill to continually deliver this proposal. The detailed plans as it concerns continual iterations and evolution of the town hall event to better cater for its niche community.", "q1r": 5, "q2": "I am convinced that with the metrics provided and the roadmaps outlined in the proposal, its progress and success can be easily monitored.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 24, "ne": 2, "ng": 13, "nfo": 9, "vca_o": 1}], "solution": "东方市政厅为当地社区提供了一个会面和联系的场所，我们为他们提供了一个快速和安全的入职体验。", "experience": "东方市政厅自5号基金以来，为亚洲社区组织和举办了成功的在线活动。我们希望发展和改进我们的形式"}