{"id": 382214, "author": "emeliasarfo2", "title": "Grow Afriteen, grow Cardano ERGhana", "url": "https://cardano.ideascale.com/a/dtd/382214-48088", "category": 26234, "amount": 8000, "description": "特别是在加纳东部地区的年轻人中，Cardano区块链知识几乎可以忽略不计。", "funded": 1, "upvotes": 55511270, "downvotes": 6542741, "votes_result": 48968529, "votes_cast": 310, "f6_no_assessments": 14, "f6_rating": 4.166666666666667, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=1580"], "media": [], "f6_assessments": [{"q0": "我认为提案的作者论证了在加纳开展这样一个项目的必要性，这一点非常积极。对当地发现的问题进行背景介绍总是非常好的，这样来自国外的人就会有更好的理解。在这种情况下，作者说，即使是有正规教育背景的年轻人也面临着找工作的困难，这产生了很大的家庭压力，我相信这部分人是有一些痛苦的。这使得在这个地方对青少年和年轻人进行与Cardano生态系统相关的技术培训变得更加迫切。我相信，对于社会中因缺乏机会而痛苦不堪的一部分人来说，这个项目将是他们用爪子抓住的东西，重视它，因为它将为他们正在寻找的东西（收入来源）铺平道路。因此，这一举措很可能会得到积极的反馈，同时它也将有利于Cardano生态系统本身，因为它将招募新的参与者，这也是挑战的目标之一。这也与之前基金发起的挑战 \"发展非洲，发展卡达诺 \"有关，这进一步增加了项目的价值，因为我相信，尽管这个基金已经成功，社区仍然愿意投资于非洲大陆。我专注于全球其他地区，如拉丁美洲和日本。因此，在我看来，这是一个高影响力的提案。", "q0r": 5, "q1": "建议书的作者清楚地说明了他们打算通过这个项目的发展来实现的目标，这也使我们有可能以一种明确的方式来定义必须完成的阶段。作者还关注到，除了每个月的研讨会数量（2）之外，还定义了每个研讨会所涉及的主题，但这部分关于活动的内容本可以更详细。他们可以让我们知道每个活动在哪个月举行，具体地点在哪里，由谁来主持，估计受众范围等等。可以看出，作者拥有强大的合作伙伴关系，包括世界反兴奋剂机构集团，该集团在催化剂组织中已经因推出对非洲大陆有积极影响的项目而闻名。这样的关系对于确保项目的良好包袱和高质量的支持至关重要，当然，有了这个总体团队，研讨会就会有很高的标准；但是，我希望作者能够告知，正如我上面所说的，谁会来主持研讨会。他们很可能已经有了一份演讲者名单，但了解他们是很重要的，同时也要更好地了解作者本人，埃米莉亚和阿菲亚，他们对自己的身份做了非常简单的描述。我想多了解一下他们以前的工作，他们在世界反兴奋剂机构小组中采取了什么途径（我知道他们是成员），等等。最后，关于财务部门。我发现融资中要求的金额非常合理，而且与项目有充分的理由。作者解释了每一部分资金的用途；我再次强调，需要更多的细节来进一步提高这个提案的价值。当他们谈到1500美元用于租赁、互联网和设备时：租赁会在哪里？那2000美元的后勤费用究竟如何使用？例如，发言人从哪里来，以证明这样的价值？然而，我认为，即使没有深入的细节，我们也有一个非常明确的概念，即这些钱将如何投资。为了达到目的，提案的这个主题被很好地涵盖了，它需要更多的细节，但它是好的。", "q1r": 3, "q2": "根据成功和影响指标等议题中所说的信息，可审计性可以在本提案中明确行使。总的来说，我认为了解项目是否成功的最有机的方式是参与讲习班的青年是否被插入就业市场，或者创办自己的企业，甚至加入现有的公司。我希望对这些人有某种跟踪，也就是说，我们如何能与他们保持联系，以便了解他们在活动后的成就？我们可以考虑建立这一点，突然间，世界反兴奋剂机构本身的一个成员可以负责这一点，并通过参与市政厅等活动，将反馈信息带给社会上的其他人。我们还可以通过监督研讨会本身来行使可审计性。住在加纳的社区成员可以与他们面对面地参与，并编写报告，对活动期间的成功指标是否真正得到满足进行评分。这些都是可以在实践中起到对已经提供的信息进行监测的想法，因此，我认为这个提案在这个议题上是理想的。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal problem statement and solution are aligned with the challenge.\r\nThis proposal also clearly articulates how it will add value to the Cardano ecosystem by educating and spreading awareness on Cardano for students in Ghana. Also, the key metrics and goals of this proposal are aligned with the outlined challenge settings.", "q0r": 5, "q1": "The proposer provided evidence of relevant skills and experience needed to implement the project. The proposer also knows the required manpower and resources to successfully implement the project. The budget presented is outlined clearly and broken down into identifiable terms. Moreover, the budget requested are reasonable to achieve the set goals. Furthermore, this proposal provides a sensible and conductible plan for implementation. ", "q1r": 5, "q2": "This proposal provided a roadmap with milestones and a time horizon for achievement. The proposer also provided key metrics and KPI that define the success of the proposal. Moreover, the proposer provided links to their website and social media for the voters to keep track of their progress. ", "q2r": 5, "assessor": "z_assessor_357", "no_vca": 24, "ne": 1, "ng": 12, "nfo": 11, "vca_o": 1}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely Cardano blockchain knowledge is almost negligible among the youth in the Eastern Region of Ghana \r\n. \r\nIt is clear that this proposal falls within the scope of the challenge brief in being able to educate about 300 youth on Cardano and it's opportunities.\r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nThis proposal shows how it adds value to the Cardano system by being able to educate about 300 youth on Cardano and it's opportunities\r\n \r\n  Key metrics  would be  number of participants,  number of completions of the course, number of participants in each course, number of feedback, number of new proposers and voters.\r\n \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more schools and students\r\n\r\nThis project will have a positive impact on Cardano system by increasing the collaboration between students to form strong networks, they will be equipped with knowledge in block chain which can help them set up their own businesses after school, Spread of Cardano block chain knowledge in the sub region, acceptance of ADA as a medium for exchange, creating a digitized economy for development.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.\r\n ", "q0r": 5, "q1": "The proposers  have provided ample evidence  of themselves with their skills and experience in  running various WADA initiatives.\r\n  \r\n The links are sufficient. \r\n \r\nI have visited these links and contacted the relevant people\r\n  \r\nThe proposers are well experienced and competent to do the event.\r\n\r\n The type and number of team members required to implement the proposal is stated.\r\n \r\n \r\nThe team structure is listed and experienced.\r\n \r\n \r\n The budget has   been given in detail. \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n\r\n \r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\n\r\nResources  necessary to implement the proposal are described.   \r\n  \r\n\r\nThe proposal has technical aspects which have been addressed \r\n\r\n\r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   ", "q1r": 5, "q2": " \r\nThere is a clearly laid out roadmap with milestones  \r\n \r\n\r\n There are  Metrics such of number of students and number of schools, participants in courses, and feedback.\r\n \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties.\r\n \r\n  \r\n \r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 19, "ne": 7, "ng": 5, "nfo": 7, "vca_o": 1}, {"q0": "This proposal is aimed for the future and most rightly so. Disruption in technology is more easily accepted by the younger generations. Add to this the young demographic that makes up Africa, with a median age of 19.7 and one of the highest population growth in the world, educating early-on in this region should be prioritized. Metrics that China have understood earlier than most nations. This proposal also states clearly how they will execute their approach and what will be presented and also to whom. Collaboration with local education entities is a smart move for I reckon it will provide the WADA team further credentials that will make approaching their targeted school and future schools easier. All intended success metrics also fits well within the metrics of this Challenge. If goes as planned this format I reckon can easily be duplicated and implemented to various schools across the region simultaneously. Only critique I have would be the effectiveness, education early-on has it's risk, educating them in a rigid manner I fear would only cause confusion and reluctance to learn more, a current issue of Cardano which is having bite-size and easy-to-learn content. Keeping it fun would perhaps be best, but still there is no guarantee these raw new members will be onboard the Cardano revolution.", "q0r": 4, "q1": "There is an issue with this proposal though, which is the absence of who specifically are the proposers or who will execute this program. It only states WADA the organization. Although they have already built a reputation in the community, knowing at least who is the proposer would be reassuring. WADA as a reputable entity are most likely to deliver on their intended targets but would have loved if they were to go into detail regarding roadmap and budget though. Specifically the education materials that is allocated a budget of $3000. It leaves things in the guesstimate sphere. 'What kind of education material does $3000 translate into?'. The team has also not considered any potential risk and challenge they might face, such as this being an offline event, the threat of Omicron might be a deterrence to accept or limit unknown individuals into a school environment.", "q1r": 3, "q2": "There are general roadmaps and there are also a list of metrics but unfortunately no numerical targets attached. This makes auditing this proposal a challenge. A lot is riding on the reputation that WADA has build but being diligent consistently should also be a standard. Being reputable does not mean it is a given. The problem statement formulated correlates well with the solution given.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 19, "ne": 6, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal concerns the education of youth in Ghana about Cardano. The problem is clearly described and explained in detail.\r\nThe solution is clearly defined, fit the challenge with a clear impact on the ecosystem in short term and long term.\r\nTherefore, I strongly agree that this proposal effectively addresses the challenge. I can rate the impact of this proposal with a score of 5.", "q0r": 5, "q1": "The described proposer's information shows that the author has a long-term attachment to Catalyst, however, there is a lack of external link with sufficient information for verifying the ability of the team. The proposer needs to add verification information to show the feasibility. The budget is provided with a logical structure of items. Risk (and mitigation) is not defined.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility and give this proposal a score of 3", "q1r": 3, "q2": "There is a lack of external links with sufficient information for verifying the ability and experience of the team and partners (National Vocational Technical Institute, Koforidua Secondary Technical Senior High School, WADA Team Specialists). The proposer needs to add verification information to ensure transparency. The budget is provided with the structure of items, without explanation. It is necessary to supplement the basis for the calculation to facilitate the monitoring of the community. Some metrics have remained very abstract (ex: \"Expected impact\",...).\r\nTherefore, based on the given information, I am neutral with this proposal's auditability and give this proposal a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 15, "ne": 3, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This project by WADA seeks to improve employment and economic prospects of young people in the Eastern Region of Ghana through a series of workshops and network building opportunities for up to 300 young people in the region. This initiative would increase the diversity of the Cardano community through directly engaging young people from the Eastern Region of Ghana, which, if successful would provide employment opportunities and economic benefit to the region and add value to the Cardano ecosystem. Locally focussed, this project could act as a pilot that has potential to scale into other emerging economies and tackle youth unemployment in other regions. ", "q0r": 5, "q1": "The WADA team have a strong track record and are highly engaged in the Cardano community, have executed previous projects. The skills on the team align with the needs of the project with a blend of formal educators, entrepreneurs and mentors within the team. The timeframe and budget is outlined in the project, with measurable deliverables including achievable targets of running 2 workshops per month to young people in the region. The budget supports access requirements that would be required including funds for food and transport as well as initial funds to open Yoroi wallets to kick-start the participant's engagement in Cardano.  ", "q1r": 5, "q2": "The project is succinct, measurable and has clear deliverables. There is an evaluation matrix included to measure the overall success of the project, however this does not include specific targets or initial starting points for the community that they will engage. A suggested modification for this evaluation is to include an entry and exit survey for participants so that the knowlege and networks gained can be measured throughout the process.  Dates are not included in the timeframe. ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 16, "ne": 6, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The proposal definitely fit into the challenge because educating the youth to raise Cardano blockchain knowledge would help to widen Catalyst community and may remain sustainable. Besides, that educating also helps to increase human resource potential for Cardano ecosystem in future, it means the proposal will add value to the Cardano system. This point is clearly stated by project's objectives and presentation's topics (centered around Cardano and Catalyst project) as well as clearly articulated in the 'Impact' section of the proposal.", "q0r": 5, "q1": "In my opinion, the proposal is likely to be successfully implemented. Although the type and number of the team is missing and team qualification is decribed short and simple, the proposers provided wada website which included those information and presented the team's experience and relevant skill needed to implement the proposal.\r\nThe budget is clear and broken down into identifiable items. In my opinion, the budget is reasonable to achieve the set goals. Therefore, I rate feasibility with a score of 4.\r\nI would recommend the proposers should consider challenges and risks relevant to the success of the implementation.\r\nI have a question about the last item in the broken down budget: Is making Yoroi wallets for participants free? Why do we need $500 for that?", "q1r": 4, "q2": "I believe the progress and the success of the proposal can be sufficient to audit because the roadmap with milestone and time horizon is provided as well as succcess metrics and clear solution that address the problem.\r\nI recommend the team should provide more detail about how to audit the  success metric 'Broad knowledge in Cardano block chain technology and ecosystem' and the metric 'Expected impact'. Making the metrics more clear to be audited easily will raise the trust of readers in the proposal.", "q2r": 4, "assessor": "z_assessor_714", "no_vca": 12, "ne": 3, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is great. The proposal has identified the problem from the challenge and geared towards its solution. The proposal when implemented would bring value to Cardano community because more people would join the community( territory of Cardano would expand). I can see that the goal of the proposal does not conflict with the challenge settings.", "q0r": 5, "q1": "The proposal has got an identifiable team. The team is made up of skilled and experienced members from WADA. They provided a link to their site as a proof. That's superb. The budget is stated and further broken down into identifiable items, that for me is excellent. I like the fact that the proposal has captured a plan for its implementation. \r\nOne unique feature about this proposal is that it outlined an executive summary for the plan. That's very good.", "q1r": 5, "q2": "The proposal/team have outlined the roadmap, milestones and time horizon for the achievement of the proposal. That's great. The team have also further described the target problem. Metrics/KPIs that define the success of the proposal are outlined.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Graduate unemployment is major canker in Ghana as it has been noted in the proposal, the majority of graduates look up to the government for employment. This has the tendency of making graduate vulnerable to the whim of ruling elites. \r\n\r\nI think that this proposal suitably addresses the problem by educating students to explore the opportunities in Cardano/Catalyst community. This would be a helpful alternative to the status quo. The focus on the Eastern region is laudable as well and I believe this can successfully expand to other regions in Ghana with time. ", "q0r": 5, "q1": "The team has immense experience to ensure the successful implementation of project outcomes. The proposal has well-defined deliverables that are measurable to determine success. I think this event should be given the necessary support by the community as its impact would be meaningful to help transform livelihoods. ", "q1r": 5, "q2": "The team is transparent and open. The proposal has a breakdown of activities that is significant so far as the audit is concerned. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "it is a great idea to educate students on the prospects of Cardano and will help win more into the community. you have a good plan but a sample of the educational material would be made a good impact on the proposal.   Your plan to engage those who show interest through workshops is fantastic. Evidence of a previous work you have been part of would help a lot.", "q0r": 4, "q1": "With the support of WADA the team will well but the plan is not clear. Mentioning number of workshops in phases will not be enough. the details of which institution, as to whether permission are given or will be given, we are not sure about that.", "q1r": 3, "q2": "your objective is to educate 300 students which is great. I expected to see this number broken down in the various phases. Also, no mention is made of the particular institutions this project seeks to educate.", "q2r": 3, "assessor": "z_assessor_728", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "Providing education to students about cardano and its benefits is an excellent idea. This will be helpful in enlightening the students and also increase the cardano community in Ghana. Therefore, as far as this proposal seeks to expand the cardano user base, I agree that the project will address the challenge. ", "q0r": 5, "q1": "\r\nThe experience of the WADA in the Cardano community cannot be overestimated hence their track record makes them the ideal team for this project. More importantly, the target audience is well captured and there is a well-developed timeline for the proposal. Also, there are well outlined events scheduled within specific timeline for the project and a work breakdown structure is also incorporated within the proposal. The events scheduled for the proposal will definitely increase the cardano presence in the eastern region of Ghana and also increase the number of ADA holders. Additional, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Therefore, with the inclusion of a well-developed timelines for each event and a proper budgetary allocation, it will be very easy implementing the project successfully", "q1r": 5, "q2": "\r\nThe project provides a metric to monitor and track the progress and success of the project. For instance, the project intends to develop a database to capture the details of students who attend conferences, capture those who will remain active proposers and those who will successful create a cardano native wallet. \r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 19, "ne": 4, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Great idea to educate college and University Students. the metrics of success are not specific: how many do you intend to reach out to and how many do you envision to join the community.", "q0r": 3, "q1": "the proposer did not put any evidence of previous work done under WADA. the proposal mentions only the number of conferences per phase but other details are left out. A timetable capturing  the institution you wish to visit the numbers you anticipate and the budget that is associated with will be very handy.", "q1r": 2, "q2": "the activity is set to happen in phases but the budget is bulked. Also some element of the budget needed to be explained to help in the auditing process", "q2r": 2, "assessor": "z_assessor_733", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Introducing students to Cardano through educational initiatives absolutely fits into community events and is an established and effective way to leave an impression among a curious and ambitious population of young people. Affordable and effective means such as this, especially in regions of the world underserved by centralized financial institutions, represent an example of what should be encouraged in this sort of challenge. I see many reasons to be confident in this proposal, with more details below.", "q0r": 5, "q1": "Proposer is very active in Catalyst with a deep, thorough and effective history. The sum requested is both reasonable and allocated responsibly. There is no reason to believe, given the request, that the two-workshop-per-month roadmap is feasible, as every conceivable provision appears planned for. If I had a quibble: An example of a more detailed lesson plan or powerpoint from such a the workshops might have made a valuable contribution, but given how well laid-out this proposal is as it stands I don't think it was absolutely essential. Still, as someone with some pedagogical experience it always helps to see illustrative direct examples of the kind of work proposers do.", "q1r": 5, "q2": "That partners with educational institutions are listed speaks very well for this proposal, and demonstrates a proactive approach to engaging communities and building relationships in Ghana. That success metrics are listed for evaluation also reflects well upon it, including a feedback mechanism for participation and a pledge to provide a counting of attendees to the Cardano community. These are in fact the kinds of commitments to deliverable results I wish I saw more often in proposals.  ", "q2r": 5, "assessor": "z_assessor_853", "no_vca": 17, "ne": 4, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Good idea , but does not indicate how communication between these new participants would be kept after community event to maintain interest of new participants. This proposal looks to benefit from how much teenagers use social media but does not indicate how social metrics would be quantified. Hype beign one of the main growth factors of adpotion no indication of how proposer will market community events in the region.No mention of mentoring these new participants.", "q0r": 2, "q1": "Given the vague description of the team and its qualifications, no evidence of name, relevant skills, and qualifications of team members was provided. In the outline of the budget, no mention of social media & marketing making this seem impossible for a buzz to be created for Cardano. No detail of how interested proposers, CA, and voters would be drafted and kept track of, which is very important in keeping track.", "q1r": 2, "q2": "The key performance indicators (KPIs)  included but vaguely specify how social metrics will be monitored. The ability to audit this proposal needs clearer metrics that can be easily viewed to determine if the proposal is successful. ", "q2r": 3, "assessor": "z_assessor_891", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "教育大约300名青年（包括加纳东部地区的高中和大学）了解Cardano和它的机会。", "experience": "世界反兴奋剂机构的社区顾问、指导员和教育家、营销人员、企业家、教师团队"}