{"id": 382615, "author": "tienna", "title": "Catalyst Events 4 Vietnam Students", "url": "https://cardano.ideascale.com/a/dtd/382615-48088", "category": 26234, "amount": 18000, "description": "许多越南大学的学生都不知道Project Catalyst的资助活动和存在的机会。", "funded": 2, "upvotes": 72206787, "downvotes": 6909856, "votes_result": 65296931, "votes_cast": 460, "f6_no_assessments": 12, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "这个想法非常好，与挑战赛的目标直接对话，因为它试图在越南创造关于区块链和Cardano的活动。作者认为，越南是一个具有战略意义的投资地，因为它每年有大量的技术学生毕业，它也是最接受和使用加密货币的国家之一，我知道这一点，因为这是我评估的另一个提案中显示的事实。我发现作者以一种循环的方式思考这个项目很有意思，也就是说，他们不只是打算和这些学生一起介绍和开发内容，而是在创建和提交提案的过程中陪伴和指导他们。通过这种方式，将与年轻人有一个更完整的后续行动，因为他们不仅会被教导什么是Cardano，而且会被教导如何通过催化剂的资助，在区块链上启动和执行项目。这是我对该提案的总体理解，我认为它超越了这一相同挑战的其他几个提案，不限于暴露信息。在我看来，可以改进的是对会议本身的理解。我希望看到更详细的规划，也就是说，每次会议涉及的主题是什么，会有多少次，每次会议计划有多少学生，从多少次会议开始实践（提案的启动），谁来介绍每次会议......细节。但总的来说，该提案的影响很高，与这里的要求非常吻合。", "q0r": 4, "q1": "作者对自己做了一个非常不同的介绍：他们不仅定义了他们是谁，他们各自做什么，他们的培训领域是什么，而且还包括他们社交网络的几个链接，如linkedin，在那里我们可以更亲密地了解他们，还有几个直接沟通渠道，可以与每个人建立个人联系。关于这部分，它是非常好的。对作者成功执行项目的能力传达了很大的信心，主要是因为他们都是来自技术领域。我只想建议你从市场和设计领域聘请一个人，以促进适当的推广和设计会议的图形材料，这些部分也是非常重要的。这里有一个非常详细的脚本，在这个脚本中，我们知道会分阶段发生什么，分为几个月。我所建议的是建立一个时间表，以便以一种更综合和视觉上更简单的方式来组织信息，关于会议本身。关于提交提案的定向部分是一个更加定性和个性化的过程，在我看来，这并不适合在一个表格中这么多。但是，是的，其详细程度是相当令人满意的。关于资金拆分，我认为这个提案理想地解释了资金的用途，因为他们不只是拆分总金额，而是具体说明每一部分的更多细节。这样一来，我们就能准确地了解这笔钱的用途。那么我在这里建议的只是一个更直接的关于剧本的组织与会议本身的关系，否则就可以了。", "q1r": 4, "q2": "我们有很多关于可审计性的信息，这样就可以安全、准确地进行审计。作者解释了每个单独阶段的预期结果，提供了一些细节，使我们能够密切监督各方。如果我们要组建一个团队来跟踪项目的进展，他们会清楚地知道要评估什么，以确定项目是否按承诺完成，并可以把这些反馈带给社区的其他成员。作者还为我们提供了关键绩效指标，通过这些指标，我们有了更多的量化信息，这些数据直接指向了是否取得了成功。作为一个更客观的部分，我相信这些信息可以包括在报告中，并直接暴露给社区，例如通过在市政厅的演讲。最后，我建议给这种可审计性以更大的力量，那就是对参与项目的学生进行个别监督，以了解其结果。团队建议指导他们提交项目，但也希望他们把他们是否得到了资金，Cardano对他们的生活产生了什么影响，他们是否打算与社区保持联系并长期合作等等。但这将是一个奖励，因为团队已经为我们提供了足够的信息来做伟大的审计性。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 14, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "提案人对这项提案进行了大量的思考。他们在 \"催化剂项目 \"中的经验清楚地表明，可以看出他们是如何确定当地问题并将其与挑战赛环境联系起来的。他们清楚地阐述了接近大学是如何将正确的人群纳入催化剂和Cardano的方式。虽然没有明确指出将以哪所大学为目标，如何进行，以及如何保证所选大学100%接受这一活动。正确的人群在这里指的是个人理解和实施Cardano所需的最低步骤，这是一个短期目标。他们还解决了长期目标，指出这个建议是一个持续的过程，时间跨度为2年，这也解决了连续性的问题，因为有一次性的活动并不等于对Cardano的持续兴趣。这项建议涵盖了挑战赛的大部分内容，如果记录正确，这项活动可以在整个越南进行推广和复制。这确实是一个非常有效的建议。", "q0r": 4, "q1": "提案人的经验是毋庸置疑的，他们都是有成就的人，我们可以通过他们的LinkedIn链接来追踪。很明显，这群人一起集思广益，因为几乎所有的提议者和共同提议者都有教学背景。但与此同时，这也提出了一个问题，即作为一个受过大量教育的人，他们在向大学生介绍 \"催化剂计划 \"时并没有明确的教学大纲。最初的重点是举办这个活动本身。在所有的提议者和共同提议者中，唯一一个有催化剂背景的人，也是唯一一个没有教学背景的人，可能会对催化剂进行教育。人们认为，首先要用越南语准备材料，这是第一步。尽管如此，通过与催化剂学校的合作，这一点可能会得到缓解。从预算上看，这个建议相当详细，虽然提到的数字对这个地区来说相当高。从指导提案人到进行调查，每小时60美元的费用可能更适合用于开发本地教材。虽然提到了风险，但实际上这更像是一个机会。", "q1r": 3, "q2": "他们对活动的准备是毫无疑问的。它有一个清晰的路线图，一直到第五个月，还有一个可实现的关键绩效指标。有了以上所有的数据，可以负责任地进行审计。不过，在开展一系列活动之前，应该先把重点放在越南语的项目催化剂教育材料上。同样，这可以通过与催化剂学校的合作来解决，如果做到了，这个建议将是成功的，因为问题陈述和解决方案之间有很强的关联性。", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": " \r\n\r\nThe problem needing to be solved has been identified and articulated namely many Vietnam Uni students are unaware of Project Catalyst's funding campaigns and the opportunities\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief by Organizing virtual or onsite sharing events about Catalyst for students\r\n \r\nThis proposal shows how it adds value to the Cardano system by organizing virtual or onsite sharing events about Catalyst for students\r\n  \r\n  Key metrics  would be  number of events, number of participants, number of new proposers  , number of lecturers, no of students. \r\n \r\nThe key metrics and goals of the proposal fall within the scope of the challenge \r\nProposal can be scaled up to address future challenges by adding more content to the courses and bringing more schools and universities and IT institutes. \r\n\r\n \r\nThis project will have a positive impact on Cardano system by increasing the collaboration between community members schools, and universities.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.", "q0r": 5, "q1": "The proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Eastern Town Hall  events as well as managing the documentation process for these events.\r\n \r\n \r\n The links are sufficient. \r\nI have visited these links and contacted the relevant people\r\n\r\nThe proposers are well experienced and competent to do the event.\r\n\r\n The type and number of team members required to implement the proposal is stated.\r\nThe team structure is listed and experienced. \r\n The budget has   been given in detail.  \r\nThe budget is  reasonable to achieve the set goals. \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres a realistic timetable  to complete the work\r\n\r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are described.    \r\nThe proposal has technical aspects which have been addressed \r\n\r\n \r\nThe proposer has  identified risks in this  proposal\r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   \r\n", "q1r": 5, "q2": " \r\nThere is a clearly laid out roadmap with milestones  \r\n \r\n There are  Metrics such of number of participants a and number of presentations and discussion rooms, number of courses, no of schools, no of universities, no of graduates, no of proposals. \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties  \r\nAre there contingency plans in place for various outcomes?\r\n \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 17, "ne": 5, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "The idea in its scope is good and well presented. The proposal wants to create a knowledge-sharing event about Catalyst for university students in Vietnam. The problem is identified and the solution is clearly stated, meeting the objective of the challenge", "q0r": 4, "q1": "The proponent has the necessary knowledge and commitment to carry out the project. The proposed group of 5 members is described in detail and in detail. Each member's information can be easily checked against the individual links they provide.\r\nThe proposal was carefully thought through, given concrete options, and gradually was implemented with great certainty. The proposed team was funded by Fund 6 to build a website about Cardano (Cardano2.vn), which is also a stepping stone for the team to successfully implement this proposal.\r\nIt's great because some of the potential challenges and risks have been presented by the proponent and the proponent has solutions for all of them.\r\nWith the above reasons, I fully believe in the feasibility of the proposal", "q1r": 5, "q2": "A clear roadmap has been given in the proposal and it is conceivable that the solution in this proposal solves the problem at hand.\r\nThe stated budget is reasonable, the budget statement is transparent. KPIs make it easy to measure and track your proposal's progress", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "I strongly agree the proposal is within the challenge completely because the proposal addresses most of the challenge's Guiding Questions:\r\n            -  The proposal increase meaningful participation in Project Catalyst among all stakeholders\r\n            - The proposal onboard and integrate new people into Project Catalyst\r\n            - The proposal use events to build new teams\r\n            - Active participation in events be increased\r\n            - The number of participants in events be increased\r\n            - The proposal helps keeping the community together", "q0r": 5, "q1": "I strongly agree that the proposal is likely to be successfully implemented because of following points:\r\n- The proposal provide a website with title 'Bring Cardano to Vietnam' (the winning project in Fund6). That is not only the foundation for the first step of this proposal but also the statement of the team's experience and relevant skills fulfilling for the successful implementation. Type and number of team members and roles are also provided in details in the proposal. \r\n- The budget is clear and broken down into identifiable items and reasonable to achieve the set goals.\r\n- The plan of the proposal (Phase 1) is clear understandable, sensible and conductible. (clear articulating what is being done in phase 1 of roadmap and clear solution how to make it done in Phase 1- deliverables)\r\n- The proposers have considered risks in the project. I would like to know about the solution of the team in that case.", "q1r": 5, "q2": "The proposal has roadmap and clear understandable description of the targeted problem as well as the solution that addresses the problem. Metrics are also clear and easy to audit. Additionally, the proposers commit to transparency process with the community by tracking of all project activities and expensing in the githup. Therefore I rate auditability with a score of 5.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is a brilliant idea. The goal of this proposal/challenge fits into the challenge settings. The statement of what problem is to be solved is stated clearly. I like the fact that there is a further explanation of the problem statement and solution to the problem.", "q0r": 5, "q1": "The proposal has got an identifiable team and that for me is good. The team per their qualifications possess skills and experience needed to implement the proposal. They have also attached relevant links as evidence to their claim. The proposal has got a budget which has been further broken down into identifiable items. The proposal has also provided a time frame and plan for implementation.", "q1r": 5, "q2": "Roadmap and time horizon for the achievement of the proposal are clearly outlined. It's good that the proposal has included the KPIs/metrics that define the success of the proposal.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Excellent proposal with an awesome idea. The proposal really tackles the problem and has got educators involved for easy adoption and participation. The targetted group are students and this would help the position of Catalyst in the future.", "q0r": 5, "q1": "Great to see the dean of Information Technology onboard. Overall, the team is great. Collaboration with other universities is best achieved if colleagues lecturers are spearheading it. This would help adoption and increase participation from the students populace easily and I am enthusiastic about the fact the \r\nnumbers of student participants may increase so the team should be prepared to manage the excess numbers during events.\r\n\r\nPhase one of the proposal is achievable and has a specific metric that would be easy to define success. I would be to the progress of the project as a whole and integrating blockchain in university academic curriculum is very welcoming. ", "q1r": 5, "q2": "The team is transparent and the proposal has outlined how it can be audited by the community. Great breakdown of activities and documentation involved to help tracking and openness. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The idea of providing education on project catalyst to the community in Vietnam is an excellent idea. This will be helpful in creating awareness and also increase the cardano community in Vietnam. Therefore, as far as this proposal seeks to expand the cardano user base, I agree that the project will address the challenge. \r\n\r\n", "q0r": 5, "q1": "The team behind this project are individuals with experience in previous fund. More importantly, the proposal has a well captured target audience and there is a well-developed timeline for the proposal. Also, there are well outlined events scheduled within specific timeline for the project and a work breakdown structure is also incorporated within the proposal. The events scheduled for the proposal will definitely increase the cardano presence in Vietnam. Additionally, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Therefore, with the inclusion of a well-developed timelines for each event and a proper budgetary allocation, it will be very easy implementing the project successfully\r\n\r\n", "q1r": 5, "q2": "\r\nThe project provides a metric to monitor and track the progress and success of the project. For instance, the project has an outlined number of people it expects to participate in community organized events and a targeted number of events it seeks to undertake. However, the metric could be improved by developing a database to capture active participants.\r\n", "q2r": 4, "assessor": "z_assessor_732", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "By organizing events, giving presentations at several universities will help students know and understand Catalyst. However, which 2 universities will you conduct the project? There are many different types of universities in Vietnam and not all students will be interested in such projects. The above project did not specify selection criteria or a specific school. Moreover, there are also many projects that will also be more competitive, like \"Incubators\" for example, they have a good reputation in the past", "q0r": 4, "q1": "The plan is clear, detailed, with a full list of costs. However, there are many unnecessary expenses and many unreasonable points. For example, item (1) usually events at university will not need to rent a room, projector, equipment is enough; (2) why is it calculated by the hour and not by the number of people?; (3) should be charged per project rather than hourly, about $60 x12= $720; (4) I think it's not needed or about $20-$30 only. The project has to adjust the cost. ", "q1r": 2, "q2": "There are a lot of personal information to prove the authenticity of the project. The people who carry out the project are experienced, well qualified. I am also a student of Vietnam National University, Ho Chi Minh, although not in the same city, but in the same training place. I know better than anyone else to be a lecturer in this environment is very difficult, must be really good. So I have faith, this project is not to cheat investment money. However, to be honest, this project is risky, highly competitive, there are many projects similar to the \"Vuon Uom\",...", "q2r": 3, "assessor": "z_assessor_756", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal successfully addresses several of the objectives of the challenge  eg. integrating new people to the Project Catalyst and increasing active participation in the events.  The proposers plan is to educate IT students in Vietnam on opportunities on becoming a proposer, referrer, or voter.  The proposal is well written and easy to understand.  The funding request of $18K is justified, as the proposer is building on their past successful proposal where the team were funded to build a website for students. (the website is up and running)   ", "q0r": 5, "q1": "The team is highly skilled and experienced and most likely to succeed in implementing this proposal.  Not only have they shown the capability to deliver from fund 6, they have the right mix of skills as evidenced from their LinkedIn profiles.  The timeline and deliverables are simple to understand and look achievable.  As mentioned above it is good value for money because it is spread over multiple events as oppose to other proposals in this challenge where the funds requested is for a single event. ", "q1r": 5, "q2": "The metrics are clear and measurable, they also look achievable and as the activities are spread over 12 events and multiple months the team will have opportunity to learn and iterate.  The team have created a simple tool to track all project activity and costs therefore providing full transparency. ", "q2r": 5, "assessor": "z_assessor_774", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is totally matches the challenge requirements, and it looks like this project could be huge win for the students who can gain more knowledge and earn income by working in blockchain space. It also increase the huge number of proposals for Catalyst. ", "q0r": 5, "q1": "This proposal is very likely to be successful based on the definition of success set out in the plan. \r\n\r\nThe team is experienced in running Townhall to support Catalyst as well as the experience of a CA as well as have the funded proposals on fund 6. Team also include two lectures from university who will help a lot on the communication with University's management as well as the students.\r\n\r\nThe budget not only is broken down into very clear items but also has a reasonable estimation for each one of them. \r\n\r\nThe milestones are very realistic and feasible. \r\n\r\nThe only point I would add is that the proposers may consider to divide their target into two phases: 1) have pioneer students to become community advisors (which can be within 2 to 3 months) then (2) have pioneer students to do the catalyst proposal itself (5 months milestone). From my experiences, most of CA will become Catalyst proposer later on and the success rate of their proposal to be funded will be higher because the student already have the view of a CA when evaluate a proposal.", "q1r": 5, "q2": "The team has presented a detailed roadmap with a clear time line. KPIs were present clearly, quantifiable and easy to tracking and reporting. \r\n\r\nTo better define the success of this proposal the team consider to add KPI about the successful rate of proposal (ie: among 12 proposals summited, how many proposals are funded by Catalyst).", "q2r": 5, "assessor": "z_assessor_819", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "The proposal aims to engage and onboard university students through  events to engage, educate and collaborate with students and the participating universities to create awareness about opportunities apparent in project catalyst and also to provide support. The benefits of this proposal is immense and definitely helps to engage active participation and interest in project catalyst.", "q0r": 5, "q1": "The proposal has a team with requisite knowledge and experience to delivered this proposal successfully. In addition, The proposal has also provided a detailed roadmaps to be achieved and the budget breakdown is very clear to justify the funds requested.", "q1r": 5, "q2": "The Success metric as provided, is more than enough to assess the proposal's progress and developments.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 19, "ne": 2, "ng": 8, "nfo": 9, "vca_o": 1}], "solution": "为学生组织关于 \"催化剂 \"的虚拟或现场分享活动。联系、激励和支持学生参与 \"催化剂 \"活动。", "experience": "我们是SPO、区块链技术专家、东方小镇主持人/共同主持人，以及受资助项目的所有者"}