{"id": 384031, "author": "felixweber", "title": "NFT Guild", "url": "https://cardano.ideascale.com/a/dtd/384031-48088", "category": 26234, "amount": 10000, "description": "CNFT空间与项目催化剂存在摩擦。缺乏沟通和合作迫使我们建立孤岛。", "funded": 2, "upvotes": 58951882, "downvotes": 9227148, "votes_result": 49724734, "votes_cast": 332, "f6_no_assessments": 7, "f6_rating": 4.285714285714286, "videos": [], "media": [], "f6_assessments": [{"q0": "这项建议将对催化剂产生影响，因为它为主要是 \"Wen moon？\"的人群提供了资金来源。  它可以在整个Cardano生态系统中大放异彩的地方是鼓励与大量参与的NFT项目交换想法，让我们从 \"Wen moon？\"到 \"我不知道你可以用NFT做这个！  催化剂有可能成为推动NFT对创造者和市场参与者的创新达到新水平的力量。  关于具体的NFT项目的想法，无论他们是已经原生到Cardano还是希望从其他平台转移过来，他们的需求和对现有工具的挫折，将是一个有用的指标，以评估这个建议对所述问题的相关性。  但仅仅作为一个对话的桥梁，它是一个伟大的开始。", "q0r": 5, "q1": "该提案小组是一个众所周知的大使、建设者和催化剂社区的贡献者的团体。  他们经常通过 \"催化剂 \"获得资助，并且每一次都表现出社区的最佳品质和利益。  他们组织的 \"创意节 \"在吸收提案人方面取得了巨大的成功，这有力地说明了他们有能力成功地从NFT社区引入新的想法，特别是重新利用和扩展现有的格式和工具。  该提案没有指出他们是否对Cardano的NFT潜力的优势和独特性有特别的了解，然而，这不应该需要成功地组织那些有这种了解的人和那些对CNFT潜力感到好奇的人之间的会议，以及催化剂让想法分类和落地的能力。  考虑到他们已经有了工具、团队和格式，这个时间表是紧迫而不仓促的，而且所提出的预算与这个团队以前资助的提案是一致的。  这里有很高的成功预测性。", "q1r": 5, "q2": "这是一个简单的审计提案，因为其产品将是一个持续的公开内容流，几乎在2月份就开始提供。  第一次活动前的预定更新没有列出，但这个团体在催化剂媒体中保持着持续的存在，他们让我们了解到他们迄今为止所有其他项目的最新情况，并随时愿意回答关于他们项目和进展的问题。", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This idea is necessary for inspiring the development of NFT Creators community, which also boosts the development of NFT project in the Cardano ecosystem. In the proposal, the team also mentions the tied relationship between NFT ecosystem and project Catalyst, and that info proves that this event will improve the collaboration between them. Therefore, it strongly impacts on Cardano ecosystem. \r\nThis project also has KPIs & OKRs that will make a big impact on the ecosystem, and of course, align with the challenge givens ", "q0r": 5, "q1": "The leader of this project is well-known in the Catalyst community, he has well connected to CNFT community, and has experience in organizing events with Calalyst team. Moreover, the implementation plan in the proposal is clear for what the team wants to do, going with the clear roadmap for months. Therefore, this proposal absolutely gets high feasibility. \r\nThe budget is used for covering the whole roadmap and detailed in each activity category, all are reasonable. ", "q1r": 5, "q2": "The KPIs and roadmap are clear and detailed enough for auditing. The team also has a good acknowledgment about the current situation of the problem through their explanation. And they make a plan to solve it that is very close and lean. All of these info easy to understand for assessing their step to do and goal to get. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 1, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "The idea is really fascinating which it adds value to NFT creators, collaborators and business through communication. It also improves the evolution of NFT(s) being only an asset of flippening or creating a mindset of \"get rich quick\". NFT(s) are more than just being that, and we have seen it grow into a more functional asset! This also includes that the community can innovate together to implement and venture extraordinary insights and experience between each other, which in turn not just adopting new users to the Cardano ecosystem but to plant an innovative signature as a routine in the NFT side of the ecosystem.", "q0r": 5, "q1": "The team members are not classified though the idea of the proposal resonated where it said \"Regarding the NFT Ecosystem, we see a lot of competition and run for the fast Money\". The evolution of NFT(s) is slowly starting to be a more functional and utilitarian asset, and this proposal would be a great way to improve the quality of creators, marketplaces and businesses. Besides NFT Guild YouTube channel, zoom calls and discord, will there be other online platform to increase awareness of the proposing subject? A more detailed metrics to what extent of number of participants can be achieved, potential collaborators and types of held events will be helpful to foresee the success of this proposal.", "q1r": 3, "q2": "Though I believe its the funding required is reasonable, and milestones given are achievable, it would be helpful if there are few important key points that could be listed. Firstly, how does the budget will be allocated for each biweekly events. Secondly, essential key points on how to have great outreach and marketing campaign with the budget given. Lastly, a list of potential of well established and experienced projects from the Catalyst ecosystem (to back the point of the proposal feasibility).", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 14, "ne": 4, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal is clear and the objectives of the proposal are clear in terms of how the NFT Guild would assist in building a stronger line of comunication between CNFT Space and Project Catalyst. However there is some key information missing such as the team behind this. The proposal could be strengthened through the inclusion of some suggested topics for discussion to open communication lines between the disparate groups even if it was done as an example for how the two ecosystems of CNFT and Catalyst could begin to open that conversation. ", "q0r": 4, "q1": "The proposer has indicated connection to however no specific commitment has come from established groups within the Cardano community such as Catalyst Swarm, Eastern Town Hall, Catalyst School, Ambassadors Guild and the Bridge Builders Guild. It's therefore unclear if this project seeks to leverage these already established initiatives to bring greater awarness about Cardano to the CNFT space - or indeed if it is about creating additional work that would lead to a greater understanding. The reporting mechanism within the monthly Catalyst Town Halls would likely mitigate or steer any project creep away from the intended mission. \r\n\r\n\r\nThere is a clear budget and timeline inlcuded in the proposal with a proposed amount of 500USD per event over a three month period. Given the scope of this project is lacking specificity it is hard to determine if this is an appropriate amount for the work and/or if this is split across the many initiatives that would contribute to the development?\r\n\r\n\r\n", "q1r": 4, "q2": "There are clear KPI's included in the project scope and community can audit the project through the monthly reporting feature as previously mentioned. Again - no specificity around the size of the market, the number of events that the project is seeking to hold and therefor what success looks like in terms of people engaged and number of events delivered, quality assessment of the discussions and potential onboarding of projects to the next Catalyst fund. ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The goal of the proposal is within the challenge settings. However, I recommend goals and key metrics to have their own separate section in the proposal for easy identification. The proposal would promote Cardano when implemented since it seeks to remove the conflict between the CNFT space and Project Catalyst.", "q0r": 4, "q1": "I believe the team possess the skills and experience to execute the proposal considering the fact that they partook in earlier Project Catalyst and others. The budget is well presented. The plan of the proposal is detailed and reasonable enough to achieve the goal.\r\nHowever, possible risks/challenges involved in the implementation of the proposal are not outlined.", "q1r": 4, "q2": "The proposer has provided a plan, timeline and milestones for the achievement of the proposal. It is good that KPIs that define success the success of the proposal are outlined.\r\nFrom the problem statement section, the targeted problem is clearly described.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "Great idea. The project seeks to build collaboration with others within the catalyst ecosystem. It would be great to establish at least one partnership with any collaborator, say Catalyst School, since it is stated within the proposal that, they would take the educating aspect.", "q0r": 3, "q1": "I think this is achievable however, other detail in the proposal is dependent on stakeholders with whom you have no established partnership. ", "q1r": 3, "q2": "The proposal involves documentation and recording that I believe is transparent and easily trackable. ", "q2r": 4, "assessor": "z_assessor_727", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal has a clear definition of its problem statement and it tends to proffer the solutions. The idea to foster a platform event to collaborate issues of concern as it relates to NFT community and Project Catalyst with aim to providing solutions to challenges and creating a common front and standards or values in the NFT community in Cardano Ecosystem. The proposal provides a collaborative process that is really in the NFT community.", "q0r": 5, "q1": "The proposal did not provide any information on the main team but its well detailed collaborative efforts  with other experienced, active and committed community members and events, it is very likely that that the proposal poised to be a success. Given the detailed budget and its deployments coupled with its comprehensive roadmaps, it is my opinion that the project is in the right hands.", "q1r": 4, "q2": "The proposal has provided enough metrics to assess the performance of the project in addition to the detailed roadmaps and plans to ensure their activities will be made easily accessible to the community to judge its progress.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}], "solution": "提供社区活动，关注NFT创造者和Markeplaces，在那里，各种想法可以找到一个共同的地方，以满足并与催化剂联系。", "experience": "NFT创造者和工具制造者，SPO，关系良好的CNFT社区成员，受资助的提议者和社区顾问，Cardano大使"}