{"id": 384780, "author": "heartbeat.team", "title": "Project Catalyst HeartBeat", "url": "https://cardano.ideascale.com/a/dtd/384780-48088", "category": 26234, "amount": 16000, "description": "长形式的内容需要更多的时间和精力来调查和消化，而不是 \"催化剂计划 \"的许多成员能够定期承诺的。", "funded": 1, "upvotes": 34536805, "downvotes": 11419700, "votes_result": 23117105, "votes_cast": 263, "f6_no_assessments": 12, "f6_rating": 4.027777777777778, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=10670"], "media": [], "f6_assessments": [{"q0": "这个建议的目的是创建一个催化剂社区的每周在线活动。心跳 \"播客的结构由3个回合组成：成员进行项目更新，对社区选择的主题进行快速辩论，然后进行投票，为社区工作承诺时间。\r\n提议者清楚地说明了这样一个问题：在催化剂合作研讨会上保持合作需要时间和精力，而有些成员的时间和精力是有限的。\r\n催化剂心声项目的解决方案提供了在时间和成员之间分配努力（每个成员的时间有限），以发展合作，而没有承诺大的努力的压力（如参加一个长的会议）。\r\n这个项目有可能促进催化剂成员之间的合作，为成员提供一个比今天的市政厅更省时的新合作方式。它还可以促进新的提案人入职：这个播客是一个可以让他们带着想法和找到支持的地方。\r\n我非常同意这个建议有效地解决了社区活动的挑战，并能对 \"催化剂项目 \"的表现产生强有力的影响。\r\n", "q0r": 5, "q1": "两个团队成员已经确定，并收集了这个项目所需的技能：在教学、计算机科学和项目管理方面的经验。他们也是参与催化剂社区的成员，这显然是为社区活动制作动画的一笔财富。\r\n播客制作本身是基于现有的简易工具（zoom，gDocs等）。\r\n预算细目包括播客制作和托管，以及主持人工作的费用。\r\n提案很清楚地指出，这个计划最困难的部分只是启动它。提案人计划使用几个渠道来介绍这个活动，并让社区熟悉这个播客促进协议。我建议提案人与社区活动挑战团队合作，确定与挑战中其他提案人的潜在合作，这将有助于启动该项目。\r\n我非常同意这个建议非常有可能被成功实施。\r\n", "q1r": 5, "q2": "使用一个专门的github仓库和一个公开的Youtube视频频道，Project Catalyst HeartBeat项目将在他的进展上保持透明。衡量成功的标准是基于Youtube和Github的流量，这是一个可衡量的项目。\r\n增加 \"同步 \"社区顾问的数量是一个好的意图，虽然不容易衡量。但我不会过分关注 \"同步 \"的CA的数量，因为重要的是他们互动的质量。\r\n我建议提议者阐述一个指标，以显示这个解决方案比其他类型的活动（如市政厅）的好处。例如，向参与者询问他们是否会参加更耗时的研讨会。\r\n基于以上所述，我同意社区将有可能准确监测这个项目的进展和成功。\r\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Key aspects of this challenge is are about increasing participation, collaboration and outreach. On the face of it the proposal is a good idea and will definitely help to meet these objectives. However, is this a good use of treasury funds or will it add value? In its current state i would say no. The proposal need to address several points to make it fundable.\r\nKey points being \r\n1.how do these podcasts differ from the weekly townhalls? The town halls always start of with community led briefings from proposers, etc. \r\n2. A pilot Podcast could have been developed to support this proposal, that would have made it much simpler for voters to understand what they are getting for their $16k. Or even a website with some relevant content, at the moment the website is a placeholder. \r\nWhen comparing this proposal or others in this challenge asking for a similar amount of money, this proposal unfortunately doesn't yet do enough to tick the value for money box.\r\nI would suggest the proposers address the points made in this assessment , consider if its something they still wish to pursue and resubmit in the next fund.", "q0r": 3, "q1": "From the details provided in the proposal i do not have confidence that it will be delivered successfully.\r\nPaul claims to have 17 years experience of producing podcasts but no evidence is provided. I also couldn't find any specific reference to this on his linked page.\r\nAlso this comment is confusing: \r\n\"We own a Mighty Network with 60+ people and have been hosting 6+ events/month\"\r\nok so 'show me-don't tell me'. Supporting this proposal with hard evidence of relevant experience will help this proposal enormously.\r\nAs far as plans and budget is concerned.  \r\nfunds i would have liked to see a plan of how the website, research, etc will be mapped out over time along with a more detailed breakdown of the cost involved.\r\nMost of the requested funds is allocated to the proposers time for hosting the podcasts. $156.5 per man hour seems a little excessive but could be justified if we could actually see the quality of what we were getting for this money.  ", "q1r": 2, "q2": "The metrics mostly cover the relevant areas but should address the challenge and specifically address increased participation of proposers, voters, CA's with specific metrics for each. In addition the metrics need to made specific. \r\n\r\neg Increase number of \"in sync\" CAs. doesn't really mean anything. a better metric would be x number of CA's have participated in the Podcasts or x number of CA have provided feedback that the podcast help them feel more engaged in catalyst and have helped them improve their CA work. ", "q2r": 1, "assessor": "z_assessor_45", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "\r\n\r\nThe problem needing to be solved has been identified and articulated namely Long form content requires more time and energy to investigate and digest than many members of Project Catalyst can commit to regularly\r\n.\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief by creating and running a regular podcast\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating and running a regular podcast\r\n \r\n  Key metrics  would be  number of participants,  number of episodes, number of views,Length of episode, Number of times \"Round 2\" discussion topics appear. \r\n \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more participants and episodes.\r\n\r\nThis project will have a positive impact on Cardano system by increasing the awareness of the community members.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 4 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.\r\n ", "q0r": 4, "q1": "\r\nThe proposers  have  ample evidence  of themselves with their skills and experience in  hosting podcasts. \r\n \r\n \r\n The links are sufficient. \r\n \r\nI have visited these links\r\n   \r\nThe proposers are  experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is stated. \r\nThe team structure is listed and experienced.\r\n\r\n The budget has been given in detail. It appears quite high. 156$ per man hour seems pretty high for this work. It would be better to break this down into cost centres and justify each of those.\r\n \r\nThe budget is not reasonable to achieve the set goals. \r\n\r\nThe proposer has not provided a verifiable plan if additional funding is required   \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres a realistic timetable  to complete the work \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are described.   \r\n  \r\nThe proposal has technical aspects which have been addressed \r\n\r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is not reasonable hence I have given it a 2 star rating.   ", "q1r": 2, "q2": "\r\n \r\nThere is a roadmap with milestones   \r\n There are  Metrics such of number of participants a and number of presentations and discussion rooms. \r\n  \r\n \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n   \r\n    The proposer has not identified possible hurdles, challenges and difficulties.\r\n \r\n \r\nAre there contingency plans in place for various outcomes?\r\n \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal but the auditability of the budget remains in question, hence I have given it a  3 star rating.\r\n \r\n", "q2r": 3, "assessor": "z_assessor_460", "no_vca": 17, "ne": 2, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "The premise of the Heartbeat podcast is to provide the Cardano ecosystem with a short-form update service for those that are too busy for longer project reporting or watching lenthy forums. This would add value to the Cardano Ecosystem by providing a channel for information about updates to catalyst projects and what is happening in funded projects. \r\n\r\n\r\nThis proposal is in alignment with the challenge, in that it encourages increased engagement in the activities of Cardano and Catalyst projects. The impact would be global, with the potential for this to scale through increased listenership outside of Cardano community and as a way for people to learn about the projects that are being funded. ", "q0r": 5, "q1": "The project team have provided transparent information on their skills and have included a detailed plan and roadmap for the project. Their skills clearly align with the project needs. \r\n\r\nThe proposal is to provide 12 episodes of the podcast per funding round, so weekly episodes within the timeframe of a funding round. \r\n\r\nThe budget is clear and specified in terms of labour costs and effort hours involved in the project delivery. \r\n\r\nThey haven't detailed any risks for the project. ", "q1r": 4, "q2": "The project has a github repository where they are sharing their actiities, resources and meeting protocols. Their KPI's are centred mostly around the quality and aims of the production of the podcast series itself. \r\n\r\nIt is unclear exactly when this would launch given the timeframe sits around delivery of Catalyst funding.", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 14, "ne": 2, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "I'm impressed with this proposal. All the goals of the proposal fit into the challenge settings as can be see from the impact section of the proposal, and hence Cardano undoubtedly will benefit if it is implemented.", "q0r": 4, "q1": "I believe the team possess the skills and experience needed to implement the proposal considering the information provided in the relevant experience section.\r\nI appreciate the proposer's efforts for explaining some technical terms like the podcast and heartbeat from the context of the proposal. But possible risks involved in the implementation are not stated. Try to add them in future proposals.", "q1r": 4, "q2": "The proposer has provided a step by step plan, timeline  as well as metrics that define the success of the proposal. The proposer has been able to clearly describe the targeted problem and the solution as well.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "Great and an awesome proposal. I think hosting a podcast is an effective way of reaching individuals with quality information per week. Making available the recording on Youtube and Libsyn is adequately considering those who could miss the live podcast due to busy schedules. This is a great idea.", "q0r": 4, "q1": "The team had the requisite experience to deliver the proposal successfully. The proposal has measurable outcomes that are specific and achievable. ", "q1r": 4, "q2": "Huge part of the budget goes into labour, and there is no budget allocation for marketing even though marketing strategies are specified in the proposal. On the other side, there are good transparency strategies to enable smooth tracking and measure of success. ", "q2r": 4, "assessor": "z_assessor_727", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "I strongly agree that this proposal addresses the challenge. Opening a podcast to update for Cardano/ Catalyst project about the timeline, phase, meeting and sometimes invite proposers to talk about their ideas is such a friendly and convenient way to gather attention/ participation of stakeholders. ", "q0r": 5, "q1": "I rate for feasibility of this proposal score of 4 because I agree that this proposal will be implemented successfully. I can see Paul Benedict and Peter Wolcott both have skills and experience compatible with each other's to form a strong team. Timeline for each round is well presented. I only have one concern that since the time for podcast is limited, how the team will handle the peak-load of proposers' request to be on the podcast? I also suggest that the podcast should be uploaded on Spotify or Apple Music as well because they are such great platforms for podcast. ", "q1r": 4, "q2": "This proposal provides me quite enough information to assess its auditability, except for the key metrics to success and KPIs. How many people does the podcast will reach out? Therefore, I rate 4 for Clarity/ Auditability.", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This is an awesome idea of organising online community events in a friendly, transparent and interactive sessions. Such task will motivate active collaboration, awareness and most importantly, spurn increased active participation and involvement in project catalyst.", "q0r": 4, "q1": "This proposed is well articulated and detailed and the comprehensive plan of the roadmap explained and the budget estimate, am convinced that the proposal will be implemented effectively. However I advised that the team should inquire for collaboration with experienced and skilled community members for inputs, direction and guidance.", "q1r": 4, "q2": "There is well detailed success metrics that are effective enough to assess the performance of the proposal", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "This proposal recognizes the challenge and tackles it hands-on, while also recognizing other elements to it, such as 'humanizing' the proposals. It solves issues of time, while recognizing that solving this would welcome especially the busiest people, while nevertheless including the community. As such, the proposal shows a great understanding of the challenge and an appropriate solution, more than a simple 'podcast' may seem like.", "q0r": 5, "q1": "The team has a solid background of relevant experience. Furthermore, the level of detail provided and the anticipation of issues show a depth of knowledge of the community, as well as the enthusiasm one can feel in between the lines make the implementation likely.", "q1r": 5, "q2": "The proposal gives full report on the suitability and success of the proposal and breaks them down to an outsider.", "q2r": 5, "assessor": "z_assessor_942", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "The proposal meets the campaign guidelines exceptionally well. It would provide an outlet for proposers to discuss/promote their projects and create excitement amongst community members. The feedback these episodes could provide would improve proposals, and the discussions on different projects could lead to new teams and collaborations. I certainly would listen to this.", "q0r": 5, "q1": "The podcast itself would probably be implemented successfully. The proposers have relevant experience in project management, and the outline for the podcast episodes sounds engaging. However, the cost of implementation is excessive. This is due to the wage rates assigned to the two podcast facilitators, which is approximately $78/hr per person. From a financial perspective, I do not see this podcast having a return in twelve episodes (the proposed number of episodes) that would justify this high of a price on labor. I would not recommend voting to fund this proposal until a reasonable rate is established. My personal opinion on an appropriate rate: $30/hr or less.", "q1r": 1, "q2": "The proposers have established relevant metrics to gauge their success and progress, and they have plans to make that information available to the community through a Github repository. Some of the metrics are unclear, but overall they are acceptable indicators of success. As to progress, the broadcast of each episode would be the main measure.", "q2r": 4, "assessor": "z_assessor_947", "no_vca": 18, "ne": 4, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "I believe this concept could be a strong driver of community events. it's hands-on nature has the potential to further engage participants while delivering a unified message that could be custom fit to the group's particular \"HeartBeat\".  ", "q0r": 5, "q1": "I believe that the proposers contain the necessary experience to organize and deliver a quality Podcast that delivers on it's goal. My only concern is a curriculum of sorts, that will be a guide on keeping the sprouting \"HeartBeat\" a valid source of information that is truly reflective of your proposal, while not limiting organic growth of topic and style. ", "q1r": 4, "q2": "Yes. My favorite part of this proposal is that you will be able to hear the results. Although people employ different methods to intake new information, Podcast have become a favorite medium, and the adoption of \"HearBeat\" will provide a clear metric of it's success. ", "q2r": 5, "assessor": "z_assessor_970", "no_vca": 23, "ne": 1, "ng": 18, "nfo": 4, "vca_o": 1}, {"q0": "The podcast's short-form design should afford well-focused proposers the opportunity to distill the essence of their projects into easily consumable bits. Accomplishing this should facilitate the integration of new participants into Project Catalyst by providing a great starting point for stakeholders on either side of the process.", "q0r": 5, "q1": "The team's experience seems perfectly suited to shepherding the project to success and enhancing Project Catalyst's reach and accessibility. I look forward to seeing what RevPaul and SirWolcott are able to achieve with HeartBeat podcast.", "q1r": 5, "q2": "HeartBeat podcast's design process and products offer clear and auditable measures of progress and success of the proposal. Community engagement will be measurable by the number of projects that will be accommodated, dynamism of the each round, and visitor traffic to GitBook and recordings, as well as collaboration fostered through engagement with the HeartBeat podcast's content.", "q2r": 5, "assessor": "z_assessor_980", "no_vca": 26, "ne": 2, "ng": 18, "nfo": 6, "vca_o": 1}], "solution": "召集你的社区，种下HeartBeat Podcast的种子，然后用你的时间和注意力一起浇灌它。", "experience": "保罗有17年的播客制作经验--彼得1\n我们拥有一个拥有60多人的Mighty网络，并一直在举办6个以上的活动/月"}