{"id": 384640, "author": "highlander", "title": "Cardano Savings & Loan - PoC", "url": "https://cardano.ideascale.com/a/dtd/384640-48088", "category": 26243, "amount": 10000, "description": "Блокчейн Cardano нуждается в дополнительных возможностях инвестирования и сбережения для держателей ADA, которые хотят получать вознаграждение или проценты на свои средства.", "funded": 0, "upvotes": 20941091, "downvotes": 18756867, "votes_result": 2184224, "votes_cast": 136, "f6_no_assessments": 8, "f6_rating": 2.708333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal looks to create a proof of concept smart contract that will enable lending and saving in essence replicating a banks function, but for ADA holders and building upon the existing functionality of stake pools with the added banking concept.\r\n\r\nThis problem statement aligns with the challenge brief in that it wants to create a DeFi Lending dapp that will benefit the ecosystem on a more scalable and secure blockchain such a Cardano with more reasonable transactions fees. The challenge brief identifies several metrics the proposal ought to measure identified such as the number of bugs, vulnerabilities, participants in a testnet and token holders, none of these are identified in the proposal. ", "q0r": 3, "q1": "The timeline outlined is clear in that the initial 3 months will be used to create the smart contract and front end for the system. Given the pre-existing development of https://www.higlander.tech it appears that Chris and Jack have the form to pull the project off in terms of software expertise. \r\n\r\nThe success of the project lies beyond the development of the proof of concept, the team should look beyond this and how the project could scale in terms of a user base and technology wise. They mention if the PoC is successful they will look to build additional financing to open a bank to the public, here it would be good to understand where further financing would come from and what is the target audience of any future ventures. \r\n\r\nThe proposal would benefit from outlining greater technical details such as more of the underlying architecture. For example how Jack plans on structuring his software development effort, will this be using SCRUM, Agile or different approach. Will he be using DevOps pipelines for automated CI?, Where and how will the system will be deployed? For example will he be deploying the system onto a Kubernetes clusters on AWS, or will he just deploy the system on a few Raspberry pi's since this is a PoC. \r\n\r\nFrom the plan it mentions that there will be success if a PoC of a smart contract implemented with a usable frontend. However the quality of the outcome hasn't been clearly outlined in the plan. Will a good outcome be simply be a working system, or will it have been to have demos the system to multiple audiences, for this it would be good to outline key performance indicators. \r\n\r\nOverall given the scope identified and the timeline of 3 months and reasonable development budget for that period along with the previous development experience of highlander.tech on balance it feels that there would be a reasonable outcome from the PoC.  ", "q1r": 4, "q2": "The development team aim to have a PoC at the end of a three month period. However it is difficult to audit this at the end, will they release their findings to the public? For example will they release their progress on a blogging platform, Twitter or their won website? A good way to audit a PoC such as this would be to have a working demonstration of the system recorded on a Youtube video and perhaps initially reviewed by a user pool so they can have good user feedback before iterating to the next stage.\r\n\r\nThe proposal gives the impression that the software development work will be done in one big block of 3 months, however to make it more measurable a road map would have been good to break this down into smaller chunks and deliverables and how each of those elements is kept track. ", "q2r": 2, "assessor": "z_assessor_332", "no_vca": 20, "ne": 9, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement being providing saving and investing options for ADA holders to get interest on their holdings similar to keeping money in banks to earn interest. The proposer is suggesting to make a Cardano bank where ADA holder will be able to earn interest for their ADA deposit in the Cardano bank and also allows people to borrow loan from it. These process will be done with the help of smart contract to make it fully decentralized.\r\nThis does effectively addresses the challenge", "q0r": 5, "q1": "The proposer has mentioned their experience building a Highlander platform and has good experience in smart contracts on Ethereum but any previous experience on cardano related projects would have been very helpful.\r\nThe proposer has given a rough explanation about the working of Cardano bank a detailed explanations about how interest rate earned would be more than stake pool and also clarification about loan collateral would have helped to increasing the likelihood of successfully implementing the proposal", "q1r": 2, "q2": "A detailed step by step work timeline to carryout the proposal would have helped to track the progress of the proposal easily. \r\nAnd also a complete fund breakdown would have been very helpful. Without these it would be hard to audit the progress and success of the proposal.", "q2r": 3, "assessor": "z_assessor_419", "no_vca": 21, "ne": 2, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is in accordance with the challenge, yet more details would be required on how these higher interest rates would be implemented. \r\n\r\nThe idea of higher interest rates needs to be explained in more detail.\r\n\r\nRating given 3.", "q0r": 3, "q1": "The experience and skills stated seem to be reasonable.\r\n\r\nMore detail on a roadmap would be nice to see, to verify if they know how to proceed, what are subtasks, and how much time it takes to deliver the final product.\r\n\r\nAlso, they admit \"if we will be able to establish a working product\" so it is unclear if it will be successfully implemented.\r\n\r\nRating given 4.", "q1r": 4, "q2": "No key metrics are stated and the roadmap lacks the detail for auditing. Also, it is not stated how they plan on providing results (git repository, open space) except the final product.\r\n\r\nRating given 2.", "q2r": 2, "assessor": "z_assessor_54", "no_vca": 19, "ne": 0, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been active in project Catalyst since fund 4 and I have experience analyzing business requirements from over 5 years of delivering software solutions for small business and corporations as well. Aside from this, I also use a diverse range of financial services, including peer to peer lending, which gives me insight into this proposal.\r\nThe problem statement is clearly formulated, but I think it could have benefited from mentioning why having more ADA investing and saving options would be beneficial to Cardano (and then discussing this at length in the detailed plan). I'll expand on this shortly..\r\nThe solution is easy to understand as well, but using the word \"bank\" in the context of crypto is probably not a good idea. Banks are inherently centralized and people come to crypto wanting to escape that kind of danger. If the intended use of the word here is \"fund\", one that would be enabled by a smart contract, then that would have worked better.\r\nOn its face this idea sounds good, but I wonder what the effect on the network would be if you had a safe option to receive higher interest on your ADA than staking it. People would naturally gravitate toward that and unless the staking rewards rate can be adjusted (I'm not sure they can be), then the network would become less secure as less people were incentivized to stake.\r\nMy next question is, how would users receive higher than 5% interest on their ADA just by depositing it in this \"bank\"? I understand from the plan that the user would have to approve loans manually (again, depending on the scale of the project, this is not feasible - most P2P lending platforms have an autoinvest feature to avoid cash drag, or uninvested funds). Interest for loans can be a lot higher than 5%, but it is important to distinguish between that and interest on a deposit.\r\nThe rest of the plan is very basic as well: the proposer himself admits there is no way to make this fully decentralized, which does not sound exactly good for the \"Seeding Cardano's Grassroots DeFi\" challenge. To be fair, however, we are in the early stages of DeFi and many applications still have a certain degree of centralization, perhaps this could be improved in the future.\r\nDue to the lack of clarity on how this will add value to Cardano and the plan in general, as described above, as well as the fact that no metrics and clear goals have been discussed here, I don't feel very confident that this proposal effectively addresses the challenge.  ", "q0r": 2, "q1": "The proposer has provided brief information about himself and the project manager who would be working on this, but has not backed up this information with any credentials, except the Highlander site. Voters have grown accustomed to seeing LinkedIn pages about the individuals here, Github repositories and other such personal stuff, as that helps you see where the individual has worked, what he's worked on and who he's done it with. It makes it more verifiable. Please consider adding this in future proposals.\r\nIdeally, the budget should have been broken down into an estimation of the cost of separate tasks (with the cost per hour mentioned). This again helps people see that the project has been thoroughly planned and the team is taking a systematic approach working on it.\r\nAside from this, the proposal is also missing risk analysis (as I mentioned above, what happens if this turns out to be a bad idea for the health of the ecosystem actually?) and details on the planned technical approach. As a result, I have to disagree that this proposal is likely to be implemented successfully.", "q1r": 2, "q2": "As outlined in the earlier sections, I do not feel this proposal is clear enough about what it wants to do and how it wants to do it. To remediate this, a detailed roadmap with specific milestones and KPI's would have been needed. As it stands, I disagree that this proposal is sufficiently auditable.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 23, "ne": 4, "ng": 11, "nfo": 8, "vca_o": 1, "reply": "The reviewer states their opinion that banks are a \"danger\" and that users of cryptocurrency want to get away from them. However, I don't think z_assessor_546's opinion of banks is relevant to this assessment and it should be removed."}, {"q0": "It is not clear how the \"interest\" will be given, and how it will return more than a normal stakepool, or will some stable coin be issued for the interest?\r\n\r\nIt feels as though the team is very ambitious and could potentially in the future create a complete working product, but I think they haven't thought through a complete proposal with details yet and thus it's difficult to award more stars.", "q0r": 3, "q1": "I would note that experience developing on Ethereum does not immediately mean that experience will translate over to Plutus and the Cardano ecosystem, however some web3 experience is certainly preferable to none.\r\n\r\nThe website they built that utilises metamask and Ethereum does in fact seem to be functional, so the team has indeed demonstrated a level of competence here that warrants atleast 3 stars. They would need to demonstrate proficiency with Haskell and Plutus to warrant a higher score here.\r\n\r\n", "q1r": 3, "q2": "Unfortunately this proposal is lacking in detail, and has no clear roadmap with milestones and well defined KPIs for the milestones were they do be defined.", "q2r": 2, "assessor": "z_assessor_577", "no_vca": 19, "ne": 1, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is a great idea. What I am missing is understanding how does the Cardano Bank the proposer tend to achieve gets better interest rate for users staking in a pool. Though, this does encourage what the challenge stands for, but I feel that the proposal lacks clarity in explaining the context behind developing the bank, in addition of proposing its Proof of Concept to the voters & CA(s). It would be great if the proposal can have detailed explanation on its problem and solution. This will reveal an in-depth of its impact towards the ecosystem.", "q0r": 3, "q1": "The proposer team states that it has the necessary experience and have provided a link of their existing project. Budget required is reasonable and the proposal have mentioned the challenges they will be facing throughout the process. However, I feel that the proposer needs to clarify deeper understanding of their key metrics, milestones, roadmap and vision of success to add more confidence and validation of voters. As the proposer have also state that they needed the funding only for the development of smart contract and its front-end, it would be great if they could give a rough idea of how its front-end works (for example; an interface whereby users can easily connect their wallet and select the amount of ADA to be deposited into the bank). Breakdown of the compensation towards the proposer's team is important. A question that I wonder is, what are the associated policies to be developed? what actions that are taken to have a user-centric approach on its front-end? What is the design strategy and UI reference for users? These can be further explained with providing references of their team members.", "q1r": 3, "q2": "Roadmap and milestones (incl. time horizon) are weakly described. It is only mentioned that further funding will be needed. The given metrics measure what the proposer wants to do, but the success of his actions is not defined. (For example, amount of resources lost due to bugs or vulnerabilities). Possible challenges should be defined to have a deeper view of the proposal.", "q2r": 2, "assessor": "z_assessor_669", "no_vca": 18, "ne": 4, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "If successfully implemented this proposal is exactly what this challenge sought to incentivize.", "q0r": 5, "q1": "\"...If we are able to establish a viable product...\"\r\nThe proposal team is not confident they will end the 3 month period with a viable product, therefore it is not highly likely this proposal will be implemented successfully.\r\n\r\nAdditionally, there is no mention of necessary mechanics of a Savings & loan, ie what happens in the case of empty wallet nonpayment.\r\nThe experience of the team seems technically sufficient to build smart contracts, but there is no mention of the business considerations or a plan to acquire the skills on behalf of the team.", "q1r": 2, "q2": "No, the information provided is not sufficient to audit the progress and success of the proposal. Specific, measurable, auditable milestones were not included in this proposal. To quote the outcome section: \"We intend to spend three months developing the smart contract and building a basic front-end to allow users to deposit ADA and open loan requests. If we are able to establish a viable product...\"\r\n", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 23, "ne": 2, "ng": 10, "nfo": 11, "vca_o": 1}, {"q0": "The proposers has done a fair job in bringing up an idea that seek encourage savings and loans culture among people especially lovers of cryptocurrencies.\r\n\r\nThe proposal also has a good idea of helping people in providing investing and savings options for ADA holders who wish to earn rewards or interest on their holdings.\r\n\r\nI however think that more information on how the problem could address the challenge was scanty. Proposers could have provided more information to back it up.\r\n", "q0r": 4, "q1": "Given that the proposers outlined they will develop a Cardano smart contract that allows ADA holders to deposit their cryptocurrency and receive interest. They also emphasized that the contract will also allow for borrowers to request loans. In other words, the smart contract will function in the same way that a traditional bank does. I was however looking at a more detailed outline on the plan they will use to execute this project should they be given the funds. The detailed plan was left out.\r\n\r\nI think the budget also left out the breakdown of the activities. They only said they need this amount of money but as to why and what they intend using the money for nobody knows.\r\nThe proposal didn't also give more information about their previous works. And there wasn't more information about their experiences and what each of their team can do.\r\nHow do we get the opportunity to know exactly what you can do and what you can't do?\r\nOn this note, I scored them 2.", "q1r": 2, "q2": "The information the proposers provided was too small to be able to track progress of work.\r\n\r\nThey failed to break down their budget into activities and how much each activity was going to cost.\r\n\r\nThis to me will make it difficult for transparency and accountability. I therefore scored them 1.", "q2r": 1, "assessor": "z_assessor_925", "no_vca": 21, "ne": 0, "ng": 12, "nfo": 9, "vca_o": 1, "reply": "The reviewer did not fully read the proposal. It contains information about the team's previous work and qualifications to undertake this proposal. It also clearly states that the requested funds will be used to compensate the team as they undertake development work. Please remove this assessment."}], "solution": "Банк Cardano, который позволит держателям депонировать свои ADA и получать проценты, превышающие те, что они могут получить в пуле колов.", "experience": "Мы - команда, стоящая за платформой Highlander. Крис является нашим ведущим разработчиком и имеет большой опыт написания смарт-контрактов на Ethereum"}