{"id": 366863, "author": "", "title": "iFoncier Land Registry Burkina Faso", "url": "https://cardano.ideascale.com/a/dtd/366863-48088", "category": 26108, "amount": 63950, "description": "ブルキナファソでは、土地管理の失敗が原因で、深刻な社会的緊張と、暴力的で致命的な地域紛争の増加に直面しています。", "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem and solution statement is clear and reasonable. A YouTube/News link would help the voter visualize the problem statement. The proposal clearly articulates how it will add value to the Cardano ecosystem. 185000 inhabitants is not a clear representation  of the number of landowners / direct users though. The key metrics and goals of the proposal align with the outlined challenge settings.", "q0r": 4, "q1": "A team of 4 is small. Linkedin profiles would help voters verify whether they are capable of developing and implementing this solution. I'd personally have liked to see a team member who currently is a citizen living in Burkina. Four outsiders may lack perspective. \r\nThe type and number of team members required to implement the proposal is unclear. Are the 3 externally located members going to move to Burkina Faso? If not who is going to implement the plan? \r\nI personally feel that the context part of the proposal feels judgmental. I'd have appreciated  more information in the form of source links  about the situation. Use of words like tension, insurrections, illegal, unauthorized, anarchic, and simmering social bomb certainly create a picture. Evidence is not provided to back the picture.\r\nThe budget breakdown is clear. I think the timeline is unlikely to work out. If the current government of Burkina Faso is as chaotic as stated, getting it to adapt/adjust/accommodate to a new idea in 3 months seems optimistic. As stated, land ownership is very important, closely guarded by the people of Burkina Faso. A plan for education / shifting mindsets and convincing them of the power of new technology is not given. It may come across as Berlin Conference-esq.\r\n", "q1r": 1, "q2": "Milestones are very clearly set out, but the timelines are unrealistic. Voters are unlikely to see blockchain integration, Backend-App, dApp, and smart contracts development with one (unverifiable) coder on the team.\r\n", "q2r": 1, "assessor": "z_assessor_311", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal did a great job of highlighting a problem and gave a very clear solution to the problem of land disputes.\r\nThere are lots of details and materials provided to further the understanding of the proposed Solution. Kudos to the team.", "q0r": 5, "q1": "This is one place the proposal fall short by providing verifiable links to show given experience in implementing the solution.\r\nIt will be necessary to show experience and expertise in the Land Registry space as this space is populated by self acclaimed experts which further adds to the problem of land dispute resolution (This is speaking as a Nigerian and it should be noted that the specific solution relates to Burkina-Faso).\r\nThe proposal did a great job of outlining the implementation plan (Shows some  research has been done on the subject and implementation challenges).\r\nOne issue with the implementation plan is bloat, there seem to have a very long implementation timeline  (24 Months) which i think wouldn't be ideal for such a funding process as its progress will audited at various Milestones and requested funding might need to be updated to reflect current prices of services rendered especially in Africa where Inflation is a joke.It will be more helpful if the proposal implementation is broken down into smaller manageable chunks and spread across different funding rounds as milestones are achieved .\r\nConsidering the above , i agree that this proposal can be implemented successfully.", "q1r": 4, "q2": "the proposal did a great job of providing audit level timelines, milestones and cost breakdown.\r\nI agree .", "q2r": 4, "assessor": "z_assessor_331", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is trying to create a land-registration system in Burkino Faso on a local level in cooperation with municipalities. It is perfectly in line with the overall challenge setting and will be a first step for Cardano to be involved in Africa. It is a first test case for a land registration with Cardano and can be used for other municipalities as well. The local population could really benefit from a new land registration system as it gives them more security. Although I am from Europe, I heard that land grabbing and land registration is a wide problem in Africa (as already mentioned in the Bermuda Ted Talk of Charles Hoskinson). Therefore it is vital for Cardano to tackle this problem. And this proposal could be a first step.", "q0r": 5, "q1": "The project team consists of four people that are partially already engaged in Project Catalyst. By looking at their resumes, they seem to provide the right knowledge to implement such a registration system. They are already engaged with governmental authorities in Burkina Faso, work with Blockchain and digital infrastructure and have (partially) management experience in bigger companies. However, it is not entirely clear how far the conversations have come already with the 3 municipalities that the team is planning to work together with. Based upon the resume of the team, I think it is likely for the team to build something with the local authorities successfully. But depending on the work of the local governance structures and the willingness to implement something new, there might be some delays. (As I heard it from other projects in different parts of Africa). A bit more clarity in the proposal regarding the collaboration with the authorities and the status quo would be therefore helpful for future assessments.", "q1r": 4, "q2": "The team provides clear milestones for 1, 3 and 6 month that seem reasonable. They even included a longer term outlook what they want to achieve in two years. It will be relatively clear to see if they reached their milestones in the first phase. But these are rather soft metrics to measure (like if they registered the COOP in Burkina Faso) or if they have first employees. The hard KPIs (such as the number of land registrations and number of collaborations with municipalities) will be more relevant down the road. What is missing in the proposal is to address potential risks. What could delay collaborations with municipalities? How many contacts does the team already have with the respective governmental structures? Are there opposing political interests that don't want a better land registration? Have there been previous attempts to change the bureaucratic system? All of the culture and political concerns are not sufficiently addresses in this proposal.", "q2r": 4, "assessor": "z_assessor_380", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This is pretty good idea. As an African, I know for sure that land conflict is a real issue in of African. I think that this proposal, if executed properly, can represent the start of a global viable solution in all Africa. This proposal  has its place in this challenge. This project can benefit africa and can add value to the cardano ecosystem. African will win by having the solution of the land distrinution issue, and the cardano ecosystem will win by being recognised as the best blockchain. Besides, the goal and key metrics are properly aligned with the challenge. This prroject can be scaled in future funds.", "q0r": 5, "q1": "There enough information about the team on this project but the linkedin profile links are missing. It,s a room for improvement for the proposer. The team needed for this project to work, is clearly stated in this proposal. The budget has been broken down into comprehensible items and reasonable to achieve the goal (I have to trust the proposer on this). There is also a clear roadmap provided in this proposal. The plan to achieve success on this project is detail and seems deeply thought. All the informaiton about ressources needed and technical aspects, are provided in this proposal. ", "q1r": 5, "q2": "This proposal contains a detailed roadmap with the expected launch date. Key metrics are also provided by the proposer as well as a clear description of the problem and the solution.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal deals with a very important issue and is aligned with the challenge objective. Lang registry & transparency is key for individuals' wealth creation. The problem and solution are well explained. \r\n\r\nWhen I was at Earthwrom.org, I worked for a couple of years on agriculture supply chains in developing and understand the importance of land registration and ownership. \r\n\r\nThere is a great mission statement that shows the motivation of the team and the mindset for scale. Good video explaining the projects. \r\n", "q0r": 5, "q1": "The impression from the team is very good with very relevant expertise: local team, business-oriented, blockchain focus, social entrepreneurs, and technology. The team profile is well detailed, but external links (i.e. Linkedin) would have provided more info.\r\n\r\nThe plan vs. the idea is well aligned with clear next steps. Great that you start the pilot in one location and clear idea for the next locations. \r\n\r\nThe budget seems reasonable for the first 12 months but more details about each line would have been helpful to see how you got each amount. For example, detail employee cost: people/months/salary. It could have been good to add what will be the funding post 12 months: revenue, investors... \r\n \r\nIt could have been good to add when you started working on it and current status/achievements \r\n\r\nAs someone who mentored early-stage startups (i.e. seedstars, givginway.com) I find the proposal clear and focused. \r\n", "q1r": 5, "q2": "There is a clear roadmap and timeline over 3,6, 12 and a general plan up to 30 months with an expected launch date to be Q2 2022. \r\n\r\nThe list of KPIs is very good, but missing some specific forecast numbers. I.e. how many parcels will be on the platform each quarter? This is very important as it is easier to audit and based on that you can measure your progress comparing to the plan.   \r\n\r\n\r\nAdding risks and challenges would have been important as well, to show you considered various scenarios. You aim to disrupt the market and there will be challenges on the way. \r\n", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "ブロックチェーンベースの土地登記ソリューションを作成して、ブルキナのカルダノを公開し、劣悪な土地管理による社会的緊張の緩和に貢献する", "experience": "Larba Nadiebaは、アフリカの新興技術に焦点を当てたICTエキスパートです。社会起業家として、ブロックチェーンの取り組みを行っています。"}