{"id": 366950, "author": "", "title": "MCA: A Model School in South Africa", "url": "https://cardano.ideascale.com/a/dtd/366950-48088", "category": 26108, "amount": 40000, "description": "カルダノプロトコルの利用と採用は、コンピュータや技術サポートへのアクセスが限られているSAの子どもたちにとっては困難です。", "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "This a well written and detailed proposal which clearly highlighted the problem and in detail breakdown the solution. Great work  by the team involved.\r\nThese are the kinds of project i believe the Cardano Funds were setup for , Great work once more.\r\nI strongly Agree.", "q0r": 5, "q1": "Given experience was provided with verifiable links in the proposal and a very detailed implementation plan with milestones and cost implications where provided but it would have been better if the whole cost breakdown was put together in one place/section of the proposal as regards to spreading it through out the proposal.\r\nThe requested amount seem to be fair and highlight considerations for other proposals to be funded considering the huge task and cost of achieving the proposed solution.\r\nI strongly Agree.", "q1r": 5, "q2": "Detailed information was provided that will help guide the audit of the proposal and its success.\r\n\r\nI strongly Agree.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "It is very interesting how the authors of the proposal start explaining the idea by presenting the obstacles they will face next. This demonstrates that they really thought about how things will happen in practice, how the day-to-day of this project would be carried out. The idea is extremely positive in terms of introducing the Cardano universe to the African continent, and its target audience is a portion of the population that is essential for the future of blockshain: young people. Especially economically disadvantaged young people, according to what is said in the proposal. In this way, the objective of involving and reaching the maximum number of natives on the continent, giving them support, since they are in a vulnerable situation is well aimed at. By teaching what Cardano is and how our ecosystem relates to daily life for children and adolescents, success is certain, as they will mature and use cryptocurrencies in the next stages of their lives, in addition to disseminating this knowledge to their acquaintances . Also relevant is the fact that MCA already exists, it is an institution with a history, that is, the work will be to merge the Cardano universe with pre-existing practices, which is certainly more practical than creating a school from scratch. Furthermore, it is very positive that they mention in the proposal that they intend to send periodic reports on how the project is going to the community.", "q0r": 5, "q1": "In relation to knowing who are the people involved in the project, what is said in the proposal description are the names, roles and time of experience of the team members. This is very rare to see so well detailed, and it conveys a lot of confidence and credibility. At the end of the description we have many (very same) details of who the members are, what they did, where they graduated, worked, projects they worked on and even personal details about them. This way, you are very sure who you are and the ability to carry out the project. It would be even more interesting if the linkedin profiles were attached, or all appeared in the youtube videos posted in the proposal. However, the detail found here about the team is something rare to see, excellent for conveying confidence.", "q1r": 5, "q2": "We are provided with a general and a detailed plan. In general, it is said that the fronts will be worked on in the MCA: treasury systems, incentives, identity and governance. In the detailed plan, it is possible to understand how such fronts would be explored: from the supply of digital equipment to the 17 main MCA employees, as well as an investment in internet coverage and in the institution's legal protection, etc. We are also told what would happen and at what stage, such as creating smart contracts in stage 2, for example, as well as instructions on how to create account and contract with ADA. In other words, everything is very well detailed in terms of what will be done and in what sequence, as well as how students and employees would benefit. The only thing I was a little doubtful about was how it will all happen: who would they be and how would they find the donors? There is also a notion of dates here, we are told how long each step would take, and which month we would be talking to, for example. Therefore, I think the auditability was very well executed (the detailing of actions and phases), as well as the descriptions about the team. The financial amount requested is a little confusing, it is stated in a comment to the proposal, but it is not explained what each amount of the whole would be used for.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "The challenge and associated proposal is clear and very relevant here in South Africa. \r\nThese types of projects are critical in a school system at large that is showing signs of serious decline.", "q0r": 5, "q1": "The implementation and the challenges are clear  - and practical for the environment in which it is trying to execute this.\r\nAn added component (maybe already included by implications) that I would suggest is that of a level of education on the smart contract / wallet users as a key component in the success of understanding and becoming \"evangelists/influencers\" as respective users - the give fish vs teach to fish.", "q1r": 5, "q2": "1. Although high level activities/tasks seems clear - and the end goal of 10 donors seem measurable, it would be good to have at least contract #1 on 1 donor and then Contract #2 on at least 1 donor each an earlier on in the process as indicators of success of the smart contract-wallet-donor mechanism.\r\n2. An early set of proof e.g. 2 students per grade in the task: \"Begin to identify academic behaviors to be rewarded in an incentive program in the 5th, 6th, and 7th grades.\"", "q2r": 4, "assessor": "z_assessor_633", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "カルダノのトレジャリー、インセンティブ、アイデンティティ、ガバナンスのシステムと、私たちが運営する脆弱な子供たちのための学校を融合させ、ラボ／モデル校を作る。", "experience": "エドとキース（チーム参照）は、MCAとIndlu Livingの設立、資金調達、成長に12年の経験があります。以下のCharlesのコメントをご覧ください。"}