{"id": 369339, "author": "", "title": "ADA News in African languages", "url": "https://cardano.ideascale.com/a/dtd/369339-48088", "category": 26108, "amount": 18720, "description": "アフリカのコミュニティでは、カルダノに関する教育を母国語で行う必要があります。しかし、暗号の世界は英語を中心としている", "f6_no_assessments": 4, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer clearly laid out their plans for growing awareness around Cardano in Africa via educational videos. Providing knowledge for individuals in Africa who do not speak English would open up the equal opportunity for said individuals to partake in the Cardano ecosystem. People in Africa would then be able to make their own choices after learning about Cardano from this project.\r\n\r\nHowever, it is unclear from the given information whether the proposer will be able to continue growing and/or networking this project once the funding period is over and the project is completed. Cardano changes and evolves over time. How would the videos created by the project serve their purpose for years to come if the information is eventually outdated? Would the proposer revise their videos to make them relevant again? (score given 3)\r\n\r\n", "q0r": 3, "q1": "As the proposer mentioned, there is the possibility that the created videos will not become popular in the target countries. Reliance on the YouTube algorithm to spread awareness about the educational videos is almost paradoxical because more views requires more awareness and more awareness requires more views. Thus, in the future, the proposer should come up with a more concrete way to spread awareness about the project to reach a wider audience.\r\n\r\nAnother concern is that limited access to the internet could hinder the successful implementation of this proposal. Many regions in Africa do not have access to the internet or have very limited access, so growing this project would be difficult. If the proposer could give a concrete method of disseminating the information/videos, it would strengthen the proposal.\r\n\r\nThe proposer has laid out a clear plan for their budget, but I cannot say whether it is appropriate or not given my experience. \r\n\r\nAlso, the proposer has not provided much evidence of the successes of the fund5 funding the project received. It would have helped to list out the successes of the fund5 project and why it should receive more funding to continue. It also would have been nice to see links to the translated videos so that voters would be able to see the product of the proposal first-hand. (score given 2)\r\n", "q1r": 2, "q2": "The proposer has identified one measure of progress (videos created within a given timeframe). However, the proposer has not provided any quantitative measure to determine whether the project has been successful. Simply creating videos that might \"become popular\" is not a quantitative measure of success. More tangible information would need to be provided to allow a sufficient audit of the success of the proposal, such as using analytics to understand who is viewing the videos. (score given 2)", "q2r": 2, "assessor": "z_assessor_310", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1, "reply": "Information is clearly given why the KPI dilemma exists for Crypto Risk Prevention in the proposal. Internet access will improve in Africa, but for example Arabic is spoken by 260 million people, swahili by 100 to 150 million people. So over time this will improve or the whole of Cardano is fruitless if it weren't. The advantage of blockchain basics & education is that it stays the same, so the What is/Why is program will remain relevant. Cardano news will vary, and Cardano itself will evolve. Off course the information regarding Cardano will need to be updated in due time. It is clearly proven and stated that you can not look at this project in the short term ( 1 year ). The onboarding of governement deals by the Cardano Foundation will determine where the biggest boosts in interest will arise. So the goal of the project is to start with the basics, and after all that is done we can think about more detailed varying news in African languages. First you need channels with lots of content before you can start promoting and marketing it. Information is also given on our website about the further plans of the Langbassadors, namely blockchaintranslation.io with also the information and articles in written form + a soundcloud account with all the narrations."}, {"q0": "The proposal clearly highlighted a problem and provided a clear solution which is both beneficial to Cardano and Africa/World  too.\r\nThis is an amazing proposal and much needed coming from Nigeria and seeing this language barrier problem first-hand.\r\n\r\nI strongly Agree.", "q0r": 5, "q1": "Good experience was displayed and presented with verifiable links and a clear implementation plan was offered with a breakdown of costs. Great work by the team.\r\nI strongly Agree.", "q1r": 5, "q2": "The proposal presented a good Timeline, Milestones and cost breakdown that can be easily followed to audit the progress of the project and its success.\r\n\r\nI strongly agree.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "Education in a native african languages is a great way to enable mass adoption in the african continent. The idea is very good but I would like the proposers to focus on one language per proposal and per youtube channel. The fact is that creating content and growing a youtube channel are not easy tasks. So trying to build 12 of them can be confusing and to hard to achieve.", "q0r": 4, "q1": "Since the team already built this type of content in previous funds, it is more likely that they replicate the same work. I think that this proposal can be implemented based on the details provided.", "q1r": 5, "q2": "This proposal has a detailed budget and a clear roadmap. The community know exactly what to expect. So I think that this project is auditable.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The proposal very well meets the main objective of the challenge, which is to take Cardano to Africa, in order to benefit its inhabitants with the advantages and possibilities of the blockchain and also gain new followers to the ecosystem. This is because the idea here is to create a series of media content that explain different themes that relate to the Cardano universe, and translate them into different languages ​​spoken on the African continent. In this way, the language barrier will be broken down, which makes the proposal also dialogue well with the \"Multilingual Resources\" challenge, and it will be much simpler for speakers of other languages ​​to understand and thus enter our community. Another point that I found positive was that, in addition to translating, the author of the proposal showed that the team intends to simplify and summarize the contents, which is extremely important to facilitate the understanding of people who have not had prior contact with the community's activities.", "q0r": 5, "q1": "We are not told who the team members are, in a detailed and individual way. We know that he is a screenwriter, two animators and an English narrator, as well as translators for African languages. Although they have already started this work in fund 5, as they say, it would also be important to know who these permanent team members are. That would make people, like me, who didn't evaluate this proposal in the previous background, to understand better who they are. It would be positive if, in addition to a more detailed description about the team members, the link to the f5 proposal and some videos already produced were attached to this proposal, so we could see what has already been released. The proposal does present a well explained action plan, with some steps to be taken and explanations about new translators to be hired, giving us a solid vision of what is to come, as I will detail in more detail in the comment below.", "q1r": 4, "q2": "We are aware of various specific information, such as how many videos will be produced, which languages ​​will be translated, which translators have already been found and which will still be hired... We also know how the funding money will be distributed , and when you see me, it will be in a very fair way, with a good payment, but not exaggerated, for each member of the team. Although we have a good amount of information, which helps us to understand well what will be done and how, and with that follow the progress of the project, some things not mentioned were missing. For example, how often would such content be released? We know they have funding until November, from f5, but we don't know how long the videos would be produced if they got the funding. It would be important to understand how far the project would go in terms of time, because the amount of content produced we know, but not at what interval they would be released, and with that, until when. Another thing I thought would be important for us to know is where these videos would be made available (besides youtube), and also how they would be released to the target audience. For these reasons, I think the auditability is good, but it can improve.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 12, "ne": 4, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "The audibility score seems strange : we have a clear time frame mentioned in which the videos will be released, those are the KPI's mentioned in the proposal. So if you want to know the average interval you can divide the number of videos by the times in which it is attained. The length of the videos/animation has nothing to do with auditability but depends on the content. We aim for animations that are short enough yet complete. The example animation 'What is Blockchain?\" is 4 minutes 20 long"}], "solution": "一般的なブロックチェーン教育、暗号リスク防止、ADAニュースを母国語で提供する、オープンなYouTubeとメディアチャンネルのチェーンを作る", "experience": "Rikは1991年に経済学修士号を取得し、25年間のB to Bセールスの経験と6年間の起業家としての経験、そしてFund 5の受賞者でもあります。"}