{"id": 369587, "author": "", "title": "Employment Contract Dapp", "url": "https://cardano.ideascale.com/a/dtd/369587-48088", "category": 26108, "amount": 600, "description": "開発途上国では正式な契約がないため、雇用者と従業員の両方が搾取される可能性があります。", "f6_no_assessments": 3, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal clearly highlighted a problem but the solution to the problem will require more research and details.\r\nFor example , what country in Africa will the initial project will be tested? what are the position of the legal authorities position on blockchain agreements. As someone in Nigeria, believe the biggest challenge to this solution is the local regulation and laws towards a blockchain based evidence .\r\nThe legal problem will have to be first tackled and it wouldn't be a trivial task.\r\nI disagree.", "q0r": 2, "q1": "Given experience in this field is  not presented with verifiable links.\r\nIt is highly unlikely that this will be implemented considering the huge task of research local legal regulations in various territories.This Solution will require more details and planning.\r\nThis is not a solution that can be research at Oxford, it will require ground work and a serious one, therefore the requested amount is grossly understated..\r\ni disagree.", "q1r": 2, "q2": "The proposal presented some useful information to audit the progress of the proposal but as stated above,There seem to be a disconnect between the presented problem and the proposed solution.\r\n\r\nconsidering the above , i can neither agree or disagree that the proposal can be audited .", "q2r": 3, "assessor": "z_assessor_331", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "This CA assessment misunderstands that this proposal concerns a research agenda. It is not a request for funding to develop an entire platform of dApp. "}, {"q0": "The challenge is well stated. The solution proposed - Employment Contract Dapp is possible to remedy the problem but some kind of background legal enforcement should be in place before that. \r\nThe lack of formal work contracts bad practice is unlikely to be changed if simply a new type of digital contract is introduced as an option. The unwillingness of employees/employers to sign a paper work contract wont change if there is a new digital contract type to sign because they are unwilling to do it in first place.\r\nHowever - even the largest problems can be started to be tackled step by step. So - the Dapp idea can be a first stage in that process if it is accepted in at least 2 or 3 local employers.\r\nI would suggest the proposal to be changed after initial talks are being made with some employers that are willing to accept such an approach for electronic contracts. This would allow the smart contract to be customized to the specific needs and include for example the \"payment when work-hours are fulfilled\" or \"payment after delivery of goods\", which are very progressive ideas in principle!\r\nI would give 4 stars \"Agree\" to the impact assessment recognizing that if such a Dapp works in small scale (2-3 companies) it can work for the whole world. ", "q0r": 4, "q1": "Unfortunately the budget, the timeline and the previous experience of the proposer at this stage doesn't really bring too much confidence. USD 600 for 20 hours of development is quite insufficient for such a task I presume. Not to mention the \"Established contact with some companies willing to use it\" stage which may well take weeks to accomplish on its own.\r\nAgain - It might be advisable to do some more work on the project and present it again to be more feasible and acceptable. Possible additions are:\r\n-establish the contacts with willing companies;\r\n-identify the needs of those companies and what could hook them to the idea;\r\n-involve at least one developer in the team to tackle the above and make a more realistic budget/timeline. ", "q1r": 2, "q2": "The timeline of the project implementation consists of 3 months, 6 months and 12 months from the start, but these describe the deliverables, not KPIs that can be used to keep track on the progress. Since it is a Dapp development proposal - it maybe needs a way to shown the progress of the code written.\r\nUnfortunately here I would also disagree that the information is sufficient for the progress to be auditable.", "q2r": 2, "assessor": "z_assessor_408", "no_vca": 10, "ne": 3, "ng": 3, "nfo": 4, "vca_o": 1, "reply": "The Feasibility Note is well-written and constructive, but it fundamentally misunderstands that the proposal only concerns funds for further research, as is clearly outlined in the budget section. Similarly, it is clear from the Auditability Note that the timeline has been misunderstood. The timeline is does not refer to what is expected to be achieved from the money received in fund6. However, it is understandable that this is their interpretation (given that all other proposals are using the timeline in this way). I should've been much more clear on this point and perhaps not even included a long-term timeline even if doing so was recommended in the proposals guide. "}, {"q0": "This project will improve options for both employers and employees and enable the shifting of the power dynamics in the new ways of work hence minimising exploitation.", "q0r": 5, "q1": "Very passionate experienced team, however for the success of the entire venture, the team needs to expand in diversity and size to allow for new ideas and innovations to make it long term for the changing market needs.", "q1r": 3, "q2": "The project does not have enough documentation and information access for the community to follow and support it.", "q2r": 4, "assessor": "z_assessor_468", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Jobb Dappは、雇用者が従業員との契約を設定するためのプラットフォームを提供しており、雇用者は確実に条件を設定することができます。", "experience": "オックスフォード大学で経済学を専攻。"}