{"id": 369579, "author": "", "title": "Fair Pricing for Ethiopian Coffee", "url": "https://cardano.ideascale.com/a/dtd/369579-48088", "category": 26108, "amount": 90000, "description": "エチオピア産コーヒーのトレーサビリティーの欠如", "f6_no_assessments": 4, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a well written proposal that highlighted the problem of Coffee manufacturing traceability in Ethiopia  and well written solution leveraging the Cardano blockchain.\r\nThis proposal solves real world problems consumable product traceability and can be useful for other scenarios other than Coffee(https://www.baiaswine.com/).\r\nI strongly agree the proposal address the challenge .", "q0r": 5, "q1": "The proposal did not provide given experience with a verifiable link but the implementation plan clearly indicate a degree of knowledge in the solution space.\r\nThe proposal did a great job of splitting the execution plan of the solution into phases and it would have been more helpful to the proposal , if the plan is split into several funding circles to accommodate funding other projects and improves the chances of the project being funded  as regards to the requested $90000.\r\nAn example is to apply for only funding for phase 1 (First year) of the project which from the proposal breakdown totals $60000 and further request for additional fund in subsequent funding rounds when the first phase plan has been executed or almost completed.\r\nI agree that the proposal presented given experience and implementation plan for the proposal to be successfully implemented.", "q1r": 4, "q2": "The proposal provided has detailed milestones, timelines and cost breakdown but the cost breakdown would be more helpful  if it it broken down more to match exact execution cost implications considering the amount requested ($90000).\r\nI agree.", "q2r": 4, "assessor": "z_assessor_331", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This problem identified in this proposal can be a good fit in this challenge. Being able to track the Ethiopian sypply chain can be very beneficial for Africa. But the proposer failed to mention clearly how it will benefit the the Ethipians and the cardano ecosystem. As an African, I think that this is a good idea in general, but the proposal missed the precision needed to be great. KeyMetrics are missing in this challenge and the solution is not enough precise. I think that this proposal has a lot of potentials if the proposer can create a precise solution and a detailed plan.", "q0r": 4, "q1": "The implementation of this proposal seems problematic as there are not enough, or more precise information on the team, the budget and the roadmap. There is a lack of information about the team. The proposer could provide links of the team members. This information is missing. The budget breakdown is not precise, and the roadmap is not very clear. Also this proposal lacks a clear solution of the problem. Their not a precise plan that is outlined. ", "q1r": 3, "q2": "This proposal contains a roadmap but the items provided are very vague. I suggest that the proposer provide a more detailed roadmap. Also , the KPIs are missing in this proposal. Also, I have noted that the problem and the solution of this proposal lack clarity. This means that, there is room for improvement for this proposal, as the general idea is pretty good. But for the time being, this project doesn't contain sufficient informations, to be audited properly.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal does identify a problem within the challenge and if solved would provide economic benefits as a result of verified credentials. In this certain proposal those verified credentials would be of Ethiopian coffee beans/coffee. It unfortunately though does not go in direct detail how this would benefit the Cardano ecosystem. Assessors can only assume if Cardano's traceability solution is adopted by this particular proposer, there perhaps might be further adoption by their various counterparts. Their goals though does align with the spirit of \"Grow Africa, Grow Cardano\", based on the general information provided it should be scalable.", "q0r": 4, "q1": "This proposal unfortunately does not provide any further details on the proposers background that can correlate with the blockchain solution he/she is offering. This translate on the proposers inability to clearly define who are the underlined traceability team or the developer team. The budget requires additional in-depth explanation to be able to given a higher rating. This has a domino effect which assessor tends to categorize the budget near to unreasonable, most specifically the ones related with the travel expenses and developer teams. This proposal also does not provide any technical explanation or the potential challenges and risk that might be faced.\r\n", "q1r": 1, "q2": "This proposal tends to be not auditable but is highly encouraged to reiterate and please come back again perhaps after coordinating with Catalyst School to learn on writing proposals, WADA to build relationships with their fellow African connections and after finding further collaborators. Assessor also recommends for the proposer to build relationships with the Emurgo team most specifically from Indonesia who has already a running protocol that tracks coffee beans from plantation to end consumer(s).", "q2r": 1, "assessor": "z_assessor_635", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The proposal presents a big challenge about agriculture in general while focusing on a specif coffee supply chain in Ethiopia. It is a very important area for developing countries as the supply chain is highly inefficient and abuses farmers and nature. \r\n \r\nWhen I was at Earthwrom.org, I worked for a couple of years on the agriculture supply chain including coffee and I am well aware of the importance of such a solution but also of its complexity. \r\n\r\nIt is great that the proposal considers how to pilot the model, scale it in one country and then share the knowledge with other countries.\r\n", "q0r": 5, "q1": "While the proposal deal with a very important area, some information is missing about the feasibility of the project. \r\n\r\nIt makes sense to have two teams one traceability team and one developer team. But there is no information about either of the teams, their background, and the relevant experience. The team is probably the most important factor for the feasibility of the project and with general information, it is difficult to evaluate. \r\n\r\nThe plan vs. the idea makes sense and especially it is good that you start focusing on one region. I worked with many startups (i.e. mentoring at seedstarts.com or givingway.com) and focus is very important and will help to make team, plan, budget all aligned. \r\n\r\nThe budget has the main elements in it but it is difficult to assess as it does not show how ten budget was calculated. For example, explain how did you reach 25k for the traceability team in terms of numbers of people/month/salary. What does 10k for travel refer to? And so on. \r\n", "q1r": 2, "q2": "Roadmap and timeframe make sense but again they are presented in general terms. It will be helpful to have clear deliverables associated with each milestone and budget. For example, what will include the deliverable in detail of the blockchain infrastructure? \r\n\r\nClear KPIs will also be helpful. For example, how many farmers, cooperative, and traceability entities do you plan to work within each timeframe. This will be a straightforward KPI that will help to evaluate and measure the progress.   \r\n\r\nFinally, it will be important to have a section of challenges and risks, which from my experience there are many across such a supply chain. \r\n", "q2r": 2, "assessor": "z_assessor_636", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "コーヒーの生産者から最終消費者までを追跡し、その地理的起源の品質、評判、価値を保証するシステム。", "experience": "原産地呼称保護のためのアドバイス、エチオピアのコーヒー栽培における持続可能な国際認証のコーディネーター。"}