{"id": 370101, "author": "", "title": "Locating Culture", "url": "https://cardano.ideascale.com/a/dtd/370101-48088", "category": 26108, "amount": 3420, "description": "成長過程にある地域の文化資源をマッピングすることは非常に重要ですが、グランドトゥルースとロケーションベースの画像がなければ困難です。", "f6_no_assessments": 7, "f6_rating": 1.761904761904762, "videos": [], "media": [], "f6_assessments": [{"q0": "There is no real plan in this proposal on what will be delivered or how it will be delivered.\r\nThis proposer has proposed or co-proposed a number of other project with little details and/or funding requests such as:\r\nPharo ACM - $1\r\ndRisk - $5\r\nProof of Insurance - no details\r\ncommunitybond.io Integrate- no details\r\nCommunity Bond -Loyalty Rewards - no details\r\nCommunity Bond - Metadata - no details\r\nTrade Finance and Credit Insurance - minimal details\r\nEndangered Language Preservation - no details\r\nNAGchi - no details\r\nNAGchi Cares - no details\r\n", "q0r": 1, "q1": "\r\nPlease provide a plan so that it can be evaluated. As it stands, there is not plan so it cannot be implemented successfully. Given the widely varying experience quoted in all the other proposal submitted, some evidence should be provided.", "q1r": 1, "q2": "No timeline or clear deliverables have been mentioned thus making it hard to audit. The proposer has not defined what success would be. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This proposal really has a real world use case but the proposal fails in explaining the Solution to the problem it want to solve and how it will be beneficial to Cardano.\r\nConsidering the lack of Solution details, i can neither Agree nor disagree that the proposal address the challenge.", "q0r": 3, "q1": "The proposal did not provide any evidence of expertise with a verifiable link.\r\nLacks key metrics, Lacks any implementation plan and timelines.\r\nThe proposal at its current state is at best a draft as it lacks enough details to be considered a completed proposal.\r\nThere is no cost breakdown, justification for the requested amount and how it will be used.\r\nConsidering the above , I do not agree that this proposal will be implemented successfully.", "q1r": 1, "q2": "The proposal do not have any timelines or milestones that can be used to audit its progress.\r\nIt cannot be audited.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Draft proposal. What would be \"mapping cultural resources\"? It is not clear what problem the proposal intends to solve and how this relates to the challenge. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "The idea is not well articulated. It is really difficult to understand what exactly the proposer wants to build and how. Besides, I don't see how this will benefit the cardano ecosystem. I suggest that the proposer give us more informations about his idea. ", "q0r": 3, "q1": "This proposal doesn't contain a plan  to execute the idea. The idea on itself is not clear, so implementation will be an issue. ", "q1r": 3, "q2": "The proposer has not provided any budget breakdown or KPIs. This project is not auditable based on the informations provided in this proposal.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does not really fulfill gormal requirements. While the idea sounds nice, it is not really shown that this is an actual planned project.", "q0r": 2, "q1": "It is highly unlikely this will be set in action. The proposer keeps proposing things without proper plans behind them. No milestones or budget rationale.", "q1r": 1, "q2": "There is not really any metrics here, so nothing to Audit.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does not address how we can grow and seed cardano in Africa. It states there is a problem mapping cultural resources, but it does not state how it will leverage cardano to solve that problem and how it can grow cardano in africa.", "q0r": 1, "q1": "They state no info on their team besides a bullish claim with satellite imagery experience. They do not lay out any sort of plan to solve this issue or how to grow cardano in africa. No info on budget or any key metrics. Just state they will record social events and use NFTs", "q1r": 1, "q2": "This proposal does not provide suffecient information to audit the progress and success due to the fact there is no plan, statement of how the problem can be fixed, or even how this addresses the current challenge setting. No info on key metrics or intended use for budget.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This conice proposal effectively addresses the challenge of grow Africa, grow Cardano. Africa is the cradle of civilization and has a rich Cultural history. This project could help preserve significant sites and expand Cardano's footprint in the continent. Win, win! ", "q0r": 5, "q1": "The experience listed is impressive \"15 years aerial and satellite imagery acquisition, 7 years combined in blockchain, currently completing a Masters in Blockchain Technology\" and gives me confidence that this proposal will be implemented successfully. The details on the reward system for using mapping devices and how NFT technology will be incorporated is lacking.", "q1r": 3, "q2": "There is no 3, 6, 12 month timeline listed with goals set to track progress. There is no breakdown of how the requested funds will be budgeted and utilized. This makes it difficult to track the progress and success of the proposal. The end goal is stated \"Using photography and recording of social events, we will create a living archeology of culture, NFTs as cultural preservation methods.\", but the details on how to achieve this goal are not sufficiently provided. ", "q2r": 2, "assessor": "z_assessor_68", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "paypixlは、地図データを必要とする地域での画像収集作業を、対応するデバイスを持つユーザーに割り当て、ADAを持つユーザーに報酬を与えます。", "experience": "空中・衛星画像取得に15年、ブロックチェーンに合わせて7年、現在はブロックチェーン技術の修士号を取得中"}