{"id": 382611, "author": "alexp7", "title": "Token Allies, Latam Businesses", "url": "https://cardano.ideascale.com/a/dtd/382611-48088", "category": 26242, "amount": 25000, "description": "Na América Latina, é muito difícil para as empresas e start ups ter acesso rápido e fácil ao financiamento, impedindo que muitas grandes idéias sejam reais.", "funded": 2, "upvotes": 80821156, "downvotes": 2655313, "votes_result": 78165843, "votes_cast": 199, "f6_no_assessments": 6, "f6_rating": 4.5555555555555545, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=19879"], "media": [], "f6_assessments": [{"q0": "Esta proposta estava presente, se não me engano, na f6, mas o objetivo era apenas criar uma plataforma que facilitasse a gestão de fichas pelas empresas. O objetivo atual seria ajudar os pequenos empresários/empresas a financiar seus negócios através do crowdfunding. O autor problematiza bem o contexto do problema: A América Latina é um território muito extenso e diversificado, é difícil se destacar e também começar do zero, não há muitas oportunidades de financiamento e as pequenas empresas precisam de ajuda para se desenvolverem bem. Portanto, penso que a idéia de criar uma plataforma que possa ajudar as empresas a criar/vender/gerenciar suas fichas é muito relevante, e isso certamente beneficiaria o ecossistema Cardano, pois aumentaria a circulação de ativos cunhados em nossa cadeia de bloqueio. É positivo que os autores expliquem como seriam capazes de utilizar suas plataformas: não apenas para um único público, mas para start ups e investidores em geral. Eles também estão preocupados em deixar bem claro como a proposta atinge os objetivos do desafio: promover o investimento na ADA nos empresários latino-americanos, beneficiando ao mesmo tempo o continente e Cardano. Creio que é uma proposta que atende muito bem ao que foi solicitado.", "q0r": 5, "q1": "A dupla de autores parece muito bem preparada para realizar este projeto, eles nos fornecem informações muito detalhadas e variadas sobre quem eles são, o que fizeram profissionalmente até agora, suas conexões com a cadeia de bloqueio Cardano (que são fortes, o que é um ponto muito positivo) e seus perfis interligados, dando-nos a oportunidade de conhecer ainda mais sobre seu trabalho. Com isso, temos total confiança em sua preparação para executar com sucesso esta proposta. Através dos tópicos \"marcos gerais\", podemos ter uma noção de como ocorreria o processo de desenvolvimento deste projeto. No entanto, achei esta informação muito superficial, os autores passam muito tempo falando sobre a necessidade de sua iniciativa e também como os Aliados Token, o modelo de redução pela metade e de compromisso, etc., funcionariam. Mas, infelizmente, eles não prestam tanta atenção ao roteiro. As atividades são divididas em 3 fases, que são o trimestre de 2022, mas não há uma explicação aprofundada de cada etapa, pelo contrário, temos apenas uma frase explicando o que seria feito... Mas precisaríamos entender os detalhes, tais como, a ordem das coisas, quem faria o quê, subtópicos que eu diria. Não é possível ter uma boa visualização do processo com base nos detalhes fornecidos. E sobre a divisão financeira, creio que também havia falta de detalhes. Por exemplo, há uma parte que os autores dizem: \"-$7.000 irão para os custos do servidor, serviços jurídicos e marketing\". Quanto iria para cada coisa? É porque? Que serviços jurídicos seriam necessários? Como as estratégias de marketing ocorreriam e por que elas custariam quanto? Acredito que não faltam detalhes quando se trata dos salários dos envolvidos porque as informações já são auto-suficientes, mas neste segundo tópico, sim.", "q1r": 3, "q2": "Esta parte da proposta foi muito bem coberta, os autores estavam preocupados em estabelecer métricas de sucesso e KPIs, portanto temos informações precisas a serem analisadas em auditabilidade. Acho que seria interessante se a equipe apresentasse os resultados parciais à comunidade, como o lançamento da versão beta da plataforma, e aos poucos trouxesse cada vez mais esse feedback; precisamos entender exatamente se o financiamento prometido foi cumprido, se os empresários latino-americanos foram, de fato, beneficiados, em outras palavras, se a plataforma está tendo um funcionamento adequado. Outra forma de medir como a proposta estava se desenvolvendo seria através do contato direto com empresários e investidores: esta iniciativa teve um impacto real em suas vidas? se sim, de que forma? O que poderia ser melhorado? Também seria interessante para a comunidade Cardano, especialmente na América Latina, utilizar o portal e testar em primeira mão se tudo o que foi planejado foi entregue. Portanto, creio que sim, é uma proposta altamente auditável.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 18, "ne": 11, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal addresses directly the challenge. If this model proves to be successful, it could be implemented on global scale, as a funding platform for small/private businesses. ", "q0r": 5, "q1": "All information provided, including full deployed project web site, are easily accessible from the proposals page.\r\nThe initial token listing and the platform prototype is expected to be developed in January 2022.", "q1r": 5, "q2": "The examples of metrics to be taken into account for auditing the projects seem comprehensive, streching from Q1-Q3 2022.\r\nI agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The issue being it is tough for startups and businesses in LATAM to get access to the funding and it is stopping many great ideas being real. The proposer will be providing a platform from which startups and businesses in LATAM can Create manage and sell their own business tokens. This proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer's team have experience doing business in Latin America and have enough knowledge about the field. They have also provided a complete plan on how the proposal will be implemented. They have also given a complete roadmaps each will time targets. With all these details It will very much possible the proposal will be implemented successfully", "q1r": 5, "q2": "The prosper has provided the Milestones to achieve within the time period. Also given a detailed budget allocation for each expenses with key performance indicators. The proposal also consist of step by step timeline hence all these information should be enough to track the success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 19, "ne": 4, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This token allies proposal will provide a platform for  Latin America Businesses to raise fund by letting them create, sell and manage their own tokens. This will help to increase adoption of Cardano in Latin America.", "q0r": 5, "q1": "The 2 proposers have a great mix of experiences. Lucas liaise with Latin America businesses and Alex has experience in develop technical solutions and an active community member in Catalyst. I would give them 5 star if they address about potential risk and challenges they will face. They mentioned about  halving and pledging of businesses on the platform which is great to protect the investors who give their pledges to businesses.", "q1r": 4, "q2": "The KPIs and roadmap are mentioned in the proposal. I would appreciate more detail breakdown, for example, the Allie coins will be launched in Q1: how much is the funding will go towards making that happened. What would be the extra features that they will introduce in Q2 and how much would that cost. It would give the community more confidence to track the progress and see it through the success of this proposal. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal sets out to make it quick and easy for businesses and startups in Latinamerica to access capital. It can be added that this has a positive impact on the Cardano ecosystem. Provide a platform where businesses and startups from Latam will be able to easily create, manage and sell their business tokens. Problem and solution statements are reasonable and within the scope of the challenge.", "q0r": 4, "q1": "This is a proposal that quality and enthusiastic team members who can successfully achieve their goals in my opinion\r\nThe plan is presented in a really optimal way, it is very likely that this proposal is successfully implemented in the way that the proponents describe. There is no doubt about the success of the proposal, what they demonstrate what they do, what they do. I completely agree with this suggestion.", "q1r": 4, "q2": "Proponents provide a clear definition of success and a roadmap with milestones. Clear launch date and roadmap with milestones\r\nIt's good that the recommendation team included some pretty useful KPIs to allow us to see how helpful previous work was. The data provided can easily be made available to test and monitor the process in promises\r\nThe stated budget is reasonable enough and it makes me completely agree that the team is competent enough to tackle the challenge. Clear and reasonable budget allocation", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "The solution is not so different from Cardano Funding Platform: provide crowdfunding for all, provide ADA for ideas that proves potential. However, it might be a good way to make Cardano Catalyst community more popular in LatinAmerica.", "q0r": 3, "q1": "The team members have relevant experience and show their enthusiam in the proposal (The proposal is very well-written and informative). It includes information about each team member, road map in detail etc. They even plan for the longterm, which shows their vision for the project. Their LATAM business and community is a good resource that they can make use of.", "q1r": 5, "q2": "The Road Map and KPIs are very detail. It makes the project become easy to audit the progress and measure the success.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "Nosso objetivo é fornecer uma plataforma onde as empresas e start ups da LATAM serão capazes de facilmente criar, gerenciar e vender seus tokens comerciais.", "experience": "2 sócios argentinos. Fazem negócios na LATAM há muitos anos, com experiência em situações de restrição. Membros catalizadores ativos."}