{"id": 384118, "author": "ecomchaco", "title": "ATALA Prism in Chaco", "url": "https://cardano.ideascale.com/a/dtd/384118-48088", "category": 26242, "amount": 24000, "description": "Identidade digital e validação de certificados educacionais em espanhol.", "funded": 1, "upvotes": 36386215, "downvotes": 14944128, "votes_result": 21442087, "votes_cast": 138, "f6_no_assessments": 5, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta é uma excelente proposta que dá um bom impacto para a comunidade argentina. Primeiro, ela gostaria de criar uma certificação digital usando Atala PRISM em colaboração com seu ministério da educação. As aplicações que gostariam de ser desenvolvidas, poderiam ser úteis em outras partes do mundo e poderiam ser copiadas. Em segundo lugar, esta proposta agregará valor ao ecossistema Cardano ao implementar a tecnologia Atala PRISM e, portanto, aumentará a adoção na comunidade local (Província do Chaco, Argentina). (Classificação dada: 5)", "q0r": 5, "q1": "Seria ótimo se o proponente pudesse incluir os perfis LinkedIn de seu principal membro da equipe. Eu verifiquei o perfil de seu website (ECOM Chaco SA) e da empresa LinkedIn. É bastante válido. Gostaria de saber se alguns de seus membros fazem ou não parte do 1º Programa Pioneiro Atala PRISM de coorte. Caso contrário, talvez eles possam tentar participar do 2º coorte do Programa Atala PRISM Pioneer para obter algum conhecimento sobre o SDK e obter apoio da equipe IOG.\n\nO orçamento e o número de homens que trabalham estão bem descritos na Folha do Google. O fundo solicitado é aceitável para este desafio; na verdade, eles poderiam pedir mais, considerando o escopo. Por outro lado, a proposta está faltando no roteiro técnico detalhado, como por exemplo: o que eles construirão/entregarão a cada mês. Por exemplo, o que eles construirão/entregarão a cada mês: UI/UX, backend e produto final, em vez de dizer apenas \"15.000 Certificados educacionais gerados nos primeiros 3 meses\".\n\nA proposta também falta um plano de condução para implementação que mostre não apenas o que está sendo feito, mas também como. Gostaria de saber qual linguagem de programação eles usarão, como se conectarão com o Nodo Atala PRISM, e talvez acrescentar algum gráfico simples para explicar como sua aplicação irá funcionar em geral. Além disso, o proponente não considerou os desafios e riscos que enfrentarão durante a implementação do projeto se forem financiados. É bastante útil para a comunidade, saber quais são os riscos/desafios que podem aparecer durante a implementação. (Classificação dada: 3)", "q1r": 3, "q2": "Não consegui encontrar nenhum KPI/métrico nesta proposta. A adição de um KPI que poderia ser facilmente rastreado pela comunidade acrescentará mais auditabilidade. Outro ponto, talvez o proponente possa adicionar GitHub ou qualquer link, para que a comunidade possa acompanhar o progresso do desenvolvimento ou produto.\n\nTornar o roteiro mais detalhado com marcos específicos poderia dar à comunidade Cardano uma melhor compreensão do que o projeto alcançará a cada mês. Em conclusão, o progresso desta proposta é bastante difícil de ser avaliado pela comunidade sem essas informações adicionais. (Classificação dada: 3)\n", "q2r": 3, "assessor": "z_assessor_282", "no_vca": 28, "ne": 17, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "O impacto desta proposta está muito de acordo com os objetivos do desafio. A idéia é criar um sistema, em espanhol, onde as pessoas que possuem certificados digitais possam interagir e tirar proveito das tecnologias de identidade descentralizada do Atala Prism. Isto certamente beneficiaria tanto os portadores de certificados, ou seja, os habitantes do continente latino-americano, proporcionando-lhes todas as vantagens que nosso sistema de identidade descentralizada pode oferecer; quanto seria ótimo para Cardano uma vez que um número de novos usuários seria integrado. Isto é interessante porque ocorreria um tipo de migração, ou seja, pessoas que não conhecem necessariamente Cardano e acreditam na cadeia de bloqueio teriam contato com o Atala Prism sem necessariamente terem que ser \"convencidas\" a fazer tal coisa, acreditar em seus benefícios, etc. Como a cadeia de bloqueio Cardano é algo relativamente novo e pouco conhecido, especialmente no lugar em questão (América Latina), uma grande parte do trabalho é muitas vezes introduzir as pessoas no ecossistema e educá-las sobre suas diversas vantagens. Como o público alvo aqui já está envolvido em outro sistema de certificados digitais, a migração ocorreria de forma mais orgânica e sem a necessidade de grande divulgação. Isto para mim é um ponto positivo e uma maneira mais prática de trazer novos usuários para Cardano - através de uma migração, e isso certamente fará com que novas pessoas fiquem e talvez até recomendem o Atala Prism a conhecidos. Por estas razões, vou dar a ele uma pontuação máxima em termos de impacto.", "q0r": 5, "q1": "É um pouco difícil de entender de forma profunda quem está envolvido aqui. Sabemos que esta é uma empresa com participação estatal, a Ecom Chaco. Sabemos também que existem cerca de 15k certificados que eles já geraram, provenientes de estudantes da província argentina à qual pertencem, e que estes certificados são armazenados em 3 locais diferentes. No entanto, não é possível conhecer as especificidades daqueles que trabalham na Ecom Chaco. Quem são os profissionais e o que exatamente eles fariam neste projeto? Como são suas rotinas de trabalho? Entre todos os envolvidos no Ecom Chaco, quem trabalharia neste projeto? Infelizmente, a idéia que temos sobre a empresa é muito geral. Seria mais interessante se as informações individuais sobre cada pessoa envolvida na proposta fossem disponibilizadas. Isto certamente aumentaria o grau de confiança em seu trabalho, pois, na situação atual, não sabemos como eles seriam capazes de preencher a lacuna entre sua empresa e Cardano. Na planilha disponível, pudemos saber que haveria 9 profissionais envolvidos, de várias áreas, incluindo dois desenvolvedores de cadeias de blocos. Mas não é possível entender se eles já têm pessoas definidas para cada cargo ou se ainda seriam selecionados. Idealmente, eles seriam apresentados, como eu disse anteriormente, principalmente desenvolvedores de blocos - como garantir que eles tenham a capacidade técnica para integrar o Atala Prism aqui? Uma sugestão também: subtítulo do vídeo anexo, que está em espanhol, a maioria dos eleitores CAs, vCas e Catalyst não entendem o idioma. Sobre o roteiro, ele é bastante superficial, a única coisa que sabemos é quantos certificados são destinados a gerar por trimestre. Mas seria essencial entender que pequenas tarefas seriam realizadas mensalmente para obter tais produtos. Não é possível entender o processo, apenas os resultados esperados. Infelizmente, isto não é um grande roteiro. E quanto ao orçamento, infelizmente achei confuso. A planilha anexa tem um total de (aproximadamente) mais de 4 milhões, acredito em pesos argentinos, que convertidos seriam de aproximadamente 24k dólares. Mas seria melhor se eles colassem uma legenda esclarecendo esta conversão. Além disso, é possível entender claramente como o dinheiro seria utilizado, basicamente, seria o salário dos profissionais envolvidos, dividido em um tempo por meses. Em resumo: no pessoal e no roteiro, acho que é preciso melhorar, mas no orçamento, apenas um esclarecimento em relação à conversão de moeda foi o que achei necessário.", "q1r": 3, "q2": "Infelizmente, não é possível auditar esta proposta, pelo menos não vejo nenhuma maneira clara. Os autores não têm nenhuma informação sobre como monitorar o desenvolvimento do projeto. A única coisa que se aproxima é que eles nos dizem quantos certificados são esperados ao longo do tempo. Então é a única maneira de monitorar - essa quantidade foi gerada? Mas isto é muito superficial. Eles não estabelecem KPIs, ou seja, maneiras de monitorar diretamente se os resultados prometidos foram alcançados ou não. Como também não existe um roteiro, não há possibilidade de monitorar se as atividades propostas estão realmente sendo desenvolvidas e de forma adequada. Basicamente, tudo o que nos é dito na proposta é: o que seria feito, quanto dinheiro cada profissional receberia mensalmente e o número de certificados digitais esperados a serem gerados a cada trimestre. Isto torna possível rastrear apenas uma faceta quantitativa - também foi fundamental olhar para as coisas de uma forma mais qualitativa. Em geral, não está claro como seria esta integração com o Atala Prism. Sugiro que os autores elaborem KPIs, esclareçam mais sobre tal ponte entre o que eles já fazem e Cardano, e um roteiro específico de tarefas a serem cumpridas. Com isso, seriam geradas formas qualitativas de auditoria do projeto.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 26, "ne": 17, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "It is the objective of the project team to develop its own interface with ATALA Prism which will be implemented in a region of Argentina. Specifically, they are looking for a way to validate digital identities and documents for educational institutions. They plan to issue 50,000 document certificates within the next 12 months. In addition to being of great value for Latin America, this would also be yet another successful application for Cardano in the implementation of DIDs. The alignment with this challenge's objective is evident to me.  \r\n", "q0r": 5, "q1": "Positively, the team submitted a file containing a detailed explanation of the budget items. Analyzing these figures, I only have a doubt that the same amount is allocated to the front-end developer and to the blockchain developer. I would appreciate it if the team had addressed this concern. Unfortunately, the team fails to provide all of the necessary information to assess the feasibility of the project. For future Catalyst cycles, I would suggest several improvements: (1) Although a reference to an operating company is included, it is necessary to provide information about the individuals who will be participating directly in the project as well as references to verify their abilities. It is important that this information be included in the proposal. (2) It is noted that this company has participation in the state of Chaco. However, I consider it necessary to provide references where this claim can be independently verified; (3) It is essential that a concrete implementation plan be presented which provides a clear indication of what will be required to successfully complete this project.\r\n", "q1r": 2, "q2": "The team presents a roadmap that includes milestones at 3, 6 and 12 months along with 15,000, 30,000 and 50,000 certificates generated as success metrics. However, while I believe these to be appropriate, I think it is necessary to add some milestones, so that the community is able to track the progress of the project. An example would be the completion of the ATALA Prism integration, and the completion of UAT.\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The project is within the objectives of the challenge. Achieving the objective of his proposal would imply a great impact both on the adoption of Cardano and on the \"Chaco\" community.\r\nThe proposal could be scaled to all of Argentina, even with the difficulties of having to negotiate with each district. You clearly identify a problem in Argentina and you need resources to solve it. If this project is successful, it would put CARDANO on the politicians' agenda :)", "q0r": 5, "q1": "The proposal is highly likely to be successful. But it will depend on the agreement that is reached with the district authorities, although according to their website they provide solutions to large government projects. I can infer that they have the track record and experience to successfully achieve the objectives of a project of this magnitude.\r\nThe budget is reasonable and details where the funds will be used, that is ... it is auditable. ", "q1r": 5, "q2": "The information provided is clearly sufficient to audit the project ..... We can meet the team behind the proposal, it is a registered and operating company. They provide a roadmap, a work plan, a website.\r\nOnce the project is finalized, it would give the carding platform greater exposure to government authorities, the media and the general population.\r\nWe are facing a successful project, it only requires financing.\r\nGreetings.", "q2r": 5, "assessor": "z_assessor_743", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "Implementing an Educational Certification Identity System based on Atala Prism will impact the Cardano Community. The proposal focuses  on a province of Argentina , Chaco , which makes it align with the Challenge brief. I have accessed the proposed web url: Docentessie.chaco.gob.ar , the preliminary work done shows the team commitment on the Project.\nIn my opinion, having a state Government participation in the project is also aligned with Atala Prism's objective to  make  governments around the world  more effective, responsive, and agile with decentralized identity solutions.  I would suggest the team should look into Atala Prism Pioneer Program and possibly submit a proposal on Atala Prism specific Challenge for greater support from the community. If this proposal was on the Accelerate Decentralized Identity challenge , I would have scored 5 on Impact.\n", "q0r": 4, "q1": "The roadmap title on the proposal  addresses  milestones  on the number of certificates the platform will generate and definition of success of 3 , 6 and 12 months. But the actual roadmap of how the platform will be developed is lacking and no actionable step for the proposed  implementation.\n\nI would suggest the Team study the catalyst guideline and funded proposal to see the difference between a roadmap and a milestone/ definition of success.\nA project of this nature should concern about risk and challenges and proffer solution how on how to tackle to them to increase the feasibility\n\nThough there was no Team profile provided in the proposal, I can see Team details in the official page provided. The proposal did not describe the skills needed and the Skills of their team if there is a Cardano Developer among them or not. \n\n", "q1r": 3, "q2": "\nLooking into the Attached spreadsheet I can see the budget Items and amount allocated that makes up the total requested amount. Though there is the Definition of success after 3, 6 and 12 months which the team called Road map , There is no deliverable that the community can hold the  team accountable  to which would have enhance auditability and no  Key Progress Indicators in the proposal.\n", "q2r": 2, "assessor": "z_assessor_430", "no_vca": 24, "ne": 7, "ng": 16, "nfo": 1, "vca_o": 1}], "solution": "Desenvolvimento de interface própria para o Prisma ATALA", "experience": "Somos uma empresa com participação estatal no Chaco Argentina. Estamos trabalhando em Cardano"}