{"id": 384181, "author": "gonzalocamps", "title": "Test DAO at Latam Public Spaces", "url": "https://cardano.ideascale.com/a/dtd/384181-48088", "category": 26242, "amount": 24000, "description": "A adoção do Cardano pela LATAM evolui lentamente dada a fraca consciência e a tangibilidade insuficiente de seus usos para o cidadão médio.", "funded": 1, "upvotes": 28370420, "downvotes": 22929252, "votes_result": 5441168, "votes_cast": 120, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "A idéia é muito interessante e está muito de acordo com os objetivos do desafio, pois procura instalar monitores digitais em locais de grande circulação (localizados na América Latina), através dos quais o conteúdo relevante para o ecossistema Cardano seria disseminado. É ótimo que a equipe já tenha lançado a idéia na f6 e tenha recebido financiamento, isto transmite confiança em sua capacidade de executá-la com sucesso e também no próprio processo, ou seja, a idéia foi previamente avaliada e aprovada pela comunidade, portanto não vejo porque seu conteúdo de qualidade e suas necessidades tenham diminuído. É também muito positivo como a equipe forneceu o link para a proposta no contexto anterior. Acredito que esta forma de publicidade é muito eficiente para alcançar pessoas que não têm contato com o ecossistema Cardano, porque é difícil conseguir a atenção das pessoas e convencê-las a procurar mais informações como essa no início. Acho que vale mais a pena ir até elas do que promover campanhas que talvez convençam as pessoas e as pesquisas e se orientem para nossa cadeia de bloqueio. Além disso, há pessoas que não têm conhecidos que já participam do mundo criptográfico; para alcançar este público, em particular, é mais eficiente promover este tipo de publicidade \"antiquada\" do que planejar eventos, dApp que eles procuram atrair, etc. que provavelmente nem saberiam. Portanto, acho que é uma idéia que pode beneficiar muito a população local da América Latina, pois eles conheceriam as tecnologias relevantes para o ecossistema Cardano, e obviamente a própria cadeia de bloqueio como novas pessoas se juntariam.", "q0r": 5, "q1": "O roteiro é muito rico, eles decompõem as atividades com base em trimestres, embora eu sempre ache que é melhor para os autores fazer uma divisão de tempo menor (por exemplo, mensalmente), não acho que a divisão trimestral tenha sido um problema aqui. Acho que isto se deve ao fato de haver muitos detalhes em cada um dos trimestres, muitas atividades são listadas, de modo que temos uma rica compreensão do que está sendo feito. Entretanto, com relação à divisão financeira, acho que ela poderia ter sido mais detalhada. A equipe informa quanto dinheiro seria necessário a cada trimestre para realizar as atividades, mas seria mais interessante se esse dinheiro tivesse sido explicado individualmente a partir de cada atividade. Desta forma, teríamos 100% de compreensão de como o financiamento solicitado seria utilizado. Não é tão ruim assim, mas poderia ser ainda melhor na minha opinião. E finalmente, no que diz respeito à equipe, acredito que o nível de detalhes é bastante satisfatório, conhecemos os nomes de cada membro da equipe, suas principais funções profissionais e links para seus perfis vinculados, dando-nos a possibilidade de conhecê-los mais profundamente. É essencial ter um membro (Gon) especializado em blockchain, para garantir a segurança técnica em tecnologias relevantes para o ecossistema Cardano. Acho que a única parte que eu acho que deveria ser melhorada é a explicação financeira.", "q1r": 4, "q2": "Infelizmente, a equipe não reserva um espaço na proposta especificamente para medir os KPIs e estabelecer os riscos do projeto. Isto nos daria material totalmente focado na auditabilidade, pois saberíamos exatamente quais resultados são esperados como um todo para o projeto, na fase em que ele é encontrado. Entretanto, como eles fornecem muitos detalhes no roteiro, é possível verificar se as atividades propostas estão realmente sendo realizadas; esta é a maneira que temos de monitorar a proposta, tornando-a auditável. Seria interessante selecionar alguns participantes do ecossistema Cardano para acompanhar o projeto, de preferência dos países selecionados para receber os monitores. Eles poderiam ter contato direto mais constante com a equipe e verificar se as atividades estão sendo realizadas como planejado. Tal feedback precisaria ser passado para o resto da comunidade, isto poderia ser feito ou pela própria equipe ou pelas pessoas que monitoram o processo, através de relatórios escritos ou através da participação de uma prefeitura. Acredito que sim, este tópico é abordado mesmo que não tenha sido enfatizado tanto durante o detalhamento da proposta.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 15, "ne": 11, "ng": 3, "nfo": 1, "vca_o": 2}, {"q0": "First of all, i note that this proposal brief is quite long and voters will struggle to read through all of it when there's hundreds of proposals to chose from. So this would benefit from a more succinct brief. The specific problem this proposal is tackling is the lack of access by local entities to advertising platforms, which is identified further down the proposal but is not well reflected in the \"Problem Statement\", again making it difficult for voters to quickly grasp the purpose of this proposal. This proposal fits well within the challenge and even though it's focused in Chile the proposers demonstrate the ambition to expand further. As a local activity with small budget, this is off course will initially only have a small impact, but testing the approach at smaller scale first makes sense and sets a good starting.", "q0r": 3, "q1": "The proposal seems to be backed by an experienced and motivated team. The experience evidence is available for most users, except for Ian (engineer) and Matias (UX/UI desing). Given that a lot of the project is reliant on design/manufacturing and UI/UX design it would have been relevant to demonstrate experience of these two members. A timetable for implementation is presented, with the objectives at each step well explained and with realistic timings. The only worry i have from the plan is the requirement to design and manufacture your own OOH displays, which seems like a lengthy process, a bit more details in this area would be re-assuring. The budget breakdown is a bit lacking, with only estimates for each quarter presented, rather then costs by activity and man hours required. The proposal is also lacking in description of technical details in some parts e.g. you mention that you will provide a \"easy to use platform\", but what will this platform be based on ?", "q1r": 4, "q2": "A number of relevant and measurable milestones for each quarter are presented as well as relevant KPI's such as number of users added and OOH displays activated. These will allow the community to audit the progress and success of the proposal. ", "q2r": 5, "assessor": "z_assessor_125", "no_vca": 24, "ne": 5, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "I'm giving this project a 5 star rating because I feel this project fits perfectly with growing (testing) DAOs in Latam places. Having a digital display in public areas is a great way to create public awareness, and by adopting a DOA structure, local advertising could be more accessible to smaller, mid-sized businesses where it's needed to most...    ", "q0r": 5, "q1": "I've giving this area a 4 star rating, while the team has grown from fund 6, I would've liked to have scene a little more variety in the designs to help appeal for a wider audience. I believe the talent and motivation already exist within the team, but the appeal seems to be directed more towards an underground crowd, for mass adoption, there needs to be appeal for a wide variety of people...    ", "q1r": 4, "q2": "In the category I strongly believe their roadmap will be easy to follow to be able to see their progress of success. I think their expectations and what they hope to achieve are very detailed, I would've liked to have seen a timeline when different quotes would be available for displays, but other than that, this project should be esy to follow... ", "q2r": 5, "assessor": "z_assessor_418", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Proposers have already received funding in F6 and going around the web and documents I would say that this proposal addresses the challenge but I would hesitate if really effectively. \r\nMy point is that the word in the title 'Test...' brings no responsibility for the result. I would rather expect a shorter project but showing as a result vivid community-integrated around Cardano. \r\nThis 'Test' might be indefinite in time with a very vague final result.\r\nI really appreciate the high-caliber individuals involved but this makes me, even more, expecting a revolutionary project.\r\n", "q0r": 3, "q1": "In short words - Yes. These Team members guarantee that the proposal will be implemented successfully.", "q1r": 4, "q2": "The information provided is barely sufficient to audit the progress and the success of the proposal. \r\nThe problem is that it looks like proposers at the moment of submitting the proposal had no detailed plan to achieve the result shown as a measure of success. \r\nIt would be very interesting to see the realistic plan and the measures of success for each three-month period.", "q2r": 3, "assessor": "z_assessor_527", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "As pessoas, comunidades e empresas locais podem apresentar seus conteúdos e iniciativas aos Espaços Públicos através dos Painéis Digitais DAO-OOH.", "experience": "Somos latinxs que exploramos e testamos este modelo há dois anos, no Chile.\nA F6 Catalyst Community nos financiou para os testes iniciais."}