{"id": 384211, "author": "cargofe2", "title": "Peace Blockchain Study, Colombia", "url": "https://cardano.ideascale.com/a/dtd/384211-48088", "category": 26242, "amount": 7000, "description": "A utilidade do Blockchain para o processo de paz na Colômbia não é conhecida.", "funded": 0, "upvotes": 15775502, "downvotes": 18757996, "votes_result": 2982494, "votes_cast": 106, "f6_no_assessments": 6, "f6_rating": 3.277777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal offers a very interesting approach to the challenge. By focusing on an extremely difficult and important topic for the country, and for the region, and by approaching the topic from the perspective of the utility that Cardano's blockchain technology could bring to the issue, the proposal offers to create an image of the different means by which Cardano's blockchain technology could contribute to a positive transformative process for the country (and for the region). A well produced report could motivate and guide serious engagement and adoption of Cardano for positive change in the country and the region, advancing the recognition and implementation of Cardano's use cases under a positive perception.", "q0r": 5, "q1": "The goal of the proposal being to produce a document, it seems that the experience and plan presented suggest the success of the proposal is likely. The risk lies in the size and the complexity of the blockchain use cases to be identified and discussed given, their potential application related to peace in Colombia (see for example: https://www.cbinsights.com/research/industries-disrupted-blockchain/). To increase the probability of success and the impact of their product, I suggest, that the team be conscious and clear regarding the initial stage of their investigation and focus adequately describing and explaining the most obvious cases (e.g.: cadastre, but also DAO treasuries, etc.). A satisfactory conclusion of a first report could be the required demonstration to gain the confidence to produce many more, more detailed reports. ", "q1r": 4, "q2": "Yes, the information provided should be sufficient to audit the progress of the proposal. However, I perceive a relative weakness on the blockchain expertise in the proposal. Ideally, this apparent weakness will ultimately be resolved with the access provided by Catalyst to Cardano expertise from so many applications. The authors should make efforts to take the most advantage of this possibility through their own \"systems engineer\". On a final note, To increase the positive impact of the proposal it is important that the proponents commit them selves to the publication of their report, ideally in Spanish and in English and with the participation of a recognized actor in the region (a major newspaper, publisher, a major university, or a major non-governmental organization). This should guarantee the visibility and accessibility that is necessary for the project to actually materialize its contribution.", "q2r": 4, "assessor": "z_assessor_183", "no_vca": 18, "ne": 8, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Project starts from a very vague problem statement and the final outcome is not clear - apparently its not even clear if there's any impactful possible outcome.\r\nIt seems a technology driven exploratory idea (we have the technology, lets see what we can do with it) that will consume resources without stating clearly what possible impacts it could have on the proposed application. The proposer could possibly narrow down/define better a bit the scope as it is too generic.\r\n\r\nMaybe some examples on the proposer mind could be provided here to see what possible application it has on the \"peace\". Some initial mapping or research could be done before to better explain it to voters. An alternative would be to bring an example of a similar project, that analysis the possible benefits of blockhain to an agreement, to illustrate the bigger picutre here.\r\n\r\nReinforcing this, the impact session has some really vague terms/phrases, specially for those not familiarly with the \"peace\" agreement. As example, it is possible to mention \"This study will be the gateway to new proposals, new members, new contacts, new stakeholders in Cardano\". Why is it? how exactly this study will make this happen? Other would be \"With a multidisciplinary analysis of the peace agreements and the role that the Blockchain could play in each one of its elements.\" What possible roles blockhain could play here?\r\n\r\nAll in all, possible impact of this proposal is not clear and more information/examples could be provided, specially considering a lot of people dont know about this specific agreement (or know which role a blockchain can play in one).\r\n", "q0r": 1, "q1": "There's an already committed team with multidisciplinary capabilities, specially in the agreement hereby presented, with references. However, it's not clear how familiar this team is with blockchain, which can compromise the project. It's also mentioned some successfull past projects but none of them seems to be related to Cardano or blockchain. Moreover, success in past project, although might give credibility, doesnt guarantee success in the next ones. Each project is unique.\r\n\r\nThere's a time-framed roadmap/plan but its not so well sctrucutured and a bit vague in some activities. They could be better detailed.\r\nBudget breakdown is ok as it only broken into hours worked. The project seems a bit expensive considering one possible output is that theres no blockchain use in the proposed application.\r\n\r\n\r\n", "q1r": 2, "q2": "There are some good metrics but no target - which makes sense considering the impact isnt clear.\r\n\r\nThe most critical milestones in the roadmap/schedule could be highlighted.\r\n\r\nRisk management is a bit poor. The risk identified are too generic and there's no mitigation strategy to them. It should have more details and explain what proposer intends to do to overcome these challenges\r\n", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 19, "ne": 9, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "It looks too farfetched to think that Cardano or any other blockchain can contribute to Peace in the present state. It is possible to argue that by taking off the power from the government to print money, the fighting machinery will stop. But the proposal to research the rate of $40 per hour does not seem to be a viable option. ", "q0r": 1, "q1": "The team of proposers has qualifications and experience. They will be able to carry out the proposed activity. With such experience and qualification, it would have been better if a preliminary approach for research could have been made, which will add a lot of value to the proposal.", "q1r": 4, "q2": "Research projects are non-tangible activities and difficult to audit. A proposal should have included a research plan and approach to better evaluate and study the possibility of carrying the research forward. With the available information, it is difficult to estimate the auditability of the proposal. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about carrying out a study focused on the use of Blockchain for the peace process in Colombia. This is a great and meaningful idea. The problem is abstract since the relationship between the usage of blockchain and the peace process is not clearly explained.\r\nAs a result, the proposed solution is quite convincing. Therefore, the relationship between the Blockchain's usefulness and the peace process in Colombia should be clarified more in detail; and explaining why blockchain / Cardano blockchain can help in solving this problem (peace) in Columbia ?.\r\nTherefore, based on the given information, I am neutral with this proposal's impact, I can rate it with a score of 3", "q0r": 3, "q1": "This team's profile is described as more than 15 years of experience in the Colombian public sector, direct knowledge of the role of international cooperation in Colombia enough for understanding. I think this is a suitable skill, experience for implementation, and there is reference/proof (documents/links,...) of each member for varifying. However, risk management is provided but remains very abstract [\"Difficulties may arise in accessing certain information\" and \"Trades and requests may need to be submitted to access the information\" are not likely described as logical risks. Therefore, based on the given information, I can still agree with this proposal's feasibility, I can rate it with a score of 4", "q1r": 4, "q2": "There is a lot of information provided. The profile is described for each team member that is enough for understanding, with proof for verification. The budget is provided with items structure and an explanation of the calculation base. Besides, although the roadmap is clear and logical, some metrics are not likely metrics/measurable metrics [ex: \"Legal Analysis\", \"Political Analysis\", \"Technological analysis\"]. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The idea of research the connect between Peace and blockchain is creative and might lead to a valuable study since La Paz have the huge impact to Columbia people. Hopefully from that study, more Columbian can be attracted to Cardano ecosystem or they can find the way to grow Cardano Catalyst in Colombia.", "q0r": 4, "q1": "The members have experienced in relevant field: researching. The proposal include the Roadmap and clear plan to implement the research. However I'm a little bit afraid of their ability in using English. It will be better if they do the research in their native language.", "q1r": 4, "q2": "The study will be published. This ensure the transparent of their success. The proposal also include key metrics and road map, which help to measure success and track the project's progress.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Reading the challenge's metrics for success, I don't see how this project will grow Cardano's ecosystem. \r\nThe project details the idea of developing a study about blockchain's potential for achieving Colombia's peace, but there's no specific explanation of how this will benefit Cardano's ecosystem (they only say once the study is done, it'll bring new people to the ecosystem). \r\nEven if the document's development succeed, they don't clarify which 3rd parties will get involved to achieve peace in Colombia through blockchain, and what will be the specific role of Cardano in the matter.", "q0r": 3, "q1": "The team seems to have multidisciplinary skills (although no specific blockchain-related background) in areas like law, public policy, politics, computer engineering, etc. So it's a good starting point to develop the document, specially if they have close ties withing public government institutions and peace-promoter organizations.\r\nHowever, there's no detailed clarification of how the money's budget will be spent, neither which organization entities will be contacted, or specific roles of each team member.\r\n", "q1r": 3, "q2": "Budget spending and key metrics are kind of vagues in my opinion. Roadmap is not completely detailed, but it's ok.\r\nBudget spending: It's not detailed on how it'll be distributed among each team member, and neither which responsabilities or tasks each one of them will take care of.\r\nRoadmap: It's divided by 2 quarters, with activities that will take place in each one of them. Maybe it could be more detailed explaining tasks month by month, but it's ok for understanding the document creation process in general.\r\nKPIs/success metrics: The first 2 metrics could work as a tool for auditing progress development during the document's investigation process. However, It's not really clear for me how \"Legal Analysis, Political analysis and Technological analysis\" can be metrics for auditing proposal's progress or sucess.\r\nFor auditing sucess of the project once finalized, I'd suggest metrics such as \"number of quotes of the document\" or \"lecturers/audience reached\", etc. \r\nAlso, it'll be good to know where the document is planning to being presented to the public audience (if it'll be through a official public government document, or by an NPO initiative, etc). ", "q2r": 3, "assessor": "z_assessor_833", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Será realizado um estudo focalizado no uso da Blockchain para o processo de paz na Colômbia.", "experience": "Mais de 15 anos de experiência no setor público colombiano, conhecimento direto do papel da cooperação internacional na Colômbia."}