{"id": 384344, "author": "heinz.gassner", "title": "LATAM Industry Presentation Kit", "url": "https://cardano.ideascale.com/a/dtd/384344-48088", "category": 26242, "amount": 7500, "description": "O crescimento do ecossistema Cardano e das oportunidades Cardano na indústria da América Latina requer apresentação localizada - e material de treinamento", "funded": 2, "upvotes": 126729658, "downvotes": 986384, "votes_result": 125743274, "votes_cast": 518, "f6_no_assessments": 3, "f6_rating": 4.777777777777778, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "The proposal refers to the desire to grow the Cardano ecosystem by holding localized trainings and presentations. This proposal is very well thought out, very well presented, and clearly argued for its appropriateness in this challenging context. A clear and understandable solution was provided in the proposal to clearly describe the problem targeted.", "q0r": 4, "q1": "The proponent clearly has the knowledge and commitment required to execute the project. The proposal was made by the DLT360 team which includes active contributors to the Cardano community. The group also divides the work according to the capacity of each person to implement the proposal. It's great that the team provides the full LinkedIn profile of each individual participating in the proposal.\r\nThis is part of a large approved project. Now they want more money to continue their project. According to all that has been presented, I believe this proposal will be successfully implemented", "q1r": 4, "q2": "All products are provided specifically, the stages of providing a clear date for help the community can monitor the process and the results of the proposal. I think by providing data they have a successful measurement plan and solid incentive: this team does well to win before starting\r\nThe budget is required reasonable.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal addresses a clearly identified problem that corresponds to the needs raised by the challenge.The implementation of a training kit on blockchain technology in the Latin American industrial sectors would allow both to develop the Cardano ecosystem in these regions on a local and continental scale and to create the opportunity for new business. This is clearly stated in a summary for the CA and in relation to the KPIs communicated. ", "q0r": 5, "q1": "The experience of each member is clearly explained and supported by links, but also kept up to date on their website, which is also very informative. The qualifications of each participant seem to fit well with the needs of this project. I would like to point out that I am not very familiar with the industry field, but the budget requested seems reasonable, clearly stated and detailed in a concise execution plan and combine with a realistic timetable. \r\nThe technical aspects are discussed several times and more detailed explanations are offered in their Miro environment. Which still requires an authorization to access, but which can be understood. It would have been nice to have an explanation of how to access it. \r\nEven if the risks are not clearly stated, this proposal shows in many ways its sustainability. ", "q1r": 5, "q2": "The roadmap is also very clear, it breaks down into progressive execution times with milestone and quantitative success values. The KPIs provided make sense. With the fact that this team has already been founded in the background during the F6 and that their project has been successfully completed, this project appear in continuity,  which is a considerable indication of trust. Even if the following progress of this project for the community is reduced to their Miro space, in any case, its understandable that this team is a part of the Catalyst Coordinator Process and so, familliar with the relevant reporting processes.", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Excellent consulting proposal for Latin America. The DLT360 proposal is framed within the challenge, its objectives are clear and achievable.", "q0r": 5, "q1": "As I mentioned, given the experience of DLT360 the proposal is sure to be successful. The experience of the team is verifiable, they provide access to their website and the linkedin of each team member.", "q1r": 5, "q2": "The resources required to carry out the project are clearly detailed. They have a roadmap and means of contact with those responsible, which makes it easier to be audited.\r\nGreetings", "q2r": 5, "assessor": "z_assessor_743", "no_vca": 16, "ne": 2, "ng": 7, "nfo": 7, "vca_o": 1}], "solution": "Utilizamos o conhecimento de nossa equipe para estabelecer uma estrutura modular de apresentação e treinamento DLT/Blockchain para a indústria", "experience": "Mais de 30 anos de experiência na liderança da indústria combinados com acesso direto à expertise e à rede industrial relevante da América Latina"}