{"id": 384663, "author": "gabrielaxel", "title": "Pathform LATAM: Custom growth paths", "url": "https://cardano.ideascale.com/a/dtd/384663-48088", "category": 26242, "amount": 35460, "description": "O bem-estar é tratado como um estilo de vida ($) não aplicado para resolver questões práticas ou globais, muito menos na LATAM. Isto pode ser facilmente abordado.", "funded": 1, "upvotes": 52129918, "downvotes": 11884138, "votes_result": 40245780, "votes_cast": 182, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "In an effort to solve the high costs related to wellbeing , the proposal team plans to use cutting-edge AI. This is relevant because there is a significant disparity in access to health care based on socioeconomic status in Latin American countries, and this is exacerbated when it comes to wellbeing practices. As part of the solution, the Pathform platform will be enabled in Spanish, and resources experienced in marketing and community building in the region will be assigned. SingularityNET's market place AI services will be directly integrated into Pathform. As a result, SingularityNET will receive more calls using its AGIX tokens in the future. This will increase the use of the Cardano blockchain therefore aligned with the challenge. \r\n", "q0r": 5, "q1": "I believe that the proposal has a solid team with a good combination of experience and skills necessary for the successful implementation, the necessary references have been presented to verify them. The only role I don't see explicitly described is perhaps a Project Management role, however, it is probably considered in the budget for the application prototyping proposal submitted in the A.I. & SingularityNet challenge at $5T market. While I commend the team for including a section on pre-identified risks with their countermeasures, another risk that should be considered is the dependence of the funding allocation on the lead proposal (https://cardano.ideascale.com/a/dtd/Pathform-Custom-growth-paths/384379-48088). What if this proposal wins and the lead proposal does not? For this reason I can neither agree o disagree regarding feasibility.\r\n", "q1r": 3, "q2": "Even though this proposal has an impact depending on the success of the main proposal which is within the A.I. & SingularityNet a $5T market challenge and the impact can be measured six months after the prototype is launched. There is a significant amount of information provided by the author of the proposal regarding auditability. There are phases in which we know what is about to occur, and each phase is described in detail. In addition, we are also provided with a definition of success which is appropriate to me. ", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 21, "ne": 10, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "This proposal meets all of the goals of the challenge and the proposal budget request is lean. Requesting just enough funds to achieve the short term goals of the challenge to rapidly deliver within the challenge time frames. The proposal offers a great value proposition for the Cardano community, bring more value into the ecosystem than the value of the requested funds by potentially brings a new industry into the ecosystem", "q0r": 5, "q1": "The relevant expert experience is more than reasonable to ensure the proposal is successfully implemented. The team behind the proposal has multiple strong relationships with other projects in the Cardano ecosystem and the \"well-being lifestyle\" industry. I am believe that the proposal will on-board a new stream of users into the cardano ecosystem, primarily from within the South American region. The Budget breakdown and timeline for the proposal is very detailed, giving the community confidence that will be successful in accomplishing the goals of the proposal and the challenge.", "q1r": 5, "q2": "Outstandingly KPIs, timeline and budget breakdowns. The community can easily use the information provided within the proposal to track and audit the success of the proposal. I believe the Catalyst community will have a relatively easy time holding the proposal team accountable for the success and failures of projects as the key members are clearly identified and the metrics for success are clear/concise. The team has strong connections to other successful projects which gives the community confidence that the team will maintain clarity and transparency with the Catalyst and boarder Cardano communities. ", "q2r": 5, "assessor": "z_assessor_338", "no_vca": 19, "ne": 4, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": " Relation to personal qualifications: Since I don't have any direct personal connection to any Latin American country, I can only assess the non Latin America specific parts of this proposal.  I however have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal identifies an important topic, the lack of wellbeing for a lot of people that could be increased by many activities that don't neccesarily include money.They provide a clever solution that not just refers to this specific challenge, but also explores new potential and usecases for AI. Approaching this topic will surely be both benefitial to the Cardano Ecosystem and ist LATAM users. The key metrics and goals of the proposal align with the outlined challenge settings. From ist makeup, if done correctly, this project will be scalable", "q0r": 5, "q1": "The proposers are very transparent about themselves. I is highly likely that they are up for the challenge. The proposers define the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals. Even an assesment of risks with suitable mitigations is performed.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 3, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "The idea behind the proposal is, in theory, very interesting, to develop an application that has the main activities that promote well-being, such as meditation and body awareness. However, there is a lack of a more detailed understanding of how this project would happen, in a specific way, that is, what exactly are the contents defined here. In addition to body meditation, what other activities do you develop? With what media format are they offered? Would there be live classes, or would all the content be recorded? Like activities likely to be paid, but what is the average price? There was a lack of detail on how in practice these activities would take place, it was not possible to clearly visualize what the contents would be and how people would use them. The relationship of this project with the Cardano ecosystem was also somewhat abstract. In part of the proposal, there is the following excerpt: \"Pathform LATAM will engage with communities of AI, software and Spanish language crypto / blockchain developers in Latin America, with Cardano developers as a subfocal. -public.\" How would this involvement be? What, exactly, were developers going to do? We know that the blockchain would be used through AGIX tokens, which according to the author is a token executed in Cardano. At this point, the ecosystem would benefit, but it is not very clear what the other benefits would be. The author cites that developers would be a target audience, but does not detail why, what they would do, etc. Would there be some kind of use of ADA or NFT here? It is also necessary to take into account that the requested funding would be sufficient for only part of the project's realization; and the value is pretty high. I think that for such an investment, it would be necessary to better detail the activities of the application itself and the ways in which it would relate to Cardano. Even in the attached slides, we see more information about the project's importance and how it would impact society; however, it is not mentioned, again, what would be its most direct relationship with the Cardano ecosystem. And another important point would be how the project aligns with the specific objectives of the challenge: the improvement of the Latin American continent. I believe the point here would be that the application would be developed in Spanish, and with that it would reach the population of the continent. But the project doesn't seem to have been designed especially for this niche, but to be something in English with the modality in Spanish. I didn't see many specifics here about, exactly, the local population. How do you dialogue directly with this audience? For that reason, I didn't see such a big impact with the challenge goals.", "q0r": 2, "q1": "The project's script is a little sketchy. The proposal describes which activities would be carried out in 3, 6 and 12 months. But this is done very briefly, as the project is quite complex and probably many people would work on it, it would be interesting for the author to make a more specific division. For example, the division could have been done into months, and each month could have topics that specify what the proposed activities would be, in what order they would take place, who would work on them, and there could be a more detailed explanation of what each activity is and what its goal. I believe that not much understanding of the process is given based on the information provided. In the attached slides, this explanation is expanded, but it turns out that a quarterly analysis is also established, giving us information up to 48 months. This is positive because it shows that the author has a vision well ahead of what his project could become; but on the other hand it is a little worrying: how much funding would be needed to complete the project? Or would the money asked later be collected self-sufficiently? It is not so explicit in the proposal to what extent, exactly, the f7 funding would cover the activities. I believe that on the roadmap it would be more interesting to go deeper into the information given and better determine how far this money would help and how the next funding would be obtained. Regarding the team: they seem well prepared, highly qualified. A short description of each member is provided (in the author's case, the explanation is very rich), informing their professional activities and their pages are also available online (mostly on linkedin, allowing us to know them better). However, one thing that worries me is that the relationship of any member with the Cardano ecosystem is not clarified with specificity. We know that this bridge exists through the SingularityNET application, but this relationship should be further explored and detailed. Usually in our projects there is at least one person who is more immersed in the ecosystem, has more knowledge about it and can help colleagues, and I didn't understand if there would be this person here and who would it be. In relation to the budget, we even have a division of values; we know how much would go to thing, but this information could be more detailed. For example, when they talk about the money used for design ($ 2400): it is a value for the period of 3 months, but I would like to understand how the visual identity would be built (maybe it already exists, according to the attached website, but not we are sure because the app is probably not under construction yet); how would the professional's work routine be and etc.", "q1r": 3, "q2": "Sufficient information is provided to properly audit the proposal. I say this because the author provides us with a series of information relevant to monitoring the project: both KPIs, which provide us with some very specific quantitative information (some data could have been clearer such as \"better quality of life for the Latin American population\") ; important information is also provided and can be accompanied by the script; risks are also useful for auditability, because we can verify whether such obstacles were present and, if so, overcome. In other words, we have a lot of material to be worked on here. I think it would be important to establish direct contact between the team and the Cardano community, through which progress in the process and gradual results could be shown. It is necessary to think about this bridge, which could be done through direct meetings with the author of the proposal and some community members in charge and monitoring the progress of the project or even through a written report.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 19, "ne": 3, "ng": 7, "nfo": 9, "vca_o": 1, "reply": "The assesor did not read in detail or did not fully understand the proposal. The proposal indicates a larger development, while Catayst funded portion will be only for the small part, therefore follow-up is focused only on a first 3 month part. For the entire development expected KPIs in LATAM are presented. Also, the proposal is in line with the challenge with the focus on LATAM countries and devs. \nThe assesment should be removed."}, {"q0": "People's wellbeing, or the lack thereof, is highlighted by COVID-19. It became apparent under this unique condition that many of us are not at our optimum health. Targeted, personalized solutions could be the answer and Pathform seems to have the talent to deliver. If successful, Pathform will add value to the Cardano ecosystem in a few ways: its symbiotic relationship with AGIX will increase the use of Cardano; it could improve the well-being of the people working on Cardano(should they use it); the adoption of Pathform by non-crypto users would indirectly benefit Cardano. The proposal also has plans on how to scale, and what that would entail.  ", "q0r": 5, "q1": "This proposal is filled with talented people. Team members are easily verified(thank you for including linkedin profiles). It is also clear on the team members that are needed. I also like how some thought was done on the budgeting to make it lean. The implementable plan is comprehensive, from the 3 months required to develop a prototype, to the community expansion stage, and onwards towards completion. The proposer is aware of the risks involved, and have created plans to mitigate them. I feel like the targeted active users is conservative, and achievable.", "q1r": 5, "q2": "I feel like this proposal covers everything needed to audit the progress and success of the proposal. It has a roadmap, success metrics to determine if it's a successful/failed project, and because the Founding Board/ Advisors are well known and reachable on social media, the community can keep track of progress very easily.", "q2r": 5, "assessor": "z_assessor_948", "no_vca": 22, "ne": 6, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "Intervenções direcionadas e personalizadas de conscientização; caminhos de crescimento personalizados e ações colaborativas na LATAM para tratar de questões globais.", "experience": "Bilíngüe; PhD, neurociência e ética da IA, antiga SingularityNET Head of People; inovação em governança descentralizada; especialista em consciência"}