{"id": 384838, "author": "matthiasksieber", "title": "Win-Win Expansion in Latam", "url": "https://cardano.ideascale.com/a/dtd/384838-48088", "category": 26242, "amount": 15000, "description": "Plataformas tecnológicas legais como Win-Win precisam fazer algumas pesquisas para localizar seus produtos de acordo com as leis e cultura de outros países.", "funded": 2, "upvotes": 89345355, "downvotes": 3577146, "votes_result": 85768209, "votes_cast": 288, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=24200"], "media": [], "f6_assessments": [{"q0": "The proposal is totally beneficial for both Latin America and the Cardano ecosystem. I say this because this is not a new idea that has yet to be tested, the platform in question (Win Win) whose activities are based on conflict resolution outside the judicial system and using blockchain to record information, already a success. The idea behind the proposal is to expand this project to Latin America, as its activities are aimed at the United States, since, as the authors themselves said, most of the team resides there. This would greatly benefit the local Latin American population, as it would make it possible to solve problems in a very reliable and cost-effective way, as is already happening in North America. And as for our blockchain, the degree of activity in Cardano, transactions and information logging would be increased. In this way, the objectives required in the challenge are being completely satisfied, leaving no doubt about the high value of this proposal.", "q0r": 5, "q1": "The team draws a short itinerary, but as it is the expansion of something that already exists, I believe that the activities are well explained with the information provided. They break down what would be done each month (March, April, and May 2022), giving some to-do lists. In such a way it is possible to have a good understanding of what will be done in practice, and this conveys a lot of security in the process. As for the team, I believe there is little doubt about their ability to carry out this project. The company already has the same project and it is successful. I don't see why it would fail in Latin America, on the contrary. It is a continent where the purchasing power of most people is not so high; therefore I believe there would be a lot of adoption of this less expensive system of conflict resolution. The team presents itself in a very apt way: they include a long breakdown of each of its members. Through these explanations we can get to know them in a very deep way, in addition to knowing their names, we know what they have done so far, what their relationship with Cardano (by the way, they are very active in the community) and their professional backgrounds (they are also technically very qualified). In that regard, I think there is a lot of confidence in your credibility and your ability to make this expansion successful. And in terms of budget, we are also presented with a small detail. But in the same way as in the script part, I don't think it was insufficient for understanding, because this is the expansion of a project. What happens here, then, would be the salary of those involved, in general.", "q1r": 5, "q2": "There are several ways to monitor this proposal. First, because of the script that was provided. We know what should happen each month of the year, so you can keep track of whether activities are actually being carried out. Afterwards, the authors provide us with KPIs for the periods of 3, 6 and 12 months, in a very quantitative way, that is, how many mediators were integrated at each passage of time and so on. I think another way to monitor the success of the proposal would be through the amount of mediation made over time. Direct verification of the platform could also be carried out, this could be done by some community members from the chosen location (Brazil). They could verify that the platform is working properly and bring that feedback to the community. It would also be positive that the team themselves return, they certainly already bring some kind of feedback from the Win Win platform in the US; the same must be done for Brazil. In other words, the proposal is perfectly auditable based on what is presented to us.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 19, "ne": 9, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The success criteria are related to the challenge question. Expanding Win-Win legal technology platform\r\nSome of the most important aspects of the challenge will be addressed by this project. Reach out to universities, law enforcement and local authorities in Latam to expand and localize Win-Win services.", "q0r": 4, "q1": "The proponent seems to have enough knowledge and experience to come up with good content as he is suggesting. According to the information of the group, they are experienced and qualified people, they have successfully implemented several proposals in Fund 6, so I believe they can successfully implement this proposal.\r\nIt would be great if the proposal mentioned possible challenges and risks", "q1r": 4, "q2": "The proposal provides a roadmap with verifiable milestones and a definite timeline. A clear roadmap and timeline provides transparent objectives for project evaluation, providing a sufficient basis for a successful project audit.\r\nI agree that the suggested data and success criteria are accurate for measuring progress in the challenge. The budget given is specific, concise, and fully explained\r\nFor these reasons, I believe that the suitability of the proposal is perfect, there is no point to criticize, just praise.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 18, "ne": 3, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This proposal gives a very precise and concise description of the problem being addressed and how it can be solved. \r\nIt meets the criteria of the challenge in that it combines both local development by providing for adaptation to the specificities of each region and preview to expand across the continent. By focusing on the development of the legal sector through the Win-Win platform it would allow for a deeper understanding of how it works on a case by case basis. It allows for direct collaboration between eco-system actors supported by local mediation, which emphasizes its potential to have a positive impact on the Catalyst community and provide significant added value. The success metrics are in line with those of the challenge by integrating at its height 65 Brezillian mediators to the Cardano Win-Win market platform. And finally, its building of partnerships with other projects developed in the ecosystem such as the Mentor marketplace insinuates the ability of this proposal to address future challenges. ", "q0r": 5, "q1": "The experience and skills of each member of the team are detailed and proven by links, profiles and the official website address. This makes it possible to identify the specificities and contribution of each member in relation to the understandable needs of the project development. It is clearly identifiable that members are already active in the community, which implies coherence and facilitates the trust process. The budget is clearly stated, realistic, fair and in direct correlation with the integration of the new members mentioned in the success metrics as well as comprehensibly linked to the implementation plan. The timeline seems clear, taking into account a value of gradual progression and allowing for contextualisation, for example with the sensitisation of universities and local governments. Only the risk indicators are not clearly stated, but the overall coherence of the project and its participants and the set of information given in advance suggests that the team has the experience and skills to be aware of them. ", "q1r": 5, "q2": "The roadmap provided is accurate and consistent with the associated time indices. The success metrics make sense and clearly evoke the inclusive nature of the proposal based on the number of Brezilian mediators integrated in the ecosystem. The detailed, precise, documented aspect of this proposal gives an opportunity for the community to understand it through its transparency, but if I am not mistaken, I have not identified any precise explanation of how the team members would report the progress of their results to the Catalyst community, which could have accentuated the inclusive aspects of this proposal.  ", "q2r": 4, "assessor": "z_assessor_739", "no_vca": 15, "ne": 5, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The proposal address one of the major problem of the Cardano ecosystem being heavily based on Europe and North America. The team proposes to introduce the Cardano ecosystem to the LATAM countries and therefore bridge the gap left. The proposed solution is to expand and localize Win-Win services across Brazil and gradually move to other LatAm countries. Moreover, the Win-Win platform works in the legal sector and this will add credibility to the network and in turn surge newcomers into the ecosystem.\r\nThe primary focus of the proposal is to include legal bodies and government authorities of LatAm countries and slowly spread its influence across all continents which will certainly improve the acceptance rate of Cardano across the world.", "q0r": 5, "q1": "The team is highly qualified and experienced in the field and has already had successful implementations of several Cardano-based applications. The requested budget of 15000 and the breakdown of the budget is well outlined and can also be considered reasonable keeping in mind the total budget allotted for the challenge. The action plan comes with well-structured milestones defined on monthly basis, hence making it easy for the readers to understand the team's approach to the solution. The team has already been successfully funded in the F6 stage, which shows that the team and its proposal are reliable and trustworthy. Given the facts mentioned above, the chances of the proposal being a success are sky-high.", "q1r": 5, "q2": "The facts and figures mentioned in the proposal prove that it has enough potential in being a triumphant project. The suggested milestones and quarterly metric goals are decent and plausible. However, the team has not mentioned the possible hitches and risks involved. Although the metrics mentioned in the proposal are quite adequate to measure the outreach and spread of the Win-Win Services, a way to measure the acceptance rate and active usage of services once introduced to mediators might help auditors get more insight into the success of the proposal.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 21, "ne": 10, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Universidades, órgãos jurídicos e governos locais na América Latina para expandir e localizar os serviços Win-Win.", "experience": "Equipe Loxe Inc., Sr. Engenheiros de Software, Plutus Pioneers, veteranos da Gimbalabs PPBL, especialistas legais e especialistas em resolução de disputas."}