{"id": 350691, "author": "Greg Bell", "title": "NFTs", "url": "http://app.ideascale.com/t/UM5UZBiPC", "category": 25946, "amount": 200000, "description": "How can we establish Cardano's native tokens as the best solution for NFT projects?", "no_assessments": 22, "rating": 3.6818181818181817, "videos": [], "media": [], "assessments": [{"question": 4, "note": "While moving NFTs to a more energy-efficient blockchain like Cardano is a positive thing, and there are many promising use cases to NFTs, the proposal focuses on the monetary aspects of NFTs. NFTs are not solely a tool to license and monetize things like art and collectibles but can go far beyond that, so the challenge in this scope and formulation does adress cardanos mission sufficiently, as ADA is explicitrly supposed to go beyond monetary aspects of Crypto", "rating": 3, "c_fb": 1, "no_vca": 2, "reply": "Nothing in proposal prevents \"beyond monetary\" from being included in proposals in the resulting challenge", "pc_fb": false}, {"question": 4, "note": "Cardano's mission might have to expand in order to include the ever-expanding and changing blockchain use case. NFTs give the ability to securely verify ownership of any asset, which might become beneficial to future onboarders of the technology is developing nations. Having another NFT challenge setting will give current running/funded projects a chance to compete for more capital in order to secure more Human Resources. It is difficult, however, to state that NFT is high on a priority for Cardano's growth at the moment. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Establishing Cardano as the top platform for NFTs would almost certainly drive a significant adoption of the blockchain and thus assist in furthering Cardano's agenda as a whole and in time in all aspects of it. However I have some reservations about how this project is formulated, see the reasoning for the other scores for clarification.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "Each category, should not reflect the other. This challenge is critical to cardano's mission should be the sole criteria for this score.", "pc_fb": true}, {"question": 4, "note": "This proposal is well aligned with Cardano's goals. Indeed NFT are very much in the spotlight right now and Cardano is probably the best blockchain for its developments. There are some NFT related proposals being submitted in other challenges, specially in the Dapps challenge, but it would be very good to have one challenge specifically for this and aiming in more variety of utility as well.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "NFTs are an important feature of any blockchain with smart contracts. NFTs have a wide range of different use cases, from high-value applications such as financial applications and high-value art tokenization to lower-value applications such as in-game items and ticket tokenization.\r\n\r\nCardano is a blockchain that stands out for its great security guarantees due to the functional language and security brought by Plutus, so we will have a promising environment for the tokenization of high-value financial assets. But scalability is also an important point, because although there are several blockchains with great TPS capacity, Cardano has a competitive blockchain and will be even more so with Hydra.\r\n\r\nI recommend changing the name of the challenge, I believe it is very simplistic and vague.", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": true}, {"question": 4, "note": "NFT use case proposals are worth eliciting but I think this challenge needs more thought as to its structure for encouraging them.", "rating": 2, "c_fb": 1, "no_vca": 4, "reply": "", "pc_fb": false}, {"question": 5, "note": "Only a part of the devs on the catalyst community will be able to adress this challenge, as it requires in-depth understanding of the functioning of NFTs and smart contracts.", "rating": 3, "c_fb": 0, "no_vca": 1, "reply": "Same could be said for many categories", "pc_fb": false}, {"question": 5, "note": "At the present, project Catalyst has already produced multiple teams competing to deliver a working product in the NFT space and put Cardano amongst the participating platforms in this arena. Having another challenge setting featuring NFTs might attract more interested parties, given the projected Goguen release. ", "rating": 4, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 5, "note": "Use cases for NFTs are abundant, the  community should not have any problems of bringing up ideas and proposals to sell cardano NFTs to the world.", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 5, "note": "Part of this issue here is that success is driven by the world outside the community. To be accepted as the best solution for NFT's, we need more than just technical NFT solutions. It requires a concerted marketing solution. VHS didn't beat BetaMax by being technically superior. Interoperability with other NFT solution will be key. ", "rating": 3, "c_fb": 1, "no_vca": 3, "reply": "Pre-supposing that none of the resulting proposals will address interoperability", "pc_fb": false}, {"question": 5, "note": "There have already been a lot of NFT related projects on Catalyst, some of the high profile like Artano mentioned by Charles Hoskinson several times, some of them not in Catalyst but still built on Cardano like SpaceBudz (creator interviewed by Charles Hoskinson) however the challenge doesn't acknowledge or incorporate this and the challenge isn't formulated in such a way that would imply that building an already existing initiatives would be an option.", "rating": 3, "c_fb": 1, "no_vca": 2, "reply": "Comment seems unrelated to feasability", "pc_fb": false}, {"question": 5, "note": "Since there already are some proposals being submitted in other challenges, I believe that Catalyst community is very capable of submitting very good proposals here as well. It might be good if the most of them highlights the benefits of having NFTs in Cardano, as mentioned in the text, and this should be clearly stated in the challenge if this proposal wins.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Certainly. When observing the large number of proposals related to NFT in Catalyst and this is self-evident. Today we already have dozens of proposals in the area of NFTs and a wide variety of niches among them.\r\n\r\nit is important to note that there are currently many quality proposals related to NFTs in Catalyst and creating a specific challenge is just listening to natural demand.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Use cases can definitely be crowd sourced by the community.", "rating": 4, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 6, "note": "The criteria on how many NFTs are traded via the cardano blockchain can indeed be measured on the blockchain and could be quantified, as well as their frequency.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposer has a good understanding and vision for what it is they want to see out of this challenge setting. It is recommended they expand upon their current KPI and success metric list. ", "rating": 4, "c_fb": 1, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 6, "note": "The success criteria and metrics are ok. I can wait to see the proposals to take off.", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics proposed don't actually measure the stated goal. We need to measure to market share gains in NFT's on Cardano vs other platforms, probably by both numbers of NFT's and value. Perhaps also looking at market share across industries, geographies etc. This is much bigger than collectible art in the long term.", "rating": 3, "c_fb": 1, "no_vca": 3, "reply": "CA's proposal for metrics are infeasible", "pc_fb": false}, {"question": 6, "note": "Part of the challenge KPIs are for measuring the success of the challenge, not for measuring the success of the proposals that would be entered in the challenge. I also feel that some of the other metrics are too general for the community to be able to effectively measure them.", "rating": 3, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": true}, {"question": 6, "note": "There is a clear definition of success for the challenge itself and metrics as well, but some guiding metrics for the proposals to be submitted in this challenge should also be included in the text. It might be proposal specific, but there are some general KPIs that could be suggested, like number of users, different kinds of NFTs created, trading volumes, and others.", "rating": 4, "c_fb": 2, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 6, "note": "Interesting metrics have been defined, but I believe there is room for many others. I believe that metrics that indicate the volume of transactions and number of users are good examples of what can be included.\r\n\r\nThe definition of success defined for the challenge is reasonable.\r\n\r\nI think it is important to include a window of time for the success of the challenge to be verified.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics need more detail as to how the community should differentiate between particular proposals fro NFT use cases, and should include how proponents should be differentiated as to their capability and resources to implement proposals as practical applications of their ideas.", "rating": 1, "c_fb": 1, "no_vca": 2, "reply": "What???", "pc_fb": false}], "importance": "NFTs have caught the public imagination with recent news about high prices being paid for Artworks, Tweets and other collectibles. They have been talked about on \"Saturday night live\" and \"The Ellen DeGeneres show\".  \nNFTs also have the potential for high utility and usage. Ticketing, in-game currency, commemoratives and awards are all potential use cases that don't necessarily rely on scarcity and high value to make them useful. The ability to perform high-frequency, low-value transactions such as transport tickets can address challenges that other blockchains cannot address yet.  \nUnlike many others, Cardano's NFTs are first-class citizens of the Cardano ecosystem. Demonstrating them through Catalyst proposals and their implementation will help to establish the Cardano ecosystem's varied capabilities as its true strength.  \n**What does success look like**\n\n*   Cardano is known as the best ecosystem for NFT creation and use\n*   NFT marketplaces are thriving on Cardano\n*   NFT transactions are fast and frequent on the Cardano network\n*   Well-known NFT marketplaces are migrating or re-inventing themselves on Cardano\n*   Popular uses for NFTs are using Cardano but their users don't always know.  \n    **Guiding questions**\n*   What problems could be solved by Cardano's NFT capabilities?\n*   What existing NFT use cases could move to Cardano?\n*   What use-cases exist for NFTs that have not yet been explored?\n\n  \n**Potential directions**  \n\n*   Knowledge base & Documentation\n*   How-to guides for NFTs on Cardano\n*   High-use NFT applications\n*   High-Value NFT applications\n*   Marketplace proposals\n*   Samples, recipes and templates\n*   Hackathons  \n    **Budget**  \n    US$200,000 in ADA: I can foresee having another NFT challenge when smart contracts arrive and it seems likely that many proposals will generate their own revenue fairly quickly."}