{"id": 350688, "author": "SofiH", "title": "Decentralised Research Fund", "url": "http://app.ideascale.com/t/UM5UZBiO9", "category": 25946, "amount": 10000, "description": "How can we ensure creative productivity in the decentralised space is backed by sound science, research & models, equally available to all?", "no_assessments": 20, "rating": 3.8, "videos": [], "media": [], "assessments": [{"question": 4, "note": "The peer-reviewed process is obviously a big factor for Cardano development, however it is certainly not equally available or accessible to all.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "It is difficult to ascertain the proposed challenge setting will support Cardano's mission directly. One can envision the proposed challenge setting would attract more researchers and solidify Cardano's established image as a research driven blockchain project. Presently, researchers need to find a profit oriented solution to study in order to secure financing from interested parties. This presents a great opportunity for Cardano to expand its mission statement and support the academic community which presently makes up the core of IOG. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This challenge is very relevant in the context of decentralized knowledge development. It's a way to Cardano itself improve over time, and I see this as a seed to what would substitute IOHK's current role as development budget provider. I believe also that other topics besides the ones mentioned in the text could be covered by this challenge.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Proper research of related topics will be very beneficial to the Cardano Ecosystem, especially if it is independent. This challenge has the potential to be very valuable to the ADA community", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Great idea. Needs more funds. No point making a challenge that can only fund 4 researchers for 2500 ea. Its also important to make sure this challenge if accepted gets promoted at universities and research institutions around the world (to be honest I think this is also the case for all project catalyst funds in general).", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Cardano is a blockchain differentiated by its approach of first principles approach to academic research, academic research and this challenge is fully aligned with this concept.\r\n\r\nWith the full launch of Goguen, we will have hundreds of projects under development and we need to continue pushing for the construction of a solid foundation and much of that goes through studies and research.\r\n\r\nOne of the points raised in relation to the reason for importance was to create research on important topics without reinventing wheels. But I believe that in many fields related to blockchain, innovation is necessary and reinventing the wheel or creating a new wheel can be valid options, since several problems that blockchains are helping to solve are new implementations and many never seen before, so I think that we must keep the field of possibilities wide.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This might be useful to think about once the roadmap is implemented and we are looking to renew and or augment research and implementation that IOHK have been conducting, but for now there may be more immediate things to address through challenges.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The Catalyst community includes highly educated people that went through the peer-reviewing process already. I'm certain that more papers can be published by the community.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Cardano has already attracted attention of the academic community being the first research based cryptocurrency. Giving them support to develop within their own field without having to learn anything about blockchain would embed good brand recognition that can be carried forward into the future. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I am not completely sure about how many science people are already involved in the Catalyst community, but this challenge could bring a lot of new people to it. Anyway, at least 4 papers will be funded and this is probably not too much and could be fulfilled by the existing members.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Despite only a minor portion of the community having the ability to research on the topic, the small initial fund should not make it a problem to get at least some good proposals in this challenge.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I see no difficulty that this challenge can be addressed. There are already some proposals in Catalyst aimed at developing proof of concepts and research and the Cardano community is one of the most accustomed to this concept. We can count on the expertise of several researchers from the community,  from IOG and Emurgo.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Ahead of implementation of the roadmap it is hard for the community to set out or assess scope of work in terms of proposals, although the time for this may come. ", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics are quantified, easy to measure, and in alignment with the impact measures of academics (for better or worse).", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 6, "note": "The author has given good thought to their challenge setting initiative and believes this can serve as a breeding ground for further research into blockchain focused products. It is possible to expand this challenge setting to cover more than just one academic field of research and provide support to wider community. Low cap amount is sustainable and puts less pressure on the community. Suggested KPIs are sufficient to provide feedback about the ongoing success of this challenge and its proposals. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The verification of such a challenge would be more tricky then the other ones. The peer-to-peer review would already be the audit of such proposals. Also, I believe a deadline for paper release should be clear, like 3 or 6 months, since these areas evolve so fast that if it takes too long, there is a risk it would not be relevant when it's released. Besides that, the suggested key metrics are great.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Most of the metrics are already applied on all standard portals for papers, so the metrics are adequate and measurable.", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 6, "note": "Lets also add metrics on research being picked up in mainstream media and leading to application in Cardano (be it technical, governance etc).", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Relevant metrics were defined in order to verify the success of the challenge, but no time was set for the verification of the metrics.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "These are perhaps criteria for the proposals to be assessed by rafter the event rather than by which the challenge for them is set. Capability and credentials might be good metrics to try to elicit so that the community could choose between proposals.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}], "importance": "This challenge is here for researchers to seek funding.\n\nResearch should relate to fields relevant to the cardano community and the proposal should contain a clear argument to make this case. The proposal should contain a clear research question and an indication of the expected methodologies.\n\n  \n\nThe challenge promotes independent research and the work resulting from these proposals should be made publicly avaible for anyone to review and re-use.\n\n  \n\nIn line with Catalyst approach to start new Challenges with a small fund, this challenge setting can be seen as a trial. Each individual proposal can ask for max 2500 of the total funds. Proposers can only be involved in 1 proposal within this challenge. This is to encourage diversity and ensure that at least 4 research projects can be funded in this challenge round."}