{"id": 350697, "author": "Greg Bell", "title": "A.I. & SingularityNet", "url": "http://app.ideascale.com/t/UM5UZBiPI", "category": 25946, "amount": 400000, "description": "How can we create a mutually beneficial partnership with SingularityNet and other A.I. developers and researchers?", "no_assessments": 24, "rating": 4.0, "videos": [], "media": [], "assessments": [{"question": 4, "note": "I don't know if it will help onboard new users to Cardano. But potentially create a lot of value for the users/institutions already on the blockchain.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "It would be a challenge setting in July/August, which corresponds with Alonzo mainnet launch and SingularityNET's (partial) migration to Cardano. \r\nDedicating a challenge to this entry would strengthen the bond between our and their community and thus make our ecosystem stronger. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I'm not convinced that this challenge is critical to achieve Cardano's mission but its an excellent idea and I feel is a worthy submission. I note some discussion regarding what the focus should be but I believe it's the sort of challenge better left open to see just how creative people can get with their proposals. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Entrenching the connections that already exist between Cardano and SingularityNet would result in a higher likelihood that if Cardano's near to medium term goals are achieved they would survive in a future dominated by AI. Especially if that AI would be centralised in nature.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "AI's and decentralised ledgers are made for each other. I would question whether this challenge shoudl apper to be favouring singularityNet over any other AI groups/protocols. The Challenge should focus in bringing in the AI community at large, not favour one given community.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Ben Goertzel has addressed future and present collaboration with Cardano and how beneficial it will be for both ecosystems to work together. Singularity Net's goals and aspirations can prove to be beneficial to Carano's mission, but it is difficult to ascertain this partnership as critical at this point in time. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I believe this is a very good challenge and since SingularityNET will be a strong player inside Cardano's ecosystem, I think that this is very appropriate. I also don't any problem in suggesting partnership with SNET because this is much more related to SNET community than to the platform itself. Budget is quite high, but I think it's fair and I believe that the outcome of such a challenge would be very good.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I agree that AI is a massively important area for technological development, and that it is brilliant news that Singularity have chosen Cardano to partner  with. In particular the way in which governance can be suitably and democratically organised to make AI ethical is I think a vital and unique function that Cardano can bring to the process. It is great that this challenge suggests we should be thinking about how we as a community can help with it. I wonder though whether the best approach would be to work with Singularity off line rather than through Catalyst for the time being until the Singularity roadmap is better understood and the community can be more targeted in its interaction, particularly on the ethics and governance side of AI development.", "rating": 2, "c_fb": 1, "no_vca": 3, "reply": "Mostly positive comment but scores less than 3", "pc_fb": false}, {"question": 5, "note": "I think so. SingularityNet could be an incredibly powerful technology. But we need to find out ways to use it, to solve real world problems. I'm sure there are many people on Project Catalyst with creative ideas on how the technology can be used effectively, in combinations with other products being built on the blockchain.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This is a great way to onboard the AGI community to Cardano and Project Catalyst. \r\nA partnership like that is beneficial for both. \r\nBoth communities are highly motivated, so there is little doubt about the Catalyst community's capacity to address the proposed challenge. \r\nAs there has been great anticipation for this event in both communities, it is likely that it would be accepted with enthusiasm. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Strongly feel that once the community started to wrap their heads around this challenge that some really innovative and left of centre concepts might start being generated which is partly what PC is all about. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "If the aim of this challenge setting would be to build bridges between the Catalyst community and the SingularityNet community then I'm certain that in time the Catalyst community would be able to do so. But if the scope of the challenge would be to actually build AI applications on SingularityNet, originating from the Catalyst community, then I think that's something outside the current incarnation of Catalyst. The objectives of the challenge should be more clearly expressed if resubmitted in a future round.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Part of this challenge is to bring AI dev/researchers into the community, but yes it is feasible.", "rating": 4, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": false}, {"question": 5, "note": "Ben Goertzel has voiced his vision for Singularity Net launching their own project Catalyst alongside Cardano's in order to cast wider net over the AI tech sector and attract talent. It is challenging to assess how current Catalyst community can provide benefit to AI research, however they can explore areas of potential collaboration. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Since this challenge would be a bridge between Cardano and SingularityNET, I believe that both communities would be capable of, together, submitting very good proposals in this challenge. The budget can also be sufficient to accommodate very good and well structured proposals. I believe that SNET community might have very good proposals waiting for funding, and now they could benefit from Catalyst as well.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This is a very deep area which IOHK and Singularity are thinking about and it may be worthwhile saving the engagement of the community, and Treasury funding, until there are some more concrete tasks we can help with in a. challenge.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Seems alright. Ideally we want the proposers to be very familiar with SingularityNet and possibly have created or started building AIs for it already.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics and criteria set in the proposal are correct and emphasise the scale of the potential market. The guiding questions provide clarity towards possible proposers and encourages them to think how AI can come to the benefit of the blockchain by combining forces. Great reasoning behind the budget decision. Thank you for including this as it makes clear how careful it was considered. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": true}, {"question": 6, "note": "I feel success criteria are valid and author has certainly put some thought into this submission. It is the sort of challenge that I feel would benefit from a slightly different approach re: budget allocation where many smaller projects are encouraged to be submitted with the rationale that they seek further funds as they progress ( I realise that system informally operates at present).  Call it a flash fund...no idea is too small.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics by which to measure success by in this challenge are certainly on the right path, but they could be more clearly expressed and with a clearer scope of what the actual aim of the projects/proposal would be besides collaboration between the two communities which seems to be the main objective now.", "rating": 3, "c_fb": 1, "no_vca": 1, "reply": "Doesn't seem to understand the point of a challenge setting challenge", "pc_fb": false}, {"question": 6, "note": "Work needs to be done on the metrics. 4 of the 5 are just measuring number of proposals. The challenge should be measuring results from the proposals. What is return on intention? Is that measurable?", "rating": 3, "c_fb": 1, "no_vca": 2, "reply": "", "pc_fb": true}, {"question": 6, "note": "The proposer has identified several KPIs to track performance and progress of the participants in this challenge setting. Should this proposal go forward, this list will need to be expanded upon to gain more accurate understanding of the collaboration between the two platforms and how its benefiting their ecosystems. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Success criteria is clear and well defined. Key metrics for the challenge are good as well, but I would like to see some suggestions of KPIs and key metrics for the proposals submitted in this challenge. I believe that the majority of KPIs in this sense would be proposal specific, but some guidelines in this regard would be good.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "I think the metrics would need to be thought about carefully to dovetail well with particular objectives we might have for a challenge leading to Treasury funding of particular development ideas for AI, but these are some interesting metrics and criteria to add into that when the time is right.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}], "importance": "**++Marketplace/News++**  \nSome facts  \n**Microsoft**\n\n*   **Is acquiring Nuance for $19.7 Billion -** to deliver new cloud and AI capabilities across healthcare and other industries  \n    **McKinsey estimates** AI techniques have the potential to:\n*   **Create between $3.5T and $5.8T in value annually** across nine business functions in 19 industries.\n*   **$2.6T additional value in Marketing and Sales**\n*   **$2T in Supply Chain Management and Manufacturing.**\n*   **$200B in value to Pricing & Promotion**\n*   **$100B to Customer Service Management** in Retail.\n*   **Have an 11.6% impact on Travel industry revenues**\n*   **Have a 10.2% impact on High Tech**.\n*   **In 69% of the use cases in the study, AI and deep neural networks improved performance** beyond what existing analytic techniques were able to deliver  \n    **SingularityNET was born from a collective will to distribute the power of AI.**  \n    SingularityNET is a *full-stack AI solution powered by a decentralized protocol* and the first and only decentralized platform allowing AIs to cooperate and coordinate at scale, removing one of the major limiting factors to AI growth today — the lack of interoperability — which severely restricts the ability to leverage the strengths and capabilities of individual AIs.  \n    SingularityNET enables anyone to take advantage of a global network of AI algorithms, services, and agent. No longer must AI technology exist in silos, only capable of operating within a specific company, infrastructure, or industry.  \n    Sophia, the world's most expressive robot, is one of our first use cases.  \n    https://www.youtube.com/watch?v=LZkADy2RRoA  \n    **Artificial Intelligence will be a driving force this century.** It will be at least as big as cryptocurrencies and blockchains.  \n    **The Singularity community has put their trust in Cardano by voting overwhelmingly** to risk the value of their AGI tokens by issuing new AGI tokens based on Cardano and moving swiftly from Ethereum to Cardano. We can reward that trust and recognize the risk they took by dedicating a community challenge to them and their field of endeavor.  \n    The speed and efficiency of Cardano combined with the possibilities of SingularityNet will make a great partnership that sets both communities apart from other cryptocurrencies/tokens and drives enormous growth and value.  \n    Also… I want a world for my kids and community where Artificial Intelligence's goals are as beneficial and ethical as Cardano's  \n    **What does success look like**\n*   SingularityNet teams and individuals arrive on Catalyst enthused by the possibilities for proposals and funding.\n*   Catalyst users get exposed to SingularityNet's technologies and get excited by the ways they could be used.\n*   Great collaborations happen before, during and after the challenge.\n*   The challenge is looked back on as part of the beginning of a great partnership between two crypto communities.  \n    **Guiding questions**\n*   What do SingularityNet's technologies make possible?\n*   Where can AI + Cardano benefit society  \n    **Potential directions**\n*   AI improvements to help project Catalyst scale to many times its current size\n*   AI projects that fire the community's imagination and enthusiasm\n*   Knowledge base & Documentation\n*   Samples, recipes and templates\n*   Hackathons  \n    **Budget**  \n    **++US$400,000 in ADA:++** *I struggled with this. 1/2 a million dollars is a catchy headline for the crypto media and the SingularityNet community to feel good about. But it is more than half the total budget. If the total budget was 1 Million or more it would be an easy decision and I would propose 1/2 a million regardless. But proposing that much might prevent it from getting over the line and winning the vote. In the end I decided that half the total budget emphasized that Cardano and SingularityNet is an equal partnership.*"}