{"id": 350751, "author": "vladimirp", "title": "Explore & model ADA monetary policy", "url": "http://app.ideascale.com/t/UM5UZBiQB", "category": 25946, "amount": 50000, "description": "Can ADA's monetary policy be explored and modeled to inspire confidence among new users, organizations and experts, in the next six months?", "no_assessments": 30, "rating": 4.166666666666667, "videos": [], "media": [], "assessments": [{"question": 4, "note": "It is absolutely critical to the success of the Cardano ecosystem to constantly iterate monetary policies. This will help increase it's benefits for as many people as possible and increase resilience of the system against manipulations, bad actors and errors.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I like this idea, I think it is in very compliance of Cardano is aiming to achieve, and thus, further exploration of the whole monetary policy would be useful. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This is an exciting and novel area that is under developed in the Cardano ecosystem. A robust monetary policy that is developed after exploring an array of potential options will be invaluable. \r\nThe challenge question, importance indicator, and success indicators are clear and transparent. I appreciate that this challenge is directed at a broader audience of participants within Cardano. While the current focus on devs and dApp development is necessary, incorporating more economists, social scientists, and financial experts will only strengthen the ecosystem's applicability and adoption. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "While it is not absolutely crucial to explore alternative objectives for Cardano, it will be beneficial in the long term. The financial system as we know it is testing its limits, and should it reach the end of its possibilities, the world will turn its eye towards something more robust. Cardano should research ways to position itself into an advantage point prior to this occurring. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Taking a proactive step towards researching and exploring the vital topic of monetary policy will enable Cardano to grow and expand more easily in the future by enabling foresight into the matter and by identifying potential risk and dead ends.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Cardano monetary policy is important if ADA is to achieve its goal. A decentralised currency should have a decentralised organisation in charge of its monetary policy. But what should this be and how do we govern it?", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "For Cardano to be a global financial system, we need to have more and more great minds being part of the journey, and this funding could help in a very good way.\r\nResearch must be done to explore this whole new world, as the greatest human's collective intelligence experiment is moving forward.\r\n", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This challenge is aligned with the goal of bringing more people and visibility to Cardano, as well as improving the long term adoption. If the monetary policy if robust and science based, it will attract the attention of lots of people and it would make it easier for ADA to be the leading currency in the world.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Fungibility, Durability, Divisibility, Portability and Acceptance are characteristics that define what good money is. When Bitcoin came into being it wasn't considered a store of value, but its properties and the immutability of these properties over time made Bitcoin a store of value.\r\n\r\nADA can also be a store of value, but the biggest challenge for this is monetary policy, so this is a topic that is totally relevant for a blockchain that intends to become widely accepted and fulfill the ideal for which cryptocurrencies were designed, give power back to the individual.\r\n\r\n\r\nOne of the aspects that guarantees the security of a PoS blockchain is the cost to cause a 51% attack, so in theory the greater the ADA's market value, the greater the relative security. Because of this, it is important that monetary policy is designed to preserve the value of the currency and create incentive mechanisms (annualized income subsidized by inflation + treasury). In the future the idea is that the fees replace the subsidy and the incentives to use feedback to the security of the protocol.\r\n\r\nStudies on monetary policy are essential for the community to understand the impact of changes in the blockchain's base parameters. Over the past few months we have noticed a considerable increase in the transaction fees of the blockchain as the tx fee doesn't take into account the price appreciation of the ADA asset. This type of tx fee will be defined by governance and for the community to make this type of decision it is essential that there are people studying the impact of these changes. Today the IOG is in charge of this work, but creating this challenge will allow the community to begin to assume an important role for the decentralization of Cardano.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I am not sure that this is the most urgent matter for which we should set a challenge at the moment, although it is good to be showing interest in it and to be thinking about ways that the community can contribute to ideas about monetary policy. In particular it is important that transaction fees should be sustainable, which is both about making sure they remain affordable but also that they remain in demand , which is a complex matter, especially with the addition of layers like Hydra coming on top of Cardano which may provide opportunities in that regard. It may be worth waiting until IOHK's research and proposals in this regard are clearer. What arguably should never be questioned is the need for ADA as the key to EUTXO in the base layer, and the value of its being scarce and highly functional. Systems which enable it efficiently to be lent and borrowed will emerge over the next year that will give a much better idea of how this can work practically to manage use parameters that may be important.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This challenge might be difficult to adress to a notable portion of the Cardano community, however due to the nature of the challenge being on monetary policy connected to crypto and the fact that some people in crypto came there via the route of the interest in monetary policies, there might be a sufficient number of savants in the community to at least present a small number of valid proposals.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I am quite skeptical here because I just think that there is more of a developer or IT-educated people, rather than economics, but once this section gets approved, definitely we can find some proposers. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This catalyst community certainly has the capacity to address this challenge. Not only will existing members likely have ideas on how to achieve this challenge, the opportunity to increase community outreach and involvement is necessary. Through many discussions on discord, and elsewhere, it is often noted that the community requires a diverse background of expertise and monetary policy spans many professions that would help Cardano but are not necessarily involved at this time. \r\n\r\nIt is also very encouraging that any monetary policy be developed by and for the community. Allowing for an iterative development process that provides community members opportunities to participate in its development truly speaks to the nature of what we are trying to achieve through catalyst. In particular, as the funds continue to grow in available rounds, having a principled and reasoned approach to monetary policy can help overcome both known and unknown challenges. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Cardano is known amongst some academic demographic, but it is difficult to say if it attracted the attention of the financial world. With time, this could be the right challenge for the ecosystem, if the right audience exists to take on the challenge. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Varying degrees of interest into the topic of monetary policy is naturally coupled with an interest and desire to participate in crypto in general. So I feel the Catalyst/Cardano community would more than be up to this challenge if presented. High quality research, papers and articles are bound to be produced by the community if this challenge is set.\r\nThis challenge could also attract talented and capable economists from outside of the Cardano/Project Catalyst ecosystem by incentivising research into the field and thought development.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The community has the capability to either do this now or attract people who can.", "rating": 4, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 5, "note": "The more is see, listen and talk with people in the community, the more i trust it, deeply.\r\nOne of the goal of our community is to work in harmony with the scientific world or scholars. \r\nI can't see any reason for this challenge to fail.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I believe that the current Catalyst community itself may have some limitations to create proposals in this specific area, since it is very technical and would need very specific knowledge. Nonetheless, some people might have this kind of knowledge, and just didn't have yet the opportunity to show it. Also, this could attract people outside from Catalyst or even Cardano, as mentioned in the proposal itself, and it could help to bring more visibility for the whole Cardano ecosystem.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "There are no major technical challenges that involve creating proposals in this challenge, only people with knowledge in economics, game theory, incentive models and knowledge in blockchain. The Cardano community has people with knowledge in these areas and as the budget set is relatively low, the risk of funding this challenge is small.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This is a very technical area that is waiting for input from IOHK fro the community to be able to be properly engaged, but it is good that this challenge has been proposed so that people in the community can start to think deeply about what is important about monetary policy and how it works.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The criteria and metrics are diverse and well-defined in order for them to ensure the auditability of the potential proposals and also allow a number of diverse proposals exploring different aspects of the issue.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "metrics described in detail. \r\n\r\nGood one.", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposer has clearly thought out an extensive list of measurement indicators to prove whether the challenge will be a success. The indicators allow for a wide range of activities to be undertaken in the challenge so that innovation can continue to be pursued. \r\nI would have appreciated a bit more details on the budget and how $50,000 was decided as the right number? Is this reasonable for this type of work? \r\n", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposer has demonstrated a deep understanding of what a successful monetary policy challenge looks like. They have presented an extensive list of KPIs and performance metrics to follow. Potential expansion of this challenge could include students majoring in Business who could apply for a Cardano grant with a proposal \"case study\" etc. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The definition of success is clearly outlined and would be easy to understand to future applicants. The metrics are appropriate and would be a easy to quantify and measure.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "I think even more important than the metric stated are that proposals emerge which can challenge and improve the way Cardano Monetary policy is currently conducted. Maybe we end up with an elected board of governors in a Cardano Central Bank DAO. what are the governance procedures for it?", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "There are probably no real metrics that could be used to measure progress of the challenge at the begining.\r\nThe only metric i can measure right now, is the budget, and it seems to be a little bit too low as the challenge is to keep creating a new global financial system, almost from scratch, while boarding some of the greatest minds out there, at least, those who have not heard about cardano and catalyst project yet.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The success criteria is clear, and proposed matric are very good. They will lead the goals of proposals under this challenge and they are very broad and embracing. It would be good to have some quality check in regards of verifiability in this case instead of only numbers, since some metrics could be easily achievable if quality is not taken care of.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The definition of success is relevant to indicate the performance of the challenge and the metrics described present a good range of indicators to assess the performance of the challenge. The only point that needs to be improved is the definition of a time interval to assess the success of the challenge.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics are all interesting and not un-useful if we get to the point of needing to examine closely whether policy should change and why, but I do not personally think we are at that point and it is worth seeing how Goguen and Hydra are implemented and how adoption evolves over the next year before assessing that we should have such an introspective process running. It may be that more practical metrics as to what might be achieved by such introspection should be used should we come to needing it. For the time being though lets focus on finishing the implementation of the roadmap and boosting adoption by. communicating the excellent base monetary policy and hopefully the high quality research based implementation of it through eg Babel Fees and Hydra for microfinance. In that sense encouraging clear communication materials around these matters is worthwhile, but maybe that should be IOHK/Cardano Foundation responsibility rather than Catalyst.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}], "importance": "Monetary policy is the use of monetary authority to control the supply and availability of money.  \nA financial operating system for the world is bound to be defined by its monetary policy - so it needs to be explored.  \nCardano stakeholders are the ultimate monetary authority in the Proof of Stake system and the system runs as a proxy of this authority.  \nHaving stakeholders in charge of a PoS system brings distinct possibilities and advantages to a PoS system that has inbuilt governance, such as Cardano. When combined with Project Catalyst / Voltaire - the possibilities are endless.  \nStakeholders and future partners need to identify pertinent monetary issues that will be relevant to Cardano stakeholders and to the systems structure and future development.  \nThis is not a Challenge designed to change the current Monetary Policy. It's aim is to explore it fully.  \n**The proposed budget of USD50,000 is designed to motivate sufficient proposers to be able to launch and contribute certain deliverables on the Cardano monetary policy in any form that they see fit. However, the proposed sum is not larger - as the challenge has a limited scope at the current moment of Cardano's development - yet it could potentially lead to other future initiatives, if successful.**The point of the challenge is to provide scientific and economic analysis about future evolution of a revolutionary monetary system such as Cardano. There will be macro trends that need to be identified, possible scenarios that may emerge depending on adoption. The Cardano ecosystem needs to be aware of all implications.  \nCardano has a general Monetary Policy document available\\* The current Monetary Policy as it stands addresses two issues:\n\n*   The necessity to offer rewards for people who participate in the network\n*   Funding the treasury  \n    However, a true financial operating system for the world will eventually need to explore its Monetary Policy in more depth.  \n    What will a new financial operating system for the world look like? If it has governments as partners and if it has large corporate and small business partners, as well as international organizations - eventually the monetary policy will need more definition.  \n    Proposers should explore consequences of laissez-faire (minimum or no interference) policy - no changes to current status quo and scenarios that it may lead to  \n    The full range of goals of Cardano monetary policy should be identified and their implications  \n    Are the concepts of inflation / deflation relevant and how for Cardano? How do we measure inflation in a blockchain-based system?  \n    Specific monetary policy objectives that should come on the radar of Cardano stakeholders should be identified.  \n    Effectiveness and consequences of different monetary policy alternatives explored, even if they are small (changes to rewards systems) or large (modification of key tenets).  \n    Identify pros and cons of why / why not Cardano will need a monetary authority (or new solutions) and what are possible avenues ahead  \n    In any case, decision will have to be made about monetary policy and for decisions to be made, theoretical and practical issues need to be explored.  \n    In order for issues to be explored and researched - they need to be identified first.  \n    Right now a new economic monetary genius or crack research team is somewhere looking for a monetary system to test some revolutionary ideas on. Cardano is a system that - with its decentralized nature independent of any government - can allow for real-time research and proposals to be developed and theorized about.  \n    Monetary ideas or tools that were impossible or too complicated for legacy financial systems may be invented or reimagined for a new financial operating system such as Cardano.  \n    It might be as simple as changing the reward scheme to providing a new scale of incentives to tweaking network parameters based on developments from new economic theory.  \n    Cardano needs to open the door to the brightest economic minds and to open the door to the best research teams.  \n    This challenge is about starting to open the door, leaving it ajar for economic talent to join us.  \n    **Important note: This is a Fund7 Challenge Setting proposal - for a future challenge in Fund 7. This means I am not personally applying for funding in this challenge! The proposed budget of USD50,000 would go to fund proposals developed by future proposers in Fund 7 who would apply to find solutions to this challenge. I have no proposed solutions nor am I suggesting the best way of addressing this Challenge it will be up to proposers in Fund 7, if this is selected as a future Challenge.**  \n    \\* https://docs.cardano.org/en/latest/explore-cardano/cardano-monetary-policy.html"}