{"id": 350798, "author": "JO8N", "title": "PROJECT CATALYST'S FIRST NFT ART 🌅", "url": "http://app.ideascale.com/t/UM5UZBiQx", "category": 25946, "amount": 800000, "description": "**Can Project Catalyst's first NFT art draw a worldwide Declaration of Independence?🌎🌍🌏**", "no_assessments": 24, "rating": 1.9166666666666667, "videos": [], "media": [], "assessments": [{"question": 4, "note": "While this challenge could indirectly contribute to cardanos success by possibly advertising project catalyst, it is not directly focused on the cardano network. In it's current formulation it rather sounds like an individual proposal than a funding challenge, which could in a best case scenario add some value and popularity to Cardano but is in fact not critical to it. I encourage the proposer to propose a similar, fine-tuned proposal in a NFT ore generating popularity/value related funding challenge though.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "While NFTs are certainly an important part, this challenge reads more as a specific proposal.", "rating": 1, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 4, "note": "This is a fantastic idea! The \"Jodorowski Dune\" of Cardano as a short film NFT.\r\nIn terms of impact and alignment, this proposal have the potential to establish very valuable assets :\r\n-Assembly line for creating future audio/video assets \r\n-Artists Collectives within the Cardano Network (Audio/Visual/Design/etc...)\r\nThe video examples the proposer have listed are great to convey the idea, but a clear and precise composition/tone/style is missing.\r\n\r\nKeeping the Cardano style of showcasing Mathematicians, the proposer's use of Fibonacci sequence for pricing the NFT is very well positioned. A consideration is to the accessibility for a regular ADA holder to participate after the 40th bid?", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "The idea has merit but seems to have adopted a massive project that does not necessarily meet the criteria for the challenge. The author acknowledges that the budget is extreme. I would suggest a smaller proposal based on similar principles might be workable with attention to Fund challenge being noted. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "It is difficult to extract what exactly the proposer is suggesting here, however, one can assume they aim to promote Project Catalyst and therefore Cardano with an NFT marketing campaign. It is also unclear why this has to be an NFT project and can't simply be a filmography-oriented challenge. Overall, it does not appear to be critical to achieving Cardano's mission. ", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This would be one of many possible marketing formats for Cardano. Its not clear this one is critical to Cardano's misison.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "There is a real need to attract attention to Cardano's NFTs since it's probably the best blockchain for this application. The proposal is very good, and there is also another challenge setting with similar idea. In this case specifically, as mentioned in the comments section in IdeaScale, the challenge should not suggest the use a specific platform, as it does and it is also mentioned the use of NFT-DAO in the key metrics of the challenge. I believe that the challenge setting is great, but because of that I can only give it a rating of 3 for alignment.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "The description of the challenge question and the description of the importance are subjective.\r\n\r\nIn general, NFTs are an important topic and deserve a challenge, but this challenge does not present a clear idea of what proposals can originate.\r\n\r\nThe challenge description is full of jargon, technical terms, references and catchphrases that do not aid in the description. My recommendation is that the description of the challenge should be concise because several people will need to rely on this description to make proposals. If there is no objectivity and clarity in the purpose, confusion occurs and this reduces the efficiency and productivity of the participants.\r\n\r\nThe description mixes the concepts of the creator's personal proposal with the concept of the challenge and ends up generating confusion.\r\n\r\nThere is no way to indicate the alignment of this challenge with Cardano's mission as there is no clarity as to what it is about.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I think it is great to think about ways that Catalyst could be used as art itself, but that this might deter be structured as a proposal for something specific rather than a challenge. This is because at this stage we are trying to encourage functionality, development and adoption of the Cardano network in an increasingly competitive environment and so our challenges should be directed more towards areas dealing with those aspects. ", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The tasks neccessary to conclude such a challenge (e.G. creation of art/animation, it's marketing and creating an NFT for it might be tangible for a part of the catalyst community. Still the description makes it hard to grasp the exact requirements and skills for fulfilling the task envisioned. Thise could have been formulated more concrete.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "While the community has the capacity to create NFT art and marketplaces, this proposal is not really a challenge, but a bucketed proposal in itself.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Difficult to gauge as too many variables and hence why this proposal needs to begin in a scaled back version. Collaborating and plan building as it progresses. Again the author acknowledges the risk but has not taken necessary steps to show how we can mitigate that risk.  ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "There has been an explosive interest from outside of the blockchain audiences towards crypto because of NFTs. This has attracted many to project Catalyst and since the last fund, there have been projects in the running to get funded with relation to NFT space. Taking this into account, as well as increasing amount of onboarders every day, it can be assumed that the Catalyst community will have the capacity to address whatever this challenge is in Fund7. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Its not clear that the community has the ability to make an art piece that would satisfy the goal.", "rating": 1, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 5, "note": "Some NFT proposals have already been submitted in other challenges in the past Funds and I don't see any difficulties on the Catalyst community coming up with new proposals for this specific challenge. Although, I don't agree much with the calculating done to set the challenge budget. It seems to be too much, as it's asking for the whole Fund or even more, if available. NFTs project really are very important, but the budget could be set to be smaller and, later on, if successful, it could increase for new Funds. Such a big Fund specific for NFTs could even create space for funding low quality proposals.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The Catalyst community is fully capable of developing NFT-related proposals, but the challenge description is extremely confusing and this does not allow us to identify which proposals can be created. In addition, the description mixes ideas from a proposal with the concept of the challenge and there is no clarity of what the proposal is and what the challenge is.\r\n\r\nThe challenge is requesting the entire available budget and I think it is not feasible, even though there are dozens of proposals related to NFTs in Catalyst, creating an exclusive challenge for this niche will expand the budget above what I see as reasonable. If this challenge is approved, we will have an exclusive challenge to create proposals related to NFTs and in addition several other challenges also allow the creation of proposals on NFTs, because NFTs are a broad theme and fit into different niches.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I hope there will be many artistic people in the Catalyst community who might be interested in proposals like these, or challenges in respect of them, but maybe this should be pursued as a subgroup of Catalyst for that type of purpose. That could perhaps form part of a proposal.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Participation in creation of NFT art is one suitable metric, but the other metrics are not quantified or measure other things that are not directly related to the challenge.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "This is potentially a great idea that needs to slow down a little, engage with the community and find a level of risk that is reasonable. If the author sets about making the connections within the CP community I believe they may progress this idea and develop metrics that are achievable.  ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposer suggested several KPIs which could serve as accountability metrics for the suggested challenge. This list can be expanded upon given the complexity of the challenge and the vision behind it. The proposer could also benefit in the future from applying common language and breaking down their vision into simpler terms. The success of one's endeavor depends on how clearly one is able to communicate it to others. We may all be able to read/write English, yet we all learn it in a different way and live in different areas, therefore simpler does more. ", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "No clear metrics for success, other than \"sell and NFT for a lot\".", "rating": 1, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 6, "note": "Success criteria is clear and well defined. Although, key metrics should be better worked out, because some of them are not metric but goals (e.g. \"Exponential participation…\", \"Viability of NFT…\", \"Rewards for completing…\", etc.). It should state key metrics related to proposals as well, for example, number of active users, number of NFTs and single digital assets created, trade volume in a specific period, etc. More information about how to check if the proposals have achieve their goals should be included in the proposal.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics described are not objective indicators, in addition, one of the metrics is endorsing a particular proposal, which goes against the objective of the challenges. Remembering that the creator of the challenge filled out the self assessment checklist stating that there is no endorsement of a particular proposal, but mentioned the NFT DAO a few times and although he wrote that it was just an example, most of the description ended up being of the proposal and the concepts were mixed.\r\n\r\nThere are no reasonable elements to verify the success of this challenge.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "For challenges we need criteria and metrics that can elicit high quality and specific proposals to address it and I think those appended would need more work to be worked into specific deliverables that could form part of a challenge int he future, or challenge within a subgroup of Catalyst proposal as referred to above.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}], "importance": "**Can Project Catalyst's First NFT Art draw a worldwide Declaration of Independence?** 🌎🌍🌏\n\n  \n**Yes**, because **decentralization is localization**, and **money is only as good as its art**.\n\n  \n\n(The following is only **my example** of Project Catalyst's First NFT Art, but **it is not THE solution**.)\n\n  \n**VISION** 👀:\n\nUtilizing the **synesthesia of sight and sound** **through abstract representation** as seen/heard in \"Idle, Torrent,\" our NFT can appeal to a **worldwide audience**.\n\n  \nThis worldwide audience can be **educated visually on the mechanics of the Cardano Roadmap/Logosphere** (Ouroboros, Daedalus, ADA, Voltaire, Catalyst etc.) and **educated philosophically through a** **chain reaction** as seen in \"3M Brand Rube Goldberg Machine.\"\n\n  \n\nThe depiction of this chain reaction through digital **Japanese style 2-D animation** as seen in \"Machine 機械 Sakuga MAD 2\" can boost participation in Japan, where Cardano's Initial Coin Offering took place.\n\n  \nBy **directing this Japanese style 2-D animation from the actual Cardano Source Code script** as seen in \"How to Create Word Cloud Text Portrait Designs!,\" the **gap between programming and non-programming language can heal**.\n\n  \nIf this programming and non-programming language barrier heals, **inconceivable possibilities materialize** as seen in the **commercial success** of the \"Matrix He is the one 1080p Full HD.\"\n\n  \n**A commercial success of Project Catalyst's First NFT Art is the fruit of the Cardano network's labor**. \"How Trees Secretly Talk to Each Other in the Forest | Decoder.\"\n\n  \n**NFT SHOWCASE 📽:**\n\nThe **biggest issue facing NFT art is how to showcase** the certifiably purchased art.\n\n  \nI propose a solution using **movie theaters**, which have the largest ubiquitously available screens and social seatings, to **showcase Project Catalyst's First NFT Art** 🌅.\n\n  \nIf Project Catalyst is successful in displaying its art in a movie theater using a **proof of concept approach to identity certification with NFT**, not only will sale price and media attention increase, but also, the cultural foundation for **Pokemon style NFT \"battles\" at movie theaters** becomes a real possibility.\n\n  \nWith the media attention surrounding public support of Gamestop and AMC, Project Catalyst can show one solution to the public that conventional finance never would.\n\n  \n**BUSINESS🤑:**\n\nAnimated films announce rates of **anywhere from $10,000 to more than $200,000 per minute**.\n\n  \nWith this huge range, I think it is **safe to assume closer to the $200,000 mark with the complexity of my proposed task** (with a length between ~3:14 to 7:12).\n\n  \nHowever, with the fresh Cardano market, the Project Catalyst stamp of approval, the work with NFT-DAO, the media attention, the sale price, and the showcase use case, it is a **big risk for a big reward.**\n\n**Using a Multi-Level Marketing style rewards based system with ADA for larger contributions and NFT for smaller contributions, we can give merit based rewards for each section of the completed work, no matter how small. This will facilitate the division of labor and create an assembly line system. A finder's fee can be given to community members that find specialized labor, including animators, a venue owner, musician, programmers that draw etc.**\n\n**AUCTION ✋:**\n\nAfter the showcase of Project Catalyst's First NFT Art, an **auction reaction livestream** by Charles Hoskinson (and potentially other IOG members) to the bidding would be ideal (if said people wanted to of course.)\n\n  \nIn addition, the **auction's bidding would take place in Fibonacci numbers** **to produce maximum excitement**.\n\n  \nThe NFT smart contract would embed this logic as well, so later sales maintain the Fibonacci sequence.\n\n  \n**PROJECT CATALYST COMMUNITY BUILDING🔄:**\n\nThrough the lens of this Fund7 challenge proposal, I believe **every current Fund5 challenge setting can be adapted to further the use case of Project Catalyst's First NFT Art**.\n\n  \nCommunity members can **feel free to propose ideas in collaboration with this proposal in Fund5 challenges**.\n\n  \nKeep in mind, **80% of Internet traffic (data wise) is video**.\n\n  \nTherefore, **all Fund5 challenges combine for $1,700,000 and 80% of Fund5= $1,360,000**.\n\n  \nThis would be an **unheard of collaboration within the community**, so an unheard of figure is not out of the question in my opinion.\n\n  \n**Project Catalyst sponsored the framework for NFT-DAO, but now, what funds are available for the DAO to make an NFT?**\n\n**TLDR**:\n\n\"Idle, Torrent\" https://www.youtube.com/watch?v=6gH7maR3XPE **+** \"3M Brand Rube Goldberg Machine\" https://www.youtube.com/watch?v=GEzcO3nfjZk **+** \"Machine 機械 Sakuga MAD 2\" https://www.youtube.com/watch?v=TneoJDExtN4&t=262s **+** \"How to Create Word Cloud Text Portrait Designs!\" https://www.youtube.com/watch?v=RtUum5zB8Oc **+** \"Matrix He is the one 1080p Full HD.\" https://www.youtube.com/watch?v=zYwdzYC3uUc&t=70s **+** \"How Trees Secretly Talk to Each Other in the Forest | Decoder.\" https://www.youtube.com/watch?v=7kHZ0a_6TxY **\\= Project Catalyst's First NFT ART 🌅**"}