{"id": 350877, "author": "vladimirp", "title": "Ouroboros: Endless self-disruption", "url": "http://app.ideascale.com/t/UM5UZBiSF", "category": 25946, "amount": 30000, "description": "How can we ensure that the Cardano system nurtures bold minority contrarian views on KEY elements of ADA ecosystem in the next 6 months?", "no_assessments": 30, "rating": 3.933333333333333, "videos": [], "media": [], "assessments": [{"question": 4, "note": "I think that supporting and encouraging ideas that are completely experimental, unorthodox, or new in some way is very important to develop. It applies to everything if a development is a goal.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This is indeed an interesting proposal for a challenge. It indeed needs to be assured that new approaches are not shunned right away and get, as long as they are within legal framework. While I don't have the impression that new opinions get shunned or don't have the change to prevail if they are really well made, some kind of open discussion and sandbox environments could still be very beneficial to the Cardano ecosystem.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Maintaining a path toward distributive, novel, ideas is vital for the success of Cardano's mission in all the fields it's currently engaged with. Actively encouraging disruption would represent a unique approach.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I believe this outside the box thinking is critical for enabling Catalyst to continue to thrive. The proposer mentions the echo chamber of today's society and the need to fight against the norm. Echo chamber defined - \"an environment in which a person encounters only beliefs or opinions that coincide with their own, so that their existing views are reinforced and alternative ideas are not considered.\" This proposals ask a lot of the right questions, but also admits they do not necessarily have the answers. It is a refreshing view to admit the need for help and cultivate an open discussion.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "It is important for an experimental community not to get locked in a tunnel visioned mentality. Therefore it might be interesting to provide an opportunity to explore what else might float in community members' minds that is not worked on yet because of mainstream thought processes dominating the platform. \r\nAs stated, planting the seeds for this early on might grow in some hefty fruit-bearing trees later on and come to the benefit of all of us. \r\n", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Whilst I may not feel that this challenge proposal is critical to achieve cardano's mission the author has certainly hit upon a useful concept. How to encourage those that swim against the tide. I feel the community will recognise the net worth of encouraging and welcoming all views even if they do not necessarily agree with them. This proposal is in line with the theme from references such as 'unleashing the masses' ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Interesting idea. I am not sure how we manage to fund minority views in a challenge that is voted on in a majority way. This would need some new kind of voting and ranking mechanics", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I believe that the idea to stimulate disruptive and innovative ideas should be something in the core of Cardano, and this proposal addresses that. This can improve Cardano in the long term, and even though it's not 'at first' linked to some goals related to challenge setting, it indirectly contributes in that direction. With a small budget like the one suggested, I believe that this is a very valid experiment.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "One of the proofs of the relevance of this challenge is the very existence of Cardano. If it weren't for the minority and contrary view of Satoshi Nakamoto, we probably wouldn't be here today. If it were not for the opposite view of Charles Hoskinson on the direction of Ethereum we would not be here today.\r\n\r\nI think it is important that the minority's opinion is not drowned out by the crowd. The debate must be guided by reason and common sense and not by popularity, as the majority did not always take society on the most promising path.\r\n\r\nRegarding the legality of the ideas presented, I think it is important to indicate that legality is a complicated concept, ethics and legality are different things. Slavery was legal not too long ago.\r\nThe use of cryptocurrencies is legally banned in several jurisdictions with empty and misleading arguments (money laundering and terrorism are two puppets used by governments to gain popular support and mask real interests)\r\n\r\nMy point is that we shouldn't exclude ideas simply for legal compliance.´\r\n\r\nTo conclude, I think this challenge is important and is fully aligned with the mission of Cardano and Catalyst.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I would agree that \"red team\" self assessment is very worthwhile but I on't think it should be set as a challenge. The Catalyst process itself is designed (and evolving) to incorporate self assessment and challenge. It is good to remind ourselves of that and for all to participate in a constructive but challenging manner.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "definitely creating a special fund for \"groundbreaking\" ideas would work, but how do we know which idea is more or less groundbreaking? But it can be done for sure. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "While programming sandbox-like testnet environments might be a bit of a challenge, many other participation tools could probably be easily adressed by the community.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The proposal seems very promising in essence and theory, but in practice there might be a problem. How is a would be proposer to this category recognise his proposal as radical or disruptive accurately. How is the community to correctly identify an actually disruptive proposal without mistaking it for an outlandish and foolish view - being in the misunderstood minority often results in that. I see the small budget of this proposed challenge as both a blessing and a curse, you certainly don't want to experiment with a lot from the start on bold new ideas, but on the other hand truly disruptive concepts may require much more. Still, something well worth trying by the community.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "From my experience in Catalyst the Cardano community will embrace \"Contrarian, radical and bold ideas.\" Still, I do see a need to continue to reinforce this growth so we do not revert to just another mediocre cryptocurrency project. I believe creating the type of sandbox environment mentioned in the proposal is possible, but I would have liked more details about how this differs from the test net. Also, if funding is received what are the first steps to develop and deploy this proposal? Please continue to connect with community members to build a team.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The feasibility of this challenge proposal would depend heavily on the needs of the voterbase. If there are a lot of community members that would like to appease their curiosity at a relatively low strain on the fund budget, it is very likely that this proposal might pass. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The PC community is showing great resilience to date at remaining inclusive and open minded in the face of alternative views. The community welcomes challenging ideas and to date (in my experience) handles contrary view with respect and commitment. This type of challenge is likely to strengthen the community further. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I am sure the community can generate thses idea. The current governance of catalyst projects is based on majority voting however so I am not sure how we can implement it with the current framework.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Being part of Catalyst for 3 Funds so far, I've seen lots of people that have non-usual ideas that are not well accepted by the majority, but if we bring them all together and let the community vote, the outcome might be surprising. Since the budget it not large, I believe that the community will be very capable of writing good proposals in this challenge.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This challenge presents no technical barriers and this increase the reach of proposers. The defined budget is relatively low and was set to test the potential of the concept, which makes the resulting proposals have greater competition and with that the chances of a good quality proposal being funded increases.\r\n\r\nThis challenge primarily requires free thinkers and good ideas and the Catalyst community is full of people with these characteristics.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "It does, and it is evolving, through Catalyst.", "rating": 3, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 6, "note": "well, no metrics are stated in this project, but I do not need to see them at all. Having a given budget, and new ideas posted - and their realization will serve as an indicator, how good a decision it was.\r\n\r\nWhat I think can be done is - having a fund for \"experimental ideas\" or ideas that \"did not fit in\" to any other section. Ideas posted in this fund would be an indicator. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Some of the criteria are quite possible to measure, while others might be difficult to quantify, especially given the fact that \"non-traditional and contrarian views\" can be defined quite differently for different people, given the fact that everyone has their own subjective views on what is contratrian and radical.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The aim of the challenge for now, in what I imagine would represent a first step, is the creation of networks, communication channels and sandboxes for the nurturing of fringe, potentially disruptive ideas. I would recommend clarifying and detailing this point and also expanding on the vision of how these networks, communication channels and sandboxes would then lead to the generation of disruptive, revolutionising ideas and practices.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposal attempts to set metrics to measure success, but they are still vague. There are 6 possible metrics listed and none of them have a fixed amount associated. It is challenging to define \"non-traditional\" or \"contrarian\" so it will be difficult to set static goals. Who gets to be the judge of visionaries, orthodoxy, or \"a general sense of a widening\" of community views? The nature of the problem the proposer is attempting to solve makes judging success difficult. My advice would be to start with a baseline of how many creative proposals you see per fund then set clear quantitative metrics for which Ouroboros can measure success.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposed challenge fund is set modestly, but correctly as it is meant to explore the community to reveal any hidden potential. The proposal is very broad for interpretation, which seems to be the point of the proposal. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Author has had a valid attempt at suggesting metrics suitable for the challenge. Funding budget may be a little low but can be revised. Some metrics will be difficult (but not impossible) to assess for example \"a general sense of a widening, not narrowing, of the community's views, discussions, ideas, projects, focus\". Overall however, the premise is sound and the proposal has merit. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "More thought needs to go into how we enable and measure success here. In reality we want high failure rate, but big impact from a small number of successes. Funding for any individual project should be capped at a small percentage of total fund. There should be staged funding such that we cull quickly and early, but then provide follow on funding to the small number of successful projects.  Perhaps the goal is just to provide enough funding to get a project to an MVP where it can then go through another challenge and scale up to production? But is that different to many projects already?", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The success criteria and metrics related to this challenge are well stablished from a general perspective. Although, it might be needed to create specific criteria for each project related to its specificities. The subjective impact of this challenge, however, might be more difficult to measure, but the community could be invited to give their opinion about the funded proposal(s).", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics described for success assessment are relevant and allow the community to check success in a tangible way.\r\n\r\nThe definition of success is reasonable.\r\n\r\nI recommend including a time frame so that the success assessment can be more objective.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics would need more work so as to suggest criteria by which self assessment in Catalyst for example could work better.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}], "importance": "One of the inherent dangers of any majority led system is that only majority views will prevail. This in itself is democratic, but voting is a democratic mechanism, while true democracy is a system that allows minority view to flourish and eventually - if they are healthy and sound - grow to become a majority view.  \nCryptocurrencies emerged partly as a reaction to the established system and the established way of doing business. Cryptocurrencies are in essence a reaction to the establishment. However as crypto starts going mainstream a new class of tech savvy early entrants become part of the new establishment.  \n  \nThere is a risk of missing radical talent and great innovators as the Cardano ecosystem becomes more complex. There will be multiple layers of \"middle decentralized management\" and more institutions in charge of running the protocol, creating dapps, running nodes, community advisors, consulting companies, etc…  \nEvery groundbreaking idea is in its essence a minority view at the very outset.  \n\"Today's \"best practices\" lead to dead ends; the best paths are new and untried.\"  \nThe issue is how can we prevent the continuous exclusion or sidelining of minority, contrarian views on key elements of the Cardano ecosystem in order to avoid driving away new visionaries and regressing into an echo chamber environment?  \nIf the new Satoshi Nakamoto or the new Charles Hoskinson or the new Steve Jobs is lurking in the shadows of the current Cardano ecosystem and has radical new ideas, will the system embrace him/her - or leave them standing at the gates?  \n  \n\n\"The most contrarian thing of all is not to oppose the crowd but to think for yourself.\"\n\n  \nIt is probable that radical innovation ideas will not be understandable immediately to the voting majority of stakeholders and the system may shun future visionaries.\n\n  \nHow do we ensure we don't lose this visionary and give him/her some room to play and some time to develop the vision, instead of just slamming the door? Maybe some key tenets of the Cardano ecosystem need to be revisited?\n\n  \nDo we need a special sandbox environment for radically novel ideas and plans that could not attract normal funding, but could thrive with a little Catalyst magic?\n\n  \nHow can this be resolved?\n\nThe proposed limited size of budget for this challenge is designed to motivate proposers to address this issue with initial proposals and projects, as it a challenge that lays the ground to ensuring the continued vibrancy of the Cardano ecosystem. If we plant seeds to longevity early, we can benefit reap the results a long time from now.\n\n  \n**Important note: This is a Fund7 Challenge Setting proposal - for a future challenge in Fund 7. This means I am not personally applying for funding in this challenge! The proposed budget of USD30,000 would go to fund proposals developed by future proposers in Fund 7 who would apply to find solutions to this challenge. I have no proposed solutions nor am I suggesting the best way of addressing this Challenge it will be up to proposers in Fund 7, if this is selected as a future Challenge.**"}