{"id": 351795, "author": "SofiH", "title": "Sustainable Development Goals 2030", "url": "http://app.ideascale.com/t/UM5UZBiiI", "category": 25946, "amount": 102030, "description": "How will you drive high impact collaborating in the Cardano and global community to achieve the 2030 Sustainable Development Goals (SDGs)?", "no_assessments": 27, "rating": 4.148148148148148, "videos": [], "media": [], "assessments": [{"question": 4, "note": "Fulfilling the sustainable development goals is critical to humankinds survival and a better future for everyone. While the destruction of the planet and unsustainable economy only benefits few, tending the SDGs benefits everyone and hence is in the interest of most, which makes it align perfectly with Cardanos grassroot oriented decentralised decision making process. Fulfilling the SDGs is, for the abovementioned reasons, indeed very critical to cardanos mission.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "There is certainly a lot of overlap between the Sustainable Development Goals with Cardano's mission, but this can be said of all projects that aim to have a mid- to longterm life. As much as I want this to be critical, I do not see the strong connection in this proposal by restating what the UN said should be accomplished.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This challenge is a great example of alignment with Cardano's goals. It is much needed and necessary for everyone. It also has the potential the bring more positive media coverage to Cardano and it's projects. There is enough information here to inspire people to engage and tackle relevant challenges to create a better future.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "altough it is a noble idea, I do not believe that this should be the next fund section. I think, that currently, many other organizations are supporting it, and this has less to do with Cardano itself. \r\n\r\nOf course, if we have a planet in a better condition, it can accelerate the whole world thus adaptation of blockchain tech.  etc. Definitely, there are good outcomes of such an endeavor. I just do not think that it is something new, groundbreaking, or overlooked. \r\n\r\nThere are definitely larger subjects than Cardano, which are promoting such endeavor, and this would be just a waste. With all the respect. ", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Whilst this proposal is so expansive that it could be an umbrella challenge for quite a number of things, e.g. an all female team from the Pacific Islands developing a DApp but under this challenge, this falls well and truly under the Cardano vision. We think long-term. That's the game and this challenge is the summary of everything we do, outside of building the future global operating system. Because of its encompassing goals, relevant proposals which may fall under a different category could decide instead to submit it under this challenge if there is a belief that it can have better chances of being approved (much like the example above).  ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Great idea. This could help bring in many more entities to the Cardano ecosystem and drive wider adoption whilst working to wards a better future for us all.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "While environmental concerns are urgent and important to us all, it is not clear how this will help achieve Cardano's mission. It is perhaps too early for Cardano to start changing the way people live and behave. During these early stages of growth, it is important to continue developing strong foundations for the community, before its ready to embark on larger global issues. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This is an outstanding proposal which is well-written, well-thoughtout, and well-aligned with Cardano's mission. While it may not be the most critical challenge for the Cardano network, the criticality of sustainable development makes it a showcase project to demonstrate how the Cardano Network can be leveraged to achieve local/global goals.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Projects that enable greater energy and environmental efficiency, social advancement and better governance are definitely to be encouraged. Use cases such as commodity provenance, ESG and supply chain tracking, direct and auditable finance into local NGOs, energy efficiency and trading coupled with digital inclusion in association with development agencies are all exciting areas where Cardano and its partners could have particular abilities and appetite. These, and the protocol participants' commitment in these areas to date, are all reasons the world should look at implementing Cardano solutions to solve pressing development and ecological problems and some well though out, engaging proposals would be a great way of enthusing the public and governments about the utility, importance and engageability of Cardano in these tasks.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The catalyst community is indeed very diverse and compromised of people and visionaries from a variety of fields, so they have a lot of potential to use their joint capacities to adress issues as multifaceted as the SDGs. I indeed see this community as a multidisciplinary think tank", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "At a local level, some of the SDGs are currently addressed through funded proposals and IOHK/IOG's (and their partners) work - in Ethiopia for example.\r\n\r\n\"Life below water\" is one SDG that I don't see the community tackle at this point at all.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Some proposals in Catalyst are already aligned with sustainability goals, but to have an exclusive challenge for that would be great. The mentioned proposals are examples that Catalyst community is capable of presenting proposals in this area, and this could also bring more people onboard and leverage Catalyst's visibility in very relevant knowledge circles.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I think this would attract rather new people, than current community, which would definitely be good, but as I stated above, such goals are already propagated by other subjects (organizations, states) and I do not think we would create a large attraction of newcomers. ", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This is a resounding yes. The Cardano Community consists of like-minded people who have envisioned a future world that is equitable, safe, healthy and progressive. Besides the different kinds of proposals that could arise, all aligned to the fulfilment of SDG goal, teams themselves could be representational of those ambitions. We don't need to wait for 2030 to see where we are at. We already have resources now, if pooled correctly to begin representing how we want to be in 10 years' time. Kudos for proposing this challenge because I can't wait to see how well the community will respond. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "We can and should step up to this challenge.", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 5, "note": "Cardano community is growing by the day, attracting an array of talent around the globe. Each individual comes with unique worldviews and positions. Prior to exploring ways this talent pool can be directed to tackle global humanitarian issues, perhaps it's best to exhaust all options aimed at improving the ecosystem. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Several Catalyst proposals are already considering issues of equability and sustainability, so a focused effort on these objectives is feasibility. The focus this challenge would provide, and in particular its wise statement of a maximum of 20% of funds to one project, will motivate higher quality proposals in this area.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Cardano's community is more engaged in thinking about solutions for these issues than any other blockchain protocol's, but it is worth thinking about how to garner outreach and contacts in government and other agencies that can partner with particular projects, and who in the Cradno community can help expand them.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The SDGs are publicly available for everyone to read, so there should not be any big problems in measuring how well a particular project adresses one or multiple of them.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "About half of the proposed metrics are incredibly difficult to measure.\r\n\r\nNumber of developers this community-focused challenge brought into the Cardano ecosystem, number of new Cardano users (overall users does not measure progress of this challenge), and even just tracking impact on any of the SDGs is incredibly difficult to measure and impractical.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Key metric are very well aligned with the challenge goals and represent a good starting point for the proposal and for the challenge itself. Success criteria is also clear. Linked information is relevant. The challenge setting has all information needed to be successful.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "metrics are very detailed and implemented very well. No objection here. ", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 6, "note": "There's a lot of details added into this proposal. It's very well considered that all manner of metrics have been added and all are valid in terms of how we should be measuring Catalyst projects. As mentioned in my previous responses, even team-constitution itself could be representational of the aspirations of the SDG2030. That said and idealism aside, proposals under this challenge will also need to be measured by the SDG ambitions which means the proposers themselves will need to bring additional and unique metrics which align with and stand up to the 2030 goals. The true measure of the progress and success of this challenge is the number of proposals that it generates, and I'm pretty sure no-one of us would be surprised. We'll have to on-board more CAs :)", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Detailed set of metrics. I expecially like the 20% cap to any single project. Caps should be added to all challenges. There were a number of proposals asking for large portions or all of challenge funds across the challenges this time. We need to encourage many projects.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposing team has given put forward a detailed plan for their vision and set a sufficient amount of KPIs and performance metrics. Should this challenge go forward, this will enable to determine the success of the participants and their projects' progress. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposal describes eight detailed metrics including for instance number of partnerships, proposals, projects, and hubs regarding the 2030 SDG.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "A good set of criteria and metrics. It would be good also to seek proposals that make best use of the specific technologies and functions within the Cardano blockchain itself that differentiate Cardano projects from what could be achieved in other ways.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}], "importance": "**\"We are the ones we have been waiting for\"** - June Jordan\n\n**\"Education is the most powerful weapon which you can use to change the world\"** - Nelson Mandela\n\n**Let's propose ideas that are designed with sustainability at it's heart, guided by the same founding principle on which Cardano was built upon.**\n\n**++Urgent solutions for urgent times++**\n\nMore people around the world are living better lives compared to just a decade ago. More people have access to better healthcare, decent work, and education than ever before. But inequalities and climate change are threatening to undo the gains.\n\nWith the world increasingly facing the extremely damaging impacts of climate change upon ecosystems, populations and species, the need to limit global warming to 1.5°C cannot be contested. Alarming data includes the loss of primary rainforest equivalent to a football pitch every 6 seconds in 2019 leading to dramatic consequences such as soil erosion, flooding, loss of biodiversity, carbon release or fishery livelihoods being threatened in small island developing countries, or the Coral Triangle region in South-East Asia due to warming water temperatures and coral bleaching.\n\nAt the core of the 2020-2030 decade of action is the need for action to tackle growing poverty, empower women and girls, and address the climate emergency. Sustainable development has been defined as development that meets the needs of the present without compromising the ability of future generations to meet their own needs.\n\nSustainable development calls for concerted efforts towards building an inclusive, sustainable and resilient future for people and planet.\n\nFor sustainable development to be achieved, it is crucial to harmonize three core elements: economic growth, social inclusion and environmental protection. These elements are interconnected, and all are crucial for the well-being of individuals and societies.\n\nAction against climate change entails structural behavioural change at an individual and systemic level to embed sustainable practices.\n\nThis will entail the adoption of a new framework of thinking to ensure sustainability is embedded at all levels of action, well beyond the social sector, and includes all strata of society.\n\n  \n**The critical core competencies required for sustainability include:**\n\n• Critical and systemic thinking - promoting and ensuring all learners acquire knowledge, embed values and develop the skills needed to promote sustainable development. Being able to discern and distinguish greenwashing from genuine sustainability, and shifting from thinking in siloes to thinking holistically and embracing complexity\n\n• Collaborative decision making - ensuring multilateral action so no one is left behind and the empowerment of all communities\n\n• Taking responsibility for the present and future generations - ensuring sustainable, alternative lifestyles and ideas from the consumer society and beyond are promoted and adopted by the global society\n\n  \n\nWith such critical competencies in place, sustainability can be achieved, with the fulfilment of the SDGs within the necessary time.\n\n  \n• Eradicating poverty in all its forms and dimensions is an indispensable requirement for sustainable development. To this end, there must be promotion of sustainable, inclusive and equitable economic growth, creating greater opportunities for all, reducing inequalities, raising basic standards of living, fostering equitable social development and inclusion, and promoting integrated and sustainable management of natural resources and ecosystems.\n\n• Investment in inclusive and sustainable economies can unleash significant opportunities for shared prosperity. And the political, technological and financial solutions are within reach. But much greater leadership and rapid, unprecedented changes are needed to align these levers of change with sustainable development objectives. #ForPeopleForPlanet\n\n• To achieve the Sustainable Development Goals, annual investment requirements across all sectors have been estimated at around $5-7 trillion. Current investment levels are far from the scale needed. With global financial assets estimated at over $200 trillion, financing is available, but most of these resources are not being channelled towards sustainable development at the scale and speed necessary to achieve the SDGs and objectives of the Paris Agreement on climate change.\n\n• Interest and investment in the Sustainable Development Goals are growing and investment in the Goals makes economic sense. Achieving the SDGs could open up US$12 trillion of market opportunities and create 380 million new jobs by 2030.  \n\n**++Cardano Sustainability++**\n\n**Encouraging the growth of a Community Led Local Hubs Network as a means of accelerating and expanding the Cardano ecosystem in strategic places for high SDG impact:**\n\nOut of the world's approximately 7.8 billion inhabitants, 6.45 billion do not speak English as their first language. Living in the Western world, one may forget this fact, with many never having considered it.\n\nLet's consider it now.\n\nLet's build an ecosystem that grows sustainably, in harmony from the local to global scale, while remaining inclusive and equitable.\n\nWhen you drive grassroots adoption, you do more than just 'build cool products'; you empower people to change their lives and world in previously unimaginable ways. You give them the tools to imagine that anything is possible.\n\nRemember that the **Bitcoin network is one protocol of the 75% of blockchains that use Proof of Work (PoW)** mining power to reach consensus.\n\nWith consensus on the **Cardano blockchain through Ouroboros estimated to be over four-million times more energy-efficient than the Bitcoin protocol -** let's use the tools available to us today to help build a sustainable world.\n\nIn a world where Cardano exists, maybe we don't have to wish for these things to happen, we make them happen!\n\n**EACH PROPOSAL PUT FORWARD FOR THIS CHALLENGE CAN REQUEST FUNDS AMOUNTING TO NO MORE THAN A MAXIMUM OF 20% OF THE TOTAL FUND AVAILABLE.**\n\n**THIS IS TO PROMOTE AND ENCOURAGE A DIVERSITY OF PROPOSALS WITHIN THE SDG FRAMEWORK :)**\n\n**++Guiding Budget Rationale:++**\n\n*   Basic infrastructure costs\n*   Developer Training, Education and Tools\n*   Catalyst Proposer Onboarding\n*   Translation and Outreach\n*   And more…\n\n**++For more information:++**\n\n\\* https://www.un.org/sustainabledevelopment/development-agenda/  \n\\* https://en.unesco.org/news/unesco-launch-esd-2030-roadmap-africa-region  \n\\* https://unesdoc.unesco.org/ark:/48223/pf0000374802  \n\\* https://forum.cardano.org/t/world-computers-that-don-t-cost-the-earth/41259  \n\\* https://forum.cardano.org/t/consensus-on-cardano-vs-other-blockchains/38738  \n\n**++Videos on Sustainable Development Goals:++**\n\n\\* https://youtu.be/0XTBYMfZyrM - Do you know all SDGs?  \n\\* https://youtu.be/vc8-7VncIbA - UN Chief on Decade of Action for the Sustainable Development Goals  \n\\* https://youtu.be/xVWHuJOmaEk - Nations United: Urgent Solutions for Urgent Times | Presented by Thandiwe Newton"}