{"id": 351806, "author": "SofiH", "title": "Support Ongoing/Small Projects", "url": "http://app.ideascale.com/t/UM5UZBiiT", "category": 25946, "amount": 15000, "description": "How can we make sure projects that are doing good work but ran out of budget/fail to get funded are supported to continue on or try again?", "no_assessments": 30, "rating": 3.3333333333333335, "videos": [], "media": [], "assessments": [{"question": 4, "note": "Grasroot funding many different projects encompasses that one or the other might have financial difficulties for various reasons. Yet projects that are in the great interest of the cardano community should not straight away be abandoned if they have a good explanation for financial issues. However not just any project that runs out of money should be funded to a fixed set of rules but the reasons need to be examined individually. also, the funds assigned to an individual project should not be fixed at 1500 but variable, as different types of projects can have different magnitudes of costs.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Allowing projects to keep on going until they reach maturity is certainly a good thing but it may allow for too many suboptimal proposals to be funded. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "I see this challenge as a way to lower the risk of new projects to commit some time and money before being successful funded, besides the continuation of already funded proposals. Although, I believe that the timing could limit the applicability of this challenge, since a proposal that didn't get funded and than wants to ask for operational budget in this challenge may have to wait for some months until receiving the operational costs funding, which would be ok for some but not for all. It is worth thinking about a side-treasury for that purpose, as has been suggested in the DDM Challenge, for example.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "The concept is notable. But the budget is too low to have meaningful impact. If a project is going to fail for $1500 at one point, it will fail for another and another $1500 at the next step. Difficult to set an allowance that accomplishes anything impactful. Like treating a skin infection with a steroid ointment. The real issue is inaccurate initial funding levels. The system as is force a race to the bottom, just to get funded. Wrong approach.  ", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This sort of thing might be a nice to have but its not clear it is core to Cardano's mission", "rating": 3, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 4, "note": "Helping smaller projects get started with the bare minimum or helping larger projects stay afloat between several rounds of funding could greatly improve the results and ROI of project Catalyst which in turn would reflect positively on the whole Cardano ecosystem.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This proposal is very interesting and innovative, because it allows giving a \"second chance\", it can be said, to proposals that were not chosen for financing, or that are unable to maintain their operating costs to achieve their objectives. I believe that with this type of support, proposals that have potential, but that for various reasons were not selected at the time requested, can bring real results and increase the number of those responsible (even attracting new voters) to give a new direction to the same situation. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Proposals fallen outside of the winning list are free to reapply at their own pace for either initial or additional funding. They have great community feedback to utilize to their advantage in recurring funds. If a certain project falls short by a small margin of votes, that should be a token of confidence needed to continue trying. This challenge setting will thin out the current CA pool, which will negatively affect the rest of the process during a fund. However, it could be convenient for both proposing and voting group to have a separate challenge setting where only ongoing projects are allowed to apply for additional funding, especially if they were clear about their budgetary needs from the very beginning (their initial proposal). ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This challenge is aimed at creating alternative financing models, which I think is important for Catalyst. The current proposal funding model is laborious for small proposals and I think it is important that there is a faster funding model, but the idea described is confusing in some points. Operating costs are subjective and can be interpreted in different ways.\r\n\r\nThe established rules are confusing, for example:\r\n\r\n\"Proposals can not include budget for work to be done or any rewards for the proposers (can be done in other challenge)\"\r\n\r\nHow to differentiate operational costs of work to be done?\r\n\r\nI believe that this challenge is important but needs to be better designed.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Good ideas and feedback to the Catalyst process but not I think a challenge proposal. The challenge might be \"Ways to improve Catalyst / Governance\" or something else more general.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "As there will be a lot of CAs that are there for a longer time and know projects from older funding rounds, it will be a doable amount of work to reassess the projects and the reasons for their failure ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This is just a smaller scope of what currently is happening with funding.", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": false}, {"question": 5, "note": "The idea is very straight forward and completely feasible. The challenge would probably have tens of proposals submitted and might be very successful. Also, total budget and maximum per proposal is reasonable to allow the funding for the best proposals.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Yes they do have the capacity, but as mentioned in IMPACT, the award of $1500 will not solve the bankrupted project from failure.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Yes it could be done. However there are issues in balancing reducing governance workloads and avoiding wasting money. Its not clear how this balance will be achieved.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "As this challenge would specifically address current or future proposers in project Catalyst, there shouldn't be a lack of proposals submitted to this category.", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 5, "note": "From what I understood, this new \"analysis\" and support to the proposals would be made by the community as a whole, in a similar way to what is already happening today. Would it be better to clarify this, if for example: would it be suggested to create a new group, specifically designed to review whether the groups you propose have possible conditions of accomplishment without an aid? If this doubt were resolved, the understanding of who would do this new activity would be more possible.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Giving this opportunity to \"fallen\" projects will encourage everyone to reapply for a small grant as suggested, which will require some oversight by a CA group. At the moment, the CA pool is still limited and fresh, therefore this will inhibit the overall process of the fund. ", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This challenge does not bring technical barriers, which indicates that the community will have easy access to create proposals.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "It does but I think the challenge needs to be broadened as to governance and then it may be that not all community members are as interested in the governance side as they may be, and will be waiting for guidance within the main Catalyst framework dn IOHK research programme in respect of governance to usefully engage.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The rules for re-funding in this proposal are so far set relatively vaguely and the CA rating rules are not yet defined. This part would need some more refining in order for the proposal to pass in my opinion. Regarding fixed rating rules, I am not sure it should be done like that. The community can set up some guidlines  on how to evaluate such proposals, but fixed rules would basically get rid of the grassroots aspects here.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The line between operational and other costs in itself is blurry.", "rating": 3, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 6, "note": "Key metrics for the success of the challenge are clear. Also, idea for the auditability of the funded proposals should be included. For example, the proof of operational costs if essential for this challenge, and might be also the only metric needed in this case.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "What will determine the successful use of the $1500? How to identify the Proposal that really be saved by the injection of $1500, and the proposal that has debts to pay off? Not easy to design a mechanism. I think the challenge should be reconfigured, reconsidered.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Some of the metrics suggested have nothing to do with the funding request for the challenge (ie  Proposals made in later rounds by funded proposals, First time proposers who get funded here but not in their full proposal). Perhaps this should just be a proposal in itself (there was one similar in this funding round).", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Would have liked to see more clearly defined metrics and a clearer explanation on what types of expenses could be considered eligible for this challenge. Other than that, the metrics seem appropriate for correctly assessing the results of this challenge. Unsure about the proposed CA changes, fear of overload are probably justified, solution might not result in the best outcome though.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "I missed explaining exactly how the idea would happen. Would it be a new stage among the others? Or an activity that would take place after the close of a cycle, and that would select projects to be supported and launched in the next round? But it was interesting that the author limited a financial amount for each proposal that would be revised, because it gives the idea that the goal is to work with small proposals in fact, to give voice to those who may have little or no resources. Note: 3.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Should this challenge setting go forward, more detail and thought needs to be allocated in order to expand the KPI list. Currently suggested KPIs are limited and will not be enough to give a sufficient overview of the ROI from this challenge. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Some interesting metrics have been described to assess the number of proposals involved in the challenge, but there are no relevant metrics to identify the performance of the proposals. How to identify if the proposal is successful? Some parameter needs to be established to identify whether the operating cost fund is being used well.\r\n\r\nThe definition of success is not an objective indicator to measure success, I think it is important that something more tangible is established.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "These are decent metrics for feedback into the effectiveness or otherwise of Catalyst, as part of the broader picture.", "rating": 3, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}], "importance": "Have operational costs for an ongoing service? Got funded in an earlier round, but worried if your project will stay alive?  \nStarting a new proposal but worried how to pay the hosting bills if you don't get funded? Split your proposal!  \nHere you can asks specifically for funding for the operational costs.\n\n  \nThe idea is to either link to a proposal in another challenge for which this is the operational bill (should not be included in the other one). Or if you have an ongoing project which got funded earlier and now most importantly needs to pay hosting bills to stay alive. If you are making some other personal expenses at the benefit of the community feel free to argue for a case to get reimbursed here.\n\n  \n**Rules:**  \n\\- Each proposal can ask for 1500 max (to support at least 10 projects with the total funds)  \n\\- Proposals should include a clear overview of actual operational costs made\n\n\\- Proposals can include projected costs for up to 3 months, based on previous operational cost made (should be explained)  \n\\- Proposals can not include budget for work to be done or any rewards for the proposers (can be done in other challenge)  \n\\- No referrals\n\n  \n**(V)CA Guide / rating rules:**  \nBecause many small proposals can overburden the CA system, a simple rule set is provided to simplify CA work in this challenge. Any proposal that follows the rules as mentioned above should get a 5 rating, no explanation has to be given but feedback is ofcourse welcome. If a proposal does not follow the rules it should get a rating 1 with an explanation/ reference to the rule. The actual judgement of value is left to the voters."}