{"id": 352101, "author": "Rodrigo Pacini", "title": "Improve and Grow Auditability", "url": "http://app.ideascale.com/t/UM5UZBinJ", "category": 25946, "amount": 100000, "description": "How to make the auditing process of funded proposals efficient, distributed and transparent?", "no_assessments": 30, "rating": 4.366666666666666, "videos": [], "media": [], "assessments": [{"question": 4, "note": "Auditability current is one of the aspects of Catalyst that is less known by its participants. Every fund the question about funded proposals is raised. And as mentioned in the challenge, auditability will be overwhelming for IOG alone to perform in the following funds. This challenge really is needed. Budget also is good so we have different proposals competing and alternatives to audit funded proposals.", "rating": 5, "c_fb": 0, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 4, "note": "This proposal covers the essence of Charles H.'s view of accountability, almost absent from the discussion to date. What is there to say? If properly promoted, it should attract interest from teams of community members and (as is the goal) 3rd party Quality assurance agencies (some for profit some not for profit). ", "rating": 5, "c_fb": 0, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 4, "note": "Given the current Cardano's trajectory of growth and its aim to become fully decentralized in terms of operations (Voltaire era), it is crucial that the community learns to self-regulate and control. The proposed challenge setting will give members a chance to come up with clever ways to establish a clear and fair feedback loop between funded projects and the voting members. This will enable the community to reach sustainability early on to ensure long term success. ", "rating": 5, "c_fb": 0, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 4, "note": "Since basically anyone can get proposals funded if they formulate them well, transparency and credibility of the projects needs to be ensured in order to improve trust in the catalyst process and motivate more people to partake in it. All in all, it is vital to the success of the platform to demonstrate that good behaviour will becrewarded and caah grabbers don't have a chance.", "rating": 5, "c_fb": 1, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 4, "note": "I am conflicted in my assessment of this proposal because firstly, I do see the need for better auditing processes not only when there will be hundreds of on-going funded projects but also now with the projects we have already funded. I am uncertain of the level of auditing currently being performed and whether IOHK publishes their data and findings, but I trust that it is being done correctly. Secondly, whilst I agree with the most of the details presented here on how and what to look for in validating quality of projects, keeping to standards & ROI, I find it hard to accept that this is better served & performed decentrally as opposed to a more central/appointed/annointed committee or company or a group of people who can maintain the sets of standards to measure. We as Cardano would do ourselves a disservice knowing our blockchain is peer-reviewed and rigorously wrung through academics and experts to then have to rely on a decentralised approach to validate the projects that are tacked on to Cardano and funded by Catalyst, by relatively unknown parties. At least now with IOG being in charge of auditing, there is comfort knowing its being done to a certain standard and one we can trust. ", "rating": 3, "c_fb": 0, "no_vca": 3, "reply": "The decentralization of Cardano's governance is a non-optional objective. IOG will soon make a request for funding to continue serving the Cardano community. It is unrealistic to think that the IOG has the capacity to audit hundreds of projects. Not all projects require the same scrutiny and the community can help in a number of ways. Anyway, over time this task will be carried out by the community and this is already happening, just look at the funding proposals related to the audition of proposals funded by Catalyst.", "pc_fb": false}, {"question": 4, "note": "Great idea and something the community should be looking to brainstorm on. We cannot move to continued decentralisation of governance and funding without check and balances to ensure funded projects are delivered and held accountable. It is important that we don't make the same mistakes twice. to do this we need to measure what we have done and hold projects and their proposers accountable. Its fine for projects to fail. Its not fine to have subsequent projects make the same mistakes.", "rating": 5, "c_fb": 0, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 4, "note": "As the proposer mentions, as the number of proposals increase per fund it could become overwhelming for IOG to audit everything. For this reason it's important ( but perhaps not critical) for the community to start thinking about this, and setting it as a challenge would be an appropriate way to promote that.", "rating": 4, "c_fb": 0, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 4, "note": "This is an excellent idea for a challenge. Catalyst offers an incomparable advantage for proposers looking to develop on the Cardano blockchain, when pitted against more traditional funding models. However, there currently is not a robust system for auditing proposals once they have been funded. Given the lack of standard requirements for auditing across all proposals, this is an area ripe for development. With a comprehensive auditing process in place, voters can rest much easier knowing that the money being allocated is spent in an accountable manner with clear reporting mechanisms. ", "rating": 5, "c_fb": 1, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 4, "note": "This is I think good feedback for the Catalyst process  but not something that needs to be undertaken by a challenge for proposals for Treasury funds. It might be better reworked as a proposal within a separate challenge in respect of how to improve the Catalyst / governance process, to the extent that this is not already being thought about within the Catalyst project. It might be that a proposal for a prize fund for best executed projects could incentivise those who have had proposals funded, and that might be a simpler thing to recommend.", "rating": 1, "c_fb": 1, "no_vca": 4, "reply": "There is no adequate challenge for proposals that deal with auditing. Distributed Decision Making and Value Onboarding are processes before voting.", "pc_fb": false}, {"question": 4, "note": "Auditability is the foundation of a strong process. In catalyst, the process is aiming to fund people across the globe. This throws in huge challenges hence there is a need to come up with innovative mechanical to achieve audibility in a secure and safe environment. ", "rating": 5, "c_fb": 0, "no_vca": 5, "reply": "", "pc_fb": true}, {"question": 5, "note": "Some aspects of the proposals might be easy to understand and to audit, but technical knowledge will be needed in order to audit smart contracts, for example. It might not be easy to do that, but some people in the Catalyst community might have this capability. This can also bring new players to Catalyst community, people interested in developing audit systems and professional auditors.", "rating": 4, "c_fb": 1, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 5, "note": "whilst I agree 100% with the challenge, there is one reservation. The amount of funding for the challenge is too small. Monitoring & Evaluation (M&E) efforts for small (low funded) proposals/projects will consume man hours, just as they do for  large projects. This industry has well established hourly rates. Presuming every proposal that is funded at $10-$50k are reasonably complex, the level of effort required by an established Auditing company or agency will consume almost the same amount of funds, We could expect three types of proposals. 1). Individuals/teams of individual active community members. 2). 3rd party Quality Assurance organisations (either management consultants or Quality Assurance organisations). Each would probably establish a different form of auditing and reporting. 3) Well established Monitoring and Evaluation organisations from within the Intl funding agency ecosystem (World Bank, UN, Asian Dev Bank, African Dev Bank, DIFID, GIZ, etc).   See https://www.sopact.com/monitoring-and-evaluation", "rating": 3, "c_fb": 3, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 5, "note": "Project Catalyst has attracted many early adopters who have adopted the responsible, independent approach required for a decentralized project to exist. Many are eager to improve the system in order to set up future adopters for success. It is without a doubt we will see great ideas come forward should this challenge be put in place. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The diverse background and competencies will enable the community to audit the progress of projects on many different aspects.", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 5, "note": "Based on my assessment in the first section, I do not have any confidence that this is an aspect of the project that we can entrust to the Community, i.e. to present proposals on how it can qualitatively audit a project. Quantifying a thing can only be translated to a level of 'quality' to a certain extent. One can seat that the number of developers on-boarded into a project does not translate to a higher quality project or the fact that the number of commits into GitHub means the code is elegant and perfectly programmed. ", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Across the community there is the ability to address this and we should also always be looking to expand.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The community has already proposed many solutions to improve Distribution Decision making, and this challenge would require similar solutions geared towards audibility   ", "rating": 5, "c_fb": 0, "no_vca": 6, "reply": "", "pc_fb": true}, {"question": 5, "note": "As a community advisor who has participated in the community for a few months now, there is no doubt in my mind that this project is feasible. There are already many discussions taking place on auditability and opening it up beyond discord to the entire community would likely draw in more ideas from a broader group of participants. The way that it is framed here would allow for a wide array of proposals to be submitted. It does not restrict exactly what is being looked for which leaves ample room for innovation in this space. ", "rating": 5, "c_fb": 0, "no_vca": 5, "reply": "", "pc_fb": true}, {"question": 5, "note": "I think this a a process matter unlikely to garner great innovative feedback from the majority of Catalyst participants, however the issue raised will be of interest to proponents and to the governance process. ", "rating": 2, "c_fb": 0, "no_vca": 3, "reply": "There are already audit proposals in Fund5. This demonstrates the interest of the community.", "pc_fb": false}, {"question": 5, "note": "The challenge is to define and implement a process for improving and benchmarking auditable in the Catalyst proposal. With the large community, it is quite feasible to come up with a unique methodology. ", "rating": 5, "c_fb": 1, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 6, "note": "Suggested key metrics are good. Since solutions will be implemented to audit Catalyst proposals, they could compete have some overlap to compare the efficiency of different systems auditing the same proposal. Another interesting metric would be the cost per audition, which would make it easier to compare competitors that present the same audit quality.", "rating": 5, "c_fb": 1, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 6, "note": "Accountability agents are already identified as a part of the Cardano (Voltaire) roadmap. Success of this challenge will be determined by the number of proposals, the funding levels requested and the final reporting that is generated. ", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 6, "note": "The proposer has a great understanding of what they would like to see in terms of audibility metrics for future projects. If these features are established, with more time and data this list can be expanded upon. \r\nThe suggested budget for the challenge is a great starting point to get things moving in the right direction. ", "rating": 5, "c_fb": 0, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 6, "note": "The metrics all seem audible and should be able to be adressed, assuming that the group auditing a project consists of people with all the different required skills, which should be doable.", "rating": 5, "c_fb": 0, "no_vca": 6, "reply": "", "pc_fb": true}, {"question": 6, "note": "The proposal does identify all the pertinent metric and value points that would indicate whether a project is running well and as planned. These could well form the basis of what the 'audit team' could measure. Instead of proposals under this challenge, we could instead as a community vote on expert, learned and experienced community members who could form part of the audit team to assist IOG in this laborious task. This removes 'Auditability'  from being being a challenge but we could instead on-board voter-selected panelists, and I suggest, consisting of very experienced VCAs (e.g. the proposer of this proposal), funded by the treasury.", "rating": 5, "c_fb": 1, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 6, "note": "Metrics are well set out. Also need to monitor how proposals did meeting timelines and budgets.", "rating": 5, "c_fb": 1, "no_vca": 6, "reply": "", "pc_fb": true}, {"question": 6, "note": "The KPI's described are relevant to the challenge and would allow the community to measure the progress of proposals arsing from this challenge", "rating": 5, "c_fb": 0, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 6, "note": "The proposal lays out success criteria and suggested metrics to be measured. What is provided in the proposal is clear and is a good place to start. Given the diversity of challenges already active, it may be challenging to develop an auditability system that works across all. Instead, there may be interest in developing specific challenge auditability processes for each. For example, the useful auditing measures for the Proposer Outreach challenge may not necessarily align with what is required for the dApps & Integrations challenge. Some clarity could be useful whether the intent is for a broader auditability process across all challenges or for specific ones. This would provide additional confidence that the challenge is able to be measured appropriately. ", "rating": 4, "c_fb": 0, "no_vca": 4, "reply": "", "pc_fb": true}, {"question": 6, "note": "Good metrics within the terms of the proposal themselves. Could be improved by adding community feedback on the success or otherwise of the application of Treasury funding.", "rating": 4, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": true}, {"question": 6, "note": "The metrics are sharp and captures the essence of the requirement. ", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}], "importance": "When Fund7 happens we will be close to 100 funded proposals. It is extremely important that these proposals are evaluated/audited to see if they are delivering and if the ROI is being in line with what has been established initialy.\n\n  \nCurrently, IOG is in charge of monitoring the development of these funded proposals, but when there are hundreds of funded proposals this will be an overwhelming work for IOG.\n\n  \n\nIn this video, Charles Hoskinson talks about concepts related to proposal auditing and brings more ideas on how to improve the process.\n\nhttps://www.youtube.com/watch?v=3_wJOF4Y8gU&t=276s\n\n  \n\nThe Auditability challenge aims to ensure transparency in the use of Cardano's treasury resources, which will allow the Cardano community to have more information on the development of funded proposals through a checks and balances system.  \nSome directions that this challenge can take:\n\n  \n\\* Podcasts with teams from funded proposals.  \n\\* Smart contract audits.  \n\\* Platforms / Websites that perform:  \n\\- Reporting on metrics, spending of financial resources.  \n\\- Metrics on the development of Dapps (txs, volume, unique wallets, etc …)  \n\\- Metrics on Number of onboarded developers, number of commits in funded proposal repositories.  \n\\-Social media engagement indicators metrics.\n\n  \nFunded proposals that are transparent and demonstrate performance can be recognized, improve their reputation and create more opportunity. On the other hand, proposals that are not open and perform poorly will worsen their reputation and decrease the chances of being voted on by the community. The point is that it rewards productivity and transparency."}