{"id": 352807, "author": "newmindflow", "title": "Decentralised Storage Solutions", "url": "http://app.ideascale.com/t/UM5UZBiyt", "category": 25946, "amount": 350000, "description": "How can we create a robust, reliable, secure, and affordable decentralised, high-capacity storage network built upon the Cardano blockchain?", "no_assessments": 29, "rating": 3.8275862068965516, "videos": [], "media": [], "assessments": [{"question": 4, "note": "Fundamental to decentralization. A central storage or even one that is controlled by a select set of datacenters defeats the decentralization purpose.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "As outlined by the proposer, the challenge is critical to achieve Cardano's mission. To reliably and securely implement things like NFT marketplaces, this challenge is needed (potentially, as indicated, over multiple rounds).", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Part of managing one's identity is to be in control of one's online presence. At the moment, majority of users do not control or posses the data they produce online. This data is being harnessed to be used against users in order to exploit their behavior patterns. Creating a decentralized data storage solution would greatly compliment Cardano's mission to bring financial identity to the under-banked and bring another level of control to the individual on-chain. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "The topic is very clear and very relevant to the ecosystem and a solution like that is really needed inside Cardano. Even though several solutions should exist and compete amongst them, I believe the proposed budget is too high for such a specific topic. I would set it to be 150k at most.", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "It is an interesting proposal for a challenge that would make a nice addition to the cardano ecosystem that goes beyond monetary blockchain aspects which is part of cardanos mission. However it does, while beeing a great addition, not make it absolutely critical to the mission.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Totally agree that this challenge is very germane to Cardano mission leading to a fully decentralized ecosystem ", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": false}, {"question": 4, "note": "This is an area that would soon be a tremendous challenge, even without the resources attached to this Fund 7 Challenge setting proposal. Each of us can simply look at our storage needs and we can all admit that what we have now is never enough. Cardano itself may begin seeing data-storage issues after Alonzo is released. As it currently stands, and with CNFTs being minted without smart contracts, a blockfrost.io proposal claims huge amounts of data already going through their APIs that they have had to present proposals themselves to deal with traffic. That their proposal has nothing to do with storage, but the traffic they observe reveals a lot about the data storage needs of our community. I initially wondered if this should simply be a DApp proposal that could be submitted under normal challenges but given current crypto-projects dealing with this issue are themselves multi-billion dollar projects, I recognise that even the $350000 price tag may not even be enough. This is a project that truly needs a white paper.", "rating": 4, "c_fb": 1, "no_vca": 1, "reply": "", "pc_fb": true}, {"question": 4, "note": "This could be a very useful use case driving Cardano. ", "rating": 4, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 4, "note": "Good solution for saving files is needed, but it could easily be another platform/solution linked to Cardano and does not need to be built on top of Cardano.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This function is something IOHK and its development of Hydra on the metadata and ADA/native token base layer might be best placed to contemplate, rather than it being a specific challenge. Perhaps it might best be part of a proposal in response to a wider challenge of \"how to improve Cardano from a technical perspective\" once the initial roadmap is complete and the operation and possibilities of Hydra and Goguen are fully understood by the community.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "We have the necessary talent and resources to address this if prioritized.", "rating": 4, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 5, "note": "Fund5 proposals already include NFT marketplaces and Filecoin integrations that seem feasible. This is a more focused continuation of that work that brings more value to the Catalyst community and Cardano at large.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "It is difficult to assess the capability of the Catalyst community at the moment. It is rapidly expanding and growing, yet this challenge setting is of a massive magnitude as can be seen by other projects outside of Cardano who have been tirelessly working for some number of years to bring a ready product to market. One advantage that such a project would have building on Cardano is CF's support and market penetration on African continent. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I can see some proposals being submitted in this challenge, and I believe that Catalyst community has enough knowledge to develop such solutions. Current solutions in other blockchain could also inspire the creation of some solutions inside Cardano.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Only a very small portion - specialized developers - of the Catalyst community will be able to adress the challenge.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The community has the requisite knowledge and when engage the best experts.", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 5, "note": "I have no doubt the community can rise to this challenge, but as mentioned, the only limitation I can see is the amount of funding that would be reserved under it. We could end up either funding a small number of niche solutions or one big one that would serve the entire Cardano community, i.e. a filecoin-type of decentralised solution. I have no inkling as to which way things would go but if this challenge goes ahead, I look forward to the novel ways our brilliant community members will present ways to address it. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "This type of challenge is within the communities ability to deliver.", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 5, "note": "I think this is a complex issue and needs further research before implementing anything.", "rating": 3, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": false}, {"question": 5, "note": "The community in general might not have the technical skills to engage with this issue ahead of the Hydra implementation so as to understand Cardano's full feature set and what might be possible in second layer development.", "rating": 1, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Success Criteria needs to be a bit more descriptive. I would also add efficiency as a metric. One of the key trade off for decentralized storage is the efficiency and speed. Cardano should offer improvements in both areas. ", "rating": 3, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics properly measure the challenge progress and to some extend overall adoption of Cardano among blockchain developers with storage needs.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposer outlined several KPIs to measure success of the project who would participate in the challenge, but this list can be expended upon further. It is encouraged that the author continues to add more detailed explanation to the structure of the challenge and how the suggested budget amount would be distributed. ", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "In my opinion, key metrics are very good and would be a great start for proposals. Although, as mentioned that proposals might need to participate in more than one Fund to get everything done, it's preferable to set expectations of each round. The solution should accomplish measurable goals in all Funds.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The success criteria and key metrics are defined well. As no rationale for the funds allocated is given while this is a concrete challenge that could be quantified, only 4 stars.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The metrics listed is what you expect for the current storage facilities available to us. There well may be other metrics proposals can present which have not yet been considered simply because the novel ways of data storage solutions have not yet presented them. Within this round I have assessed proposals under the Metadata Challenge and most point to a 3rd party centralised storage facility to run in parallel with the immutability of Cardano's metadata. It would be nice to see Cardano involved in not just recording the metadata but having its facilities leveraged to ensure immutability of the data file/s themselves. Good luck to us all.", "rating": 5, "c_fb": 1, "no_vca": 1, "reply": "", "pc_fb": true}, {"question": 6, "note": "I think its also important to measure privacy, reliability, latency, and longevity. It may also be useful to consider geographical location of storage. It may be desired to have locally for latency or regulatory reasons, or distributed for backup. Success metrics should also look at the amount of data stored relative to competitors and relative cost of storage and access.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "As this is a complex task and the proposals probably won't reach the measurable criterias then the success will be hard to measure.", "rating": 2, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 6, "note": "These might be metrics better used to assess a proposal specifically for a storage solution, or whether a proposal for such has been adequately delivered. If this were to be submitted as a challenge still I think it would be best to assess what proponents' capabilities and resources were to be able to work with IOHK to complete its integration, as well as its realistic ability to deliver features, and they would need to explain to the lay community member how this might be achievable technically.", "rating": 2, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}], "importance": "The global cloud storage market is projected to grow from USD 49.13 billion in 2019 to USD 297.54 billion by 2027, at a Compound Annual Growth Rate (CAGR) of 25.3% during the forecast period.\n\nBut perhaps more important than the economic factor, creating a robust, secure and tamper-proof decentralised global storage solution based on blockchain technology would make our data safe, out of the reach of and immune to the whims of large corporations, criminal organisations or leaders of nation-states.\n\nSimilar to the projects that already exist like filecoin - https://filecoin.io/ , Holo - https://holo.host/ or the Akash DeCloud - https://akash.network/ storage providers should be incentivised by a token.\n\nPossibly start with designing and implementing a system that would allow stake pool operators to attach and provide storage to their already existing machines.\n\nUse case example:\n\nAs a key component in the creation of a trustworthy NFT platform. What use is having the record of ownership on an immutable blockchain, if the work that it points to is no longer accessible? Only the metadata gets stored on the blockchain, if the file it points to is no longer available because the centralised storage it was hosted on is down, the NFT itself loses its value, regardless if it's a piece of digital art, music, or a land lease.\n\nPicture how the media would cover the story of an NTF artwork that somebody paid hundreds of thousands of dollars suddenly not being there anymore. After an event such as that, storage permanence would surely become the biggest thing the general public would be concerned about. We can anticipate this by building it into the system from the get-go and setting it up as one of the key differentiators because there's a possibility it'll end up being.\n\nReferences:\n\nhttps://www.fortunebusinessinsights.com/cloud-storage-market-102773\n\nhttps://coinmarketcap.com/alexandria/article/what-is-decentralized-storage-a-deep-dive-by-filecoin\n\nhttps://www.coindesk.com/its-an-nft-boom-do-you-know-where-your-digital-art-lives"}