{"id": 352815, "author": "rich", "title": "NFT Business models", "url": "http://app.ideascale.com/t/UM5UZBiy1", "category": 25946, "amount": 200000, "description": "What non-Art use cases of NFTs can distinguish Cardano as the blockchain of choice for NFT based businesses?", "no_assessments": 29, "rating": 4.758620689655173, "videos": [], "media": [], "assessments": [{"question": 4, "note": "Wider use of NFT's as a way of easily access the immutability of the blockchain will provide a real reason for the wider population to interact with Cardano", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 4, "note": "At the present, IOG is working on creating robust DID system utilizing Atala Prism. In a way, that is already an example of a use case for NFT. Setting a fund challenge to explore more options early on will benefit the ecosystem in the long term. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "NFTs really are very important and could be as big or even bigger than DeFi. A Challenge specific to NFTs could bring more attention to this topic, even though some other challenges, like DAPPs, already have some proposals in this regard. As per my current knowledge, the use of Cardano to leverage NFTs is as good as it is for fungible tokens, i.e., Cardano was not specially built for NFTs but for every kind of token. Anyway, I believe this would be a great challenge.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Encouraging NFT proposals other than art related will open up the creative resources of and opportunities for a much broader range of use-case proponents and developers. The examples provided are an excellent starter group of ideas.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Yes, I totally agree that this is very germane for the overwhelming adoption of ada and cardano ecosystem by users and developers alike, worldwide. ", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": false}, {"question": 4, "note": "NFTs are a critical issue in the field of blockchain adoption. However, it still takes a lot of work to develop convincing use cases. Here Cardano could become a lighthouse. In particular, there is a chance that the superiority of the Cardano tokens will be clearly noticeable. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "This challenge is of high importance not because of the boom of digital art NFTs but in educating everyone, including Cardano Community members of the other types of things that can be recorded as a unique record in the blockchain. The proposal is very well written and hopefully leaves no doubt that NFTs can be used for more than just artistic objects. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "Challenge is seeking to increase adoption of ADA through real-world use cases involving non-art NFTs.  There is a lot in the news about NFTs and blockchain.  Certainly, this is critical to achieve Cardano's mission", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 4, "note": "NFTs on Cardano are very important, but the need to use Cardano as the platform should come more from other incentives (like lower fees for example).", "rating": 4, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 4, "note": "Thank you for your idea proposal. I enjoyed reading it. To improve its relevance to the Cardano community, please kindly consider the following suggestions:\r\n(1)\tThe focus of the proposal (or as mentioned the Fund 7 challenge proposal) and objectives can be improved and become more 100% clear. It will have more impact with a stronger punch-line business case and some practical examples. It will help as well to have a SWOT analysis on the top ideas and gain some traction as the objectives, key success factors, and vision.\r\n(2) Some of the links didn't work but overall I do believe the idea is good and should be more developed.", "rating": 4, "c_fb": 2, "no_vca": 3, "reply": "I'm not sure how this could be 100% clearer, but I'll take that under advisement as anything can always be made clearer with time and attention.  However, I'm not sure I agree with the SWOT analysis?  There are 21 examples of uses for NFTs stated, so not sure why I need more.  But thanks.", "pc_fb": false}, {"question": 4, "note": "This challenge will encourage utilisation of the metadata functionality as well as native tokens which Cardano is leading the industry in providing in a secure and cost efficient manner. When it comes to high value items, and concepts for their securitisation, the predictability, security and functionality Cardano can provide are real advantages. Security and provenance for particular items can be proven within metadata itself, rather than relying on smart contracts, which is different from other blockchains particularly at the scale and distribution capacity of Cardano's network. It is important that transaction fees, which are in the long term the lifeblood and security of the system as well as underpinning of value in the token which keeps users engaged are secured for the network by having a dynamic ecosystem to support NFT uses in scale and over the long term, therefore it is important for this use of Cardano to be supported with Treasury funds. It is important also to demonstrate the willingness of developers to code these functions on Cardano in as broad as possible a range of use cases, in addition to deep functionality in each use case that differentiates Cardano as a solution.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Across the community there is definitely the ability to propose and deliver project which meet this challenge. Every additional NFT use which is useful  can add to the value of the Cardanao ecosystem", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 5, "note": "Some proposals are already being done in other challenges regarding NFTs, and the community is already developing some projects related to this. So, I believe lots of proposals would be expected from such a challenge.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "I am giving 5 stars because the implementation requires few, if any, special tactics or techniques to be realised. Our community is already a collection of broad interests. NFT's are being heavily promoted and discussed, so there is strong awareness within the general cryptocurrency space, . ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "Sure. There is enough  capacity, experience and knowledge in the community and if necessary engage requisite experts.", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": false}, {"question": 5, "note": "For this topic, it is important that strong teams are promoted that combine technical and commercial skills.", "rating": 5, "c_fb": 0, "no_vca": 1, "reply": "", "pc_fb": false}, {"question": 5, "note": "The Cardano community is already very familiar with CNFT art due to successful pre-Alonzo minting projects and I have no doubt that ever since IOHK announced the Ethiopian government's use of ATALA Prism to on-board 5 million students, most were further educated of Cardano's flexible utility that re-imaging NFTs as more than just artworks is already happening. I actually cannot wait to see the kinds of proposals that would be presented if this challenge goes ahead. And what's even better is that since minting an NFT is a 'native' (excuse the pun) functionality of the Cardano blockchain, developments would not need huge amounts of funding to bring projects into fruition.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "There are many talented individuals within the Catalyst Community, including developers, programmers, entrepreneurs and marketers with the capacity to address the challenge", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 5, "note": "The community is the right entity to decide if the amount of money asked is worth it.", "rating": 5, "c_fb": 0, "no_vca": 2, "reply": "", "pc_fb": false}, {"question": 5, "note": "It does, but this could be improved with outreach to different industries that can benefit from distributed asset or access management of one kind or another.Warehouse receipts for commodities could easily run in this manner on Cardano but outreach to bodies such as the London Metal Exchange for example could be fruitful in making them aware of the simplicity and predictability of function that is possible with Cardano. With community members involved in finance these contacts should be possible, but community development to identify particular reach into different industries to find creative thinkers and problem solvers would be a useful output of thew or of this challenge, in addition to particular use case ideas.", "rating": 4, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The success will speak for itself. Bringing more real life utility via blockchain will turn heads and benefit the ecosystem, in turn drawing more talent. The proposer has a great vision for this challenge setting and has set a lower limit for budget, making this attractive as a probe challenge in order to gather data for future planning with regards to NFTs' use cases. ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Metrics are difficult to set in this kind of challenge because NFTs are usually not transacted in the same way as fungible tokens. The proposed metric are good and general enough to fit any kind of NTF related proposal, although proposals would need specific metrics and KPIs based on their business models and niches.", "rating": 4, "c_fb": 1, "no_vca": 2, "reply": "Assessor is correct, each proposer will need to define their metrics of success, however, that is not the scope of writing this Challenge.", "pc_fb": false}, {"question": 6, "note": "The success of the challenge will be simply the number of proposals that are attracted. The metric that was proposed of 4 x $50k proposals allows for a situation of few proposals, but, based on the level of interest in NFT proposals in  f3, f4 and f5 experience more likely there willl be 20-30 realistic proposals. An indication of success of the challenge ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The criteria and metrics proposed are spot on and effective for its purpose. ", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 6, "note": "The assessment criteria need further sharpening. Which aspects are relevant for the quality of the use cases? ", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "The proposal does very well in not simply listing key metrics for the Challenge itself but of the key metrics that would validate effectiveness of submitted proposals themselves. This provides CAs like myself a good reference point on what to look out for, as additional guidance. Whilst we're at the height of CNFTs and the ATALA announcement, this challenge cannot come at a better time when proposers (hopefully) are already thinking about valuable projects that would address this challenge.", "rating": 5, "c_fb": 0, "no_vca": 0, "reply": "", "pc_fb": false}, {"question": 6, "note": "Criteria may need to be revised once an implementation team is assembled. Perhaps it may be best to first measure use volume outside of cardano based on real examples of NFTs.  Real-Estate ownership immediately comes to mind as a real-world example where there is huge need for ownership verification.", "rating": 4, "c_fb": 1, "no_vca": 3, "reply": "Seems not to fully understand Fund 7 Community choice writing guidelines, no implementation team until proposals.", "pc_fb": false}, {"question": 6, "note": "It is easy to count the NFT-connected proposals.", "rating": 5, "c_fb": 0, "no_vca": 3, "reply": "", "pc_fb": false}, {"question": 6, "note": "Number, quality and results of particular proposals for use cases are all good objectives to measure. It might be worth thinking about a structure and measurement function by which to engage community members in collating and managing industry contact outreach to grow the community and induct people in different areas so as to engage industry participants with an interest they might not have yet thought about in developing their own proposals.  ", "rating": 4, "c_fb": 2, "no_vca": 3, "reply": "While it maybe a good idea, it isn't something I should add to this, rather something a proposer could come up with as a means of fulfilling the chalenge.", "pc_fb": false}], "importance": "**INTRODUCTION**  \nVOTERS PLEASE UNDERSTAND: This is a Fund 7 COMMUNITY CHALLENGE others will make proposals to the challenge. It is NOT a proposal itself. Therefore do not expect to see the same things you see in proposals, like teams, solutions and budgets. The proposers who apply for this CHALLENGE create those things.\n\n++What are Non-Fungible Tokens?++\n\nA non-fungible token (NFT) is a unit of data stored on a digital ledger, called a blockchain, that certifies a digital asset to be unique and therefore not interchangeable. NFTs can be used to represent items such as photos, videos, audio, and other types of digital files. Access to any copy of the original file, however, is not restricted to the buyer of the NFT. While copies of these digital items are available for anyone to obtain, NFTs are tracked on blockchains to provide the owner with a proof of ownership that is separate from copyright.  \n\n  \n\n***THE CHALLENGE:**  \nPropose a means or way to drive business use cases on Cardano that have NFT usage as a core component and can act as an onramp to the Cardano ecosystem. This can include any business model based on NFTs. Think about how this is implemented at scale drawing millions of users, who, once onboard, can become customers for dApps, tools, DeFi and other services.*  \n  \n\n**WHY THIS IS IMPORTANT TO GROW CARDANO**  \nThis Challenge is about building recurring businesses that incorporate NFTs on the Cardano ecosystem. The more types of NFTs that are circulating on Cardano will increase the utility of Cardano and ADA.\n\n  \n\n**RATIONALE**\n\nFeedback suggests most people need help imaging use cases for NFTs (Non-Fungible Tokens) beyond the recent Digital Art phenomenon and can't imagine other use cases without some inspiration.\n\nTo our thinking, the recent Art NFT boom is a small fraction of the trillions of dollars the NFT market will represent in the next decade. And since there are already many Digital Art NFT projects underway in Catalyst, this challenge is about expanding the use cases beyond simply Digital Art. It does not preclude all art forms however, so if you have ideas for other business models that are also considered part of the broader category of the Arts, those are welcome proposals. Even so, no use case would technically not qualify, even Digital Art. It is merely the intention to reach beyond to other use cases.\n\nThis Challenge is about increasing worldwide uses of NFTs in everyday transactions, especially on Cardano with business uses that can easily benefit from NFT technology.\n\n++BUDGET RATIONALE++\n\nI propose a $200,000 budget which would accommodate four (4) $50K submissions on average and give each a fair shot of making something that could make a significant difference in the ecosystem. This is 1/4 of the $800,000 budget for something that has a trillion dollar potential in the next decade.\n\n**WHAT SHOULD BE PROPOSED**\n\nProposals should be framed towards specific use-cases, and the community will know of specific cases where NFTs can be used to solve various problems. Focusing on NFTs in general may be most productive, with a strong focus on business models that rely on NFTs as a core component of most transactions.\n\nWe believe many community members will have good ideas on where NFTs could be adopted and believe at a functional level, the community has a lot to say about it.\n\nThis is important for Cardano's future and could be the base for many dApps on Cardano where it is vital to uniquely identify the other party. This is a call for exploring the possibilities where NFTs could be one of the products or service that drives mass user adoption of Cardano.\n\nThis is a relevant topic with importance to not only Cardano since the Mary hard fork and UTxOma introduction, but blockchain and cryptocurrency in general and will have a global impact. Cardano an multi-asset functionality make Cardano an excellent candidate to dominate the NFT futures market. Build something that can make that happen!\n\n**EXAMPLES OF USES FOR PROPOSAL INSPIRATION**\n\nDigital content\n\nGaming items\n\nDomain names\n\nPhysical items\n\nInvestments and collateral\n\nInsurance\n\nContent management/distribution\n\nData management\n\nFinancial Services\n\nManufacturing and industrial\n\nStorage\n\nGovernment\n\nRetail\n\nTransport and Tourism\n\nMedia\n\nRealEstate\n\nLand Registry\n\nIdentification\n\nAdvertising\n\nAuthorship and ownership\n\nSocial Network\n\n  \n\n**POSSIBLE CAMPAIGN BRIEF**\n\nNFT use case development is mission critical because user adoption will have a key role in determining the future utility and value of Cardano. That's why we are looking to the Project Catalyst community to refine and answer our challenge.\n\nOver time, development opportunities on Cardano will evolve to include everything from NFTs, DIDs, metadata to KEVM/IELE, Plutus, Marlowe, Glow and more. Ultimately, the goal here is best summarized by the question:\n\nDid the funded NFT use cases manage to drive user-adoption?\n\nTo find out, we might track the following metrics:\n\nHow many daily active users?\n\nHow much daily local token volume increased?\n\nHow many transactions were made?\n\nHow much funds were transacted?\n\n++Guiding questions++\n\nWhere are gaps in the market where NFTs originating on Cardano have a unique advantage?\n\nWhat kind of NFT solutions can already be developed in the next six months?\n\n++Inspirational potential directions++\n\nThe community open roadmap contains a \"Use cases\" section and \"Driving adoption\" section that can serve as an inspiration for proposers.\n\n++Developer resources++\n\nFor access to all currently available developer tools and guides, visit our developer site. Further documentation can be found here.\n\nMeanwhile, here are some quick links you can start with:\n\nhttps://developers.cardano.org/en/development-environments/native-tokens/native-tokens/  \n\nhttps://forum.cardano.org/c/developers/cardano-tokens/150  \n\nhttps://forum.cardano.org/t/documentation-how-to-create-ada-nfts/50131  \n\n++Metadata++  \n\nMetadata tells the story of transactions made on the blockchain. Cardano is working to provide cutting edge tools for embedding data into transactions and while adding robust search functionality in the block explorer. Check out our blog on metadata or look at our documentation for more information.\n\n++The Marlowe playground++\n\nMarlowe is our bespoke domain specific language (DSL) built for creating robust financial smart contracts on Cardano. For a closer look at Marlowe check out our recent blog or check out our overview on the Cardano Developers page."}