{"id": 369117, "author": "", "title": "Cardano Ecosystem Gender Equality", "url": "https://cardano.ideascale.com/a/dtd/369117-48088", "category": 26120, "amount": 200000, "description": "6-12ヶ月の間に、女性のカルダノコミュニティへの参加率を向上させるにはどうしたらいいでしょうか？", "f6_no_assessments": 4, "f6_rating": 2.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Men and women are equal. The world often is not in compliance with that but what makes us believe that in the Cardano space the females are less engaged compared with other crypto projects or even software-related ecosystems.\r\nIf there is a research showing that females are less engaged in Cardano than in other crypto projects - please link that so the idea is justified. Otherwise there is no real challenge - females are free to chose how engaged they are in any crypto project.\r\nThe solution proposed is not clear. \"To have more female members sharing their thoughts and actively participating in Cardano public events like Town Hall meetings\" - will not do the trick I am afraid.", "q0r": 3, "q1": "Lets assume females are objectively less in the Cardano ecosystem than on average in the other crypto world. The first thing we need to do then is to understand the root of the problem. There might be a some influential leader that promotes such a behaviour. Usually that's the case.\r\nAnd again - simply to state that the solution is to have more females share thoughts is not really a solution. We cannot force that of anybody. The proposal should propose how to make females want to express their thoughts more.\r\nIts simply not clear here.", "q1r": 2, "q2": "The proposed metrics are actually the deliverables of the finished project. The KPIs for the project's implementation is something else - for example - number of voluntary participants that took part in focus groups discussing why females arent sharing their thoughts in the Cardano space.", "q2r": 2, "assessor": "z_assessor_408", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}, {"q0": "While I agree that women should be active in the community I strongly disagree with this proposal because it perpetuates the idea that this particular community is male dominated which it is not by intention. It may be that women are not interested in being techies or coders. Thats a different subject.  This perpetuates the feminist agenda which tries to get special treatment for women based on their gender.  \r\nI strongly oppose yet another demand for women to get special treatment based on their gender. In most countries of the world the law has special considerations favourations and allowances for women based on their gender. \r\nI do not want to see gender discrimination against men coming into the Cardano community. \r\n\r\nWhile I agree with the proposer that there are brilliant female members of the community they already have as much right and opportunity to propose their solutions and ideas. They should not get special consideration based on gender. ", "q0r": 1, "q1": " A reasonable budget has not been stated. There should be no special fund based on gender.", "q1r": 1, "q2": "\r\nThe verifiability of this is clear. Metrics have been identified, a roadmap has been laid out to be carried out. They include\r\nIncreased number of female community members\r\nIncreased number of female proposers\r\nEnhance female members' active engagement and participation with Cardano community\r\n\r\nWhile this is all true, there is nothing preventing the female members of the Catalyst community from proposing solutions right now. Therefore I do not agree that there should be a special fund.\r\n\r\n\r\n\r\nTherefore my conclusion is that a special Fund is not needed for them.", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The success of Cardano and blockchain in general will be dependent on a wide spectrum of users from all different backgrounds, walks of life, ethnicities, races etc... Having a challenge that focuses on increasing the presence of commonly marginalized communities will add serious weight to the future of Cardano. \r\nThe reason why I am giving this challenge setting proposal a 4 and not a 5 is that it is too limited in scope. If we are going to request true gender representation then we need to go beyond the male/female binary and think to include a wider array of genders. The increase in non-binary individuals means that Cardano should make additional attempts to remove all barriers to participation, not just for select groups. To this end, I would like to see this proposal at least mention these other groups, even if the focus does remain predominantly on women. ", "q0r": 4, "q1": "There is no doubt in my mind that the Cardano community has the capacity to address this challenge, this can be exemplified most recently by the influx of women who have been attending Town Halls. Where there was once only single digits of women there have been up to 20 on a call, and hopefully this number keeps growing. There is a strong desire from all community members to increase participation.\r\nThis challenge will also send the right message to outsiders; rather than Cardano being for an elite few, it is really for everyone and the community will explicitly create opportunities for all types of people to participate. ", "q1r": 5, "q2": "I think this challenge setting proposal could use a bit more work on the success criteria and metrics. I am in total support of increasing the quantity of female (and other non male cis-gendered peoples) within the Cardano community but think we need to go further to ensure that it is also the quantity of participation. Adding in some criteria which helps assess the quality AND the quantity will help the community respond and adapt in more targeted ways. \r\nThe budget seems reasonable. ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "While it would be nice to see more women in the space, this seems to depend a lot on cultural and regional factors than the actual structure of Catalyst.  I feel like the representation of women in Catalyst will increase naturally as users from diverse cultures are on boarded. I feel as if a gender-specific category may be divisive within the community. ", "q0r": 3, "q1": "I've seen several proposals by women in previous funds. I do think the community would come forward with funds for this category, and it may highlight female-directed projects.", "q1r": 4, "q2": "the pseudonymous nature of Catalyst and Cardano make monitoring the given metrics for success somewhat problematic, although general conclusions can certainly be drawn. ", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}], "importance": "男女共同参画は、カルダノコミュニティにとって不可欠です。持続可能な発展を促し、男性優位の問題を解消します。", "success": "タウンホールミーティングのようなカルダノのパブリックイベントに、より多くの女性メンバーが意見を述べ、積極的に参加すること。"}