{"id": 370132, "author": "", "title": "Remittances", "url": "https://cardano.ideascale.com/a/dtd/370132-48088", "category": 26120, "amount": 250000, "description": "どうすれば送金が改善されるのか？", "f6_no_assessments": 3, "f6_rating": 2.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Remittances is definitely an important vehicle for ensuring many people's livelihood, an important topic per se, but this challenge description feels abandoned.\r\n\r\nPlease rework it for Fund7 and propose again.", "q0r": 2, "q1": "Catalyst community would surely have many ideas for making global remittances cheap and fast. However, there are already many initiatives (Telcoin, Reserve, COTI, CELO) tackling this challenge. Probably direct IOG collaboration with these projects is the fastest way to results.", "q1r": 2, "q2": "Greg, it is a pity that you didn't find time to finalize this description. If you feel that there's potential, please submit it again for Fund7.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "Improving remittances aligns with meeting the Cardano mission of driving adoption of Cardano. I would suggest rewording the challenge to something like, \"How can the adoption of Cardano in the remittance industry improve the lives of people reliant upon remittances?\"\r\nIt is a good challenge just add in the necessary details or get some help from the community.\r\nI agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 4, "q1": "The challenge brief needs to be defined for the community to address the challenge.\r\nI strongly disagree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 1, "q2": "The success criteria is poorly defined. The key metrics are poorly defined.\r\nI strongly disagree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Developing support for remittances in Ada would be a great idea, and would benefit the community.  The proposal would be improved by explaining this in more detail, including how the challenge is critical to Cardano's mission, as well as how users would benefit.", "q0r": 4, "q1": "It is unclear whether the Catalyst community has the capacity to address the challenge.  The proposal would be improved by introducing specific people (e.g., the proposer and others) who would be willing to champion the Challenge, and describing their relevant background and experience, as well as their ability and willingness to do so.", "q1r": 3, "q2": "\"Transactions\" is a good start towards defining KPIs.  The proposal would be much improved by specifying more detail about what kinds of transactions would be measured, how they would be measured, what would be considered as a successful outcome, etc.  I would also suggest more \"intermediate\" KPIs that could be used to assess progress towards a point at which progress could be measured by transactions.", "q2r": 1, "assessor": "z_assessor_499", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}], "importance": "世界で最も貧しい人々から搾取する5兆円規模の市場です。", "success": "貧しい人の方が"}