{"id": 370124, "author": "", "title": "Atala PRISM DID Mass-Scale Adoption", "url": "https://cardano.ideascale.com/a/dtd/370124-48088", "category": 26120, "amount": 500000, "description": "どのようなソリューションが、Cardanoエコシステムへの簡単なオンランプとしてのDID利用の大規模な導入を促進するのでしょうか？", "f6_no_assessments": 2, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem is key to meeting the Cardano mission of driving adoption of Cardano.\r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "Atala Prism DID Mass-Scale Adoption is new to Fund 6. There are 44 proposals (4th largest of 18 Challenges) being assessed for $250K. The community has the capacity and likely the interest in funding this challenge up to the $500K of this challenge.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria is relevant to the challenge objectives however it is poorly worded which leads to the wrong metrics being selected. Success shouldn't be a lot of proposals. Success should be to substantially grow Cardano's user-base, network-utility, network-value & ADA circulation.\r\nKey metrics should be the auditable measurements required from solutions that are then aggregated by the challenge team to show how effective the challenge overall has been. In this case the key metrics should be new and total DID users per month (or some other time interval). Every solution in this challenge should have some means of reporting the number of DID users the solution recruited on the desired time interval. \r\nHaving the wrong metrics has many negative downstream effects. Proposals do not provide good metrics. Assessments by CAs about auditability are skewed. Voters do not have good information. Solutions cannot be audited for meeting objectives. Challenges cannot be judged whether they are being effective. Ultimately the system does not improve.\r\nI am basing my assessment on my belief that this challenge SHOULD be funded and the process should not be so inflexible as to require a potential 3 month funding gap for something as simple as changing a metric.\r\nI neither agree nor disagree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "PRISM adoption is important for the overall success of Cardano. PRISM is one of the core technologies being developed by IOHK which will enable RealFi applications. \r\n\r\nWe have existing reason to believe that this challenge is important to the community since it was voted for in Fund5. \r\n\r\nDIDs are currently being rolled out for students in Ethiopia in partnerships with one of the Cardano business entities (can't remember which on though) and incentivizing the community to continue to drive adoption of Prism/DIDs in general will be huge beneficial for Caradano as these technologies enable new use cases school credentials, credit scores and much more. \r\n\r\nI give this proposal a score of 5 for Alignment for the above reasons.", "q0r": 5, "q1": "While it's currently impossible for the community to drive mass adoption because the Prism SDK has not yet been released, we can be confident that the community will be able to drive adoption upon the release of the SDK. We can reasonably make this guess because of how effectively the community rallied around NFTs after the Mary hard fork and how many students there are for the Plutus Pioneer program. In addition to this we can see that many proposals were made for this challenge in Fund6 which shows significant community engagement for problems like verified credentials in Australia to health passes to online learning platforms. \r\n\r\nThe fund is set up in such that a broad range of solutions can be proposed to drive adoption and I think the funding amount of 500k is reasonable given the total size of the ADA available for F7.\r\n\r\nOverall I give this proposal a score of 5 for feasibility.", "q1r": 5, "q2": "I think the success criteria of this proposal are framed incorrectly. I think the success criteria shouldn't be framed around the proposals to the challenge but around the problems the proposals will solve. \r\n\r\nFor example, this proposal wants to measure success based on \"The number of proposals that directly address DID use cases in a quantifiable manner\" but that metric will rate highly if there are many low quality proposals. I believe a better metric would be \"Number of DIDs issued by funded proposals\" which actually captures the thing we care about, mass adoption of Prism. We don't care about the proposals for this challenge, we care about how many DIDs and VCs are issued on the Cardano blockchain. \r\n\r\nSimilarly, it's not clear how \"community interest and engagement\" will be measured. Number of comments on  proposals for this challenge? \r\n\r\nI personally think metrics like 1) number of DIDs issued 2) number of VCs issued 3) number of legacy institutions that adopt Prism and 4) number of webapps made are better metrics to measure. I think these are better metrics because they are clearly measurable.\r\n\r\nOverall I give this proposal a score of 2 for verifiability.", "q2r": 2, "assessor": "z_assessor_531", "no_vca": 8, "ne": 5, "ng": 2, "nfo": 1, "vca_o": 2}], "importance": "Atala PRISM DIDは、カルダノブロックチェーンとエコシステムへのゲートウェイです。ユーザーを獲得するための技術とマーケティングの構築が重要です。", "success": "カルダノのユーザーベース、ネットワークの有用性、ネットワークの価値、ADAの循環を大幅に向上させることができる多くの質の高いアイデアが提案されます。"}