{"id": 366707, "author": "", "title": "Distributed Auditability", "url": "https://cardano.ideascale.com/a/dtd/366707-48088", "category": 26119, "amount": 8720, "description": "No common audit standards in funded proposals.\n\nNo consistent evaluation of funded proposals.\n\nFunded reporting is manual.", "f6_no_assessments": 11, "f6_rating": 4.636363636363636, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a well presented cost effective plan to build automation into the heart of auditing funded proposals. For Catalyst to scale, this type of project is imperative to produce.", "q0r": 5, "q1": "The proposer possesses the experience to deliver this project and is already an established member of the community focusing on these issues. There is a well presented plan and it is highly likely the proposer will deliver on it given their experience in the area and energy already devoted to these aims.", "q1r": 5, "q2": "Obviously we would expect a proposal to improve auditability to have a well presented and auditable plan. This proposal succeeds on these aims with clear timelines, goals and metrics. ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 25, "ne": 3, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "This proposal will have a great impact on developing a solution that will create an auditable solution for all future proposals within Catalyst.  It will leverage existing work done by the Catalyst Swarm to enable an infrastructure set up to be able to audit and monitor the progress of projects through a distributed network.  Utilizing Discord as well with pull and push requests to send notifications will make the project transparent to everyone.", "q0r": 5, "q1": "Stephen has many years of experience, strong ties and understanding of the Cardano network and technology that underlies eveyrthing.  His experience with the Swarm and understanding of Discord, GitHub, and other peripheral systems will work to make the proposed solution work.  The roadmap, deliverables, and KPIs for the project are clearly laid out and visible.", "q1r": 5, "q2": "The deliverables and measurements of success are clearly laid out making the tracking, monitoring of the project very straightforward and measurable.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Development of audit standards is important in ensuring auditability and quality of proposals. It is unclear what the whole scope of these standards will be. Proposer should give a clearer idea on what the standards seek to achieve. Normally audit standards give pre-defined rules on how to classify certain asset classes and how these are reported in yearly financial statement. The standards like IFRS and GAAP help auditors audit the financial statements prepared by financial controllers. \r\nI would expect that such standards seek to conformitise reporting between different proposals (at least in the same challenge bracket).\r\nThe second part of the proposal talks about tracking reporting for all the proposals in order to evaluate and analyse their performance. This is also highly beneficial for Catalyst although attaining automated reporting seems more difficult. So basically, the proposers will have to build in some sort of automatic reporting which gathers data/information from the server and sends it automatically to the community for assessment. GitHub actions is mentioned as one solution. So this means that automated reporting would be limited to those challenges having to do with program development on GitHub. \r\nThe third goal of the proposal is about 'build(ing) consistent evaluation tools', however, there is very limited information in this regard. The proposer should define this term further.", "q0r": 4, "q1": "The proposer declares that he has ample experience in organising projects, technical knowledge from working with IBM and QA mgt with a renowned bank. However, someone with auditory skills is required to help set the reporting standards and to produce yearly reports and comparisons. The proposer also seems to be well known in the community which might give him access to the remaining talents needed. The propose should indicate that the plan presented will mainly have an effect on certain challenges involving use of programming.", "q1r": 4, "q2": "The project will have to deliver on various criteria. It has to provide a workable solution for automated reporting. No quality metrics have been set for such a solution (-level of information reported - frequency -results achiever from automatically reported information) as probably these are not yet known.\r\nThe project also ahs to create audit standards for proposals which is not clearly defined how this will be done and the scope of such standards. More information would be useful on this aspect. It is unclear where time is allocated to develop these standards. Finally, it would be hard to assess the quality of the standards developed and their final effect on proposal success.\r\nThere is limited information on the third goal and thus it is hard to assess. One metric talks about quality of performance, achievements & financials reports using the tools, but it is unclear who will assess the quality and what is considered as high quality or low quality. There might be unsuccessful proposals which have bad assessments regardless of using the tools mentioned or not.", "q2r": 3, "assessor": "z_assessor_281", "no_vca": 12, "ne": 8, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "Excelent and simple idea. It will help to standarize the auditability process and give more transparency to it. The proposal is also very clear, with a clear implementation plan (divided into phases and with a schedule) and a scope. the problem is also clear and all the community would benefit from it.\r\nThe only thing to be careful here is to give some flexbility to funded proposers, as each project has its own specificity and not to burden them exhausting reports and beurocracy. This standars should be created together with the community, with a proper governance.  The right tool could certainly adress these problem and other proposals, at least in Fund6, contemplates that. Maybe consider working together.", "q0r": 5, "q1": "Although experienced, Proprosers qualification are not very clear and maybe more than 1 people working on it (2-3 should be good) could be posiive just to give more different points of view on this project, which I think its a must in ideas like this, where you indtend to standarize processess. \r\n\r\nThe plan looks fair and budget break is clear. However, it only considers payment for hours but the are extra costs that should be considered as marketing and possible equipment purchase, if necessary.", "q1r": 4, "q2": "There are a clear roadmap and kpis, however, they have  no targets - which is thge main reason for not getting a 5 stars here.\r\n\r\nThis project also has some risks on the regard of the acceptance of the standarization method from funded proposers but it is somehow addresed here in the project phases (specially in the workshop and in the collaborative way it seems it will be executed).", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 12, "ne": 7, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The proposal suggests an approach which is likely to benefit the current challenge goals. The proposal describes how continuous integration will help make funded proposals more efficient in reporting their goals.  \r\nMy main issue with the proposal is that it does not clearly indicate the limitations, or how it will overcome the limitations, of the method that is proposed. As a software developer, I can see very well how continuous integration would streamline reporting on metrics like number of commits and features implemented, but i'm having trouble imagining other metrics, such as user feedback or application usage, as they are not built-in to the code in the repository. However, it is not necessarily be a problem, as the goal is not to solve all reporting issues, I just wish the limitations were a bit more clearly explained.", "q0r": 4, "q1": "The team seems to have appropriate expertise in the field, and has clearly defined the goals of the proposal, which is helping funded proposals make their reporting easier and faster. The proposer has a phase 0 which takes place before funding, which means he intends to put in work even before funding gets approved, which increases my confidence that he is committed to the project.", "q1r": 5, "q2": "The roadmap and time frame is clearly laid out, though the success metrics are hard to evaluate throughout the project - the metrics makes sense once the project has been successfully implemented and is in use.\r\nThere is a clear, sensible breakdown of the costs.\r\nThe proposal doesn't present risks and challenges, however.", "q2r": 4, "assessor": "z_assessor_318", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is focussed on improving auditability via the creation of a system which increases transparency whilst also enables comparability between reviews of proposals. This will lead to more certainty of the learnings from the reviews. It will also assist better reviews to occur prior to funding being approved.", "q0r": 5, "q1": "It is clear that the Idea Submitter knows what he is talking about. As background I have a Masters in Social Science plus a law degree so have some experience of the importance of standards and how it is important to apply standards of auditing equally to allow system participants to benefit from funding and to feel that they have been treated fairly. I have assisted many teams to apply for research grants in the past. The proposal sets out a clear plan of activity on how to implement the proposal. This is impressive. That said it will be challenging.", "q1r": 5, "q2": "Given the clear timetable of activities both in terms of the activities which are described and the timeliness it will be possible to understand if a deliverable is achieved by a given date. The overall success will be auditable via an assessment of the outputs. I expect this will be possible to do as the stated goals will either be achieved, partly achieved or not achieved and this will be possible to review, provided that the access to information on project outcomes is made available.", "q2r": 5, "assessor": "z_assessor_404", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\n\r\nYes.  The problem is clearly stated as \r\nThere are no common audit standards in funded proposals.There is no consistent evaluation of funded proposals, either in terms of frequency ( 1 evaluation per quarter etc) or quality ( no estbalished standards of tracking and reporting.)\r\n\r\nFunded reporting is manual.Each time can do as and when they wish.\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\n\r\nYes. It has to do with Improving Auditablity  by identifying common community standards and building consistent tools. \r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nIt states that since Cardano is a community, and Catalyst is built to distribute governance for Cardano Blockchain, then it follows that auditability also should be distributed.\r\n\r\nHave key metrics and goals of the proposal been stated clearly?\r\nThe goals have been stated clearly. Namely to idenfity common community standards, build consistent evaluation tools and automate reporting.\r\n\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\nYes they do\r\n\r\nCan the proposal scale to address future challenges?\r\nIt can provided the tools are designed to scale up and the standards built on a framework allowing scaling.\r\n\r\nIn summary this more than comprehensively meets the criteria for impact.", "q0r": 5, "q1": "\r\n2. FEASIBILITY\r\n\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nYes he has over thirty years of experience. He seems to be doing it himself. \r\n\r\nAre these links sufficient?\r\nYes\r\n\r\nHave you the CA visited these links and contacted the relevant people?\r\nYes \r\n\r\nHave you been able to assess their level of competence?\r\nYes the developer seems competent\r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nNo other team members have been listed.\r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nHe has laid out his capabilities, but no team has been identified.\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nYes budget is clearly laid out into identifiable items.\r\n\r\nIS budget reasonable to achieve the set goals?\r\nIt is very reasonable.\r\n\r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nYes all his workflow can be verified and assessed. \r\nHave you verified this plan?\r\nYes\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nThe time table is realistic.\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nYes it shows how each step is to be carried out.\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nYes it describes needed resources\r\n\r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nYes the technical aspects are explained.\r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nChallenges and risks have not been identified.\r\n", "q1r": 5, "q2": "\r\n3) Auditability\r\n\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nYes a roadmap with milestones has been laid out.\r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nThere are clear metrics\r\n\r\nIs there a clear understandable description of the targeted problem?\r\nYes it is clearly understood.\r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nThe solution has been clearly understood\r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nHurdles have not been mentioned in this document but it is evident the proposer is competent to deal with them.\r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNo difficulties have been mentioned\r\n\r\nAre there contingency plans in place for various outcomes?\r\nNo\r\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "This challenge works to develop automated and standardized tools for auditing future projects, directly answering the challenge.", "q0r": 4, "q1": "The benchmarks of progress involve studying how other projects are audited and working to extrapolate a standardized protocol. Based on the proposer's experience it seems quite doable for him to implement these steps, including the KPIs.", "q1r": 4, "q2": "The benchmarks of success appear reasonable and relatively clear, with deployments on github laid out at clear time points.", "q2r": 4, "assessor": "z_assessor_517", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This is a great initiative and very necessary. Auditability and standardized metrics would help tremendously. The one thing that most proposals lack is a clear way to track progress and efficacy.  This proposal would go a very long way to help that shortcoming.", "q0r": 5, "q1": "The plan is very well documented. The links and repositories are not very clear and there is no code in the Github as far as I have seen apart from some random config yml files and a few htmls, but that is OK at this stage.\r\nWhat is a little bit concerning is that the proposer has so many other proposals in Fund 6 but this seems to be a high priority.\r\nReading through the comments in this and the last funded project this seems like a genuine and structured approach to achieving QA and traceability.\r\nI would have liked to see more clear presentation in the proposal of the achievements of the last funded round (although that was a mere $5 so not sure how much one can expect).", "q1r": 4, "q2": "A paragon of clarity in the plan and the breakdown of activities, deadlines, etc. to achieve auditability.\r\nAnything less would of course have been a warning flag to this initiative, but I think it is great.", "q2r": 5, "assessor": "z_assessor_533", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Right from the start, the author of the proposal succinctly and efficiently explains to us the key issues involved in the analysis of proposals approved in the Catalyst project. The lack of a standard in the audit, in addition to the irregularity of such reviews, are really very relevant points, which the author cites from the beginning in his presentation, claiming that he will solve them. It is good that the proposal author builds on a previously successful proposal to chart paths for their project. As I understand it, this model proposal is a so-called QA-DAO (Fund 5 Developer ecosystem). It is interesting that it provides a link to the proposal, so that people who do not know it could have easier and faster access. The impact of this proposal is already identifiable, taking into account that a series of models and forms about the problems of the proposals and activities that involve them are already circulating, through tools such as GitHub Actions. The author conveys security in this information, passing up to the exact date on which these activities began. For this reason, I believe that the proposal dialogues very well with the objectives of the challenge, which are mainly to monitor the progress of financed projects and ensure that these data reach the members of the community. This can be seen clearly in the excerpt: \"An auditability workflow will model the working practices of the participants, the metrics they report on, whether this fits into their own documentation, and how they can benefit from automation.\" If this promise is fulfilled, success with the challenge objectives is certain.", "q0r": 5, "q1": "Regarding the author's ability to deliver what he promises, we have a satisfactory amount of information about him. We know that he has experience in managing projects, academic, business or community and also some projects he managed, about what they were about and where they happened (some in Catalyst itself). His actions are tracked very accurately, that is, we know what he has been doing, in which part of Catalyst (Town Halls, for example) and since when, with dates. His linkedin profile is also attached, where we can get to know more intimately who Stephen is, what his professional background and other places where he has worked. In this way, a lot of confidence is passed in their ability to carry out the present proposal.", "q1r": 5, "q2": "The author of the proposal provides us with a great deal of information about auditability. We know what will happen, according to phases, and the actions of each phase are very detailed. Furthermore, they are situated in time so that we can know exactly when they will happen. We are also given what the definition of success would be like, how the community can accurately track the progress of the project and whether everything is going as planned. The division of funding money is also extremely detailed, including information even on how many hours each activity will last (a very rare thing to find in the proposal description). Everything is very well explained, from how the project's publicity will happen, through which media channels it will happen, as well as the technical development, through updates on github. For these reasons, I believe the auditability is perfect, there is nothing to criticize. Through the information given, we can have a solid visualization of what will happen, when and for what purpose.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 10, "ne": 9, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "This a great proposal and one needed to extend further quality assurance in the Catalyst process. The experience is quite extensive and the organization is present for the delivery of its solution. ", "q0r": 5, "q1": "Given the 30 year experience and previous examples of this work being done before I believe the proposal will undoubtedly be implemented successfully. Great roadmap and everything timed down to the details for a transparent delivery.", "q1r": 5, "q2": "The information provided is quite clear and concisely detailed as to what each step will do and how are the funds are used.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Identify common community standards.\n\nBuild consistent evaluation tools.  \n\nAutomate funded proposal reporting.", "experience": "Stephen has 30 years' experience in organizing academic, community and business projects (See Detailed plan)."}