{"id": 366865, "author": "", "title": "Auditing African Proposals, by WADA", "url": "https://cardano.ideascale.com/a/dtd/366865-48088", "category": 26119, "amount": 23000, "description": "Difficulty in auditing proposals in a growing community means scalability is affected", "f6_no_assessments": 9, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a good proposal to leverage the African community to audit African based proposals by a team already involved in reporting on currently funded projects. The big question is how will this scale. How many projects for how long will the requested funding allow auditing?", "q0r": 4, "q1": "The proposers have been invovled in reporting on funded projects and thus have the ability to do thuis type of work. The plan however lacks information on how much auditing will be able do be done with the requested funding? How will it scale, how long will it run for. Perhaps they should be aiming to work with proposers to embed common standards for into the proposals to streamline auditability?", "q1r": 3, "q2": "Whilst it will be easy to audit progress in terms of the hiring of CA's to do auditing, what really matters in this challenge is the auditing of the funded projects. They have set a success metric as the number of projects audited, but how many audits on how many proposals do they expect to be able to conduct for the requested funding? How does that compare to the number of African projects expected top be funded over the same time period?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 19, "ne": 6, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "This proposal does make great points about how it intends to support an auditing-based system for proposals, but it is limited in scope for only West African proposals.  This would limit the effectiveness of the auditing program to a small subset for Catalyst and could potentially cause differing metrics or standards of success across global proposals and West African ones.", "q0r": 3, "q1": "The WADA team and the proposer have had many successful catalyst proposals in the past and have a solid team of people that they could rely on accomplishing the goals of the proposal.  The proposal is very human-intensive which is shown in the team members needed and the amount requested, would require more overhead to meet the goals described. A doubt about the proposal being implemented successfully is the ability to scale with a lot of the metrics/reporting seemingly done through personal data scraping in regards to getting information on future projects.", "q1r": 4, "q2": "There is a plan for continuous improvement and guidelines on how to establish cadence for the team to ensure quality along the way.  The roadmap seems to address the requirement, with only hiring for the team to be the only area that would contain any unknowns.", "q2r": 4, "assessor": "z_assessor_13", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal speaks about taking over the auditing function from IOG for auditing 'African Proposals'. It is unclear whether this refers to the proposals submitted un the 'Grow Africa, Grow Cardano' challenge or otherwise any proposal referring to Africa. The proposer fails to define how these 'auditors' will be chosen and who will pick them. It is unclear how any results such as data, reports, articles and videos will be shared with the community in general. \r\nOnly $12,000 is being allocated to audit fees and no indication to how many proposals will be assessed and what material will be produced by the assessors. ", "q0r": 3, "q1": "While WADA is an established community, although in its nascent stages, it is unclear whether they hold the necessary skills, competency or co-ordination to take up the auditing procedure of winning proposals relating to Africa. \r\nCertainly, upon reviewing the proposal submitted, I cannot say that I feel particularly confident in the team. The proposal lacks various details in various areas as described below. It is formulated as an idea with many vague terms and goals rather than a meticulous and cohesive plan. Finally, given what the proposal aim to accomplish, it seems unlike that it has been adequately budgeted or that the budget requested will see the project through.", "q1r": 2, "q2": "The proposal itself is very brief and lacks detail. WADA seems to indicate that everything will be kept in-house and in collaboration with partner https://www.blockchainedu.org/. No information is given on the recruitment process for auditors and whether the WADA network and its partner has enough competent human resources to take on both the task of recruitment and that of assessment of proposals. \r\nSecondly,  the proposal seems to cover 3 months, \"create a 3-month auditing program where auditors will be tasked with creating bi-monthly reports, articles and videos on their assigned proposals.\". Does this mean that the proposal is talking about the upcoming funds? Shouldn't the auditing program be aligned with the funds? \r\n3 of 4 of the goals under the impact section refer to 'increased visibility', 'stream of updates' and 'improved tracking of performance metrics'. No further info is given on this and it is unclear how these will be reached or what they mean exactly.\r\nAnother goal in to set an auditing process and auditing framework within 30 days. This very important as the assessment would have to follow this process and abide by the framework. No indication of what the framework or process will include was given. No information about the skills of people who would come up with this framework and process was shared. \r\nIt speaks about a 3month auditing program but later there is written that after 90 days, in Fund 7, the proposals will be audited until their completion. I struggle to understand the plan and how the budget of 12,000 to audit team fees shall suffice and how they have been worked out.", "q2r": 1, "assessor": "z_assessor_281", "no_vca": 12, "ne": 9, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This proposal clearly meets the brief. It is good that it has a certain \"trial period\" baked in. The learning points from this can then be applied to a full-fledged ongoing auditing process. The only thing I'm not certain about is the African approach. Instead of geographic focus, would it be better that there were audit teams focused on type of challenges (infrastructure, dApps, marketing & outreach etc)? On the other hand, it can be justified to use this approach to ensure quality results. Just be careful not to create walled gardens. Furthermore, I like it that there's a certain marketing angle to the proposal. It's not just \"boring bureaucracy\" but aims to increase the visibility of the funded projects.", "q0r": 4, "q1": "Josh and WADA are a reliable, professional and well-coordinated team. There is no doubt they can pull this off. If the geographic focus is chosen, then cities / countries might need their own coordinators in time to come but that might already be out of the scope of this proposal.", "q1r": 5, "q2": "I don't know if bi-weekly refers to 1) \"occurring every two months\" or 2) \"occurring twice a month\" (guessing the latter). Apart from that I couldn't find any holes in the proposal. Perhaps setting goals for each of the metrics would make it even better but all in all it is a solid approach and deserves to be funded as is.", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "With 54 countries in Africa, the idea of a West African gatekeeper could lead to the exclusion of ideas from North, Central, East and South African Nations. This does not align with the campaign brief. The proposal end goal, to bring more funding towards African proposals, is good. But No plan is given on how centralizing a decentralized idea will benefit \"Africa\".", "q0r": 1, "q1": "There is no evidence of  relevant skills and experience needed to implement the proposal. WADA alliance is not shown to have any auditing experience. There is no evidence of the type and number of team members required to implement the proposal. There is no budget outline, implementation plan or reason $23000 would be required. Information on how Auditing African Proposals would be built, and what technical / ethical aspects like architecture, language and technology would be used for implementation is missing.\r\n", "q1r": 1, "q2": "The roadmap, budget breakdown and key metrics are incomplete. An incomplete audit of this proposal does not bode well for an auditing endeavor. Percentages of proposals audited are given, but there is no indication of where these proposals are to come from, or plan on where to find the auditors themselves. It would be tough for a voter to keep up with the success of this proposal.", "q2r": 1, "assessor": "z_assessor_311", "no_vca": 10, "ne": 2, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "i strongly agree to the proposal because is in scope with the above challenge. And has an impact on the cardano ecosystem by helping develop a better reality..", "q0r": 5, "q1": "its highly the proposal will be implimented because looking at the past  success and future outlook of wada, ''wada'' has deliver well auditing program with its partner blockchain and  also has provided available links that can help CA's reach it people on bored and their site as a whole. And budgets have been outlined correctly to know how project will be implement if funded..", "q1r": 5, "q2": "Looking at this statement by wada that Successful audit of over 80% of proposals given. 90% completed within timeline and with 90% accuracy. At least 50 unique content pieces (articles and videos) are created on the proposals as a whole. And also showing the number of vedios and other proov's in the key metricks And provided accurate links and road maps to help track everything.. wada has also stated on organizing auditing programs and even atleast not more than 10 CAs to check project if proposal is been funded", "q2r": 1, "assessor": "z_assessor_447", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\n\r\nYes. As proposals increase, auditing becomes harder, and scalability is harder. \r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\n\r\nYes.\r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\n\r\nYes, setup of a dedicated team of auditors\r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\nYes. They have KPIs, like No of funded proposals audited and No of reports articles and podcasts on aspects like Performance, Achievements, Financials. They have a clear plan of hiring full time auditors. Auditors will have clear duties and responsibilities, along with defined timelines for deliverables, and incentives for proper performance.\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\nYes. They do fall within challenge scope\r\n\r\nCan the proposal scale to address future challenges?\r\n\r\nYes. By bringing on board, and training more auditors they can scale up.\r\n\r\n\r\nAs shown in the questionnaire created by me, the problem has been clearly identified and it falls within the scope of the challenge brief. It clearly shows how it adds value to the Cardano system by hiring full time auditors. It states clearly key metrics and goals which fall in the scope of the challenge. It can scale up by increasing number of auditors.", "q0r": 5, "q1": "2. FEASIBILITY\r\n\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nYes. They have been recipients of several funded proposals. They have that experience with them. \r\n\r\nAre these links sufficient?\r\nYes. They have also laid out a roadmap of deliverables. These include number of reports, articles, videos on various factors. \r\nThe KPIs No of proposals auditors were able to audit at excellent level (90% accuracy), number of smart contracts audited, no of onboarded developers, no of articles written, reports delivered, videos created.\r\n\r\nAlso KPIs for auditors include the % who complete the programme, no of audits completed, and % completed within the time line and % completed with 90% accuracy\r\n\r\nHave you the CA visited these links and contacted the relevant people?\r\nI have visted some of the links. I have not contacted people.\r\n\r\nHave you been able to assess their level of competence?\r\nThey seem to be competent based on the fact that they have been awarded multiple previous awards.\r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nYes they have laid out the number of people they need.\r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nYes he has identified how many students and CAs are needed, and from where he would select them\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nBudget has been clearly broken down into identifiable items.\r\n\r\nIS budget reasonable to achieve the set goals?\r\nThe budget is reasaonable.\r\n\r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nIN this document the proposer has not identified a verifiable plan if additional funding is required.\r\n\r\nHave you verified this plan?\r\nNo because there is nothing to verify.\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nYes the time table is realistic.  I would probably increase it a little more since this is both the first time the Auditors are applying to be auditors, as well as their first time doing it, and also WADAs first time running this program\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nYes. Starting from hiring of 10 students and CAs, where they apply for the role, and follow a training program, they must complete it and their incentives will be tied to the completion of audits of high quality, within the time frame.\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nYes it describes the resources needed\r\n\r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nThis programme describes the technologies used in preparing audits e.g videos, podcasts, articles.\r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo risks and challenges have been considered in the proposal\r\n\r\n\r\nAs shown in the questionnaire created by me,these links are sufficient and they have also laid out a roadmap of deliverables. These include number of reports, articles, videos on various factors. \r\nThe KPIs No of proposals auditors were able to audit at excellent level (90% accuracy), number of smart contracts audited, no of onboarded developers, no of articles written, reports delivered, videos created.\r\nAlso KPIs for auditors include the % who complete the programme, no of audits completed, and % completed within the time line and % completed with 90% accuracy. I have visted some of the links. I have not contacted people.The time table is realistic.  I would probably increase it a little more since this is both the first time the Auditors are applying to be auditors, as well as their first time doing it, and also WADAs first time running this program\r\nThe proposal provide a sensible and conductible plan for implementation starting from hiring of 10 students and CAs, where they apply for the role, and follow a training program and must perform at set levels of quality. they have laid out the number of people they need.He has identified how many students and CAs are needed, and from where he would select them\r\n\r\nNo risks and challenges have been considered in the proposal. ", "q1r": 5, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nYes. A time line has been laid out for the students to be trained, and then put to work.\r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nYes. They are clearly defined.\r\n\r\n\r\nWhat are they?\r\nNo. Proposals under audit\r\nNo. Articles written\r\nNo Reports delivered\r\nNo. Video created\r\nNo. Auditors in the program\r\n% Auditors completing the program\r\n% Audits completed \r\n% Audits completed within the timeline\r\n% Audit completed with high accuracy (Rated by 'audit of the auditors' done by WADA team)\r\nAuditor Approval rating of the program\r\n\r\n\r\nIs there a clear understandable description of the targeted problem?\r\nYes there is.\r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nYes. the plan of hiring students, and CAs, training them and putting them to work to achieve measurable levels of accuracy.\r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nThese have not been stated.\r\n\r\nHow does the proposer plan to deal with these difficulties?\r\n\r\nNo plan has been stated at present.\r\n\r\nAre there contingency plans in place for various outcomes?\r\nNo contingency plans have been stated in this document.\r\n\r\nThey have done well in this part of the proposal except for the last part where ossible hurdles, challenges and difficulties have not been identified, the proposer has no plan to deal t  with these difficulties and no contingency plans have been stated in this document", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 9, "ne": 4, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "I strongly agree with the idea coming from this team as it falls within the scope of the challenge brief. This proposal clearly identifies the problem needing to be solved and articulates it with an understanding solution. The inclusion of students also depicts that the Cardano Ecosystem will receive increase in it's adoption and patronization. The usage of experienced community advisors is a smart idea as a certain level of effective auditing can be done throughout the said duration.", "q0r": 5, "q1": "Links provided turns out to be acceptable enough in addition through to the organization in the rear of this project can carry out the  project. Alongside have a well planned risk management solution and well setup plan to carryout this project giving the timeline on the roadmap to specific time and date.\r\n", "q1r": 5, "q2": "with the understanding that answer toward  the problem statement been identified, proposal clearly subjects a well plan with budget helping to fixed moment and details. Besides applying to those proposals already funded and tracking them for a minimum of 3 months is a very interesting idea .\r\n", "q2r": 5, "assessor": "z_assessor_528", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "I strongly agree that this proposal effectively address the challenge due to the following rationales:\r\n1. The problem needing to be solved has been identified and articulated.\r\n2. The proposal falls within the scope of the challenge brief.\r\n3. The proposal indicates clearly how it will add value to the Cardano Ecosystem.\r\n4. Key Metrics and Goals  of the proposal has been stated clearly.\r\n5. The Key Metrics and Goals of the proposal aligns with the scope of the challenge brief.", "q0r": 5, "q1": "I strongly agree that given experience and plan presented, it is highly likely that this proposal will be implemented successfully. Why?\r\n1. The proposal provides evidence (reference, link) of  relevant skills and experience needed to implement the proposal.\r\n2. A reasonable budget which is broken down into deliverable items has been provided by the proposal.\r\n3. I have tested and verified that the link provided is accurate and works.\r\n4. Competence level of the team has been reached and is okay for implementing the proposal.\r\n5. The proposer knows in identifiable manner, the team structure needed to implement the proposal. ", "q1r": 5, "q2": "I strongly agree that the information given is sufficient to audit the progress and the success of this proposal. Why?\r\n1. Roadmap has been clearly laid out.\r\n2. Clearly defined Metrics have been provided to help define success of the proposal.\r\n3. The targeted problem has been given a clear understandable description.\r\n4. A clear understandable solution that addresses the challenge is stated clearly.\r\n5. Possible hurdles, difficulties, and/or challenges have been identified and a plan of dealing with them has effectively been drawn out.", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 9, "ne": 4, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "WADA becomes a secondary support layer in the auditing of African proposals", "experience": "WADA has already gained funding through Catalyst and understands the reporting process well. They are both on-the-ground and international."}