{"id": 367331, "author": "", "title": "Asset Management on the Ledger", "url": "https://cardano.ideascale.com/a/dtd/367331-48088", "category": 26115, "amount": 17500, "description": "1\\. Currently, to launch an NFT, it requires extensive technical knowledge.\n\n2\\. There are no metadata standards besides a general 721 format", "f6_no_assessments": 4, "f6_rating": 3.25, "videos": [], "media": [], "f6_assessments": [{"q0": "Asset management is an important aspect of NFTs, however this coarse proposal will most likely not deliver a satisfying solution to it.", "q0r": 2, "q1": "The plan is not very detailed and the proposer does not provide any proof to his claimed qualifications.", "q1r": 2, "q2": "The proposer does not provide any milestones. The only auditability can be derived from the planned functionalities, however those are not very detailed either.", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The proposal addresses the challenge in a simple and effective manner. The challenge is a relevant one and considering the success of NFTs on ethereum which were until recently providing the majority of traffic on the network, it is imperative that Cardano increases its accessibility for NFT developers.", "q0r": 5, "q1": "The plan is cogent and even provides a business model which will generate generous and fair revenue once the guide is implemented. They address limitations for the proposal which shows thought and dedication to the project. I agree that this proposal will be implemented and utilised once completed.", "q1r": 5, "q2": "There is a solid KPI and end goal stated in the proposal which reassures assessors and the community that the funds allocated will be used appropriately.", "q2r": 5, "assessor": "z_assessor_542", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This proposal addressees the challenge by presenting a solution for bring down the difficulty of creating NFTs on cardano, but I'm not sure that it is a solutioin that will drive adoption for cardanno to become the blockchain of choice for the commercial NFT landscape.", "q0r": 3, "q1": "The proposer does not state any relevant experience for the proposal, they just state there is already partial development for this feature. The plan does not go into detail how they will establish the NFT standards as I believe that will either take a large ammount of development on their end, or a large consensus and concerted effort by the community to create new standards. I would like for those to be address in the proposal in order to receive a higher review.", "q1r": 3, "q2": "This proposal does have development milestones, but it does not go over a timeline or what success looks like. When auditing this proposal, we would have some metrics to measure, but the proposer does not state for themselves the success milestones they expect.", "q2r": 3, "assessor": "z_assessor_612", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "I don't think that a minting tool is enough to drive new use cases. I like that the proposers have given attention to non-artwork use cases, but on  a technical level these are basically the same as an artwork NFT, for which numerous minting platforms exist in a simliar price range. Establishment of metadata standards could incentivize use cases but would that the project gained wide community support to be effective.", "q0r": 3, "q1": "The proposers have developed some minting tools and a front end for minting NFTs of certain types. No relevant experience is given for the integration of payment systems or the achievement of technical and legal consensus.", "q1r": 3, "q2": "The project hopes to gain 1000 users and mint 3000 assets in the first month.  The timeframe of other milestones is not specified. The platform must out-compete similar platforms already under active development if it hopes to promote the adoption of new standards.", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "1\\. Allow users to simply follow a form submission, varying by asset.\n\n2\\. Reach legal and technical consensus on various asset standards.", "experience": "Partial development exists for: Form UI+backend (Documents, Real Estate, Art: physical/virtual) and python code to execute minting"}