{"id": 367545, "author": "", "title": "Digital Asset Management Tool", "url": "https://cardano.ideascale.com/a/dtd/367545-48088", "category": 26115, "amount": 39600, "description": "Many people in society do not understand about NFT and how to create NFT. Example: Artists, museum owners...", "f6_no_assessments": 4, "f6_rating": 3.833333333333333, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=23493"], "media": [], "f6_assessments": [{"q0": "The udea will make it much easier for NFT creators to make content without worrying about the technicals of NFT creation", "q0r": 5, "q1": "Overall it looks like there is sufficient experience. Would be nice to see some more code on what they are thinking about for execution", "q1r": 4, "q2": "The funding is a bit high and I think instead of using their own wallet as an initial starting point they should forget that and work on using the smart contract model. Smart contracts are so close to being available and are the long term solution", "q2r": 3, "assessor": "z_assessor_119", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Using NFTs to represent assets addresses the challenge brief of creating business models with NFT's at the core. Minting NFTs as assets on the platform will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to refine the problem statement and solution, at the moment the problem statement and solution is disconnected. At the moment it reads as: Problem – people don't understand NFT's; Solution – Allow users to create NFT – the solution presented does not address the problem statement at the moment.", "q0r": 4, "q1": "Although the team provided a link to a website and Google doc with more information, I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences beyond the Google doc supplied. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 3, "q2": "The proposal has a minimal roadmap and single line budget. I would like to see the team develop Key Performance Indicators (KPI's) (turn 1000 assets into NFTs by month 3, sign up 250 users Month 7, etc - create measurables) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline) . I would like to see the team create a thorough roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This proposal defines a much needed part of the Cardano NFT ecosystem, a marketplace ran on a smart contract. As Cardano is clearly taking over as the premier blockchain for NFTs due to native on-chain assets, NFT minting and marketplaces will be very necessary to facilitate the demand of this exploding ecosystem of users.\r\n\r\n", "q0r": 5, "q1": "The proposer also has a working website already, where you can mint NFTs yourself, this lends to the teams credibility and seriousness of the proposal.\r\n\r\nThe team also has nearly 45 years of experience in tech between them, which gives me confidence that they can successfully deliver a working product running on a Plutus smart contract.\r\n\r\nThis proposal has a high likelihood of success in my view.", "q1r": 4, "q2": "The proposal includes a detailed roadmap with KPIs for the respective milestones.\r\n\r\nThe proposal also includes a simple cost breakdown to see where the team plans to spend the funding should they get it. \r\n\r\nIt should be fairly easy to gauge the success of this proposal given the information provided by the proposer.\r\n", "q2r": 4, "assessor": "z_assessor_577", "no_vca": 9, "ne": 4, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "This is an awesome idea for nft use cases. The notion that most users can be able to mint nft potentially from their wallet for whatever usage in particular to ownership, intellectual rights etc can revolutionise the nft use cases and create a robust and thriving nft community in cardano.", "q0r": 5, "q1": "Considering the team's experience, knowledge and expertise, I am convinced that they can conveniently execute this proposal. In addition, proposal has well detailed milestones and a modest budgetary plan and analysis on fund allocations.\r\n\r\nThe fact that there is a recognition of that smart contract functionality is big risk factor for success is an advantage.", "q1r": 5, "q2": "There's not much information on how to assess the performance of the project. How do we hold the team accountable if the proposal is funded. \r\n\r\nMore details are required about success metrics of the project.", "q2r": 2, "assessor": "z_assessor_9", "no_vca": 10, "ne": 3, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Allow users to create digital assets on the blockchain network to help them protect their ownership of those assets.", "experience": "We are employees of Wecan Group specializing in providing website and mobile app development solutions for organizations in Vietnam."}