{"id": 367893, "author": "", "title": "Mimic Nature with Living NFT", "url": "https://cardano.ideascale.com/a/dtd/367893-48088", "category": 26115, "amount": 65000, "description": "Typically NFTs are unchanging digital representations of static 2D art. What if they could mimic nature?", "f6_no_assessments": 3, "f6_rating": 2.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "Ok, so this is definitely a new use case. If it wasn't for collecting these NFTs you really wouldn't need a blockchain for this, though.\r\n\r\nThere is something similar (more commercial though) coming from Fold: https://www.coindesk.com/business/2021/08/18/bitcoin-gets-the-pokemon-go-treatment-in-new-rewards-app-from-fold/\r\n\r\nYou could consider teaming up with such existing initiatives and try to convince them to use the Cardano blockchain instead. This could definitely turn into an exciting loyalty app or a way to provide unique value-adding customer experiences.", "q0r": 3, "q1": "The team is not really introduced at all and the plan is on a very generic level.\r\n\r\nCould it be that this was specifically designed for Mr Hoskinson? :)", "q1r": 1, "q2": "This amount of planning doesn't warrant $65,000 USD.\r\n\r\nPlease get back to the drawing board, crystallize the idea more, create a detailed budget, introduce the team and re-apply in Fund7.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1, "reply": "Thank you. Yes this is a new use case and one that can drive wider interest in and use of Cardano. We have approached Niantic and await a response. Half of the budget is for development of the AR MVP. The remainder is to attract and engage blockchain programmers to begin work on the “living NFT” component of the game. Given the shortage of Haskel and blockchain programmers, we thought it prudent to have a solid budget in hand first. Note: the AR team is already in place (see https://rewildgame.toonstech.com). A quick search of LinkedIn will reveal their credentials. Regarding Mr. Hoskinson, it is our understanding that it was our bison game idea that spurred him to begin talking about crypto bison during the March 360.  Until that event, we were unaware he owned bison."}, {"q0": "Creating an NFT game addresses the challenge brief of creating business models with NFT's at the core. Minting and selling NFTs on the game will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to simplify the problem statement and solution, at the moment the problem statement is a question. ", "q0r": 3, "q1": "The NFT game is a good idea bit I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 2, "q2": "The proposal has simple roadmap attached and single line budget. I would like to see the team develop Key Performance Indicators (KPI's) (create 15 test bison by month 2) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This is a very novel idea involving the use of Cardano NFTs to mimic . Although, I am unsure of any way to modify a Plutus smart contracts metadata. As we all know you cannot modify a smart contract once deployed on the blockchain, so I think more detail is needed here and would be much appreciated.\r\n\r\nPerhaps you are planning to use the NFTs PolicyID to take existing assets and burn them to mint new ones with new metadata attributes into the UTXO created? Please elaborate on the specifics of how you plan to achieve this!", "q0r": 4, "q1": "Although I like the idea, I think it needs a tiny bit of refining which is understandable because smart contracts in a UTXO paradigm are quite different than on ethereum where state is stored in the smart contract itself instead of in the UTXO.\r\n\r\nStill I think if the team could clarify a few things this proposal could be very successful.", "q1r": 3, "q2": "In addition to the clarification about modifying the smart contract, which is not possible, I would like to see a more thorough roadmap laid out, with specific KPIs for each milestone.", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Demonstrate through the 'ReWILD! AR mobile game App Cardano's potential to generate \"living\" smart contracts that can mimic nature.", "experience": "Four person team currently comprised of immersive media experts in AR/VR App development, publishing and marketing."}