{"id": 367943, "author": "", "title": "Loyalty and outreach campaigns", "url": "https://cardano.ideascale.com/a/dtd/367943-48088", "category": 26115, "amount": 5000, "description": "Many businesses could benefit from adopting a crytpo currency posture, but most do not posses the knowledge to capitalize upon it.", "f6_no_assessments": 5, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "If implemented correctly a project like this will create a lot of traffic and introduce a lot of people to Cardano. The NFTs are used in a non-artistic way which is what this challenge is all about. This project will also cause ADA circulation which is inline with the challenge setting.", "q0r": 5, "q1": "You should provide more info and proof of your team member's skills and experience. Also a mockup design of UI or any work that has already been done would be beneficial. You don't have to wait for funding before you start. A lot of projects on here have a lot to show. It shows commitment and a drive to make the project succeed. Even if its just a sample design of the project's Logo. The budget hasn't been broken up in identifiable items, but it is a sensible amount for a project like this.", "q1r": 2, "q2": "Roadmap could do with some added milestones and KPIs to make it easier to track the progress and success of this project. The plan and the product has a few holes. This is quite a big project so you could ad more team members with the necessary skills to fill those holes and to better identify future challenges and risks. If this is truly a product you believe in you should not give up. Find people that will help bring this project to where it needs to be. From what I can gather you can definitely do with an experienced frontend developer.", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is exactly addressing the challenge to - propose a means or way to drive business use cases on Cardano that have NFT usage as a core component and can act as an onramp to the Cardano ecosystem.\r\n\r\nThe proposing team have suggested an achievable and actionable way to address their problem statement which would drive adoption of NFT use on the Cardano Blockchain.\r\nIf this proposal launched it would be of benefit to businesses, their loyal customers and the Cardano Ecosystem. \r\n\r\nI have perspective on this problem as a consumer who's purse is always filling up with plastic loyalty cards that hardly ever get used and generally don't provide much of a benefit anyway.", "q0r": 5, "q1": "I have confidence that this proposal will be implemented successfully and bring value to Cardano if it is chosen to receive funds in Catalyst Fund6.\r\nThis team has already launched a successful NFT project on Cardano and is active in the community.\r\nThe team have outlined a clear plan and have already purchased domain names for this project.\r\nBoth partners of the team are Plutus Pioneers and have appropriate skills and experience to carry out this proposal successfully.", "q1r": 5, "q2": "The team have asked for a sensible allocation of funding to begin this project. The timeline provided sets defined goals that are easily auditable.\r\nI strongly agree that this project will be able to be effectively audited.", "q2r": 5, "assessor": "z_assessor_330", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal problem statement and solution is about how to bring business owners onboard Cardano by creating a loyalty rewards platform similar to Groupon by utilizing NFT. I think its a good idea, it will definitely brings a lot of new people onboard Cardano. This will open up businesses to a whole new market while having their own loyalty program. Moreover, the project will also benefit the consumers for providing products and services at a discounted price. The coupon system will definitely add value on Cardano.", "q0r": 4, "q1": "The proposer offered a realistic roadmap and asking for reasonable funding. However there is no plan provided if there's any additional funding required. Moreover, the proposer did not mention the potential risk and challenges that they might face relevant to successful implementation. Besides that, the proposer did not give out any verifiable information on the team members. It will be hard to find 'Huth S0lo' or 'Eddie Diaz' to be held accountable for any problems that may arise. Its better to be transparent when asking for public funds.", "q1r": 3, "q2": "The proposal did not provide a method for the community to keep track of the project progress. Please provide a medium for you to report on progress for the community. Also, the proposer did not clearly define the definition of success for the project. In addition, please provide a verifiable information on the team members for accountability. Who will be responsible for the project? I cant seem to find any information on 'Huth S0lo' and 'Eddie Diaz'", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The use of NFT as coupons (loyalty, discount, rewards) addresses the challenge brief to create business models with NFT's at the core. Loyalty and discounts represented as NFT's will increase the use and number of NFTs on Cardano, thus providing value to the ecosystem. I would like to see the problem statement developed in further detail, similarly, the solution to the problem statement must be elaborated – is there a lack of understanding about coupons and the team will educate the market? Or is it an education solution regarding Cardano use. ", "q0r": 4, "q1": "The use of NFTs as coupons is a good idea. However, the project requires further development. I would want to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. The team can expand on the type and number of team members required to implement the proposal - do you require a onboarding team etc?. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". Furthermore, the project must develop the budget and breakdown the budget into identifiable items. Lastly, the project will require additional funding, the team must clarify how the project will fund itself in future.", "q1r": 3, "q2": "The proposal provides a 90-day roadmap and single line budget. I would like to see the team develop and define Key Performance Indicators (KPI's) for the project – what does success look like in 12 months, how many businesses do you want to onboard by month 6 – set a goal and use it as a KPI.  Furthermore, I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. Lastly, the budget needs to be developed beyond a single line entry, the team must create a detailed breakdown. As the project stands at the moment, I feel the project will be difficult to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Solid proposal that identifies a valid problem and and presents a viable grass roots solution. The business model proposed is already operating and is proven and the team would like to modify and implant a cardano theme to the existing idea. The proposal has good potential as the team are well known in social media and Cardano NFT circles. I expect that this would add value to the Cardano ecosystem and quite possibly scale up to significant levels. ", "q0r": 5, "q1": "The team have excellent experience that can be evidenced by previous projects and community affiliations. I feel the plan has some way to go in terms of iterations but the budget requested is not excessive and the team has certainly shown great energy and enthusiasm in the ongoing work. For that reason I feel there is a strong chance of this project being successfully implemented. ", "q1r": 4, "q2": "The information provided in the proposal came without links which may hamper the voting community. Those inclined to drill into the team and their previous and current projects will be well rewarded. This team has not included too much detail on budget or metrics/KPI's but considering the budget requested, what they have put in is sufficient. The project will be auditable and past work speaks volumes.    ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Create a platform similar to groupon with a built in loyalty and NFT gamification to both promote to new, and retention of old customers.", "experience": "Over 40 years of Systems and Network Engineering Experience from our Team Members"}