{"id": 368122, "author": "", "title": "NFT for customer feedback/content", "url": "https://cardano.ideascale.com/a/dtd/368122-48088", "category": 26115, "amount": 49250, "description": "Today, customer feedback is unreliable. Often public & shaming (-), it doesn't show accurate (overall) customers' sentiment to a brand", "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "Using NFTs to record customer feedback and to create a marketplace for such NFT feedback falls within the challenge parameters set out, However, I would like to see the problem statement and solution refined and clarified, I do not understand how recording feedback on NFTs will make the feedback more reliable - the feedback is created by customers and as such the customers are in control of the reliability of the feedback, not the medium/platform of recording. The proposal aims to add NFT functionality to an existing application, indirectly through this application value can be delivered to the ecosystem through increased NFT minting.", "q0r": 3, "q1": "The team provided links to LinkedIn, the current website and to two additional Fund 6 proposal entered by the team. The team is adding functionality to their existing application, thus I believe they have the ability to implement the proposal (NFT functionality) successfully and successfully execute the proposal. Furthermore the team has a well-defined go to market strategy with target customers and segments.", "q1r": 4, "q2": "The project proposed a timeline, budget and defined success. I would like to see the items mentioned in defining success connected to the timeline in more detail – example provide NFT button by month 2. The budget is mainly allocated for payment of labor (salaries) in the format of $ charged per hour multiplied by time period. – I would like the team to connect the KPI's and roadmap milestones to the labor spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the labor spending. As the project stands at the moment, I feel the project will be difficult to audit financially.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement is clear and recognisable. There have been countless time that I have found reviews unhelpful and unreliable to the point where they are not worth anything. \r\n\r\nIf NFTs were used as a review method this could help to quickly scale the use of the Cardano blockchain into mass usage. \r\n\r\nFurther the idea of monetising the interaction with the company by selling your data via an NFT would be another way to quickly scale the usage of the Cardano blockchain and the distribution of ADA. ", "q0r": 5, "q1": "The experience present looks to to be genuine. there ae a number of LinkedIn profiles submitted and the additional documentation provided build a clear picture that the team understands the problem and can tackle it successfully. ", "q1r": 5, "q2": "There is a buget provided but it would be great if this was broken down further in to steps. There are some broad KPIs but it would be good to clearly state how the number that the proposal targets. I couldn't find this in the documentation. ", "q2r": 4, "assessor": "z_assessor_466", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal addresses the challenge with excellent detail and provides insights in to the current flaws within the customer feedback system currently.", "q0r": 5, "q1": "The team has a wealth of experience and provide their linkedin accounts to easitly verify their accolades which gives us confidence that they will carry out the proposal should it be voted on and implemented.", "q1r": 5, "q2": "They offer a detailed road map and breakdown of associated costs and how they will be spent. This allows voters to be confident that they will be able to audit and track the success of this project based on its roadmap. Having a lawyer involved in the project is a benefit also for intellectual rights going forward.", "q2r": 5, "assessor": "z_assessor_542", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "NFT platform to record constructive consumer feedback/content; shared by people with brands; compensating you for useful & creative content", "experience": "Privacy/Tech lawyer with 10Y XP in (project relevant) legal issues - consumer privacy; digital marketing; data rights & virtual currencies."}