{"id": 368280, "author": "", "title": "NFT's as Proof of Donations (PoD)", "url": "https://cardano.ideascale.com/a/dtd/368280-48088", "category": 26115, "amount": 50000, "description": "NGO's are held back from investing in technology, marketing, and talent that could transform the scale of how they raise funds.", "f6_no_assessments": 3, "f6_rating": 3.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "The team listed many benefits that the project will bring to the ecosystem. Using NFTs as a proof of donation made, adresses the challenge brief of creating business models with NFT's at the core. Minting NFTs as donations on the platform will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to simplify the problem statement and solution, at the moment the problem statement is very broad (Maybe something like: Problem: The \"donation\" supply chain lacks transparency, turning away potential donors. Solution: NFTs as PoD. providing all the information such as who donated, how much, when, to whom and for what, getting the full cycle of the donation on the blockchain.)", "q0r": 4, "q1": "NFTs for use as Proof-of-Donation is a great idea and the team has already done an MVP with the Red Cross. Although links to videos from the MVP campaign for the team was provided, I feel the proposal requires further development to ensure successful implementation. The team can further expand on the type and number of team members required to fully implement the proposal, what are the responsibilities and deliverables of each member. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences.\r\nI advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". \r\n", "q1r": 3, "q2": "The proposal has a minimal roadmap and single line budget. I would like to see the team develop Key Performance Indicators (KPI's) (1000 PoDs by month 6, 2000 PoD by Month 7 etc, build up to the 10,000 at month 12) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline) . I would like to see the team create a thorough roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal aligns well with the challenge though I feel donation tracking via NFTs and blockchain could be explained in greater detail. The potential adoption impact can be exponential over time as more team members are onboarded and the audience is broadened.", "q0r": 4, "q1": "The team's experience is limited (CV and links not provided) and the proposal is a big ask. The recent MVP event appears successful and is an example of the team's capabilities. The proposal's budget is not detailed, lacking line items and associated costs.", "q1r": 3, "q2": "The team has failed to bring forth any means of auditing. Milestones are present without much detailed information provided. Please provide key performance indicators, milestones and dates. The proposed idea is interesting, can have a huge impact but the overall proposal needs to be polished.", "q2r": 2, "assessor": "z_assessor_591", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This Proposal is a new and exciting business model for NFT usage.\r\nUsed as  Proof of Donation (PoD) and also as Trade-able collector set is a nice additional benefit. ", "q0r": 5, "q1": "Team Experience gets a 5 star response\r\nDepth of the plan developed and shown here gets a 4 star response.\r\nHence, 4 stars.\r\n\r\nThe Team has done an MVP run successfully earlier this year. They have the talent to move this project along.\r\n\r\nThere is not a lot of detail about how the project will build on the successes and deal with failures of the MVP. \r\n\r\nIf you dig deep enough and find yourself in the Google Drive folder linked here, you will find a very extensive Slide Deck (in PDF form) which goes into greater detail, and it is obvious they have thought this through very well. Unfortunately, this information was not surfaced in the Proposal description for Voter access.", "q1r": 4, "q2": "The proposal does not get into details about where or how the $40k for development would be spent or over what sort of timelines.  The typical WBS is missing, and this makes it difficult to assess audibility.\r\nWe do not see an anticipated development timeline, or detailed plan for how funds will be distributed over time.\r\n\r\nI want to see this proposal succeed, and hope that they return with a more detailed plan of how they will accomplish the desired end result.", "q2r": 2, "assessor": "z_assessor_593", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We help NGO's to raise funds using NFT's as Proof of Donation to build trust, while giving the chance to live unique experiences as rewards.", "experience": "We did an MVP in Argentina with +3k organic users, 8 celebrities and a partnership with the Red Cross to help them fight Covid 19."}