{"id": 369344, "author": "", "title": "NFT Gaming Model + Token economics", "url": "https://cardano.ideascale.com/a/dtd/369344-48088", "category": 26115, "amount": 21750, "description": "NFT's need to extend beyond **ownership** to **utility** adoption to increase lifetime value. Can we use games to show uniqueness and grow utility?", "f6_no_assessments": 4, "f6_rating": 3.3333333333333335, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=13801"], "media": [], "f6_assessments": [{"q0": "The proposal's problem statement and solution addresses the objectives laid out in the challenge. Gaming industry has high potential to attract new users on Cardano, however there isn't much research is being done on blockchain gaming. This project will be one of the 'proof of concept' for Cardano blockchain gaming as well as for the eutxo smart contract model. The blueprint and research papers produced by this project will be beneficial for future developers.", "q0r": 4, "q1": "The proposer provided detail information of the plan and how to execute it. However, they did not provide any budget breakdown on what and how the money will be used. Explain in details how much money is allocated per manpower/hours and also how much money is spent on resources. Moreover, the proposer did not present any information on the potential risks and challenges that they might face when implementing the project. Besides that, there is no plan provided if there is additional funding required.", "q1r": 3, "q2": "This proposal provided a clear and realistic roadmap, however, the proposer did not mention any method on reporting. On which medium can the community receive updates on the progress of the project? Where will the whitepaper be published? Also please provide verifiable credentials of the members who are working on this project for accountability. ", "q2r": 3, "assessor": "z_assessor_357", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "an NFT game with a play to earn feature has NFTs at the core of its business model and meets the challenge criteria. I would like to see the problem statement and solution clarified, can the game improve the utility of all NFTs, or will it only be the NFTs from the game? I would like the team to expand on the architecture of the game mechanics, when two NFTs join, will they be burned (destroyed) to create a combined NFT - the team must think of the input-output mechanics of the eUTXO model.", "q0r": 4, "q1": "Gamifying NFTs for utility is a good idea. However, the project requires further elaboration. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. The team can expand on the type and number of team members required to implement the proposal. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like to see  the project develop the budget and breakdown the budget into identifiable items. ", "q1r": 3, "q2": "The team addressed future funding, and provided a rough timeline (roadmap) and measurables (KPIs) for the project. I would like to see the KPIs (measurables) expanded, at the current moment the KPIs are not connected with the roadmap (timeline). I would like to see the team expand KPIs such as: \"Onboard 50 Alpha testers…. by Q1 2022\". Furthermore, I would like to see the team enhance the roadmap, add milestones to provide deeper detail and illustrate a clear defined path forward – connect your roadmap to your KPIs (measurables). At the moment the budget is a single line item, I would like to see the budget broken down into monthly spending and allocation to work activity for the month. As the project stands at the moment I feel the project will be difficult to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "I am unsure if the proposal addresses the challenge as it is not clear if the NFTs for pairs will have to be minted prior to playing the game. People would effectively have to mint an NFT with a word ad to play the game or would the minting happen as part of the game? The proposal does not address how there would be further utility of the word pairs. This is addressed as questions by the proposer at this stage.", "q0r": 3, "q1": "It appears that the proposer has a lot of experience and is currently working as a plutus pioneer so I feel that the proposal will be implemented. It appears that the project is already under development which supports this.", "q1r": 4, "q2": "On one hand there appears to be a decent road map with an outline of when the product should be released which can give the community a gauge for completion. On the other, there is no allocation of funds which makes it hard to understand the breakdown of costs associated.", "q2r": 3, "assessor": "z_assessor_542", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is a non-art business model that can use NFTs to gain adoption and to chose cardano to create their business. I'm not sure that games will be the way to separate cardano, but it is a great idea to start with and. does address the challenge.", "q0r": 4, "q1": "The proposer experience in mathamtics, building software companies, and being a plutus pioneer gives me confidence this will be able to be implemented successfully. I would like to see a plan for additional experts to work on the game and to bring it to market so that implementation is successful on all ends and lasts.", "q1r": 4, "q2": "It is a simple app to create and the proposer does give us milestones with hard timelines, I would like to see more details on the development so if we are left in a gray area we have more data points to reference. The 3 phrases are straight forward, but details on reaching those milestones would help tremendously.", "q2r": 3, "assessor": "z_assessor_612", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "To increase the recurring use of NFT's we propose a {prompt} + {punchline} word game where two NFT's are combined to \"win\" unique pairs.", "experience": "My formal education is in Mathematics, 10 years building Software companies I can scope, design, & build version 1. Current Plutus Pioneer."}