{"id": 369429, "author": "", "title": "Bets as NFTs.", "url": "https://cardano.ideascale.com/a/dtd/369429-48088", "category": 26115, "amount": 21000, "description": "Transparency in betting games should be improved. Also there is no possibility to trade / move ongoing betting positions and no souvenir.", "f6_no_assessments": 5, "f6_rating": 3.1333333333333337, "videos": [], "media": [], "f6_assessments": [{"q0": "This a well written proposal but failed to address the pressing problem of how to get information to the blockchain (will an oracle be used ?),\r\nWhat will happen to the odds as most betting odds do change as events unfold before the said bet date.\r\nwho will pay for the gas fees to generate the NFT and the importance of the solution to Cardano.\r\nAddressing the above questions will really clarify on the proposed solution.\r\n\r\ni disagree.", "q0r": 2, "q1": "The proposal did not provide verifiable link to given experience but provided a detailed implementation plan with cost breakdown.\r\n\r\nI neither agree nor disagree due to the lack of details to the solution.", "q1r": 3, "q2": "The proposal provided sufficient information to audit the progress and success of the proposal solution .\r\nI agree", "q2r": 4, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Recording bets on NFTs and selling set NFTs on a secondary market adresses the challenge of creating a business model with NFTs at its core. The project can attract users to the Cardano ecosystem and as such create value. I would like the team to expand the solution by elaborating on the architechture behind the project, will the project tie into an oricale for updates, which oricle and how does the tie in work? Furthermore, will the secondary marketplace act as a decentrilised peer-to-peer exchange, how will the marketplace funtion? ", "q0r": 4, "q1": "Using NFTs to bring transparency to the betting industry is a good idea. However, the project requires further elaboration. I would like to see links to LinkedIn, Github or similar to provide additional detail/evidence about the teamwork history, education and past experiences – the team mentions a successful NFT project launched in April, can they say more on this. The team can expand on the type and number of team members required to implement the proposal. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 3, "q2": "The team provided a short roadmap and simple budget. I would like to see the team develop and define Key Performance Indicators (KPI's) for the project – example \"Create and execute 750 bets by month 6, or sign up 50 users by month x, etc\"– set a measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. At the moment the budget is a 4 line item, I would like to see the budget broken down into monthly spending and allocation to project activity for the month. As the project stand at the moment, I feel the project will be difficult to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The idea of enabling bets to be traded via NFTs, enhancing transparency and functionality, is an interesting one.  However, I do not feel that the proposal clearly addresses the challenge regarding businesses and business models.  What is the role of the (centralized) website and does it get paid?  How is the smart contract informed of the outcome of the bet and by whom and how are they incentivized?", "q0r": 3, "q1": "It is difficult to assess from the information provided in the proposal whether the team can successfully implement the project.  The description of the team and claims made about a previous project are not accompanied with any details or materials that would help with this. For example, more details about the project launched in April that could be assessed would be helpful, as well as more details about the backgrounds and experience of the team.  I am also missing any indication that the team has considered important details such as how the various participants are incentivized and rewarded, in particular how bet outcomes are provided to the smart contract and by whom.  I think some fascinating scenarios could arise from the idea, though, so I'd love to see more detailed development of these ideas in future.  For example, a bet on the outcome of a sport match will dynamically morph into a bet on the outcome of a down-to-the-wire penalty kick, etc.", "q1r": 2, "q2": "Specific milestones are listed that would be possible to monitor progress and success. These could be improved by a little more detail, for example, what form would \"explain the concept\" take, and what artifacts would be produced to be considered successful completion of the milestone.", "q2r": 4, "assessor": "z_assessor_499", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Bringing gambling into the Cardano ecosystem is not beneficial. It is a rather centralized business that does not match up to Cardanos mission of decentralisation and equality. More, NFTs are not needed to make such a process transparent as long as the regarding betting transactions have transparent metadata attached.", "q0r": 2, "q1": "Te proposers don't disclosevwho they are or any samples of their work. The budget and the explanation of the nilestones are too coarse-grained.", "q1r": 2, "q2": "The milestones are pretty course-grained, so they can only be audited with difficulty without a more precise timeline.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The idea is an incredible novel one in that for the first time, thanks to NFTs and smart contracts, that a secondary market can be created due to the bet being issued as an NFT that can be redeemed upon the commencement of the bet.\r\n\r\nThe only question that remains is which oracle you are planning to use, and if you have the experience to onboard the data successfully in real-time to the smart contract. This should definitely be included for a betting platform as oracles are the keystone of the entire operation and would essentially play king maker so it is the single most important decision you will make!", "q0r": 5, "q1": "I think this proposal needs more information about the team  \"website dev and a business dude\" isn't much information to lend credibility to this proposal and can only hurt your chances during voting. I strongly advise adding a professional portfolio of prior works, or atleast some more concrete information about your technical skills and capabilities. \r\n", "q1r": 4, "q2": "The proposal includes a detailed roadmap with milestones included, that being said I would like to see some KPIs attached to each milestone so voters and project catalyst can more quantitatively measure the success of failure of this proposal. For example \"\"Open the website for creating bets for multiple collaborators and gain users.\" we would like to know how many users exactly would be using the website to consider this proposal a success, and potentially the volume of ADA bet/and paid out via the smart contract described. Other than that I think we have enough information here for voters to decide.", "q2r": 4, "assessor": "z_assessor_577", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Printing bets (e.g. the score of a sports game) into NFTs will add transparency and a secondary market for ongoing bets in betting games.", "experience": "We are a Plutus Pioneer Cohort 2 participant and website dev and a business dude. We successfully launched an NFT project in April."}