{"id": 369500, "author": "", "title": "Cardano Affordable Housing - 日本", "url": "https://cardano.ideascale.com/a/dtd/369500-48088", "category": 26115, "amount": 120000, "description": "Currently there is no financial incentive to provide affordable or social housing, only through government requirement.", "f6_no_assessments": 4, "f6_rating": 2.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Cutting out the middleman in housing situations is what sparked this entire financial revolution. Projects like this could have a large impact if implemented correctly. Not only by eliminating the function of lawyers, but also notary costs. ", "q0r": 5, "q1": "The proposer is a seasoned real estate developer of large scale projects, so that aspect of relevant experience is covered. However, I have concerns about the possibilities of implementation due to legal issues, so a neutral stance on this seems the correct one. ", "q1r": 3, "q2": "It would have been great to see some more information about the incentives to bring property information on-chain. Not only for the renter, but also the home owner. That is crucial for the feasibility of this project. The attached website and the proposal state that you are located in Toronto. Why is the proposal translated to Japanese? \r\nThere is no risk assessment, which is advisable for something like this to provide assurance. \r\nWhat about legality? Does the law allow this? \r\n", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Using NFTs to tokenize properties addresses the challenge brief of creating business models with NFT's at the core. Property represented as NFTs will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to refine the problem statement and solution, at the moment the two read disconnected from each other (Problem= No incentives to provide affordable housing, Solution = does not explain why tokenization is an incentive?)", "q0r": 4, "q1": "I like the idea but the proposal requires further development to ensure successful implementation. The team provided a links to website which had a link to LinkedIn. I would like the team to expand on the responsibilities and deliverables of each member, this way we can better judge whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 3, "q2": "I would like to see the budget broken down into monthly spending and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the labor spending, thus providing a mechanism tracking performance and spending over time. As the project stands at the moment, I feel the project will be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"q0": "This challenge calls for a wider use case for NFTs over and above that already contained in the art world. This proposal falls within the scope of the challenge as the intention is to utilise an NFT to represent an affordable housing unit and then, in turn, utilise fungible tokens as a representation of a percentage ownership in a Limited Autonomous Organisation (LOA) being a limited liability company (LLC) in which the property is housed. The problem to be solved is to reduce the cost of affordable housing by 49% through this ownership structure by trading the 49% share of the ownership tokens on a public marketplace. The proposal does not deal with the benefit the public would enjoy through funding 49% of each housing unit as right of use of the respective unit(s) is reserved for the 51% holder of the tokens. As an mergers and acquisition lawyer in the finance sector, it looks to be akin to an asset backed securitisation, however more detail is required. The proposal is furthermore silent on the use of the NFT other than being a representation of the property and it is unclear what role the NFT will play in the reduction of housing costs or the transaction as a whole. As the proposal remains vague on the use of the NFTs, specifically here, I can unfortunately neither agree or disagree that the proposal effectively address the challenge.", "q0r": 3, "q1": "The team is comprised of a single member who has an extensive background as a property developer (12 years) who is au fait with the financial and legal aspects associated with these projects. There is reference to experience in technology development as the smart contracts for this project has commenced using Marlow but it remains unclear whether the technical skills are sufficient to implement the integration of this complex funding solution. There is reference to the requirement for legal assistance and to broaden the team with members of the Cardano community involved in the developers ecosystem.\r\nThere is no detailed road map of the specifics required to implement the solution or reference to the technical practical steps required to integrate the same. \r\nAn amount of $120,000 is requested with allocated to legal costs, smart contract development and GUI. The lawyers are being asked to create the financial framework, to lobby (it is not clear who) and to submit the necessary filings. As a lawyer, I am with respect, not convinced this budget is sufficient to cover the legal costs alone and suggest a detailed budget be drafted in consultation with a legal firm for this exercise. \r\nGiven the very high level roadmap and underestimated budget I respectfully disagree that given the information provided this project is likely to succeed.   \r\n", "q1r": 2, "q2": "The proposer does provide a measure of success by referencing high level progress of contractual work and development by months 3; 6 and 12. It is postulated that with a clearer, more detailed roadmap toward implementation clearer deliverables would flow and in turn would provide sufficient information to measure the success of the project. Risks and key challenges of this project and how they may be dealt with, have not been highlighted in the proposal. Given the lack of detail to sufficiently measure the possible success for the project I must respectfully disagree that the project provides us with sufficient information to review its progress.", "q2r": 2, "assessor": "z_assessor_415", "no_vca": 6, "ne": 6, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "I like this idea because let's be honest affordable housing the lasts few years have become totally not affordable. What I'm caseous about is how you plan on implementing this. You say that these days estate developers are faced with strict requirements to set aside a percentage of housing for affordable housing. These are rules that need to be followed by the law I presume, but you don't really give a detailed description of how you plan to implement the Cardano affordable housing. This really is a solid project if it can be implemented.\r\n", "q0r": 4, "q1": "Seeing that the proposer is a real estate developer I have confidence that the proposer has the correct skills to overcome any problems in the proposal. The plan in the proposal is short but following the link, there is a more detailed description of what he plans with the proposal. As I stated above I am concerned about the legal side of this proposal. I know is part of the proposal to find out about the legal department of this but since it's such a high budget that's being asked I would've expected that the proposer already had some details on this. As of now, this proposal can go either way. This is why I will stay neutral on the feasibility part.\r\n", "q1r": 3, "q2": "The biggest part that is missing for auditability is a risk assessment. Being a proposal of this magnitude I expect to see a risk assessment, to give creditability to the proposal. Without a risk assessment, there are too many risks involved with this proposal. Something I don't understand is why is the proposal also in Chinese? Looking at the link you are from Toronto and on you're LinkedIn profile you clearly don't like Chinese. The budget breakdown is also shallow and doesn't go in-depth about the different aspects. One last thing I find a bit too much is on the website you ask CA's to reveal themself and include a sheet in the assessment. This is completely against the rules in Catalyst as far as I know. Even if this is still an experiment...", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Through regulatory-approved tokenization, we will reduce the cost of housing by 49% while maintaining overall value at the market rate.", "experience": "CURRENT: VP @ artboxmodular.com , CEO @ levelondemand.com and leveltransact.com FORMER: Broker, early team @ AvantStay.com, fund2 pyne.fund"}