{"id": 369542, "author": "", "title": "NFT bridge and mega-gallery", "url": "https://cardano.ideascale.com/a/dtd/369542-48088", "category": 26115, "amount": 126000, "description": "Art NFTs on Ethereum are expensive to mint and trade and are \"linked\" to specific platform. \n\nCardano can be a solution and help artists.", "f6_no_assessments": 7, "f6_rating": 3.0952380952380953, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal highlighted a unique problem and offered a great solution.\r\nI agree.", "q0r": 4, "q1": "The proposal unfortunately did not provide any verifiable link of given experience and the implementation plan needs more granular details and breakdown especially with the developers cost per hour or cost per week considering the request of a sizeable amount of $126000.This will further give details on how the funds are used or the breakdown of the fund request to smaller chunks across multiple funding will further help in getting this proposal voted.\r\nConsidering the above, ii disagree.", "q1r": 2, "q2": "The proposal provided some information that can help track the progress of the proposal implementation but the huge fund request and lack of proper cost breakdown stands in the way of this proposal getting funded.\r\nI neither Agree or disagree.", "q2r": 3, "assessor": "z_assessor_331", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The problem statement in itself is relevant to the challenge. The NFT market has been growing immensely during the past few months, and the Cardano blockchain will be a strong competitor to the high gas fees on the Ethereum blockchain (which currently houses the biggest market for NFTs). Creating a bridge that allows you to migrate NFTs between different blockchains (similar to what Polygon is for Ethereum) would create a wide opportunity for people to use Cardano, even if they are already involved and committed to another blockchain. I would have liked to see a bit more clarification in the solution statement. I understand that the original NFT will be copied on the Cardano blockchain and that it will expand the working area of the artists without minting each blockchain individually. But is the NFT just copy-pasted, or is it a completely new NFT that is minted on Cardano? Just an extra sentence explaining how it would work could make a huge difference in clarifying the solution to the problem. \r\nAlso, what function would this project have when compared to other blockchains that has cheaper fees than Ethereum, like for example Solana? Does the function of the 'bridge' work both ways, or is it only migrating NFTs on to Cardano from the outside? These are questions that wouldn't necessarily be there if the proposals purpose/solution to the problem would be more described in detail. Since the budget is asking for 63% of the total funds for the challenge, it is my opinion that the proposal should be crystal clear in what it wants to do and how it intends to do it, no matter who is reading it. \r\nBecause of these question marks, I'm giving the impact a score of 3. ", "q0r": 3, "q1": "It would be beneficial to the proposal if there was some evidence to verify the experience of the team, for example LinkedIn or website. The proposer seems to acknowledge their need of hiring 4 external developers, since they don't have enough experience in developing on Cardano, which is one of the reasons for the budget being so substantial. I'm by no means an expert in business administration, but the budget seems a little bit excessive/inefficient in its allocation of funds. For example, the budget plan includes hiring 2 dedicated testers for 18 000 USD, and I'm assuming the time frame of this spans over the course of 6 weeks (which is the time horizon the proposal provides). My question is why the project aims to finish their product in such a short timeframe, if it means spending so much funds? The proposer gives some further explanation in the comment section of the proposal where he describes the complexity of launching the product piece by piece instead of the whole cake. I would have liked to see some more specifics included in the budget, for example how many working hours are intended for each position in the project. \r\nThe project plan is more than highly ambitious considering the short timeframe and the massive amount of funds required to reach the intended goals. The detailed plan does feature enough specifics to communicate the experience and understanding of creating such a product that the proposer aims to create, albeit with the bar set pretty high. If the proposal had a bit more detail describing and backing up their ambition, I would be comfortable in assessing the feasibility of the proposal, but at the current state I'm unsure of the level of feasibility, which is why I'm rating it a 3. ", "q1r": 3, "q2": "There is a rough estimate of time required until the products intended release, with milestones and a time horizon. The team intends to share the development progress with stakeholders and community weekly by reports, having their code on GitHub, and updating the status online for the community to follow. These check-ins with the community and stakeholders are really good for the transparency of the project. I would have liked to see what channels they intend to communicate with the community (apart from GitHub), will it be via Telegram, Discord, Twitter, their own website? \r\nThere are some metrics of success provided, but these could be improved by adding something more quantifiable than having 'we finished this product/function', this would make it more easy for the community to follow and assess. As stated earlier in the assessment, the proposer does seem to have some level of understanding of the potential risks and challenges provided within working with the project (for example hiring a lot of external developers). The level of detail provided is still not enough for me to be entirely comfortable with the auditability of the proposal, there are currently more descriptions WHAT the proposer wants to do, than HOW they want to do it. I'm unsure if this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 6, "ne": 6, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "This proposal fails to address the challenge which is to create NON-art use cases business model for NFT in cardano.  The proposer also fails to explain what cardano might benefit from bridging the 2 networks apart from bringing in more art NFT.", "q0r": 1, "q1": "There is no link or information of the team members behind the project. The proposer did not address the challenges and risks that they will face and also what is the plan if additional funding is needed. The proposer mentioned that there are already a bridge in progress for eth,bsc and polygon, share some of the work progress with the community.", "q1r": 2, "q2": "The github link is blank. Provide us with some links for the community to keep track of progress. There is no information on the team members. It will be better to provide verifiable credentials on who is working on the project. The proposer doesnt provide sufficient information about potential risks that may arise when developing such solution and how they plan to avoid or overcome them. ", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "What a novel proposal and definitely falls within the scope of the challenge & a potential boon for Cardano. A well-known Cardano twitter handle recently joked that with all the attention being showered our ETH-Converter that we should also release an NFT-converter to siphon off some of the NFT successes on other blockchains. Well, this is one such project that could lead to a similar outcome. It minimises disruption from the original tokenisation registration and extends rights and post-minting activities in a much cheaper and robust ecosystem. A DApp such as this could also promote Cardano to other users & artists who may well decide to perform the original minting on Cardano rather than the expensive competition. This aligns quite nicely with Cardano's mission.", "q0r": 5, "q1": "The proposal's claims that the project is well underway with the bridge from the other blockchains are nearly complete so there is a sense that the team has a good grasp of the requirements. The background of the proposer and the team adds to the confidence that this project will be implemented successfully. The timelines and developments targeted within looks relatively acceptable including the budget, which seemingly looks to be a significant percentage of the total for this challenge but arguably could be worth it. The business model besides adding utility to Cardano can be leveraged in marketing our blockchain's capabilities. It also would not damage the reputation and expectation of the coming ETH converter and may coerce other projects who haven't considered porting over to Cardano to do so with the existence of this project. If it meets and/or surpasses the identified success metrics, the requested funding looks cheap. Also, the aggressive timelines indicate their plans are well underway and gives the impression that should it not receive any success from Fund6, that somehow the project will still continue. I believe it may add more value to Project Catalyst itself if this gets funded in this round.", "q1r": 5, "q2": "The proposal presents the details and the aggressive timelines that should make this auditable. Mentions of testing efforts and open GitHub repository means anyone in the community can track its progress. In addition the proposer suggested regular reporting to Catalyst and the members so even if one may not be actively tracking its progress, they have the intention of sharing it with the community.\r\nThe overall read of the proposal indicates this is a team who are used to developing fast and reporting immediately and with transparency. That is commendable. It even hints a desired earlier-than-Fund6-timeline release of its production  version, well ahead of time. Should this project receive the support from the voting members, I for one would agree to either speed up the rewards allocation process for this project or its distribution even post release. This project is significant enough to Catalyst, the booming NFT economy and the recent Alonzo release that not acting swiftly could result on lost opportunities that's good for Cardano because this is a show-piece. Good luck!", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\n Yes\r\n\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\n No. This is a DApps and Integrations type proposal. \r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nYes \r\n \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\n No\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\nNone listed  \r\n\r\nCan the proposal scale to address future challenges?\r\nIf done properly it could", "q0r": 2, "q1": "\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\n \r\nAre these links sufficient?\r\n No name, links, FB or Linkedin profile is listed for any of the devs. Considering they are each asking for 18000 USD for a 6 week project I would expect to see their CVs or Record of experience. Same with the Programme Manager who would get 12000 USD\r\n \r\nHave you the CA visited these links and contacted the relevant people?\r\nNone \r\n\r\n\r\nHave you been able to assess their level of competence?\r\nNo \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nHe has listed them. \r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nSomewhat\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nYes \r\n\r\nIS budget reasonable to achieve the set goals?\r\nIts completely unreasonable and far too high. Such a project like this should be done carefully over a much longer time period, not 6 weeks.\r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nNo \r\n\r\nHave you verified this plan?\r\nNo \r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nIts 6 weeks. Not realistic at all \r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nNo the plan of implementation is very summarized.\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\n Not really\r\n\r\n \r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nSomewhat explains the technical aspects \r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo \r\n ", "q1r": 1, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nThere is a roadmap with milestones.\r\n\r\n\r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nNo\r\n \r\n\r\nIs there a clear understandable description of the targeted problem?\r\nThere is a description of the problem but this proposal belongs in the Dapps challenge\r\n \r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nYes\r\n\r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNo \r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNone mentioned\r\n\r\nAre there contingency plans in place for various outcomes?\r\nNo \r\n\r\nI do not recommend this project as the time frame is too short, there are no metrics or KPIs, no links to the team to show experience, and a very high and unrealistic budget. This project should be done over a min of 6 months to a years period.\r\n", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The proposal has identified an excellent problem to be solved namely the high cost of alternative blockchain fees in relation to NFT's. The solution appears valid and will allow for more realistic fees when working with NFT's on the Cardano blockchain. The project certainly has the potential to add value to the Catalyst community although I note that some members are querying the amount of budget requested which begs the question will the community vote for this proposal on that basis? The idea of a staged roll out that would require less immediate funding may be an option to consider for future funds.  ", "q0r": 4, "q1": "It would appear reading the proposal that the author has strong experience in the development sector but has not provided a bio or links to previous or indeed current work. This does make the job of assessing the proposal difficult as no validation of assertions can truly be made. This is a shame as the team may in fact be a blockbuster crew whom could implement the project with aplomb. The plan seems quite straightforward and suggests the team have already made a solid start but again there is no way for the community to check this prior to voting which is a concern. ", "q1r": 3, "q2": "The information provided does make reasonable reading but the lack of links to examples of work via github or website means that we really cannot conclude too much other than the author appears to know what they are talking about. Simply reading the plan makes me suspect the author is quite talented and knows the field well. The metrics/KPI's alluded to seem reasonable but are subject to funding approval so we are left wondering a little bit what could have been? I would highly recommend that the proposer seek out further collaborations within the community. I sense that part of the reason for not sharing more at this stage maybe due to protecting IP which in itself is valid. There are however members of the community whom may be able to negotiate directly with the proposing team so that the project can move forward and add value to the Cardano ecosystem without losing that IP.  ", "q2r": 2, "assessor": "z_assessor_53", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This proposal presents a much needed NFT bridge between disparate blockchains. As we all know certain chains have become nearly unusable and much of that traffic will inevitably come our way. \r\n\r\nBy providing a seamless bridge for artists a path into the Cardano NFT ecosystem we have a unique opportunity to  show the world why NFTs just make more sense on Cardano. This proposal provides a clear path to help accelerate this transition.", "q0r": 5, "q1": "I believe this team is more than qualified based on their professional experience in Solidity web3 and java backgrounds to bring this product to market. However, I would like to see some of the team's resume so voters can be reassured about the team backing this proposal, and can make an informed decision for Fund 6.\r\n\r\nBased on there roadmap which includes 2 weeks of integrated testing it's clear they have a solid grasp of the software development lifecycle. The team includes a tracking and plans to update GitHub weekly which means they are going to hold themselves accountable to the roadmap they have presented. \r\n\r\nBased on these factors I give this proposal a high likelihood of success.", "q1r": 4, "q2": "Although I would like a few more specifics on the KPIs presented such as how many users, NFTs listed etc in the protocol by N number of months after the public launch, that being said, the roadmap looks very promising and we should have enough here to make a determination of just how successful the proposal is. \r\n\r\nI do understand the timeline is very ambitious but would like to see some hard numbers reported back to the community after launch.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "NFT bridge will allow:\n\nLock original NFT from in any blockchain in a bridge contract and mint a copy on Cardano.\n\nExpand market for artists", "experience": "20+ years in Java/Python.\n\n3+ years in Solidity and Web3 developing yield farms and DeFi.\n\n4m. in Cardano ecosystem.\n\n\\+ team of 5 devs."}