{"id": 369636, "author": "", "title": "Intellectual Property Transactions", "url": "https://cardano.ideascale.com/a/dtd/369636-48088", "category": 26115, "amount": 195000, "description": "Increase speed and reduce cost of intellectual property and intangible assets related transactions.\n\nImprove access to IP commercialisation.", "f6_no_assessments": 2, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is a good idea to give an important NFT application. The project is a very ambitious one and can really change our world as into the IPs lies many extremely valuable information for the progress of the humanity. The presentation is clear and provide a solution -or an alternative- to manages the Intellectual Property Transaction using NFTs. Remarkably interesting is the transaction of IPs from well developed nations to less developed, is a key for the present and our future. ", "q0r": 5, "q1": "The Team has a big and relevant experiences in Intellectual Property, and on B2B realities. What makes some doubt is the great challenge of the proposal especially on the law aspects. Some questions can rise: are NFTs on the same level of a registered IP internationally? If there are some conflicts, who is the competent organ to ask for a judge? An NFT can be read and verified from a lawyer? There are many points especially on domestic and international laws to be considered, even in the beginning, but especially in the years to come. For sure the Team has experience on this but in the plan seems that this is not yet described in details.", "q1r": 4, "q2": "The roadmap is clear in the time, but it lacks of some KPI metrics. Particularly important is the phases to avoid law/property conflicts in the future that can lose the faith/authority on the NFTs usage. Also the collaborations planned should be monitored.", "q2r": 4, "assessor": "z_assessor_491", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal does describe a system that requires a need for strict ID enforcement to support the complicated task of associating complex intellectual property rights and their enforcement through the use of NFTs on the Cardano blockchain.   However, I did not see much if any description of how they intend to specifically leverage PRISM DID.  I know the challenge brief says \"preferably with PRISM DID\", but for me personally this is what I would need to see to feel that the proposal \"effectively\" addresses the PRISM DID challenge.  Due to the intriguing nature of the proposal, I would like to see their proposal again in F7 with those details included.", "q0r": 3, "q1": "The proposers LinkedIn pages do indicate that they have the needed skills in the complex field of intellectual law.  However, I do not see any details I can use to assess their ability to deliver this extremely complex software package on either their LinkedIn pages or the PDF was attached.    I would need to see details on the team members that have the requisite blockchain and full stack programming skills to implement this potentially powerful proposal.  Because of this I can not assess their ability to deliver it with any confidence.  Again,  I hope they submit it again in F7 with these details in an updated proposal.", "q1r": 3, "q2": "This proposal is asking for 80% of the PRISM DID challenge fund allotment.  Therefore, it needs greater supporting evidence that the team can deliver the system than smaller proposals.  They do include a timeline with a few numeric goals, but it would be helpful if more metrics were included with specific numeric targets covering: number of IP/NFTs minted and by when, number of supported countries including supported languages (including cost figures on some details on how translations will handled), how they intend to attract users with timeline estimates, etc.  I really hope the proposer comes back in F7 with a more detailed proposal.  They are proposing the kind of system has been described by many people as one of the big promises of NFTs.  But more importantly, they appear to have critical intellectual property law skills and that kind of industry experience is very hard to find.  It would be a shame if they do not come back in F7 and make their intriguing and far-reaching proposal a reality.", "q2r": 2, "assessor": "z_assessor_551", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Encode complex legal aspects of intellectual property rights into a NFT. Start NFT platform for IP transactions. Increase IP user community.", "experience": "Team experience: In-house legal, IP management, Business Development, previous work with blockchain companies, experience with startups."}