{"id": 369621, "author": "", "title": "Decentralized Content Distribution", "url": "https://cardano.ideascale.com/a/dtd/369621-48088", "category": 26115, "amount": 28000, "description": "Premium content distributed on the internet is easy to steal, expensive to sell, and has no recurrent value for the creator.", "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal's problem and solution statement addresses the challenge. I like the idea of disrupting content sharing service by utilizing NFT. It will bring in a lot of new user onboard Cardano. However there is a question regarding no censorship policy. How will you deal with immoral and content that constitutes criminal offence in certain countries such as child pornography? \r\nDoes your platform will be child molesters and criminal friendly? Does fraudsters roam freely posting live Charles videos while asking people to send ADA to their wallet address? What will be the measure of limitation for content upload? If there is boundaries being put place, who will monitor and enforce it? Furthermore will your project be open source? ", "q0r": 3, "q1": "This proposal fails to provide verifiable information on the team members, provide a valid information or profile on the team members. Moreover this proposal did not describe the necessary resources needed to successfully implement the project. The budget breakdown is also not clear. The proposer did mention a  few competitor however they did not mention on other risks and challenges that my arise when developing this project and how to tackle them.", "q1r": 3, "q2": "This proposal has a clear roadmap, however there is no method of reporting for the community to keep track of the progress. Provide a medium for the community to receive updates on the project. Furthermore, the proposer did not lay out a verifiable profile link. Provide the profile of the people that will be held accountable for the project", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Creating content on NFTs and selling set NFTs does have NFTs at the core of the business model and as such does adress the challenge. However, I would like the team to expand on the proposed solution, how would the architecture look to make contend into NFTs, and how will this fit within input-output structure of the eUTXO model. Furthermore,I would like the team to expand howl the subscribtion model architechture would differ from a pay-per-view architechture. If successfull, the proposal can bring value to the ecosystem by atrracting additional users.", "q0r": 3, "q1": "Using NFTs to represent content is a good idea. However, the project requires further elaboration. I would like to see links to LinkedIn, Github or similar to provide additional detail/evidence about the team's work history, education and past experiences. The team can expand on the type and number of team members required to implement the proposal. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 2, "q2": "The team provided a short roadmap and simple budget. I would like to see the team develop and define Key Performance Indicators (KPI's) for the project – example \"Create 10,000 pieces of contend (NFT) by month 6, or sign up 500 users by month x, etc\"– set a measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. At the moment the budget is a 4 line item broken down via percentages, I would like to see the budget broken down into monthly spending and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the labor spending - . As the project stand at the moment, I feel the project will be difficult to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the challenge and you can see other platforms like Audius, Theta and open sea which provide creators with a platform to earn tokens off their work as it is distributed and on sold. It is imperative that Cardano provides a platform for future artists.", "q0r": 5, "q1": "The proposer claims to have a wealth of experience within the Cardano ecosystem which gives me confidence that the proposal will be implemented should these accolades be true.", "q1r": 5, "q2": "The proposed provides a decent amount of research on the current situation and competition.  They provide a decent KPI and breakdown of the allocation of funds. The funds could be broken down with a bit more detail rather than as a percentage however. With a bit more clarity it should be easy to audit and track success of the project.", "q2r": 4, "assessor": "z_assessor_542", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "A content creators dream is to maintain control of their content and still distribute it so they can continue doing what they are doing. \r\n\r\nA NFT based business model makes perfect sense for content creators, with royalties built in and this proposal offers exactly that. \r\n\r\nThe proposer has researched the competitors in the content creation niche, but fails to mention why Cardano would be a superior ecosystem for this platform. I advise the proposer to mention the fact that Cardano has native on-chain NFTs that make it vastly superior for and trivial for content creators to issue NFTs, which of course of Cardano, doesn't even require a smart contract to do making it a clearly superior approach to anything NFT related.\r\n\r\nOther than that, this proposal definitely is needed and surely fits the criteria for this challenge.", "q0r": 5, "q1": "The proposal as presented is reasonable and the idea of issuing creator content as permissioned NFTs ensures that content doesn't end up in the hands of users who do not have permission to view the content.\r\n\r\nThe proposal is comprehensive and has clearly been well thought out, and given the proposers background being a Plutus Pioneer, the proposer seems well positioned in addition to the detailed roadmap to successfully implement the proposal. I also like the royalty modal to ensure that no matter how much value is generated on the secondary market the creator of the content is rewarded.", "q1r": 4, "q2": "The proposal includes a detailed roadmap with KPIs for each milestone in the timeline. The KPIs provided make sense for this proposal and align with the stated goals of of proposal as presented. The KPIs could be a little more specific i.e.\r\n\r\n\"Onboard content creators prior to launch.\" \r\n- A x,xxx number of creators onboarded would be a better KPI.\r\n\r\n\"Start community engagement via social media presence.\"\r\n- Again, x,xxx number of followers or tweet engagement per tweet would be a better KPI to aim for.\r\n\r\nThat being said, the information provided is still detailed enough to give voters a good idea of the success or failure of the proposal.", "q2r": 4, "assessor": "z_assessor_577", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "NFTs are the ideal way to tokenize premium content while distribution via blockchain is censorship-resistant. Creating a new content economy", "experience": "Economics graduate technical writer for Blockchain projects. Plutus Pioneers Cohort One, Alonzo Purple tester, and EMURGO Academy graduate."}