{"id": 369614, "author": "", "title": "ForestConservation + CarbonCredits", "url": "https://cardano.ideascale.com/a/dtd/369614-48088", "category": 26115, "amount": 6900, "description": "Cardano and other businesses and individuals are contributing to the carbon footprint, and need forests to remove CO2 and provide clean air", "f6_no_assessments": 5, "f6_rating": 3.066666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal addresses the challenge however the volume of NFT movement on the blockchain would be very low to begin and one of the goals of this challenge is high volume NFT usage on The Blockchain.\r\nHaving a background in environmental science I agree that this proposal is aiming to address a very important issue globally - deforestation and rising co2 levels.\r\nA project like this, leveraging Cardano, has the potential to scale globally in time.", "q0r": 3, "q1": "While this is an excellent concept and I want it to exist in the world, the proposers have not given a clear outline of how they plan to proceed.\r\nThe proposer/s have not outlined their team or any relevant industry contacts.\r\nThe https://carbonlandtrust.com website makes no mention of Cardano and has an environmentally questionable requirement regarding clearing of dead trees and wood from forests - that is part of the ecosystem.\r\nThe funds requested seem too modest to achieve traction.", "q1r": 2, "q2": "The idea behind this proposal is excellent but the team needs assistance to outline their business plan, KPIs, milestones and define what success would look like.\r\n\r\nLooking at the proposal I'm unable to see any auditable roadmap, kPIs or targets. \r\nit would be desirable if the deliverables part of this proposal were discussed in more detail.\r\nAt this time I do not have faith that this project (without further development) would be good use of Catalyst funds as much as I love forests and protecting them. ", "q2r": 1, "assessor": "z_assessor_330", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal highlighted a problem which involves the contribution of blockchains to GHG (green house gases) and proposed a unique solution of issuing CO2 emission credits to land users that practice climate change practice as a land owner or other incentives to grow forests.\r\nThis is a great idea and it is sad it was voted in fund 3  (https://cardano.ideascale.com/a/dtd/Carbonland-Trust/333094-48088) and never got funded due to the shortage of funds for the funding round. .\r\n\r\nI agree.", "q0r": 4, "q1": "The proposal provided verifiable link to given experience and proposed an implementation that can be successfully executed.\r\n\r\nI agree.", "q1r": 4, "q2": "The proposal did not provide sufficient information to audit its progress and success as no milestones, timelines and cost breakdown provided .\r\n\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This proposal gives a sound business model for NFT's, it is essentially creating a framework in which carbon credits can be traded and lock up carbon in Forests. It provides an effective incentives for land owners to plant trees and means that this can happen in a decentralised manor than rather a countries local authority. ", "q0r": 5, "q1": "The proposal has one of the most comprehensive plans I have seen to date. It looks to build upon previous work done in fund 3. Creating the templates outlined would have a positive impact on the community and the planet. However would be nice if it was clearer how they plan to onboard users.", "q1r": 4, "q2": "It would be good to be able to clearly see whether or not land owners individually are doing what they may claim. For example if they promise to plant a number of trees and is awarded some credits, how does the purchaser of those credits know the land owner is following through on that promise. However it feels like this is reliant on an element of trust in the community and if successful people will trust that only quality and legitimate land owner providers will participate. Additionally since the proposal is looking to set out a standard for Carbon Credits based on Cardano and then the standard will be adopted more widely and the tokens will be seen as having value. ", "q2r": 4, "assessor": "z_assessor_332", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal's problem statement and solution are aligned with the challenge. I believe this proposal will create a way for organization like national forest conservation agency to make new revenue stream while protecting reserved forest thus making new utility for Cardano NFT. However you did not provide information on who will be the forest owner? Will it be private or government land? If it involves government land, how will you execute it? how to scale the use case of this project. For example, can it be used for coral reef conservation? Elaborate on how you can attract more user in the future for this project. ", "q0r": 3, "q1": "Please elaborate on how the funding is used, how much is going to manpower and resources etc.  This proposal also did not describe the challenges and risk relevant to successful implementation. ", "q1r": 3, "q2": "Please provide a roadmap with definition of success after 3, 6 and 12 months. Provide detail broken down budget requirements. And also please state expected public launch date.", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Using NFTs to represent carbon credits from tokinized forests addresses the challenge brief of creating business models with NFT's at the core. Minting and selling carbon credit NFTs will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to refine the problem statement and solution, at the moment the two read disconnected from each other, Problem= Forest need protection, Solution = Digitizing forest land as NFTs to raise income for protection by selling NFTs as Carbon credits.) I would like the team to think how they will scale and market the platform to increase network participation.", "q0r": 4, "q1": "The team provided a link to a Github repository. I feel the proposal requires further development to ensure successful implementation. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to further expand on the plan to go to market(how they will educate land owners, which partnerships are we targeting, etc)", "q1r": 3, "q2": "The proposal has a high level roadmap and budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project, and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Digital assets that protect forests by putting land into perpetual conservation easements to lockup carbon and sequester CO2 long term", "experience": "Forest owner that has been researching permaculture and regenerative agriculture for over 20 years, and involved in carbon markets a year"}