{"id": 369745, "author": "", "title": "CyphrLive Ticketing", "url": "https://cardano.ideascale.com/a/dtd/369745-48088", "category": 26115, "amount": 9000, "description": "Ticketing for live in-person and streamed events is highly centralized and overly expensive.", "f6_no_assessments": 2, "f6_rating": 2.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal's problem statement is about expensive event tickets, however the problem solution is unclear. Make a simple and easy to understand problem solution statement such as 'Driving down event cost by tokenizing event tickets'. Furthermare,elaborate on how will this project drive down the price. How much % price that you will be able to reduce from the traditional way of issuing tickets? Or what is the benefit to the artists and the public? You mentioned that the artist have to wait for 7 days to receive their payment, how long will it take for the artist to receive their payment when using your system? Besides that, will this smart contract platform of yours will be open source and accessible to anyone or it will be exclusive only to your team? Also, does the platform can scale in the future? Can it handle millions of transactions without lagging or breaking? List down in details what are the added values from your project.", "q0r": 2, "q1": "In my opinion, this proposal is not feasible because the proposer fails to present the details of the team member who will be working on the project. Provide a verifiable information such as linkedin profile link so the community will know the people who are working in this project has the required skills and experience to successfully implement the project. This proposal also didn't provide any risk and challenges that the team will face throughout the development, if there is an issue and needs to extend the timeline to complete the project or require additional funding, what will be the plan? In addition, the roadmap presented are quite vague, you are asking for a 6 months budget. How and what is being done during that 6 months. If you are already working on the proposal, list down the website or github repo link and share it with the community. Besides that, how can the community keep track of the progress? In what platform will you share updates on progress?", "q1r": 2, "q2": "Im giving this rating because of the roadmap is unclear. Furthermore there is no method provided for reporting on progress. This proposal also fails to provide clear problem solution. Therefor I have to have to disagree with this proposal.", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Using NFTs to represent tickets for events addresses the challenge brief of creating business models with NFT's at the core. Minting and selling event entry tickets NFTs will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to refine the problem statement and solution, at the moment only the problem statement is made but a description to the solution for the problem is not made. ", "q0r": 3, "q1": "The team provided a link to a website with exchange interface. I feel the proposal requires further development to ensure successful implementation. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to further expand on the plan to go to market(sign up event venues, how will they market their platform, etc)", "q1r": 3, "q2": "The proposal has a minimal roadmap and budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project (create 5000 NFTs tickets by month 2, sign up 30 events  by month x), and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "xxxxxxxx", "experience": "I am a team member of Tokhun.io, another cNFT platform, that recently deployed to mainnet."}