{"id": 369753, "author": "", "title": "NFT Education & Test Token ", "url": "https://cardano.ideascale.com/a/dtd/369753-48088", "category": 26115, "amount": 10000, "description": "On-boarding NFT based businesses should be a seamless experience and the current environment has roadblocks to this adoption", "f6_no_assessments": 2, "f6_rating": 2.0, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem statement and solution is confusing. The proposer problem statement was NFT business model has a user experience problem, and the solution statement was to create an educational token? And on the plan you were talking about creating a wallet? Please identify your problems and solutions and present it in a simple to understand sentence. The goals of this proposal is confusing therefore it does not address the challenge. Creating a wallet with the features mentioned in the proposal is good. It does add utility however it doesn't bring much impact in terms of the challenge hence I have to disagree with this proposal. ", "q0r": 2, "q1": "The proposer did not provide any verifiable credentials of the team members who will be working on the project. Anonymous teams poses a risk to the implementation of the project. The proposer also fails to present in details about the plan breakdown such as what is the required manpower or resources to successfully implement the project. There is no detail explanation on how and what is being done on the project. Moreover, there is no detail budget breakdown on how the money will be used. In addition, this proposal fails to identify the potential risks and challenges that the team members might face when developing the project. With all the arguments above, I have to disagree that this project can be implemented successfully  ", "q1r": 2, "q2": "The proposal did not provide a roadmap on progress of the project. Please provide in details of what to expect in the 3,6,12 months timeframe. There is no method of reporting provided by the proposer. Please provide a method for the community to keep track of your progress such as github repo etc. ", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I believe this proposal should be under the \"DApp and Integration\" challenge. For me it seems that the proposal is for a wallet that will display NFTs, not actually incorporate NFT at the 'core' of the business. The problem statement and solution must be further refined, at the moment the solution describes \"education token\" however later the proposal talks about a wallet – to avoid confusion the proposal must be clarified to understand the business model and usecase. ", "q0r": 2, "q1": "The display wallet idea is good and addresses a shortcoming in the ecosystem. However, the project requires further development. I would want to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". Furthermore, the project must develop the budget and breakdown the budget into identifiable items. Lastly, the project will require additional funding, the team must clarify how the project will fund itself in future.", "q1r": 2, "q2": "The proposal provides a suggestion for a future roadmap and a single line budget. I would like to see the team develop and define Key Performance Indicators (KPI's) for the project – what does success look like in 12 months, how many wallet users do you want on the platform by month 6 – set a goal and use it as a KPI.  Furthermore, I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, for example set milestones for creating the wallet (technical development milestones). Lastly, the budget needs to be developed beyond a single line entry, the team must create a detailed breakdown. As the project stands at the moment, I feel the project will be difficult to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Education token to increase engagement with current/future content creators to test their platform without risking their own funds/assets", "experience": "10 yrs in tech B2B software sales gave me the networking capabilities to own of this project while leveraging the extended NFT community"}