{"id": 369866, "author": "", "title": "Cardano Onboarding Funnel via NFTs", "url": "https://cardano.ideascale.com/a/dtd/369866-48088", "category": 26115, "amount": 40000, "description": "Cardano needs to identify and implement viable and replicable business models to attract and onboard new users into the Cardano ecosystem.", "f6_no_assessments": 4, "f6_rating": 3.25, "videos": [], "media": [], "f6_assessments": [{"q0": "Getting a physical product and finding out you can claim the digital versions of it as well and then learn about blockchain and Cardano in the process can be an interesting experiment. The cards and game looks fun. Especially the stats on the Fungible tokens. I think approaching NFTs first from the physical world then move onto the digital world is a good way to introduce new people to the technology. It could become a model to introduce people to this technology and educate them in the process.", "q0r": 5, "q1": "Both members are active community members with the relevant experience to build something like this. Already created sufficient content to show commitment to this project. The budget allocation and plan seems sensible. ", "q1r": 5, "q2": "This proposal has a clear Roadmap with milestones.\r\nDefining success together with key performance indicators. The potential risks for a project like this is quite low. The only one I can think of is if someone buys the physical copy from someone and finds out the NFTs has already been claimed. But it should be the buyers responsibility to trust the seller or not and do their own research. That's the world we live in.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal problem statement and solution is to onboard new users to cardano by creating a card game. There are other card game projects already in development in the NFT space, describe what makes your game any different from other card games. What makes you think that this card game will succeed and attracts millions of users in the space? What are the data and reference that shows this game model is in high demand and will likely to succeed? Furthermore, what other value does this card brings to attract players other than speculation? In addition, the proposer did not lay out detailed plan on what is being done and how can they scale the users to 1 Million.", "q0r": 2, "q1": "The proposal's budget breakdown is not explain in detail. Please provide detail breakdown on how much is used for manpower hourly/weekly/monthly basis. Furthermore, the proposer did not provide any future challenge or risks that they might face during the development. Moreover, the proposer did not lay out verifiable credentials of the team members who will be working on the project. Give out links to linkedin profile for example to give the community the information about the experience and skills of the team member. Team members with known experience and skills are highly likely to complete the project. Besides that, the proposer did not mention any future challenges and risks that might involve during the development phase of the game.  ", "q1r": 2, "q2": "This proposal did gave a problem and solution, however they did not provide a method for the community to keep track of the project progress. Provide a way for the community to view the progress publicly and make it more transparent for auditability. Also with the team unable to provide verifiable credentials, its hard to make anybody accountable for this project.", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The project founders already operate jetchicken.io that functions on a NFT business model, the proposal is to print phiscal playcards to attract new users from outside the Cardano ecosystem and converting them into users of the relevant NFT project - the project adresses the challenge of having a NFT business model at its core and also attraction new users to the Cardano ecosystem. ", "q0r": 4, "q1": "The team has a working website that uses NFTs, however, I feel the proposal requires further development to ensure successful implementation. The team can expand on the type and number of team members required to implement the proposal, what are the responsibilities and deliverables of each member. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". Lastly, I would like the team to expand on the plan for scaling and future funding. ", "q1r": 3, "q2": "I would like to see the team develop Key Performance Indicators (KPI's) for the project, and connect the KPIs to the milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single-line entrie and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "While this is a nice usecase for NFTs, the benefit of this proposal mainly seems to be towards the creators of the card game. The benefits to the community outside the exploration of a new usecase and the creation of a business seems unclear", "q0r": 3, "q1": "While the proposers are apparently experienced in development, a detailed action plan is missing and the milestones are a bit too optimistic", "q1r": 3, "q2": "Some auditable milestones and success critereria exist, however are not very detailed.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Leverage an appealing Cardano NFT card game, sell physical card packs, and leverage the process to market and onboard new users to Cardano", "experience": "Kyle and Adam are seasoned Cardano OGs and SPOs, devs, community contributors, creators of spacecoins and jetchickens. Adam drops many NFTs."}