{"id": 369938, "author": "", "title": "Toddler HODLer Generative NFTs", "url": "https://cardano.ideascale.com/a/dtd/369938-48088", "category": 26115, "amount": 40000, "description": "Though technically superior for metaverses and P2E games, Cardano also needs large audiences and thriving communities for market success.", "f6_no_assessments": 6, "f6_rating": 1.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "The name is catchy. However, I believe these types of communities should come spontaneously into existence. Creating an avatar series is heavily dependant on market popularity. ", "q0r": 3, "q1": "The proposer has relevant experience in creating such an avatar series. There are lots of projects like this being created all over the cryptosphere. It might have the desired effect, it might not. The real question is wether this community should invest 40k USD to create an avatar series. ", "q1r": 2, "q2": "Proof of experience has been provided by linking to a previous project. There is not much information given that is verifiable. \r\nNo roadmap of how this would be marketed to bring in thousands of users. Nothing that justifies the requested 40k USD in a budget breakdown or explains what would happen if the popularity of these avatars is not what was prospected. ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "This presentation looks more like a concept than a proposal. The proposer should identify a problem and address a viable solution to it. The proposer should provide enough info about how success looks like and key metrics to measure it. What is the goal of this proposal?\r\n", "q0r": 1, "q1": "No team info and no team members with their experience/skills are presented (who is going to develop the app? how it adds value to the Cardano ecosystem?)\r\nThe budget is not broken down into identifiable items. (costs emphasized for each resources necessary for implementing the proposal)\r\nNo timetable with clear milestones is provided and no time horizon is defined (i.e. 6 months, 1 year etc. to achieve the goals)\r\nThere is no plan for implementing the proposal. Which resources are necessary for a working plan?\r\nNo technical aspects are presented (architecture, programming languages, technologies etc.)\r\nNo challenges and risks are presented. (how is the DAO system working in a regulated society?)", "q1r": 1, "q2": "Unfortunately, no necessary and relevant info is provided to asses the proposal.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal objectives are not aligned with the challenge that is to produce non-art use case business model for NFT. This project will only bring in new pile of art NFT's and speculations without adding any value or giving much impact to the community therefor I strongly disagree with this proposal ", "q0r": 1, "q1": "The proposer did not provide any verifiable credentials on the team members that will be working on the project. Moreover, there is no detail breakdown on what is the required manpower/hours and resources needed to implement the project. Furthermore, the budget asked by the proposer is unreasonable. Also there is no clear roadmap for the project. Provide detail breakdown on how and what is being done in 3,6,12 months timeframe. In addition, the proposer did not give out clear detail budget breakdown on how that 40k usd will be used. There is also no details on what are the challenges and risks that the team members might face during the development and how to overcome. Therefor I strongly disagree with this proposal ", "q1r": 1, "q2": "This proposal roadmap is unclear. Also there is no method of reporting work progress to the community. The team members are also anonymous therefor it will be hard to make anyone accountable for the project. With the arguments above, I have to strongly disagree in terms of accountability .", "q2r": 1, "assessor": "z_assessor_357", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Using NFTs in a game addresses the challenge brief of creating business models with NFT's at the core. Minting and using NFTs in a game will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to simplify the problem statement and solution, at the moment it is unclear (Problem = Cardano needs more users Solution = NFT game to attract users to ecosystem)", "q0r": 3, "q1": "The team provided a link to a website, but I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member, this allows the team to judge whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to provide a deeper explanation about the architecture and language for the implementation of the back end of the game.", "q1r": 3, "q2": "The proposal has a minimal budget and no roadmap. I would like to see the team develop Key Performance Indicators (KPI's) for the project (create 500 avatar NFTs by month 2, sign up 3000 users by month x), and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal has no real purpose other than creating an NFT project. There is no incentive about why this model just exists. And an NFT project of this sort is highly speculative and depends on popularity in the market. This could be the next Bored Ape Yacht Club but it could easily not be as well. \r\n", "q0r": 1, "q1": "Given the references provided, I have confidence that the proposer can create an avatar series. But the sheer amount of projects that sprang up like mushrooms in a field the last few months gives no feasibility to this project. The budget asked for this does not have a breakdown, which makes it hard to believe this needs 40k to successfully makes this. Since most of these avatar projects have a basic model with small adjustments made to it.\r\n", "q1r": 1, "q2": "With as little information that is given I ask myself how will this be marketed to provide the necessary stimulus to be implemented successfully. As explained above there is nothing that justifies the budget amount that is requested. Being that this is in a market that is highly speculative this proposal should've had a risk assessment. The success is also not defined. What makes this a success, what are the ultimate goals of making this avatar series?", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This challenge asks how we can use cardano for non-art based NFTs. This proposal aims to create generative 3d avatars for use in the metaverse. There's a very powerful argument to be made that 3d generative avatars fall under the category of art and therefore do not satisfy the stated goal of this challenge. However, I believe there's a weak argument to be made that 3d avatars are *not* art and therefore do belong. \r\n\r\nThe problem statement doesn't actually state a problem. The solution statement clearly articulates that 3d generative avatars will be used to recruit more users into cardano. \r\n\r\nThe proposal lacks clear metrics and goals. It's not clear how this proposer will drive usage or how many people might adopt this project.\r\n\r\nI strongly disagree that this proposal effectively addresses the challenge. ", "q0r": 1, "q1": "There is no execution plan. The proposer provides a link to a tiktok profile but it's unclear if the proposer actually owns that profile. There are no milestones or deliverables. The budget is not broken down and it's not clear why 40k is needed for this. It's not clear if the proposer has graphic design experience. I strongly disagree that this proposal will likely be implemented successfully.", "q1r": 1, "q2": "There is no execution plan which means there's nothing to audit. The proposal provides no metrics nor milestones and doesn't provide a timeline for any work to be completed. Because of this, there's nothing to audit. I strongly disagree that this proposal provides sufficient information to audit progress and success.", "q2r": 1, "assessor": "z_assessor_531", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "The Toddler HODLer generative NFT 3D avatar project, native to Cardano, recruits thousands of users into Cardano worlds such as Cornucopias.", "experience": "Jeffrey the creepy baby with 710,000 TikTok followers.\n\nPreviously awarded Epic MegaGrant for avatar girl music group AVTR."}