{"id": 369962, "author": "", "title": "Mushroom Breeding Program", "url": "https://cardano.ideascale.com/a/dtd/369962-48088", "category": 26115, "amount": 6000, "description": "Breeding of new strains mainly happens inside large companies with access to a limited gene pool compared to what is available to foragers.", "f6_no_assessments": 5, "f6_rating": 3.6, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=12962"], "media": [], "f6_assessments": [{"q0": "From this proposal there is no doubt that the mushroom (and other foraging) communities would benefit from using Cardano to democratise genetic variety and breeding in mushrooms. In terms of scaling this to \"millions of users\" per the challenge brief, I'm unsure how big (either in terms of market cap for the mushroom growing industry or in terms of people for the foraging community) the market is but my sense is relatively small. That said there is potential for this model to be scaled out to other industries that need genetic variety and are sparsely distributed(ex. dog breeding).", "q0r": 4, "q1": "The proposer has the right experience( and importantly passion) to provide the domain expertise, to develop the right relationships and motivation to drive this forward. The plan and budget are high level but are achievable, however the budget for developer mockups (3000USD) seems low given the amount of work likely required. More details around the desired POC and more precise costings would make it easier to assess the likelihood of success.", "q1r": 3, "q2": "While the idea is fantastic and has wide ranging application outside of mushroom breeding, there is limited information here with which to audit progress. Some examples of specifics that would make this more auditable are:\r\nExpected content for the white paper + any expert interviews required\r\nList of top farms/foraging communities that can be engaged in the foraging community\r\nMore details around the mock-ups (mobile or web or both UX to be designed, how sophisticated will smart contract be?...)", "q2r": 2, "assessor": "z_assessor_275", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "It's a really cool use case. Due to popular documentaries (fantasticfungi.com) mushrooms are starting to regain interest among the public. It would be quite easy to find networks and partnerships around this, if the proposal was more clear.", "q0r": 4, "q1": "Honestly, this proposal has a bit of a \"mad scientist\" vibe to it. No offense. :) I'm a mushroom forager myself so I'm a bit biased. I know it's not a very good starting point: I like the proposal because I like mushrooms.\r\n\r\nIf Tyler doesn't find team members, I'm not entirely convinced that anything comes out of this. What Tyler is proposing though, is in his own words nothing but a draft or a proof-of-concept. Once this team gets a developer and a strategist / business professional involved anything is possible.\r\n\r\nIf you can't get funding in Fund6, do persist, find the team and take the proposal to the next level. Heck, you could even try to get support and ideas from Charles Hoskinson himself. He's a mushroom man. :)", "q1r": 3, "q2": "As it stands, the proposal is not ready for implementation. Once the team and concept are ready and their perspective is included, asking for even a bit more funding shouldn't be an issue.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement and solution does not address the function of NFTs at the heart of the business model, I would like the team to rework the problem statement and solution to clearly demonstrate the core role of NFTs in the business model. I would like the team to think how they will scale the use of NFTs to thousands of users and I want the team to consisder how they will raise future funding for the project.  ", "q0r": 3, "q1": "The team provided a link to a website, but I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member, this allows the team to judge whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to expand on the plan to go to market and acquire growers for the platform.", "q1r": 3, "q2": "The proposal has a minimal budget and roadmap. I would like to see the team develop Key Performance Indicators (KPI's) for the project (collect 1000 genes by month 2, sign up 300 growers by month x), and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 9, "ne": 3, "ng": 2, "nfo": 4, "vca_o": 1, "reply": "1) The Problem Statement itself should not need to mention NFTs as NFTs can solve real world problems that don't have at the core of the problem any relationship to this new technology.  2) The Solution statement does reference NFTs so the assessment is a miscategorization.  Further, the detailed plan itself outlines how NFTs are used, and it is in my opinion a \"new\" use case for NFTs relative to a majority of the activity in the NFT space and proposals at this time.  I honestly feel that this Assessor may not have read the proposal beyond a quick skim. "}, {"q0": "This is a really cool idea for NFTs. It's the first time I was intrigued by a proposal. This is a perfect example of the challenge it sits in. It is an excellent proposal that incentivizes people to engage in the Cardano ecosystem. The proposer describes thoroughly how this will be done. There even is a clear plan for the future scaling of the proposal. There is not a thing I feel is missing from the proposal. Really well written.\r\n", "q0r": 5, "q1": "The relevant experience given by the proposer is on the low side but reading through the proposal it is clear the proposer has the skills necessary for this. The proposal is well documented and researched. The proposer clearly states who he needs to complete his team and what skills he is still lacking.  Budget en timeline is present, although it would've been helpful having a more in-depth breakdown of the budget. As of now we only have the amount needed for the different fields but not why exactly this is needed. An hourly rate or the number of developers would make this budget more feasible. Since the budget only involves R&D for the proposal this is a reasonable amount to ask. In the comment section, we already get a glimpse of the help being provided on the legal side of this proposal. The proposer even responded to it with well-thought questions which show how much the proposer already researched for this.\r\n", "q1r": 5, "q2": "Given the size of this proposal, I don't see any problem if this gets funded for follow-up checks. The timeline is punctual and clear. The proposer gives a clear understanding of what the proposal means and how he plans on handling it. Since this proposal is only for the research part of the project and later funding is requested in a later stage through Catalyst or another platform KPIs are not really an issue here. Although the proposer could've stated some metrics on how much research he would need to call this proposal a success. I wish you the best of luck with this proposal you have a clear go from me. ", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposal has identified a very unique problem and has proposed a solution that may require a massive amount of R&D to ever be resolved. It therefore qualifies for this fund as an excellent candidate to test the legal frameworks that currently exist. This proposal strikes me as adding value to the community in a substantial way due to its targeting of theoretical discussion that it is very likely to promote. ", "q0r": 5, "q1": "The proposer has excellent experience in the mushroom breeding sector and has enormous energy for the project. I would have liked to see a more thorough bio presented to see what else the proposer brings to the table although an agile mind certainly appears present. I do have a slight concern about the proposal being successfully implemented in its current form as there appear to be so many potential risk factors at play. Having said that I do feel that the overall worth of this project is outstanding and may contribute far more in a legal theory of NFT's sense that would benefit the Cardano and wider community.  ", "q1r": 4, "q2": "The enthusiasm of the proposer is evident and generally sufficient to warrant a high assessment, however this proposal would benefit greatly by revision of the scope and scale. The proposer does identify this by detailing that the goal is provide a proof of concept but I am concerned that this may not be evident to voters.  The budget is loose and would benefit greatly if it were tied explicitly to the goal as suggested. Once these aspects are addressed I feel this is an outstanding project. I commend the team and wish them success.  ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "R+D for new mushroom species/strains can be horizontally scaled for greater genetic diversity and cultivation parameters with NFT-based DeFi", "experience": "Founded/Run mushroom farm (Mycopolitan) since 2014.  \n\nNetworked w farms/foragers\n\nGrew 1 fist-size Chicken of the Woods (pictured here)"}