{"id": 369971, "author": "", "title": "Conservation of Life on Earth", "url": "https://cardano.ideascale.com/a/dtd/369971-48088", "category": 26115, "amount": 76000, "description": "Life on earth is under constant threat. **How can we encourage conservation our planet's flora & fauna while ensuring scientific authenticity?**", "f6_no_assessments": 6, "f6_rating": 3.0555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "I'm not sold on the empathy link between the wild and the virtual animal. This could be a fun game and a cool collection of 3 D art objects but I do not see that conservation has much to do with it. Thumbs up for Digital Life project on Cardano though as it operates with cool stock. ", "q0r": 4, "q1": "It does seem that Jer has been in the business for quite some time and I have all confidence that he can tag a lot of beautiful animals with an NFT tag so that animation games and films pay for the protection of these. But again it seems disconnected from the cages in which these animals are filmed.", "q1r": 4, "q2": "Oh yea you can easily see how there is already great stock that could be tag with an NFT and I would like to see this project seriously engage a fundraising front for the protection of some of these species and also represent some more ludicrous animal stories abused by the meat industry..  And what happens when there are hundreds and thousands of zoo animals immortalized like this? I feel we are losing forest for the trees in this proposal. Great artist though..", "q2r": 3, "assessor": "z_assessor_15", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "I think what the proposer and his team are doing outside of the blockchain is incredible! However the proposal budget is large and doesn't really outline what value it is going to bring to Cardano. At this early stage in our evolution I think it is wise to focus on proposals that are building utility and driving mass adoption. This problem statement is not terribly specific. The proposal reads more like a list of hopes and dreams and lacks direction and clarity. I hope that the proposer is not discouraged by this assessment and finds some collaboration within the community to refine his proposal.", "q0r": 3, "q1": "The proposer has stated in the comments that his proposal was done last minute and it really feels that way reading through it. It does not inspire confidence in me that allocating funds to this project is a good idea this round. There is no roadmap, only ideas. The budget requested is too much for such an undeveloped concept. My experience working in academic Institutions (CSIRO & University of Canberra) gives me perspective on this proposal.", "q1r": 1, "q2": "This proposal gives the community no clear way to audit. I would advise the proposer to see if he can workshop the idea and break it down into actionable portions and then try again in future funding rounds.", "q2r": 1, "assessor": "z_assessor_330", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal highlighted a real world problem and for sure a killer Solution with much details.\r\nGreat work by the team.\r\nI Strongly Agree", "q0r": 5, "q1": "The proposal provided verifiable link to given experience but lacks a clear implementation plan.,milestones and cost breakdown.\r\nThis is a killer solution and unique which will benefit from clarity on how the requested funds will be utilised along Man-hours.\r\nThe proposal will also benefit from breaking the funding into smaller chunks across future funding rounds to better improve the chances of this proposal getting funded considering the fund request of $70000 from a $20000 funding pot.\r\n\r\nconsidering the above, i can neither agree nor disagree.\r\n", "q1r": 3, "q2": "The proposal did not provide sufficient information to help audit the progress and success of the proposals solution.This is heartbreaking considering the importance of this solution to the world at large.\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The project has NFTs at its core for data storage and thus fits the challenge brief. I would like to see the problem statement further developed, at the moment the statement is a question, following on, similarly, the solution needs clarification to describe the technology behind the project. I would like the team to look at a wallet design, the way the project is describeb the team would have to develop a new wallet to access the data stored on the NFTs. The team mentions anothor blockchain, arweave, will the team use both cardano and arweave by building a bridge. ", "q0r": 3, "q1": "The use of NFTs to store data is a good idea. However, the project requires further development. I would want to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. The team can expand on the type and number of team members required to implement the proposal. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". Furthermore, the project must develop the budget and breakdown the budget into identifiable items. Lastly, the project will require additional funding, the team must clarify how the project will fund itself in future.", "q1r": 2, "q2": "The proposal lacks a roadmap and provided a single line budget. I would like to see the team develop and define Key Performance Indicators (KPI's) for the project – what does success look like in 12 months, how much data do you want to capture by month 6 – set a goal and use it as a KPI.  Furthermore, I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. Lastly, the budget needs to be developed beyond a single line entry, the team must create a detailed breakdown. As the project stands at the moment, I feel the project will be difficult to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I think this is a fantastic use of Cardano NFTs and this proposal presents a very interesting idea of digitizing our beautiful world using NFTs to create a decentralized, uncensorable library of earth directly on-chain. \r\n\r\nThis means that the Cardano blockchain effectively has all the knowledge of life on earth and becomes a living repository of knowledge - directly on chain. \r\n\r\nThis is an extraordinarily exciting and completely novel idea and further pushes the boundaries of what is possible on Cardano using NFTs to tokenize scientific knowledge forever and all time. ", "q0r": 5, "q1": "This proposal clearly defines a potential business model that pops into existence, making this proposal a self-sustaining one after Fund 6, which is very important. \r\n\r\nIn addition, the team is very well researched and experienced as evidenced by the resources and videos provided in the proposal give me every reason to believe this team will deliver a library of life which itself will live on the Cardano blockchain - creating a sort of symbiotic relationship between the success of the library of life and Cardano itself, which then becomes a tool used by scientific researchers around the world and helps to ensure the longterm success of Cardano in turn.", "q1r": 5, "q2": "I am having a little troubling determining what exactly the roadmap is here, and what specific KPIs for milestones on the roadmap are.\r\n\r\nThe only one issue I have that I see truly lacking with this proposal is the lack of a well defined roadmap with specific KPIs alongside it. This makes it difficult for votes and project catalyst to properly assess the probability of a successful proposal.\r\n\r\nThat being said, I don't think the lack of a detiled roadmap means that the proposal will itself be any less successful, just that it is more difficult to measure  just how successful it indeed is.\r\n", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "This proposal delivers in terms of addressing the \"high quality ideas\" portion of the NFT Business Model challenge. But in terms of providing a use case in a quantifiable manner it provides little detail.", "q0r": 3, "q1": "The proposer has invested a great deal of time and effort into the 3D modelling of the Digital Life project and is likely to deliver on this content. But there is clear timeline, development plan or team documented here that could implement the technical NFT case.", "q1r": 3, "q2": "There is sufficient information to audit the 3D modelling aspect of this proposal. But there are no development details, Key Performance Indicators and Risk Assessment to audit the technical implementation of a NFT Business model.", "q2r": 3, "assessor": "z_assessor_597", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create online **library of life on earth** by combining open-source graphics tools, NFTs, data storage, voting, payment & reputation systems.", "experience": "20 years building animation pipelines for science, tech & entertainment. Currently **working with biologists to digitise life on earth**."}