{"id": 369947, "author": "", "title": "NFT for Authenticating Luxury Goods", "url": "https://cardano.ideascale.com/a/dtd/369947-48088", "category": 26115, "amount": 50000, "description": "The adoption of NFTs across the Luxury Goods Industry is essential for scalability of Cardano in RealFi.", "f6_no_assessments": 3, "f6_rating": 1.6666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Using NFTs to authenticate luxury goods addresses the challenge brief of creating business models with NFT's at the core. Minting and using NFTs as authentication will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to redefine the problem statement and solution, as written at the moment the problem statement makes a claim and does not present a problem.", "q0r": 3, "q1": "Using NFTs to authenticate luxury goods is a good idea. However the proposal requires further development to ensure successful implementation: The team can expand on the type and number of team members required to implement the proposal, what are the responsibilities and deliverables of each member. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to expand on the go to market strategy to recruit brands to the platform.", "q1r": 2, "q2": "The proposal has no roadmap and single line budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "It seems to me like this whole entire post is just describing the problem at hand and the state of product traceability within the luxury/fashion industry, as well as some examples of current blockchain implementations.\r\n\r\nBut what the post is lacking is any notion or ideas of what you would do differently, and what you could bring to the industry to do this better. The \"proposal\" doesn't address the challenge because nothing concrete is being proposed.\r\n\r\nNot to be rude, but all I see is buzzwords and name dropping without substance.", "q0r": 1, "q1": "No self introduction, we know nothing about you, your work experience etc. Are you a developper ? Do you have any ties to the fashion industry that would help you get started ? No specific idea, goals, timeline, team, etc.", "q1r": 1, "q2": "Again, with no specifics and no timeline, there is literally no metric to measure the success of this \"proposal\" by.", "q2r": 1, "assessor": "z_assessor_369", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Interesting idea that certainly has merit and is applicable to the challenge. There does seem to be some aspects missing from the proposal that hold it back somewhat. It is not entirely clear what are the goals of this proposal beyond extending partnerships with luxury goods manufacturers? As such the proposal needs to clearly define exactly how it will proceed and why that is important to Catalyst community. Presently, the proposal reads more like a research orientated project which is fine but needs further clarification on quite a few points.  ", "q0r": 4, "q1": "The proposer has a good idea but does not tell me too much about themselves and what relevant experience they can bring to the Catalyst community. I sense that they have knowledge around luxury goods and issues that counterfeits raise but cannot check any bio to establish veracity. This makes it tricky when trying to decide if the proposal would be implemented. I was also unable to establish what HNWI stands for which may have unlocked very useful information. ", "q1r": 1, "q2": "Currently the proposal stands as a good idea without any real supporting documentation. The lack of a detailed budget to explain the use of the significant funds requested makes it hard to recommend this proposal. There are no metrics/KPI's  attached and this needs to be present for the community to know what it is getting for those funds. I would highly recommend the proposer seek out further collaborations from the catalyst community to breakdown the intended outcomes and show the value that the community may achieve by voting for this proposal. ", "q2r": 1, "assessor": "z_assessor_53", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Much of the NFT frenzy revolves around digital assets, and competing companies addressing physical luxury goods lack client data anonymity.", "experience": "Working with HNWI, there's an apparent need for authentication of physical assets (ex:Hermes Birkin) for re-sell & family heirloom purposes."}