{"id": 370251, "author": "", "title": "Sustainable Footwear & Prosumers", "url": "https://cardano.ideascale.com/a/dtd/370251-48088", "category": 26115, "amount": 63600, "description": "Generation gatekeepers should enable consumers' contribution in the creative process to achieve a holistic footwear business.", "f6_no_assessments": 6, "f6_rating": 2.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "This project states the challenge is that generation gatekeepers should enable consumers contribution in the creative process to achieve a holistic footwear business using NFTs. THis project aims at bringing a larger NFT presence to the blockchain which is a goal of the cardano network. ", "q0r": 4, "q1": "This project brings 20 plus years of footwear experience between Nike and other luxury activewear brands, they also state they have experience in AR/VR, UI, UX & 3D. In terms as to how much experience and what type of project they have worked on in the past is absent. The road map clearly demonstrates a good plan as to how this project will be implemented into the blockchain and how prosumers and consumers will be affected. The overal plan is to bring more a more structured version of capitalism that will benefit more people. This plan is good and I feel that the NFT space is growing. In terms of \"digital shoes\" this can boom into a multi billion dollar space. ", "q1r": 5, "q2": "The information provided in this proposal does not have information to audit. There is a road map that clearly shows the project projected movement. There isn't enough information explaining in detail how this project will be used and implemented. ", "q2r": 4, "assessor": "z_assessor_400", "no_vca": 8, "ne": 3, "ng": 2, "nfo": 3, "vca_o": 1}, {"q0": "The problem statement is more of a solution than a problem statement. Could you explain what a generation gatekeeper is? \r\n\r\nI have to take 2 assumptions to make sense of the idea. \r\n\r\n1 - I assume that you are proposing a collaborative process for footwear design between the producer and the consumer. \r\n\r\n2 - I also assume that prosumers can register their ideas for footwear using an NFT. This would protect their design. \r\n\r\nThe proposal could drive a new set of users to the Cardano platform but as one of the comments mentions it would be in direct competition with some very established players. This could be a good thing because if the idea is successful a possible strategy is to offer this tool as a service to these competitors eg Nike etc. \r\n\r\nIt would be great if there was some more information about how this proposal creates a circular economy. This is not clear at the moment. \r\n\r\nOne way to put it would be:\r\n\r\n\"There is an opportunity to build a footwear brand that focuses on unique designs developed collaboratively by designers and prosumers. \r\n\r\nWhat is unique about this idea is that it would use NFTs to protect the prosumers ideas with the Cardano blockchain. \"\r\n", "q0r": 4, "q1": "There is some information about the qualifications of the proposer but this cannot be verified. ", "q1r": 3, "q2": "There are reasonable costs provided but there is no information about the team required to do this. ", "q2r": 1, "assessor": "z_assessor_466", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1, "reply": "Initially, we strategically chose to be more cautious as to how much of our idea we wanted to expose. Since the initial submission, we have been more detailed through each phase. A more detailed proposal with the updated timeline/roadmap is included in our video presentation"}, {"q0": "There seems to be a good seed of an idea here of using NFTs tied to athleticware, but the business model is far from clear at this stage. First off, prosumer typically refers to someone halfway between a consumer and professional. Second, it's less clear what the \"product\" is that's being curated. Is it NFTs? Shoes? Both, tied together? If they're tied together, then without having a shoe line already (since none is detailed in this proposal), how does this get enough traction and adoption to develop a real community. ", "q0r": 2, "q1": "Assuming the proposer's plan is to build an NFT community around athleticware, there are still large gaps both in the team and in the plan. Perhaps the proposer has these things worked out, but they're unfortunately not detailed in this proposal in any way to make that clear. It would beneficial to know there was a plan or expertise on the development of the app/website, as well as some NFT creators or artists to begin making the NFTs themselves. Or partnerships with athletes or existing brands to bootstrap the community. But the road to adoption isn't well laid out at this phase.", "q1r": 3, "q2": "There are some identifiable KPIs here for 1, 3, and 6 months, but they're still loosely defined. Community launch in month 1 isn't really defined. \"Product curation\" similarly -- who's curating the product? What's some broad strokes of the process? ", "q2r": 3, "assessor": "z_assessor_517", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1, "reply": "Initially, we strategically chose to be more cautious as to how much of our idea we wanted to expose. Since the initial submission, we have been more detailed through each phase. A more detailed proposal with the updated timeline/roadmap is included in our video presentation"}, {"q0": "All the initiatives that intent make the actual business practices a little more fair, a little more conscious, a litle more creative, a little more innovative, are the key component for a better world.  And in mi mind I have no doubt that the consumer has actually all the power to make the things better.  A new consumer is being born and brands have to adapt to that or disappear.  That's the efficient market in action.\r\n\r\nIn that sense the proposal subscribe its contribution.  It's concepts is clear for me but the structure of the business model is not.  It lacks details. \r\n\r\n    ", "q0r": 3, "q1": "-\tThe proposal mention relevant skills and experience of the team in charge of the proposal but not provide references or links for check that information.  The proposal does not provided specific details about the team in charge of the implementation.\r\n\r\n-\t The proposal does not provide a budget clearly outline and broken down into identifiable items.\r\n\r\n-\tThe proposal does not provide a sensible and conductible plan for implementation that shows not only what is being done but also how.\r\n\r\n-\tThe proposal does not clearly explain technical aspects like architecture, language and tecnologies if they are crucial for implementation\r\n\r\n-\tThe proposal has not considered challenges and risks relevant to a successful implementation. \r\n", "q1r": 2, "q2": "-\tThe proposal does not provided a roadmap with milestones for the follow-up of the proposal.\r\n\r\n-\tThe proposal does not present metrics/KPIs that define the success of the proposal.\r\n", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "Initially, we strategically chose to be more cautious as to how much of our idea we wanted to expose. Since the initial submission, we have been more detailed through each phase. A more detailed proposal with the updated timeline/roadmap is included in our video presentation"}, {"q0": "The proposal touch some aspect but does not clearly provide solution to the key problem at hand. The proposal has not provided us with other relevant information such as attached files of videos to better understand the proposal. ", "q0r": 2, "q1": "This team i believe have the skill set to educate and inform new members about catalyst and have clearly outlined and broken down the budget . The plan is comprehensive but its important to provide is with clear description of what the membership model is and its relevance to the proposal ", "q1r": 3, "q2": "A step-by-step plan for implementation with a define time horizon has been provided. There is several metrics that measures the success of the project. However, the project does not address the key  problem at hand", "q2r": 3, "assessor": "z_assessor_568", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1, "reply": "Initially, we strategically chose to be more cautious as to how much of our idea we wanted to expose. Since the initial submission, we have been more detailed through each phase. A more detailed proposal with the updated timeline/roadmap is included in our video presentation"}, {"q0": "Good idea but the content is not enough, should add challenging target indicators", "q0r": 3, "q1": "Additional detailed documents, implementation methods, plans also need to be added", "q1r": 3, "q2": "The roadmap is not complete, building and implementing each stage as well as how to implement solutions need to be supplemented", "q2r": 3, "assessor": "z_assessor_610", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "By elevating consumers (w/ NFTs) into prosumers that are engaged and rewarded, building a thriving circular economy on Cardano.", "experience": "20+yrs FW experience between Nike + other luxury activewear brands, also AR/VR, UI, UX & 3D.  \n\n\\+ Awareness of current system in approach."}