{"id": 397417, "author": "tranthanhtung37", "title": "Cardano Annual Market Report", "url": "https://cardano.ideascale.com/a/dtd/397417-48088", "category": 26452, "amount": 10000, "description": "A lot of misinformation about Cardano exists in social media & little information is published in local public mediums (newspaper, magazine)", "funded": 2, "upvotes": 48202241, "downvotes": 6166509, "votes_result": 42035732, "votes_cast": 183, "f6_no_assessments": 9, "f6_rating": 4.407407407407407, "videos": ["https://youtu.be/gZyouiBW2Eo"], "media": [], "f6_assessments": [{"id": 7297, "q0": "This project is exactly what the challenge is looking for. The idea is to carry out a professional report with information about Ada, Cardano and other technologies that involve our ecosystem and broadcast it in consolidated newspapers in Vietnam. I believe that everything we are looking for in the challenge is found in this proposal, even if it is relatively simple. It doesn't take complexity to successfully achieve the goals of all challenges, and the task in this challenge is clear: expand Cardano-related content into new forms of media in order to reach different types of audiences. As the author of the proposal himself says and also as he is present in the explanation of the challenge, on youtube we already have a good base, but the audience that consumes this platform is certainly not the same that sees the national newspaper. And we want to reach as many people as possible, get out of the bubble. I think this will work, because from what I've already noticed along the funds, especially in fund 7, several proposals were about Vietnam, the cryptographic community there seems to me promising and in my view the impact of this proposal aligns perfectly with what the challenge asks for. The author considers it as a challenge that there are not enough people to do research on Cardano and Ada and that they do not find an opening to expose this content in a more traditional media, yes, in fact, these are problems that we can face with the project, but I believe that they can be overcome and totally worth investing in this proposal. \n", "q0r": 5, "q1": "The author of the proposal provides a good roadmap, where the activities that will make up the whole project are listed. It is positive how he establishes phases and divides activities over time. We just needed to know in which month all this will start, which month is expected that phase 1 will end, that phase 2 will begin and so on. This is the only missing point for understanding the process; otherwise, everything is as it should. The explanation of the budget is very detailed. $10,000 is asked, and we understand a lot of specifics about how that amount would be divided. We are told in great detail how each part would be divided, for example: “Survey Activity (Make a survey and collect questionnaire and analysis results) - 40h * $40 = $1,600 - (40 hours working and 40$/hours) . Thus, the need for such an investment is very clear. In fact, I think the value is not high, compared to other proposals, but it is still fundamental that we understand the need for this amount of money, as it is done. The author divides the total amount into smaller parts and argues the need for each one. With that, we would have more confidence in the need for such an investment, giving us complete security about this part of the proposal. And finally, regarding the team, we are presented with its leader and the leader of the communication part. In relation to this duo, we also have a lot of information, such as their previous experiences and their linkedin profiles, so it also conveys a lot of confidence in their ability to successfully carry out the project. Therefore, the feasibility is very good, we know in detail all the fundamental information - about script, budget and team (in this case, about the duo) - and with that, it is possible to understand very precisely a) what would be done b) when would be done c) how it would be done d) by whom it would be done e) how much each specific part would cost f) who are the people involved and why they are prepared and qualified to carry out the proposal satisfactorily and successfully. \n", "q1r": 5, "q2": "The author views auditability with mostly numerical data. It would be necessary that we had a qualitative analysis, in addition to the quantitative one. It is certainly important to analyze in numbers how many downloads the report had, the number of newspapers that will accept it and so on. But it would also be interesting, for example, to carry out research in order to understand whether the expected impact was achieved after this project. In other words, has there been a change in view of cryptocurrencies in the country, especially Ada? Were the inhabitants interested enough to look beyond, to research Cardano? Has our blockchain caught mainstream media attention beyond the report in question? It would be important for the project author to gather this data and take it to the rest of the Cardano community. Another thing: we need to follow the phases to know if the process was being done as promised. This is quite possible to do based on the information given by the author. It would be interesting if a member of the community that inhabited Vietnam would follow up this closer, on a constant basis. This information would also need to be brought to the rest of the community, it could be through some discord channel aimed at tracking funded proposals, for example. In general, the author outlines good forms of auditability, but I don't think they are entirely sufficient to safely face the whole project result, beyond the numbers. My opinion is that yes, the proposal is quite auditable, however this auditability could be even better if he had provided more qualitative information also for the analysis of the process as well as the final results, as I suggested during the evaluation of this topic. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 615, "q0": "This project doesn't really seem in alignment with the challenge setting, but it is kind of a gray area.  The proposal is essentially for a Vietnamese multimedia site that covers Cardano, with a comprehensive market report at its root and driving the starting content that goes on the site, and an unspecified schedule for keeping it up to date or dynamic, but rather trying to market the created content to large media outlets, perhaps television or major media outlets in Vietnam.  The challenge setting seems to me to be more about projects based around creatives and visual artists. The proposal only plans on making one introduction video for introducing the report, and it was unclear if this was planned to be a regular event or a onetime, landing page type of event.  I really apprecaite a dedicated Cardano site in the Vietnamese language, where Cardano adoption is set to explode. It is worth noting one thing from the proposal that may concern or confuse readers:  the proposer notes that crypto is illegal in Vietnam...while it is illegal to make purchases with it, it is widely bought and sold as an investment asset.", "q0r": 3, "q1": "The proposer seems well qualified to build out the report and website he proposes here, with an already working prototype and a whole host of content ideas for articles and ways of parsing the report.  Delivery of the market report really seems to be at the heart of the project, which seems odd for a Film&Media project.  The report, once completed, would be used to create an introduction video, then parsed and chopped up to create a bunch of content on the website.  The timeline lays out the order that all these thing are expected to roll out.  There is an extensive section devoted to a major data gathering campaign for crypto users...that doesn't seem likely to be either accurate, or particularly helpful.  The survey is also intended to gather information regarding Cardano adoption, which, while a useful metric, doesn't indicate a connection to the challenge nor to driving new adoption.  The survey goes on to detail many more pieces of data and information to collect, including trading systems for Cardano, compilation of research studies regarding Cardano, and gauging opinion of Cardano among influencers and media figures in Vietnam.  As far as the approach to generating a marketing survey, this methodology seems comprehensive and sound.  Beyond that the media suggested to be built out looks like the standard Youtube channel crypto-fare.  With any luck it will at least be positive towards Cardano...assuming the survey supports that premise?", "q1r": 3, "q2": "The well structured proposal has clear deliverables lined out, and a steady timeline for their delivery over four months.  Almost all of the content is either documentation, or web content like articles.  There is the open question about the videos and how many are expected, beyond the first introduction, but all in all, these deliverables are all easy to report.  There is a big question about how much visibility this project will have, during implementation, outside of the Vietnamese community, so coordinating with Catalyst leaders in Eastern Townhall would be a good mitigation strategy.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1718, "q0": "There is a lot of misinformation about Cardano, and a lack of information about Cardano in the media. Therefore, the proposed team raised the idea of doing an annual market report for Cardano. In order to review the main events, projects... Find out the thoughts and expectations of Vietnamese cryptocurrencies about ADA and Cardano Blockchain. The team will produce relevant content to impart knowledge and raise community awareness about the ecosystem. The proposed team considered the risks for its project. However, the team should have appropriate solutions to minimize the possible risks.", "q0r": 4, "q1": "The proposal outlined a detailed plan. A clear roadmap in each timeline is allocated for each work to be done in the project. The team proposed a $10,000 budget and provided a clear and insightful budget breakdown for each project budget. The proposed team consists of members with experience and skills in a variety of areas needed to implement the project. A tight plan and successful strengths of the project.", "q1r": 5, "q2": "The team provided several ways to measure project progress. From the detailed plan table, specifically, the budget is allocated transparently, showing the sustainability factor and the success strength of the project. This is a new proposal, demonstrating transparency and growing the Cardano ecosystem", "q2r": 5, "assessor": "z_assessor_1409", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 2377, "q0": "I was a bit skeptical first in my first read-through however after reading deeper I think the proposal was well written, clearly, with a team of one person who is obviously skilled in digital marketing and content creation. Although I disagree that there is a lot of disinformation about Cardano rather there is not enough information about Cardano in the mainstream (mostly people know about ETH and Bitcoin), the author does mention a lot of scam projects and hacking Catalyst projects in the Vietnamese population recently especially when it comes to CA work. I believe this report will potentially draw good public relations if the channels of marketing are correct. On the other hand it can also do more harm to the Cardano community if the report is disseminated in the wrong channels. News and Film channels would be good channels and thus this proposal fits in the challenge and addresses it pretty well.", "q0r": 4, "q1": "The proposal and the available information on Cardano is quite available just not put together in a neat professional format that's easily consumable by the readers. As a digital and content marketing specialist, I can tell this is very feasible and can be done for a lot less even however you get what you pay for so the budget is on point especially if it includes further marketing of this annual Cardano report. I wish there would be more detail on how this is going to be marketed because 1000 downloads from a bot also would count as 1000 downloads or views, etc. Legitimate downloads will require time and audience, especially reaching a new legitimate audience on a shoestring budget is quite hard but very doable if the content is very high quality.", "q1r": 5, "q2": "The KPIs and metrics are very reasonable and auditable, especially when it comes to marketing content/white papers/similar reports if they use a marketing automation landing page or even a register to download form it will be clear who downloaded it, when, and if it's a unique desired download or not. The metrics don't go so deeply into this however with Marketing Tech today all the KPIs there are fair and they can create a dashboard (depending on what software they use) that's publically available to audit.", "q2r": 5, "assessor": "z_assessor_1484", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5271, "q0": "Proposal to help bring more information and knowledge about the Cardano platform to the Vietnamese community. I find it meets the goal of the challenge. Providing quality and accurate content adds value to the Cardano platform. The increase in value is also reflected in the result that more Vietnamese people have knowledge (or awareness) about Cardano, so they will see Cardano as a professional project and hold more ADA and projects. Startup with Cardano and Catalyst is more impressive. I like this idea. It is solving the reality in Vietnam that there are many scam projects based on users' ignorance about blockchain technology as well as Cardano. If the project is successfully implemented, it will contribute to creating a healthy environment and increasing the reputation of the Cardano platform.", "q0r": 5, "q1": "The team has been involved in crypto for 3 years and has expertise in digital marketing and marketing, having many articles about Cardano on media sites and small communities. There are attached links to verify each member's personal information. Full and detailed plan. The plan is divided into 3 phases, and each phase has specific tasks, and solutions are also given. The budget is based on 3 phases of the plan. Costs are calculated based on the time it takes to complete each job. I appreciate the roadmap and presentation of the budget sheet. helped me define the implementation and cost of the proposal. I believe the proposal will be successfully implemented", "q1r": 5, "q2": "The indicators and figures given are enough to be able to assess the success of the project. Kpi is provided specifically. However, the Author should share where to post these parameters so that everyone can check the results. I find that the proposal provides sufficient and easy to understand information to evaluate the stated goals.", "q2r": 4, "assessor": "z_assessor_1908", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8246, "q0": "I love this proposal as it strongly addresses this challenge. Although it can also be written in the challenge \"Grow East Asia, Grow Cardano\" as I can see the proposers come from Vietnam and the proposal will serve the Vietnamese community. It will add up a lot of value to the community if it is successfully established in the future, it operates in almost all of the media channels that an online users can reach, Youtube, e-newspaper, workshops. The name of the proposal in my point of view still not address all the information it send out, it will be conducted annually and the content will be delivered base on the data collected from the Vietnamese community - investors to be specific. They also address the risks of not collecting enough data and the fund requested is not enough. I suggest for the number of data, they might give out reward for people that take their survey or any other kind of encouragement methods as people seem to step back when asked to do a survey. In general, this is a great idea and I hope the proposers will have enough capacity to manage all the webpage that they post the content to as well as the quality of the content.", "q0r": 5, "q1": "Regarding the feasibility, there are many point that I want to note out. First of all, there are a lot of links and references given, there is also one Vietnamese link that address the scam concern, the proposers might take their idea from here, to protect the community from scam :) and a lot of e-newspapers link that they will post their content on.   There will also a landing page, KOL and workshop, if all of these mentioned can be managed, it would be a big hit. But with the number of current team members, I don't think they can handle everything, a bigger team set will be a better plan but I don't see they mention the number of total team member if they are funded. This will be a big challenge for them. The 2 members of the proposers are well-described and easy to track their profile, showing that it is not a scam project. The budget is broken down in detailed with 3 phases. There are detailed plan how to operate each phases. However, I don't see the time set for each phases, how long will each phase last? and there are many works still does not has a detailed plan (e.g workshop). Will this proposal be done in 1 year time which is in 2022, there will be a report for 2021 and the updated content in 2022? They said the content will base on the data collect from the survey, there are a lot of risks what if they do not collect enough data and how they make sure the quality of the content is good to use. My suggestion is that they narrow the number of media deliver and focus on 1 or 2 channels that really matter and focus on the content they deliver.", "q1r": 4, "q2": "As regards the auditability, they already have a Vietnamese landing page with a lot of useful and informative information. It is great If they continue to add up on this page. There are a roadmap of 3 phases but lack of the detailed time, there are KPI and successful metrics for this proposal with specific number but I don't know in how long they target to have this number. But in general, we can track for what they do in those public webpages that they mentioned. Hope this proposal be taken seriously and give big help to the community. ", "q2r": 3, "assessor": "z_assessor_659", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 8763, "q0": "Problem statement A lot of misinformation about Cardano exists in social media & little information is published in local public mediums (newspaper, magazine). Solution, Make a market report with professional methodology, implement results in multi-channel communication, especially publish in local mediums. It is essential for the community to keep up to date with accurate and regular information about cardano, many groups or communities or SPOs are doing this to help their communities. The proponent should add more information on how to collect data from reliable sources, what methodology is used to develop valid reports (qualitative methods, systematic methods, etc.). description). There are several risks that proponents need to take into account such as information gathered is incorrect and fake, creating a documentary requires knowledgeable resources in the field", "q0r": 4, "q1": "The development plan and roadmap is divided into 3 phases (report creation / creation of a multi-content basis on a report / multi-channel content delivery). There should be studies with which reporting materials to use which communication tools and to which audience. The proposed cost of 10,000 USD is detailed for 3 phases and is calculated at a unit price of 40 USD/hour. The team has 2 people to perform, the proposal has not been seen if there are more members to perform the work or not? With such a workload, it will be difficult for 2 people to complete the construction of the document content", "q1r": 4, "q2": "The project development indicators are stated to be easy to measure and track. The number of guests to the webinar should be changed by the number of guests to the webinar. This is a new project by the proponent", "q2r": 4, "assessor": "z_assessor_697", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10260, "q0": "This project is very useful. Currently, Information about Blockchain and Cryptocurrency in the local public medium (newspapers, magazine,…) in Vietnam is very little and almost the topic is talked about Bitcoin. And rare information of Cardano and ADA is displayed in these channels too. However, don't have any professional reports about Cardano. So the newbie who wants to join this market does not have an overall and reliable reference to get knowledge, and it may affect the decision to invest in crypto.\nThis proposal creates a market report with professional methodology, implements results in multi-channel communication, especially publish in local mediums. It contributes to make more awareness, acceptance, and expectation of ADA and Cardano Blockchain in Vietnam.", "q0r": 5, "q1": "Your team has experience in many different fields such as: blockchain, digital marketing, education, ... In addition, both have MBA degrees, and have knowledge of methodology. Contacts are also listed specifically, helping to increase transparency for the above information. Especially, both are Vietnamese, which will make it easy to convey information to Vietnamese people. I believe with this team, the project is completely possible.\nI want to give you a compliment for providing a very detailed and clear roadmap. The roadmap consists of 3 stages, at each stage, you have broken down further, and identified goals and things to do. Having a specific and detailed roadmap will make project implementation easier than ever. Budget allocation is very reasonable, has clearly defined the number of working hours, the salary for each hour. There are specific metrics to evaluate and measure the project's progress, making it easy for everyone to track its success.", "q1r": 5, "q2": "I access the links in the \"Author's channels\" section and look through the information posted on the website (https://vneconomics.com), Facebook Fanpage and Facebook Group. The information posted on the website is very specific, has excellent methodology, is of great value, and is easily accessible to Vietnamese people. Besides, fanpage and group on social network facebook are also quite crowded.\nI am also Vietnamese, to be fair, the information provided by this proposal is enough to judge its success. If it is successfully implemented, it will bring great value to Vietnamese people in particular and the Cardano ecosystem in general (Help more people access information about Cardano, promote the development of Cardano) .", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 10728, "q0": "The proposed solution is to create a professional report about Cardano Market, then generate the contents from this report and deliver them to multichannel, I think this proposal is suitable and solves the problem that the challenge presents. The proposal states, with a professional report, a lot of Vietnamese have knowledge (or awareness) about Cardano and they will see Cardano as a professional project and they will hold more ADA and also start-up projects with Cardano and Catalyst. I think if the proposal is successfully implemented, it will help investors as well as newcomers to have more reliable, detailed information about Cardano, thereby increasing understanding and trust in this ecosystem. . However, the report includes \"Review the main events of Cardano in 2021 and its affections on the Cardano Vietnam Community\", I think to be more comprehensive and up-to-date, the team can add a review in 2021 and 2022 (up to date the team started making reports). \n\nThe proposal includes mention of future expansion, if resources are available, teams can make it report quarterly (or monthly) to give our Cardano Community have an excellent address to read information and create a market report information hub. This is great, I hope the team will have enough resources to be able to do monthly reports, this will be very helpful.", "q0r": 5, "q1": "Regarding the roadmap, I see the team presented details and included the amount of time to complete each phase. The team presented some external resources to complete the proposal, such as data sources for making reports. The team will pay a fee to buy from some sources, doing a pilot study will have the advice of 20 crypto experts...\nRegarding budget, I have not seen you mention project management costs. In Phase 2, I haven't seen you list the cost of PR article, presentation file, podcast... I understand it's included in the Communication activities budget. For a better future, and easy for readers, I think the proposal should list full costs for work items, this also ensures that the proposal has enough funding to complete the proposal, lack of funds can lead to the proposal not being completed well. The rest of the budget I find reasonable.\nRegarding Team, I see that you have clearly stated who is in charge of what work. In terms of experience and skills, I see that you have enough experience and necessary skills to be able to complete the proposal well.\nIn addition, the proposal clearly shows how to create a survey through 2 detailed steps of a pilot study and main study, I appreciate this part.\nThe proposal also has a fair presentation of the possible risks.", "q1r": 4, "q2": "Regarding auditability, the proposal provided very clear KPIs. The community can easily visualize what the success of the proposal looks like, the KPIs for the community to audit, and how it will impact Cardano. Part As a member of the Cardano Vietnam community, I hope the proposal will be successfully implemented so that the community has an additional source of valuable and complete Cardano information.", "q2r": 5, "assessor": "z_assessor_998", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Make a market report with professional methodology, implement results in multi-channel communication, especially publish in local mediums.", "experience": "The member's project have MBA degrees, we both have knowledge in methodology. We also have approximately 10 years of experience in the marketing and communication field."}