{"id": 398247, "author": "ericdberkeley", "title": "Cardano on PBS, Project Development", "url": "https://cardano.ideascale.com/a/dtd/398247-48088", "category": 26452, "amount": 10000, "description": "Differentiating Cardano from other blockchain efforts requires getting the word out to a broader audience in a well-respected forum like PBS", "funded": 0, "upvotes": 14450113, "downvotes": 16349040, "votes_result": 1898927, "votes_cast": 79, "f6_no_assessments": 4, "f6_rating": 2.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 7328, "q0": "Theoretically, this proposal perfectly meets what we are looking for in the present challenge, because our objective here is to disseminate content related to the Cardano ecosystem in a more traditional media, outside the bubble we already dominate (mostly, youtube). If episodes of a documentary series were created, covering topics such as what is blockchain, Cardano, cryptocurrency, etc., in an easy language that was capable of transmitting knowledge about our blockchain in a safe and accessible way, and these contents were released in the System Public Broadcasting (PBS), as the author suggests, certainly the objectives of the challenge would be achieved. As our proponent says, there is still a lot of prejudice and speculation about what blockchain is, most of the public only knows famous concepts like Bitcoin and NFT, and sees the crypto world only as an attempt to get rich quick, and we know that it is not. well so. It would be amazing to take Cardano's message (how we are an ecosystem that has as its main objective to make the world a better place, investing in solving problems in several different areas and working with technology to gradually achieve such improvement) to a larger audience and above all different from what we are used to dealing with. So I think that in theory this proposal is perfect for the challenge, but we also have serious problems here in terms of detail. Several important pieces of information are missing, such as: how many episodes of this documentary series would be produced; what exact topics would be covered in each; who would be the Cardano expert who would mentor the project, providing all the technical information; how would these episodes be created (through the reporting of real situations involving Cardano? Interviews with subject matter experts?); where exactly would these episodes be, I mean, in which country/cities would we be trying to get this content out on PBS? Anyway, I think the author was very accurate in his idea but he didn't elaborate it well enough for us to have confidence in the impact, peace of mind that there is enough planning for what was promised to be fulfilled and with that the goals would be achieved. I suggest that the proposer further develop his proposal in order to increase confidence in the impact of his project. \n", "q0r": 3, "q1": "Unfortunately, all parts of the feasibility are superficial, and as with impact, they needed much more detail to convey security. Regarding the team: we don't know who the team is or even if the project would be developed only by the proponent. He claims to be an engineer, with more than 20 years working on PBS stations, having many hours working on local TV productions (but local from where) and contacts with important people in the business. But all this information is still quite abstract. I would like to know: his name, what city he works in, examples of some previous productions he has developed, who are these relevant people he has networking and also if he has any connection with Cardano, any experience with our blockchain, if he is a member active in our community, if you have already worked with something related to Cardano and etc. In this way, we would be able to know in a solid way. It would also be important for him to clarify whether he would work alone or in a group, and in the second case, to detail in an equally detailed way who the other people involved would be. He mentions having networking, if he preferred not to name names he could have said more or less how these people could help, for example. Regarding the script, we don't have one, we don't know with solidity what the project development process would be here, which phases would have to be fulfilled for the final result to be obtained, how many episodes there would be, how long it would take for each one to be produced (we know that the release is weekly), as I said about impact, what are the specific subjects of each episode, who would be the people who appeared in it and/or would help create it... Anyway, there are many details missing, a schedule divided into weeks so that we knew what would be done, how, when and by whom. And finally as far as the budget is concerned, it is also explained very lightly, asking for 10k USD which would be split between “time and travel - $2,500” and “external consulting fees - $5,000”. But how so? Tenderer working time? And how long? How many hours would he work, and for how many weeks? And what are these trips, from where to where, and why would they be necessary? These external consulting fees, what exactly would they be? It's unclear whether it's tax or the cameo of subject matter experts, who would help create the episode. So I don't think the feasibility of the project is good enough, we have a lot of things to improve here. \n", "q1r": 2, "q2": "As with the first two topics, this one needs a lot of detail. Varied and detailed information is not given in a precise way that could serve as a reliable means of monitoring the proposal. I don't quite understand how the author suggests that we measure progress. Would these meetings between the actors be the face-to-face meeting between him, the proponent, and the Cardano experts he would consult to create the episode? And about the measurement of success, this is also not explained clearly, but from what I understand it would be in relation to the number of episodes spent on the PBS network and its audience reach. I will suggest improvements. For the process: the tenderer must, first of all, draw up a detailed schedule. From this, the Cardano community would have accurate material to monitor in relation to progress, that is, we would know what to check if the right thing was being done at the right time, by the right people and in the right way. We could follow if the activities were going in the expected flow. It would also be interesting if the proponent gave us gradual feedback, for example at the end of each episode: if it turned out the way it was expected, if they managed to convey it as desired, how was the audience's reception, etc. And for the result: it is certainly important to control the numerical factors (how many episodes were produced and how many people were reached with it, who was the audience), but a more qualitative analysis is also necessary. By that, I mean, for example, how did the audience embrace this episode? Was there a good answer? Was there interaction? At the end of the project, has there been an increase in interest in Cardano in the locality where it was launched? Has there been an increase in research on our blockchain, has it become popular there, even if significantly? It would be ideal for the proponent to also do this general survey after all the episodes are released, so that we can understand exactly what their impact was on the public and how it affected the Cardano ecosystem: if new wallets were created, if there was an increase in investment in Ada, a growth in Catalyst participants and so on. In general, I liked the idea a lot, but I think it lacked detail to develop it in all aspects, if it is revised and improved I really believe it is something very interesting to be financed. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 636, "q0": "The proposal isn't too extensive but it takes a little digging to get all the pieces lined up.  The idea is for this proposer, utilizing his experience and connections in the space around PBS, to develop published resources among journalists that accurately and favorably treat Cardano, and then to use those resources to strengthen possible programming pitches with high likelihood of acceptability to PBS editors and executives.  The journalists to be approached will need to be credible in the eyes of the PBS editorial standards, and the pitches will need to be developed with producers and consultants who are also credible in the eyes of the PBS executives.  At this point I start to get that whiff of the ol' legacy institutions at play, but I press on, because what is undeniable is the kind of impact that having Cardano fairly and truthfully represented in some kind of crypto or developing nations programming on PBS (or, dare I dream, a show dedicated to Cardano?) would have.  It would be HUGE.  I honestly can't even imagine what kind of impact that would be.  You could even argue that if the pitches came up empty, you would still have the vetted material by the print journalists, and other pitches, perhaps in other places, could be developed.  There is a bit of \"moon shot\" thinking going on here, but it is also hard to see the downside if the opportunity is there.", "q0r": 5, "q1": "The experience the proposer quotes here is critically relevant to what he is suggesting, and it looks immaculate.  20+ years in the environment that he is proposing into is a consultancy bargain, and the contacts he is bringing along are icing on the cake.  The articulating joints of this effort come down to two main components.  The first is getting the vetted Cardano material developed by credible print journalists.  I know enough not to argue that other sources may be just as credible, and the proposer likely already has a good idea of who the PBS execs are going to trust, but it still does beg the question of who and how this gets done.  In favor of the proposer is he is not pitching pet rocks here:  Cardano can sell itself, it just needs a formal introduction.  I see this first step almost as a matchmaking endeavor and I think that there is some risk there, but multiple options to bring it home.  I think that the brainstorming and pitch development work to be done will not only be easy, but also enjoyable for the proposer as, again, Cardano can sell itself.  Where I start to have concerns on the project is in that last mile where these thrice vetted ideas are brought before the PBS editors or executives and ...???  I have nothing against PBS executives, I'm sure they are fine people, but institutional creep is a real thing and it is the antithesis of what something like Cardano stands for.  All that structural hierarchy, both the institutional and political is arrayed against success, even if the proposer knows how to massage the message and speak the language.  But if the proposer is willing to go into the lion's den with this, well, maybe it is worth the risk.  If it pans out, and PBS ends up actually asking for material on Cardano, it might end up being the most bang for the buck in this entire challenge.", "q1r": 4, "q2": "This is tricky.  The proposer suggests keeping track of meetings and discussions with the principals (journalists, consultants, execs) but that doesn't really capture the secret-sauce that is going on there. Sourcing the materials from the journalists is certainly a deliverable, but not one that the proposer has a lot of control of.  As a 3 month project there honestly doesn't have to be a lot of oversight, and likely the funds will be released in either one or, at most, two tranches.  One possibility would be to put the second tranche (if there are two) behind the journalistic material, since the project likely doesn't move on without it.  Another would be to add a presentation of the best concepts to the community, perhaps at a townhall event.  That could be a feedback phase, or it could be an unveiling, but either way it would give the community a solid touchstone for how the project had gone, could be done independently of the journalistic material and could temper (or heighten) the anticipation of the final results.  Any of those options, along with the proposer's suggested tracking of principal discussion would be adequate to fulfill auditability requirements.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4618, "q0": "Though the idea is genuinely tries to address the problem of people viewing the crypto-currencies with uncertainty, the specifics of how the goal is perceived is unclear. Further detailing of the same in terms of PBS programs or staff which can be seen as deliverables should have been mentioned. PBS would be a great platform with its 1million viewership. However, the journalist needn't make any remarks which may seem inappropriate regarding any blockchain.", "q0r": 3, "q1": "The plan mainly focuses on pitching the idea about informative videos on Cardano to producers at PBS. But the scope of the project ends there which may not be good enough. The budget breakdown could be more detailed which may include the visits planned and outside consultant fees either hourly or weekly. Finally the details of the personal experience/skill/profile of the proposer could have been shared.", "q1r": 2, "q2": "The parameters are are not specific in terms of number of meetings planned, number of pitches delivered or the brain storming sessions carried out, number of stories projected as an outcome of the brain storming sessions. These parameters could have been considered at this stage.", "q2r": 2, "assessor": "z_assessor_1748", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8202, "q0": "Proposer points out to the problem of lack of information about Cardano and offers a solution in the form of the Public Broadcasting System. The idea is to bring Cardano closer to the Public Broadcasting System television network and the PBS audience. Since there are no KPIs, it's hard to compare KPIs with challenge setting and proposal is not able to scale to address future challenges.", "q0r": 3, "q1": "I would like the proposal to include links which will allow us to see who is behind this idea. I suggest that You put some links via Twitter, LinkedIn or make a website that would show the necessary skills, knowledge and experience to realize this idea. The budget has been presented! The budget needs to be worked out in more detail. How many hours does it take to do and complete certain tasks? I suggest that a detailed plan be made of what is being done and in what way and within what time frame the tasks will be done. On a daily basis, on a weekly basis. Proposer presents a large number of challenges that may occur during the implementation of this project.", "q1r": 2, "q2": "In order for this project to be supported by the community, a detailed roadmap with milestones and KPIs needs to be developed. It would be good to have KPIs so that we can define the success of this proposal. Unfortunately, due to lack of data, the community is not able to follow this project.", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Early-stage development of television projects focused on Cardano that are well-suited for the Public Broadcasting System (PBS) and others.", "experience": "20+ years working at PBS stations as an Engineer-in-Charge of several thousand hours of local and national television productions lends me insight into what PBS program execs, producers, and documentarians are looking for. I have contacts that are current and relevant."}