{"id": 398860, "author": "dimitri777", "title": "The Creators Story NFTs", "url": "https://cardano.ideascale.com/a/dtd/398860-48088", "category": 26452, "amount": 30000, "description": "There are no documentaries about how things get built in Cardano from start to finish. Content creators never tell their stories", "funded": 0, "upvotes": 14096769, "downvotes": 27094578, "votes_result": 12997809, "votes_cast": 140, "f6_no_assessments": 7, "f6_rating": 1.619047619047619, "videos": [], "media": [], "f6_assessments": [{"id": 656, "q0": "An interesting concept, this team wants to film themselves working on other proposals that they assume they will be funded for here in Fund8.  In an odd twist, they don't include the topics of what those other proposals are, and why that would be engaging.  The assumption here, I think (and which I can't say I entirely disagree with, though there is something here that just feels off to me), is that regardless of the proposals, they are Creators, and their story will be interesting.  So much so, that they worry getting caught up in the emotion of it all may be one of the biggest risks this project faces.  Will the project be a case of omphaloskepsis (navel-gazing) or will it be a universally resonant insight into creativity and passion?  Based on how the proposal is formulated I lean towards the former, but who really knows?  That the proposer hasn't considered that maybe the other proposals won't get funded, or that we might want to see some evidence of what kind of impact the team's stories might have, doesn't really speak to a broader perspective needed to deliver the value they suggest is here.  What I would like to see is some narrative here with some idea about what they think a Creator's story is about, or even better, some evidence of that narrative, like any parts of the story that had already been told, so that we could gauge it.  I believe that every person that is willing to attest truthfully has a story worth hearing.  Without exception.  But the key is in that \"truthfully\" part, and for that we need to have some context to know if that is what we are getting.  Lastly, I do not see a clear correlation to the challenge setting, except for the idea that the other funded proposals are presumably Cardano related, and thus would obliquely reveal Cardano as a part of the landscape these Creators are working within.  However there are really no explicit attempts to draw this element out and frame it within the context of this proposal.", "q0r": 2, "q1": "The basic idea is a sound one, and who better to film themselves than themselves, it is like a two for one deal.  With the budget presented, it seems like they are looking at a decent sized production, with $15k for the filming part, but neither the budget nor the timeline are broken down with any clarity.  For example, there is no suggestion here about what length the film aims to be, or if it is intended to be more than one, or what style it aims to emulate (I assume for the sake of this assessment that it will be a straight documentary...interviews with some b-roll).  The 3 month timeline hasn't included the film as a deliverable milestone (of course we will assume it is) which leads to some confusion about whether it is a 3 month project as indicated, but they didn't think to note the completion of the film on the roadmap, or if the timeline actually extends beyond the 3 months presented in order to accommodate release and distribution.  On that final note, there actually isn't any information at all on how they expect to distribute the release, or what format it might be.  The team doesn't have any clear strengths for filmwork, as it looks mostly to be project management and a possible developer.  The main asset seems to be the core proposer who has a lengthy resume.  I would have liked to have seen any filmwork he had done (actually, even a reference to specific work, given that from the sound of his bio, the actual work itself may be hard to get to at this point, understandably) just to get a feel for the skill set here.", "q1r": 2, "q2": "The included metrics of # of minutes filmed, etc. can describe the accumulation of film material, but leaves a vacancy for some KPIs related to the challenge setting.  It is an understandable challenge to measure the impact of an art project, which is not what I am suggesting, but rather to consider the impacts  noted by the challenge setting and to bring the project into alignment with them, such as to highlight the diversity and equity of the teams, especially if it sprawls broadly (I can't tell from the proposal if this team is the sole subject of the film, or if there will be many teams brought together for this), and to show how learning and adoption of Cardano could be accomplished.  And I haven't mentioned it elsewhere, so I will mention it here, NFTs were in the title but not in the body of the proposal...it is possible there is some critical piece of the plan that is missing (or a typo in the title).", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 7, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 4823, "q0": "The idea of making a documentary on progress of proposals from ideas to realised projects in Catalyst Funds is a good and interesting one and it addresses the challenge. However, the proposal is undefined when it comes to elaborating more on the idea of a documentary; Who will be filmed, how many projects will be presented, in what way the production will be organised, etc.\n\nMore elaborate approach to presenting the documentary itself and it’s production to the community would be more beneficial.\n\nProducing a documentary is not just about an idea, but it takes various skills of managing a project, screenwriting, organising a shoot, sound and video recording, editing and postproduction, etc. \n\nBased on all the issues already stated, the scalability of the project is questionable.\n\nThe proposer is aware of some risks included in the project.", "q0r": 2, "q1": "The proposal’s plan is written in a superficial manner and is only based on an idea to make a documentary without giving us a clear picture on any specifics on preproduction, production and postproduction process. So is the timeline which doesn’t give us specific dates to deliver the Milestones. \n\nThe crew behind the proposal didn't present any experience in videography or film making, screenwriting, editing or any skill needed to bring this project to completion and delivering the stated Milestones. No additional studios, professional videographers or video/audio technicians of any kind are listed which could help in the production of this project or at least as mentors.\n\nThe budget detailed breakdown is not presented but rather a general idea of a budget which lacks specifics.", "q1r": 2, "q2": "The proposer doesn’t provide us with any relevant Milestones or timeline that can be used to measure the progress and the development of the project; The length, quality and release date of the finished documentary are not stated, so there are no metrics or KPI’s to use in auditing the proposal whose goal is to make a documentary.\n\nThe description of the problem is clear but solution that will address this problem is still just based on an idea and is not turned into a real, measurable project.", "q2r": 2, "assessor": "z_assessor_1781", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5176, "q0": "The impact section of the project creates in me an impression it is written superficially, in-between other staff.\n\nI see little text that does not allow the reader to understand the nature of the problem identified and the depth of the proposed solution. I feel lack of attention and focus on the need to implement the project idea. I miss the justification and the specifically defined project goals, target groups, added value and measurable results of the project.\n", "q0r": 1, "q1": "I do not see the details of the plan provided. I can’t understand from the offered information what each stage of the timeline contain (e.g. Start the capture process; Continue video production and editing etc.)\n\nThe budget is presented in general categories. I do not recognize the measurable items which can show how reasonable it is. There is a mismatch between the total budget presented in the section Feasibility (20000) and the one shown under the line Requested funds in USD (30000). This leaves the reader with the impression that the applicant has not paid enough attention and focus in the development of the project proposal.\n\nThere is a list of team members with their CV presented. What I miss is explanation of the involvement of these people in the implementation of the project and the added value of their expertise.\n", "q1r": 1, "q2": "The KPIs (No of video minutes captured; How much of script completed; How many content creators interviewed; How much of finished output is available.) identified for measuring the results of the project are not accompanied with the measurable values. This prevents understanding the targets and aims of the project, thus making evaluation of AUDIBILITY impossible.", "q2r": 1, "assessor": "z_assessor_1890", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5731, "q0": "This proposal asks the community to finance $30000 to document the progress of the proposers other proposal. Stating \"We have various proposals in this funding round. We will document how they progress to reality and how we interact with content creators.\"  Completion reports require a video report. This would add nothing to a video completion report done properly. And with no reasonable assurance that the other projects would be funded. And if not, this funding would be wasted.", "q0r": 1, "q1": "Nothing in the team's descriptions, individually and collectively suggests any talents or experience in making a $30,000 documentary. The proposer describes himself as a widely experienced person,. But references a linkedin page that has ZERO indication that those bold claims are true. Here is the link he provides: DImitri Fernando https://www.linkedin.com/in/dimitrifernando777/?originalSubdomain=lk\nIt shows no experience doing anything. Yet in the body of the proposal, the proposer describes his career accomplishments like this. (A direct cut and paste from a proposal to deliver food to the needy).\n\n\"Serial Entrepreneur, INFJ, Marketer by profession, Creative by passion, Strategist, Writer, Poet, Storyteller Has background in multiple sectors and has run several companies with groundbreaking technologies in Sri Lanka. Having his first job as a department store Santa at age 12, he learnt how bringing joy to kids and the less fortunate would bring unspeakable joy to life. He worked at Sri Lanka Broadcasting Corporation on various radio channels under the English Service, and learnt the art of communication, presentation, audio and radio production, and program compilation. Working often in highly tense security situations due to the ever present threat of terror attack on the SLBC by the LTTE he learnt to be cool under immense pressure and not let any crisis affect him. He is a Chartered Management Accountant, and Chartered Marketer. He has also completed MBTI and FIRO-B certifications and is currently becoming an ICF accredited Coach and DISC certified trainer and consultant. He has experience in multiple sectors, including Business Development on a national scale for global brands. He has been involved in social service projects for 35 years. He has been distributing food to the hungry several times a week since July 2018. Even during lockdown he was able to get a special pass as he was engaging in essential food distribution services.\"\n\nNothing to suggest any of that is true.", "q1r": 1, "q2": "SInce this proposal is based on documenting some unknown proposal that the proposer has submitted (any of more than 50), without knowing the proposal, the impact the duration of the proposal or any information about the nature of the documentary. 19 of the proposals he has submitted involve translation of written material. What would the video minutes consist of (watching a translator sit at a desk and read and write?) Nor is there a breakdown of the major cost item ($15,000 for video production) or the process. There is no way to reliably audit the progress or success of the use of $30,000. ", "q2r": 1, "assessor": "z_assessor_251", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7555, "q0": "It is unclear how this proposal will address the challenge because only a single assertion is made that clams to shine a light on the creative process. But as to what this creative will be is something of a mystery. There many additional assertions such as “getting inside people’s heads” etc – but no practical details are provided.", "q0r": 2, "q1": "A lot of detail is given on team members – but the skills do not seem to relate to the project. Again, there are a lot of assertions but no evidence of a track record. No links are provided to work examples on YouTube. There is no detailed plan only a few lines heading months with nonspecific activities. Neither is there a detailed budget breakdown. Only very general figures that are not related to any deliverables.", "q1r": 2, "q2": "Some information is provided on video outputs. But none on the delivery of the project, its organisation or marketing. So, there is insufficient information to audit.", "q2r": 2, "assessor": "z_assessor_597", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7640, "q0": "Please provide a detailed budget breakdown for the following beyond numbers:\n\nScript writing  3000 USD (provide details on the deliverables you are promising with these funds.)\n\n\n\nProduction of video 15000 USD (provide details on the cost.)\n\n\n\nEditing 2000 USD (provide details.)\n\n\nThis proposal is incomplete.\n\nIt lacks total transparency. \n\nI am an outsider looking in. So you can expect a different view from me.\n\nI'm seeing you've submitted 65 proposals to Catalyst?\n\nAND you're a vCA?\n\nHow is that not a conflict of interest?\n\nThese are the signs of a monopoly being built, and it's a major concern for any company, not to mention a self-governing community.\n\nMajor red flags.\n\nI want to see what you are going to do with all of this money.\n\nAnd I want to see how this does not overlap with your other proposals.\n\nIt says one thing, and one thing only---greed.\n\nGreed kills seeds like this.\n\nI would be so concerned about this, as a voter.\n\nSomething tells me that no one is speaking up about it, because of the amount of influence you have on the advisors at the moment.\n\nI don't have a care in the world about that. I care about Cardano's future---and this, is akin to the Fed, coming in and trying to take control.", "q0r": 1, "q1": "This is an incomplete proposal and it's clearly being submitted with the understanding that nepotism shall win this funding. Either that, or the power of vote through total ADA owned guarantees you receive the funding.\n\nIt's no different than a fat cat manipulating systems on Wall Street.\n\nIt's a clear sign you are in it for the money, if my eyes do not deceive me --- 65 proposals since Catalyst began? This one alone is $30k?\n\nHow has no one said anything about this before? \n\nI wonder what the total amount is that you have received in awards. I wonder how this compares to the total deliverables?\n\nI'm just shaking my head right now.", "q1r": 1, "q2": "No, the information provided does not. And I strongly believe if I hadn't said something right now, it would have been given the green light without question.\n\nNot on my watch.", "q2r": 1, "assessor": "z_assessor_629", "no_vca": 10, "ne": 2, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9610, "q0": "\nThis proposal states a clear problem related with the needs of the challenge and its solution also, but the fact is that it remains unclear, because it aims to document the other proposals of the participants, but these proposals are not explained, no links allow us to access it. The explanation of the link of this proposal with the needs of the challenge is also very unclear, I can not really understand the objective of the team and either to really know if the impact of this proposal is aware. It would have been necessary to give more concrete information on the precise points that the proposer seek to resolve. The overall idea is understandable, but it would have been important to really develop the impact of this project. The information is not sufficient to understand the added value of this solution for the ecosystem. Unless I am mistaken, I am not really in a position to know if this project could address future challenges.  \n", "q0r": 2, "q1": "The members are quite identifiable, with links to their profiles. But there seems to be an error in the budget which first calls for 30,000, and finally in its breakdown states a total of 20,000, which is really problematic. The technical aspects are not really explained. The plan remains unclear as well. There are no details about the tasks to be accomplished, things are approached in a conceptual way, only understandable for people familiar with the field of creation. The plan foresees to study the projects then to make the videos and to edit them, but does this concern 1 video? Or many? Because if it concerns several videos it seems rather short as time. Not knowing exactly how many videos the team wants to handle makes understanding difficult. The risks are discussed, but no solution seems to be provided to remedy them. It's a pitty because the team seems to have the necessary skills in their description, but the drafting of this proposal does not play in favor and does not demonstrate the skills stated. Technical details for example, more precise explanations would have brought consistency. ", "q1r": 2, "q2": "The way in which this proposal is written does not play in favor of the auditability of this project, because the whole remains imprecise and therefore difficult to know on which elements to base oneself to certify precisely the progress of this project. . It is not explained how these videos will be shared. Will this be done on social media? How will it be disseminated within the community? It would have been really important to provide links on the other proposals stated at the beginning in a unclear way: “We have many proposals in the fund and We will document their story”. Which ones? Why? Another problem is that the way in which the team expresses the ways in which it will be possible to trace the evolution of the project, call into question the viability of the team…”  How much of script completed” “How much of finished output is available”. It would really have been preferable to set a minimum number of videos made, for example, and this would have given us concrete figures to work with. The whole proposal is really too abstract, which is a pity, because the basic idea is understandable and coherent. ", "q2r": 2, "assessor": "z_assessor_739", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "We have various proposals in this funding round. We will document how they progress to reality and how we interact with content creators.", "experience": "I have been involved in creative and media work for over 36 years, Also active in Catalyst, General ADA holder in Circle V3, VCA and CA work in F 6 and 7 Worked in Sri Lanka Broadcasting corporation producing and recording programmes for many years. Have several YT channels.\n\n"}