{"id": 367734, "author": "", "title": "WottleNFT: SDGs Driven NFT Auction", "url": "https://cardano.ideascale.com/a/dtd/367734-48088", "category": 26114, "amount": 16725, "description": "How can Cardano align their values with the UN Sustainable Development Goals?", "f6_no_assessments": 4, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"q0": "If I understood correctly this would be an NFT auction site where the team reaps the most rewards and 5% is channeled to various social enterprises advancing SDGs. I don't see how this would bring Cardano any closer to UNDP or World Bank. As such it doesn't meet the brief of the challenge.", "q0r": 2, "q1": "It is a bit unclear who these aforementioned developers are and what their experience is. The SDG plan feels a bit pasted on and fails to convince.", "q1r": 3, "q2": "\"RoadMap\" is one of the items on the \"road map\" provided. Deliverables and KPIs are missing. The budget seems to go into starting a stake pool and minting tokens. There might be some idea behind this proposal but at present it is not very clearly stated. It would be hard to assess whether the funding has had real impact or not.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "I can see why this project choose this stream. The question asked: \"How can Cardano enter in global partnerships with United Nations Development Programme and World Bank Group, to leverage mass adoption?\" Is answered by this proposal. They want to link funding for NGOs who are working at implementing the SDGs with NFT art markets and in the process obtain 5% of the NFT sale price which is then donated via a smart contract to an NGO that the buyer nominates. If they can get artists to mint their NFTs on their platform (Is this what the stake pool is supposed to facilitate?), and they are able to sell them, ie they create enough of a presence in the NFT market to enable sales to happen, then it seems a small leap to bring in the NGOs who are nominated (why wouldn't they, they can only benefit?) And thereby ensure through the smart contract functionality that they are then given the money to achieve their aims. One of my questions is will the smart contract have any conditions to release the money? I am assuming not. Or any way to evaluate whether the money released is spent appropriately (which a normal conventional funder would be assessing ) My other questions are will they be able to onboard the NFT makes artists to use WottleNFT? This seems like a big job that many platforms already up and running have a presence in which might be difficult to break into . Why would an artist choose the WottleNFT platform to mint and sell their NFTs on? And would they be able to generate sufficient buyer interest? ", "q0r": 4, "q1": "For the reasons explored in the first assessment:\r\nCan WottleNFT create enough of a presence in the NFT market to enable sales to happen?\r\nWhy would an artist choose their platform?\r\nWill the buyers come to the platform to generate enough interest to achieve a good price for the NFTs?\r\nI am not sure if this project as written is achievable.  \r\n\r\nTo that I would add:\r\nI do not have enough detail to assess the teams technical abilities to achieve their goals of launching the platform and make the smart contracts function properly. They seem very capable, but a little more detail would be appreciated. \r\nHow will they choose the NGOs? What criteria will they use? \r\nDo they have enough experience of the NGO world to know who to choose the people they want to support and to assess whether they do what they say they will do with the funds allocated to them?\r\nAs I said this is a great project it needs some further thinking through and evidencing to make it more real and give me the confidence that it is achievable. ", "q1r": 3, "q2": "The team has a clear time line that i think can be used to audit their progress. They have already done Phase 1  (although they have set up a stake pool it has not activity, but maybe that's part of the plan?) The rest is plausible. I would just like to add that i think that if this works i think it will result in a excellent collaboration in the UN's SDG space, and open up many possibilities for Cardano and cryptocurrencies to help realise the UN's SDG ambitions. My only questions are the ability of the team to achieve this ambitious proposal. But if they manage to get this mechanism to work then this will be a real step to using Cardano to make positive impacts in important ways.  ", "q2r": 4, "assessor": "z_assessor_374", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "A great idea to support the global adaption of Cardano is linking projects to additional, beneficial purposes, so this proposal is welcome.", "q0r": 5, "q1": "The plan is very detailed and the fine-grained budget indicates that the team has already thought about prerequisites of the project. The unsvsilability of the teams real names is a bit bothering, however their sctivity in social media show that they already exist for longer.", "q1r": 4, "q2": "The timeline is precise, which should male auditing easy. Again, having the proposers real names would be appreciated.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is an excellent idea and certainly focusses on the challenge criteria of sustainable development goals. That said there may be some doubt about whether this is the correct challenge for this proposal. I am inclined to agree with the author and say yes ok. I feel that the NFT's may be the vehicle to drive to the destination of partnerships for adoption. The proposal certainly has capacity to value add to the Catalyst community and appears to have made a solid start to the project already.", "q0r": 5, "q1": "This proposal is a team of plutus developers that has already started their project and its progress can be easily accessed via the links attached. The work is of high quality and the values align with Catalyst/Cardano community. I would have liked to discover a little more about all the team but could access enough to give me confidence the team can deliver. The plan is well mapped out and the budget is very reasonable. I would highly recommend that this team collaborates further with the Catalyst community whatever the result of voting as I feel they have a lot to offer Catalyst.  ", "q1r": 4, "q2": "Excellent information provided that gives confidence that this team knows what they are doing and have every chance of success. The budget is broken down realistically and the metrics/KPI's are itemised and achievable. As stated previously I want to learn more about the team but am satisfied with what I have found so far and feel they can contrbute much to the Cardano ecosystem.  ", "q2r": 5, "assessor": "z_assessor_53", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "WottleNFT aims to align the values of Cardano to SDGs by having the highest bidder choose the SDG and Social Enterprise that they support.", "experience": "**9 NUS Students**\n\n8 Full-Stack / Plutus Pioneer Developers , with experiences in IOS/Mobile dev and Security.\n\n1 Artist / Designer"}