{"id": 368595, "author": "", "title": "Almagua DAO", "url": "https://cardano.ideascale.com/a/dtd/368595-48088", "category": 26114, "amount": 10000, "description": "The strategies of the industries to adapt to global warming of 1.5 ° C are the management of water and cooling, but they are not enough.", "f6_no_assessments": 2, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Proposal addresses the strategies of companies to adapt to global warming of 1.5 ° C by management of water and cooling through the implementation of a DAO Almagua social aquaponic, hydraulic and productive reforestation projects with neutral carbon. Global warming is a challenge, and this proposal is a step in the right direction.", "q0r": 5, "q1": "This team of 3 seems highly capable of executing a successful plan. Almagua will initiate a process together with developers and interest groups willing to support the initiative for the creation of smart contracts for the creation of a DAO in the Cardano mainnet, with voting power and a democratic system for the approval and creation of new tokens, with a platform similar to the Catalyst Idea Scale.", "q1r": 5, "q2": "The key performance indicators (KPIs) are well thought-out, and the budget is reasonable. The ability to audit this proposal needs clearer metrics that can be easily viewed to determine if the proposal is successful. Based on the budget and ability to solve the problem presented, this proposal should be funded and create an ecosystem to fight global warming.", "q2r": 3, "assessor": "z_assessor_449", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "This proposal speaks directly to the main objectives of the challenge, because it is an institution that works in favor of Sustainable Development (SDG) goals, more specifically in the field of control of the emission of polluting gases and training of marginalized populations (in this case, Colombia). From what I understood, the projects developed by Almagua would earn a certificate in the Cardano network, through a staking pool, and with this other companies/institutions could consult them directly and safely. In this way, the team that created the proposal found a way to intertwine its activities with the Cardano ecosystem, in a way that is beneficial to both, because it will bring security and practicality to Almagua and dissemination to Cardano, in my view, thus achieving what is proposed in this challenge: that Cardano can collaborate with sustainable projects.", "q0r": 5, "q1": "It is certain that the team is very capable in relation to the activities they already carry out, that is, in what concerns projects with sustainable objectives. We are provided with a website, the name of each member of the team and a video that explains in a succinct and illustrative way the main problem they work with. However, two things worried me here: 1) we don't have detailed information about each one of the team, what they do, what their backgrounds and previous works are 2) we don't know very well what the relationship between the team and Cardano is, if you understand the pools, blockchain and etc. It would be positive if we were provided with more details about who they are and how they would bridge the gap between the institution and our ecosystem, if they would hire someone from outside who is an expert in the subject, or if they themselves already understand this and would pass on by capabilities. Due to these factors, I believe that we have solid confidence in the Almagua team, but lack certainty when it comes to joining their activities to the Cardano universe.", "q1r": 3, "q2": "We have some information about what will be done regarding auditability, but not enough. Let me explain: we know what the objectives of each phase are, but they are very broad, and there is not much detail about how each phase would take place. For example, in phase 2, a marketing and communication plan for the platform would be made. It would be interesting if the authors clarified things like 1) where the disclosure would be made 2) how the Cardano community would be aware of the project 3) which target audience they would seek to reach, outside our community. As well as this phase, the others could also be better broken down. I really missed understanding how the bridge would be built between the projects and technologies involving Cardano, as I said in the previous comment. These doubts could be explained if phase 1 were more detailed. Regarding the temporal organization and division of expenses, I didn't find points to criticize, I believe that the team organized the details very well about this.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2}], "solution": "Through the implementation of a DAO Almagua develops social aquaponic, hydraulic and productive reforestation projects with neutral carbon.", "experience": "ALMAGUA was created with the support of the Advanced Leadership Foundation.\n\n2020 patent for solar boats in colombia\n\n2021 The Zayed"}