{"id": 370038, "author": "", "title": "Involve more gov. & UN officials", "url": "https://cardano.ideascale.com/a/dtd/370038-48088", "category": 26114, "amount": 20000, "description": "Governments & UN official have too few occasions to hear about Cardano.  How can we convince them that the millennium goals can be solved ?", "f6_no_assessments": 4, "f6_rating": 1.8333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal provides a specific and actionable response to the challenge. By providing a precise location (Abidjan) and envisioning an event that would involve ministers that the proposers are already connected to, the proposers clearly articulate actions that effectively work towards the Challenge of providing blockchain solutions to local governments and populations. What would make this proposal even better would be more specifics regarding the areas of focus within the expertise of each of the ministers, and the specific ways in which the Cardano blockchain might solve the specific problems that these ministers would find important. ", "q0r": 4, "q1": "The proposal states that the team has close contacts with officials and ministers, and has organized previous seminars. In order to judge the feasibility, it would be helpful to see references to these previous seminars. It would also be useful to know which ministers specifically are being targeted. The budget amount is large - $20,000. It would be useful to understand how the team arrived at that number. Will the ministers be offered a stipend or honorarium to attend? Are their travel expenses covered? What is the cost of the venue and refreshments? There is a reference to Josh's team and WADA. It is not clear to me if those groups are aware of this proposal and supportive, or if the proposers would only reach out to request participation if successful. I am also not exactly clear on who Josh is. I did some googling to see if I could figure it out, but I am not still not completely sure. Understanding those relationships would also help to assess the feasibility. Regarding the risks to implementation, even with close connections to government ministers, there is no guarantee that they will agree to attend this type of seminar on Cardano. More detail on how the team would mitigate that risk would be helpful. ", "q1r": 2, "q2": "On the one hand, auditing this proposal would be relatively straight forward. Either the event will happen, or it will not. On the other hand, it would be helpful to know the timeframe within which the event will happen. Given that the event would be funded by the community, it would also be nice to have some deliverable from the meeting itself. Perhaps a video or transcript could be released to the public. If public officials are more willing to engage in substantive conversation when not being recorded, perhaps they could agree to provide some public statement or press release about their willingness to learn about Cardano. These tangible deliverables would also help with auditability. ", "q2r": 3, "assessor": "z_assessor_278", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "The idea itself is very good but the proposal lacks information to assess its impact.\r\n\r\nAn proposal of agenda could have been suggested here, at least as a starting point. More details on the event could also be provided as whether it will be online or presential and what ithe expected outcome from the meeting is, in practical terms (like govermental policies for Cardano in the countries) - these outcomes could be proposed beforehand to the attendees. If this is just informational and no outcome or policicy is expected, then it could clearer here. \r\n\"Regular citzens\" from the represented countries could also be invited like univeristies directors or representatives of independent agencies, to validate the policies proposed from an different and technical point of view.\r\n\r\nLast, a schedule on the project stating its phases and timeframe, comunication and engagement startegy could also have been provided.\r\n\r\n", "q0r": 2, "q1": "The experience mentioned here is a good start but it doesnt have anough information on it. It should be mentioned which major events were the ones mentiones, what was the role in organizing it and what \"close contact with officials\" means in practical terms. There should also be a way, with external references, to validate that. It's also not mentioned how many people would be committed to this project. it would need people with political influence and at least some diplomacy knowledge or background.\r\n\r\nin terms of plan, it should have more details on how to create this engagement with authorities, who really have a busy agenda and a timeline.\r\nNo budget breakdown is provided but as suggestion I'd break it down in travel expenses, communication and materials (ads, phone calls, letters, leaflets etc) and the meeting itself and here the costs would depend if its online or not.", "q1r": 1, "q2": "Theres no milestones or metrics proposed.\r\n\r\nAs metrics, I'd suggest to measure the number of officials attending the events, the number of different countries engaged and the quality of the discussed outcome policies agreed there (o reven the numbers of policies proposed that were accpted there) - if theres any.", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is too simplistic and assumes that it's just a matter of having a meeting to \"convince them [Governments & UN official] that the millennium goals can be solved\". The proposal does not even clear what are the millennium goals, neither why hearing about Cardano is a solution to them.", "q0r": 1, "q1": "Having close contact with officials is not proof that a meeting would be arranged. No names were given and no guarantee could be pointed in this proposal. The proposers have shown no presence or influence in the political landscape.", "q1r": 1, "q2": "Beyond the lack of information and clarity in the proposal, it is also contradictory: \r\n\"Organize a major event in Abidjan\" VS. \"Abidjan is renowned in Africa for hosting international gathering.  This would be a SMALL one focused on Blockchain and Cardano.\"\r\n\r\nThere is no way to audit the progress or capability of execution of the requested budget.", "q2r": 1, "assessor": "z_assessor_386", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement is accurate, and the goal of this proposal is pointing in the right direction. I would like to see it succeed but it currently lacks a certain breadth in the scope of the problem.\r\n \r\nWhilst it is true that there are not enough occasions for officials to attend, I think that there is also not enough understanding on the value to society that can be created by Cardano. i.e. What would make a UN or government official prioritise attending these Cardano event over a political priority. What can be created before a physical event that would entice people to attend?\r\n\r\nMy experience in corporate product management taught me that even if an amazing product is created, or an event arranged, unless a large amount of time and effort is spent on marketing, there can be surprisingly little interesting. It's all about competing for the priorities of senior people, especially if they are decision makers in charge of a budget.", "q0r": 2, "q1": "It may be that you have left out some key experience in your proposal but you have described your experience as \"having contacts\" which helps but does not provide the confidence level to provide funding. Perhaps include some links to online videos of previous events that you have organised in order to provide confidence to the community.\r\n\r\nI think with more detail on the skills and experience of the individuals involved, it may make this a more engaging proposal.", "q1r": 2, "q2": "It is unclear if the budget requested include travel, or accommodation, and for how many people. There are many other things that are missing, but travel and accommodation will eat up the lion's share of the budget in no time.\r\n\r\nI cannot see any success criteria listed which makes it difficult to see how you might measure your success.\r\n\r\nIf officials attend, what is the follow up, how will subsequent engagement be progressed, and how will the Cardano community be kept up to date?", "q2r": 2, "assessor": "z_assessor_584", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Organize a major event in Abidjan with the African Bank, the UNDP and (2 or 3 ministers) and European commission representatives.", "experience": "We have close contacts of officials (3 ministers, European representative) and already organized seminars on blockchain."}