{"id": 383400, "author": "christophe.hoche", "title": "Real Estate Fractional Ownership", "url": "https://cardano.ideascale.com/a/dtd/383400-48088", "category": 26233, "amount": 25000, "description": "O setor imobiliário é a maior classe de ativos do mundo. Mas grandes quantum e baixa liquidez explicam porque o acesso à \"escada de propriedade\" é difícil.", "funded": 0, "upvotes": 22547735, "downvotes": 22369682, "votes_result": 178053, "votes_cast": 312, "f6_no_assessments": 5, "f6_rating": 2.1333333333333337, "videos": [], "media": [], "f6_assessments": [{"q0": "Olá Ada Voters! Então, depois de ler a proposta e olhar o site https://www.the-entr.com/ acho que a idéia de fracionar a renda produzindo imóveis e ter a capacidade de usar sua propriedade fracionalizada permanecendo nas instalações é uma idéia que sem dúvida irá impulsionar o desafio no cardano! isto porque os imóveis são uma lega em finanças que os ricos usaram para manter e expandir sua riqueza através da história. A propriedade fraccionada, como mencionado na proposta, facilitará a participação de todos neste incrível veículo de criação de riqueza. Esta proposta pode estar faltando em certas áreas, na minha opinião, à medida que progredimos na minha revisão, mas seu impacto pode ser realmente uma opção extraordinária a oferecer na cadeia de bloqueio Cardano! Quero ter certeza de dar crédito à idéia, especialmente vendo como eles trataram o elefante na sala quando se trata de fracionar bens imóveis, o que é verificação de identidade. Trabalhar com Cardano para usar o prisma Atala é fundamental para tornar os imóveis verdadeiramente acessíveis para as massas.      ", "q0r": 5, "q1": "Com relação à experiência da equipe de propostas e dos membros da equipe, tenho confiança de que eles têm o que é necessário para fazer o que dizem que farão, como mencionado no plano aqui - \"O próximo passo é criar liquidez e para isso queremos construir um mercado secundário. Mas o que tirou parte dessa confiança é que eles indicaram por que construir um mercado secundário e ter liquidez é importante, mas eles não pareceram entrar nos aspectos técnicos de como os fundos seriam usados para fazer isso e eu não estava claro se os fundos seriam usados apenas para liquidez ou se eles usariam alguns dos fundos para construir o mercado? Penso que é importante ter mais transparência sobre o tempo necessário para ver um produto acabado e onde os fundos serão alocados. Também teria sido apreciado algum contexto sobre as propostas da equipe de desenvolvimento e seu papel neste contexto para imaginar como esta proposta se manifestaria.", "q1r": 3, "q2": "Em termos de poder auditar a proposta, não temos linhas de tempo ou pedras quilométricas claras para auditar a proposta. Talvez me tenha escapado algo, mas para mim o plano me pareceu mais um passo do que um plano. Se eu perdi alguma coisa, espero que esta revisão seja marcada como muito alta no impacto desta proposta, mas estou preso entre uma pedra e um lugar difícil, pois meu trabalho é ser imparcial nestas revisões e verdadeiro para os eleitores. Gostaria que o proponente tivesse acrescentado mais substância à auditabilidade desta proposta porque infelizmente a única coisa que podemos auditar é se o mercado puder ser construído e não tivermos uma linha de tempo clara sobre quando isso seria, então terei que dar a esta proposta uma pontuação de auditoria de 2 pelas razões que mencionei acima.", "q2r": 2, "assessor": "z_assessor_766", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal focuses on fractional ownership of the fully managed real estate to lower the entry amount, remove non-monetary friction and facilitate liquidity. Since the detailed plan was not well-prepared [no goal, no roadmap, no KPIs/metrics, no risk, and mitigation]. As a result, potential impact can not be seen. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1. ", "q0r": 1, "q1": "There is not much information provided, as mentioned, there is not much proof of feasibility to evaluate. As the proposer said that \"This is a complex project with multiple components\", and fractional ownership in the real estate required more detail [in the plan] than this. Therefore, based on the given information, I strongly disagree with this proposal's feasibility, and would give it a score of 1.", "q1r": 1, "q2": "As mentioned, since this proposal is incomplete [no profile description and links for verification, doesn't have any roadmap or KPIs, the budget structure is not defined, and the risk is not defined], transparency is at a low level, especially for a complex topic of there is not much proof of feasibility to evaluate. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Real estate fractional ownership and crowdfunding real estate future is definitely a future trend and cryptocurrencies may play a big role in there. Decentralized finance may also play a big role, but unfortunately the proposal does not clearly explain how the plan addresses this specific challenge.", "q0r": 3, "q1": "The team has proven track record in the \"fractional ownership\" business, but unfortunately technical competence is not sufficiently presented in the proposal.\r\nThe plan is very generic and not detailed enough to assess the likelihood of the proposal to be implemented successfully. It is not explained sufficiently how the budget will be spent.", "q1r": 2, "q2": "Information to audit the progress and the success of the project are not presented in the proposal.", "q2r": 1, "assessor": "z_assessor_685", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The proposer has a background in real estate agent management from Paris. The proposal is to have a brilliant idea to apply Atala PRISM for DID and based on the Cardano blockchain. The real estate buyers will share a portion of an actual real state, and there is a platform going to manage to collect the rent and manage the rental's maintenance. The reality is that real estate in the top 10 cities worldwide is highly unaffordable for most average income earners in those cities. If the project formed a more explicit correlation between ADA holders and real estate businesses and streamlined the earning and assurance module, then the project model would ultimately be a high-value use case project.", "q0r": 4, "q1": "I believe the proposer a bit rush in writing the proposal to submit. Therefore, the deliverable elements are not provided clearly and are close to being omitted. I provide two quick links below that might help you rewrite and do more research and comprise data for next month if you wish to carry on with your journey.\r\n(Short version) https://t.me/ProjectCatalystChat/60411 or (extended version) https://cardanocataly.st/en/proposers/ \r\n", "q1r": 1, "q2": "With a $25,000 project requested, there is no information on how the project could be carried out and who is going to be involved. It is genuinely impossible for the community to view the challenge team to monitor and report your project progress. Should you refer to the two links provided in the feasibility box if you ever wish to rewrite and resubmit in the future fund rounds.", "q2r": 1, "assessor": "z_assessor_726", "no_vca": 15, "ne": 5, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal accurately identifies an avenue to boost cardano's defi through fractionalizing real estate. The goals align with the challenge however the goals  are not clearly defined and so it is difficult to determine exact aligment.", "q0r": 4, "q1": "The team appears to have good experience in real estate however there is no reference to experience with plutus, smart contracts or fractionalised tokenisation and so that coupled with no comprehensive breakdown of funds makes the feasibility of this project low.", "q1r": 2, "q2": "No roadmap, KPIs or defining of what success looks like makes this project impossible to audit. ", "q2r": 1, "assessor": "z_assessor_745", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Oferecemos propriedade fracionária de imóveis totalmente administrados para diminuir o valor de entrada, remover fricções não-monetárias e facilitar a liquidez.", "experience": "Ampla experiência em finanças e direito de mais de 25 anos em bancos e experiência pessoal em investimentos imobiliários em diferentes cidades"}