{"id": 383916, "author": "konmagat", "title": "Konmaswap a DEX for Cardano", "url": "https://cardano.ideascale.com/a/dtd/383916-48088", "category": 26233, "amount": 73600, "description": "Falta uma plataforma onde novos usuários possam entrar a bordo da Cardano, tendo uma maneira fácil de utilizar várias soluções integradas DeFi e ICO", "funded": 1, "upvotes": 78268771, "downvotes": 22511094, "votes_result": 55757677, "votes_cast": 426, "f6_no_assessments": 5, "f6_rating": 4.2666666666666675, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=16280"], "media": [], "f6_assessments": [{"q0": "A proposta em sua totalidade parece promissora. O proponente aborda o problema da \"falta de uma plataforma onde os recém-chegados possam utilizar as soluções integradas Defi e ICO\", propondo uma solução de \"proporcionar uma maneira fácil de implantar contratos inteligentes na cadeia Cardano\". Os dados demográficos que a equipe planeja ter um impacto são principalmente os usuários existentes em outras cadeias e também novos usuários junto com eles. Assim, ao implementar a proposta com sucesso, a Cardano se tornará um dos destinos de hospedagem da Defi. A conclusão positiva de todas as fases do plano, que inclui o mercado DEX e NFT, trará muita variedade ao ecossistema, aumentando também as novas contribuições e aumentando o supervalor da cadeia Cardano.", "q0r": 5, "q1": "O proponente tem fornecido um roteiro detalhado semanalmente, o que acrescenta muita credibilidade à equipe. Há também um conjunto de habilidades necessárias que a equipe menciona que parece apta para o desafio em questão e a Konma Labs demonstrou com sua experiência e sucesso nos empreendimentos anteriores, o que faz com que a probabilidade de implementar com sucesso esta solução seja altíssima. O orçamento solicitado também está bem dentro do limite de 20% do total dos fundos, conforme mencionado no resumo da campanha. E o orçamento é muito elaborado e lúcido. Entretanto, o lugar que eu acredito que precisava de um pouco mais de informação é em relação aos riscos e desafios que a equipe poderia enfrentar e quais são as estratégias de mitigação em vigor. Também como esta nova solução para o desafio supera as vulnerabilidades já existentes nas outras cadeias. Um pouco mais de compreensão disso tornaria mais fácil para os leitores e para a comunidade ter certeza do sucesso da proposta.", "q1r": 4, "q2": "As informações fornecidas na proposta são suficientes para auditar e acompanhar o sucesso da proposta. O proponente apresenta tanto o produto quanto o projeto KPI para auditar de ambas as perspectivas. A equipe também planejou disponibilizar o software como código aberto, o que ajuda a comunidade a manter o progresso sob controle. Além disso, o aumento do staking e comércio de NFT permitindo a transição de outras cadeias mostra o aumento do tráfego e do valor da rede que é uma ferramenta transparente que ajuda os auditores a tirarem suas conclusões sobre o sucesso da proposta. Com a conclusão da fase I, o número de moedas listadas no DEX implementado ao final de 6 meses será também uma métrica adicional que o processo de auditoria pode utilizar. Dada a lógica acima, a clareza e a auditabilidade são distintas e, portanto, eu gostaria de pontuar 5 de 5 para o mesmo.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 18, "ne": 13, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "This proposal intends to create a DEX featuring an array of DeFi-options.  It is part of a larger project spanning 7 proposals in fund 7. The intention of the main project seems to be to create a sub-ecosystem on the Cardano blockchain. A DEX with DeFi-abilities is a crucial part in the whole that is intended. The DEX has a dual function as there is a set objective to bridge with other blockchains, putting the ERC20-converter to use and generating an influx of community members on this one. ", "q0r": 5, "q1": "The plan is ambitious, but not impossible. The proposers still need to assemble a team for this. There has been provided a clear definition of the functions that are still needed.  It also needs identification of who already is in the team. ", "q1r": 3, "q2": "Highly auditable proposal, aside from the team member identification and expected public launch date. To improve, try to include profiles of each team member and corresponding skills. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 24, "ne": 2, "ng": 19, "nfo": 3, "vca_o": 1}, {"q0": "The proposal is clearly a DeFi protocol that seeks to become a competitor in the DEX space of Cardano. ", "q0r": 5, "q1": "Although they give some indication as to recruitment of various personnel and developers that can work in Haskell, not much evidence is presented in regards to the team and why we should trust that they will be able to successfully do all of this. \r\n\r\nFrom what can be inferred from the proposal, the budget is mostly going to be used to recruit developers and so it seems like the proposers will fill the role of being managers and strategists. However, if this is the value-added of the team itself then more details in regards to the team's capacity to recruit effectively and the details of the DEX itself. Usually proposals that ask for amounts in the range of $75k will have MVPs or a very strong track record. ", "q1r": 2, "q2": "The milestones provided are very clear and easy to follow up on as they are provided on a weekly basis with recruitment in the first two weeks and ICO by week 23. However, they do not indicate any KPIs such as the number of users. This is a minor point that doesn't justify a reduction of stars but still something they could improve on for the next round. ", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal able to identifies the problem properly, by creating a DEX platform for the Cardano ecosystem. They create this DEX to provide an easy way to deploy smart contracts on the cardano chain and utilize Sales tools for an easy ICO process and more, which not only aligned to this challenge settings but also will further drive adoption to Cardano ecosystem in the future. ", "q0r": 5, "q1": "The team working on this proposal can be verified and proven on their website link, which have Linkedin profile. Konma is an organization and have an orchestra of different proposal (seven of them) on this Fund 7. Konmaswap is one of their project out of many, but that doesn't lower the quality of each proposal they made. From the knowledge of the teams needed (and how to find them), the detailed goals and plan, budget breakdowns, action plans, the KPI, product KPI, all of this is explained very well and in details. Especially regarding the skills requirement for the team. It shows that Konma are able to identify the resource needed for this kind of project to succeed. Overall, from this well written proposal alone, there is a high chance of success that this project will come to fruition. Keep in mind that there are 6 other proposal by Konma team in this Fund 7, and it shows their dedication and hardships.", "q1r": 5, "q2": "The roadmap is explained in weekly basis. Metrics and KPIs are provided, alongside with their goals, demographic description, and action plan. In term of auditability, this proposal is feasible to be audited from the activity on their website, social media, and the project metrics / KPIs itself.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The proposal accurately addresses the challenge and if successful would boost Cardano's Defi Ecosystem. However it would be great to hear what makes Konma unique in its proposal as there are already multiple DEXs launching on the ecosystem.", "q0r": 4, "q1": "Whilst links to Konma are provided it is very difficult to determine what skills exactly the team brings with them. There is mention of Consulting Mlbas, or Emurgo but due to the size of the funds requested it would be great to see the in house experience available. The funds requested are broken down and the timeline seems accurate for the scope of the work but without knowing the experience of the team it is impossible to determine feasibility.", "q1r": 3, "q2": "A clear roadmap has been provided that can be followed and aids in audibility. The KPIs could use some refinement in terms of how much value the proposal is actually bringing to the ecosystem as a whole. ", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 2, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "KonmaSwap fornecerá uma maneira fácil de implantar contratos inteligentes na cadeia de cardano e utilizar ferramentas de vendas para um processo fácil de ICO e muito mais", "experience": "A Konma Labz tem participado de hackathons conduzidos por vários Protocolos e Projetos. Também ajudou a integrar a cadeia de bloqueio para mais de 15 setores."}