{"id": 384067, "author": "nik", "title": "CarbonNo DeFi Carbon Credit Market", "url": "https://cardano.ideascale.com/a/dtd/384067-48088", "category": 26233, "amount": 25000, "description": "Os mercados de crédito de carbono não são verificáveis, não transparentes, e estão repletos de fraudes. A inovação e a participação são asfixiadas pelas autoridades legadas.", "funded": 1, "upvotes": 35379589, "downvotes": 22251250, "votes_result": 13128339, "votes_cast": 313, "f6_no_assessments": 3, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Providing a decentralized network to define methods and mint NFTs for validated projects will boost Cardano Defi. Proposal explained that carbonNo has a carbon-negative coin that creates a direct incentive to remove carbon from the atmosphere which they attached a whitepaper giving details. Challenge is addressed well.", "q0r": 4, "q1": "The team has Plutus Pioneers, residential and commercial solar power/efficiency engineers, utility experts, game theory PhDs, blockchain enthusiasts who will be able to implement the proposal successfully. The plan detailed carbonNo standards, carbonNo coin, carbonNo carbon credit and carbonNo platform. ", "q1r": 4, "q2": "The budget breakdown is understood but the roadmap is not to clear to allow for easy or comprehensive auditing.", "q2r": 3, "assessor": "z_assessor_688", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "This is a very interesting and innovative proposal. It is not clear to me how to incentivize the carbon reduction initiatives to accept CNC token and how this could be accredited. The problem is feasibility. Why the governments and private landowners involved in afforestation or capital-intensive carbon capture projects (like the ones funded by Bill Gates) would accept CNC or NFT instead of traditional funding and grant channels is not addressed.", "q0r": 2, "q1": "This is a strong team with extensive experience in the clean tech space. The experience with Plutus programming is equally reassuring. Minting NFTs on testnet is not going to achieve critical mass for a carbon pricing initiative where the UN has failed with the Kyoto Protocol. ", "q1r": 3, "q2": "The detailed plan for this proposal shows a plethora of parallel measures to address the problem statement, without documenting a timeline, KPIs or risk factors for any of them.", "q2r": 2, "assessor": "z_assessor_696", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "This is a great project and one that is very close to my passion as I am part of the Cardano4Climate community and involved in some Carbon mitigation NGOs. The problem and solutions are well defined and with good details. There is indeed a major issue today with credit carbon markets and blockchain-based solutions could be important. I gave only 4 stars thou as it will be good to see stronger alignment with the challenge and have more explanation about it. It might be associated with another challenge as well related to Dapps. More information about the market size potential (relevant to your focus area - building carbon emission) would have been helpful to understand scale opportunities. ", "q0r": 4, "q1": "There is good information provided about the leading team and it seems a great team with relevant experience. It is clear the team has a lot of knowledge in the area and they have a well-detailed proposal white paper. The team also started to work on the tech side as well as on the market validation side and well done on that. What is missing thou is a clear road map for 3, 6, 12 months with clear KPIs and deliverables. Which is essential for the plan. The budget seems reasonable and low for this stage but it is not clear where it will bring you and for how long it will last. It is pity as with a bit more details on the plan and milestones your proposal would have got a much higher rating. Missing also risks and challenges.\n", "q1r": 3, "q2": "The KPIs and deliverables are not very clear and therefore very difficult to audit. The road map is a general one and not specified with timing which is again difficult to audit. I would suggest that you learn more about successful proposals and CAs are rating proposals so you can do the adjustments. Here is the link: https://docs.google.com/document/d/1g-iZhDlKhUBZkui1uv8NVNfJC4oVD3JtR-P6Fue7XPU/edit. You can also join the caradano4climate.com community which will help you in questions/evaluaiton of the proposal.  Telegram https://t.me/ClimateChange_THEChallenge", "q2r": 2, "assessor": "z_assessor_636", "no_vca": 25, "ne": 4, "ng": 20, "nfo": 1, "vca_o": 1}], "solution": "Rede descentralizada para definir metodologias e NFTs de menta para projetos validados, e recompensar incentivos para participação e governança.", "experience": "Pioneiros de Plutus, engenheiros residenciais e comerciais de energia solar/eficiência, especialistas em serviços públicos, doutores de CS/teoria do jogo, entusiastas da cadeia de bloqueios"}