{"id": 367062, "author": "", "title": "Defi Credit Union Via Crowd-staking", "url": "https://cardano.ideascale.com/a/dtd/367062-48088", "category": 26112, "amount": 9200, "description": "Most access to credit in Africa is done via traditional credit unions, which is limited by factors like; Trust, Familiarity & Capital risk.", "f6_no_assessments": 7, "f6_rating": 3.714285714285714, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is to take a group of stakers, and each epoch pass out the whole groups rewards to one participant. The trust issue is managed by locking all stakes until everyone has be paid. This is a nice solution to a Sou Sou type scheme where trust is not needed. However, as we are only talking about the staking rewards, rather than the full amount committed (as in a Sou Sou scheme), its not clear that the aggregated amounts released would be big enough to make a difference. Even with 72 participants, thus locked for a full year, each participant would only be getting ~5% of their committed capital released to spend on the 1 release they get. Does this move the needle?", "q0r": 3, "q1": "The team appears to have the capability to successfully implement this concept. They have a detailed plan with milestones and plenty of experience in the space. It would be nice to see more of a plan on how then indent to drive adoption once built.", "q1r": 4, "q2": "Delivery on the technical side should be easy to audit. Success however requires adoption. How many users and SPO's do they intend to bring onboard? Some goal here which the team should be working to hit would focus the project on successful adoption, rather than just technical production.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 11, "ne": 3, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This proposal successfully identifies a problem related to the challenge. Although it's not specifically related to Africa, it mentions that the first partnerships will be done with local African single SPOs, which is a good connection with the Challenge goals. Even though the proposal doesn't really solve the lending problems, it is an improvement in a current system already in place, but using the Blockchain technology, which also makes sense in this context. Although KPIs are not presented, there are also no required KPIs in the Challenge setting. Anyways, it addresses local issues regarding lending in Africa, and also strengthens the Cardano ecosystem by increasing the overall amount of ADA staked. Once it's developed, it should not need much extra work. I believe this can be sustainable in the long term, but some information about it's sustainability would improve the proposal as well.. Score: 4", "q0r": 4, "q1": "The team's description is very good, and there are links to their LinkedIn profiles so check the information, which gives us confidence that they will be able to deliver what they are promising. The budget covers the smart contracts development, although it doesn't break it down and explain each part of it, so it's not completely possible to evaluate the feasibility in this case. The budget also only includes development and legal expenses, but in order to make it happen, there should be some budget for project planning, marketing and other related things. The plan is realistic, and it's likely that the team will deliver what they are promising, although it doesn't provide too many details about it. At last, the proposal didn't mention possible challenges when developing this project. Score:4", "q1r": 4, "q2": "There is a simple roadmap presented with some milestones for 1 and 3 months of development, although not many details are provided. But as an overview, it's a fair plan and it gives the community a way of checking the proposal's progress if funded. The proposal doesn't add metrics or KPIs for the community to measure its success. This information should be included to allow the quantification of the proposal's success. Also, the budget is not broken down into smaller pieces, which would definitely help with auditing how the money is being spent, when and related to which part of the project. Score: 4", "q2r": 4, "assessor": "z_assessor_31", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "This seems like a very promising idea but fails to clearly address the challenge.\r\nProposal seem to allude to a  \"Risk-Free\" credit facility and as someone who have both co-develop and managed the second largest Airtime Micro-Credit-Lending (https://airtel.com.ng/pay_and_recharge/airtime/borrow_airtime) service in Nigeria for 7 years. I know there is no such thing as a risk-free credit facility.Assuming a \"Risk-Free\" Credit Facility is possible, the proposal fails to explain how this is accomplished in detail.\r\nProposal Solution lacks clarity on the process used to arrive at the solution , no explanation on how the stake-pool will be particularly used for the proposal,\r\nHow will the pool generate enough rewards to be useful as a credit facility.\r\nDue to the lack clarity in explaining the solution, i can neither agree or disagree that this proposal addresses the challenge .\r\n", "q0r": 3, "q1": "Proposal did a very good job of sharing verifiable experience with links but seem to under-estimate the delivery timelines.\r\nAs a Senior Software developer with more than 15 years experience,6 months seem to be too little for such a big proposal to be properly implemented and tested especially if it will be used by a near global user base.\r\nProposal fails to address the issues of security on the suggested web platform to be used (This is very Important).\r\nThe proposal did not state if an operating license will be needed and how it will be acquired , despite requesting for Legal and Licensing Fees.\r\nConsidering the above, i can neither agree or disagree that this proposal will be implemented since it lacks more details relating to its implementation and execution.", "q1r": 3, "q2": "Proposal attempts to present a roadmap but failed to state key milestones ,but instead bundle them together as one activity in a given timeframe.A step by step breakdown of the activity with the cost implication and timelines will be helpful in auditing the project.\r\nConsidering the lack of clarity on the implementation processes , i can neither agree or disagree on the audit ability of the proposal.\r\n", "q2r": 3, "assessor": "z_assessor_331", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1, "reply": "For CA Notes on  Impact/Alignment:\r\n\r\nIndeed there is no risk-free investment, however in this context the risks are: Trust, Familiarity & the risk of losing capital to bad Esusu operators or fraudulent ones. Our solution eliminates these risks associated with the current traditional Esusu model. \r\nThe idea is to use the staking mechanism to advance the rewards in a single payment, obtaining a larger amount at a given moment that allows you to face different financial situations.\r\nYou can understand it better in the “Why is it good to concentrate rewards on one individual each time?” section and with the provided “Example”.\r\n\r\nDetails on how the solution will generate rewards and how it will work with stake pools also are detailed. You can check it in the \"Adoption\" section under \"Stake pools feedback\".\r\n\r\nWorthy of note: The solution could be applied in any model where pooling funds are required.\r\n\r\nFor CA Notes on Feasibility:\r\n\r\nAlready the project is up to 65% completed amidst the limited resources, please see this progress demo by our smart-contract developer and team member Greg: https://www.youtube.com/watch?time_continue=13&v=R6gs_smTfmw&feature=emb_logo\r\n\r\nThis clearly shows the CA assertion on implementation duration is ill informed and shows lack of hands-on knowledge. Security is our first priority in this implementation, our team is equal to the task and professionals with years of experience working in renowned world class companies.\r\nThe main platform that will use these smart contracts will be a mobile wallet, in the style of Yoroi, which is also proposed in this fund6(see below). In any case, since the smart contracts will be open source, any existing platform will be able to adopt and use them. \r\n\r\nLegal registration and licenses refers to fund required to legally register the startup (Thrift Finance), this proposal is a feature within our Smart Thrift Savings Wallet, please see our second proposal: https://cardano.ideascale.com/a/dtd/Smart-Thrift-Savings-Wallet/367639-48088\r\n\r\n\r\n\r\n\r\nFor CA Notes on Auditability:\r\n\r\nWe recognize that the roadmap provided is not as detailed as it should be, and we believe we can do better in this regard. We will work to improve this lack.\r"}, {"q0": "This proposal is very-well thought of, very mature in its presentation and clearly argues its relevance in this challenge setting. It also perfectly aligns with Cardano's goals in Africa. What is commendable in the proposal is the intention to modernise the age-old financial practice of Esusu, which is well embedded in the Nigerian culture and to other cultures where African diaspora has reached. This will not only make adoption widespread but most importantly, it will be familiar to people who may not even have heard of Defi/Real-fi. It is also commendable that the proposer intends to deploy the DApp in the local language which would make on-boarding easier. Where I would ask the proposer to proceed with caution or reconsider is the intention to partner with single-pool operators, which in itself is not a disadvantage. However, in the end it is the total amount of staked ADA that will ensure regular block production and for members of a Crowd Stake Group, you would want to maximise rewards and ensure regularity of block production. I only mention this as there is a likelihood that pools maintain a single pool because they are not yet saturated. It makes business sense for a near-saturated single pool to spin off another and I am sure that any pool to which this project is aligned will attract quite a lot of ADA delegators who would want to assist in their own way in Cardano's mission in Africa. ", "q0r": 5, "q1": "This is a proposal that oozes quality team members who can achieve the goals successfully in my opinion. To most in the Cardano Community, the main proposer Odosu is a familiar face and name and is one of the blockchain pioneers in Africa and a Cardano flag-bearer. The resumes of the rest of the team are just as relevant and impressive. The fact most are Plutus Pioneers adds to the chances for this DApp dev team's success. The road map presented is very achievable and impressively short time-wise and the stated dependency on IOHK and dcSpark suggests awareness of the main Cardano roadmap. ", "q1r": 5, "q2": "A clear roadmap and expected outcomes were presented at the 1 and 3-month intervals. However, the more granular details which CAs commonly look for to assess audibility are lacking. Notwithstanding this missing information, this relatively high mark was given due to the demonstration of the thrift wallet and its functionality and it is quite impressive. I took that as an audition which no text listing of a dev plan can compete with. I also get a sense that the total value being lumped under the role 'Plutus Developers' indicates the team will share the dev responsibilities and approach the build internally and in a flexible manner. For a proposal which can have a tremendous impact on people, the amount requested is small. Good luck.", "q2r": 4, "assessor": "z_assessor_42", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The presented idea is really effective for this challenge. These kind of projects can benefits the people of Africa to participate in decentralised way of lending and borrowing.", "q0r": 5, "q1": "Team has good experience in finance and business analytic so if they are able to make this up on cardano blockchain then its great to see these kind of ideas in real world.", "q1r": 4, "q2": "Time frame can be reconsidered as it could take more than 6 month for final product as per my developer experience. Rest of presented idea is really good.", "q2r": 4, "assessor": "z_assessor_538", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "In my country (Colombia) this is a very common practice among the population with a low rate of enrollment in the traditional bank system.   In the physical world, the key factor of this practice is the trust among the participants of the stake:  frequently, they are of the same family,  closely friends or relatives.  That bound assures the accomplishment of the commitments.   The case presented by the proposers is a very real reference of the reality in the developing countries since a long time ago.  \r\n\r\nAnd, as is mentioned by the proposers, if the digital trust provided by the blockchain takes the place of the traditional human trust (in otrher words,  a clear case of trust descentralizaton), that opens a whole new world of posibilities: take the trust in the humanity to the next level.\r\n\r\nRecently, some fintechs and fintech branches of the traditional banks have tried to replicate the model with a minor success, because I think, the formula (trust + low barrier of entry) is far far out of the traditional risk management model.   \r\n\r\nIn summary, it is clear that the proposal is aligned with the objectives of the challenge.", "q0r": 5, "q1": "-  The information provided  for the proposal about the team in charge, makes possible to asume its sufficient experience and skill.  \r\n\r\n-      The proposer does not provide a budget clearly outline and broken down into identifiable items.\r\n\r\n-\tThe proposer does not provide a sensible and conductible plan for implementation that shows not only what is being done but also how.\r\n\r\n-\tThe proposer has not considered challenges and risks relevant to a successful implementation. ", "q1r": 3, "q2": "-\tThe proposal does not provided a roadmap with clear milestones for the follow-up of the proposal.\r\n\r\n-\tThe proposer does not present metrics/KPIs that define the success of the proposal.\r\n", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "For CA Notes on Auditability:\n\nWe recognize that the roadmap provided is not as detailed as it should be, and we believe we can do better in this regard. We will work to improve this lack.\nHowever, 1 rating appears to be too strict."}, {"q0": "This proposal is a great idea and highlights the team members strong appreciation and understanding of African context and cultural norms - demonstrating their attempt to identify a problem within the scope of the Challenge criteria.  The proposal is also a clear value add and positive impact to the Cardano ecosystem and further aligns with the vision that IOHK and the community is working towards in Africa.  Leveraging my experience in strategy consulting for the financial sector, I suggest the following changes to turn this from a strong proposal to an excellent proposal. \r\nFirstly, the problem statement can be improved by rewording it to address a much larger topic such as the inability for Africans to access credit. I understand that credit unions would have certain eligibility criteria in order to become a member - which I imagine is the reason that large cohorts resort to the Esusu/Ajo options. This isn't made very clear in your proposal and I suggest anchoring your problem around this. What would help unpack this further is providing some high-level metrics around who the target market is, how many millions of people this would affect, etc…\r\n\r\nFurther, you mention that credit access is 'limited by factors such as trust, familiarity and capital risk.'  One again, it is not entirely obvious just by reading this what the true problem is and why - consider using terms such as 'financial literacy, eligibility criteria, etc..' to really bring this to life. \r\n\r\nFinally, the proposal's 6 month aspired timelines also appears to aligns with the challenge metric of launching within the next 3 funding rounds.  \r\n\r\nOverall the proposal is quite lengthy. Not only does is it distracts the reader from what appears to be a solid idea but does not sufficiently outline the key information such as (not exhaustive):\r\n\t- who are your target users (e.g 30-50 yr old women?)\r\n\t- why is it necessary to build this (are you just digitizing an already decentralised process?)\r\n\t- what are the benefits of your customers (if they customers don't get the share of capital each rotation then why would they opt into your system, does it protect them from fraud or cash being stolen in the normal setting?)\r\nFor future proposals I suggest trying to be more concise and grouping key pieces of information rather than scattering it throughout the proposal and forcing the reader to join the dots. Despite this, I think it is a great idea and worthwhile exploring further! ", "q0r": 3, "q1": "The team appears to have a diverse background and existing work experience in the African markets.  Both of these are great starting blocks and supported by links to their profiles (i.e. LinkedIn, podcasts, videos).  The requested funding of $9200 represents just over 10% of the challenge funds and it is clearly detailed that majority of it will be spent on Plutus developers.  Going forward I suggest having a clearer breakdown of this and linking it to your roadmap. You have mentioned in the roadmap section that after  3 months in you will start testing the smart contracts. How does this fit in with funding? Are the developers only being used for 3 months and not the full 6 months? Once again, providing a breakdown of how the funds will be used provides transparency for the community of voters and gives confidence in your proposals going forward. \r\n\r\nThe team has also provided a relatively concise roadmap. In the comments section you have reassured some community members of the 6 month timeline being realistic. Having more evidence around this would be extremely helpful - e.g what is your starting state (are you starting from zero or is this a build on top of a partial build). Once again, providing some detail and structure around the next steps / roadmap for this project would give more color and evidence that the project will be successful long term. \r\n\r\nLeveraging my consulting and project management experience, my recommendation for a future proposal is to more clearly outline what you foresee as future challenges. I can see a local adoption section which mentions elements such as local languages, blocking problems or library implementation which seem to fall under the category of 'future problems' - I suggest changing the wording to reflect this more clearly to demonstrate to the reader that you have considered all of these avenues. Further fleshing this section out to consider elements such as building trust/reputability or incentivization of users to use the service would show a deeper maturity in your proposal. \r\n", "q1r": 3, "q2": "A key strength of this proposal is the tangible nature of the problem they are trying to solve. These tangible problems are translated well into actionable items, milestones and future plans that are mentioned throughout the proposal - providing sufficient information to audit the progress over time\r\nIn order to improve the proposal even further, I suggest further detail and clarity around information such as a roadmap and details on budget allocation.  Finally, to turn this into an excellent proposal from an auditability point of view, I suggest providing more clarity around the challenges (and the proposed solutions) that you are likely to face in the future. The emphasis here is on the proposed solutions - this shows a maturity around your target state aspirations. ", "q2r": 4, "assessor": "z_assessor_586", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "Crowd-staking leverages the Cardano staking & Plutus SCs to eliminate the problems currently experienced with using the Esusu/Ajo system.", "experience": "Our Team has a combined experience of 35 years in blockchain, finance, machine learning, business analytics, African business & big data."}