{"id": 381275, "author": "amedina", "title": "Legal Framework for ICOs in US", "url": "https://cardano.ideascale.com/a/dtd/381275-48088", "category": 26235, "amount": 35000, "description": "Le gouvernement fédéral n'a pas réussi à créer un cadre permettant aux sociétés de crypto-monnaies de faire des offres de jetons sans coûts et risques juridiques extrêmes.", "funded": 1, "upvotes": 51444648, "downvotes": 28145846, "votes_result": 23298802, "votes_cast": 389, "f6_no_assessments": 7, "f6_rating": 3.761904761904762, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=8704"], "media": [], "f6_assessments": [{"q0": "Le défi consiste à financer des spécialistes capables de créer des lois plus favorables à l'espace cryptographique. Cette proposition répond clairement à ce défi, car l'auteur a un projet de loi bien conçu prêt à être remis au législateur californien. L'absence d'une \"sphère de sécurité\" aux États-Unis pour les projets DeFi est un problème grave qui paralyse l'innovation aux États-Unis et empêche les consommateurs et les investisseurs américains de participer à l'innovation blockchain et d'en bénéficier. L'ensemble de la communauté Cardano, et en fait, la communauté cryptographique mondiale, bénéficierait de cette proposition de loi. Si elle est adoptée, elle offrira aux projets DeFi un moyen légal et conforme à la réglementation de travailler avec les résidents de Californie. Tout développeur DeFi intéressé à construire un projet sur l'écosystème Cardano bénéficierait énormément de ce projet.  En ce qui concerne l'évolutivité, comme le mentionne la proposition, la législation adoptée en Californie aura un impact important sur d'autres États, et même au niveau mondial.", "q0r": 5, "q1": "En tant que directrice exécutive de la California Blockchain Advocacy Coalition, elle possède clairement l'expérience et l'expertise nécessaires pour faire pression en faveur de la législation proposée, telle que décrite dans la proposition. De plus, le fait qu'IOG ait déjà examiné l'organisation et l'ait rejoint en tant que membre apporte un soutien supplémentaire à ses références et à ses capacités. Ally a enregistré une \"conversation au coin du feu\" avec Tony Rose, chef de produit d'IOG Atala PRISM, dans laquelle elle a également démontré son expertise dans ce domaine.  Bien qu'il soit difficile pour une personne extérieure de savoir si le budget est raisonnable, il est clair qu'en tant que professionnelle expérimentée dans ce domaine, Ally a une bonne idée des fonds nécessaires, et il est significatif que le montant demandé à Catalyst ne représente que 10% du budget prévu.  ", "q1r": 5, "q2": "La proposition décrit clairement les feuilles de route et les étapes à franchir pour transformer une idée en loi. Bien qu'il existe un risque que le projet de loi ne soit pas adopté, l'investissement semble mérité étant donné l'éducation que les législateurs ciblés recevront concernant les crypto-monnaies en général et Cardano en particulier. Cette formation sera extrêmement utile, quelle que soit l'issue du projet de loi. L'idée d'inclure un siège au comité d'orientation du projet Catalyst est une manière innovante d'assurer une vérifiabilité permanente et de maintenir des liens étroits entre les efforts de lobbying et l'activité au sein du projet Catalyst.", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This project plans on changing legislature in one US-state to bypass SEC-regulations and make this legal solution accessible from other states. This might actually work temporarily, but could also upset the SEC so they go looking for other ways to crackdown on DeFi products through taxable events. Therefore the idea is not good, not bad. A long term solution should entail a solution across multiple states without being dependent on the legislature in just one state. ", "q0r": 3, "q1": "The proposal claims that IOG has joined this team. The funding requested through Project Catalyst is only 10% of the entire project budget. The rest is dependent on various businesses. In the budget breakdown there is mention of 50K USD going to 'political donations'. How is this to be understood? Are they bribes? ", "q1r": 4, "q2": "There is a roadmap, KPIs and budget breakdown in place, but there isn't much information present on who is currently seating in the team and what their functions are. The proposal needs a risk analysis and alternative routes on what to do if (part of) the funding isn't realised. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 23, "ne": 1, "ng": 18, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is very congruent referring to the challenge itself. With this we're really funding specialists who can help to create a friendlier environment.\r\n\r\nThe idea of making California a Safe Harbor independent from SEC is great. Since US is a continental country with a diverse people with different beliefs, it would be easier to breakdown a little bit and implement some regulatory legislation to foment the industry and market using crypto in just one state, and if this state is CA, the visibility would be enormous – which will incentivize other states and countries.", "q0r": 5, "q1": "The team seems cohesive and since IOG is already onboard I do believe that this group is capable of deliver. \r\n\r\nOne of my concerns is about the budget asked. I've understood that USS 35K represents 10% of the total amount needed, however is the whole funding, therefore if this proposal does not finish in first place it would not be funded. Maybe reducing a little the amount solicitated would help.\r\n\r\nOther financial aspect of the proposal is that it says that to get this going it is fundamental to have more partnerships and receive more funds. And since you don't know exactly if you will receive this amount, I understand that this project will not start. Another point is that we do not control whether you'll receive the total fund (350K)  in time to get this going before the political cycle (if there is such a thing – the point is that the timeline could be altered). That said, it could be helpful to add some risk mapping.", "q1r": 3, "q2": "In order to perceive the progress, the proposal says that it's going to be reported and the bills published. However, it would enrich the proposal if this bits were more detailed – where and how it would be reported, some platform? The metrics would be put altogether? ", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 21, "ne": 5, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Yes this challenge effectively addresses the challenge because lots of US companies may have difficulty crating ICO, and this proposal would allow less of a barrier to entry.", "q0r": 4, "q1": "The Blockchain Advocacy Coalition has a very good background and have done great work already on the ground in California like the Blockchain education day they created in 2018.", "q1r": 4, "q2": "I think they have a detailded plant, and detail on the way we could audit their progress with both the posts of the different drafts, and how far this makes it to legislation, and when it could or should get implemented. ", "q2r": 4, "assessor": "z_assessor_263", "no_vca": 22, "ne": 1, "ng": 13, "nfo": 8, "vca_o": 1}, {"q0": "The proposal aims to improve legislation in California (US) to make Initial Coin Offerings without the supervisory of the SEC possible. This helps local businesses to create ICOs more easily and less costly. Therefore the impact is rather local. Major legislation (like SPO relevant regulation) is not being addressed by this project. Still, changes could help thriving businesses to easier issue ICOs on Cardano (although the legislation approach is blockchain agnostic). ", "q0r": 3, "q1": "The project is pursued by the blockchain advocacy coalition and was handed in by Ally Medina, the Executive Director. They can be found on LinkedIn and seem legit. Still, there are a few things missing in this proposal. 1: the budget is not further defined. They need a total of 350k but only request 35k in Ideascale. Furthermore their interests are not entirely clear. As they are already pursuing the bill, who financed them so far? How much of the initial 350k is already financed? And for what exactly will the Catalyst funds be used? All of these questions remain unanswered. Although it seems likely they will further pursue the bill, it is not clear how Catalyst funds will contribute to that.", "q1r": 3, "q2": "The project provides clear dates for their timeline of the framework. If the bill passes the houses, the govenor will be signing the bill in Oct. 22. The initial problem and solution become clear. However, risks (such as opposing interests) are not addressed. ", "q2r": 4, "assessor": "z_assessor_380", "no_vca": 15, "ne": 4, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "Great idea and very needed bill to give entry to ICO participation. The proposal should consider company protection together with customer protection in CA.  ", "q0r": 5, "q1": "The team's approach is great and awesome to have community members leading a private bill initiate. With a clear definition of success, I think this proposal is achievable.", "q1r": 5, "q2": "The budget breakdown would have been useful to determine what activity would be funded at what stage. The overall work can be traced and however, the team should commit to documenting activities regarding the project. ", "q2r": 4, "assessor": "z_assessor_727", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "As this proposal focuses on only one state in the United States, I will say that this proposal misses a key Challenge metric, and doesn't aim to influence multiple jurisdictions.", "q0r": 2, "q1": "I can see the proposers are skilled for this proposal, however as the project budget substantially is higher than the proposal funding amount it is not clear if this funding would lead to a successful outcome at this stage.", "q1r": 2, "q2": "I feel adding items such as passing 1st and 2nd house and having a governor sign a bill into law is a very optimistic goal for a timeline. However it would be great to see such a thing take place. I would like to see more involvement in the writing of the bill and interaction with the Cardano community.", "q2r": 2, "assessor": "z_assessor_800", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "Adopter une loi créant une sphère de sécurité intra-étatique en Californie. Les entreprises pourraient offrir des jetons aux résidents de la Californie sans la surveillance de la SEC.", "experience": "A fait passer plusieurs projets de loi sur la blockchain en Californie et a servi de membre consultatif au groupe de travail sur la blockchain en Californie."}