{"id": 381955, "author": "shifu.brian666", "title": "Focus on MiCA regulation in the EU", "url": "https://cardano.ideascale.com/a/dtd/381955-48088", "category": 26235, "amount": 35000, "description": "Obtenir une législation favorable alors qu'il n'y a pas de vision claire de Cardano sur la législation qu'elle souhaite dans l'UE.", "funded": 1, "upvotes": 41073008, "downvotes": 28589074, "votes_result": 12483934, "votes_cast": 339, "f6_no_assessments": 4, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Oui, cette proposition relève efficacement le défi. Un examen rapide des sources internationales montre que les législateurs et les décideurs politiques ne comprennent pas pleinement l'opportunité présentée par l'espace cryptographique, je félicite donc l'auteur de la proposition pour l'idée de développer un cadre au sein de l'UE pour aider à combler cette lacune. Le développement d'un tel cadre dans ce contexte pourrait avoir un impact significatif en fonction de son degré d'exhaustivité et des voies par lesquelles il atteindra la table législative. J'apprécie que l'auteur de la proposition ait identifié un lieu géographique spécifique pour fonder la proposition et le cadre juridique qui en résultera. Ce faisant, il aide les électeurs à mieux comprendre les attentes, mais aussi les limites de la proposition. L'identification de textes législatifs spécifiques (MiCA et DORA) qui seront comparés au cadre juridique permet également de focaliser l'attention plutôt que d'être trop large et de dépasser les limites. Si la proposition est acceptée et que l'auteur est en mesure de la présenter aux tables et aux représentants appropriés, ce projet aura probablement un impact significatif.", "q0r": 5, "q1": "Compte tenu de l'expérience et du plan présenté, il n'est pas certain que la proposition puisse être mise en œuvre avec succès. Bien que je reconnaisse au proposant un plan bien conçu, la faisabilité de la réalisation du plan n'est pas facilement identifiable. La composante A (rédaction) semble assez simple et, compte tenu de l'expérience mentionnée, probablement réalisable. La composante B (obtenir le soutien des décideurs et des législateurs) est cependant une étape importante, mais il y a peu ou pas de détails sur la façon dont ces personnes seraient engagées, à quels intervalles, à quel niveau et pendant combien de temps. Les gouvernements sont souvent des entités monolithiques, opaques et lentes à changer. Par conséquent, pour évaluer la faisabilité, l'identification des acteurs clés au sein de ces institutions dès le départ donnerait aux électeurs une plus grande confiance dans la faisabilité du projet. Ceci est d'autant plus important que tous les représentants du gouvernement ne sont pas en mesure de faire avancer un tel projet, même s'ils font partie du gouvernement. De plus, dans la composante B, le proposant note qu'une itération constante sera nécessaire, mais il n'y a aucune indication sur la manière dont cela sera soutenu, par qui et pendant combien de temps. J'aurais aimé que le proposant fournisse également plus d'informations sur ses antécédents, y compris des liens vers ses références ; en l'état actuel des choses, nous devons nous fier à la parole du proposant, ce qui risque de dissuader de nombreux électeurs. Le budget laisse également à désirer et il est difficile pour les électeurs de comprendre comment le proposant a atteint le montant spécifique. Pour ces raisons, je ne suis ni d'accord ni en désaccord avec la faisabilité de cette proposition, mais en cas d'échec, la résolution de ces problèmes lors d'un prochain cycle de financement augmenterait certainement le score.", "q1r": 3, "q2": "Malheureusement, je ne pense pas que l'information soit suffisante pour vérifier les progrès et le succès de la proposition. Il n'est pas clair comment la communauté serait en mesure de vérifier le succès de la proposition pour déterminer si elle valait l'investissement. Il n'y a pas de véritables indicateurs clés de performance, de calendrier ou de feuille de route pour la mise en œuvre de la proposition. Étant donné l'environnement très obscur de la rédaction des règlements et des lois, il n'est pas clair comment le succès du projet pourrait en fait être mesuré. Si le document est rédigé et fourni aux législateurs/décideurs, est-ce un succès ? Et s'il est accepté mais non utilisé ? Comment la communauté fera-t-elle le suivi pour savoir quel impact elle a eu sur les résultats de la législation ? En outre, aucun calendrier n'est fourni, ce qui laisse les électeurs se demander combien de temps un tel projet prendrait. En tant que conseiller politique, je sais que ces délais s'étendent souvent sur des années et comprennent de nombreuses itérations qui échappent à l'attention du public, mais ce point n'est pas abordé ici. Je me demande donc si le proposant, ou la communauté, pourrait même participer de la manière expliquée dans ce document. Enfin, un montant important de l'argent est destiné à l'achèvement des travaux, mais il n'y a pas de ventilation des activités au sein de chaque composante, laissant les électeurs écrire essentiellement un chèque en blanc, mais sans moyen de le suivre. Bien que je soutienne vraiment l'idée derrière la proposition, il n'y a pas assez d'informations pour avoir la confiance que la communauté pourrait vérifier adéquatement la proposition.", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Documenting the Cardano vision in terms of legislation would provide the ecosystem with a common goal to work towards and guidance for lobbyists deployed at governments. It will also create a legal basis to research and refine so potential options and paths will become clear. You could look at it like a form of legal planning. This is of great importance because if there is no legal framework to operate in, there cannot be large scale adoption. This proposal could be extended in the future to other economic powerhouses in the world and create a global legal framework with subsections for each powerhouse. ", "q0r": 4, "q1": "Given that a legal framework has been brought up a couple times in the recent past and has created  doubt for certain project's abilities to be executed, there is a need for this as soon as possible. The relevant experience of the proposer is excluding the legal support that is needed, but the proposer intends to assemble a team of experts which is bound to gain some traction. Collaborating with other proposing groups in this challenge could improve chances of getting this done. ", "q1r": 4, "q2": "The main plan is explained in the proposal and the author has defined the goal of this proposal, but it does not have a clear plan of action (roadmap) in place for the community to be able to check the progress in case of funding. Nor does it specify when the documents would be ready for use, although I am convinced that as legislations change all the time, there will be a need for constant updates. ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 24, "ne": 4, "ng": 20, "nfo": 0, "vca_o": 1}, {"q0": "It is logically consistent that to lobby for favorable legislation, it is necessary to understand strategic goals and direction.", "q0r": 5, "q1": "Will the outcome of Goal A be the creation of a Global Cardano regulatory vision document, with EU-specific components? If so, the proposal does not lay out a progressive detailed plan to achieve this document, therefore confidence in achieving Goal A and B are lower than highly likely.", "q1r": 2, "q2": "Operating from the perspective that this proposal exists to deliver Goal A and Goal A is achieved by the delivery of a Cardano regulatory vision document, the specific, measurable, time-fenced, auditable plan is not in this proposal and therefore cannot be audited by the community in order to determine progress or likely success.", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "Great idea. I buy into the vision of global Cardano vision on regulation. I share in the principle of making clear what regulation on regulation we want for the Cardano ecosystem rather than waiting on politicians to impose one on us. This is brilliant and it is very focused and gives confidence at the lobbying table since it proposal clear what we want. Also, try building cooperation with Crypto 4 EU since both are aiming to work in the same region. I would like to see this proposal get support it needs. ", "q0r": 5, "q1": "The team has great lobbying experience. Having skin on the table is great to have a starting point in the regulatory space and demonstrate commitment to compliance. \r\n\r\nI think the plan is achievable with clear and practical outcomes. ", "q1r": 5, "q2": "Gaol and A and B are focused and transparent which would be easy to track and audit. The activity is precise and clear. I think the proposal should be given the support it needs. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "Documenter d'abord une vision globale claire de Cardano sur la réglementation et ensuite une vision réglementaire de l'UE, en tenant compte de MICA, DORA et autres.", "experience": "J'ai passé 15 ans dans le domaine du risque et de la conformité pour des institutions financières, dont plusieurs années en tant que responsable du risque et de la conformité pour des Fintechs."}