{"id": 382677, "author": "favourse.com", "title": "Co-Creating Events Together", "url": "https://cardano.ideascale.com/a/dtd/382677-48088", "category": 26234, "amount": 12000, "description": "对于Cardano/Catalyst社区和新人们来说，没有简单的方法来相互联系，建议和投票来共同创建活动。", "funded": 1, "upvotes": 48048679, "downvotes": 10864805, "votes_result": 37183874, "votes_cast": 290, "f6_no_assessments": 9, "f6_rating": 4.481481481481482, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=17154"], "media": [], "f6_assessments": [{"q0": "这个想法很符合挑战赛的目标，因为它试图创建一个在线平台，在这个平台上，Cardano社区的不同成员（他们说他们专注于利益相关者）以及新加入社区的人可以以简单的方式建议、对话和建立活动。我认为这很有趣，因为事实上，没有一个地方可以做这种组织。但我有几点看法；首先，现在已经有很多工具，如Miro和Jamboard，不同的人可以在网上互相合作，并以视觉和直观的方式显示信息。如果作者能论证一下为什么他们的平台是不同的、更好的，那就很有意思了。众所周知，这个网站已经存在，而且顺便说一句，它非常漂亮；作者说，社区外的一些活动（哪些？如果这些事件中有一些被举例说明，如果他们更多的澄清，因为Favorse比其他预先存在的工具更实用、更容易、更优越，如果这个网站可以做视频通话、附加白皮书、可视化集会等，这将是有益的。我想到的另一个问题是，在提案的过程中，他们打算达到一个发展水平，即网站用户自己可以对项目进行投票、投资等；这让我有点担心，因为这可能会与Catalyst自己的活动稍微混淆。我不知道这是否一定会是一个负面的观点，但我们正在努力改善催化剂，我不认为将活动外包给另一个平台是团结社区和产生具有影响力的项目的最佳方式。但这只是我的看法，总的来说，这个想法确实与这个挑战中的要求对话。", "q0r": 3, "q1": "作者通过对每个人的个性化细分，有很多关于他们自己的信息，随后也有他们在社交网络上的资料链接。另外，如果我们进入所提供的网站，你可以看到这一点，有一个介绍团队的部分，有照片、姓名、角色和Linkedin简介。因此，我们在这方面并不是无能为力的。根据网站上提供的信息，我相信他们准备得很好，甚至因为网站本身做得很好，有一个易于浏览和美观的界面。关于脚本，他们包括对前六个月的解释，以便我们清楚地知道每个月将开展什么活动，谁将做什么，以及在这段时间内预计会产生什么。在这一部分中，我认为我们得到了足够的信息，以便对项目的实践有一个坚实的认识。在财务方面，他们也提供了一个令人满意的细目，我们知道谁会得到多少钱，为什么，尽管我认为每个工作主题可以进一步解释。例如，设计创作会是什么样子的？他是否会直接与公众一起做研究，是否会根据以前成功的项目来组装界面？我注意到的一点是没有用于营销的货币部分，我想了解他们将如何推广这个项目，因为如果目标是为社区成员和外部人士创造一个合作空间，这些人如何知道这个平台的存在？在我看来，这和产品开发本身一样重要。", "q1r": 4, "q2": "作者提供了几个可以分析的主题，以行使良好的可审计性，如平台上参与者的数量和多样性。将这些数据组织起来并展示给Cardano社区的其他成员，以验证该项目是否真的成功，这将是非常重要的。另一点是让一些人参加这些集体会议，目的是分析他们的运作情况，也是为了检查那里计划的活动是否真正付诸实施。我相信这是一个非常可能的监测项目，既要监测网站本身，也要监测所创建的活动（它们是否有组织，是否有合法的影响力，等等）。对我来说，这个主题在提案中做得很好，尽管作者为我们提供的关于跟进项目的可能方式的信息不太广泛和详细。", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Favourouse背后的项目团队提议创建一个网络工具，鼓励共同创造事件，在想法形成的最初阶段为创造者提供有用的客户或潜在客户洞察力。像Favourouse这样的应用程序将为Cardano生态系统增加价值，通过开放机会，从更广泛的受众中获得反馈，并在想法形成的初始阶段提供Cardano社区以外的人的支持，以及为人们提供资金或从有关方面寻求资金的潜力。\r\n\r\n像这样的应用程序有可能迅速超越旧的众筹平台，如Pozible，仅仅通过有想法形成和想法测试和共同创造的框架作为平台存在的基础。他们在申请资金时提供了一个原型，并包括了大量关于他们如何看待该平台用途的信息。\r\n\r\n这种平台可以鼓励全球合作，并为新的想法、事件或企业提供指标，以寻找其目前范围以外的受众。反馈指标的设计是可以看到提供反馈的人的位置，因此，用户可以看到他们的潜在市场可能在哪里，甚至发现合作者和可以一起工作的人。", "q0r": 5, "q1": "这个项目背后的团队已经清楚地展示了他们的技能，并围绕他们的技能和经验提供了大量的透明度。有些人很年轻，但仍然相当成熟和有经验。鉴于该团队包括项目经理、开发人员、设计师和营销人员，执行该项目所需的技能组合是适当的。\r\n\r\n\r\n要求的预算是适度的，并且清楚地分解了。时间表和路线图很清晰，每个月的里程碑都清楚地说明了。", "q1r": 5, "q2": "社区可能很难看到项目的进展，因为这六个月的大量时间都花在开发平台Favourouse上。唯一可以缓解的是，这个网站当然会被社区访问，他们可以在那里看到更新。\r\n\r\n\r\nKPI的设定是基于完整版的成功交付，除了正在寻求的开发资金外，还需要营销的预算。我觉得这些KPI更多的是与这个项目的次级阶段相联系，而不是这个开发和测试阶段。如果能看到类似于他们的平台所提出的共同创造这个平台的方法将是有利的，在这个平台上，可以确定多个用户群，并因此与之接触，为平台的发展做出进一步的贡献。", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "An element of this challenge is about meaningful and active participation in events. This proposal perfectly meets this objective through developing events from idea to implementation by the community.\r\nThe proposal is extremely well presented and simple to understand. Voters should take a look at the short video and the demo (for a deeper dive read the white paper). Having many year of experience of setting up events (mainly through eventbrite) without actually knowing if the demand or participation will be there it is refreshing to see this proposal. The one piece for the proposer to address is around how to ensure the platform and the funding is used to focus on Cardano/Catalyst events. They should address this in the comments and in any further presentations they make (eg at ideafest) ", "q0r": 5, "q1": "Based on the funding requested and scope of work for the 1st 6 months it is highly likely that this proposal will be successful. A prototype is already in place, a team is engaged and active and covers both technical and non technical skillsets. The deliverables are not overly ambitious or complicated. \r\nThe proposal also builds in a feedback loop to help develop their roadmap, so i suspect we will see this team return for further funding in a later fund.", "q1r": 5, "q2": "The KPI and milestone are simple and clear. However i would like to have seen the key metrics defined as Catalyst/Cardano specific, at the moment they are quite generic.  ", "q2r": 4, "assessor": "z_assessor_45", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely there is no easy way for the Cardano/Catalyst-community & new people to connect to each other, suggest & vote for events to be co-created\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief by creating a platform that allows anyone to easily create ideas for events, vote for, get feedback and co-create events together\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating a platform.\r\n\r\n \r\n  Key metrics  would be  number of events, number of participants, number of new proposers  , number of voters, no of students. \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more ideas for events which can be voted on.  \r\n\r\n \r\nThis project will have a positive impact on Cardano system by increasing the collaboration between community members to build this platform and develop ideas for events. \r\n\r\n\r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 4 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.", "q0r": 4, "q1": " \r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  various blockchain related projects. \r\n  \r\n The links are sufficient.  \r\nI have visited these links and contacted the relevant people\r\n   \r\nThe proposers are well experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is stated.\r\n \r\n \r\nThe team structure is listed and experienced.\r\n  \r\n The budget has   been given in detail. \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n \r\nTheres a realistic timetable  to complete the work \r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\n\r\nResources  necessary to implement the proposal are described.    \r\n\r\nThe proposal has technical aspects which have been addressed \r\n\r\nThe proposer has  not identified risks in this proposal\r\n \r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\n\r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 4 star rating.   ", "q1r": 4, "q2": " \r\nThere is a clearly laid out roadmap with milestones  \r\n \r\n There are  Metrics such of number of participants a and number of presentations and discussion rooms, number of courses, no of schools, no of universities, no of graduates, no of proposals.\r\n \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n\r\n The proposer has not identified possible hurdles, challenges and difficulties other than what would happen if he werent able to do this in future. He has a solution for that which is creditable\r\n  \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 15, "ne": 4, "ng": 5, "nfo": 6, "vca_o": 1}, {"q0": "A very interesting proposal that somewhat resembles a gig economy where demand and supply of a certain expertise is created organically. This creates a healthy situation where the demander pays an agreed amount to the supplier of an expertise and the interest can truly be measured for it is pre-determined. Which can also act as an indicator to sponsors/voters (brands, CSR programs, Project Catalyst etc.) that this event is worth funding, for the engagement metrics are more measurable. And because of this feature, it fits well into almost all the metrics of the Challenge setting. Taking another example besides voter-proposer participation, such as keeping the community  together. Because individuals can request an event to happen, where they also offer compensation to be agreed upon, sustainability and relation building between parties involved is therefore achieved. A healthy dynamic between demand and supply is created. Though the problem statement this proposer puts up, does not do justice to what the proposer has created. There is more to this proposal than stated which unfortunately will not be conveyed well in the voter app. If not funded, please do come back and take more into consideration the voter app structure.", "q0r": 4, "q1": "This proposal develops on what the proposer has already created and is already operational. What differs or added on to is their effort to also onboard and educate on Cardano while at the same time integrating their workflow with Project Catalyst funding in collaboration with the Cardano community. The budget provided although detailed it took time to correlate that this budget is for 6 months. If it were clearly stated it was for 6 months, in comparison to the total funding requested, this proposal could be categorized as low risk and high impact. The implementation plan is also clear. Unfortunately, what has not been calculated is the potential risk and challenge this proposal might face, which most likely be marketing to and educating of the community. This though is in-directly answered by the allocation of individuals and budget for marketing and educating. By taking all above consideration, this proposal is very likely to be successful.", "q1r": 5, "q2": "The roadmap is clear, an added information of who are the individuals that will take action during certain phases of the roadmap also helps with auditability. KPI's are easily measurable, something that is very rare. Though there are no milestones provided. Together with a problem statement that could be improved upon, although it interconnects well with solution,  these shortcomings are the reason this proposal in this section receives a 4-star rating.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 19, "ne": 7, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is great, I can see the idea. The problem is clear and suitable to the given challenge.\r\nThe solution is clearly defined, fits the challenge, with clear detail of: roadmap (with KPIs), team's ability,...; this gives a clear impact on the Cardano ecosystem in short term and long term. \r\nTherefore, I strongly agree with this proposal's impact, and can rate it with a score of 5.", "q0r": 5, "q1": "Description of team's profile, current works of the team shows suitable skill, experiences for successfully implementing this proposal. The budget is provided with structure and explanations of the calculation base. However, potential risks/ challenges are not defined. Therefore, based on the given information I,  agree with this proposal's feasibility, and  I would rate it with a score of 4. If the risks (and mitigation) are defined, I would strongly agree and give 5 points.", "q1r": 4, "q2": "There is a lot of information provided. Team profile is clearly described with resources/proof (documents/links,...) for verification. Total is presented in detail (with clear structure and explanation of calculation base). Besides, the roadmap is clearly described with KPI/ metrics (100 % of that is measurable)\r\nTherefore, I strongly agree with this proposal's auditability, and I can rate it with a score of 5.", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The idea is great and would be helpful for event organizers. However, with the creation of the platform, I think the proposal should have been in a different challenge other than Community Events.", "q0r": 4, "q1": "The team has individuals with great developer experiences. The proposal details plans and having created the prototype already, I believe the project would be a success considering the KPI are specific and measurable. ", "q1r": 5, "q2": "The proposal has factored in transparency and documented process, this proposal can be tracked for easy auditing.", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Creating a platform to assemble community members to connect with each other, develop ideas for events, solve problems together and initiate collaboration is a great way of adding value to the cardano ecosystem. Ideally this will also increase the community engagement.", "q0r": 5, "q1": "The proposal has experienced personnel and also has a work breakdown structure designed from the start to the end of the proposal. Also, the target audience is well indicated and there is a well-developed timeline for the proposal. Aside that, there are well outlined events scheduled within specific timeline for the project. Finally, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake.", "q1r": 4, "q2": "The project provides a metric to monitor and track the progress and success of the project. For instance, the project has an outlined number of people it expects to participate in community organized events, targeted number of participants/users on online platform and the number of idea-events created.", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 16, "ne": 4, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The Proposal is about creating a platform where community members can put forward an idea for something, and then have others support, vote for or get feedback on the idea. It could be a great platform, and does support the Challenge brief. The Key metrics directly addresses that of the challenge, like increasing participants in community events, and the number of community events. ", "q0r": 5, "q1": "The Team presented has impressive experience and skill sets, links are provided to their LinkedIn accounts. The proposal sets out what each team members' part will be in the project. The budget is set out and stretches over a 6 month period in which they want to have the platform ready, and being tested. Each Team member has his part to play in this proposal and it is set out also in the budget. Risks are not specifically addressed in this proposal. ", "q1r": 4, "q2": "Key Metrics are listed and includes participation in community events, number of people that participated in community organized events, number of participants/users on platform etc, and they all have target numbers next to them. This could be used to track the success of the project. As soon as the platform is working it will be easy for the community to track the progress and success. I am not sure how will the community be able to track the progress until then, as this is not mentioned.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}], "solution": "一个允许任何人轻松创建活动创意、投票、获得反馈和共同创建活动的平台", "experience": "团队在组织和促进社区活动、项目管理、内容创作和市场营销方面有丰富的经验。"}