{"id": 383315, "author": "iosman", "title": "Africa's reliance on donations", "url": "https://cardano.ideascale.com/a/dtd/383315-48088", "category": 26234, "amount": 100000, "description": "尽管非洲是地球上最富有的大陆之一，但它主要依靠捐赠来生存。技能和资源的目的是为了融资", "funded": 0, "upvotes": 16694738, "downvotes": 27111496, "votes_result": 10416758, "votes_cast": 246, "f6_no_assessments": 14, "f6_rating": 1.4047619047619049, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims to build and market a d'app, so it should have been added to the DApps & Integrations challenge and set aside a portion of its budget towards marketing, even if the intended marketing strategy means demoing it first in smaller communities. Highly suggest resubmission in a different category with additional information.", "q0r": 1, "q1": "The description is too generalised: how many developers, with what type of skills would it take to complete this d'app and in what timeframe? The budget of $100000 is not detailed, and there is no timeframe or launch date of the product/demo. The proposer hasn't described his professional skills or his prior knowledge at all, so it's impossible to say whether he has any experience with such projects.", "q1r": 1, "q2": "The proposal is very brief, and much too generalised. We are offered no description of how many people would need to work to implement this, and for how long, as such the proposal cannot be evaluated properly.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 23, "ne": 3, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "This proposal problem statement and solution are not aligned with the challenge. This proposal should be placed in miscellaneous challenge. Moreover,this proposal did not provide information on how it will provide value to Cardano. Also, there are no key metrics and goals presented.", "q0r": 1, "q1": "The proposer did not provide evidence of relevant skills and experience needed to implement the project. Furthermore, the proposer did not provide the required manpower and resources to successfully implement the project. Moreover, there are no budget presented in this proposal. \r\nIn addition, without any budget breakdown, it will be hard to assess whether the budget requested are reasonable to achieve the set goals. On top of that, this proposal did not provide a sensible and conductible plan for implementation. ", "q1r": 1, "q2": "This proposal did not provide a roadmap with milestones and a time horizon for achievement. Moreover, the proposer did not provide any key metrics and KPI that define the success of the proposal. Furthermore, the proposer did not provide any platform for the voters to keep track of their progress.", "q2r": 1, "assessor": "z_assessor_357", "no_vca": 23, "ne": 0, "ng": 14, "nfo": 9, "vca_o": 1}, {"q0": "This is just an idea not a proposal The idea itself is not a practical one and no details have been given as to how it meets the Challenge goals.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.I have done live event with guests in studio, discussing various topics on the State Broadcasting Channels for both National and International audiences.\r\n", "q0r": 1, "q1": "\r\nNo profiles or experience of team members are given, no budget is given, there is no breakdown of costs or anything at all\r\nI cannot give this anything other than a 1 rating", "q1r": 1, "q2": "\r\nThere is no timeline of activities, measurable metrics or KPIs or anyway to audit anything. There are no contingency plans, no auditable reporting or anything that can be tracked or assessed. I can only give this a 1 rating", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 19, "ne": 1, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "The proposal seems to be in the wrong challenge.  This proposal has nothing to do with community events. \r\n", "q0r": 1, "q1": "There is mention of Grameen bank under experience, but it isn't clear the author of the proposal is affiliated with the bank.  The detailed plan section is very cursory.  The budget is very expensive at $100,000.  \r\n", "q1r": 1, "q2": "No KPIs or other success criteria is provided. ", "q2r": 1, "assessor": "z_assessor_607", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "Unfortunately this proposal is submitting in the incorrect Challenge setting. The proposer should have submitted into the 'DApps and Integration' Challenge setting. The intent of this proposal on paper is noble but there are numerous glaring gaps; from relevant experience, to providing roadmaps and milestones, to providing detailed budgets etc. 2 (two) recommendations to the proposer, which are to seek out WADA (a vibrant and credible Cardano community from Africa) and Catalyst School (to learn how to submit a proper proposal technically and strategically).", "q0r": 1, "q1": "Although this is the wrong Challenge setting, hopefully by providing assessments based on data available will assist the proposer in future efforts. Experience provided does not correlate with the solution intended. Reckon to provide relevant experience and links that verifies those experience as this is one of the key metrics. Again, please seek out Catalyst School, at the minimum to view the various videos related to submitting a proposal.", "q1r": 1, "q2": "There are no roadmaps, no metrics and no measurable KPI's. Although there is a problem statement, it is not concise. It does though share a correlation with the solution. In the other hand the solution is quite clear and would easily be understood by voters. From these 2 (two) elements of the proposal, there is potential for future growth. Again, please do Google these keywords; WADA Cardano and Catalyst School Cardano to learn more about Project Catalyst and all it's caveats.", "q2r": 1, "assessor": "z_assessor_635", "no_vca": 22, "ne": 3, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "\"African dependent on donations to survive although it is among the richest continents on earth is a big deal. Because when a continent develops based on charity money from other organizations and other countries is an unsustainable development. Providing microfinance to small projects and promising talents through a dapp built on cardano is a good idea to solve this problem. But in my opinion, this proposal should be included in the Dapp challenge, it will be more appropriate.\r\nIn order for the proposal to be successful and have a significant impact, the team should come up with a specific solution and plan rather than an idea like this.\"", "q0r": 1, "q1": "\"Grameen bank offers free support to people worldwide who are aiming for establishing a similar organization that offers microfinance. But the proposer does not include the team's experience in this proposal. Are you a member of Grameen bank? Or what experience do you have in Grameen bank to support small projects?\r\nBesides, the project did not offer any solution to that problem statement. Therefore, this proposal is not feasible\"", "q1r": 1, "q2": "\"Proposal is intended to do the following:\r\nRecruit developers to setup the dAPP\r\nVisit countries like Sudan, Ethiopia to start marketing the idea\r\nEstablish a demo in one village and then rule out to the rest of the country\r\nand need $100,000 for these without a budget breakdown.\r\nNo plan, no key metrics, no roadmap. So it can't be audited\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about providing microfinance to small projects and promising talents through a dapp built on Cardano. It seems that this proposal is incomplete. Conceptually, I think it has a certain fit for the challenge, and has a satisfactory and has potential impact if completed. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1.", "q0r": 1, "q1": "It is hard to assess an incomplete proposal [with limited team information, no roadmap or KPIs, and of course the risk is not defined]. Therefore, I strongly disagree with this proposal's feasibility, and would give it a score of 1.", "q1r": 1, "q2": "For an incomplete proposal like this, auditability can't be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 19, "ne": 0, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "As the aim of the proposal is to provide micro finance to small projects and promising talents through a Dapp built on Cardano, the proposal fits into the challenge settings and once achieved will bring a positive impact to Cardano.", "q0r": 4, "q1": "It is difficult to ascertain the relevant skills and experience of the proposer for the implementation of the proposal. What is lacking is a team for the proposal. The budget is poorly presented, it should have been broken down into identifiable items. The plan of the proposal: recruit DAPP developers among others carries the potential  of a successful implementation. The proposer has not considered possible risks/challenges involved in the implementation of the proposal.", "q1r": 3, "q2": "There are no milestones and time horizon for implementation. Also metrics/KPIs are not outlined. However, the targeted problem is well described and the solution as well just they are not detailed enough.", "q2r": 3, "assessor": "z_assessor_717", "no_vca": 11, "ne": 1, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "Great idea, however, I think the proposal is in the wrong challenge. The idea might be a great fit for Nation Building DAPP. ", "q0r": 2, "q1": "I don't think the proposal has enough strategies for successful implementation. There are no measurable outcomes. The experience of the team is not detailed enough to assess.", "q1r": 2, "q2": "There is no budget breakdown or documentation of activities to help track and audit.", "q2r": 2, "assessor": "z_assessor_727", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "it is a very good idea to envision a dAPP for micro finance in Africa. the only problem here is that the proposal does not address this particular challenge. ", "q0r": 2, "q1": "this is a good work but the relevant experience is not well stated and do. More information is needed to make to authenticate a successful implementation of this project", "q1r": 2, "q2": "the proposer will need to provide more information to enhance audibility", "q2r": 1, "assessor": "z_assessor_728", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The problem is not well defined; however, the attempt to deploy dapps to solving the challenge suggested indicates the willingness to contribute to the cardano ecosystem.", "q0r": 3, "q1": "There is no work breakdown structure for the proposal. Also, with the exception of hiring developers of the dapps platform, the proposal fails to provide a well-developed timeline and a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Aside that, the proposal failed to capture its target audience. Finally, the experience of the team lead is not adequate for the successful implementation of the proposal.", "q1r": 2, "q2": "The details required in respect of metrics to gauge and track the progress and success of this proposal when funded is not sufficient", "q2r": 1, "assessor": "z_assessor_732", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "this proposal has a good idea but the problem it seeks to solve does lie in the domain of this challenge. Besides it is not clear what it impact on the Cardano as far as this challenge is concerned.", "q0r": 2, "q1": "the proposal has not given evidence of an experience to implement the proposed idea. the needs to be broken down in accordance with a plan. Idea lacks metrics of success making implementation quite unsure.", "q1r": 1, "q2": "With the unclear nature of metrics of success, plan of execution, what to expect as success and the bulk nature in which the budget was stated, auditing can be challenging.", "q2r": 2, "assessor": "z_assessor_733", "no_vca": 15, "ne": 0, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "The proposal doesn't really address any of the objectives of the challenge, which is about community events. Furthermore, the proposal should be in dapps challenge.  The idea does seem sensible just needs fleshing out.", "q0r": 1, "q1": "Unable to assess the feasibility of this proposal, $100K has been asked for but no details on plans, deliverables, resources and budget breakdown have been provided. ", "q1r": 1, "q2": "Unable to assess this section as no metrics, KPIs, risks etc have been articulated. The score reflects this. \r\n", "q2r": 1, "assessor": "z_assessor_774", "no_vca": 18, "ne": 2, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "I strongly disagree that this proposal is addressing the challenge \"Community Events\" since it aims to microfinance to small projects  by building a Dapp on Cardano. ", "q0r": 1, "q1": "Since this proposal is not addresses the challenge. I rate its feasibility the lowest score of 1.", "q1r": 1, "q2": "Since this proposal is not addresses the challenge. I rate its autability the lowest score of 1. I hope that the proposer could put the proposal into the right category in the future.", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 17, "ne": 0, "ng": 10, "nfo": 7, "vca_o": 1}], "solution": "通过一个建立在Cardano上的dapp，为小项目和有前途的人才提供小额贷款。", "experience": "格拉米银行向全世界旨在建立类似组织提供小额信贷的人提供免费支持。"}