{"id": 383707, "author": "cornl", "title": "Cardano local live events - Poland", "url": "https://cardano.ideascale.com/a/dtd/383707-48088", "category": 26234, "amount": 10000, "description": "在波兰，确实 \"需要 \"现场的本地加密货币活动。为什么不在Cardano品牌下？让我们一起普及我们最喜爱的生态系统吧", "funded": 1, "upvotes": 36610960, "downvotes": 17861718, "votes_result": 18749242, "votes_cast": 276, "f6_no_assessments": 13, "f6_rating": 3.6410256410256414, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal definitely fits with the challenge category. That is too bond local community together and attract more local people to engage in Cardano & Project Catalyst. Moreover, Kornel is also Cardano Ambassador for his country, so he knows better the local community there. This event could increase reach for bigger audience in his country.", "q0r": 5, "q1": "Given by the experience as Cardano Ambassador and as event speaker, Kornel could make this proposal running for sure. It would be great if the proposer could define the budget break down in the proposal. And for how many events this budget will last. In addition, it would be great if the Kornel could put his LinkedIn account (for credibility) and also include team member to make sure the project could be run properly if funded.", "q1r": 4, "q2": "As what Kornel said in the proposal, the community could check Cardano social media or website maybe? It would be nice if the proposer could include link where the community later on can track the project progress. And also, Meetup event or event summary in Cardano Forum would be great also to give information to the community.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 18, "ne": 1, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "\r\n\r\nThe problem needing to be solved has been identified and articulated namely there is a real \"need\" of live local crypto events in Poland.\r\n \r\nIt is  clear that this proposal falls within the scope of the challenge brief by organizing local events throughout Poland with guests, aimed at regular crypto enthusiasts, traders, people who \"heard\" but never \"experienced\" crypto.\r\n \r\nThis proposal does  show  how it adds value to the Cardano system by enabling people to meet, discuss ideas + learn about Cardano + Catalyst\r\n \r\n  Key metrics  have  not been stated.  If i was to say they could include # of attendees,    # of wallets created,   # of IdeaScale accounts created, # of subscribers to Cardano community channels, # of social media tweets, RT and shares, # of proposals into Catalyst from being onboarded via this event, # of proposals in Polish with the help of this event, # of people onboarded into the Catalyst communities via this event\r\n \r\nThe key metrics and goals fall within the scope of the challenge\r\n   \r\nProposal can possibly scale up by having more events. \r\n\r\nThis project will have  have a positive impact on Cardano system by creating better awareness and involvement by Polish people.\r\n\r\nI can say that this proposal   adequately addresses the challenge hence i have given it a 4 star rating.\r\n \r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.I have done live event with guests in studio, discussing various topics on the State Broadcasting Channels for both National and International audiences.", "q0r": 4, "q1": " \r\n \r\nThe proposers  has  provided  evidence  of themselves with their skills and experience in management of such events. His name is  given and  profile links on Linkedin are not given. He states that he is a Cardano Ambassador but there is no way I have to verify this.  \r\n \r\n The links are not sufficient. \r\n \r\nI have not visited the links.\r\n   \r\n The proposer is experienced and competent to do the project.\r\n\r\n \r\n The type and number of team members required to implement the proposal is fully known\r\n\r\nThe team structure is listed along with various partners.\r\n  \r\n The budget has  not been given in detail but the details of the various cost centres are given.  \r\nThe budget is reasonable to achieve the set goals.  \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required\r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n\r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\nThe proposal  gives a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are  described.   \r\n  \r\nThe proposal has technical aspects which have been addressed \r\nThe proposer has  not identified risks in this proposal. He should ideally identify Covid 19 risks, and put into place safeguards and protocols. \r\n \r\nGiven experience and plan presented it is highly likely this proposal will be implemented successfully. \r\n\r\n\r\n This proposal is well expressed  hence I have given it a 5 star rating.   \r\n\r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n", "q1r": 4, "q2": " \r\n \r\nThere is a clearly laid out roadmap with milestones  \r\n \r\n There are no Metrics listed.  \r\n   \r\nThe problem has been  understood  \r\nThe proposer has not identified possible hurdles, challenges and difficulties. These would  primarily relate to Covid restrictions in relation to events and numbers.  \r\nIdeally he should make plans\r\n\r\nThere are no contingency plans in place for various outcomes.\r\n\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\nThe information provided is sufficient to audit the progress and the success of the proposal  hence I have given it a  4 star rating.\r\n ", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 19, "ne": 5, "ng": 5, "nfo": 9, "vca_o": 1}, {"q0": "The proposal addresses the challenge as it creates an opportunity through which Cardano community in Poland will gather to share experience about the ecosystem, but also for newbies to learn about Cardano. Through such events, new Cardano teams may be created throughout Poland in various cities and regions.", "q0r": 5, "q1": "The implementation plan is clear and cities where events will be taking place already identified. The proposer is a member of the Cardano community for a long time  and has  already applied and succeeded to get funding in a previous funding cycle. Other than having a group, the proposer rely on its contacts and network as a crypto magazine editor in his country (Poland ) to get people who will join him implementing the project.\r\nHowever, host big events in 8 cities may be a challenge, since realities in each of those cities may be different, and have resources and logistics ready for each of them, may sometimes be hard. \r\nI would suggest to host few events, and invite participants from various cities who will be ambassadors for the Cardano ecosystem in their respective neighborhoods. The proposer would then rely on those ambassadors to organize future events and support it.\r\nEven if the proposer doesn't plan to pay a fee for presenter, I would suggest to prepare a least allowance for those presenters and some others community members who'll be involved in the planning committee. This because some of them will be travelling in far cities and may have some extra expenses, and also for the new folks, they'll get an opportunity to open up a Cardano wallet and have their first ADA to stake.", "q1r": 4, "q2": "The progress is well defined and the community can track what's taking place. The proposer is suggesting to publish the achievements via the Polish Cardano Center website or simply via local Cardano social media pages.\r\nVideos and images of events will be public .\r\nThe KPI are clearly detailed. \r\nNo challenges were raised by the proposer, but I still think hosting these in these many cities on that period of time may be overwhelming to the organizers. Step by step process may be more efficient.", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 14, "ne": 7, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal dialogues well with the objectives of the challenge, however, I thought that the author does not argue very well why Poland is a strategic point for holding such events, in the first place. In one section of the proposal, he cites that the country has a lot of cryptography enthusiasts and that \"crypto companies that keep growing in Poland very fast, the main exchanges where the ADA is listed\"; I would like to understand which companies they are, see some surveys that justify this point or other ways of realizing what he says in reality, because, for people who are not from the country, this reality is totally unknown. It would be good if we had some data supporting their lines. Another point is that the author does not seem to have clearly defined who would be the speakers at these meetings; during the proposal he says that there are certainly experienced people prepared to talk about Cardano and blockchain. However, I follow the same thought as the point previously analyzed: it would be important to know who these people are, to have names, to understand what each one does, in which city they would appear, which subjects are covered by each... In other words, a more notion solid knowledge of who these people are, in order to convey more confidence in the team involved. Although the idea fits well with what we are looking for in the challenge, that is, promoting events that increase the reach of the Cardano ecosystem, both in terms of engaging current participants and attracting new ones, I believe that the construction of the proposal left some very abstract points, so as not to transfer as much confidence in the project's success and validity.", "q0r": 3, "q1": "The author doesn't give much detail about himself. It is known that he is in the healthcare area, and he claims to have explored the cryptographic world since 2017, having a relationship with Cardano since 2018. But how, exactly, does he relate to our ecosystem? I don't understand if he has already launched proposals before, or if he makes use of blockchain technologies without necessarily participating in Catalyst... This bridge was very undefined, unfortunately. I would also like to know how his previous work in medicine has contributed to the current understanding, how he manages to merge the two areas in order to generate positive impacts. As for the rest of the team, as I said in the previous topic, names are not given, so we cannot understand exactly who will do what and why. It was necessary that we could get to know each person involved, not only the speakers, but also the marketing production team, logistical organization of the events, and so on. Know their names, functions and a brief résumé of what they have done before, which would justify their participation in this project. About the script, it is very short, it needs more detail in its parts; it would be more interesting if an author determined larger phases and divided them into smaller activities. For example: in phase 1, it would be pre-production, in which he would research the community about which cities would be better for such events (this is a little confusing, higher up he already lists some cities that would hold the meetings and then talks that this will still be decided with the community...?), would contact the speakers and etc. A phase 2 could talk about the events themselves: where they would happen, when, estimated audience, content covered. And finally, a post-event analysis could be done, in phase 3, to understand how this project impacted the local community (I'll talk more about this in the topic below). In other words, it lacked to understand specifically the small details of this project. And so it is with the financial division: the author talks about how the money would be used in a qualitative way, for example, it would be necessary to spend on marketing, food, rent of spaces... but it is not defined at any time how much each part of these would cost. And this is essential for a complete understanding of this part of the project. He also says that the speakers would not be paid, which I don't agree with, they would be wasting their lifetime to promote such events, I think it's unfair that they don't get paid, even low, for such a thing.", "q1r": 2, "q2": "The author provides us with some KPIs to analyze to perform auditability. It's a start, but again I say it needs more detail. The analyzes proposed by the author go a long way towards understanding the success of events, for example 1 event per month, media material generated, etc. I think more data could be analyzed here, such as: number of people at each event, impact of the event on local news, level of engagement of participants during lectures, etc. However, something of extreme importance that I would like to comment is that, for this type of project, the follow-up of those involved is almost as important as the holding of the events themselves, because the objective here is to promote debate and enthusiasm about the ecosystem Cardano, right? So we need to know if this really happened! It would be important to maintain some kind of contact with the event participants, understand if they decided to get involved in any activity or adopt some Cardano technology, for example, acquire ADA, NFT, etc. The author could promote this follow-up and gather the data in reports to be shown to the community, which could be done in a Town Hall, for example. And even another member of the community could attend the events and check that everything is being done as promised. I believe that there is an auditability principle here, but it needs to be really deepened for a satisfactory monitoring of the project.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 19, "ne": 8, "ng": 7, "nfo": 4, "vca_o": 1, "reply": "I agree I could have described some things more precisely and in a more detailed matter. However:\n\nRegarding feasibility: budget is just an estimation as the prices of venues are totally different in various part of my country (Poland). It would be pretty hard to find a suitable venue for less than $1k in Warsaw, while in Katowice (big city but on the south) it can be easily booked for $500. Therefore I mentioned that in current proposed budget even twice the number of events may be doable. \nRegarding my experience - I agree that I haven't included links (my bad), but I included link and description of my second, complementary proposal \"Cardano Center Poland web & socials\" where all the links and experience (linkedin) are included - the reviewer might have clicked that so he knows I am who I claim to be.\n\nRegarding KPIs and auditability, metrics like attendance, social media activity seems enough in my opinion, and recordings of the events are the best proof of what and how played out. I agree that deeper follow-up would be great but I wouldn't like to demand from people granting me as organiser any personal data (and especially deal with any GDPR-related stuff)."}, {"q0": "This proposal although focuses on increasing awareness of Cardano, there is no specific mentioning of increasing components in Project Catalyst, such as; CA's, voters, proposal submission etc.. Again, besides building awareness, there is no specific content or method during the presentation itself. There is only the mentioning of 'Cardano-related stuff'. Among all the key metrics this proposal only fits the following; number of community events. Having Cardano Roadshows like this are great, but making sure what is presented, who is presenting, how is it presented, how to get word of this presentation out are items to be elaborated on. If not detailed well enough, it only becomes a social meet-up. For that, reckon in future iteration, to creating a build-up to this event. Perhaps various local workshops in different education centers, creative hubs throughout the particular city, then culminating in a city wide event. With that said, in it's current state, this proposal is ineffective in addressing the challenge setting.", "q0r": 2, "q1": "Other than personal statements and the mentioning of being a Cardano Ambassador, there is no proven experience, links or track record that can be Google-ed. Budget break down is unfortunately too simplistic. Experience in having events usually translate into a very detailed budget, for it is soo easy to go over-budget in regards with live events. There are too many factors that could go wrong, that is why it is common practice to always prepare contingency budget. Which this proposal also does not have. This also feeds into no mentioning of any risk and challenge assessment done by the proposer. With that said, it is most likely this proposal will be unsuccessful.", "q1r": 2, "q2": "There are roadmaps and adjoining actions but no particular date and milestones that acts as audit pressure points for the proposer. The majority of the KPI's provided can not be measured therefore can not be audited responsibly. The problem statement provided comes from the view of a marketer, that seeks to persuade rather than provide or suggest there is data that validates the problem statement. The solution in other hand, is actually descriptive and to a certain degree can be audited. Perhaps this is why the proposal in general is more of a marketing pitch than a action planned based on data.", "q2r": 2, "assessor": "z_assessor_635", "no_vca": 19, "ne": 2, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I agree I could have described some things more precisely and in a more detailed matter. However:\n\nRegarding feasibility: budget is just an estimation as the prices of venues are totally different in various part of my country (Poland). It would be pretty hard to find a suitable venue for less than $1k in Warsaw, while in Katowice (big city but on the south) it can be easily booked for $500. Therefore I mentioned that in current proposed budget even twice the number of events may be doable. \n\nRegarding my experience - I agree that I haven't included links (my bad), but I included link and description of my second, complementary proposal \"Cardano Center Poland web & socials\" where all the links and experience (linkedin) are included - the reviewer might have clicked that so he knows I am who I claim to be. I wouldn't demand that, but a few other reviewers did this so I may assume it was clear enough it was a sign from me to \"read more\" on my ideas on how to promote Cardano and Cardano ecosystem.\n\n\nRegarding KPIs and auditability, metrics like attendance, social media activity seems enough in my opinion, and recordings of the events are the best proof of what and how played out. I agree that deeper follow-up would be great but I wouldn't like to demand from people granting me as organiser any personal data (and especially deal with any GDPR-related stuff)."}, {"q0": "The proposer indicates that there's a demand for live events in cities in Poland, I can see that he is already active in this area, I trust that he can estimate the impact. The proposal is realistic and meaningful to connect Poland to the community. Many new members for Catalyst can be recruited here. The live aspect ensures that the team members can convince the interested parties, can easily answer questions, and initiate a dialogue.", "q0r": 5, "q1": "I can see that the proposer knows what he is getting into, he is not going to do this alone but will look for partners indicating the need for expertise that he may not have himself but wants to bring on board, smart. The planning regarding the number of events and the size seems realistic to me, especially since local partners will be involved. Does the proposer have enough network to find these partners?", "q1r": 4, "q2": "The proposer has no idea yet at which locations the events will be organized, and potential partners have yet to be contacted. The expected turnout has not yet been clearly defined but points out that the proposer will first prepare well and act based on his information. He will not handle impulsively. I miss a clear timeline to see how much time he provides for his research and then for the implementation and planning of the events.", "q2r": 4, "assessor": "z_assessor_667", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "In my opinion, the proposal is within the challenge because the proposal aims to organize Cardano events throughout Poland, brings Cardano and Project Catalyst to crypto enthusiasts, traders and regular people who are unfamiliar to crypto.\r\nHowever, the author should make the proposal more impactful by adding the success metrics as well as describing how the success looks like, making it more clear how it will add value to the Cardano ecosystem. For example: \r\n            - increase meaningful participation in Project Catalyst among all stakeholders\r\n            - onboard and integrate new people into Project Catalyst\r\n            - use events to build new teams\r\n            - increase active participation in events \r\n            - increase the number of participants in events", "q0r": 4, "q1": "The proposer describes in details about his experience and the rationale of events organisation as well as how to do.\r\nHowever, there are some of important information that is missing: What is the contents in events (in details)? How many participants at least as expected in each event? How many participants at least who would join Cardano commnity after each event? \r\nAfter fulfilling the missing details , I suggest the proposer should consider challenge and risk relevant to the successful implementation. For example: The challenge factor is another lockdown as a result of Covid which will require less gathering and contact. In that case the author has to consider setting up for the virtual meeting.\r\nThe budget should be broken down into identifiale items which are listed.\r\nIn summary, I do not agree this proposal is feasible.", "q1r": 2, "q2": "The proposal has KPI (at least 1 event organized per month) but it is not clear enough to valuate and assess the quality of the event. I recommend the KPIs should be: \r\n- Number of participants\r\n- Number of feedback from participants\r\n- Number of participants that become active community advisors\r\n- Number of particpants that become proposers\r\nThe targeted problem should be described understandable clearly. Since the idea is good, I believe the author can make it to become a fully auditable proposal in next Fund. Now I do not agree this proposal is auditable.", "q2r": 2, "assessor": "z_assessor_714", "no_vca": 14, "ne": 2, "ng": 9, "nfo": 3, "vca_o": 1, "reply": "Regarding feasibility part: I am a doctor myself and I know COVID is far from being over and risk of lockdowns is still real; yet every community has to slowly get back to normal and we all have to learn to live with the invisible enemy. I might add the info that in such case the proposal will just be postponed for the future or/and organized online but I don't find this fact as a disqualification of the proposal. \n\nRegarding auditability: I agree that it is an important part of Catalyst Fund; however, my proposal meets at least the minimum criteria. Reviewer suggests including -Number of participants - it's there, named \"attendance during events\". I also agree that deeper follow-up would be great but I wouldn't like to demand from people granting me as organiser any personal data (and especially deal with any GDPR-related stuff)."}, {"q0": "The proposal is good. The proposal is geared towards tackling the problem in the \"Problem Statement\". The proposal seeks to expand the territory of Cardano to Poland and that is in the best interest of Cardano ", "q0r": 4, "q1": "I see that the proposer has got quite some experience in the crypto market, especially becoming an ambassador for Cardano in 2018. It would have been great you attached a video or photos of your sessions. What is lacking is a team. I can't see team members for the execution of the proposal. Breaking the budget down further is very good. The proposer has not included possible risks involved in the implementation of the proposal.", "q1r": 4, "q2": "I see that the roadmap is clearly stated. Milestones are hidden. The proposal has some time horizon for some events to be carried out if the proposal is funded. The proposal has also captured the kPIs that define the success of the proposal, and that is great.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Great proposal and idea. I must say I like the participatory component that allows will-be attendees to vote on which city should host the event. This would encourage participation. The event would be helpful to create enthusiasm for new members to become part of the Cardano community. ", "q0r": 5, "q1": "Wonderful and measurable KPIs. I think the proposal is clear on what it wants to do hosting one event every month. However, the proposal is not clear on the targeted participants and possible increase or decrease in its projection for a subsequent event. The team has immense experience and I think it would be of help to making the proposal a success. The deliverables are clear and specific and participatory to enable community involvement for a successful implementation of the proposal.\r\n\r\n", "q1r": 4, "q2": "The proposal is transparent with community involvement that also helps in tracking and auditing. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "your plans to organize conferences must be applauded but you did not define your audience, the number of people you envision to richest to was not captured. I think also that the community research mentioned to be part of your activities after you are funded should be done so that you could have stakeholders a clear picture of where you intend to roll out your activities.", "q0r": 3, "q1": "A good experience in holding the conference is captured in the proposal but no evidence to that is provided in the form of video or image. Evidence of conference engagement will do a lot of good to the proposal.", "q1r": 3, "q2": "the proposal provides several KPIs to help the audit process only that the expected figures are not provided. the proposer will do well if these are sorted", "q2r": 4, "assessor": "z_assessor_728", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1, "reply": "The assessment is short but understandable and includes some tips. However, impact and alignment part doesn't correspond to the 3* - reviewer likes the idea and confirms that it's good I plan to carry out a community research. \n\nRegarding feasibility part: I agree that I haven't included links (my bad), but I included link and description of my second, complementary proposal \"Cardano Center Poland web & socials\" where all the links and experience (LinkedIn) are included - the reviewer might have clicked that so he knows I am who I claim to be - a few reviewers did that."}, {"q0": "The project will be helpful in creating awareness and also increase the cardano community in Poland. Therefore, as far as this proposal seeks to expand the cardano user base, I agree that the project will address the challenge. ", "q0r": 5, "q1": "Taking into account the team lead's former role as a public speaker and cardano ambassador, I believe these work experiences makes it ideal to handle this project. Additionally, the proposal provides details on the places the events will take place but it fails to provide timelines as to when an event will be hosted in town A or B. The proposal also failed to provide a detailed breakdown of the budgetary allocation for each event the team seeks to undertake in each town. Aside that, the proposal didn't capture to its target audience. Therefore, in the absence of a well-developed timelines for each event and a proper budgetary allocation, it will be difficult implementing the project successfully.", "q1r": 2, "q2": "The project provides adequate platforms to monitor and track the progress and success of the project. For instance, the proposal promises to make recordings of events available to the public; this will allow the cardano community to determine the success of each event. Also, the projects plans to develop a social media page for the events which is to provide announcements and update on each event; ideally this will provide the cardano community the needed information to know the progress of the project.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal will have an impact on the Cardano/Catalyst ecosystem as it will create new Catalyst Community Members. This does however depend if the pandemic situation is under control, and if events will be allowed still going forward. It really is a good idea, but we have to keep in mind that Covid is not over yet. We all hope so. It is a good idea to keep working on this.", "q0r": 4, "q1": "The proposer indicates that they have experience  as a speaker on various conferences, but no links or proof are provided. There is not to much detail around who would assist in arranging or speaking at the events (Team members needed). The budget is broken down roughly but just one amount is mentioned - 2000 USD per event for 5 events. It would be good to show a further breakdown of how much will be allocated to marketing, how much for the venue, the food and allowed for travel. There is a basic plan of how the proposer sees it implemented.", "q1r": 3, "q2": "There is a basic roadmap, but milestones are vague and is necessary so that the community can follow progress on the project. KPI metric should be elaborated more on to measure the success of the proposal and to make it easier for the community to monitor success. The proposer has a good idea, and just needs to add a bit more detail around experience, budget and key metrics.", "q2r": 3, "assessor": "z_assessor_795", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I agree on impact/alignment comment - I am a doctor myself and I know COVID is far from being over; yet every community has to slowly get back to normal and we all have to learn to live with the invisible enemy. \nRegarding feasibility: budget is just an estimation as the prices of venues are totally different in various part of my country (Poland). It would be pretty hard to find a suitable venue for less than $1k in Warsaw, while in Katowice (big city but on the south) it can be easily booked for $500. Therefore I mentioned that in current proposed budget even twice the number of events may be doable. \nRegarding my experience - I agree that I haven't included links (my bad), but I included link and description of my second, complementary proposal \"Cardano Center Poland web & socials\" where all the links and experience (linkedin) are included - the reviewer might have clicked that so he knows I am who I claim to be.\n\nRegarding KPIs and auditability, metrics like attendance, social media activity seems enough in my opinion, and recordings of the events are the best proof of what and how played out."}, {"q0": "This a great and interesting idea by the proposer. This proposal addresses the challenge and has the potential of bringing value to the cardano system. The proposal has the ability to scale into the future where participants trained can end up adding value to the network through their participation either as developers etc.", "q0r": 4, "q1": "The proposer has a record of success in the cardano community and possess the desired experience to execute the task. The budget is moderate and will be enough to execute the project even though not detailed. One thing the proposer didn't include which i think is equally important is the project team who will help him execute the task.", "q1r": 4, "q2": "The proposer has included a roadmap and stated the KPI's that will guide in tracking the progress and success of the project when funded which i think is a great idea. The proposer however has not stated the possible risk that can be faced by this project which i think will be key to include in a project like this should there be unforeseen circumstances that might hinder face-to-face meeting.", "q2r": 4, "assessor": "z_assessor_799", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "波兰各地的地方活动都有嘉宾参加，目标是普通的加密货币爱好者、交易者、\"听说 \"但从未 \"体验 \"过加密货币的人。", "experience": "自2017年开始探索加密货币市场。Cardano大使 - 2018年。在各种非加密货币会议上发言。丰富的社会联系网络。"}