{"id": 384874, "author": "gabrielaxel", "title": "Collaborat'n for global risk issues", "url": "https://cardano.ideascale.com/a/dtd/384874-48088", "category": 26234, "amount": 30000, "description": "世界上充斥着存在的风险问题，没有办法协调社区来制定解决方案，正面解决这个问题。", "funded": 1, "upvotes": 34309777, "downvotes": 13922955, "votes_result": 20386822, "votes_cast": 251, "f6_no_assessments": 5, "f6_rating": 4.133333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "I like the idea to create ways to incentive proposals that address these global issues while deleoping and promoting catalyst.\r\nIt is imporant also to mention that although this proposal has a indirect impact on the \"global issues\" mentionted (the direct impact will be in proposals submitted that came from it), it is very aligned the challenge of the \"Community Events\", as it will create an engagement towards solving universal problems facilitated by Cardano/Catalyst.\r\n\r\n\r\nOne idea is trying to follow the 17 UN SDG to make sure nothing is left behind (or try to associate the problems mentioned with the SDGs) - It will bring more credibility to the project.\r\nIt is essential also that working sessions are followed closely by specialist in thesse topics else the discussions might drift weak solutions. This follow up from the specialist seems to be covered in the proposal.\r\n\r\n\r\nAlso, pre-read and study materials will help a lot too during the meetings, so some efforts will need to be done in this sense, to make these materials available. Bringing study cases, proposals already funded that addressed these issues and real world examples to solve will also help a lot.\r\n\r\nIf projects is successful, in the future, it will be interesting to see it expanded to other languages (and regions) to get closer to LATAM, Africa, places that Cardano is trying to expand (and these issues are more latent), working with local members and passing on lessons learned. Having this in multiple languages, in the future, will be awesome - but that would be for another proposal and challenge.\r\n\r\n", "q0r": 5, "q1": "One committed person with experience seems enough. There's a linkedin link to help verify the infos. He will work with an organization but this seems to be aligned already (could be more clear here though).\r\n\r\ntheres a sensible plan and budget breakdown is clear. My only point is that it seems a bit expensive for a project that will have meetings as main activities", "q1r": 4, "q2": "There are good kpis. TMos of them have no target but I understand it hard to set any by now. I'd add to kpis some way to measure which global issues is being tackled in each future proposal to see the outcome in terms of the issues and check which ones were missing. Milestones can be extracted from the plan,\r\n\r\nThere's also a good risk mitigation strategy in place\r\n\r\n\r\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 19, "ne": 6, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely World is rife with existential risk issues, with no ways to orchestrate communities to develop solutions that address it head on\r\n \r\nIt is clear this proposal does  fall within the scope of the challenge brief by Cultivating community facilitation for engagement and proposal development aimed at tackling major issues consciously through weekly meetings\r\n\r\n \r\nThis proposal shows how it may add value to the Cardano system by creating these community meetings \r\n \r\n  Key metrics have  been presented. These include Number of meetings, number of participants, number of flexible working grops, number of proposals number of quality proposals, number of implemented proposals.\r\nIf i were to suggest metrics,  would be  number of participants,  number of episodes, number of views , number of proposals\r\n \r\nThe key metrics and goals have not been given\r\n   \r\nProposal can be scaled up to address future challenges by adding more participants and meetings\r\n\r\nThis project may have a positive impact on Cardano system by increasing the awareness of the community members.\r\n\r\nI can say that this proposal adequately addresses the challenge needs, as its Community building  hence i have given it a 4 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country. Also I am an educator , teaching English both online and in real life and am an ICF Coach in training. As such I am familiar with Neuroscience and its benefits. I am also involved in AI and ML projects. ", "q0r": 4, "q1": " \r\n \r\nThe proposers  have  provided evidence  of themselves with their skills and experience  \r\n  \r\n The links are sufficient. \r\n \r\nI have visited these links\r\n   \r\nThe proposers can be said to be experienced and competent to do the project  \r\n \r\n The type and number of team members required to implement the proposal is not stated.\r\n  \r\nThe team structure isnt  listed and experienced.\r\n \r\n \r\n The budget has not been given in detail. It appears quite high and has no designated cost centres.\r\n\r\nI would suggest to scale down the project and build a few classes with lesser resources in a manner which you are able to do without so much dependence on large hardware and software purchases.\r\n \r\nThe budget is not reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required   \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n \r\nTheres a realistic timetable  to complete the work.  \r\n \r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  . al?\r\n\r\nResources  necessary to implement the proposal are described.   \r\n \r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\n\r\nThe proposal has technical aspects which have been addressed \r\n\r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is high hence I have given it a 3 star rating.   \r\n\r\n \r\n", "q1r": 3, "q2": " \r\nThere is a roadmap with milestones  \r\n\r\n \r\n There are Metrics given by proposer. These include Number of meetings, number of participants, number of flexible working groups, number of proposals number of quality proposals, number of implemented proposals. \r\n  \r\n The problem has been understood and solution has been given broadly. My professional opinion is that it does fit into the challenge goals.\r\n   \r\n    The proposer has identified possible hurdles, challenges and difficulties. \r\n \r\nAre there contingency plans in place for various outcomes?\r\n \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal but the auditability of the budget remains in question, hence I have given it a  4 star rating.\r\n ", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 17, "ne": 5, "ng": 5, "nfo": 7, "vca_o": 1}, {"q0": "This is an important issue this proposal is trying put a spot light onto. Which is 'Existential Risk', which are risk that permanently disrupts and degrades human development. That could be irreversible global warming, untreatable virus etc. The proposer chooses to create a series of meetings that focuses on educating and informing on existential risk in collaboration with think tanks that specializes in this topic. The deliverables and how the proposer intends to manifest them does addresses various problems that needs to be solved, such as; using events to build new teams, increase meaningful participation etc.. The proposer together with their collaborator will bring a wealth of knowledge to Project Catalyst. This proposal is shy of a 5-star rating in this category due to the current priorities of Cardano, which are education and adoption of Cardano itself. If the proposer were to come back in 6 months, this proposal will easily be a 5-star rating on it's effectiveness.", "q0r": 4, "q1": "As much as impressive the CV of the proposer is, together with their equally impressive collaborator there seems to be a gap between the proposers expectations and the reality of Project Catalyst. This is manifested into the budget requested and how it will be utilized. Although there is nothing wrong with requesting funds to have meetings, it is not the common practice in Project Catalyst. A topic or perhaps a formulation of a new specific Challenge is usually initiated by the organic congregation of various individuals in and/or out of the Cardano community. As the people discussing it grows, so does the intangible social verifier signals that this topic is of importance. As this assessment is being written, there is actually already an existing community within Cardano that speaks of to a certain degree 'Existential Risk' called 'Cardano4Climate'. With that said, recommend the proposer to reach out to this community and also the Catalyst Swarm, for this issue has been circulating within the community for a while. Other than that, this proposer has done a great job in fleshing out a clear timeline and also taking account potential risk that they may face. Kudos to the proposer for this, for not many even consider calculating the risk one might face.", "q1r": 3, "q2": "There is a general roadmap with adjoining action plans and also some milestones. Though not all KPI's are measurable, reason being proposer feels in order to be able to provide numbers, this proposal should undergo it's first iteration. Hence, reckon the proposer to reach out first to Cardano4Climate and also Catalyst School to perhaps formulate a stellar new Challenge Setting that addresses 'Existential Risk'. Problem statement and solution provided is solid and well interconnected.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 18, "ne": 9, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is a brilliant idea. The proposal has created the link between the problem which is to be solved and the challenge. I was hoping to see the benefit Cardano would gain from the implementation of the proposal in the describe solution to the problem section however it reflected in the detailed plan section, all thesame it is good the proposal has captured that. For the purpose of future proposals, it would be good goals have its own section in the proposal, it is important. However, the goals align with the challenge settings.", "q0r": 4, "q1": "The proposer has got quite some experience and skills with evidence (links and references are provided).\r\nThe proposal has got a team. The budget is well presented. The team will facilitate proposal development among others however it will be good to describe how it will be done to better understand the approach. The proposal has got a detailed and reasonable plan for implementation. I appreciate the fact that the proposer has included the risks involved in the implementation and have outlined how those risks will be mitigated.", "q1r": 4, "q2": "The proposer has outlined the roadmap, milestones and time horizon for the achievement of the proposal. I appreciate the fact that the proposer has included the metrics/KPIs that define the success of the proposal. What I can see in the proposal is that, the targeted problem is clearly described and the proposal is also geared towards tackling the problem.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The proposal has been able to provide a holistic approach to improving the level of collaboration and active participation of all stakeholders, catalyst members etc. towards solving and bringing a lasting solutions to pertinent issues as it concerns global issues and the ecosystem. In my opinion, the proposal has the potential to reinvigorate active participation across all members in the catalyst project.", "q0r": 5, "q1": "The project's team seems to be more than qualified to champion this proposal from the information provided. In addition, am convinced that the detailed information on the budget and its implementation coupled with the Roadmap presented, is sufficient to deliver this proposal. It is important to note that the proposal had also considered potential risk factors and how to tackle them.", "q1r": 4, "q2": "The proposal has provided enough information on how to assess the performance of the project.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 20, "ne": 2, "ng": 11, "nfo": 7, "vca_o": 1}], "solution": "培养社区促进参与和建议的发展，旨在有意识地解决重大问题。", "experience": "创始人。人类认知与人工智能伦理学博士，曾任SingularityNET人事主管；去中心化治理创新；意识专家"}