{"id": 384171, "author": "skadea", "title": "Megaclite - Game Dev and Consulting", "url": "https://cardano.ideascale.com/a/dtd/384171-48088", "category": 26241, "amount": 100000, "description": "ブロックチェーンは非常に複雑なため、ゲーム開発者がエコシステムに参入するには、明確な道筋がないので難しいのが現状です。", "funded": 1, "upvotes": 27936860, "downvotes": 13423897, "votes_result": 14512963, "votes_cast": 145, "f6_no_assessments": 3, "f6_rating": 3.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal tries to address the high complexity of blockchain which makes game developers hard to enter the ecosystem due to the nonavailability of a clear guide. The proposal wants to push Cardano towards mainstream by assisting projects in the gaming industry. Thus proposal effectively addresses the challenge", "q0r": 5, "q1": "The team is very diverse and has the necessary experience and expertise \r\nto make this proposal possible. The proposal comes with a detailed action plan and breaks up how and where the budget is to be used.\r\nWith all this info it is highly possible this proposal will be implemented successfully", "q1r": 5, "q2": "The proposal consists of well laid out Roadmap and the action plan also has goals for each phase with a timeline that simplifies the audit and tracking progress. The proposal also comes with possible key performance indicators and has provided a clear fund allocation. With all this information it is very much possible to track the progress and success of the proposal", "q2r": 5, "assessor": "z_assessor_317", "no_vca": 19, "ne": 4, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "The idea to have the clear road to guide the game developers to enter the ecosystem is innovative and promising. This project can attract many developers into Cardano game community and this can give huge value in the future by having these developers create great games. The project itselft includes a game based on Cardano blockchain so clearly it addresses the challenge well. ", "q0r": 5, "q1": "The team has relevant experience but it will be better if they showcase their experience to be more reliable. The proposal includes the detail Roadmap. However the budgets is poor-explained with little explaination. ", "q1r": 3, "q2": "The KPIs need to be more detail: each KPI need to have quantity number for measurement", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "looking in the proposal the idea given is good. However it will be promising if the proposer can get collaborate with big company at first.", "q0r": 4, "q1": "nothing wrong with the road map. the idea requires more development in apps/mobile apps or maybe listing more detail in the phase 1(sales activities) ", "q1r": 2, "q2": "as the proposer looking to be pioneering in gaming in the near future, the roadmap doesn't look any easier as it is. need to see more the idea of megaclite troopers", "q2r": 2, "assessor": "z_assessor_957", "no_vca": 25, "ne": 2, "ng": 11, "nfo": 12, "vca_o": 1}], "solution": "カルダノをメインストリームに押し上げるためには、ゲーム業界のプロジェクトがカルダノブロックチェーン上で動作するように相談・支援することが最善の方法です。", "experience": "\nITマネージャー\nソフトウェア開発者\nグラフィックデザイナー\nコンサルティング経験者\nエマーゴ・ワークサーティファイド\nプルータス・パイオニア参加者\nソリダリティー\n"}