{"id": 384265, "author": "edwint", "title": "World of Pirates", "url": "https://cardano.ideascale.com/a/dtd/384265-48088", "category": 26241, "amount": 60000, "description": "ゲーマーは、自分の好きなゲームのあらゆる側面に関わりたい、社会に影響を与えたい、ゲーム内の資産をコントロールしたいと考えています。[1]", "funded": 1, "upvotes": 36292207, "downvotes": 12429093, "votes_result": 23863114, "votes_cast": 218, "f6_no_assessments": 8, "f6_rating": 3.9583333333333335, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=16012"], "media": [], "f6_assessments": [{"q0": "私は、ファンド4からプロジェクトCatalystに参加しており、5年以上にわたって中小企業や企業向けのソフトウェアソリューションを提供してビジネス要件を分析した経験があるので、この提案を評価する能力があると思います。それに加えて、私はずっとゲーム好きで、ゲームテスターとして働いていたこともあるので、この業界のことも少し知っています。\nこの問題提起は、問題を特定するというよりも、ゲーマーが好むいくつかの点を指摘していますが、この提案は、プレイヤーがゲーム内資産を自由にコントロールでき、NFTを獲得でき、さらに慈善団体への寄付もできるような、「無料で遊べて、稼げるゲーム」を作ることを目的としていると理解できます。提案者へのフィードバックとして、提案の冒頭で頭字語を使う場合は、直後にその意味を説明してください。投票者の多くはゲーマーではなく、また一般的に技術に詳しくない人もいるでしょうから、これらの用語を知っていることを期待しないでください。また、提案書の後半で、ここでの資金はゲームのMVPを作成するために必要であると述べられています。この点については、ここで期待されるアウトプットがゲーム本編であると誤解されないように、ソリューションの中で述べておくべきだったと思います。\nゲーム概要」に記載されているプロジェクトの概要は、バトルロワイヤル形式のチェスカードゲーム（比較対象として「Might & Magic Chess Royale」を参照）で、プレイヤーは互いに対戦してXP（XPの使用方法は詳しく説明されていません）や海賊ゴールド（ゲーム内のチェストを購入するのに使用でき、チェストを開けるとWOPRaceトークンやNFTカードなどのゲーム内資産の組み合わせが得られます）を獲得します。私の理解では、これらのトークンは、プレイヤーがWOPトークン（ADA/フィアットでのみ購入可能）とともに使用し、後に設立されるDAOでゲームの方向性を投票するために使用されます。また、開発者はこのゲームをAR対応にして、屋外でスマホを使ってプレイできるようにする予定です。\n私たちが求めているのは、人々をカルダノのエコシステムに引き込むための良いゲームなので、この提案が課題を効果的に解決していることに同意します。しかし、この提案では、成功指標が何か、MVPが具体的にどのようなものになるのか、将来的にどのようにスケールアップする計画なのかが語られていないので、5つ星は付けられません。ホワイトペーパーには、長期的な持続可能性についていくつかの言葉がありますが、それはゲームが無料でプレイできるという事実に焦点を当てたものであり、かなり曖昧です。数ヶ月後、数年後の具体的な予測を期待していました。\n", "q0r": 4, "q1": "提案者はプロジェクトのサイト(https://worldofpirates.io)へのリンクを提供していますが、正直言って空しいです。5人のチームメンバーの名前と役割は、クルー（/コンタクト）セクションで見ることができますが、これらは提案書に記載されていない情報（役割と過去の経験）を提供していません。将来的にはソーシャルリンクを追加して、誰でも簡単に実在の人物であることを確認できるようにしてください。残念なことに、Ideascaleでは、実際には働いていない人が働いていると主張していたため、個人的に別の提案を報告したことがあります（LinkedInで連絡を取り、確認してもらいました）。\nこれとは別に、もう一つの重要な部分として、このプロジェクトがどのように完了するのかという情報が欠けています。ステップ・バイ・ステップのロードマップや、3-6-12ヶ月後に期待される結果を示したタイムラインもありません。なお、あなたが指摘しているhttps://www.worldofpirates.io/roadmap のページは空白です。また、NFTをいくつか販売して慈善団体に寄付したとのことですが、その詳細を示すリンク先も空白になっています。https://www.worldofpirates.io/potm。\nこのように、私が提示したすべての情報が欠如しているだけでなく、プロジェクトに起こりうるリスクや障害についても言及されていないため、このプロジェクトの実現可能性に対する私の信頼は大きく損なわれています。\n唯一、詳細な情報があるのは予算で、提案者が考えるMVP作成にかかる期間である3ヶ月間の予算が算出されています。ここでの数字は、少し高いとはいえ、十分に信頼できるものだと思います（開発者1人あたり月4000ドル、営業担当者1人あたり月3000ドル、合計53000ドルの給料、一方で広告費は1200ドルしか見積もられていません）。さらに、インフラにかかる費用を加えると、合計で60000ドルになります。これらは信頼できる数字ですが、スタートアップを目指すインディーズ・プロジェクトとしては、私の意見では少し高いと思います。チームのメンバーには多くの経験があると思いますが、Catalystだけで必要な資金をすべてカバーできるかどうかわからないので、追加の資金源を探すことも検討したほうがいいでしょう。\n実現可能性を要約すると、提案者はチームの経験を確認するためのリンクを提供しておらず、提案者が参照しているサイトのいくつかのリンクはただの空白のページであり、MVPの完成までに3ヶ月かかるという言及を除いてロードマップやタイムラインはなく、インディーズプロジェクトとしてはこのような短期間での予算はかなり高いと感じています。以上のデータから、私はこの提案が成功裏に実施される可能性が高いとは思いません。", "q1r": 2, "q2": "以上のように、提案書は「無料で遊べるバトルロイヤルのチェスカードゲームのMVPを作りたい」という点では十分に明確ですが、それをどのように行うのかという点では多くの詳細が欠けています。将来的には、どのようなアプローチをとるのか、一定の間隔でどのような成果物を提供するのか、詳細を追加してください（3ヶ月、6ヶ月、12ヶ月にマイルストーンを設定したプロジェクトのタイムラインを考えてみてください）。また、監査可能なプロジェクトにするためには、より詳細なKey Progress Indicatorsが必要です。現時点では、提案書には、2021年4月12日にソーシャルページを公開した後、Discordで300人のメンバーを獲得した、Twitterで100人のフォロワーを獲得した、などとしか書かれていませんが、Project Catalystは今後の進捗状況を追跡できるようにする必要があります。そのためには、例えば次のような明確な目標を設定するとよいでしょう。例えば、「最初の広告キャンペーンから1ヶ月後にツイッターのフォロワーが1000人、MVP公開後に鋳造されたNFTの60%が販売される、プロジェクトのアップデートを追跡する月に1本のyoutube動画を公開するなど」です。\n結論として、この提案は野心的であり、チームがこのアイデアに多くの努力をしていることはホワイトペーパーからも明らかであり、もし彼らが雪だるま式に成功することができれば、成功のチャンスがあると思いますが、上に述べたように、Catalystが必要とする多くの重要な情報が欠けています。\n現時点では、ここにある情報が提案の成功を監査するのに十分であるとは、賛成も反対もしません。", "q2r": 3, "assessor": "z_assessor_546", "no_vca": 28, "ne": 15, "ng": 13, "nfo": 0, "vca_o": 2}, {"q0": "Overall, this proposal addresses the challenge posed. Gamers no longer spend time and money on video games in vain. Instead, they can profit in the long run from playing the game. Besides, the game has great meaning, it helps to create motivation to help our ocean.", "q0r": 5, "q1": "The team consists of many experts with experience working in different fields, which makes the implementation of the idea much easier. In particular, 3 people on the team are pioneers of Plutus, which is an advantage.\r\nI have read your plan, the route is quite reasonable. However, you have only designed the website of the game, the game interface will not be released until 2022, as you know, gamers attach great importance to interface issues.", "q1r": 4, "q2": "You mentioned this is a card game, and I think card games can't support AR, if possible you should clarify how AR fits into this game.\r\nI visited your website, but can't see the interface of the game. If the game is released earlier, I think it will bring a more intuitive view for users. I think you should allow users to try it out to experience.\r\nShould be more clear on the Play To Earn aspect.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 18, "ne": 3, "ng": 10, "nfo": 5, "vca_o": 1, "reply": "You nailed the Impact section. For the second section (Feasibility) you are right at that moment we didn't had a final ui for the game, we will present something at IdeaFest, but nevertheless this will be an iterative process and we will work with users and based on their feedback we will adjust the ui and come with something sutiable.\nAdressing the AR part, currently is just in the idea/vision phase, we have some ideas on how we can implement that, but it's true that we have to do some research and test to come with a prototype. About our website, we currently focus on the characters, universe and the NFT part, but the website is a creature itself and it will evolve in the next months once we will focus more on the game MVP and next versions this will be reflected in the website too."}, {"q0": "This proposal is very well presented both in ideascale and in the recent ideafest presentation. Clearly a lot of thought has gone into the theme and gameplay through Free and Pay-2-earn scenarios, but also how best to utilise the blockchain functionality , incorporating NFT trading, NFT creation & an off chain DAO for artists. There are multiple avenues into this game so should appeal to a large demographic thus aligning with the key objectives of the challenge. More user, transitions, games on Cardano.\nInterest is already being shown. 100 twitter followers quite in the proposal, this is now pass 300.", "q0r": 5, "q1": "The roadmap on the website is great and provides very high level view of the next two years. However for this specific proposal, which is developing an MVP, it is not particularly clear what the steps involved are to achieve the MVP. The proposal really needs a plan vs budget vs deliverables vs milestones to provide confidence in feasibility. At the moment the voter is placing trust in the proposer based on a the website work done to date. This is a simple fix for the proposer, they need to due the due diligence on feasibility and i would suggest they reach out to a project manager/mentor to help with future proposals or presentations to a VC.\nA number of people are named in the proposal but it is not clear if these are actually going to be part of the delivery team. In addition resource profiles are not provided in the proposal or on the website.\nThe is a basic budget breakdown. Senior developer cost of $4000 per month. These are sensible assuming the named resource are simply taking this as their permanent salary and they do not need to engage contract resource which could cost significantly more.\nOn the basis of what i have seen from the ideafest video only have confidence to give this 3 stars.\nThere is a note about recruiting marketing and sales people. This is also a key risk to the project. Mitigation is either a very steep learning curve for the current team or a potential increase in costs if they need to engage a 3rd party organisation to help for example.", "q1r": 3, "q2": "Auditability is difficult to assess as not key metrics or KPI's are given. The key question is how can we measure that the MVP is successful? The proposer should think about measuring community feedback on the MVP and develop some targets to check themselves against. ", "q2r": 2, "assessor": "z_assessor_45", "no_vca": 28, "ne": 10, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "It's a good nft game plan on cardano blockhain written well and clear. \nIt talks about a 50% donation to sea shepard but it is not specified how it will happen. At the link given I can't find specific information. I noted that the proposal justifies this as not yet provable in advance and will be proven later. This is a red flag for me.", "q0r": 3, "q1": "I read the whitepaper and it is well written.\nHowever, it lacks specific details, 6 pages is perhaps too little.\nSome of the team we can look up on linkedin and they all have experience in the field of games and blockchain.\n", "q1r": 4, "q2": "I don't see a detailed plan. Milestones are missing and I would have liked a github repo to track work.", "q2r": 2, "assessor": "z_assessor_361", "no_vca": 28, "ne": 0, "ng": 18, "nfo": 10, "vca_o": 1}, {"q0": "The proposers want to introduce the game World of pirates which is a chess-like game. The game would be P2E and with the earned tokens the player is able to engage in the community and buy in-game chests for rewards. At its core, this proposal fits well within the challenge.", "q0r": 5, "q1": "Looking at the team's experience, they seem more than qualified for this project. They provide the necessary skills required on their website. Concerning the rest of this proposal, I see some inconsistencies. The proposers talk about two tokens (WOP and WOPR) while in the whitepaper they talk about three(PG, WOPR, and others). in the whitepaper, there is no mention of the WOP token which can be bought with ADA or FIAT. The roadmap provided is sound and secure. The budget request is more than sufficient for the proposal, although it is a bit on the high-end. Because of the inconsistency, I'll remain neutral on this.", "q1r": 3, "q2": "The roadmap provided remains rudimental for the proposal. the proposal is for one step within the global roadmap and the proposers don't provide us with milestones within these three months. The KPIs that are mentioned by the proposers refer to the marketing of this proposal, which is perfect for the stage this is in right now. I personally would've liked some milestones that go deeper into the development of this project.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 27, "ne": 1, "ng": 23, "nfo": 3, "vca_o": 1}, {"q0": "This is a game combining chess and NFTs. It has classical chess mode and a battle royale that includes the champion NFTs. I think it's an amazing idea and a proposal to match. I really like the idea of it, as a chess player myself I would try this game out for sure. There's a clear way to add value to the cardano ecosystem through leveraging NFTs and the blockchain integration into the game. I love that this project has well through out KPIs and metrics. That's something I'm missing in some of the other proposals. The team has thought about possible future challenges and how to overcome them and is listening to what the community has to say. To be honest, I don't see anything missing from this proposal. I think it's a great idea with a great team behind it to back it up.  As a developer, I don't see any issues with the team credentials. Overall should be a great game given the described work is put in the next year. Good luck!", "q0r": 5, "q1": "I was able to verify the credentials and skills of the listed people in the proposal. I have no doubt these people will be able to deliver on the game as described in the proposal. The team members count as well as types and specific skills required is clear and that gives me great confort in the success of this proposal. The budget is clear enough and is broken down into understandable parts that are easy to follow. As a developer myself, the roadmap and time frame seem reasonable for the work that needs to be done which shows that the team members have no problem estimating the tasks ahead.  All resources linked in the proposal are relevant and further explain details like how the future process and charity work will be done. The idea is to have royalties from the NFT sales got to charity which is noble. I love the proposers have shown the economic incentives for the players to go on their platform and are not just hoping but have a plan in mind to build a community. Risks and challenges are mentioned in the proposal and have well explained plan of action.  Overall I think the game is feasible and I'd play it.", "q1r": 5, "q2": "Should have no problem with tracability and auditability. The team has an active telegram discord and twitter channels so they'll be able to bring any community members along for the ride while the development is ongoing. Strong KPIs and metrics that would allow community members to follow the success of the project. A clear roadmap and milestones are present in the proposal. The description and problem statements are understandable and well put together. I love the charity cause as well.   I love the proposal and it surely will be a great addition to the ecosystem.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 26, "ne": 6, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": " \nThe problem needing to be solved has been identified and articulated namely Gamers want to be involved in every aspect of the game they love to play, to have impact in society and to control their in-game assets but in most games they cannot\n \nThis proposal falls within the scope of the challenge brief by creating an interactive NFT game to bring gamers into the Cardano Ecosystem. It will also introduce kids to Play to Earn as well as NFT related Social Causes. It will bring chess players as well as card gamers into this space.\n \nThis proposal shows clearly how it will add value to the Cardano System by bringing many different types of new users. \n \nKey metrics and goals of the proposal been stated clearly namely 300 Members on Discord, 100 followers on Twitter, 50 Members on Telegram, 70 Users registered on our website that they verified their wallets too \n\nKey metrics and goals of the proposal fall within the scope of the challenge.  ", "q0r": 5, "q1": "\n \nThe proposer has provided evidence of relevant skills and experience needed to complete the project. \n \n \nThese links are sufficient \n \n \nI have visited these links and contacted the relevant people\n \n \nI have been able to assess their level of competence.They have a high level of competence.\n\n \nThe proposer know, in an identifiable manner, the type and number of team members required to implement the proposal. THe skills of the team has been clearly laid out along with their experience and history. \n\nThe budget has been outlined clearly and broken down into identifiable items\n \nThe budget is reasonable to achieve the set goals \nTHey have considered many different aspects, including how to create unique NFTS, increase player participation and ongoing engagement through Pawn of the Month competitions and such unique engagements. They also have the chance to get high value NFTs.\n \n\nThe proposer has not provided a verifiable plan if additional funding is required to implement the proposal\n \n\nThe proposal offers a very realistic timetable to complete the work\n\n \n The proposal provide a sensible and conductible plan for implementation that shows not only what is being done. All details have been provided as required \nThey have considered both the gaming aspects, the NFT aspects and the Social Value by creating a connection with Sea Shepherd. \n\n \n The plan describe the resources necessary to implement the proposal.\n \nThe proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation.\n\n \nThe proposer considered challenges and risks relevant to a successful implementation", "q1r": 5, "q2": "\nThere is clearly laid out a roadmap with milestones and a time horizon for achievement\n \nThere are clearly defined Metrics/KPIs that define the success of the proposal\nThese include 300 Members on Discord, 100 followers on Twitter, 50 Members on Telegram, 70 Users registered on our website that they verified their wallets too \n \nThere is a clear understandable description of the targeted problem\n\nThere is a clear understandable solution that addresses the problem\n \nThe proposer has not identified possible hurdles, challenges and difficulties\n  \n\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 23, "ne": 3, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "Firstly, the attached website is very good. It is quite complete, both in terms of content and design. We have a lot of information about the project, and we can get to know it in an attractive way. Now talking about the idea itself: this proposal fits perfectly with the objectives of the challenge. The team intends to create a game that is a mixture of several things: chess, stake pool, NFT and donations to an institution dedicated to activities related to the ocean (here we have the explanation of the name of the game, in addition to the characters, that we can meet in the attached website, being pirates and the game's theme revolve around that). In my opinion, this game has everything to work out, because it already involves something very famous and appreciated - chess - with the minting of NFTs, greatly benefiting the Cardano ecosystem since all this would be done through a pool and also these NFTs could be exchanged for ADA. This would automatically increase the number of transactions on our blockchain, fully matching what we are looking for in the challenge - games that increase ecosystem activities. As a bonus, we could still meet one of Cardano's general objectives, which is to promote sustainability, through the donations made (the authors attach a link that is specifically about this, through which we can better understand this part of the donations). I congratulate the team and hope they are funded.", "q0r": 5, "q1": "80 years of experience? In this case, the bidders probably added up the years of experience of each one individually to arrive at this number. This did not make me understand the real experience of the group, that is, how old each one is, and in which areas, etc. It is positive, however, that they already have their developers in Plutus, because from what I've noticed many proposals need these professionals but will still hire them. The presentation of the group is perfect - we have a good description of each member, knowing their names, roles and areas of training. The linkedin profiles were also linked, in the end of the proposal. It is also positive how they leave open the possibility of hiring freelancers for design and storytelling areas. That is, in relation to the team, I believe that everything is in order (I was just confused by this story of 80 years of experience). The money asked for funding is also explained very adequately; we know what each small fraction would correspond to for the execution of the project, even though it is a high value (60k) it is quite understandable for the many people who would work here and also the various activities that would take place. It is a large and complex project. The roadmap is attached on a website (https://www.worldofpirates.io/roadmap), I loved the graphic way they organized the steps, really creative and gives us a good understanding of what would be done and in what order. In addition, from what I understand, the idea is to gradually complete the %, that is, in phase 1, they would update: 20% done, 50%... This would even be a way of auditing the proposal, as I will comment on the next topic .", "q1r": 5, "q2": "Through the attached website, we have a well-organized script with a very attractive design. As I was commenting above, with the passage of time they would update how many % of each step had been done, and with that we could monitor the process. However, unfortunately this is the part that is least addressed by the team, because they do not establish KPIs. They don't tell us exactly some goals to be achieved, they don't predict possible challenges to be faced along the way, etc. We weren't helpless, given the great level of detail about what this game is and how it would all work, but I wish the team had paid more attention to how they audited the proposal. I suggest that they review this part, if funded (I hope!) establish ways for the Cardano community to be able to precisely follow, in addition to the development of the project, the partial results that would be obtained.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 25, "ne": 9, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "当社のF2P＆P2Eゲームでは、プレイヤーがチャリティプロジェクトに寄付することで世界にインパクトを与え、NFTを獲得して収益を得ることができます。", "experience": "私たちは、インフラやウェブ開発、ゲーム＆ブロックチェーンで80年の経験を持つ5人のチームで、うち3人はPlutus Pioneersです。"}