{"id": 366900, "author": "", "title": "CARDONEX ⚡", "url": "https://cardano.ideascale.com/a/dtd/366900-48088", "category": 26105, "amount": 5000, "description": "ハッカソンを開催したり、意識を高めたり、大学生の才能をカルダノに導くことを目的とした大学のクラブが必要です。", "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "really like the initiative. maybe you could add a bit more on how to adress people from OUTSIDE the cardano community (the challenge could be that you attract people who are already into cardano). But as I said I like the idea!", "q0r": 5, "q1": "the plan is of course still high level but it looks to contain the important milestones. maybe you can add a bit more on how to get access and attract people who are not yet involved in cardano.", "q1r": 4, "q2": "maybe you could be more precise on which universities you will be targeting (and how). but you set some good goals. I support you!", "q2r": 4, "assessor": "z_assessor_286", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "there is more similar ideas, minus two stars because:\r\n\r\n1. regionally oriented (not global range)\r\n2. focuses a specific group (not the whole population)\r\n\r\nto state it more clear - there are projects that are wider, and there are projects (such as this one) that is more narrow, therefore to remain (or attempt) to stay objective, I need to adjust the ratings accordingly.", "q0r": 3, "q1": "1. webpage deqree.in running\r\n2. twitter is set - low followers\r\n3. three followers of the YT channel with CARONEX video, seen by 25 people\r\n\r\nI will keep some reservations, not STRONGLY convinced that they can pull it off.  \r\n\r\noutreach of around 10,000+ tech students from different universities\r\n\r\nif there would be links to this outreach, I would be convinced. ", "q1r": 3, "q2": "1. progress can be audited\r\n2. new proposers can be audited\r\n3. views, likes, shares, between can be audited\r\n4. number of members over time can be audited", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is very interesting and perfectly dialogues with the main objective of the challenge. The authors intend to create a kind of event, called Cardonex, which will bring together university students and educate them about the Cardano ecosystem. In this way, we would be bringing to the community people with a whole professional future ahead of them, who would certainly have a lot to contribute, and if they were involved from an early age with the ecosystem, they would, after some time, be great connoisseurs who could bring many benefits and spread the ecosystem activities for a long time. I found the proposal innovative, because practically all the others I read about this challenge were targeting an older audience, already consolidated professionals. It is important to think about students, because they are a great source of knowledge propagation and can recommend ecosystem activities to colleagues, as they are all still in training and are almost always open to new experiences, waiting for opportunities to develop their own careers - very solo fertile for Cardano to grow and benefit (in addition to benefiting students, of course).", "q0r": 5, "q1": "The proposal authors seem very well qualified to manage the project, because as they say, they are familiar with the academic environment and have a lot of experience with the universe of cryptocurrencies and blockchain, claiming to have developed a dApp ([deqree.in ](http://deqree.in/)). They also have contact with a large number of people, which is extremely positive for the idea to spread and become popular. What I missed here was that they didn't make it clear that they would like to hire more people to make Cardonex, I think the idea goes beyond technical knowledge, it also needs an investment in production, after all, bringing people together involves several logistics, including organize spaces, transport, water supply and that sort of thing. I think it would also be important to hire a designer to make graphic material to publicize the event, even to circulate among the channels they already have, with a lot of visibility. For these reasons, I believe so, they are qualified for the proposal, but it is still necessary to think about other non-technical factors in the cryptographic world that are also involved here. Regarding the roadmap and expenses, we have information, but it lacks details, as I will explain below.", "q1r": 4, "q2": "The proposal authors describe very clearly and concisely which steps would be part of their larger plan, but I still felt there could be more detail regarding each activity itself. For example, when they say that the first phase is to bring students from different universities on board, it would be interesting to better situate, for example, how many students would be called, which universities would be targeted, how they would convince students to spend a little of their time to a cause they still don't know about... Another thing that could have been better detailed: how often the hackathons would happen, what is the average duration they intend to keep each encounter. A list of content that they would address, chronologically, in each hackathons could also have been listed, so that we could better visualize what each event would be like. Similarly to the presentation of activities, expenses were informed, how much would be allocated to each thing, but there could also be more details in this part, because, for example, in the organization of hackathons and deadlines, many things would need to be done. It would be positive to comment in more detail on each part of the budget breakdown. In terms of success metrics, we do. What is positive for the community to follow the progress of the project.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 6, "ne": 6, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "This proposal addresses the challenge by providing framework for a club that will foster and funnel high quality students into project catalyst and the cardano ecosystem. They will be sourcing young talent and providing them with the tools specifically aimed at increasing participation in funds 7 & 8.", "q0r": 5, "q1": "They have a great plan and have shared their roadmap for this proposal implementation. They dont necessarily have tons of experience, but at this point in time they have be more experienced than most. Being university studentds themselves, they understand first hand what will be needed to students to succeed.", "q1r": 4, "q2": "Their success map shows clear and measureable goals for steps 1-3. Step 4 doesn't show a direct way to audit, but step 5 can be measured to show the success at step 4.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "インド全土や発展途上国の大学生を仲間にできるようなクラブ作りを目指しています。", "experience": "私たちは、別のカルダノプロジェクト（deqree.in）を開発し、Plutusのパイオニアでもあります。私たちの大学の約5k+の技術系学生のグループを管理しています。"}