{"id": 367260, "author": "", "title": "University/College Outreach", "url": "https://cardano.ideascale.com/a/dtd/367260-48088", "category": 26105, "amount": 4900, "description": "私たちは、大学やカレッジの学生や卒業生に働きかけて、カルダノとその機会についての認識を高める必要があります。", "f6_no_assessments": 6, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem is clear and does seem to exist and is addressed in this proposal  (increase engagement in educational enviroments) as well as the community who would benefit from this (students and Cardano community). It's also completely scable to other country or educational institutions other than university and college (profissionalizeing or technical courses, schools, etc).\r\n\r\nHowever, the proposal could tell more about the content in the daily zooms and how the assisting in proposal development will be made. Also, not clear how the target audience will be engaged. What is special in these daily streams that is more appealing to university/college students? There could be a plan to bring external guests to these streams like people from business or tech world who uses cardano, proposals who already got funded, etc.\r\nIn addition, if project is already launched, what are its numbers (reach) so far? \r\nAlso, if, for instance, China is a target country, how to engage with non english speakers there?\r\n\r\nLast, It's said a social media campaign will be done but it could have more details on the proposal. ", "q0r": 3, "q1": "The project team is already committed and project is already running so its feasibility shouldn't be a big deal. Plan is sensible and budget is reasonable, brokendown fairly and not big.\r\n\r\n\r\n\r\n\r\n", "q1r": 5, "q2": "The kpis are clear, time-related and with target. Some milestones for the next months could be available though, specially if they intend to be self-funded - an extra kpi could be how much they are able to get with referal fee per week or month, to follow up with the self funded objective.\r\n\r\nIt would be nice also to breakdown the proposed kpis by the universitiies or country where the studentes who attended the streams are from.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is indeed tailored to reach awareness among college students. However, it seems to rely more on students that come to the channel \"Cardano Outreach\" than the opposite. That is, the platform has pointed no actions on reaching the fraternities, academic associations, or anything that can be translated into an active campaign to reach more students. Additionally, the uniqueness of this proposal is not clearly determined. What makes it better than any other educational channel for blockchain on social media?", "q0r": 3, "q1": "The fact that the proposers have previous experience on Catalyst and have implemented a social media campaign before is an indicator that they know what to do. However, the public engagement on \"Cardano Outreach\"  on Twitter is too low - so far, and not all the content published is related to awareness about Cardano or blockchain. On Twitch the profile has only 5 followers. Therefore, it's arguable that the proposal will be implemented successfully. ", "q1r": 3, "q2": "The proposers do not provide a \"A roadmap with milestones and a time horizon for achievement\".  Although they have presented KPIs, there's no indication of how they are planning to evolve in a certain timeframe, especially because they have mentioned that the strategy is to keep applying from Fund to Fund on Catalyst. In this case, if they don't get funded in a round, the project can be compromised. ", "q2r": 2, "assessor": "z_assessor_386", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is a good idea for educating and onboarding new entrepreneurs in the catalyst ecosystem. The new proposers will be assisted in their first proposal making. This is great, as writing a proposal for the first time can be intimidating. This proposal can have a significant impact on the community, if it is executed correctly. Based on all these evidences, I can  confirm that this proposal addresses effectively de challenge.", "q0r": 5, "q1": "That proposer has already conducted similar projects. They have previously has a proposal winner in fund 4. Besides, they have provided a precise plan, which is easy to follow, and a detailed budget breakdown. I think that all the keys component are in place for a successful implementation of this project.", "q1r": 5, "q2": "The KPIs provided in this proposal are clear an pricise. This is a good support to help the community measure the progress of this project.\r\nThis proposal has sufficient informations to be audited.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "I strongly agree that this proposal effectively addresses the challenge of reaching more proposers. \r\n\r\nLike Elon musk says that when you are in beginning of your life time, young, a young graduate or about to graduate, it is the time of taking high risks in life. Adding it now to the safety that Cardano project catalyst can provide in terms of financial independence, will be a huge catalyst to grow Cardano eco system. \r\n\r\nIn general, young minds bring in lots of energy and passion to anything that they work on. This proposal here essentially is targeting this group, and if we are able to promote what opportunities exist with Cardano then we should not be surprised if it brings lot of new ideas that present solutions to  real world problems.\r\n\r\n\r\n\r\n", "q0r": 5, "q1": "The team here is well experienced and have also received good attention from community in the previous funding rounds. Additionally, they have wide range of experience covering both IT and management/consultant experience. They have also outlined that they have already 2 students helping them with this proposal.\r\n\r\nBenefit of twitch streaming and social networking is that proposal can reach up to also universities which are in areas where students have lot of potential but lack jobs/infrastructure. IOHK has always given lot of important to academia, and imo this proposal is an extension of the same idea.\r\n\r\n The details given here are well written and imo make this highly likely to be implemented successfully. ", "q1r": 5, "q2": "I agree that the information provided here is sufficient to audit the progress and success of this proposal, \r\n\r\nhowever,   i think they should also mention, how success looks like, this will help community better understand on against what metric we should measure if this proposal reached its goal.\r\n\r\nI think such proposal must have some sort of feedback loop outlined in the proposal that gives community ability to find out if the proposal implementation has reached to its potential or not, and if not then what further as community we could do that the goal is reached to its fullest potential.", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 8, "ne": 3, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "I do not expect hundreds of new people from student lines to become proposers, so I rate the efficiency as low but can work. \r\n\r\nAnyway, this needs to be checked. See section below.", "q0r": 2, "q1": "I think this requires further investigation. I will raise my concerns:\r\n\r\nhttps://www.linkedin.com/in/jeff-g-30a144188/\r\n\r\n- 20 connections - very low, (for a person who is connecting \"universities\"\r\n- the same \"unprofessional\" picture\r\n- thousands of students on twitch and zoom! A former manager and university grad. - no proof nor link\r\n\r\n- https://twitter.com/CardanoOutreach   any pictures from your work? \r\n- https://www.youtube.com/watch?v=Hc89a8JfzgA who is this guy? how is he related to cardanoOutreach?\r\n\r\nI would need much more proof to see how it works. Right now, I could not find any proof of the working project, nor proof of a competent person (given the working proposal from the previous fund).\r\n\r\nalso, I found the twitch - DFQ is it?\r\n\r\nhttps://www.twitch.tv/cardano_outreach 5 followers!!! no videos. \r\n\r\nDOCTOR DEGEN? \r\n\r\n+ \r\n\r\nscreenshot (marked as content 18+) \r\n\r\nhttps://ibb.co/yXY1jpB\r\n\r\nI do not think they will deliver, since they failed to deliver at the former proposal - or I failed to find this massive outcome, what was planned.", "q1r": 1, "q2": "1. Number of people Engaged (200/day, responses, learning, referrals)\r\n\r\n2. Number of people Attended (100/day Zoom/Twitch)\r\n\r\n3. Number of Ideas Submitted. (30 per Fund, adjusted from 100)\r\n\r\nI think these are similar KPI from the previous proposal - any proof? \r\n\r\nI mean, it can be audited, but was it?", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal speaks well with the objectives of the challenge, because it intends to disseminate knowledge and contents of the Cardano ecosystem to the young/university audience, through the creation of a website and campaigns on social media, such as streams daily on Twitch. What I found most positive in this proposal is that, in addition to the plan already in action, the authors intend to reach a very wide range of people with their project, as stated in the project description, the contents will be directed to students of IT area and the most strategic countries to disseminate this knowledge, such as the US and India. In addition, the authors claim that there will be translation into Chinese and Korean. Because of this, I believe it is a very relevant proposal.", "q0r": 5, "q1": "The 2 authors seem very well prepared to carry out the project, because in addition to being already doing it, they add a satisfactory detail to the proposal description about who they are, what their professional areas, previous work experiences and a sense of your current situation. One of them, Jeff, attached the linkedin profile, which is super positive for us to know more deeply who he is, and both made available their personal contacts (e-mail), which shows a lot of devotion and willingness to dialogue with community and improve the proposal. Not enough, they intend to involve students as well, which is great because it's a pretty big project and it would actually need more than 2 people to run it. The only point I have to comment is that they could have shown their intention to hire a designer, because it will be essential to have graphic material to promote the campaigns on social media. But this is just a detail, I was very satisfied with what is provided to us.", "q1r": 5, "q2": "We know what the authors intend to do with this idea, where they intend to go (both in terms of which sites and platforms they will use and also what audience they aim to reach). We also know how the funding money will be shared. Unlike most proposals, this one asks for a very moderate amount, the only detail that I was in doubt is whether the students who would be called would also be paid. In addition to knowing what will happen, how and for how much money, the authors establish success metrics, which is also extremely positive, because it makes monitoring the community simpler and more accurate.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 8, "ne": 3, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "毎日のズームで教育し、ターゲットを決めて提案書作成を支援することで、ブロックチェーンへの興味をインキュベートしていくつもりです。", "experience": "Cardano Outreachの創設者であり、fund4の受賞者でもある私たちは、twitchやzoomで何千人もの学生にリーチしています。元経営者で大学卒業。"}