{"id": 369536, "author": "", "title": "🎬 \"Working Title\" Film Project 🎬", "url": "https://cardano.ideascale.com/a/dtd/369536-48088", "category": 26105, "amount": 56000, "description": "暗号通貨の領域を超えて、Cardano、Proj.Catalyst、そしてそれが開発者や起業家、そして世界に提供するものについて知っている人は非常に少ない。Catalystと、それが開発者、起業家、そして世界に提供するすべてのもの。", "f6_no_assessments": 5, "f6_rating": 2.4, "videos": ["https://youtu.be/EHMhiKFcnGY"], "media": [], "f6_assessments": [{"q0": "The proposers want to make a film about Cardano. Besides this, the project is very limited in defining various aspects of how this will be achieved.  The proposes give a general plan (Story development, project dev, secure financing, pre-production etc) but it feels like it is not enough for a film project. I would expect to at least have a script and a trailer for deciding whether it would be a worthwhile investment. Besides this, I would also expect to have some input from IOG, so attaining letters of intention (for participation in the film) from people like Charles Hoskinson would have improved the proposal.", "q0r": 3, "q1": "The team is made up of 2 persons who declare that they have 'combined 38 yrs entertainment industry experience'. Unfortunately, this is not of much comfort and uploading CVs would have been more ideal. There is a linked-in link to somebody named Jay Hunter who seems to be the co-proposer but this is not clearly indicated.  Nonetheless this person seems to be an actor based on IMDB and also has some minor experience in production.\r\nThis proposal is asking for $56,000 but it will need more financing in future proposals. This means that if this proposal is awarded, it could potentially never come to fruition if future proposals are not also awarded. ", "q1r": 2, "q2": "Vague terms such as \"facilitate maximum community involvement\" and about submitting future proposals. There is no clear goals and even more so there are no assurances as to the future of the project. While the final goal is to produce a film, there are no metric to assess the desired quality of such a film and the proposal itself says that it will require further financing.", "q2r": 1, "assessor": "z_assessor_281", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Using movies to promote catalyst to reach new proposers is a great idea to me. The problem stated in this proposal has its place in this challenge. My issue is that the proposer doesn't clearly explain how this project will beneefit the cardano ecosystem. I would also want to see some strong KPIs to back the idea. Du to a lack of critical informations, I don't see how how this proposal will scale in future fund. I think that with some adjustements, this proposal have good chances to be funded.", "q0r": 4, "q1": "This proposal contains  ressources and links about the team. According to the informations provided, the team has ressources to complete the project. They provided a roadmap and a budget breakdown. I would prefer and suggest that these informations be on the proposal, instead of providing outside files. From the files provided, the budget is broken down but I'm not able to judge if it appropriate. I didn't find a roadmap or a timetable, so I think they are missing. To sum it up, this project lacks a clear plan and some critical information to be implemented successfully.", "q1r": 3, "q2": "I didn't see a roadmap and milestones. I also didn't see KPIs on this proposal. These informations are critical, in order to track the progress of the project. Even though we know what they are trying to build and how, the missing informations make this project difficult to audit. ", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\n Yes\r\n\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\n Yes\r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\n If properly executed by people who understand Cardano it could be a way to raise awareness. But there are far too many variables to say it would show clearly.\r\n \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\nNo metrics or goals beyond a broad goal of making people aware of Cardano have been stated clearly. \r\n\r\n\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\nCreating awareness of Cardano falls within the scope of the challenge but it definitely does not fall within the scope of the challenge which is to make outsiders aware of Catalyst and its funding opportunity.\r\n \r\n\r\nCan the proposal scale to address future challenges?\r\n Yes perhaps by sequel films or spinoffs\r\n", "q0r": 3, "q1": "\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\n No links were given in terms of team members or sites\r\n\r\nAre these links sufficient?\r\n No links\r\n \r\nHave you the CA visited these links and contacted the relevant people?\r\nNo \r\n\r\n\r\nHave you been able to assess their level of competence?\r\nNo \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nNo \r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\n No team structure\r\n\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nYes budget is outlined clearly. There is a massive cost for a writer from WGA. I am sure that non union writers can be found for a fraction of the cost. This is an option worth considering to give this proposal a chance in the future. Also being clearer on the costs involved. In the budget here costs are given but theres no way for us to assess whether they're realistic or higher or lower than industry standards \r\n\r\nIS budget reasonable to achieve the set goals?\r\nIts impossible to say. Budget seems very high. This is only the pre production phase.\r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nNo\r\n \r\n\r\nHave you verified this plan?\r\nNot possible \r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nThere is no time table specified \r\n\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nThere is no plan laid out as this is just for the Phase 1 Story Development phase.\r\n\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\n The resources have been described.\r\n \r\n\r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nYes technical aspects of Story Development have been explained \r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo challenges have been addressed \r\n ", "q1r": 2, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nThere is a roadmap laid out but no milestones or time horizon for achievement.\r\n\r\n \r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nNo Metrics or KPIs are given\r\n \r\n\r\nIs there a clear understandable description of the targeted problem?\r\nThe targeted problem is generally defined since its a very broad area. Creating proposers using an action adventure film has not been defined  \r\n\r\nIs there a clear understandable solution that addresses the problem?\r\n\r\nThere is no clear understandable solution, since using an action adventure film is a general idea, but its never been done before and generally this sort of media is not what is used to promote new products like Cardano or Catalyst. Also the choice of genre is in my opinion not the ideal one to bring out new technologies or ideas like this.\r\n \r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNo \r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNothing is mentioned\r\n\r\n\r\nAre there contingency plans in place for various outcomes?\r\nNone\r\n\r\n\r\n \r\n", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "An interesting idea but something which I believe may not get the engagement it seeks to bring to cardano and catalyst. The idea to create a feature film seems to be an exciting one on the face of it, but the proposal is looking to secure funding to create the screenplay and link up with existing community members for product placement and I would suggest, at this point, it will not provide any proposer outreach to the requirements desired.", "q0r": 2, "q1": "With my 15 years of experience in marketing, I feel that this proposal will struggle to deliver a solid return or provide adequate KPIs to review success criteria. There is a broad brush approach to the delivery of the final film with the aim to reach a 'global audience' through tapping into an action/adventure entertainment market. I struggle to believe there will be the interest in this at that scale, and that a more refined audience segmentation would better suit any launch - a defined list of target consumers who may have interest in crypto but lack knowledge may provide the nudge required to investigate Cardano for example. In the proposal, there are a number of studios mentioned, but no verification of the relationships held with those organisations. The proposer should add more information here, perhaps specific examples of previous work with those studios, to support these claims. I also don't see any scalability in such an endeavour, and though their short-term goals are to engage with the community, it is not hitting the brief of \"proposer outreach\" at this time. Additionally, the requested budget only covers the first part of their roadmap, and there is no indication of cost for the other parts - if this is to be taken forward, there needs to be some indication of the cost for the delivery of the entire project. Delivering a screenplay without oversight of the full costs is not a good use of community money in my opinion.", "q1r": 1, "q2": "\r\nThe proposal states they will create a \"feature film & global distribution\" but what they are actually requesting is seed money to create a screenplay, which they hope to supplement with paid-for product placement/advertising. The metrics are too vague to be auditable or measurable. There needs to be a business case developed already, not promised in the next phase. Additionally, marketing for a film is not cheap and the proposer needs to provide much more detail on their audience, geographies, advertising mediums, etc. than just provide a generic line on out of home and social media advertising. I would ask that this proposer returns with a much more detailed business case, outlining overall budget requirements, timescales and risks that may impact the project.", "q2r": 2, "assessor": "z_assessor_483", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "hard to predict the efficiency, but if we make an action movie, the outcome is that we attract a group of people, where only a small portion of them will eventually end up being proposer.\r\n\r\nWe can definitely increase the number of wallets :) but hard to predict how many of them will end up as active members, proposers...", "q0r": 3, "q1": "it would be nice to see some outcome of this 38 year experience, did not find them\r\n\r\nno link for the original proposer\r\nonly relevant experience stated, yet, it requires more proofs to acknowledge the competence ", "q1r": 3, "q2": "we can only measure number of views. Unfortunately, I do not see a way how to measure it.", "q2r": 2, "assessor": "z_assessor_54", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "提案者、彼らのエンターテインメント業界の人脈、そしてカルダノコミュニティは、長編映画と世界的な配信でこの状況を変えていきます。", "experience": "提案者は、合計38年のエンターテインメント業界での経験を有しています。\n\nベテランのカルダノ関係者。 mbr: 本映画の指定技術顧問。"}