{"id": 369749, "author": "", "title": "Proposals Mentors Marketplace", "url": "https://cardano.ideascale.com/a/dtd/369749-48088", "category": 26105, "amount": 39000, "description": "提案者は、Catalystのプロセスを円滑に進め、質の高い提案を提出することが難しいと感じています。", "f6_no_assessments": 8, "f6_rating": 4.5, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=4473"], "media": [], "f6_assessments": [{"q0": "As matching new proposers with mentors may result in an increase of ideas submitted from new members of the community, the proposal effectively addresses the challenge. An influx of new members and ideas has a positive impact on the Cardano ecosystem.", "q0r": 5, "q1": "The proposers have outlined a plan with various options to implement their idea and showcased that it is highly likely that this proposal will be implemented successfully with an understandable and reasonable budget breakdown.", "q1r": 5, "q2": "The key metrics make sense and are easily auditable. The assessor confirmed with the proposing team that this solution will be open-sourced, increasing the auditability score even further.", "q2r": 5, "assessor": "z_assessor_22", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the problem at hand referring to proposals that could not be funded during the fund 5 process due to lack of proper presentation ", "q0r": 4, "q1": "The team has adequate experience to execute the proposal and have given detailed outline of plan of execution which makes it quite visible.", "q1r": 4, "q2": "There is detail budget attached here which makes the proposal auditable ", "q2r": 4, "assessor": "z_assessor_270", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "YES! A big YES! This goes beyond submitting proposals and drives submitting QUALITY PROPOSALS. As I started reading the proposal, I was immediately inspired and started getting ideas...\r\n\r\n\"Hey, this could go hand-in-hand with projectcatalyst.org\"... oh, it's there.\r\n\r\n\"Hey, you could do this on-chain\"... oh, they've thought about it. Should this be successful in incentivizing mentor-proposer relationships, the smart contracts can then be extended to automate most of Project Catalyst incentives - taking a load off of IOG's shoulders and enabling further decentralization.\r\n\r\nI initially thought this would be a great way to match experienced CAs with the proposers whose proposals they fall in love with during the assessment period. But, coming to think of it, this should allow any Project Catalyst member (lurker, proposer, team member, voter, CA, VCA) to contribute to a project at any point of the project's lifecycle.", "q0r": 5, "q1": "The plan is really well thought-out and the proposers are definite pros. The partnerships seem to be well-chosen and there's willing to do this together with the rest of the community.\r\n\r\nShould the funding be granted, this will be done. No doubt about that.\r\n\r\nI have been both a Proposer and a CA and I know the frustrations on both sides. This could help alleviate the frustrations, help Project Catalyst scale and increase the quality of proposals.", "q1r": 5, "q2": "All success metrics are in place and it is easy to track the progress of this proposal. It's good that the financial sustainability of the proposal is considered already at this point. The free version is the way to go in the beginning.\r\n\r\nMy only concern is, who will get to decide a) if and when a fee is levied and b) who decides where that money goes?\r\n\r\nDevelopment idea:\r\nThis could be the first step towards a Catalyst DAO where the entire community gets to have a say in such governance decisions and where a native governance token drives decentralized democracy and allows people to participate on an even keel, regardless of their ADA holdings.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The idea is really great and certainly could help people to build their proposals and enrich their ideas. However, if the fee based model is fully implemented, it would limit the reach to those who already can afford. A way to overcome this would be a hybrid model where those who can pay for this service do so, but those who cant are able to apply for some financial aid from Cardano community. It would extend the reach of the second fund model (let's say, for instace, to low income country as the ones in Africa) without fully overloadind the Cardano community (as in the first model). Another way to extend even more the reach of it is looking for extra mentors from different countries or who speak different languaged other than english (when the platform grows).\r\nA main concern here regarding the campaign as a whole (proposer outreach) is that this solution alone maybe  wouldnt bring much new proposers, at least at firts (thats why I'm not giving a 5), but it will certainly increase the quality of the new proposals. A proper communication plan and marketing strategy could help overcoming this.\r\nOther thing that could be added here is how the platform will ensure mentors are qualified and how they will be ranked. Will there be a selection process? A Curriculum analysis? Mentors with not enough qualification could lead to a bad experience here.", "q0r": 4, "q1": "Two qualified  mentors seems enough for a MVP. Developers will be hired and thats definitely essential. Just not giving 5  because its still needed to hire 3 developers (they are not part of the team yet).\r\n\r\nProject plan is satisfactory and budget breakdown seems sensible.", "q1r": 3, "q2": "Metrics are sensible but it could have some target spread out in months or funds.\r\nsome extra metrics could be: # of people after a mentor, success rate comparison from people who applied before and after platform usage,\r\nrate of conversion (# of proposal approved submited by people who used the platform/# of total proposals applied from people who used the platform).\r\n\r\nsome risks could have been considered in the proposal related to the quality of mentors and how to address that.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal supports the challenge objectives by providing a building block to help facilitate  production of better quality proposals. It will also act to simplify the process for proposers, especially new ones who won't necessary understand the nuances within the catalyst voting process. As a CA/vCA in catalyst and through running countless project review boards i have read through many proposals/business cases/change requests to come at this with first hand experience.", "q0r": 5, "q1": "i assume the plan, budget and resource estimates for the build have been validated by Blace.io. They all look sensible for the production of a working tool.\r\nHaving said that, ideally a breakdown of the technical delivery for each sprint would have been provided. ", "q1r": 4, "q2": "The high level milestones are clear, However the success criteria could be smarter eg.\r\n- X of mentors registered and active on the platform (a definition of active is required)\r\n- x proposers matched with mentors\r\n- x mentored proposals funded in fund 7/8 (?)'  \r\nMaking these specific provides greater assurance to the community that we will get value for money. at the moment the proposal says we will build a tool and count some stuff (mentor, proposer participation) so the only piece it actually commits to is building a tool which is only half the battle.\r\n\r\nIn addition the risks/mitigations should be called out: eg the obvious one is that Blace.io do not proceed  or suitable developers cannot be found in time or development time/cost runs over budget.\r\n\r\nThe additional aspect not covered in this proposal is around mentors. Is there a willing cohort of people willing to become mentors? is there a mentor onboarding approach (could be another proposal or an extension to this one) or even a mitigation (ie pivot the project to focus on mentors if the technical build is taking longer than expected to get off the ground)", "q2r": 3, "assessor": "z_assessor_45", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\n Yes. The difficulty proposers face in submitting high quality proposals which obtain funding.\r\n\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\n Yes. \r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nYes \r\n \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\n Three metrics have been specified.\r\n\r\n\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\nYes\r\n\r\n\r\nCan the proposal scale to address future challenges?\r\nYes \r\n\r\n\r\nThe project meets the requirements to create an Impact.\r\n \r\n\r\n", "q0r": 5, "q1": "\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nYes he has provided profiles of team members and links to the funded projects they have done.\r\n \r\nAre these links sufficient?\r\nYes \r\n \r\nHave you the CA visited these links and contacted the relevant people?\r\nYes\r\n\r\n \r\nHave you been able to assess their level of competence?\r\nyes they are competent. \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nYes  \r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nYes they have \r\n\r\n\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nYes\r\n\r\nIS budget reasonable to achieve the set goals?\r\n Yes\r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nNo verifiable plan for additional funding \r\n\r\nHave you verified this plan?\r\nNo \r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\n \r\nYes timetable is realistic\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\n\r\nYes it is sensible and conductible.\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nYes the resources are adequate.\r\n \r\n\r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nYes Technical aspects like blace marketplace are explained. \r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\n Yes they have been considered to an extent.\r\n \r\n ", "q1r": 5, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nYes\r\n \r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nYes.\r\n\r\n\r\nIs there a clear understandable description of the targeted problem?\r\nYes the problem is clear.\r\n\r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nYes. \r\n\r\n \r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNo challenges have been identified.\r\n\r\n\r\n\r\n\r\n \r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNone identified.\r\n\r\n\r\n\r\nAre there contingency plans in place for various outcomes?\r\nNo\r\n\r\n\r\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 8, "ne": 3, "ng": 2, "nfo": 3, "vca_o": 1}, {"q0": "The proposer has clearly defined the problem and provided statistics and real world experience of it to back it up. They have also offered us a very clear and concise solution, with a benefit hypothesis.\r\nOffering proposers a method to engage mentors ahead of submitting a proposal means that their time will be spent more efficiently. I feel that this will provide a wholesome and beneficial experience of Project Catalyst process, which is necessary if we are to increase the attraction of people that are currently outside of the Cardano community. ", "q0r": 5, "q1": "The proposal plan shows that the team has the relevant experience and understanding to be able to execute the solution well. \r\nThe proposed timeline looks sensible and by providing an MVP allows the plan to be adjusted to ensure that value is being delivered. \r\nAs a SAFe certified Agile coach I can see that their understanding of the personas that will be involved in the solution and the value that it will provide is clear. \r\n", "q1r": 5, "q2": "The KPIs are clear and will measure successful update of both user journeys.", "q2r": 5, "assessor": "z_assessor_518", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The idea is perfect, but having a platform only for mentors feels limiting. I suggest increasing the scope and join forces with a similar idea.\r\n\r\noverlap with \r\n\r\nhttps://cardano.ideascale.com/a/dtd/Cardano-Community-Campus/369923-48088\r\n\r\nI can find it better to have a platform, for example:\r\n\r\n1. mentoring\r\n2. looking for members\r\n3. looking for a project\r\n..\r\n..\r\n..\r\n\r\nrather than only\r\n\r\n1. mentoring ", "q0r": 4, "q1": "cardano AIM team is legit, I believe they can deliver since they already delivered previous tools to the finish line.\r\n", "q1r": 5, "q2": "definitely can be audited.\r\n\r\nMany key metrics can be measured \r\n\r\nnumber of users\r\nnumbers of mentors\r\nstats over time", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "提案者が、確かな提案をするのに役立つ熟練したメンターを、カルダノのコミュニティから見つけることができるプラットフォームを開発する。", "experience": "アレックスは、23年以上にわたり技術系ビジネスに携わり、チームを率いてビジネスを立ち上げてきました。フィルは、アクティブなコミュニティメンバーであり、提案者であり、CAであり、メンターでもあります。"}