{"id": 384223, "author": "cargofe2", "title": "Colombian Congress Cardano", "url": "https://cardano.ideascale.com/a/dtd/384223-48088", "category": 26235, "amount": 4500, "description": "Колумбийские конгрессмены нуждаются в качественной информации о Cardano для принятия лучших законодательных решений по криптовалютам в 2022/26 году", "funded": 2, "upvotes": 126426982, "downvotes": 4706993, "votes_result": 121719989, "votes_cast": 479, "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Формулировка решения является разумной в свете формулировки проблемы, и обе они четко сформулированы. Учитывая, что задача направлена на активизацию адвокационных усилий по лоббированию и просвещению политиков с целью разработки более совершенных законов и нормативных актов, благоприятных, в частности, для Cardano, предложенный испаноязычный цифровой учебник для распространения среди колумбийских законодателей имеет смысл. Отсутствие точной и доступной информации о Cardano, написанной на испанском языке, является основным препятствием для адвокации в испаноязычных странах. Поэтому такой инструмент может быть полезен во всей Центральной и Южной Америке. Учитывая скромный предложенный бюджет ($4 500) и потенциальное масштабируемое распространение руководства, проект представляется хорошим использованием казенных средств. Тем не менее, в предложении мало деталей, объясняющих, почему адвокация необходима именно в Колумбии. В целом, я согласен с тем, что данное предложение эффективно решает поставленную задачу.", "q0r": 4, "q1": "Члены команды обладают обширным консультационным и юридическим опытом, связанным с Колумбией, а также связями с колумбийским правительством. Тем не менее, размер и масштабы этой социальной сети неясны. Более того, неясно, каким образом руководства будут распространяться среди членов конгресса или их сотрудников (например, по электронной почте). Из моего личного опыта подготовки спонсируемых исследований государственной политики и распространения их результатов среди законодателей штата и членов Конгресса следует, что получить такую информацию в руки нужных людей довольно сложно. Такие лоббистские усилия часто требуют многократного повторного обращения к сотрудникам, а в некоторых случаях могут привести к просьбам о телефонной конференции или встрече в формате Zoom. Предложение не содержит четких планов относительно таких последующих действий. Более того, в предложении не указано, кто из членов команды является экспертом по блокчейну/кардано, ответственным за составление цифрового руководства. Будет ли это сделано на субподряде или одним из членов команды?", "q1r": 3, "q2": "Хотя разработку и выпуск испаноязычного руководства по Cardano легко проверить, \"дорожная карта и основные этапы\", предоставленные командой, расплывчаты или трудны для понимания. Я бы рекомендовал команде сделать эти этапы предельно ясными. Более того, KPIs/метрики, перечисленные в предложении, являются спорными. Большинство показателей направлены на измерение количества руководств, направленных членам Конгресса Колумбии, а не влияния этих руководств (что, конечно, трудно измерить) или количества последующих коммуникаций между командой и заинтересованными членами Конгресса (что, по моему опыту, является лучшим результатом, на который можно надеяться). Информационные руководства обычно используются для того, чтобы начать разговор с законодателями и их ключевыми сотрудниками, что может привести к даче показаний в конгрессе или принятию закона (наша конечная цель). Таким образом, я не согласен и не согласен с тем, что данное предложение предоставляет достаточно информации для сообщества, чтобы проанализировать будущий прогресс.", "q2r": 3, "assessor": "z_assessor_914", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The plan in this proposal is to create an informational chart accompanied by infographics with the purpose of providing Colombian congressmen with correct information from our viewpoint. This with the intention of them making more favorable decisions based on correct information. It could set the basis of a more friendly environment in Colombian congress towards crypto in general, which would enable an array of possibilities. ", "q0r": 5, "q1": "The proposing team have well documented themselves in the proposal. They are also exceptionally well placed to perform this task. Having a team member who is a former official of Colombian congress enables the proposers to know how things happen on the inside and gives them an edge to plan their approach, which will look professional towards the congressmen. The budget is modest, but not unrealistic. ", "q1r": 5, "q2": "Incredibly detailed proposal with very clear KPIs included. To even improve, a clarification on how the risks in the risk analysis could be mitigated could be included. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 25, "ne": 2, "ng": 22, "nfo": 1, "vca_o": 1}, {"q0": "I really like the idea. Going forward to the people who are decisive - congresmen, in this case, may be a great way to educate them. Well-organized, short but informative one-pagers may bring more awareness and really influence further decisions. Such materials should be not only available to Latin America users but later translated and adjusted to other languages and cultures. It's a chance for a global face-to-face education for politicians.", "q0r": 5, "q1": "2 lawyers in the team, one with experience in politics is heart-warming in such project. It seems they are well prepared to complete what they aim at. Especially as the proposing team claims they are after first talks with targeted people. Budget is reasonable and well explained. Plan has possible dates.", "q1r": 5, "q2": "If proposers take it seriously and will monitor their effectiveness as promised - there should not be any problem with auditability. This will however require a lot of effort, to monitor later legislation processes. I keep my fingers crossed. ", "q2r": 5, "assessor": "z_assessor_324", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "i strogly agree because the problem needed to be solved has been identified in the challenge and falling within yhe scope.\r\nAnd will also add value to the cardano ecosystem.\r\n\r\nkey metrics and goals are been stated clearly and falls with the scope of the challenge and can scale to address  future challenegies to.", "q0r": 5, "q1": "the proposal has provide accurate links and references that show relevant skills and experiences needed to implement the proposal.\r\n\r\nTheir level of competent is good and the proposal have also listed in manner the number of team memebers required to implement the proposal, and team structure is also good.\r\n\r\nHas a reasonable bedget and clearly break down into identifiable items in order to achieve the set goals...\r\n\r\nthe proposal has a provide a realistic timetable to complete the work if funded.\r\n\r\nThe plan of the the proposal also describes the necessary resource to implement it.\r\n", "q1r": 5, "q2": "I strongly agree due to the providing of road maps and has likns to audit  them if project is funded.\r\nall clearly metrics/KPI's define thhe success of the proposal\r\n\r\nthere is also a clearly understanderble describtion of the targeted  problem and a clearly understanderble solutions to address the propoasal.", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": "Great proposal. The target of congressmen is great. I think they are the exact group the challenge is seeking to influence. ", "q0r": 5, "q1": "Great team experience. I think one of the KPIs has been given an inappropriate metric. It is not helpful to measure number of congressmen informed but rather, the number of legislative initiatives or private member bills on favorable legislation by congressmen was targeted by the organization's activities. Building collaboration is great as well. I think aspect of the proposal should be given a relook.", "q1r": 3, "q2": "Great road map and detailed budget. The proposal should consider documenting of activities to enable easy auditing. ", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The proposal addresses many metrics of the challenge, however the final version of the document cannot be sufficiently imagined when going solely from the proposal description. ", "q0r": 4, "q1": "The credentials of the team are sufficient and even impressive, due to the claim of having some access to the Congress. In the end it depends in what way CryptoCurrency and blockchain will be presented to the presiding Congress so that it will hopefully complement their current plan and goals. ", "q1r": 4, "q2": "The document itself can be easily audited for progress. The Congress votes and deliberations are also usually public. ", "q2r": 5, "assessor": "z_assessor_832", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Для этой целевой группы населения будет создан информативный и наглядный цифровой документ, который можно будет легко и быстро понять.", "experience": "Консультант с 15-летним опытом работы, бывший сотрудник конгресса с обширными знаниями целевого профиля"}