{"id": 384442, "author": "brandon.philippe", "title": "Friends of Cardano (US Chapter)", "url": "https://cardano.ideascale.com/a/dtd/384442-48088", "category": 26235, "amount": 12750, "description": "Мы не организованы для объективного участия в политических дискуссиях, поэтому циклы новостей сеют страх, неуверенность и сомнения.", "funded": 1, "upvotes": 52662554, "downvotes": 19003149, "votes_result": 33659405, "votes_cast": 370, "f6_no_assessments": 3, "f6_rating": 3.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "The project intends on creating a discussion forum for lobbyists and lawyers to subject the US federal legislation on cryptocurrencies to deepgoing analyses. The outcome would be consistent information that provides ammunition for lobbyists, making their work easier and more efficient, while also creating a more coherent source of information to convey. This is a needed initiative to aid the lobbying work in reaching their goals. ", "q0r": 5, "q1": "The author claims to have relevant experience in US federal legislations. However, there is no evidence that points towards experience in creating networked fora. The team has not been identified further than 'four persons with relevant professional and academic experiences'. Some more in-depth identification of the skillset of each team member could mitigate uncertainty over feasibility doubts. ", "q1r": 3, "q2": "The objective of the plan and how each problem has been thought over and is to be solved is communicated. But to better understand this in a context, it needs a roadmap. By doing so the reader gains the ability to interpret the work that has to be done to bring this plan into reality and determine a possible release date of these documents. ", "q2r": 3, "assessor": "z_assessor_113", "no_vca": 21, "ne": 5, "ng": 15, "nfo": 1, "vca_o": 1, "reply": "Thank you for taking the time to consider and for offering your feedback. The feedback will help us better manage and deliver on what the community expects.\n\nFor your edification, abbreviated skill sets:\n\nMember 1: Federal regulations specialist; Econ and American politics major.\n\nMember 2: project manager for a multinational IT company; master in business and information systems\n\nMember 3: financial associate at a large banking institution; Econ and math double major\n\nMember 4: independent consultant/contractor for governmentally granted organizations; political science major, master of divinity"}, {"q0": "This proposal directly addresses the challenge.  Problems are clearly defined and matched with well thought out solutions.  It sets out to create an infrastructure of support and tools for lobbyists.  The proposal aims to inform the community on legislation issues and it seeks to garner feedback and support from community members on proposed solutions to assist lobbyist efforts. ", "q0r": 5, "q1": "With 10+ years experience in federal regulatory framework, the proposer appears amply qualified to undertake the task.  The plan appears to be logical and well thought out.  The goal of the proposal is to affect, promote and encourage regulation which is beneficial to Cardano, this seems imminently doable.  ", "q1r": 5, "q2": "The proposal specifically mentions that a catalogue of relevant information would be created to track progress of regulation.  Although not specifically mentioned this appears to be a good method for tracking the progress and success of the proposal.  Even with modest success of this proposal a very small change to legislation wording could have a huge impact on the success of Cardano.", "q2r": 4, "assessor": "z_assessor_505", "no_vca": 18, "ne": 5, "ng": 10, "nfo": 3, "vca_o": 1, "reply": "Thank you for taking the time to consider and for offering your feedback. The feedback will help us better manage and deliver on what the community expects."}, {"q0": "This is a proposal towards providing full internal information to the community, towards transparency and prompt information to users, avoiding the lack of information, causing confusion and suspicion in the community. While official communication in the Cardano community is usually fairly quick at the moment thanks to SPOs, it is also necessary. But the project has not detailed where the information and sources come from, and how to verify, how to organize information for science, as well as a specific roadmap and target audience. clarity.", "q0r": 3, "q1": "The idea is possible, but it requires a clear roadmap, relevant expertise and more details on how to implement and scope of implementation.", "q1r": 3, "q2": "This proposal empowers the community to verify and share information more broadly. At the same time, it is necessary to have a tool to scientifically organize the shared information to achieve the effect of internal communication in the community.", "q2r": 3, "assessor": "z_assessor_648", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1, "reply": "Thank you for taking the time to consider and for offering your feedback. The feedback will help us better manage and deliver on what the community expects."}], "solution": "Создать пространство для распространения и анализа федеральной политики и оценки ее влияния на сообщества Cardano.", "experience": "10+ лет обучения и опыт кодификации законодательства в федеральные нормативные акты, толкования нормативных актов и руководства по подзаконным актам."}