{"id": 398936, "author": "konmaorg", "title": "DLT based student credential system", "url": "https://cardano.ideascale.com/a/dtd/398936-48088", "category": 26435, "amount": 60000, "description": "The performance tracking system of teachers and students is fragmented from primary to higher education.", "funded": 1, "upvotes": 33229770, "downvotes": 17178248, "votes_result": 16051522, "votes_cast": 149, "f6_no_assessments": 7, "f6_rating": 3.952380952380952, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=12774"], "media": [], "f6_assessments": [{"id": 3559, "q0": "This proposal highlights the tremendous potential contribution of blockchains towards betterment of education. In this case, the Cardano blockchain will function as a Distributed Ledger Technology (DLT) to identify and track performance of students and teachers thus addressing the need for foundational registry solutions stated by the challenge. \nThe proposer refers to paper by Park (2021) which describes potential benefits of utilizing blockchains in the education sector of which employing blockchains for educational administration as according to the proposal can support authentication of identities, certificates, and records. \nHowever, while the assessor agrees that the idea proposed is good, the proposal could be much improved by emphasizing the greater benefit of supporting educational administration by blockchain. The assessor recognizes that particularly in developing countries, there is a need for a verifiable unified educational database due to difficulties in record keeping and to prevent fraud or misrepresentation of data. Mentioning the problems created by the the currently fragmented performance data could strengthen the argument towards the need for a Cardano supported identity and performance tracking Dapp. \n", "q0r": 4, "q1": "The proposers have divided the timeline into three phases beginning with the lobbying process to the Ministry of Education (3 months), the Dapp development (3 months) and then proceeding to the deployment and marketing of the Dapp (6 months). While the timeline as it is might be doable, delaying the development of the Dapp to the end of the lobbying process may result in a lost opportunity as the lobbying process might be helped by the presence of a working or at least an initial version of the Dapp. It is thus better to conduct the lobbying process at least parallel to the development process. This will also be a more effective use of time since development will begin early and the feedback from the lobbying process may improve the Dapp. \nThe details of what is conducted in each phase and how it is conducted can be improved, especially for phase 1 and phase 3. At the proposal’s current condition, important questions remain :\n-\tWho will the team meet at the Ministry? Will he or she have the authority to decide or will the proposal be brought to a higher level? If it does need to be brought to higher authority, will three months be sufficient obtain a favorable decision?\n-\tWhat will ground team training consist of? Who will be the stakeholders the teams will meet to disseminate awareness of the program?\n-\tWhich provinces will be prioritized early on? Is there a specific reason why?\nThe answers to these questions will also justify the size and division of the budget. The current breakdown of the budget is still very vague. Funds are divided into the three phases, but it is unclear what those funds be used for in each phase. A more detailed action plan can help clarify this. \nThe proposers should realize that it is very likely that government institutions may meet the proposal with skepticism. Thus, the possibility of rejection or non-committal reception is likely. The proposers should prepare an alternative approach in anticipation of this. For example, the team may plan to then directly approach schools that can independently decide to buy in to the proposed Dapp, such as private schools. \nIn regards to the team members present, while the assessor can deduce who will be responsible for each specific phase, the division of labor is not clearly stated in the proposal. The proposers should also describe previous projects and experiences of team members relevant to the proposal in addition to credentials presented in their LinkedIn profiles. Doing as such will reinforce the proposal and strengthen the reasoning of the feasibility of the plan. \n", "q1r": 2, "q2": "The proposers specify the total number of schools and colleges onboard as a KPI for progress. However, it is not mentioned what can be categorized as “onboard”. Does it mean that performance records for all students and teachers are present in those institutions the dapp? Or is a partial population per school considered acceptable?\nWhile indeed the proposal also mentions the number of active users on the dapp as a metric, it is also unclear what constitutes an active user. Are active users the number of individuals whose performance data is present and continually recorded? \nThe last metric is also unclear as the measurement of “Dapp performance metrics” is also vague. What kind of performance metric will be considered? \nThe timeline for the project proposed is 12 months. Meanwhile, their marketing and deployment phase is half that. With this in mind, the proposers have also not mentioned the how they wish to measure their KPIs and at what frequency as the timeline for deployment is short. \nThe proposers envision success as the implementation of the solution at 15% of educational institutions in Sri Lanka in the first year. Will the first year include the lobbying and development phase? Or will the first year mean the first year since deployment and implementation? The proposers should clarify definitions and milestones set.    \n", "q2r": 2, "assessor": "z_assessor_1662", "no_vca": 5, "ne": 5, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 1283, "q0": "Registries of credentials is a major focus of this challenge. This proposal addresses one of the central problems of the challenge. \n\nIt is currently difficult for people in many parts of the world to prove that they have the education and credentials that they do. The Atala Prism addresses that problem. This proposal would use those tools, as designed, to produce a pilot program in Sri Lanka. \n\nThe proposal envisions this program being repeated in other places, this is perfectly in line with the challenge.", "q0r": 5, "q1": "It is unclear. The author may be a business name or an individual. The proposal mentions individuals with experience developing on Cardano. However, those people are not listed and there are no previous successes listed. \n\nThe auhor, Konma, appears to be a business selling health and beauty products. It is not clear what the connection to nation building dApps is. ", "q1r": 3, "q2": "It is unclear what connection the team has to the community. The assessment criteria are vague. Counting the number of schools involved is important. Supplying some goals would have been helpful.\n\nThe budget information seems insufficient for a project like this. Development times for any of these technologies are very time consuming. The section for development seems insufficient.", "q2r": 2, "assessor": "z_assessor_1336", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3370, "q0": "They has illustrated very clearly the context behind their solution, the positive relationship between eduction and blockchain technology. This helps the community well understand how blockchain technology can be applied in education, thus improving the quality of eduction in general. The idea and main functions of the solution are covered in the proposal. Some specific statistics about the demographic of the education is also provided, which ultimately enables the community to get a overview of their targeted market and audience. The expected outcomes of the project is well set, which are closely aligned with the key merics of the challenge. \nThe main challenges are well described along with suitable mitigation strategies. Their solving plan is well linked to the predicted problems. A small suggestion of from me is that they can breakdown a bit more their mitigation plan including what specific steps they will take, the expected outcomes of these steps and how these outcomes contribute to the challenge mitigation. By doing this, they can show the community their proactivity and flexibility in risk management.", "q0r": 5, "q1": "The action plan is presented very specifically with 3 main phases follow by particular durations and relevant subtasks, helping ensure the operation process run smoothly. They are very attentive about the deliverables of the project, enabling them set a clear direction for the development of their project.\nA very detailed budget breakdown is also highlighted according to their delivery plan. This allows the community to determine the effectiveness of their spending and whether the tem can keep finances on track.\nThe team members are professionally displayed through an attached links. The community will find all information about their current members including name, position, background, working experience and LindedIn account. This reveals their huge potential in operating the project effectively.", "q1r": 5, "q2": "Some key KPIs are mentioned in the proposal, allowing the measurement of the project’s performance. These indicators are in tune with the positive results that they expect and the objectives of the project. To better compare the outcomes and assess their development, they can provide some specific required numbers to mark these deliverables as successful. This will also make it easier for the community to acknowledge and track their success. \nA clear picture of their success coming wth specific goals is firmly set. Based on their capacity, these goals are attainable and can help them stay focused during the implementation process. Using these expected numbers, the community can better evaluate their project and benefit their decision-making process.\n", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3706, "q0": "Grades help understand the various topics and subjects which one must be taught in each section and how the level of each subject must be increased. Grades actually provide a proper learning methodology that must be followed in order for the student to understand the concept well. Introducing the grading system in this platform is very good idea. The proposer has uniquely identified a need for DLT based student credential system and has also worked towards the implementation which is impressive and it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has also mentioned the key metrics which will be helpful in the success of this proposal. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 5, "q1": "The proposer has a very innovative idea of introducing DLT based credential system and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and his team seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. he proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 60000 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more buyers which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4798, "q0": "This is a very good idea for students and teachers because they would have more knowledge about block chain market. As the situation now, the teachers and the students have little understanding about this sector. If there is block chain technology applied in education, it could be the best tool to replace the traditional one in many educational institutions. It is reasonable to provide the context in the proposal, and it is illustrated understandable. But it can be more generalized as the description now goes into many details. It may distract the readers from the main idea of this part. The information is cited from another source with the link making it more reliable. There are not many proposals that can add such a good point. Moreover, the plans are deployed so clearly and organized such as in the proposed plans and demographics, in case you add more explanation in proposed activities, it could be beneficial. The link of the previous research is also shared, which means the team made a lot of effort in the process of doing the proposal. The key metrics are matched with the challenge however, it could be better if there are expected numbers such as the number of students and teachers trained to utilize the solution.", "q0r": 5, "q1": "It is a good idea to divide the timeline into 3 phrases along with the time. But if the time is separated into smaller such as in three months what activities are implemented in the first month, the second and the last month. It could be even better for 6 months with more detailed activities listed in this specific time. The budget is prepared and planned carefully, but you can analyze it more specifically with how much budget would you expect to use in legal, financial, education, technology expert. The same as in development, deployment, and marketing. The team listed in the link have experiences related to the field and they are suitable for working for the proposal. Each member is provided with contact and LinkedIn, this creates evidence, makes the proposal more reliable. Moreover, some of the team members are the leaders of the institution, this can easier to contact schools, universities, students. As a result, the team may implement the plan more successfully", "q1r": 4, "q2": "The key points to measure the success of the project are reasonable but why don’t you add the expected numbers for the total number of schools and colleges on board, active users, performance metrics. Because the detailed plan could be an advantage of getting the proposal funded. The criteria to measure the development is presented sufficiently and well-organized, it is easy to follow and evaluate. There is one additional part that can be added, if you have any previously funded project, it can be considered to list here or any ongoing project can be evidence to show your experience in getting a successful proposal", "q2r": 4, "assessor": "z_assessor_1773", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5314, "q0": "Developing a blockchain-based platform that protects students' and teachers' digital identities would reduce security risks and increase the use of blockchain and crypto in education. The thesis presented to take the reader to the proposal's main point is quite detailed and thorough. The proposer, on the other hand, claims that they must lobby the Education Ministry and propose the concept. This is frequently challenging and necessitates a well-thought-out strategy in order to be accepted. Because the proposer did not provide a solution in the proposal, I doubt the problem would be simple to solve. Despite the fact that the proposal recognizes this issue and includes it in the main challenge, as well as the uncertainty of blockchain and crypto regulation, they have not provided a convincing answer for it. I believe that a lack of certainty in the regulation of blockchain and crypto will result in the security of digital identities not being fully guaranteed. As a result, I propose that the proposal find a solution to the blockchain problem, and then submit an error-free proposal to the Education ministry. To ensure that this project gets accepted first, we must guarantee that we are prepared for any challenges that may arise.", "q0r": 4, "q1": "According to the timeline, the proposal will take 12 months to complete. It is simple to follow the plan by dividing it into three phases and explicitly stating the work that must be completed in each phase. The first phase, lobbying with the Ministry of Education, will take three months, which is a reasonable amount of time and budget. If phase 1 is successful, phases 2 and 3 will be implemented. However, the proposer could go into further detail about what the executives will perform for each phase or for the entire project. Having a general idea of how many employees will work as planned can also help in better asseting the project. The proposer has a link that contains all of the team's information and is prepared to work in Sri Lanka on this project. In my perspective, the project has potential, and the team has the ability to properly implement the project.", "q1r": 4, "q2": "The proposer mentions three measures for success in this project, but does not specify how these three measures would be evaluated. For example, given the project's scope of schools within Sri Lanka, how many schools must be on board to be considered a success for the project? And what is the proposer's expectation for the number of active users after six months or every 3 months? These details are critical for the community to track progress, and they must be presented in a clear and concise manner. The project's auditability is difficult because there is no mention of the security risk of storing students' and teachers' digital identities. The KPIs, on the other hand, are successful in aligning with the challenge setting. I am hoping that this project has a significant impact on National Building Dapps.", "q2r": 3, "assessor": "z_assessor_1934", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10669, "q0": "I strongly agree that this proposal effectively addresses the challenge.\n\nThe proposers are opting for application of DLT to better manage the tracking performance and credentials of teachers and students with the aim of replacing the current fragmented system. \n \nThe proposers gave statistical data of the education system in Sri Lanka, which country they propose to start the project with and once successful will expand to other developing countries. \n \nAssigning unique identity to  each students and teachers, about 5 million, the tracking system can be unified and better managed securely by using the DL technology providing traceability of students performance from primary to higher education. \n \nOnce this is successfully  done, the impact would be that awareness of the technology would be increased and would raise the quest for more applications in other areas within the education of Sri Lankan government as well as in other departments. \n \nThe proposers are not certain about  regulations on blockchain and crypto. They plan to lobby with the Ministry of Education on benefits of the proposed solution to mitigate this. \n \nBecause of the large size of the database a large scale of resources need to be deployed. However they can work on phases, province by province. ", "q0r": 5, "q1": "The proposers will work on 3 phases, spreading over 12 months with the last phase within 6 months. The main hurdle is getting the Ministry to agree to the proposal. The works involved are the time resources and this is the main portion in their total budget of 60000 USD. \n \nThe personnel involved are provided.  Their experience, skills and expertise are needed for this project. In their plan however, I reckon that training the Education administration personnel on the use of the system is important and should have been discussed in the proposal. \n \nFor that I agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposers laid out the matrics but the goals are not set for each. \n \nHowever, they  target that 15% of the educational institutions would  implement the system in the first year and to reach the target of 75% in the second year; gives a good idea to measure the progress. ", "q2r": 4, "assessor": "z_assessor_968", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A DLT technology to create unique digital identities for students and teachers for better traceability of performance and credentials.", "experience": "We have a team of edu-tech specialists, blockchain architects and Haskell Plutus developers. We have a team undergoing the Atala Prism pioneer program. "}