{"id": 399172, "author": "ditcameroon", "title": "Mentalyse: Learn through fun", "url": "https://cardano.ideascale.com/a/dtd/399172-48088", "category": 26435, "amount": 39000, "description": "Most teaching / learning models in Cameroon are outdated and slow to embrace the learn through play mindset that students seem to prefer.", "funded": 2, "upvotes": 75673570, "downvotes": 8494729, "votes_result": 67178841, "votes_cast": 388, "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 4050, "q0": "The proposal is well structured and clearly written with an aim to give solution to the challenge by providing some updates in the method of teaching students by creating a collaborative e-learning platform that promotes learning through games with monetary prizes. Increasing the interest in learning for students is not simple at all and I have seen many previous methods with the same idea like this but they were not so effective since the students got fed up easily. However, i still do not see any reasons or factors that make this project unique and effective ", "q0r": 3, "q1": "The author actually provided very detailed and clear explanations for 5 gaming challenges, which are “Choose the right one\", “I learn by playing\",\"Test your logic\",”My model\", and \"Find the differences\". I quite like the idea that the team creates different games in order to fully develop different aspects of a student. However, I still haven't seen any factors that actually brings excitement for students. The price of a bi-weekly magazine is also sensible and affordable (about 0.25$). The time plan is laid out clearly with the dividing of 4 phases in the total of 18 months. The budget outlined carefully and broken down into reliable items to be executed. The proposer provides reference links and I think they all have the necessary experience to cover what is necessary for this implementation and more.", "q1r": 4, "q2": "The proposer provided a clear road map and reasonable milestones which absolutely align with the previous timeplan. The mentioned KPIs are relevant and not too modest. Key metrics are in line with the success of the proposal. But it would be better if a Github link is provided in this proposal so that voters and the community are able to audit the development of the process easier.", "q2r": 5, "assessor": "z_assessor_1702", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Impact: The assesor states that there is no proof that our project will be effective, however we did provide reference to the paper version of the project and its longevity and success, here we are simply seeking to digitalize what  is already created to increase the audience and therefore impact of this educational approach."}, {"id": 4395, "q0": "This project was built with the aim of creating a collaborative e-platform that promotes learning through games with cash prizes that make learning fun and engaging. The highlight of the project is the application of blockchain technology components to the platform. E-learning combined with games is a fairly common model, easily found in many different educational environments, therefore, the target audience of the proposer is the educational environment in Cameroon - where the teaching model is outdated as described by the proposer. They have outlined some basic information about the market share in which they will launch the project – Cameroon, in my opinion, they should include specific indicators of the survey they have done so that they can go to the conclusion mentioned in the project that Cameroon is a potential market, this information will increase the persuasiveness of the project. They provide case studies to illustrate the main activities of the project. The proposer describes in the project as the technology behind the scenes will be on Cardano and the bounty is distributed in Ada or stable coin. In the solution section, the author mentioned the off-chain solution they developed, I think they should link this activity as a reference for the readers. They also mentioned the risks that will be encountered and solutions.", "q0r": 4, "q1": "i would like to commend their project development plan, they have described in detail 5 items of the project so that the community can easily track the project progress, the project development stages are also detailed. A brief description is easy to understand. The budget table is very well described, specifically about the number of employees, vacancies and time, they also spend a budget for the marketing of the product, which is a huge plus because they have thought about it. plan to promote my project-something I rarely find in other projects. However, I would like them to describe in more detail the $2000 Travel Logistics cost, for example, how many people this will cover, for how long, what are the main activities of this team, what does the cost to pay for this team include (airfare, accommodation, ...), this contributes to the transparency of the project. Their team brings together members with diverse work experience and skills in many fields verified through referrals on LinkedIn.", "q1r": 4, "q2": "The author has very well described the project development roadmap for 18 months, each stage briefly explaining the activities that will take place and the goals to be achieved. The team also identified the user, transaction, and download metrics they wanted to achieve after the project was successfully launched within the first month. I hope the team will also come up with more measures of success at various stages so that the community can understand the direction of the product's development. The community can also measure the progress and development of the project through Github, the project's auditability is highly appreciated. For this part, I will give 5 stars.", "q2r": 5, "assessor": "z_assessor_1724", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4564, "q0": "The proposer has effectively tackled the challenge by bringing learn through fun concept where students wont miss the class and will always be enthusiastic towards attending the class.\nHere the students also will be rewarded with prizes of ADA which also helps students to educate on block chain in the future hence the proposal effectively addresses the challenge mentioned", "q0r": 5, "q1": "As the proposer team has lots of experience and however Andre has also started the work in the project , with all the plans possible has been mentioned in the audit it wont be much difficult to achieve the goal.\nThe research has already been started on which games the students are interested towards and what are the other aspects that makes students more studious in the class, as work is already on the proper track plan presented is more likely to be implemented successfully", "q1r": 5, "q2": "The audit has clearly mentioned ,people working on this project and it has also given us detailed calendar events which shows proper planning for the project is done.\nIt has also shown the other ideas to improve the youths of cameroon ,and how they can be kept away from online gambling or another negative impact that might forseen over them in the future hence,  provided data is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7932, "q0": "\"Gamification of education will make learning more interesting and effective than boring theoretical lectures. This will be the new trend in the future and blockchain is allowing us to do it easier than ever. Reason:\nIt is possible to organize a reward system for excellent students through the issuance of tokens.\nIt is possible through game defi to make lectures more intuitive, memorable and effective, which is even more urgent when the world faces covid and the rate of online learning increases.\nAnd this can be modeled and replicated anywhere in the world.\"", "q0r": 5, "q1": "They already have ideas on how to design educational games for students. The implementation roadmap is quite clear according to the months and the budget for each item is reasonable. In addition, the working team includes many software development engineers, media and press... This is the premise that the project is serious. The idea of educating through fun gameplay and rewarding learners and players is an encouraging idea.", "q1r": 5, "q2": "A series of project building activities on github, private website, communication channels... are public and have clear performance criteria and numbers for evaluation. Accompanied by the development of learning software, connecting MVPs, DIDs... I think the community should expand this model into a current educational reform movement, making education lighter and easier. more effective.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8457, "q0": "This proposal discusses about improving the quality of teaching or education through fun games which will be published in magazine. With the help of blockchain technology, it is easier, effective and efficient to executive this project by implemeting MVP Dapp (DID, Mentalyse token, micro-payment and subscriptions). I think fun games help learning theoretical knowledge more interesting for students. Therefore, teachers should update new way of teaching. ", "q0r": 5, "q1": "The proposer has already listed out 5 categories of education games in magazine which shows their deep research. Also, their roadmap and timeline are very detailed and understandable. Moreover, the required budget for each task is very clear. In addition, the team members are qualified and have years of experiece in technology which are showed in Linkedin. This team belongs to Wada network in Africa which makes it more trustable. My concern is the quality of contents of games which is both fun and educational for students. So educators, pedagogues, and psychologists from local communities in Cameroon might play an very important role in this project. I think this project is feasible to implement successfully.", "q1r": 4, "q2": "It is easy to measure progress of this project by visiting website, checking Github or via social media channels. The proposer publicly published research report, white paper, roadmap, ...on Github. Also, the roadmap is fairly clear so we could check specifice measures for each phase such as number of mobile app downloads, number of users, or number of transactions.  I hope this project get supported. ", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9768, "q0": "This is an active project, by playing games and rewarding players to develop thinking through play - a new learning method applied in many schools in Europe and America. By this way, educational games are also beneficial to players. This naturally accelerates the development of these games and helps to rapidly increase learners, thus achieves the highest efficiency of the project \nThis proposal clearly describes how they will perform and what results will be achieved by specific timelines. The solution also creates tokens on the Cardano blockchain to reward players. In the meantime, it helps the community to recognize and understand more values that Cardano is providing.\nI have my trust in this project and it address to the tasks of Challenge.\n", "q0r": 5, "q1": "This is a detailed and professional plan. The implementation roadmap is clear, the jobs are listed in detail. I think this team comes from Cameron Wada Hub, so it's not too difficult to understand how professional they are.\nThe project staff has a lot of experience in the software, especially many people have experience with the Haskell language, which will help the dApp smart contract development faster.\nThe proposal also provides an implementation time with specific milestones and the results achieved are also quantified by very clear numbers, easy to track the results of the project.\nThe costs paid to the team members are also reasonable according to the market price, clearly stated to the specific working day and job done. This is a very valuable transparency.\nI believe in this project’s potential successful. \n", "q1r": 5, "q2": "This is professional proposal with the clarity and detail in the presentation and implementation schedule as well as the detailed cost of each work item.\nMilestones to be achieved and KPI metrics are also shown with specific numbers, making it easy for the community to follow as the project is completed.\nA highly active and professional project ! ", "q2r": 5, "assessor": "z_assessor_759", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "-\n\nCreate a collaborative e-learning platform that promotes learning through games with monetary prizes making learning fun and attractive!", "experience": "Wada Cameroon Hub:\n\n3 senior software architects and developers with 12+ years of experienceNine interns and software developers actively learning Haskell, Plutus and software architectureWada network of resources…1 Educator\n\nAndre Belle: Creator of Mentalyse Magazine"}