{"id": 399269, "author": "ditcameroon", "title": "TREEdano: Regenerative NFTrees", "url": "https://cardano.ideascale.com/a/dtd/399269-48088", "category": 26435, "amount": 27000, "description": "--\n\nRare and symbolic tree species are over exploited in the East region of Cameroon. No effective program exists to replace them.", "funded": 2, "upvotes": 49714896, "downvotes": 4763092, "votes_result": 44951804, "votes_cast": 182, "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 4052, "q0": "The proposal is very interesting to read. Congratulations on the project so far. Honestly, I like the core concept and the way that you detaily explain reasons and solutions for this problem. The project proposal seems very well-designed and has a clear statement in how to create this impact by solving a serious problem facing most countries in central Africa, an over exploitation of rare and symbolic tree species while no effective program exists to replant them. Having the ability to identify the key issue, the team has given out a breakthrough solution for this problem since they take advantage of both human resources and technology. I have seen many projects and campaigns with the aim to plant more trees and recover bare lands, but we can not easily track and recognise the results of them. However, with this project, users can easily watch their tree growing, which is absolutely great and advanced. In addition, it also brings long term impact for both Cardano Ecosystem, by motivating developers to bring more quality humane projects, and for the real world since it helps to solve some serious climate issues. So far, I can see that some research has been accomplished and the team is able to give a list of trees planted. Even so, I think that it would be clearer if some more detailed information is provided. For instance, If customers/ users want to have some optional methods to plant and protect their trees, will they have to pay any extra sum of money? And a little bit more information about the “learning through gaming” system and the prizes because it was mentioned with very few extra details. Those are my suggestions in order to make the proposal clearer and thorough. Overall, I think this project is very potential and effectively addresses the problem in the long term.", "q0r": 5, "q1": "The team has provided a very detailed and well-written plan including an 8 step by step approach for getting the project done. However, I think it would be good if some milestones of each step could be provided to make the plan a little bit easier to estimate and increase the quality of the proposal. The budget list is clear and broken down into specific project activities and hours required. Furthermore, I suggest the author add some information in “NFTree Developers motivation” since it isn't clear what assignments are needed for this category. For the Marketing category, it would be clear if some specific marketing methods are mentioned because I think different ways of promoting can cost different sums of money. The proposing team is really committed and reliable with experience in such activities and achievements proposed. They also include reference links for verification purposes. Besides, thanks for the explanation of Wada network of resources. Overall, I believe this has a high chance of success.", "q1r": 4, "q2": "The team presents a very simple and detailed roadmap with milestones and steps up to the final deliveries, which further increase the level of auditability of the project as a whole. The indications for success are well described and trackable, which are also relevant and align with the challenge. But will the development of the progress be updated on Github or any other social platform since I do not see any mention of it.", "q2r": 4, "assessor": "z_assessor_1702", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7368, "q0": "I thought this idea was very good and in my opinion it aligns perfectly with the objectives of the challenge. In this challenge, we aim to finance projects that help developing countries/communities, and one of the ways to do this is environmental, as is the case with the proposal. With the success of this project, rare trees from Africa will be protected; the idea can be summed up in creating an NFT (called NFTtree) that will give its holder a series of information about a specific rare tree, such as photos, videos, the power to choose how it will be treated (obviously, within basic prerequisites), among other things like “information about each species, such as local name, time of seed availability, any special history surrounding them and much more”. I thought this is analogous to having a virtual pet, which in this case would be a real-life tree. I think this idea could be very successful for both NFT enthusiasts and environmental activists who want to help preserve the environment. In other words, here we have the potential to dialogue with different audiences, and if the people who acquire these NFTs minted on the Cardano blockchain are unaware of our ecosystem and its technologies, this would certainly be a great way to spread it to a new audience. In my opinion, some more information could have been provided, such as which rare tree species we are talking about, where would these farms be that they will manage, how often will there be updates on the tree information (your growth, reproduction, appearance of fruits, parasites, etc.), what would be the approximate value of one of these NFTs... Finally, details, which, if provided, would serve to richly complement the understanding of the proposal. The impact of the proposal will certainly be positive and it meets the requirements of the challenge well, as the proposers explain how the money from the sale of these NFTs would be used: for the expansion of cultivation farms and for the benefit of local communities that gave some kind of support to the project. In other words, in addition to having an environmental impact, this proposal will also be of a social nature, both in terms of benefiting nearby communities and by raising general awareness in schools and those who have contact with this project. This all increases even more the degree of positive impact it will generate in the chosen locations! It is very good that the proponents explain in this topic, in general, which phases would constitute the project, because that way we can visualize it well. \n", "q0r": 5, "q1": "The feasibility of the project is good, but it can still improve in some aspects. Speaking of the phases, the proponents explain how many steps there would be and what would be done mainly in each of them. My observations here are as follows: there could be a temporal notion, that is, we should be informed 1) in which month of the year each stage is located 2) how long is expected for these activities to last, from start to finish. It would also be interesting to provide a more in-depth explanation of some things, such as, for example, in step zero, travel and research would be done. As I mentioned in Impact, it would be positive if the proponents said which countries and communities they would visit, which tree species they are thinking of working on the project and so on. In step two they talk about expanding the current nursery they have, I would like to know more about it. How many trees do they already grow, what species, how many new trees do they intend to acquire here? Anyway, more detail and a better notion of temporality would be very beneficial. Now, in relation to the budget, I think the asking value is totally fair, in my view it is a very complex proposal and a project that will probably be extensive and will require a lot of effort from the team involved. Therefore, the $27,000 requested as funding is a very acceptable amount. About it, we know which parts would be divided and how much each of them will take the total amount. I think from the way this explanation is done, we already have a good understanding of the use of money, but as with the script, a little more detail would be welcome. $3,000 is requested for travel logistics and coordination. How many people would travel, how many trips would there be, what would be the final and initial destination, how long would these people be traveling? In the part of “Seeds and seedlings (acquisition and conditioning): $9000”, approximately how many seeds would be acquired at this stage? We know the amount of seedlings that were aimed at the end of 6 and 12 months, but we don't know if they would all be purchased with these 9k. And how much would go for acquisition, and how much for conditioning? Without knowing an approximate amount of seeds, we don't know the price of the unit, and that doesn't allow us to be an idea if this part is expensive or not. I'm also not sure who would get that money. Who would the sellers be? Probably the communities that inhabited the places where these trees would currently be planted. And finally, when it comes to the team, a drive is available, I tried to access it but it needs permission. However, this is not so much of a problem as we have good information about the teams. We know their names, a small resume of each and their linkedins, where we can have proof of the information said. From what I could observe, only Megan is associated with the Cardano ecosystem. In my opinion, the more people the better, but one is enough. In summary, I think the proposal is very viable, this part of the project is very satisfactory, although not perfect. \n", "q1r": 4, "q2": "The proposal is quite auditable, in my opinion, the proponents outline great ways to monitor both the project development process and the final results. What remains to be desired is how all this information would reach the community. Speaking more specifically about the project construction process: the documents that will be made available on github (after 3 months) are used as indicators of success of the partial results, how many trees will be planted in a time of 6 and 12 months after funding, whitepaper publication and finishing of the coining platform and etc. I think it would be interesting for the team, at the end of each stage, to gather the information available so far, about all this, in some online data sharing platform, which should be made available to the entire Cardano community. As this proposal would require several forms of monitoring, I think that a written report would not be the most efficient way to audit the steps, in my view, tools like Notion or Miro, which allow the attachment of both written documents, videos and images, could better address the needs of the project. And in relation to the final results, all the suggested indicatives could be summarized both in a text, which could be made available on the same online platform previously selected, and there could be an audiovisual content production that showed in video form the tree farm at the end of the year. project. Testimonies from nearby communities could also be recorded, as well as how the NFTs would be working (what information would be contained in them), how their owners would be learning about the species they “own”. A summary could also be made of how the project was extended to schools, so that the educational nature it contains could also be explored. All of this together could form a short video to be shown at Town Hall, and not just at our official community meeting; In my view, this video would have the potential to generate marketing for Cardano, we could use it as a way to demonstrate that our blockchain has environmental and social goals to be achieved, going beyond a purely economic logic. This is also related to the audiovisual challenge, launched in this fund, and could be a great promotional material for Cardano. Therefore, I think that the proponents suggest different and efficient ways of auditing the project, what remained pending was just clarifying how all this would reach the knowledge of the Cardano community. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8458, "q0": "Deforestation is a global problem. Although illegal logging is still common in many parts of the world, no radical measures have been taken by governments or countries to prevent this problem. To solve this problem, the proposer and the team members came up with an idea to apply NFT technology in protecting trees with first focus in Cameroon in Africa. I think, this is a  practical solution as it applys blockchain technology. If implemented successfull, it can bring positive effects to the protection of forests and could be applied in other hot spots of deforestration. I hope this project ge support from community. ", "q0r": 4, "q1": "I appreciate the rich experience of proposer and team members in technology field as architect, developers and programming. Also, they belong to the Wada organization connecting people all over Africa. Also, the proposer shows their deep research with easy-to-understand step by step to excecute this project for community. For example, the proposer studies different kinds of trees to protect and shows every information of each tree by images, videos or stories to community to have a better understanding and management. However, I would like the proposer to have more personnels having experience in farming or agriculture to solve the problem of missing seed cycles, for example. After all, this proposal is very promising. ", "q1r": 4, "q2": "It is easy to track the development of this project as research documentation is published on Github within 3 months. Also, we could base on some key milestones or metrics such as the number of collected seeds, number of seedlings growing in nursery, the realease of minting platform, whitepaper, or collaboration with farmers, schools or institutions for raising awareness about tree protection. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "--\n\nPlant and turn each rare tree into a dynamic NFTree, creating awareness, facilitating their protection, tracking, and expansion.", "experience": "--\n\nWada Cameroon Hub:\n\nCameroon hub specializing in Regenerative Agriculture and IT100+ acres of land, ongoing pilot project on 7+ acres3 senior software architects and developers with 12+ years of experienceNine interns / devs actively learning Haskell / Plutus"}