{"id": 403633, "author": "yogo", "title": "NGO transparency", "url": "https://cardano.ideascale.com/a/dtd/403633-48088", "category": 26435, "amount": 48500, "description": "There is a lack of transparency regarding fund transfer to NGOs and impact on the ground. Carbon offsetting is an example of it.", "funded": 2, "upvotes": 138049356, "downvotes": 12000524, "votes_result": 126048832, "votes_cast": 820, "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 4899, "q0": "\"From the very beginning, the proposer has given a long list of reference links in order introduce and provide background information about the problem that they choose to resolve, which shows that the proposer has done a lot of research about the issue or having a great deal of experiences in the field, along with enthusiasm that can not be hidden through the way they address the issue. The motivation of this proposal is quite explicit in a way that serves both the community and the Cardano ecosystem. The way the proposer put forward the solution indicates that they have carefully planned for the tools or devices they would need to launch their idea. What makes it stronger and more persuasive is the example they gave out to prove and stiffen their idea. \nThe fact that this proposal's solution is being worked on in a smaller scale makes it more seemingly to be success. From the first place, the proposer mentions that they have a strong NGO network, which also raises the impact of this idea as it needs a big number of NGOs to join in the app. The proposer's explanation on how this solution aligns with the challenge is adequately persuasive and clear. \nThe risks that they foresee are expressed clearly and logically with thorough demonstration, however, it would be better if they can suggest some of the solutions they can think of to deal with those risks.\"", "q0r": 5, "q1": "\"The proposal has made a strong impression with its well-prepared diagram along with explanation, with the highly explicit road map with tasks from minor to major. The proposer also sets time duration of each stages and even KPIs for MVP1 and MVP2, which brings the proposal's feasibility into a way higher level. Another point that stiffens their idea is the way they envision their project for a longer time in the future.\nThe budget breakdown is demonstrated quite clearly for the 3-month duration belonging to this proposal.\nThis proposal's team is gathered by individuals having both strong profession in their fields as well as connections to Cardano ecosystem in advance. Their related experiences are described closely linked to their roles and positions in the proposal, which makes readers feel quite persuasive and trustworthy. They also divide their members into 4 different suitable wholesome roles needed to launch the project including product & UX, business and companies, society and environment. As for their team members seem to have a strong network in Cardano ecosystem, they utilized that quite effectively and even possess supports from product to network and media. To sum up, according to aforementioned strong points, this proposal has a very competitive feasibility part.\"", "q1r": 5, "q2": "\"For this proposal, they already make a very good and comprehensive targets, KPIs in the feasibility part, so the auditablity one with the listed elements to be reported is relatively enough. \nThe success for this project is well described with details and references and it is easily imagined and understandable. \nThe SDG rating part is also more throrough than many other proposals as they analyse exhaustively from goals to subgoals and KPIs. \"", "q2r": 5, "assessor": "z_assessor_1796", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 9716, "q0": "NGOs play a huge role in bringing a change in developing countries, sometimes they are the ones that keep the government and businesses in check and make sure the progress is in the right direction. But lately, in a world full of Ponzi schemes and scams, many NGOs are either being duped off of the intended funds are not able to meet their goals. A transparent medium to keep this in check is certainly necessary to have a sustained involvement of NGOs and their volunteers in building the nations. The proper inflow of funds and monitored utilization can go a long way in amplifying the impact they could bring on society. The proposer tries to tackle this issue with an optimal solution and from the elaborate plan the reader is presented with, it is quite clear that the convenor has done a great deal of research and is quite aware of the influence his idea could have and also seem to have a dependable solution for every risk involved.", "q0r": 5, "q1": "The readers are provided with an elucidated plan with realizable goals set at regular intervals. Taking into consideration every requirement of the challenge, the proposer has presented a very descriptive plan and looks promising to any reader, the infographics to explain the architecture of their product show that a considerable amount of work is already done. This aids in gaining a few extra points on the feasibility metrics. The funds requested for also very reasonable and look necessary in getting the MVP up and running. The team has been introduced brilliantly and brings a variety of expertise into the ecosystem. In addition to that, the team seems to be aware of the external support already available to aid them in their venture which shows the passion and determination of the team in making this a successful adventure.", "q1r": 5, "q2": "The proposal's outcomes are well outlined and measurable and are based on a properly defined roadmap in front of us. The number of active NGOs, the percentage increase in the smart contracts quite add more credibility to the plan. The metrics are aligned to the challenge's requisites and indeed would plan an important role in involving non-government entities in the development of nations. However, there seems to be a missing KPI or two regarding the acceptance rate, how the credibility of the recorded transactions over an open ledger can be monitored and the number of dormant or fake users/NGOs are something that needs a little bit of clarity on in my personal opinion. Being a new project, considering the missing details in small areas of auditability I would score a 4 out of 5 in this section.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 9136, "q0": "This proposal aims to develop a much needed approach to accounting for work done by NGOs using smart contracts on blockchain. It will implicitly enable accurate measurements of the carbon offsetting achieved through the respective work.", "q0r": 5, "q1": "The project is spearheaded by a veteran climate worker who will be using his own NGO and relevant experience to implement and test the solution proposed. However no partner for who the work to be dine is mentioned, but I believe that once the product is ready there will be many wanting to use it (hopefully).", "q1r": 5, "q2": "Plentiful - with numerous presentations and videos which prove the dedication and experience of the team, as well as clear measures of success, namely residing in the product and procurement of clients that will use it.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "NGO carbon removal registry and functionality on Cardano to enable NGO to document and validate use of funds and their carbon removal impact", "experience": "20 years experience in NGOs leadership related to climate change supported by a team with product & UX expert, technology lead and social entrepreneurial expertise.\nwww.Mycarbonzero.org expertise and team\nhttps://www.scottpoynton.com/about-1 \nStrong NGO network\n  "}