{"id": 380949, "author": "wvalthar", "title": "@chain-lib Cardano API Plugins", "url": "https://cardano.ideascale.com/a/dtd/380949-48088", "category": 26251, "amount": 5214, "description": "目前的chain-lib/cardano-api只让用户使用blockfrost。应该做一个插件系统，让任何人根据需要修改程序。", "funded": 2, "upvotes": 28183832, "downvotes": 11163907, "votes_result": 17019925, "votes_cast": 105, "f6_no_assessments": 5, "f6_rating": 2.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "提议者正在为Cardano API建立一个javascript钱包api和网络应用准备组件。为了与挑战书保持一致，这个库将帮助开发者使用Cardano区块链。这对开发者和Dapp的影响将是巨大的。支持这个解决方案将使社区走向去中心化。该提案明确指出，在谈论对社区的贡献时，它有一个价值的位置。主要是那些还在这个空间里的新的开发者将受益于such的实施。提案的目标与挑战完全一致。没有提到扩展的问题，所以我猜想提案人是独自工作的，这在一段时间内是没有问题的，但是如果要扩展，我建议开始考虑一个团队，因为制作这样一个基本的库是不小的成就。该提案缺乏技术性的执行策略，这一点很重要，尤其是当未来的工作可能增长时。目前非常需要这样的库和框架，因为Cardano的开发者生态系统还很年轻，还没有成熟，所有的库和好东西都已经开发出来，可以使用。", "q0r": 5, "q1": "提案人，显然是个开发者，说了很多技能，但不幸的是，我无法验证其中任何一项，因为提案中没有留下任何链接或证书。虽然我尊重隐私的需要，但对于任何提案来说，让人们站在项目背后的名字是非常重要的，因为在选民的眼中，这给作者和提案带来了很大的可信度。我仍然不确定所有这些工作是由一个人在这么短的时间内完成的，因为没有人提到其他团队成员的计划。有一点欠缺的是，为了使项目取得成果，应该完成的里程碑和技术任务被明确列出。提议者提到了一些关于重写插件系统60小时的内容。作为一个开发者，我觉得这很难让人相信，而且这个时间表对我来说是可以接受的，但希望作者有一个团队来进行这次重写。整个项目的步骤计划也没有，不仅是技术部分，还有项目的未来发展、自筹资金等等，因为这样的库需要维护，以便保持相关性和使用。有一个预算，但没有具体的资源/人力，这将是建设该项目所必需的，所以我认为是1个人。我很高兴能读到更多关于技术实施、细节和计划的内容，因为这可能会引发帮助实施的愿望，但就目前的情况来看，我不清楚具体的计划。我发现提案中还缺少一件事，那就是在实施过程中可能出现的挑战，比如：插件使用量的快速增长，对插件的持续支持和更新等等。我建议作者看看其他的插件创建者，并联合起来，以使生态系统的效用最大化。当我们在一起的时候，我们会很强大。有相当多的建议与此类似--为未来的使用建立框架。  尽管如此，我相信这是个好项目，值得花时间投票。", "q1r": 4, "q2": "既然有github的链接，我希望每个对这个提案的进展和发展感兴趣的Cardano社区成员都能在提案中链接的资源库中进行跟踪。关键绩效指标是缺乏的，而我认为它们对任何项目都很重要，可以帮助社区关注并对项目感到兴奋。一个简单的指标如每周的下载量是一个简单而伟大的营销工具。我一直在寻找一个更长远的路线图，但没有找到。   我觉得作者很好地掌握了需要做的事情，但还没有想出实际的 \"方法\"。", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The problem in the proposal is within this challenge. At my point, this project will help to scale up the Cardano ecosystem faster if it is successful. But there is just a general introduction about their finished components and a short brief about their solution. \r\nThe team doesn't have key metrics for this project to know how they care about this challenge given. My recommendation to them for this proposal is that can be number of partners will use their API, traffic...", "q0r": 2, "q1": "Can't score the feasibility of this project. The team provides a GitHub but I don't know what it will be used for. Even they describe in the overview but it's not enough info about how they will and the timeline for implementing the idea.\r\nMoreover, they don't have a roadmap and KPI to show their detailed step-to-step of developing this project. So, it is hard to assess that their budget is reasonable.  ", "q1r": 1, "q2": "The team lacks of: roadmap and key metrics. For helping Catalyst community audit the proposal, the team should give a detailed roadmap with a timeline that is realistic. \r\nOne more thing that the team doesn't have here is a detailed explanation about the problem, and their solution is just a brief in the overview, that all make sense how they will solve the problem or how hard they study about the problem to make a best solution. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 21, "ne": 1, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "Proposer provided a clear and concise description of the issue also offers a solution. This proposal has a positive impact on the Cardano ecosystem and clearly articulates how it will add value to the Cardano. Because there are no KPIs, it's hard to compare KPIs with challenge setting and this proposal is not able to scale and address future challenges.", "q0r": 3, "q1": "In the proposal we have a link to Github which indicates to us that there is experience and skill that are necessary to deliver on the proposal. Unfortunately, we do not know who is behind the idea. It would be good to have more information about the team or individual who is working on this project. The proposal does not show records of relevant knowledge, skills and experience needed to implement the proposal. The budget is realistic and clearly presented and it's broken down into identifiable items. There is not a detailed implementable plan and no details of actionable tasks and order of execution. In the proposal we have a clearly defined time frame within which the work will be done but we do not have the necessary resources to implement this idea. Proposer explains the technical aspects that are needed for implementation but does not list possible risks nor is there an idea of possible risks.\r\n\r\n\r\n", "q1r": 2, "q2": "It would be good if the roadmap with milestones and a time frames for achievement were explained in more detail. Unfortunately, the proposal does not list KPIs that define the success of the proposal. This proposal and its success cannot be monitored in any way by the community.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 20, "ne": 3, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "To me, this project will not bring any value to the Cardano ecosystem because there is no detailed plan and info to show about that. The proposer only shows their GitHub with a few words of introduction. And even doesn't have key metrics for their project. So I rate for 1", "q0r": 1, "q1": "There is only a short over about the solution this proposal wants to show and an introduction about already-made open-source of the team that can't understand how it can help this project. My advice for this team is to have a good proposal and enough materials for assessing the feasibility they must give info about a detailed plan they will do, roadmap that with a clear timeline of activities will get instead of just 2 milestone of 6 months and 12 months, clarify team member info for more trust, the budget that is reasonable with the plan and roadmap, risk-relevant that team will face off. Technically, this idea of the project will have a lot of technical stuff but they don't describe any of them, including smart contract, protocol... even more in the user point of view including UX/UI, user cases... ", "q1r": 1, "q2": "The proposer provide nothing in this proposal to audit it. \r\nNo plan, no roadmap, no key metrics in this proposal.\r\nThere is also no info about the problem explanation and no info to say how the solution can help to solve the problem.", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 21, "ne": 0, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "This proposal is about creating a plugin system for chain-lib/Cardano-API, starting with a way to get off-chain data, with blockfrost being an official first plugin. The problem [Current chain-lib/cardano-api only lets users use blockfrost] is clearly described, and explained in detail. The solution is defined, with potential impact in certain aspects. Therefore, based on the given information, I am neutral with this proposal's impact, I can rate it with a score of 3", "q0r": 3, "q1": "The Chain-lib team's profile is provided and described enough for understanding with suitable skill and experiences for implementation. However, I find it hard to define and verify the ability as well as experiences of each member of Chain-lib. Information on similar works done by this team should be added. The budget is clearly provided with a simple structure of items and explanations of the calculation base. However, KPIs and Risk (and mitigation) were not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lack of information: (1) Chain-lib member's profile and external links for verification [how can community know chain-lib members and their ability easier ?]; (2) KPIs, (3) Risk (and mitigation). The current definition of success [the plugin system will be completely rewritten with the two base plugins working; multiple plugins not written by chain-lib are created]  is quite qualitative, not quantitative/measurable enough. Besides, there is no information on demo/pilot/similar works done by this team. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}], "solution": "为chain-lib/cardano-api创建一个插件系统，从获取链外数据的方式开始，blockfrost是官方的第一个插件。", "experience": "Novella / Cardano Keys开发者，SPO，Alanzo Purple测试员，Plutus Pioneer 1，已经在github repo里面建立了几个组件。"}