{"id": 382199, "author": "highlander", "title": "Smart Contract Library - Phase 1", "url": "https://cardano.ideascale.com/a/dtd/382199-48088", "category": 26251, "amount": 45000, "description": "Cardano缺少一个开源的智能合约库，开发者可以用它来快速建立原型。", "funded": 1, "upvotes": 47711176, "downvotes": 17707950, "votes_result": 30003226, "votes_cast": 200, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "这个项目希望创建并开源一套智能合约模板，以加快整个cardano的发展。这将是一个伟大的贡献，如果它发生了，将产生更大的影响，因为它将给任何开发人员提供测试和了解Cardano生态系统和事物工作方式的动力。该提案确定了一个适合挑战设置的问题。有一个明确的想法，即这将如何促进Cardano生态系统的描述。没有任何关键的指标可以说是与挑战赛的大纲设置相一致的。我建议在未来的提案中增加这样的内容。我记住了这个建议的作者在创建以太坊智能合约方面有认真和相关的经验，我相信他们能够接受任何未来的挑战。  如果这个建议得到实施，将为生态系统增加很多可重复使用的智能合约模板，这对于像Cardano这样不断发展的社区来说是很有必要的。   ", "q0r": 5, "q1": "我们的计划是雇用一个有智能合约经验的开放性plutus先锋开发者，但这还没有发生，所以不能提供或链接证书，这是一个障碍，因为一个具体的人可以核实地做这项工作，会给这个建议带来可信度。预算是非常直接的，基本上是支付一个人的工资来做这项工作。时间表可以做得更好，因为除了发布一个测试版之外，没有任何里程碑。项目的可行性将取决于团队是否能找到一个开发人员来做这项工作。好的方面是对实施该提案需要多少团队成员有一个明确的理解和计划。预算足够清晰，可以理解，并被分解成碎片，以描述实现目标所需的步骤。在这个过程中，可能需要更多的技术任务和里程碑。有一个现实的时间表，如果提案人遵循它，按计划实施工作应该没有问题。有一个关于实施的必要项目的描述，但没有路线图，清楚地解释了将要进行的连续的任务，这可能有助于这个项目的支持者们的实施。  作为一个开发者，我期望看到任何形式的架构或将要使用的技术的计划。这将有助于我了解找到一个人做这项工作是多么容易。没有具体的细节，我无法根据提案中所描述的内容对成功作出适当的估计。提案人有在以太坊上开发智能合约的经验，这将是有益的，尽管生态系统和范式在Cardano上是不同的。  这个项目和我在开发者生态系统挑战中看到的其他项目之间可能会有合作的空间。", "q1r": 4, "q2": "由于该团队计划将所有的代码在一个资源库中开放，我认为对于任何感兴趣的人来说，跟进项目的进展不会有问题。没有提供关键绩效指标，这将有助于任何社区成员衡量该提案的成功。我建议增加一个更具体的关键绩效指标，也许可以把提案分成几个不同的任务，在几个基金中实施。  路线图是对未来基金提案的一个明确的建议，它是任何好项目的一个组成部分。  在技术方面可以有更多的解释，但总的来说，我相信这个项目!   ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This is a brilliant and game changing idea to have a smart contract library available to help speedup the developments proocess on the cardano ecosystem. This is game changing it will help speed up the process of application development on the cardano blockchain since developers can easily use already build open source templates which will ease their burden of having to start writing smart contracts from the scratch.", "q0r": 5, "q1": "The team have the required expertise to execute the project. The budget sits well though not so detailed but it is reasonable to guarantee a successful project execution.", "q1r": 4, "q2": "The proposer has outlined a timeline for project execution but has failed to include key metrics/KPI's, which is key to be able to help audit the progress and success of the project when funded. ", "q2r": 3, "assessor": "z_assessor_799", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly and concretely answers the most important guiding question of this challenge, “How can we ensure future developers benefit from the work that is funded today?”. Its plan is simple to describe and understand, but its impact could be substantial, not only for existing Cardano smart contract developers, but also it could prove a great resource for attracting new developers to the platform by making their transition much easier with a prebuilt library of smart contract templates, which is the aim of this project. Overall the proposal could have a big impact on the ecosystem if properly executed as it could make the experience of smart contract developers on Cardano much smoother.", "q0r": 5, "q1": "The team clearly has experience with building blockchain related applications, as is evident from their website, which hosts multiple NFT related mini-games. But, from the looks of it their current smart contacts run on the Binance Smart Chain & Ethereum and it’s unclear if they have Cardano specific experience, as that’s not mentioned in the proposal. However this may not have a great impact on the feasibility of the proposal as their plan is to hire an external developer part-time to write the Cardano specific smart contract templates, in fact this is where most of their requested budget is allocated towards (40 out of 45K).\nTheir goals are realistic, the proposal is written in a very down to earth manner and the requested budget seems feasible. The very reasonable amount of $30/h is given, and a full year of part-time development is factored in.", "q1r": 5, "q2": "The audibility section of the proposal is the only one that leaves a few things to be desired, like a clear description of the KPIs and of the exact intended launch dates. However these can be easily deduced from the proposal, as they are mentioned. Thus the progress of the proposal according to the given timeline, as well as the completion of the smart contract templates could be easily monitored and verified by the community auditors. However if a future submission of the proposal will be required I would recommend including these elements.\nI would like to mention that in the case of this proposal specifically the community would need to audit the quality of the technical output as well as the overall completion of the project. We certainly want to be vigilant about wasting community treasury funds, but perhaps in this case it would be even more important to assess the quality of the smart contract templates generated by the project. It would be far worse to release a set of flawed smart contracts in the community carrying the stamp of approval of project Catalyst.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is clear and concise which aims to build and publish a series of smart contracts templates, similar to Ethereum's Open Zeppelin which Cardano developers can use. Laudable idea and it addresses the challenge effectively.", "q0r": 4, "q1": "The team is behind the Highlander platform and they have written smart contracts on Ethereum already, and are capable of implementing the project. The plan depicts that they aim to build an introductory series of smart contract templates for token issuance, NFTs, and governance protocols. They will then release the contracts to the public and refine thm based on user feedback. The team can successfully implement the project based on the valid facts in the proposal.", "q1r": 4, "q2": "The budget is well broken down and timeline clearly showing 3, 6 and 12 months. The amount requested is also reasonable for the project.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 23, "ne": 1, "ng": 15, "nfo": 7, "vca_o": 1}], "solution": "建立并发布一系列智能合约模板，类似于以太坊的OpenZeppelin，供Cardano开发者使用。", "experience": "我们是Highlander平台背后的团队。克里斯是我们的首席开发者，在以太坊上编写智能合约方面有丰富的经验。"}