{"id": 384450, "author": "eli.j.selkin", "title": "PAB Container Log Processor", "url": "https://cardano.ideascale.com/a/dtd/384450-48088", "category": 26251, "amount": 3500, "description": "目前，PAB只有Haskell单元（）的返回（在JSON中以[]返回）。这个值与任何前端都无关。", "funded": 2, "upvotes": 71945722, "downvotes": 9394903, "votes_result": 62550819, "votes_cast": 216, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "提议者希望在plutus应用程序的后端添加一个日志处理器，以便能够更容易地阅读日志，帮助理解问题，并将其转换成兼容的json格式。作为一个开发者，这是一个有价值的问题解决方案，也许并不复杂，但肯定是必要的。它关注的是使用PAB开发的实用性。对于它将给Cardano生态系统带来的价值有明确的解释。它将通过了解PAB中发生的事情来加速发展。有符合挑战设置的关键指标，任何人都可以公开跟踪。该项目将准备好扩展，使用现成的docker和kubernetis基础设施，这将消除在使用弹性搜索扩展此类解决方案时的大部分问题。我不认为这个建议有什么遗漏。我们需要一个简单的方法来了解PAB中发生的事情，而不需要看那些复杂的Haskel日志。   ", "q0r": 5, "q1": "提案人拥有将项目完成的所有必要技能。有一个明确的科学方法。提案人有一个能说明问题的Linkedin账户。因此，资格证书是很好的证明。没有提到团队成员，但根据给定的时间表，他们对项目的成功是不必要的。预算被清楚地列出，所给出的步骤可以被任何感兴趣的人公开遵循。用户可以在提案中链接的repo中了解进展情况。有一个现实的时间表来完成所描述的工作，作为一个开发者，我认为这是合理的。有一个非常详细的解释，说明将使用什么确切的工具和技术组合来使项目获得成功。  该提案的技术方面得到了简单而清晰的解释，这是许多其他提案中所遗漏的重要步骤。提案人已经考虑了挑战和类似的解决方案，并为未来的挑战做了计划，为自己提供了必要的研究时间，所以没有必要走回头路。该项目与已经完成的工作同步，它将是Cardano生态系统的一个重要组成部分。  ", "q1r": 5, "q2": "会有一个github repo，里面有所有的实施细节，所以任何人都可以跟踪项目的进展。有指标和关键绩效指标的设定，这是少数有指标的项目之一。我非常相信通过查看以前的数据来优化过程。如果没有指标和有效的成功定义，你就无法做到这一点。有一个路线图，上面有每月的里程碑，可以由社区追踪。有一个清晰的、简单的问题描述，有一个清晰的、不那么简单的解决方案。完善的设计。  提议者显然在PAB方面有经验，并试图帮助其他开发者不必经历同样的问题，因此他将帮助开发者生态系统，而这正是挑战设置中的内容。", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 9, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "The aim of the proposal is to log the diagnostic messages generated by PAB in a fast searchable manner without using the DB sync and other heavy tools. This can help in debugging code and also to see the state of execution of Plutus scripts. There are other ways currently to achieve the same result however this method is likely to result in few adoptions and might spinoff a few other useful tools for automatic deployment of PAB. ", "q0r": 5, "q1": "Gimbalabs PPBL developers are building an ecosystem in which a core group of Plutus developers is gaining valuable experience and producing code useful for the community. This initiative is also funded by the earlier Catalyst funding rounds. Therefore with the credentials and the work of the author as seen in Github it is likely they have the potential to complete the project. ", "q1r": 5, "q2": "The development will be hosted in opensource and the plan given by the team spans 6 months to be completed in Apr. The work can easily be audited based on the progress in the code repository. The amount of funds requested is very reasonable and the success can be measured based on the activity in the repository. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 17, "ne": 3, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is adherent to the goals of the campaign. If the team is able to build a set of tools to parse logs from the FAB making them queriable then they are creating value to the Cardano environment because it is a common goal to lots of projects in the Cardano community. Later if they were used for a relevant number of projects, it would mean the Cardano environment is more resilient because its new Dapps will be less dependent on private SaaS solutions. One point the team could have further explored is the question of scalability their tools will be able to provide. This is extremely important because the robustness of the proposed solution is proportional to its scalability.", "q0r": 4, "q1": "The authors seem to have more than enough skills and experience to conduct the proposal successfully from what is outlined in the Relevant experience section, but they could have linked their Linkedin profiles or at least described their past project experiences in the proposal. Also, they haven't described how many team members or which positions will be required to perform the tasks of the project. As per the budget, the total amount is pretty reasonable, but it was not broken down into identifiable items other than the cluster costs. The timetable seems to be achievable if there is no setback along the way. To enrich the proposal and make it more solid the team could have not only stated what will be done each month but also how they are planning to do it.", "q1r": 2, "q2": "The roadmap proposed has clear milestones. The metrics defined are aligned with the milestones proposed and they represent a good way to check if every milestone was achieved with a success or not. The only drawback is the team could have used more objective and measurable KPIs. For example, they could have defined what they consider reliable enough for the April metric. Also, the time horizon proposed is realistic, but I believe they could have left more room for unforeseen circumstances. Finally, a fair description of the targeted problem was given in the beginning.", "q2r": 3, "assessor": "z_assessor_341", "no_vca": 22, "ne": 5, "ng": 16, "nfo": 1, "vca_o": 1}], "solution": "开发一套工具，用于解析PAB的日志，以便可以从前端查询，确定交易后的状态。", "experience": "Eli Selkin - PPP第二批学员，Gimbalabs PPBL的开发者，PAB的频繁用户，Loxe公司的CTO。(6号基金资助的许多项目)。"}