{"id": 385098, "author": "rcmorano", "title": "NFT-authorized NFT-minter contract", "url": "https://cardano.ideascale.com/a/dtd/385098-48088", "category": 26251, "amount": 7000, "description": "目前，还没有办法从智能合约中执行分散的、授权的、按需的代币铸造。", "funded": 1, "upvotes": 34256077, "downvotes": 19428368, "votes_result": 14827709, "votes_cast": 138, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "\r\n该提案提到，他们在开发蒲公英（这是一个由GimbaLabs领导的社区支持的项目）期间遇到了一个问题。\r\n\r\n在我看来，这个问题将被许多建立在Cardano上的项目反复面对，一般来说，作为一个高级开发人员，找到通用和可重复使用的解决方案是长期的关键。\r\n\r\n开源系统基本上是，如果有人已经遇到了一个问题并提供了一个解决方案，那么只要整合这个解决方案，而不是重新发明车轮。\r\n\r\n所提供的解决方案显然是去中心化的，并且通过一个智能合约来满足问题陈述的范围，该合约将允许N个治理者（持有特定NFT的人）铸造一个代币。\r\n\r\n这个想法很好，而且完全符合提案中的挑战设置。", "q0r": 5, "q1": "提案人是前Emurgo成员，也是Gimbalabs联合创始人。因此，从智能合约/Cardano生态体系的技术角度来看，我认为没有任何问题。\r\n\r\n此外，提议者提出，他们基本上会雇用一些PBL团队成员来开发这个项目，由于提议者本身就是Gimbalabs的创始人，而且还提供了PBL团队成员已经完成的类似工作的链接，从经验的角度来看，我完全有信心。\r\n\r\n这里提出的计划是相当直接的，所以我不认为有理由进一步拆分它。两个月的预算是很合理的。\r\n\r\n然而，如果能包括与此相关的风险（例如：没有找到开发人员或无法完成等），以及成功将是什么样子，那就更好了。\r\n\r\n我认为一个例子是，他们将在GimbaLabs的一些现有项目中使用它？由于提议者在这方面有很多经验，他可以加入这些细节，因此我认为我看到了一些改进的空间。", "q1r": 4, "q2": "实施信息本身就足以审计该提案的进展。\r\n\r\n然而，我认为只有当这个智能合约被部署并被一些dapp使用时，才能发现这个提案实施的成功。\r\n\r\n 我认为一般来说，鉴于提议者的经验，向社区提供这样的例子并不难。否则，这可能会成为一个很棒的技术解决方案，但实际上没有人在使用 :)\r\n\r\n祝提议者在实施过程中好运 :)", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The team is already providing and maintaining open libraries as well as hosted services. This new library does not only further the existing dandelion initiative, it also create what would no doubt become an essential staple for this key functionality crucial a host of decentralized structures including but not limited to DAOs.", "q0r": 5, "q1": "While the dandelion no doubt have the chops to accomplish this, the proposal did not make clear their intention to maintain the library across any time horizon. In my opinion \"success\" of an open source library hinges it's documentation, maintainer(s) and fine folks committed to providing support and addressing bugs. It's clear that they will build thing but with the lack of maintenance and support plan, I can only give 4 stars here. Even something the tune of we hope the community will adopt and help maintain the library going forward  with commitment to setup contribution guidelines would have suffice!", "q1r": 4, "q2": "The KPI and Roadmap is sweet, short, to the point, and sufficient to verify their 1 and 2 months stated deliverable. ", "q2r": 5, "assessor": "z_assessor_336", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The idea is to write a template for a smart-contract that will mint tokens only if an NFT (representin authentication) is included in the smart contract. That would make it decentralized, secure and on-demand. I am no expert in the area so I don't know if this problem needs to be solved or not so I defer to the expertise of the proposer. There could have been a more clear articulation of why is this important and how will it benefit the cardano ecosystem. I feel like the author should have explained in more detail the idea behind doing this so he can get people behind the idea before starting explanation on the technical part. The key metrics are relevant for the challenge. Nothing was mentioned about scaling and considering the words decentralization and minting were mentioned, I think it would be a good idea to include a \"how will we scale?\" section in the proposal.  This proposal would add to the ecosystem, but I'm no sure how valuable would that something be, because no impact was mentioned or how will this affect the cardano community. As a developer myself my concern is that voters would struggle to see the point in this proposal as I am. ", "q0r": 3, "q1": "The proposal has added a skill set that is verifiable and is clearly well experienced. A mention of one team member is mention, but I don't mention if they already talked to them and they agreed to work on the project or that's to be seen. The budget is prety clear: a salary for 2 months for a Plutus Engineer. The proposal could have put a bit more effort in a roadmap breakdown and tasks that can be followed by the community. The plan for implementation is sensible, it's just a bit vague on the specifics.  The technical aspects is one of the pros of the proposal, because they're well explained and connected together. No challenges and risks were mentioned so I hope the work is straightforward.", "q1r": 4, "q2": "There's a linked site where the plutus developers have put a short comprehensive description of their work relating to smart contracts that they've done, so tracability of the progress is there for any interested community members. There is a mention of KPIs although a bit rough and hard to progres check. There's a bids eye view of a roadmap about the 2 months of work planned out. The targeted problem and solution could be better explained and written and that would be my main suggestion for the author for the next proposal.  I'd also suggest for the author to put themselves in the voters shoes or ask someone unrelated to the project check out the proposal and gather feedback to help improval.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "I like this proposal and what it aims to do, which will undoubtedly help to grow our open source ecosystem and enable many different teams to use an out of box solution for managing on-demand NFT minting on cardano. The could have a very wide range list of use cases and I think would be a great addition to the toolbox of cardano developers and teams alike.", "q0r": 5, "q1": "The proposer is a co-founder of the team behind the Gimbalands company which is a very reputable company within the cardano ecosystem and have many successful proposals funded in the past, this lends credibility to the idea that proposal would be successful. I would be personally shocked if the team did not deliver, I feel very confident that they will based on the proposal as presented.", "q1r": 5, "q2": "I feel the roadmap is very vauge and lacks specifics. A roadmap should include well defined milestones with specific KPIs for each milestone, otherwise it becomes a grey area when it comes time to audit the proposal we should be able to clearly see which KPIs was hit and which wasn't. I still feel the milestones at a high-level make sense, but we need a little more specifics in order for 5 stars.", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "开发一个智能合同，使用特定的元数据作为输入，只在tx中包含治理NFT的情况下按需铸造令牌。", "experience": "拥有超过15年经验的DevOps倡导者。前Emurgo DevOps负责人。Gimbalabs联合创始人。蒲公英的创始人和运营商。"}