{"id": 414237, "author": "jhonatann", "title": "legal implementation in COLOMBIA", "url": "https://cardano.ideascale.com/a/dtd/414237-48088", "category": 26596, "amount": 19000, "description": "The legal difficulties that companies related to cryptocurrencies have in Colombia", "f6_no_assessments": 12, "f6_rating": 3.472222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 6644, "q0": "This proposal is well aligned with the challenge, since it aims to alleviate the legal difficulties that companies involved in the blockchain industry are facing when operating out of Colombia. Specifically the proposal intends to connect with the relevant companies via Colombia’s several existing Chambers of Commerce. If we recall the purpose of the challenge - to offer legal and / or financial solutions that can support funded proposers - we have to take into account the fact that any implementation has to be mindful of the geographical distribution of proposers amongst the Catalyst funds - and with Colombia being a major tech hub within the LatAm space, and also given IOG’s focus on offering Cardano’s technology as a leap-frogging solution especially towards the mostly unbanked populations (Africa of course but LatAm as well), developing the legal certainty within which blockchain companies can operate within Colombia speaks extremely well with the challenge. \n\nA strength of the proposal is that it will focus on delivering targeted advice to blockchain companies, since the existing chambers of commerce are already delivering free (general) legal  advice to companies, but of course that it is highly unlikely that their expertise can go as far as to know and to navigate well the intricacies of the blockchain / crypto space. \n\nAnother positive aspect is the fact that Colombia has many chambers of commerce that support the local businesses (over 50) and a successful project that will manage to liaison with most of them will be extremely impactful since it has the capacity to reach a great deal of blockchain-oriented new companies during their formation phase, which is critical in terms of offering them the legal certainly with regards to their operating environment and perhaps even help them in shaping their future strategic steps in this industry. \n\nOne minor area of improvement requiring additional attention from the proposer is the way in which the advice will be shaped and how easy it will be in practice for the Chambers to assimilate it, understand it and be capable of delivering it downstream towards the small and medium enterprises. But overall the proposal speaks very well with the challenge and would have a beneficial impact on the LatAm Cardano community if implemented. ", "q0r": 5, "q1": "The idea is excellent, but I believe that the proposal falls short in a few key areas required by the challenge and the proposers' guide. All of these points below (combined) make me not want to trust so much the feasibility of the project, so I find it fair to subtract two stars overall in this category. But let’s take things one by one so I can better explain my reasoning.\n\nThe roadmap is fairly well described, and the proposers describe very well each of the five monthly deliverables, with each taking the shape of a legal study that will be delivered to the chambers. I am also a legal person by formation and experience, and I have the feeling that certain topics that will be covered by these five legal studies are fairly distant from blockchain technology, and at this point in time it is not necessary to dive so much into some details, for example Colombia’s constitution. I am fully aware of the fact that such a foundational piece of legislation lays the groundwork for the entire legal system, but I feel that more of the resources would be better used on more applied topics, closer to the pain points of up and coming blockchain companies. So I think that the proposal lacks a bit of focus on the most important points that are relevant today: tax implications, accounting issues, but most importantly doing a bit of ground-work first (a survey maybe, or discussion with a few start-ups) to better understand the needs of the emergent industry.  \n\nJhonatan, the main proposer, will single handedly deliver the project through his own strength. He is a Lawyer with a MSc degree experience working in public and private entities. It would have been extremely satisfactory to have a bit more details regarding his experience, previous employment and formation. Unfortunately, the linkedin profile, although present, does not shed too much light onto these topics, so this turns into the second worrisome point with regards to the project’s feasibility - since I am not fully convinced that the proposer has the capacity to fully take the project to fruition on all its fronts at the same time. It would have been extremely satisfactory to see at least a line-up of 3-5 seasoned lawyers active in the Colombian market that can support each other and cover the many (and complex) areas of expertise necessary to deliver a wide-scope blockchain legal survey towards the various chambers of commerce.  \n\nThe budget forms the last, but not least, point of improvement of the project. We are being told that the budget is equally split between the five months of the project (3.8k USD each), equally divided between research and legal advice. I find it very hard to believe that it is actually possible to split the budget so well to fit perfectly in each of the five months and that the necessary time needed to research each individual topic (different by nature) are all the same. ", "q1r": 3, "q2": "It is definitely possible for the community to audit the project, but it will not be ideal in its current shape. The proposer offers a few very good points that have to be taken into consideration: whether each of the legal studies was performed according to the plan (one per month), and whether the document was delivered to the CONFECAMARAS (a body acting as a liaison between the multiple Chambers of Commerce in Colombia). \n\nI ask myself the following questions, which are not clear from my point of view: will it be possible for the community to reach out directly to CONFECAMARAS in order to independently confirm the submission of each study? Will an English translation be provided for non Spanish speaking people within the Cardano community? \n\nThe auditability of the project would have been much much better if the proposer would have pledged publicly, within the project itself, to make the documents available online in a certain manner, and, ideally, translated in order for anyone to be able to go through it and judge not only the binary information of whether the document exists (yes or no) but also to offer the possibility of judging the quality of the research performed and the extent of the legal material being offered. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1157, "q0": "Although the proposal addresses the challenge very clearly, (as it aims to deliver an understadning of legal isseues related to crypto adoption within the Chamber of Commerce and in relation to other institutions and/or legislations, starting from the constitution) the proposer limits the approach to Colombia and does not aim to create a standard approach to be potentially used in other countries to reach the same objective.\nMoreover, it is not clear how Cardano in particular will benefit over other cryptocurrencies.\nUnder the description of the solution, the Chamber of Commerce should facilitate companies dealing with crypto by ensuring \"they receive special treatment\". Is this treatment related to freedom to operate, taxation or any other aspects ?", "q0r": 3, "q1": "The proposer is a lawyer and although he has linked his profile to the proposal brief, it seems that the team is not formed yet, so he would be on his own to accomplish sucha a complex study in only 5 months. The deliverables space from a study of the constitution to all the laws in the countries dealing with innovation. \nThe porposer also did not state any detail on how he is related to the Chamber of Commerce of Colombia and if this entity has ever accepted to be part of the study. \nIt is also unclear how the studies would cooperate in a sinergistic way to contribute to the final objective, so to find a \"path\" to easy businesses operating within the crypto space. ", "q1r": 3, "q2": "The proposer asks for 3800 USD a month for a total of 19000 USD. It is unlcear why the budget has been split in two equal parts, one for legal advice (from the proposer himself?) and one for the research (also done by the proposer). \nThe timeline as stated above has been outlined for 5 months, each one for a different reasearch topic.\nThe proposer did not provide a template for the final document eventually produced at the completion of the proposal. \nAlso, the proposer did not shown evidence of businesses that might be interested in this new service offered by The Chamber of Commerce", "q2r": 3, "assessor": "z_assessor_2215", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2760, "q0": "According to the rules of the challenge, the group also claims to assist crypto-related companies with special support and interest from the Chamber of Commerce, however the chamber of commerce is an organization established to Managing the legal affairs related to businesses in the area where the companies are registered, the proposed group claims to support and advise those target audiences, but in the solution the group has not mentioned. specifically how it will support them with a specific legal or example of what difficulties exist in the area where you want to work,\n  sorry to say that the group's proposal only stated what this idea wanted to do, but did not give any real solutions, or examples and specific examples, the team needs to add more details for example : the document statistics how many target companies in the area need support , are you cooperating with the chamber of commerce ?. or how you will support their advice, it is very important to have detailed disclosures for such content, so that the review community can give an impact score you are eligible to receive funding from Catalyst.\n   No specific risks have been identified or foreseen from this proposal, and the group has not provided a specific way of working so it is difficult for the community to contribute potential risks. can be hidden. \"", "q0r": 3, "q1": "\"It is very difficult to determine whether the timelines provided by the proposed team are appropriate to achieve the goals set out on time as committed because this is only a self-stated proposal in the roadmap, not a There is no reference or statement in the solution that mentions the legal research and implementation.\n  sorry I really can't imagine the expenses that the proposed team will announce \"\"The project will have a duration of 5 months and the funding is: 1,900 usd for research per month and 1,900 usd for legal advice per month. month. Conclusion: Asking 3,800 USD per month for 5 months \"\" the team needs to detail each item to be spent such as how many hours of research each month and consulting and support by face-to-face or online methods and the expenses. How much do you spend for that action, how many hours do you work each day and how many dollars for an hour so that you can completely satisfy the financial transparency, and be the highlight for you to have the opportunity to receive financial support? aid.\n  once again very sorry that the link to your profile page is not accessible, so it is not possible to verify your development team information, so not eligible to receive the grant. capital. \"", "q1r": 3, "q2": "\"I know you have provided content for the community to verify and monitor but, where will the content be published to the community, on your website or on some social platform? for which you provide support, there is no commitment for this yet, unfortunately,\nBecause of the reasons I initially mentioned in the impact section, it is difficult to predict what the success of the proposal will be in the future, in addition, what you provide about the success of the project is very general. understand, you should be more specific about the work to be done and the impact on the community or the target company getting what your proposal gives them.\"", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 7979, "q0": "The writer of this proposal wants to address legal issues that companies have regarding cryptocurrencies in Colombia. This will be managed by the Colombian Chamber of Commerce through their group CONFECAMARAS. This proposal will help all Colombian companies related to cryptocurrencies. The legislation surrounding cryptocurrencies is often unclear and it would be good to develop something that ensures that the legislation is clear. The solution offered by this proposal is to produce a document with legal support for the organization uniting the Chamber of Commerce of Colombia. The biggest risk is not delivering the product. It depends on the creator of this proposal.", "q0r": 4, "q1": "The creator of this proposal is a lawyer with a master's degree and several years of work experience in private companies. The linkedin of the writer of this proposal is included. I can find very little information about this person. The author of this proposal is only working on this project. There is a plan stating how the budget will be spent. I think the budget is more than sufficient. The writer will pay himself $3800 per month. I think it would also be helpful to collaborate with other lawyers who already have greater specialization or work experience related to cryptocurrencies. A realistic timetable has been included to implement the proposal (5 months). This plan includes the implementation of the project. The budget will be fully used to provide a fixed monthly salary. The technical aspects should be discussed in more detail. This project does not require additional financing in the future. The only risk included is non-delivery of the product. The creator of this proposal does not consider this to be a risk. It would be better to provide measurable evidence as to why this is not a risk.", "q1r": 3, "q2": "A roadmap and milestones are included. The project will be evaluated monthly and it will be checked whether the project is on schedule. The product will be successful if it will be used. Clear KPIs should be included to measure success. An example of this is the number of users of this elaborated product. This proposal can provide a solution to the problems. The research will still investigate risks and challenges. These have not yet been included because they will only be visible then.", "q2r": 3, "assessor": "z_assessor_2940", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8830, "q0": "Many companies around the world are facing legal challenges related to crypto currencies , is this one of the biggest reason people fear on using crypto currencies, get legal assistance when such instincts occurs is of the biggest challenges faced by companies or even the funded projects, Hence to overcome such scenario in Colombia the proposer's team has set up \"CONFECAMARA\" which will help in counter  legal difficulties that companies related to cryptocurrencies have in Colombia, so that people can continue with their development project without thinking much of legal barriers that might occur in the future, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed solution is a moderate one to achieve where the team of \"CONFECAMARAS\" needs to study all the state laws regarding crypto, as the team has no concern about world laws related to crypto ,here they have to learn only crypto laws related Colombia which is definitely achievable , The proposer is Lawyer with a Master's degree and several years of work experience in Public Entities and in private companies with current law practice crypto law will be just another add on to be achieved, hence with moderate experience involved in the project and With given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposer should have presented how many members will the team consist of,  and how members will be added to the project if more companies needs assist legal advice, the proposer should have think of long future and should have introduced proper people to complete the project, the proposer should even concentrated on one crypto which would have been better, because laws might differ from one crypto to other crypto, The audit should have elaborated on budget breaking idea of the project , with detailed  timeline for the project ,the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 3, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9098, "q0": "The problem that the proposal raises is that Cryptocurrency-related Companies in Colombia face many legal difficulties. The project implementer will provide legal advice and special treatment for companies related to cryptocurrencies by the Colombian Chambers of Commerce (entities where companies are created) through their group \"CONFECAMARAS\". This project will produce a document with legal support for the organization that brings together the Chambers of Commerce of Colombia. This will legally help Crypto-related Companies in Colombia to receive special treatment and advice in the Chamber of Commerce (the organization where companies are legally registered and regulated). Therefore, it will help strengthen the crypto ecosystem and the Cardano ecosystem by helping all the entrepreneurs of the catalyst project in Colombia. This proposal fits the goal of the challenge because it helps to obtain legal implementations for companies or crypto projects approved by our catalyst community.\n\nThe proposal also introduces a risk of not delivering a deliverable product, but this risk is remedied because it depends on the professional advice of the proponent of this project, which is highly motivated to comply with said management.\n", "q0r": 5, "q1": "The project has a duration of 5 months, with specific tasks for each month such as: the first month will be to study the Political Constitution of Colombia; the second month will study the legal nature of the Chamber of Commerce, the third month a legal study will be carried out for the organization \"CONFECAMARAS\"…The project has a clear roadmap.\n\nThe project requires a budget of $19,000 for five months, of which $1,900 for research per month and $1,900 for legal advice per month. I think he should be more detailed about the cost of legal advice 1,900 USD a month, how many hours to consult, how much is the unit price per hour, if there is no company to consult or there are many companies which need more advice than responsiveness?\n\nThe person implementing the project is a professional lawyer, he has participated in the catalyst project from fund 4. This project is successful or not depends entirely on the qualifications, experience and reputation of the implementer, his linkedin is https://www.linkedin.com/in/jhonatan-gutierrez-448507185. This information is reliable.", "q1r": 4, "q2": "The project that provides a measure of progress is: the proponent made the legal studies according to the detailed plan?, the legal studies were made in a maximum of 30 days?, Was the final document sent to the organization \"CONFECAMARAS”? However, he did not offer a way for the community to control the progress of the project. He should come up with a way for the community to control the results of his research.", "q2r": 4, "assessor": "z_assessor_3021", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 10006, "q0": "The author has an opinion on the legal difficulties that crypto-related companies face in Colombia this is not only in Colombia but a lot of parts of the world are facing difficulties and legal constraints in the process of storing and trading cryptocurrencies. From the author's proposal we can see that when the challenge is solved it will have a tremendous impact on the Blockchain and Cardano communities, there will be no more anxiety when trading cryptocurrencies, companies will have the right development. The goal of the proposal is very clear to help crypto-related companies in Colombia operate legally so that they receive special treatment and advice in the Chamber of Commerce, which is necessary. I agree that the proposal is entirely scalable around the world and addresses future challenges, which could be a standard, a model for countries around the world to solve their cryptocurrency-related problems. The author presents only one risk due to the failure to complete the desired product and has a solution with his own ability to complete the challenge set out. In addition, I see a risk that in the process of implementation, when the proposal does not receive support from the organization \"CONFECAMARAS\", the author needs to pay more attention to this and be prepared about meetings, cooperation to implement the proposal.\nRating: 4\n", "q0r": 4, "q1": "The proposal has five-month timelines, the work is divided by month, and the first month of legal studies on Colombia's Political Constitution. Further legal research will be carried out on the legal nature of the Chamber of Commerce. And continue to work for \"CONFECAMARAS\" (The Colombian Confederation of Chambers of Commerce). Evenly dividing this work will help to propose each step of completion and make the audit easier.\nhttps://www.linkedin.com/in/jhonatan-gutierrez-448507185 provide information about the author's competence as a Lawyer with a Master's degree and years of experience for the proposal is appropriate. The challenge of carrying out colombia's legal research on 01 lawyer is feasible. However, we would like to see more categories and laws related to the upcoming study of the author, which shows the feasibility of the proposal. The proposal has a clear budget allocation, implemented over a five-month period, and the funding is: $19,000 for research per month and $19,000 for legal advice per month. With a total amount of $19000 for the entire implementation of the problem is necessary. Good preparation, competent author, lawyer major I completely agree with the feasibility of the proposal.\nRating: 5\n", "q1r": 5, "q2": "Progress audits will be evaluated monthly according to completion and legal studies will be carried out each month as planned. For the proposed audit work carried out on the research of the author has done, the Author needs to have a report on the progress of the implementation monthly and should put the researched data on Github for inspection. evidence. The success of the project is also the final measure of the research, the documents are published and sent to CONFECAMARAS. For the proposal I believe the amount of $ 19,000 will be used in accordance with what is proposed according to the 5-month roadmap.\nRating: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10123, "q0": "About your idea, your proposal is really good, the author has provided a solution to solve legal problems in the COLOMBIA area. But I think you should consider adding more about the actual situation. Currently, in the area you are working on, this helps CAs have a more intuitive view of the proposal as well as give the most accurate situation in the area.\n  The group has the author's statements of experience, now that you have experience in the law industry, I think that will meet all the necessary factors to implement the proposal properly. This proposal is aimed at addressing the legal difficulties faced by crypto-related companies in Colombia. If really successful, it will contribute to creating a competitive environment as well as expanding more Cardano companies in the region. Helps to develop and reach more people, thanks to the author for this useful idea, wish you soon achieve certain success.", "q0r": 4, "q1": "The proponent laid out the roadmap milestones to be achieved during the five-month period of the proposal in a clear and understandable way. Performance goals are clearly defined and the amount of work is broken down through month by month to progress towards completing the proposal in a reasonable manner.\n\n But I, realized that I need to advise the author a bit on how to divide the budget, although you are still very good at dividing and planning to use the money, I think the author mentioned how to allocate the money. Clear each item arising in a month. For example, 1,900 USD / 1 month is paying for advisors and specific research, do we need to hire any team to participate, or how much is the cost of 1 hour?. Hope the author can think about this issue.\n\n  Regarding the presentation of the project, the author describes the layout of the roots. At the same time, clearly define the measurement indicators of the proposal specifically, and you are doing quite well with the problem of risk division encountered.", "q1r": 3, "q2": " It seems that the author is forgetting something about the metrics that help the community measure the success of a proposal like a KPI. This can lead to a lack of transparency in the proposal. Hope to soon add the missing content to help the proposal can be more complete And one point to note is that the group is only you and the lawyer. However, legally, I think you need to make it more clear that you may need to hire someone to be more productive on LinkedIn so we can accurately verify your experience in the most transparent way. maybe.\n\n    The author has come up with a great idea to help crypto-related companies, in the Colombia region reach and solve possible legal issues. This is a good idea that the team suggested could be successfully implemented to improve the problems posed in this area.", "q2r": 3, "assessor": "z_assessor_3160", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11755, "q0": "The idea of “Legal implementation in Colombia” basically fits the goal of the challenge. The content of the solution is to provide legal advice and support for the establishment of new businesses in the field of cryptocurrency in Colombia, including projects funded under the framework of Catalyst. The aim of the solution is to help Colombian crypto-related companies receive fair treatment when going through procedures at the Chamber of Commerce - where companies in this country go through the registration and legally established. Personally, I think the information of the proposal is not really clear and complete. The author has not highlighted the impact of the solution and how they will deploy to support the crypto business community in this South American country. I think the group needs to point out the specific regulations of Colombia, the barriers and difficulties that crypto businesses will face when registering new establishment here. The legal questions that I think need to be discussed are: is the cryptocurrency sector on the list of occupations that are licensed to do business in Colombia? Transactions and revenue need accounting (monthly/quarterly/yearly) so where does the money come from? Who is the entity that appears on the invoice? The requirements for tax declaration and finalization, KYC, payment services... This will lead to the issues the proponent needs to solve to support the business. Specifically, the declaration of a cryptocurrency wallet to serve the reporting of revenue, business operating expenses, related tax obligations, etc. In my opinion, the risks that have not been taken into account include: Firstly, the complex legal system and unspecified regulations related to cryptocurrencies. This is not only in Colombia but also in many countries, because cryptocurrencies are not yet recognized by the laws of many countries. Second, the source of money from cryptocurrency investment is sometimes unclear and difficult to declare before state management agencies and organizations. Third, the risk of ADA devaluation may affect the project implementation budget. I made the following deductions: minus -1 point for incomplete solution information, -1 point because many risks were not considered. My score is 3.", "q0r": 3, "q1": "Regarding the progress of the project, the author plans to do it in 5 months. The description of the plan is still quite vague and unclear. Each month, the proponent will conduct a legal research. However, I could not find descriptions of the progress of the related items. For example: plan to contact the Chamber of Commerce, organize meetings and seminars, develop and finalize research documents, start implementing business support consulting... Legal research topics provided monthly is also unclear. In terms of budget, the team does not break down by item, with unit price and expected quantity. The proposer's profile information is provided quite simply. The project proponent introduced is a lawyer with a Master's degree, who has worked in a number of state agencies and businesses. However, I could not find documents related to the author's skills, experience and achievements, through the reference link provided. Therefore, I do not have enough information to say whether this project is likely to be successful or not. My score is 3 points: -1 point on unclear roadmap, -1 point on lack of detailed budget.", "q1r": 3, "q2": "Regarding auditability, I think that the proposal does not have enough information on indicators and KPIs necessary to measure success. Therefore, it is difficult for the community to have a basis to audit this project. The proponent also does not seem to have identified specific targets to be completed and the goal to be achieved. The author believes that progress will be assessed on a monthly basis, and the cited success measure is: “a) the proponent of conducting legal studies according to the blueprint? ), b) legal studies conducted for up to 30 days? c) Is the final document sent to the \"CONFECAMARAS\" organization?”. However, these questions are not the KPIs that measure success that the community expects. We need to be as specific as possible. For example, there will be at least 5 complete sets of legal research documents to be developed and provided to e-money businesses, supporting at least 10 businesses to successfully register for establishment… Due to the project's insufficient availability data for audit, so my rating in this item is 2 points.", "q2r": 2, "assessor": "z_assessor_3279", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12917, "q0": "Jhonatan has the idea of addressing the legal difficulties encountered in Colombia, difficulties and legal constraints in the process of storing and trading cryptocurrencies. How to address the impact on the Blockchain community and the development of the Cardano ecosystem, worried that cryptocurrency trading will be gone, companies will have appropriate developments without getting entangled in the law. the holding and operation of legal cryptocurrencies. The implementation solution is scalable, creating the foundation for blockchain development. The proposal has an impact on Cardano's development and can expand around the world and solve future challenges, the idea of successful implementation can be a standard for solving cryptocurrency-related problems of many companies, Individuals invest in cryptocurrencies. Jhonatan posed the risk of not completing the product as desired and had the direction to solve with his professional expertise to complete the challenge set out. The risk of support from organizations and chambers of commerce not coordinating with the research Jhonatan presents this is a risk that the proposal does not mention. Reducing this risk requires specific impacts and the documentation sent to help them refer to the legal issues that need to be addressed.\nRating: 4", "q0r": 4, "q1": "Information about the competence of the proposer: As a lawyer with a Master's degree and many years of experience, Verified information on LinkedIn. The right capacity to meet the implementation of the challenge set out. The challenge of carrying out colombia's legal research on a lawyer with many years of local experience is feasible. The plan isdivided month by month, starting with the legal study to be carried out on Colombia's Political Constitution, and legal studies will be carried out on the legal nature of the Chamber of Commerce, the Colombian Confederation of Chambers of Commerce( CONFECAMARAS). \nYour research is in the right direction, the categories, the laws related to research are still a question mark, I believe the problem will be solved. The proposal has a clear budget allocation, with a total of $19000 for the entire implementation of the proposal being necessary, however I look forward to more details for the schedule and each public hour paid. For good preparation, the author is competent, specialized in lawyers I completely agree with the feasibility of the proposal.\nRating: 4", "q1r": 4, "q2": "Carrying out the progress audit will be evaluated monthly, legal studies will be carried out each month as planned. The KPIs given are appropriate, the conduct of the study depends on the report on the monthly progress of implementation and should be put on Github for verification. The success of the project foresees the benefits of the research, the documents are published and sent to CONFECAMARAS. The SDG Sustainable Development Goals are in line with the proposed objectives. The $19,000 will be used in line with what is proposed to follow the five-month roadmap.\nRating: 5", "q2r": 5, "assessor": "z_assessor_3514", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14443, "q0": "The proposal aims to help cryptocurrency companies in Columbia to overcome legal issues. Cryptocurrency and blockchain in general still seem to be a legal gray area to some extent and this puts a damper on the development of companies which are founded on these technologies. The proposer could add some more difficulties that crypto businesses in specifically Columbia encounter compared to conventional technology companies. To facilitate the growth of cryptocurrency companies, the proposal will submit a legal document to the Chambers of Commerce (the legal entity where companies are legally registered) to earn more favorable treatment in establishing and growing crypto companies. Receiving support from local authorities and governing bodies is a crucial part that could determine the prosperity of an industry. For instance, Thailand greatly promotes its tourism industry, investing money in building infrastructures and international promotion. Similarly, if the proposer is able to convince Chambers of Commerce about the potential of the cryptocurrency industry, and if special treatment and investments are poured into these companies, the face of cryptocurrency will completely change for the better. The proposer is able to point out how this paves the way for already established and future cryptocurrency companies in Columbia. Growing a stable crypto community in Columbia is a good way to expand the impact of the crypto and blockchain community globally. The Catalyst and Cardano community in Columbia will also benefit from this, which makes the proposal aligned with the challenge. However, the proposer doesn’t really specify the contents of such a legal document they will submit to Chambers of Commerce. This is important because the contents will decide if this legal entity agrees to grant crypto companies favorable treatment and resources for development. The ambiguity in the contents may lessen the impact of this proposal as it is unclear whether the contents are sufficient or well-designed or not. Therefore, some key ideas from these documents should be mentioned. The main risk will be the inability to develop a sufficient deliverable. How the group \"CONFECAMARAS\" operates should also be explained as not everyone has the knowledge about these entities in Columbia. The proposer is confident that this risk will be minimal. However, there should always be mitigating steps for any possible risks, regardless of their likelihood. Such precaution is always useful in the long-run. Another risk that the proposer could mention is the probability of being rejected by the Chambers of Commerce. A contingency plan or better assurance about the deliverables should be given to make sure this risk is mitigated to the lowest.", "q0r": 3, "q1": "The timeline will be carried out in 5 months. There are specific activities for each month, all of which will be making legal study for different entities (Political Constitution of Colombia, Chambers of Commerce, CONFECAMARAS,...). The content of the legal study could also be briefed through for more clarity and conviction of how it will be effective in achieving the goal. What process the legal study entails should also be mentioned, if possible. The budget breakdown is not sufficiently presented. During 5 months, research and legal advice will take up 1,900 usd each, meaning 3,800 usd for each month. The total budget would then be 19,000 usd. The proposer should specify what the research will be about (ex: cryptocurrency inner workings, companies operation, chances of success, Columbian people’s opinion about cryptocurrency, governmental policies,...). For legal advice, the proposer should state how they arrive at the price of 1,900 usd. For example, the proposer could break the amount of 1,900 usd into ? usd per hour which is the price for hiring legal advisors/ law firms/legal services. A clear budget breakdown will be positive for feasibility. The team consists of only one member, whose profession is a lawyer. Although the relevant experiences are suitable for the nature of this proposal, it can be brought into question whether one person alone can handle the workload and devise the most efficient legal study. The proposer has been working in the Catalyst project since F4, which somehow gives some credibility for their ability to accomplish this proposal alone. However, some more evidence and explanation should be given to add more conviction. Future funds won’t be needed for this proposal.", "q1r": 2, "q2": "The progress will be based on whether the main proponent is able to keep up with the detailed plan and whether the deliverables are delivered within a specific duration of time. These metrics are reasonable, although it is not the most objective way to keep track of progress. This might not be possible for external audit, which is another factor that could increase auditability. The proposer could consider holding meetings or update progress on websites, github, social media. The vision of success and SDG goals are relevant and aligned with the proposal.", "q2r": 3, "assessor": "z_assessor_4055", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14601, "q0": "I will highlight 2 main activities:\n- To assist in solving the legal difficulty faced by crypto-related companies in Colombia, a team of the Colombian Chamber of Commerce will provide legal advice and special treatment to the companies. related to cryptocurrencies\n- The proponent will provide a legal support document to the consortium of Colombian Chambers of Commerce so that they can consult and advise crypto companies in Colombia.\nTherefore, this proposal completely aligns with the challenge because when it is implemented, there will be countless companies or crypto projects that will meet the legal advice needs. They chose the Chamber of Commerce as their consulting place because this is where Colombian companies are legally registered and incorporated. This ensures reaching as many companies as possible.\nThe proponent has pointed out the risk this project faces but has not offered a solution for it. One piece of advice I have for proponents is to demonstrate the team's ability to address risk by showcasing the skills that project team members have, and getting feedback from companies that are consulted problem in the future", "q0r": 3, "q1": "The project construction plan will take place in 5 months along with the main works that need to be completed. Jonathan will be the person to carry out the tasks set out in those 5 months. References to his LinkedIn profile are provided, however no details are provided regarding the \"CONFECAMARAS\" assigned to this proposal, the community will need to know the number of people assigned to the project, the description of their roles, and the hourly rate assigned to each. Roadmap also lacks details, although the proponent detailed the steps of legal research, he did not mention legal advice for companies carried out by CONFECAMARAS organization. The skills of the main proponent have been recognized, however I have some questions for him: “Will the project progress be affected if during the study period there is a change of 1 directives, codes, constitutions? When will you send legal support documents to the Chamber of Commerce?\"", "q1r": 2, "q2": "The proponent has given criteria to check the project progress and these criteria is available to be checked in the future. However, in the project success measurement section there is no mention of any specific success metrics regarding the impact they are seeking. So I have some additional suggestions for this section:\n- The proponent should provide an estimate of the number of companies receiving the advice.\n- Number of companies that find this consulting service useful (proposers can ask for feedback from companies)\n- The time when members of the Colombian Chamber of Commerce can begin providing special treatment and advice to companies related to cryptocurrencies.\n- The reporting structure to ensure the community is able to audit project implementation", "q2r": 3, "assessor": "z_assessor_4075", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "legally manage advice and special treatment for companies related to cryptocurrencies by the Colombian Chambers of Commerce (entities where companies are created) through their group \"CONFECAMARAS\".", "experience": "I am a Lawyer with a Master's degree and several years of work experience in Public Entities and in private companies"}