{"id": 414427, "author": "oliverross", "title": "Legal & Accounting Marketplace", "url": "https://cardano.ideascale.com/a/dtd/414427-48088", "category": 26596, "amount": 17900, "description": "It's hard to know what we can / cannot do legally speaking with projects. Its hard to find domain expert legal or accounting professionals to assist with this process, which create a barrier to entry.", "f6_no_assessments": 11, "f6_rating": 3.7878787878787885, "videos": [], "media": [], "f6_assessments": [{"id": 6655, "q0": "This proposal fits extremely well with the challenge. To recall, its purpose is to offer legal and / or financial solutions that can support funded proposers. Here, we have a serial entrepreneur, the founder of several web-based solutions, that wishes to develop a legal and financial marketplace for the Catalyst proposers on an existing solution, which to me looks like a perfect match and an excellent setting. \n\nThe problem identification is also very good, since the proposers clearly do not have enough access to legal and accounting professionals (there are many reasons behind it, amongst which are the high legal uncertainties regarding blockchain businesses, the low capacity of existing service providers to service this market niche and also the possibly low budgets that start-ups are ready to allocate to legal and financial topics to the detriment of the core, IT-centered expenses. This is of course a long term problem, and any marketplace solution that can diminish these frictions and provide a suitable place where the demand can meet the offer of such services is more than welcomed into the Web3 space. \n\nBuilding such a marketplace onto an existing platform (Antimo in this case) provides obvious benefits, since one does not have to reinvent the wheel, and can focus on building a few tailored-made modules upon an existing platform, thereby saving time, resources and energy for the most important activities. \n\nLastly, a marketplace, if executed correctly, can be a perfect proposal for a scalable solution that can easily cross borders through a few translations and targeted marketing / development efforts down the road. ", "q0r": 5, "q1": "The timeline is very straight forward for the entire project, since it will take approximately three months in order to the platform (or rather module) to be built and launched, and the next six months (3 to 9) will be used mainly for onboarding efforts and slowly increasing the number of legal and accounting practitioners present. \n\nThe very laudable aspect is that the proposer recognizes that business development and onboarding efforts will be key, therefore a major part of the budget and efforts will be focused on outreach and marketing efforts towards the legal, tax and accounting community being on boarded onto the platform.  \n\nAnother strong point of the proposal is that it will be built on an already existing platform, Antimo. As stated in the previous section, this in itself is an excellent proposition. But when glancing over the Antimo app itself, it is not rather clear whether the platform has already gained traction just yet. Definitely, there are already a number of projects (many Cardano based - bravo!) and people onboarded, but I did not have the feeling that excellent traction is already there. This worry could have easily been alleviated through perhaps offering some insightful statistics on the past growth of the platform: when did it start, what are onboarding growth rates, how big is the community, how many contracts / deals reached through it, what are future prospects for growth following this module for legal and accounting marketplace? In a nutshell a lot of questions that can only be answered by the founders themselves, since they are the ones with access to this internal information about organic growth. \n\nIn conclusion, we have a good case for a feasible project here, so five stars are appropriate even after considering the possible insufficient traction of Antimo.", "q1r": 5, "q2": "The auditability of the project is good, but it is not perfect. After the first six months the proposer sets upon a very nice target of 50 professionals onboarded (25 legal + 25 accounting) and a doubling of that number after the first nine months - which is very laudable, and a smart objective overall. \n\nAnother strong point is that the proposer is very well grounded in the Cardano community and it will be extremely easy for him / his team to reach out to existing members and tap onto their expertise when needed, either through finding very quickly (already stated in the project) a knowledgeable community manager to handle communications and help with expanding the user base but also through (my thoughts) having an ear already focused on community feedback and correcting the minor aspects on the go, while at the same time being knowledgeable of the usual communication methods in order to keep the community informed, when necessary, on the project’s development. \n\nThe proposer also explains rather briefly his vision on how the project can be audited: by using pure metrics of the professionals on-boarded and their advertising results within the community. For me this explanation is good, but it also takes a bit of effort in order to think about what actually lies behind the words. I would have really enjoyed it if the proposer spent a bit more time detailing the entire auditability part. What are those actual metrics? How will they be measured, via the platform, is Antimo already built with that in mind? Are the solutions used open source, and will these metrics be available to the community? There are many questions unanswered.\n\nThe same argument can be made for success KPIs. The proposer states that a successful project can be defined as a place in which proposers can ensure they are setting out on a safe endeavor legally and financially, and where the stress of compliance doesn't stop the growth potential. While these are definitely nice words and an extremely powerful “mission” for a project, I would have liked to see this mission operationalized down to more concrete levels. For instance, to discuss ways to measure what a “safe endeavor” is from a financial or legal point of view, or how we can measure compliance or noncompliance for companies utilizing the services of the platform. \n\nIn conclusion a good enough base for auditability, but with a few points of improvement regarding setting KPIs and measuring satisfaction.", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 13998, "q0": "Overall, this is a quite intriguing proposal and closely similar to the initial requirements from the challenge that is set by the “Legal and Financial Implementations”. This proposal aims to provide a legal services market relating to accounting and legal issues. Thereby accessing and interacting with many legal experts and accountants all over the world. For those new start-up projects in Catalyst, they sometimes or even often seem to struggle with obstacles related to commercial/business law and the accounting requirements. Those problems are extremely hard to deal with for not only those newbies but also for most multinational enterprises whose size is not really large. Since our community’s activity scale is global, we also welcome as many as possible foreign projects to spread Cardano’s reputation all over the world and extend our popularity. However, each country will have regulations about audit and law separately, and there would be some restrictions that are not much beneficial for those multinational enterprises. Most enterprises will tend to minimize as much as the cost for each performed services or guarantee about their profit and keep the costs at the as much lower level as possible. However, the legal issues and accounting regulations would be barriers and if the proposal is approved, it would assist a lot in providing solutions or give explanations about accounting as well as legal barriers for those in need. Thus, there is no doubt about my support for this proposal as the impact of it is really essential as I analyzed above.", "q0r": 5, "q1": "For the feasibility, I do give a positive hope for this proposal since it has the name “Oliver Ross' ' as one of the team members. His experience is really terrific with no doubt, definitely. However, when looking in-depth at the description of the proposal, it raised some suspicious opinions in my mind and is necessary to discuss. The strategy in the proposal description has been just written in general rather than in detail. Thus, it’s hard for us to follow up the process and compare whether this proposal is on progress or not as well as successful or not. There are also some items which pretend to be on progress for such a long-term duration that I do not really know which part of it is important for the whole process. The “professionals outreach program underway” can be taken as an example when every essential detail and component inside it are not described in-depth. I do not give any disagreement toward this proposal since I still think this is such a creative idea for most related to law and accounting obstacles as mentioned in the impact section. Literally, I did hope to see more about this idea and how truthful it is. As law is created and edited carefully by the legislative department or in some countries that would be the National Assembly, and force all residents of that country to obey it then absolutely, it is never seen as an easy problem for a group of people can figure out the solution for MNEs to avoid those troubles related to law. Moreover, to ensure that there is no misunderstanding or lack of knowledge about legal issues, this group would need to find an expert lawyer council as a legal advisor in each cluster/state. This would cost a lot of time as well as money in order to pursue the main purpose of the proposal. I saw the items of work related to this but it seems like an outside coat rather than the inside “T-shirt”. In other words, it would be better if the proposer can visualize the workload of the proposal by providing description in more detail so that those supporters of this creative idea can have a more sustainable foundation that they place their vote in the right destination. Moreover, as I analyzed about the necessity of finding an expert lawyer council will cost a lot, it is understandable there may be some high rates exposed in the budgeted sheet. But it would be more persuasive when those numbers are described specifically. We need a specific and visualized frame rather than the final total numbers but didn't show anything to prove the importance or the reliability of the proposal. At least, you should let us know why those costs are necessary. For example, you mention the Community outreach / management as $30ph but I wonder which scale or criterion for your group to take this number as the base cost for total $3,900. There should be more explanation at least showing where the basic information is. One more thing, when your group decided to use the outsource human, which base condition whether renting that person or that lawyer as their capacity meets the requirement? And how much would you pay for them? I would prefer a specific profile that is able to be accessed from Linkedin or Twitter or similar platform to make sure the quality of your teammates is truthful. Although I know Oliver Ross is a founder of plentiful potential websites like onchainuniversity.com, or web development or sealsociety, it is not enough for the base evaluation for the whole team because everyone is different. In case, the proposal and the team members all rely on only Oliver Ross, and it becomes a single person with a single deal, your teammates have to show us your past achievements to show us you have ability and we can trust you. It would be a big pity if this proposal is not passed because of lacking that information.", "q1r": 3, "q2": "In auditability, the proposal seems lacking a lot of vital information (timeline, measurement approach, etc.) that is useful to indicate at which stage of the process, the proposal can be evaluated as succeeding or failing to convince people to vote for this proposal. A statement like creating a world that guarantees the legal and financial safety for the users and no more confirmation or evidence to prove it and forecast how much percentage of successful proposals there are. Therefore, I suggest the addition of some measurement criterions like providing the visualized number of how many lawyers are willing to join the proposal, or the number to measure the proposal is well-known or not, etc.  The description is not provided in the answer so that all the relating to auditability is really ambiguous and if just evaluating for the overall, I cannot rate a much higher score point than the average level.", "q2r": 3, "assessor": "z_assessor_3870", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1159, "q0": "The proposal meets the challenge as it aims to enhance an already existing platform http://antimo.io to create a meeting point for legal and accounting professionists who are looking for clients within small to medium size businesses operating in Cardano and/or other blockchain envrironments.\nThe platform has already a consensus score for the accredited professionists, which would build trust in the people approaching the above mentioned professionists.\nPoint for improvement:It would be great to see the logic to assign this consensus score written also in the proposal.", "q0r": 5, "q1": "The proposer claims to have dealt with different projects within Cardano, such as being the editor of Cardano journal. \nThe proposer provided relevant links to the websites is working/active on. \nThe proposal aims to collect 50 lawyers and 50 accountants within 9 months, which is a duable objective given the fact the platform for them to enroll is already built.\nThe budget required is aroun 18000 usd, of which 80% dedicated to the marketing. \nBased on my experience, 10000 usd could bring effectively at least 100 people to the space.\nThe rest of the capital will be deployed to hire writers with experience in legal and informational articles, and build connections by hiring a community manager from the Cardano ecosystem.", "q1r": 5, "q2": "The information provided are sufficient to evaluate the proposal, as explained above, the budget and timeline are outlined in a concise and clear manner. Nevertheless, I encourage the proposer to provide a little bit more about the sinergistic effect of writing and publishing articles regarding the legal field and attracting new professionists.\nMoreover, I would like to see hoe the https://onchainuniversity.com/ would provide an added value for the professionists, maybe creating a dedicated course for them to get quickly onboarded on Cardano with a particular attention to their sector.", "q2r": 4, "assessor": "z_assessor_2215", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4885, "q0": "The proposal is building a web space (called legal and accounting services marketplace) where the legal and financial professionals access to provide their expertise. It is also a space wherein the funded proposers would scout for services.\n\nThis proposal, as I see it, is making an avenue for the professional to support and contribute to the ecosystem with their expertise. The legal and financial services needed can be accessed directly and easily. It is a solution answering the call from the campaign and the challenge.\n\nI therefore, strongly agree that this proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has IT experience and has been involved in the Cardano community.  He and his team have created a website providing learning and education on Blockchain, they also run a consultancy on web design and application. In addition, they maintain a site telling the Cardano stories; and, yet another marketplace for NFTs. \n\nThe proposer will build the web space as an add-on to the existing project and the cost does not involve the set up effort, but only outreach and marketing and promotion to reach out to the professionals. \n\nThe plan is to build the marketplace framework and reach out to the professionals with the aim of getting 50 lawyers and 50 accountants by the end of 9 months. As the cost is only confined to getting the experts the budget requested is USD17900, the bulk of it is to be spent on advertisement on social and mainstream media. The rest is on the promotion through articles and community outreach.\n\nThe main pillar of this proposal is Oliver Ross. He will oversee the project and hire personnel on outreach, articles and marketing.\n\nThe many projects in his hands may have some impact on this proposal execution. However, he has recognised this problem and that's why he is hiring helping hands. I would give credit for his good planning and therefore I strongly agree that it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal gives a timeline of 3 months to get 25 accountants and 25 lawyers and then at the end of 9 months 50 of them each on board the marketplace.  However, although it has stated the metrics for measure, I am not clear how the reporting of progress is to be made and through which channel of communication.\n\nAs for the success, I do not see how much the expertise service is being utilized and how many funded projects have benefited.\n\nDespite the immediate foregoings, I agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2631", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5999, "q0": "The idea of ​​the proposal I think is suitable for the \"Legal & Financial Implementations\" challenge. Basically, the proposed team will build a market for legal and accounting services where it will access and contact with legal and accounting professionals worldwide. The aim is to connect emerging projects within Catalyst to professionals to remove the legal and financial barriers that impede projects This is a pretty good idea, it will help a lot for proposals in Catalyst because legal issues, as well as corporate financial operations, are always a headache for investors. For small and medium-sized companies, the legality will be different for each different country and region, and for projects that expand to the whole world, there will be huge obstacles in this regard. The necessity of this idea is indisputable.", "q0r": 5, "q1": "In terms of feasibility, I assess that the project is just average. There are a few issues we need to discuss here:\n- Implementation roadmap: I think that the information provided by the proponent here is sketchy and general. For example, when it comes to \"Professionals outreach program underway\" to be done within 3 months, I still can't imagine what needs to be done that takes so long. Here I suggest that the proposer should be more detailed. For example, i) proactively contacting the bar (or financial advisor) council in East Asia (first month), ii) reaching out to the African and European community (next month), iii) outreach to the American community (third month). This is just an example for us to visualize the work to be done and the community will easily visualize the implementation roadmap.\n- budget breakdown: as well as the implementation roadmap, I think a lot of information is still general. I think the proposed team should be more detailed about the costs to use. For example: \"combined social media and real world advertising budget: $10,000\", I still can't figure out why so much money is needed. In addition, the proposer stated that he will hire community managers, hire writers with experience in legal news articles, but this rental cost is not included in the budget breakdown.\n- Team member: I appreciate Oliver Ross's experience, but honestly I don't know what their experience is like for the other members. Since the proposer will outsource, what is the criterion to evaluate whether they will have enough professional experience in the position to be performed?", "q1r": 3, "q2": "I understand that Oliver Ross is a talented man creating antimo.io, onchainuniversity.com, web developer sealsociety.io but to be honest I still don't know exactly what he looks like. I suppose the proposer should add here references to personal profiles such as Twitter or LinkedIn so that Oliver Ross can be identified by the community. Also when it comes to milestones to measure project progress, it seems to quite a bit of information missing to show that the project is progressing successfully, for example, adding metrics like #number of proposals connected to legal and financial experts, #number of experts are willing to cooperate.\nTherefore, overall, the auditability of the proposal is average in my opinion.", "q2r": 3, "assessor": "z_assessor_2771", "no_vca": 14, "ne": 0, "ng": 13, "nfo": 1, "vca_o": 1}, {"id": 8384, "q0": "Coming to round 9, many projects are concerned more about legal issues and this solution is born to help them satisfy these needs. The author brings out the idea to solve the problems, in particular he will create the marketplace of legal and accounting services which can help other projects to go further. This is good and the author has the plan already to implement it. For the risks, I do not agree with them that the main obstacle is to persuade legal and financial experts to trust the blockchain value as it is now very well-known in the world with many benefits proved to both blockchain and non-blockchain community so the issue here is how to give them enough benefits to make them join with us, also the chosen ones must have experience in web3 as well.", "q0r": 4, "q1": "The activity plan is quite short and not enough information to evaluate, it can be seen there one outreach expert program is being built and some milestones to recruit specific number of lawyers and accountants. Therefore, the writer should provide more details about their program so we can see if it is attractive or not, and if they would like to recruit many employees in the very short time, they should show us their experience in mass recruitment as well or any achievement related to it. The budget breakdown is good for each listed requirements but it could be better if they can mention again their existing project so it is much easier for us to check the budget. The project leader has nearly ten year experience in managing team and projects which is a good basic to implement the plan, certainly he will need more assitants but at present no one is recruited so far so the possibility of this plan is still a question.", "q1r": 3, "q2": "The auditabiltiy contains two indicators such as number of recruited people and the effect to community which are not enough for this kind of project. For example, they should add the number of customers will expectedly come to ask help and some metrics to calculate their satisfaction over it and so on. Moreover, the criteria of tracking advertisement result in the community is unclear and they should clarify it too. Finally, I agree the successful of the project can be described by some nice words safe place to find legal advice but life is harsh, to reach that target you have to overcome many competitors and more importantly to gain trust from customers, that is the story in the future and at present there are no good signals yet/", "q2r": 3, "assessor": "z_assessor_2979", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8663, "q0": "This proposal is going in the right direction that this Challenge sets, which is to build a market providing accounting and legal services for projects in the Cardano & Catalyst ecosystem. Although the idea is clear and relevant, the author still needs to provide more details about the service they are about to deploy, for example, how to receive and process customer needs, target customers (this has to do with languages ​​served), customer data security mechanisms, service packs, etc. The KPI they give is just stopping at setting goals for the service market, this project is missing the KPIs to be able to determine the service's growth in the future such as customer growth monthly/quarterly/yearly basis, future scalability of the service, etc. The proponent is too focused on the work of building the market and neglecting the marketing for it, the risk of not attracting many projects to choose to use their services has not been mentioned as well as the optimal solution to this problem.", "q0r": 3, "q1": "The master project development plan board is just describing the actions they will take for service development without going into details. It is difficult to know what resources and methods the proponent will prepare to perform those actions. For example, what resources will build the market framework, the ancillary work that takes place around it, the structure of the market framework, etc, so far there is no basis to visualize the design market framework. In addition, there is no set time for the service to officially go live. The positions targeted for operating this project are still vacant, the proponent is planning to outsource those positions, I am wondering if this outsourcing will incur any additional costs for it or not. There is not any information about the people/organizations with which the author intends to cooperate, Therefore, the risk of prolonging the project's progress if the right person is not selected is a huge problem. Some of the items mentioned in the budget allocation plan did not match the development plan and the description of the proposal, $4000 for a series of longer form law/finance articles, what are these articles going to be used for, I didn't find any information about this before.", "q1r": 2, "q2": "The proponent describes how to track project progress through the pure metrics of the professionals onboarded and their advertising results within the community. But they have not yet been confirmed whether these figures will be released internally or publicly available to the community. This project lacks an audit roadmap after the project, that is after their service is officially put into operation. They are only assessing the impact of the project through the number of experts participating in the market, while the customer is the decisive factor for the success of the service and an indicator to be considered. Proposers can refer back to the key metric to measure section of the Challenge to establish themselves an appropriate and effective audit roadmap.", "q2r": 2, "assessor": "z_assessor_2996", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 8999, "q0": "This proposal seeks to recruit more lawyers to the professional recruiting website built on Cardano, Antimo. The platform exists and this proposal seeks to enable it to be more useful for legal and financial planning through targeted outreach to lawyers and financial professionals. The platform would allow them to market their skills, and allow them pursue projects seeking skilled lawyers. Additionally, they could earn a reputation for completing projects and be able to get paid for their skills. If this platform grew in the legal and financial area, that would create a huge impact for the Cardano ecosystem. If the right materials were created and if a large group of legal and financial professionals were attracted this would greatly help new teams and projects find and secure the legal and financial advice they need to be successful .", "q0r": 4, "q1": "It is likely that this proposal is completely feasible, but there is not sufficient detail in the proposal to determine it. The proposer is not an expert in marketing, not a lawyer with legal experience, or professional connections to other lawyers. This could make it challenging for them to connect with their target audience. Additionally, the proposal team hsa no experience with marketing and has yet to engage with a marketing specialist or community manager even in basic conversations. This would have helped to give a more detailed roadmap and timeline. Overall, the proposal could have taken a few additional steps to give assessors the information needed to make an informed assessment, but sadly they did not. Therefore I can only really give this a score of 3.  ", "q1r": 3, "q2": "When it comes to auditability, the proposer chose to only make a few brief statements without any clear metrics or way of disseminating those to the public. This project’s sole accountability plan is to, “have the pure metrics of professionals onboarded and their advertising results within the community.” This is vague, not very clear, and not very transparent. Ideally, there would have been a list of metrics and how to measure them. For example it could have said, “we will report the number of views/engagements on our media materials.” The proposal gives a good idea of the plan, and the plan appears workable, but there is insufficient detail to really give this a high ranking. I would suggest reviewing this and rewriting it and bringing it back again for the next fund.", "q2r": 2, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9100, "q0": "The proposal raises the issue that projects in the Cardano ecosystem are difficult to access legal and accounting professionals, so the proposal will create a service marketplace full of legal and tax professionals, willing to take on Cardano projects as a client. The proposal will integrate into the Antimo project (add functionality to an existing platform) which is an existing project. When a team is looking to start a project, they can easily find recommended experts to consult, thus ensuring a good outcome for the whole industry by avoiding legal issues and bad press. Thus, the proposal is consistent with the objective of the challenge. The proposal also lays out the risk and how to overcome it.\n", "q0r": 4, "q1": "The proposal is expected to be implemented in 9 months, giving a clear and specific roadmap: 3 months to complete the development of the market framework and implement the program to reach out to experts, after 6 months there will be 25 lawyers on -boarded, 25 on-boarded accountants; Panel discussions recorded broadcast to the community, after 9 months there will be 50 lawyers on-boarded and 50 accountants on-boarded. With this specific roadmap, the project can be successfully implemented.\n\nThe project builds on an existing project, so the budget will be used for outreach and advertising activities. The project requires a budget of $17,900, of which outreach/administration is $3,900, longer form legal/financial articles $4,000, social media and real-world advertising $10,000. I think the cost of advertising should be more detailed, how is the expected cost of advertising on social networks, how is the specific cost, what form of real - world advertising, how much does it cost...\n\nThe Project only introduces an overall project manager, Oliver Ross, he is a Creator of https://antimo.io/, //onchainuniversity.com/, //wholegraintech.com/, Editor of https://medium.com/cardano-journal, Web developer on https://sealsociety.io/. He will hire a community manager from the Cardano ecosystem, hire legal and financial news writers. In the budget section, he expected the outreach/management cost to be $3,900, which I'm afraid is a bit low. He should recalculate costs to ensure a cost-effective project.\n", "q1r": 4, "q2": " The proposal will provide pure metrics of the professionals on-boarded and their advertising results within the community. As in the roadmap, the number of on-boarded legal and accounting experts for each period is mentioned. This metric is specific, clear, and controllable by the community.", "q2r": 5, "assessor": "z_assessor_3021", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 14241, "q0": "This is an impactful proposition for Challenge. This proposal builds a marketplace providing accounting and legal services for web3 projects. It can be seen that the proposal poses a suitable problem for Challenge. The problem that they will solve seems to be broader than what Challenge requires. Do not limit the provision of accounting and legal services to sponsored proposals. The proposal solved two questions of the challenge, namely: \"How can effective solutions be built to discover and provide legal and accounting services (an aspect of finance)?\" and \"Support for Sponsored Proposers.\" This proposal is fully scalable in the future. If the problem posed is resolved, this proposal will provide a large pool of qualified legal professionals and accountants who can assist and advise the sponsored proposers. The broader goal is to scale the Cardano community and improve the quality of the community with legal and accounting expertise. To solve the problem, they offer outreach and project marketing to legal professionals and accountants worldwide. At the same time, they continue to consult projects from the Cardano ecosystem according to the needs of legal and accounting services. This is a platform to connect Cardano projects with potential legal professionals and accountants. To ensure that the process of starting and operating Cardano projects is guaranteed in terms of legal, tax, accounting, etc. However, it should be noted that: they have not given specific evidence, such as: what will they do to approach and attract legal experts and accountants? What do they do to ensure the quality of consulting services? Blockchain is a new market; not just any legal expert or accountant can handle legal and accounting issues that arise for a project or startup. This proposal is not really clear and thorough in planning the implementation. However, it should be emphasized that I appreciate their ideas. The proposal puts at risk the quantity and quality of legal professionals and accountants. I agree with this; it's completely risky. It's commendable that they have a solution, which proposes to include outreach programs, video and audio educational media, and other content aimed directly at professionals. Unfortunately, they have not specified what they will do. What is the content, knowledge of the programs or documents? It's not just a matter of explaining to legal professionals and accountants what Blockchain is. They need to have legal and financial knowledge that Cardano projects may encounter, such as: Business Organization, Token Sale, Tax, AML/KYC, SAAS, Copyright, Stablecoin, Smart Contract, Auditing, Disputes, etc. This will be an obstacle to providing services to Cardano projects if financial professionals and accountants do not have sufficient qualifications, knowledge of this field, and practical experience. In addition, the proposal may face a number of risks: 1/Legal danger: In the legal framework of many countries, blockchain is not currently recognized by many countries, so the proposal should only be provided, introduce yourself, introduce career opportunities ... do not call for investment or investment advice. 2/ Risks about the quality of legal consulting services and auditors. The question here is: in the case of a legal expert or an auditor intentionally giving wrong advice, affecting the rights, interests, and reputation of the project, more seriously it may be related to illegality. law. So, is there any proposal to control this risk? In my opinion, it is possible to build 2 consulting rounds with a professional team that consists of top experts who will control the consulting content of the staff. I acknowledge their idea, but to be honest, this idea is quite sketchy, has not been described in detail, and has not convinced me yet. It would be a good project if more invested, but there is no denying its impact on the Cardano community. So the score for impact is 3.", "q0r": 3, "q1": "Regarding the implementation roadmap, the proposal provides a target timeline for the project. However, the timeline and operational plan of the proposal are not really reasonable. Specifically, in the first three months, it is recommended to add outreach work to funded projects to examine the legal and financial issues they have or are currently facing. This is an opportunity to approach potential clients and prepare documents, provide data, and knowledge for legal professionals and accountants. In addition, expert outreach programs should be more specific and detailed. Like, in those three months, what organizations will they connect with? With law offices, financial firms, or associations? What is the target quantity set? We need action plans and specific goals. In addition, for the next six and nine months, the proposal does not yet plan to connect and provide services to funded projects. I think this is a pretty big omission. They have set a goal that after 6 months there will be a list of 25 lawyers and 25 accountants ready to work, and after 9 months, 50 lawyers and 50 accountants. Acknowledge the goals they have set. But, I suggest adding a target \"How much amount of projects to be serviced?\" anh \"Is the quality of the consulting service good or not?\". This is an important goal that the proposal and the challenge are aiming for. Everyone can fully check the progress and results of the project through Antimo. In terms of budget, the proposal's fundraising budget represents about 3.6% of the Challenge's total. The fundraising budget is not too high; however, if the issues I suggested above are improved, it may incur costs and need to increase the funding budget. The proposal's fundraising budget has a specific spending plan. However, there are no additional plans. In the event that the price of ADA decreases, an additional 5% of the fundraising budget can be budgeted. About the team, can only one member make the proposal? Oliver Ross__overall project manager with experience in enterprise IT, team and project management (unfortunately they do not provide a link or website to verify identity). It is worth noting that Oliver Ross does not have legal or financial experience. Is it possible to guarantee the quality of consulting services and reputation in the market? Because as far as I know, there are many similar proposals today, but because their team are experts in the fields of law and finance, they can control the legal and financial issues that arise. Besides, legal consulting work is very important, requiring high qualifications, qualifications, experience, and reputation. In many countries, the field of legal advice is a conditional profession. Therefore, it is necessary to consider the ability of the team to ensure the operating conditions and quality of services in the future. With the above arguments and suggestions, I think the score for feasibility is not high.", "q1r": 2, "q2": "I do not appreciate the transparency of the proposal. The project has a measure of success, reflected in the number of lawyers and accountants it provides. These indicators are easy to check and compare. However, you can only check the quantity, not the quality of the service they provide. Therefore, I propose an index to measure the quality of legal and accounting consulting services by having them conduct tests to assess their professional qualifications and consulting skills and conduct a survey of the projects they have collaborated on to get the most unbiased reviews. An important goal is to prioritize service quality. Therefore, the project's transparency score is 2. Hopefully, the team will improve to have the most complete proposals.", "q2r": 2, "assessor": "z_assessor_3950", "no_vca": 4, "ne": 2, "ng": 1, "nfo": 1, "vca_o": 1}, {"id": 14821, "q0": "Currently, the Cardano ecosystem has grown significantly, becoming more varied in terms of themes and fields. As a result, many projects face a variety of challenges, including legal and accounting issues. According to the author, this proposal would help small to medium-sized initiatives as well as worldwide outreach and marketing for legal and tax professionals. This not only guarantees that no ideas are rejected solely because of such difficulties, but also encourages additional professionals to join the Cardano ecosystem. And this attribute is exactly what the Challenge is looking for. In addition, I feel that employing media such as videos and audio instructive material to promote will help to tackle the problem of earning user trust, but this is not enough. My opinion is that the proposer should strive to impress the client by presenting examples that the staff has solved. Nonetheless, what is described in this part satisfies the standards well.", "q0r": 5, "q1": "I was really impressed with the project's team members. Normally, a team of many bright people with incredibly amazing abilities and expertise would lead the project, however, this project will be led by only one person - the proposer. As can be seen, the author has built a number of websites in various sectors and has worked on a number of other projects inside the Cardano ecosystem, assisting with web construction, project management, and technical assistance. This surely helps this project a lot in terms of establishing solid foundations and locating the best legal and tax consultants for the business. What's more, although working alone, what is mentioned here absolutely satisfies the standards. The project will be broken into three major parts and will take about 270 days to complete. The author clearly states each milestone, and the activities will take place in a logical and understandable manner. However, it would be preferable if, in addition to the data and number of on-boarded attorneys and accountants, the author could explain how many projects are supported, and whether one person will support each project or work will be divided into groups. The budget shows that the initiative was developed on top of an existing project, hence the investment money is largely spent on advertising. And I like that the author specifies how and for how long the promotion will take place - something that many proposals fail to do.", "q1r": 5, "q2": "In this section, I only rate 3 out of 5 points since the author failed to offer the relevant information. First and foremost, projects will establish an environment in which projects can easily guarantee they are embarking on legal and financially sound ventures. Just stick to the idea that the proposer outlined above, and I am confident that the project will be a huge success. However, the deadlines for achieving each of the milestones were not discovered. The proposal proposes using the pure metrics of the professional on-boarded and their advertising outcomes to measure project development, but this only benefits the insiders, not the voters. In order for a project to be authorized by the Cardano voter board, the critical phases of the project must be precisely captured in order to accurately judge if their money is being invested wisely.", "q2r": 5, "assessor": "z_assessor_4104", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "I will build out a legal and accounting services marketplace, attract professionals to it, and help grow the accessibility these services for web3 projects. This will be built into the Antimo project.", "experience": "I have 8 years experience in corporate IT, managing teams and projects.\nIn the Cardano space I have run a number of successful projects and collaborate with a wide variety of projects and teams."}