{"id": 414465, "author": "yogo", "title": "Accounting Reporting France", "url": "https://cardano.ideascale.com/a/dtd/414465-48088", "category": 26596, "amount": 11200, "description": "As a full-time Cardano/Catalyst, facing a major challenge in declaring income and managing the reporting process with multi-project engagement. ", "f6_no_assessments": 12, "f6_rating": 4.638888888888888, "videos": [], "media": [], "f6_assessments": [{"id": 6656, "q0": "What an excellent proposal! I know first hand examples of French blockchain practitioners moving to more forgiving countries (Central America) due to the very burdensome requirements from France, in terms of general financial reporting but also due to the high tax levels there. We can’t unfortunately do anything about the tax levels, but this proposal is the next best thing in terms of offering a helping hand to blockchain professionals working in France. \n\nThis proposal brings an excellent value proposition: to analyze the flow of funds relevant to the Catalyst activities and define an accounting reporting path. Such an effort, when complete, can greatly support and assist a number of projects with a strong presence in France. And there are many of them within the Cardano ecosystem: Cardashift has extremely strong French roots, and so does Cardano4Climate. \n\nWithin this context of a burdensome regulatory framework for blockchain activities in France (both at individual and corporate level) and already existing teams working there for Cardano projects, the project is extremely well positioned to deliver added value within the challenge’s context, since there is a great need for legal and accounting personnel joining ranks within Cardano / Catalyst ecosystem and make proposers’  lives easier. \n\nAnother great strength of the proposal is that the proposer behind it, Yoram, is already a member of several Cardano initiatives, and it will be extremely efficient if somebody with an existing background is in charge of identifying pain points and defining exactly what kind of solutions are necessary in order to mitigate compliance and regulatory risks. Building on this point, imagine that once businesses gain peace of mind from a compliance perspective, they will be much more inclined to expand their business and take on additional projects within the ecosystem - therefore the proposal has not only the capacity of minimizing risks, but also offering a strong nudge to funded proposers to build more solutions and focus on core activities. \n\nProviding funded proposals with solutions and services to operate legally in their residing country will open new possibilities and provide peace of mind to the project owners. Many projects will broaden their horizons and increase their impact on the Ecosystem once legal and financial frameworks are explored and established. This will in turn promote adoption and improve product ownership. There is a need to get accountants and lawyers into the Cardano & Catalyst Ecosystem.", "q0r": 5, "q1": "Yoram, the proposer, is a veteran Cardano community member, having been involved in various Catalyst activities, including CA, VCA and proposer since Fund 6. The value proposition of the project is rather straigh-forward: obtain assistance from the France-based accountant in order to define a reporting path for 2022 and onward and navigate the existing (and increasing) complexities of ongoing projects: multi-project staking rewards, multi-wallet approach, recording activities, expenses and revenues scenarios, etcetera and transform this assistance into weekly office hours support for community members in need of advice from (mostly) France. \n\nYoram also does an excellent job of presenting the past efforts in terms of accounting activities, and he makes a very compelling case for why such activities will be increasingly complex in the future for multi-projects - which is actually what we want, right, for an existing team to be more and more involved in the Cardano ecosystem?\n\nIf implemented correctly it will be very easy for Yoram / his team to pass on this knowledge gained towards other France-based teams in order to minimize their pain points when it comes to reporting requirements and choosing the best paths forward when selecting the legal vehicles to be used for their specific activities. \n\nFrom a budget perspective, all the amounts presented are very, very reasonable (and them some) while the timeline is also in line with the reporting timeline for 2022 (excellent timing) therefore I don’t feel the need to expand further on these two topics since the team behind and the way the project is presented already offers sufficient comfort that the project has excellent feasibility prospects. ", "q1r": 5, "q2": "The prospects for auditability for this project are also top notch. Yoram begins by explaining in great detail that a primary focus of the project will be to document everything meticulously (draft a summary of key sessions with the accountant, design the process and tools with widely adopted tools, like excel or miro and have them available for the community via a google folder, etcetera. Of course, the project will comprise a final report describing the various frameworks and potential pathways for reporting. \n\nWe are also being offered a very strong KPI - that is a number of 10 people / companies that are to receive support during this project - which is an excellent indication that there is a strong desire to pass on the knowledge gained onto other teams active within the Cardano blockchain industry. \n\nJust as a small suggestion, it would be very helpful if the final report mentioned above includes some sort of FAQs section and perhaps even a basic guide for new entrepreneurs / freelancers wishing to enter the space, in helping them select the most appropriate vehicles to conduct their business. But overall excellent auditability prospects for the project. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1194, "q0": "If you are implementing projects or doing jobs at Catalyst and are paid in ADA, you will surely understand the complicated accounting issues here: related to legal issues about crypto currency in our country, income reporting issues, paying taxes, dealing with price volatility issues when exchanging money from ADA to other fiat currencies. This is the reason, that the proponent of this project wanted to undertake a research project on statistical and financial reporting methods suitable for these cases in his locality in France. At the same time, he wants to make it easier for other members of Catalyst to overcome these problems. I read the proposal and liked the idea. However, the solution he gave was not really clear and enough to convince me. So I can't give a maximum score yet.", "q0r": 4, "q1": "The plan of this project is basically built in 6 months. However, I do not really know the details of what each week, each month they will implement, because they only emphasize a few things they plan to implement in each quarter. Specifically, they will focus on accounting statistics, finding suitable accounting methods, meeting groups, discussing related legal issues. Although they do not currently work with lawyers in depth, or do not have specific reports related to local legal issues regarding cryptocurrencies. While this problem can be learned in advance. Therefore, the work plan is not detailed enough to convince me.\nThe budget they apply for is not too large, mainly to pay income to members participating in this accounting. I have not seen a communication plan to support other projects in the catalyst space or work with the government on legal matters here.\nRegarding personnel, the positive point is that they have enough member profiles of each person, but they are not really experts in accounting or law.", "q1r": 3, "q2": "In this project, they will choose reporting tools through excel, miro - common reporting tools, suitable for the field of accounting and finance of this project.\nThese tools are also completely open to the community to monitor the work progress, and other catalyst groups, especially in France, can learn from them.\nThey also set KPIs for their 6 months of work: \"develop 3-5 reporting pathways for multiple use cases\n3-5 tools/forms to support the reporting process; also support 10 other people/companies with their reporting process.\" However, this would convince me more if the KPIs were made more detailed for each week/month.\nIn addition, in the idea section, they mentioned working with legal lawyers and supporting other catalyst groups, but their plan did not focus on these encouraging goals. So I can't give them full marks on this part yet.", "q2r": 4, "assessor": "z_assessor_2217", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3433, "q0": "The outcomes of this proposal is much needed. The idea here is develop pathways to report earning in Crypto (ADA) to Governments tax auhtiries (France, in this case), buidling this togethe with an accountant and a lawyer. I see in many Cardano forums (such as Telegram) people having question on this and concerned about not declaring it corretly and being punished with more taxation. if this is is implemented, such concerns can be reduced, at least for those who live in France. It's also nice that solution will include tools and processes for other countries, although it is not very clear on how and to what extent (laws will likely vary a lot). However, if the lessons learned on this are properly collected and documented, I'm sure this work will be much more easily replicable in other nations. As for porposal strucuture, it has a very detailed and sensible problem statement, explaning very well the pain points and a straighfoward solution. Regarding challenge alignment, this proposal addresses it as it may \"Provide funded proposals with solutions and services to operate legally in their residing country will open new possibilities and provide peace of mind to the project owners.\".Risk management is also well done, with 3 good risks identified and properly mitigated.", "q0r": 5, "q1": "There's a very good timeline proposed, with frequent meeting between proposer and account to develop a complete report. It's good to see that French authorirtiws will be consulted in order to assess if the pathways taken are correrct and follows the law. In addition, also very nice that support to other community members will be provided in the end of the project, as many people are probably struggling with the same problem. This is a direct way to give value back to community.\nBudget breakdown is well done, matching project scope and timeline. It's nice that it is brokendown by activity, role and amount of hours required, which helps to increase transparency.\nAs for the team, there are 2 people already committed, both with Cardano experience in past funds, that may help to track different pathways of earnings in crypto, and with management capabilities. However, it is not clear if the accountant (and the possible lawyer) are already committed or part of the team as nothing about them is mentioned. It would be good to understand this and, if they are indeed committed already, to see their cretendial to check their experience with this type of problem, including crypto. This is the only reason I'm not rating it 5.\n", "q1r": 4, "q2": "There are good metrics to track project progress, most with targets and it's imporant to highlight the one where it is intended to \"Support 10 other people/companies with their reporting process\". This is because it helps to validate the value back to the comunnity and that proposer didnt use catalyst money only to pay for accoutning services of his own. A final report and a Summary of key sessions with the accountant will also be made available. As suggestion, to make it more consistent, it would be good to see more details on the report strcuture and an example of pathway that is going to be explored. In addition, more information onthe strucutre of how the support to other people will occur could also be stated from start.\nFinally, the \"Summary of key sessions with the accountant\" could be made available right after each session so community can contribuite with it, brining their point of view and possible pathways/approaches not initially considered by accountant and proposers, to be discussed in the future sessions.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4618, "q0": "The impetus for this proposal stems from a difficulty that the proponent found when working with Cardano/Catalyst. When engaging in many projects, full-time Catalyst/Cardano participants have significant hurdles in declaring income and handling the reporting procedure. This is clearly a challenge for the Cardano and Catalyst ecosystems, which are aligned with the Challenge.\nThe proposal addresses two issues raised by the challenge: offering solutions and services to enable sponsored ideas to function lawfully in the jurisdictions in which they are located, and emphasizing the necessity for accounting and legal engagement. The proponent has no plans to grow further in the future.\nCatalyst and Cardano are continually looking for methods to address financial and legal concerns in order to offer peace of mind and increase the effect of the project while participating in the ecosystem. The proposal addressed this issue by contacting working groups in various countries as well as platform groups IOG and Cardano to coordinate methods for billing catalyst/cardano members on a full-time basis.\nAccounting and legal processes are created for individuals and businesses in France by proponents. This approach may be used to different nations by modifying the fundamental concept. The proposal addresses the stated issue by building effective methods to investigate and provide legal, financial, and support services to sponsored Proponents. Provide them with solutions and services to propose lawful activity in their own nation. The proponent collaborates with accounting and legal authorities in France to determine how to disclose revenues and costs for individuals and businesses. They also collaborate with IOG and other teams to coordinate and determine the optimal manner of invoicing. These are the proper arguments advanced by the proponent.\nWith actual experience, the proponent recognized the risks of implementing this proposal, which is the French crypto regulation. The proposed group's second risk is that the project's uncertain source of cash is funded, and the proposal's last risk is that the French legal system is complex and may not cover all situations. The proposed team has offered answers to the foregoing risks, including working with accountants on a roadmap and terminology that satisfies probable procedures in practice. The solution to the second risk is to collaborate with CF and IO, as well as other recommendations for other nations dealing with the same issue. The proposed group defines the status for various scenarios so that it may be checked in any case where the solution to the third risk is not indicated. Finance and legality are complex issues that concern all parties participating in the Cardano ecosystem, including the proposed projects.\nAs a result, the proposal's evidence, value, solution, and risk are all fully acceptable. This section has a score of 5. \n", "q0r": 5, "q1": "The proposed implementation timeframe of four quarters, including Q3-4/2022 and Q1-2/2/2023, is realistic. This time is based on the termination date of each fund, allowing for simple accounting monitoring. In particular, the third quarter of 2022 plans to continue recording ledgers and developing income recording procedures based on various revenue and expense scenarios. The proposed team's specific objectives are to hold two 2-hour meetings per week with accountants in the fourth quarter of 2022 to map and coordinate the best ledger recording methods based on different situations encountered by the proposing team, such as keeping in the ADA, sending to personal accounts, sending to company accounts, expenses or invoices of partner companies....\nThe time between meetings - accountants verify the appropriate method with authorities and colleagues and prepare papers and information based on the accountant's requirements. There will be two legal consultations throughout this timeframe. The proposed team's particular aim for the first quarter of 2023 is to meet monthly with the accountant to complete the recording of all relevant information for 2022. The proposal team will create with several accounting procedures based on the recorded facts. The final report then shows the research results as well as the tools used to collect the data. The proposed group's special purpose for the first quarter - Q2 2023 is to serve other members of the community who require guidance from France or other countries; office hours will be 8am UTC every Tuesday and will be altered for members in other time zones based on specific needs. Propose identifying and collaborating with other groups/proposals working on similar problems in other countries in order to build best practices for developing reporting processes and tools. These are particular objectives that can be met provided the schedule is maintained.\nThere is no way to track the project's progress. The budget for the proposal is $11,200, which is less than 5% of the Challenge. This concept has a fiscal limitation in terms of governance and legal fees. The proposed initiative is intended to increase governance and legality by $1000. Based on the proposal's stated purpose of having 2 hours of legal and legal counsel, $1000 for extra administrative and legal expenses seems excessive. According to their website, the website https://e-justice.europa.eu/37/EN/costs?FRANCE&member=1 the lowest legal advice and assistance charge in France is EUR 911. So, if the proposed budget of $1000 for governance and legality is insufficient, the proposing team may calculate and increase the cost of this component. The proposed group consists of four people who have been allocated certain responsibilities based on their experience. Members of the recommendation team have complete information that can be verified on LinkedIn, the company website, and Ideascale. P articularly, Yoram Ben Zvi is an Ideascale community member who has submitted dozen proposals that would make this concept believable and realistic. Aside from the minor constraint on estimating the cost of legal assistance, this idea is absolutely deserving of funding. This section gets 4 points from me. \n", "q1r": 4, "q2": "A description of crucial meetings with accountants is given as a measure of project progress. Recommendations are provided for each essential piece of information/idea represented, and they are simple to comprehend. The proposal also provides a measure for success by making a reporting process design and tools (such as excel and Miro) available to the community - all files will be stored in a Google folder. The final report-making index describes different frameworks as well as potential roadmaps. However, monitoring the project's development is difficult. The proposal, in my opinion, should consider adding a success indicator to provide a manner of collecting data on the income and cost of different accounting styles to apply to developers in different countries.\nWhen the available reporting process design/tool is created, the proposal is considered successful. Create 3-5 reporting paths for different use situations. Make 3-5 forms/tools to aid in the reporting process. Assist 10 additional persons or businesses with their reporting procedure. The community can use an open Google Drive connection to track progress. Collaboration and information sharing with CF, IOG, and community initiatives. These accomplishments also reflect achievement and are linked to Challenge. This is a new proposal, and there is no test product to limit the proposal's transparency. However, if the proponent is committed to doing the right thing with the arguments stated in the proposal, it is capable of implementation and audit. This part gets a 4 from me.\n", "q2r": 4, "assessor": "z_assessor_2576", "no_vca": 7, "ne": 3, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 6002, "q0": "The idea of the proposal is good and it brings a lot of value to new projects in Catalyst. The idea revolves around building a cash flow analysis solution for projects in Catalyst through working with accounting services and legal to produce a financial report, for tax declaration to ensure legal compliance in France. This will be the first country where the proposed team will try the solution. This will have a very positive impact on new projects in Catalyst later, helping to remove obstacles by finding a way to comply with legal in their country.", "q0r": 5, "q1": "I completely agree on the feasibility of the project. The proposed team has explained in detail how they will proceed with the work. The work will be done in the last 2 quarters of 2022 and the first quarters of 2023 are reasonable, matching the timeframe of Fund9's results. The expenditure budget for each work item in my opinion is reasonable, most of the expenses are for accounting, for prepare dossiers, prepare reports. We have community mentors and start-up experience in Fund 6, Fund 7 and Fund 8. We have Mr.Miroslav Rajh with more than 20 years of experience in financial management and business organization for NGOs and universities, so I think the feasibility of the project is totally high.", "q1r": 5, "q2": "All stages of performance are measured numerically by the proposed team. For example, 10 different companies will use the proposal's reporting processes. I would also like to add one more criterion here to measure, which is the number of countries that will be covered by the solutions this proposal brings (a point that can be considered in terms of success)\nRegarding the transparency of the information of each team member, there is nothing to argue here. The team has provided citations to each person's profile page so that the community can identify who they are and what they do.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 8385, "q0": "The project is quite allign with the proposal when it comes to solutions and services to operate legally to open new possibilities and provide peace of mind to the project owners.\nHowever personally I think the solution part of the project needs to be more clearly described so that the community can understand how the project works. Specific examples of the methods that the author mentioned in the article will make the problem easier to imagine.\nThe three risks of the project are analyzed quite carefully with reasonable solutions.", "q0r": 4, "q1": "I highly evaluate the feasibility of the project when the road map is presented in detail and long term from Q4.2021 to Q2.2023.\nMilestones and specific work results for each item are also mentioned .\nThe budget is broken down in detail with full information and quite consistent with the main plan of the project.\nThe information about the estimated time of completion, the unit price per hour is added to make the reader have information for easy evaluation.\nIn addition, the project fully mentions the members' information including experience and key achievements as well as other attached details. The experience of the members is also closely related to the project such as: accounting, finance and Catalyst.", "q1r": 5, "q2": "I give this section 4 points for the following reasons:\nThe project has quantitative KPIs for the number of companies the project will support, the number of finished tools/forms to support the reporting process, the number of reporting pathways for multiple use cases. However, information about the timeline associated with these KPIs and how the community can track the progress of the project has not been mentioned.\nIn addition, the team's success is described but still general. Example: The solution is reasonable and acceptable for the authorized in France reducing the risk of business for working on Catalyst & Cardano and therefore more accessible. This needs to be supplemented with factors, criteria, a more specific result that can be accompanied by timelines so that readers can evaluate whether the project has been successful or not.", "q2r": 4, "assessor": "z_assessor_2979", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9000, "q0": "This proposal seeks to fund the process for a small team living in France to get the tax help they need for earning income in ADA. They will document the process they need to take and provide this as a tool for the ecosystem to use. This has the potential to have a large impact, but also due to the specific nature of their situation could turn much less useful for others. The impact potential is there, but the specifics of a single use-case may not be sufficient to provide a broad impact toward the goal of providing financial and legal support for many other projects.", "q0r": 3, "q1": "This is very feasible. They have provided a sufficient and detailed budget for seeking legal and tax advice. They have laid out a workable timeline that includes how they will manage their time between different proposals. They have a solid team with the capability to carry this out without issue. Overall there is doubt, based upon the details provided that this proposal will be straightforward.", "q1r": 5, "q2": "This team has provided a clear project outline, and a good set of measures that will allow Catalyst to audit this project. There is a list of deliverables, and KPIs to help assess this and they have a solid grasp on what success looks like. There are no issues determining auditability, and with the team leads record of participation in Catalyst, there should be sufficient accessibility, and transparency. ", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 9296, "q0": "\"An accountant and attorney is required to join the Cardano & Catalyst Ecosystem. I find this suggestion very relevant to the topic you have raised. Because the accounting report is very important because it clearly shows the financial position as well as the above solution will be protected when there are risks. solutions and services to work legally in their country of residence opens up new possibilities and gives project owners peace of mind. Many projects will broaden their horizons and increase their impact on the Ecosystem as regulatory and financial frameworks are explored and established.\nI see you understand the importance because to be successful, any platform, ecosystem, business needs to keep track of its finances. For example, taking the time to accurately report tax information saves a company both time and money, allowing it to focus on its key financial goals.\nI find this suggestion very relevant to the topic you have raised. I very much agree with you that you have broken down and analyzed to come up with a plan to minimize each risk. You have clearly divided three risks and put in place solutions to minimize them. This makes it easier for people to visualize the real problems they are having and need to solve.\n\"", "q0r": 5, "q1": "\"After reading many different projects and reviewing the team's proposal, I found the team's plan to be really clear and meticulous. The group's proposal clearly states the milestones and things to do in each period, in each quarter of the year.\nThe required budget is also very specific and transparent about exactly what needs to be spent. The budget provides public details of labor costs.\nThe capacity of the members of the project are all talented and experienced people. For example I am also impressed with Yoram Ben Zvi. Attached is also evidence proving the capacity of the members, information about the members. This creates a high level of trust.\n All in all, this project has a lot of potential in the Cardano ecosystem. And I see the ecosystem need to develop projects like this.\"", "q1r": 5, "q2": "For my personal opinion, I find your proposal quite convincing because the progress of measuring and developing the project is also complete. Should give KPI indicators to have proof of the success of the project. And this will make it easier for everyone to track development progress. Although this is your new project, I think it's already very good.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11760, "q0": "“Accounting Reporting France” is a perfect idea for the “Legal & Financial Implementations” challenge. The solution proposed by the team is to provide accounting services (including the completion of quarterly/annual accounting reports) and legal support for Catalys project owners funded in France. This solution has helped solve a very difficult problem that individuals and businesses related to cryptocurrency are facing today. It is a legal difficulty in the procedure of income tax declaration and financial reporting required by the regulatory authorities of each country. Even in Vietnam and many countries around the world, electronic money has not been recognized by law and is not considered a legal field, so tax and financial procedures do not have specific legal guidelines. However, in terms of civic responsibility, participants in the cryptocurrency sector are still required to follow these procedures. In addition, due to the large price fluctuations of the cryptocurrency market, it is also extremely difficult to record losses/profits, exchange rate differences, conversion costs between blockchain platforms, etc. complex period. With the recommendations made by the authors, the scope of application of the solution in a specific geographical area is France. Personally, I believe that it will have a huge impact and significance for the blockchain community in this country. The solution information provided is complete, concise and clear. The purpose of the solution is to help individuals/businesses find the most suitable way and path to carry out tax, revenue and expense declaration procedures, in accordance with their requirements legal and compliance with French regulations. The content of the solution will therefore focus on finding many different ways to answer questions and problems encountered in the actual process of doing these procedures. The team is also expected to work with accounting-lawyer groups in other countries to coordinate and find best practices for addressing a range of questions and challenges. For example, making and issuing invoices from cryptocurrency investment activities, calculating the company's profit/loss according to cryptocurrency price fluctuations, etc. Regarding the risks that may be encountered, I personally want to add some extra points. Firstly, the risk of devaluation of the ADA coin may affect the project implementation budget. Secondly, it is difficult for the group to support many individuals/enterprises at the same time because each specific case has related arising procedures that need to be handled and evaluated separately. Third, there is a risk that it is difficult to apply the same model to other countries (as the group wants) because each country has different legal characteristics that need to be complied with. Overall, I highly appreciate the impact and benefits the solution brings to the community. My rating is 5.", "q0r": 5, "q1": "Regarding progress and budget, the team provided a brief, clear and detailed description. The time the team is expected to start the project is right in the fourth quarter of 2022. This is the perfect fit for the tax cycle in France. The work implementation plan is also listed in detail by the group, each quarter. The project completion time is Q2/2013 (ie the project lasts 3 quarters, equivalent to 9 months). I rate this route as appropriate for the content and goals of the solution. The most important part of the team's performance plan is that they will have ongoing meetings among their accounting colleagues to verify best approaches to the administration request. Then design various accounting paths to the destination statement. The budget given by the group is detailed and clear. All items have unit price * quantity included. I only suggest that the group deduct 10-15% of the total budget into the reserve fund. Since the project implementation period is 9 months long, the budget is likely to be exposed to the risk of price fluctuations in the cryptocurrency market. Regarding the team, the main proponent has excellently received funding at Funds 6, 7, 8 and works full-time with Catalyst. Information about the rest of the team has a complete and clear reference link. With the project owner's experience, skills in accounting and experience working with Catalyst, I believe this solution can be successfully implemented. My rating is 5 points.", "q1r": 5, "q2": "Regarding the auditability of the project, I strongly believe that the community has enough basis and KPIs to measure the results that the project will achieve. This proposal is a great illustration of what we expect in terms of success metrics and metrics to track for a project. The information and data given by the group are concise, detailed and complete. I have no criticism. With the experience of receiving continuous funding in the previous 3 Funds, the project owner has made the content related to the audit category easier to understand and clearer than ever. Here, there are 3 important indicators that the community needs to especially monitor and evaluate. Specifically, the team will assist 10 other people/companies with their reporting process. There will be 3-5  reporting pathways developed for different use cases, and 3-5 tools/forms to support the reporting process. My rating for this item is 5 points. ", "q2r": 5, "assessor": "z_assessor_3279", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11794, "q0": "I find the Accounting Reporting France proposal a perfect fit for the Legal & Financial Implementations challenge. I consider this proposal highly practical because it simultaneously solves 2 problems, the first is to solve the problem of the challenge that is to be able to build effective solutions to discover and provides legal, financial and support services to proponents whose projects are funded thereby opening up new possibilities and providing peace of mind to project owners, 2nd this proposal is written it was created to solve the main problems the author is facing, which are legal & accounting problems for full-time Cardano/Catalyst people.\nThe originality, salience of the matter makes me highly recommend this proposal as the author offers a cash flow analysis solution in the catalyst and works with accounting and legal services to determine the route Accounting report. Coordinating and supporting others to replicate and apply the proposal to the market helps full-time Cardano/Catalyst people to be free from legal & accounting problems, they can rest assured to do their professional work.\nI completely agree with the argument that the author's solution for this proposal is appropriate and necessary with the current ecological situation in France when this country recently became a European country's first major Europe to give crypto giant Binance approval to operate under regulation. In other words, the move makes France the first major European country to green light Binance. This shows that the crypto market in France is an open market, I believe it will grow rapidly in the near future and this proposal is very much needed by the Cardano community to promote development.\nCurrently, Vietnam is a country that has not yet accepted cryptocurrencies, however, I personally believe that along with the development of this market worldwide, the future of Vietnam will certainly not be out of the common flow there. So in the future I see this proposal can also be implemented in my country.\nI will give the impact of this proposal 5 points, an absolute score due to the urgent impact it has on the community.\n", "q0r": 5, "q1": "I find the project has been on a specific progress by the author team, the timeline is built on a quarterly basis, which is completely reasonable. Since this is a proposal related to finance and accounting, it is more specific than other proposals, if other proposals need to be developed and implemented on a weekly or monthly basis, this proposal must be developed on a quarterly basis to comply with current auditing regulations in France and around the world. The content of the tasks that need to be implemented for each quarter is also developed by the author in a very clear, full and easy to understand manner to help the community easily track the progress of the project.\nThe budget of the proposal has been broken down for each item, this division is completely reasonable and appropriate for each item. At $11200, which is 2.2% of the challenge's total budget, it's a number I find perfect for making this recommendation.\nThe author proposes to have foreseen 3 main risks that can prevent the success of the project. I find these risks to be quite adequate and the author's solution to handle the risks is necessary and reasonable.\nI fully believe that the author group is capable of implementing this proposal well. The main person in charge of the project is Yoram Ben Zvi, a person who works full time with Catalyst, has held many positions at previous funds so I trust he has a lot of experience in this field. In addition, the partners participating in the project are all qualified, educated and experienced people. I consulted their information on community sites such as linkedin, the sites linked in this proposal to verify their identity and work.\n4 points is my rating for the feasibility of this proposal.\n", "q1r": 4, "q2": "For this project, I believe that the project can be fully audited by the community, and the monitoring of implementation progress and success can be continuous and close thanks to the planning and budgeting part of the project. The project has been detailed by the author team, very close to reality. Clearly the planning and budgeting was done very well by the team members. However, because this is a project that has been going on for a long time, in my opinion, the authors need to add a report on the progress of the project, the progress of using the budget on the personal information pages or projects for the community to understand publicly and transparently.\nI see the KPI section of the project that clearly shows the numbers to measure its success as developing 3-5 reporting pathways for multiple use case, 3-5 tools/forms to support the reporting process and support 10 other people/companies with their reporting process. These numbers are detailed and clear, logically achievable by the project.\nThe success of the project is also demonstrated by being able to develop a useful framework that helps individuals as well as companies registered in France, to put the project into practice in the community in order to reduce the risk of business risk for everyone working on Catalyst and Cardano, in the end the project is considered a success as other community members use the document to report their taxes thereby helping to promote and grow Cardano is like Crypto.\n This is a new project that has not been funded at previous funds, however, because it is necessary and important for the development of the Cardano ecosystem in the future, I hope it will be funded at fund 9 this. I will give this review 4 points, which for me is a very high, almost perfect score for this proposal. I have seen demos of the author team working on projects that have been funded at previous funds. I hope for the results of the community and expert evaluation for this project.\n", "q2r": 4, "assessor": "z_assessor_3281", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14000, "q0": "Since to expose a financial statement, the accounting and legal requirements are essential to be met and followed up without errors exactly. The proposer has taken advantage of this circumstance and come up with the proposal that analyzes the cash flows for those projects in Catalyst and via cooperating with accounting and legal service providers to ensure the accuracy of that financial statement. This proposal would benefit most companies in France since the group proposer decided to conduct the first trial version in France and would apply this country’s financial regulations in law and consider whether they can ensure the provided financial statement can engage the declaration taxes but still comply with those regulations or not. This group proposer has performed such a tremendous idea via this proposal and this would raise the positive impact on most novel projects in Catalyst at later on. Moreover, it assists to figure out the most reasonable solutions to make sure that all the legal regulations on finance and accounting are complied.", "q0r": 5, "q1": "It would be perfect if the proposer can add more the backup cost due to the ADA price volatility and it is unpredictable. Then, a backup cost in the budgeted plan is really essential whenever this volatility occurs with a large fluctuation. Anyway, all the explanations are in very detail like how they conduct, the duration here is included which time for which item is completed. Moreover, the budgeted plan here is quite reasonable as I think the team has listed every expenditure that appears here really specifically. On the other hand, the human resource in this proposal is really well-qualified. They are skillful advisors for the community and all own a respectful experience in start-up projects from fund 6 till fund 8. Also, they are described as having experience in finance and accounting as well, like André Diamond whose experience is in small business operation and accounting, or Miroslav Rajh whose experience is over 20 years in those majors. I wonder whether they are jogging inside my mind and knowing what I am thinking now? How can they come up with a pretty perfect plan description like that? Those rhetorical questions are showing how amazed I am. For all provided information from the answer, I do appreciate this proposal and the success of it.", "q1r": 5, "q2": "In auditability, I would use only one word here: perfect! This group proposer is completely different from those I used to evaluate before. They provided all the tools, number that would help to indicate whether that stage is successful or not. They have made all criterions on their proposal become visualizations and easy for us to follow up the progress. By the way, I do strongly believe in the capacity of each member in this group as their profiles are really impressive and amazing. People in the community can identify easily which one is responsible for which items in the proposal.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14100, "q0": "Yes , this proposal is actively addrissing the challenges ,as we know that in some countries still cryptocurrency are not legal ,but in some countries they have accpted the currency and legalise in their accounting system .france is one of the said country where crpto currency are legal and acceptable .Binance has been grancted approval  from regulators to  operate the crypto currency exchange in France .the company is now listed as asset servicce provider by france stock market watchdog AMF,offering trading and custody service for bitcoin and other currencies .hence one individual or company can easily done  their  trading and earning income on regular basis .when it comes to earning then it must be accounted as per running law of government .if persson or company is getting funding or trading and doing activity in any currency its must be accounted with propoer rules and details of earning and  liable  for  tax or not .one must have knowledge about the running rules and regulation regarding income and their sources of declaration .now people of different proffession are  not aware about accounting and and their liability for tax paying hence this soution regarding  accounting  & declaring income and managing the reporting process with multi-project engagement is totallly useful and easy for understaniding and managing their income source and accounting for managing their tax liabiality . ", "q0r": 5, "q1": "Yes , Team has perfactlly given plan with step by step implemantation process for execution .The presentation of plan address its challenge and diffeculties also plan explaining current situation which are dealing in cardano community and providing with solution to overcome the challange and effectvelly managing ones accounting as wellas commplying with running rules and regulation of current goverment as income must be accounted properly and liable to taxable properly .team plan shows the proper sitting with its accounting team and also with legal team which have good knoweledge of current accounting  of crypto  currencies and its soucrces of  income .legal and account team can easly draft the project which can helpful to implement and understand the others  for propre way of accounting .said team memeber also got funded in previous round ,and they also facing this problem them self hence its also add points in mappling the project.they also have The Treasury Guild team 1)Miro\n\nhas 20 years of experience in managing finances and organising the business of NGOs and the University. He also worked as a Human Resources Manager (HRM). Joined the Catalyst Circle Admin team together with Andre as treasurer in Nov 2021. Currently he is recording, documenting and managing all transactions for CC Admin Team, Swarm, Cardano4Climate, Community Governance and Bridge Builders. \n2)Andre \nhas experience in small business operation and accounting. Joined the Catalyst Circle Admin team as treasurer in Nov 2021 and has expanded this role by starting the Treasury Guild alongside Miroslav to support projects in the Catalyst community as well. Currently using and documenting GitHub Actions to help automate some of the tasks in Catalyst Circle and treasury work. \nalso having team which are also covering students aspacts as well .", "q1r": 5, "q2": "Yes ,as proposal itself about the accounting the income and covering various aspects of income ,its sourcing and reporting and managing current regulations .hence provided informaation and step by step by execution suggest gret implementation of project to success .also detailed providedd informations are sufficient to audit the progress .plan having tools like ''Design the reporting process and tools (i.e. excel, miro) which will be available for the community - all files will be saved in a google folder '' are easy and can be auditable at given time .it can also be compaired with current regulations and one can of same field can eassily explain the effecet and depth of said project during course of audit .", "q2r": 5, "assessor": "z_assessor_3902", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Analyzing the flow of funds in catalyst and working with accounting and legal services to define an accounting reporting path. Coordinating and supporting others in the process.  ", "experience": "Full-time on catalyst since July 2021, CA, VCA, C4C, CT. Funded proposal in funds 6,7,8. Facing issues to report 2021 income which will significantly increase in 2022.\nAlso has good knowledge of accounting and legal procedures."}