{"id": 415644, "author": "cargofe2", "title": "Legal Compliance Support (EN/ES)", "url": "https://cardano.ideascale.com/a/dtd/415644-48088", "category": 26596, "amount": 24000, "description": "Proponents need a compliance strategy to have procedures and best practices in place to identify and classify the operational and legal risks they face and establish internal mechanisms to prevent.", "f6_no_assessments": 9, "f6_rating": 3.962962962962963, "videos": [], "media": [], "f6_assessments": [{"id": 6662, "q0": "Remembering that the purpose of this challenge is to create the groundwork for legal and / or financial solutions provided to the proposers, there is definitely a very interesting value proposition behind this project. Its goal is to offer a broad based and general tool for proposers to help them devise a compliance strategy and to implement the procedures that can enable the identification, prevention, monitoring and mitigation of compliance risks. \n\nThere is definitely a need (perhaps an unsung one) for proposers to beef up their compliance function, internally, and there are many reasons for this. On the other hand, the Catalyst environment is slowly building up its skeleton of “overseer” for proposers (think about all the ongoing audit initiatives) and so even from this angle the pressure to respect the “Catalyst rules of the game” will be formidable. Second, the regulatory landscape is constantly changing, and new / additional requirements for any virtual asset service providers will be very common in the years to come. Lastly, all proposers (just as any other organization) will face different compliance pressures from their geographical location(s): general reporting, tax implications, business risks, etcetera. So compliance for a Catalyst proposer is at least a three-pronged problem, and It is extremely positive for the environment that such projects are taking shape.\n\nConsidering the existing need for this type of support and the way in which the proposal would deliver it, we have an excellent case for a high impact project if implemented. ", "q0r": 5, "q1": "This proposal has good, but not excellent feasibility prospects. Regarding the roadmap, the proposer mentions that the objectives will be accomplished within a six months period, starting October 2022 - a very good approach taking into account the necessary time for Catalyst to run its processes, disburse funds, obtain proof of life and all the other formalities. \n\nThe project is split into three bimesters (two months period). The first one would see the working plan completed and would include a study period - which is very necessary given the nature of the project where a lot of information has to be compiled from multiple sources in order to come up with something meaningful. The second period would focus on actually building the tool and include some dissemination efforts, while the third would improve the product’s distribution and expand its use base. It helps a great deal that the tool is designed to be trilingual from the beginning. \n\nThe budgetary aspects of the project are accurately presented, and the bulk of the budget would be used to finance the efforts of the specialized lawyer in charge of building the tool and presenting the idea. His efforts will be complemented by a professional web designer and translators. \n\nThere are a few things that worry me in terms of this project’s feasibility. Let’s take them one by one. Firstly, a comprehensive compliance tool is a formidable challenge to undertake and requires significant human resources, with the right skills and time availability to carry it on. In this case we’re only dealing with one expert to do the entire job. No matter how skilled one person is (and I by no means questioning the proposer’s capabilities), every person has his own blind spots and areas of weaker expertise, so I believe that having proposed this while having secured the support of several compliance specialists would have helped tremendously to improve the feasibility. \n\nSecond, a too “academical” compliance tool can run into the risk of not being properly understood by the users (proposers in our case) and simply not used due to its high level approach, with little added value for day to day activities. I estimate moderate risks of this phenomenon happening within this project - and I believe that setting up an additional feedback channel from the community while building the tool and drafting the content would be a great addition to mitigate this.   \n\nThird, a great addition to this project would have been an “updating” capability. Compliance is constantly evolving, and given the rapid change taking place especially in the crypto regulatory space, it is unclear how valuable the tool will be after 6, 12 or 18 months following its launch, without constant (and intensive) updates. But of course such an update module would require intensive resources that far exceed those allocated in the current iteration, and it is fairly understandable why this was not tackled at this stage. ", "q1r": 4, "q2": "We have good, but not excellent auditability tools in front of us. The proposer begins this section by explaining that in order to increase the auditability, they intend to set up a web page from the second month of the project, accessible around the clock, and allowing interested parties in reviewing the advancements. A monthly report will also be made available. Measuring the success of the project will take place primarily through the performance indicator of how many proposers will be utilizing the instrument. We are however not being told how this measuring will take place and it is therefore not very clear the actual process behind this statement. \n\nA missed opportunity is not introducing from the beginning an ex-post (after use) feedback mechanism from the proposers. Measuring the tool usage is one thing and definitely important, but qualitative information as to how useful the proposers have found the tool would have greatly added the chances of being able to measure the project’s impact on the proposers’ activities. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 7153, "q0": "The idea is good and aligns with the objectives of the challenge, which is to provide procedures and practices to identify and classify the operational and legal risks faced and establish internal mechanisms to prevent, manage, control, and react to them. Here we aim to fund proposals with solutions and services to operate legally in their residing country will open new possibilities and provide peace of mind to the project owners. And the idea is to create an easily accessible and readable manual document that includes simple examples. However, the problem with this proposal is the lack of detail about the progress. There are many things to be done, but they are given to us in a considerably superficial way. We know of some things that would be offered, such as the objectives, and the contextualized problem, but we do not know essential details such as who will do that, that is, which professionals who were mentioned in the part of the team will perform what tasks, we do not know how these sessions would take place. We also how long each would be followed, and how we could measure the progress of the project. In summary, I don’t think it’s very clear what the content of this awareness would be, how it would happen, or how we would accompany the benefited lawyers. Besides that, we also were unable to fully understand how the compliance information would be used in practice, which undermines the confidence in the impact of the proposal. And due to this lack of explanations, we do not know the objectives of the challenge will be achieved. For the impact of this proposal to become clearer, I would like all these doubts to be clarified. In this way, we could measure much better whether the specific objectives of the challenge would be achieved. So, overall, I think the core of the proposal is good, but it lacked development for us to fully understand what will be done and the impacts of this on Cardano.", "q0r": 3, "q1": "The feasibility of the project, unfortunately, is low. The script is very superficial, we know only superficial what would be done according to the “Bimester”. I don’t know what the Bimester means, but I guess it is a phase of the project. For example, the first Bimester, is about the “final work plan. According to the thematic objectives stated above. Study and compilation of the information to be provided on compliance”. From what I understand, these things are quite different and require a lot of work and effort individually, and I think it would be necessary for the bidder to explain each of them in detail. Secondly, in the second Bimester, the proponent claims that “Structuring of the information and determination of the dissemination tool, there will be a specially dedicated web page. Translation of information to make it available in English and Spanish. Strengthening of an e-mail communication channel that will be available at the end of the last two-month period and for two more months”. In phase two, it would be important that what is the dissemination tool, what is the specially dedicated web page, why we need to use the e-mail communication channel”? etc. In my view, that roadmap just says that the work is started and that it comes to delivering progress. However, this does not point us at all about what has already been done, and how long it would still take for everything to be done. Ideally, the proponent should divide the phase time into small parts, eg month; and that each month he would inform which activities would have to be done, and detail each one very well, in the sense of knowing: what would be done, by whom, how long it would last, and how it would be done. Therefore, unfortunately, this part of the proposal is insufficient. Now, talking about the budget, 24 thousand dollars is asked. In my view, this money is also not satisfactorily explained it is divided into two parts: the salary of the professionals involved (a specialized lawyer, a web designer, a translator), and other things like “website cost, additional costs for the maintenance of the site and revision in working hours”. We don’t know the price of the working hours of the professionals so there is no way to define whether the amount that was chosen as a salary is fair. Regarding other things, we don’t know how much would be spent on servers, moderates, maintenance of the site, revision, etc. I think it would be necessary for the proponent to inform what values are needed for each small part and to argue why this investment would be necessary. It is not possible to have a good understanding of what will happen based on the information given. Finally, about the team, we don’t have much information about each of them, all we know are the names and contacts of two team members. It would be necessary for us to know their full names, what roles each of them would play in this project, their areas of training, examples of previous work, and how each one relates to the Cardano ecosystem. So unfortunately all parts of the feasibility are very superficial. There is no confidence in the process, how the money would be used, or the presentation of the team. My suggestion is that this topic is completely reworked.", "q1r": 2, "q2": "Regarding how we could follow the development of the project, I think this part was too superficial. We are told that “monthly reports will be presented with precise data on the evolution through percentages. The same compliance rules will be applied to the project that we are proposing to incorporate into the Cardano community. Later in the dissemination stage, the following metrics will be tracked: Use case - How many funded proposals are using the instrument”. However, this would correspond to the delivery of partial results, and would not exactly be a monitoring of the work process itself. In my view, auditability should be divided into two parts: monitoring the process (partial results) and monitoring the goals (final results). About process monitoring, this is not easy to do as we don’t have a detailed roadmap. We only know what will happen, in a basic way, it would be necessary to establish some phases, with well-defined deadlines. With that, we would have more material to monitor, if what we want happening in the right way and at the right time. Regarding the final result, I think this part was good. Fundamentally, we understand exactly how this project helped the Cardano community by creating an appropriate and well-structured compliance tool, easily accessible and in three languages. But how can we measure this impact? How will we be able to monitor whether this scenario has actually come true? I think the proponent lacked a more practical and scalable monitoring strategy. So, overall, I think auditability is ok, but it still needs to be further explored and the bridge between the Cardano community and the team needs to be better built.", "q2r": 3, "assessor": "z_assessor_2879", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 904, "q0": "Making a project compliant can be a daunting task, even more in the blockchain industry. The definition of what “compliance” is varies from person to person, and in an industry pushing the legal boundaries and acting in a multijurisdictional environment, non-compliance with regulation can be detrimental to a project’s success. This proposal tackles this challenge by attempting to break down compliance into easy to identify elements and different manuals. The proposal also attempts to provide methods in situations of non-compliance, which is just as important as preventing this from happening. For example, as mentioned in the proposal, the selection of strategies for managing incident response provides a legal solution to projects who are in need of it, which consequently fulfills an objective outlined in this challenge.\n\nRegarding scalability, working in different jurisdictions is mentioned in this proposal, therefore the voter can assume this solution would have world-wide reach. The tool which would be provided by the proposers would be in English as well as Spanish, an element that would help gain more adoption. Concluding on this matter, specific information on possible scaling strategies would help the voter gain a better understanding on the efficiency of future scaling objectives.\n\nRegarding the value added to the Cardano ecosystem, the proposal lacks specific information on how it would go about this, but by reading it, one can assume it would help the projects launching and developing on Cardano. Nonetheless, a clear mention on how this proposal would have a positive impact on Cardano would be very informative.\n\nAt last, sustainable development goals are mentioned as well as one metric to measure their progress.", "q0r": 4, "q1": "The proposer, who will also be in charge of compiling the information and structuring for dissemination, has the knowledge and experience to carry out this task. His work in the field and his academic history are proof of it. The voter also has available the links to verify it. When it comes to the web designer, his LinkedIn is available for voters to see as well as projects he’s been working on. A detail that could be improved, is the identification of the translator who will verify the texts, but overall skills and experience needed to implement the proposal are met.\n\nA positive aspect regarding the team, is the fact that each of the individuals who compose it have a specific task assigned and the voter can see which person and how many people would be working on the different aspects of the proposal.\n\nWhen it comes to the budget, it is broken down into 3 items, which provide information on the exact amount that will be spent and the purpose behind that spending. The amount of money being asked is equivalent to the average salary of a lawyer in Europe (this profession is chosen as a refrence since most of the budget will be allocated to pay for the lawyer, who happens to reside in Europe).\n\nThe voter also has information describing the different phases leading up to launch and implementation, as well as a description of what will be developed on each of these phases. The amount of time defined for each phase also seems reasonable and proportioned to the task at hand.\n\nFinally, the possible risk that could arise would be the lack of confidence of the end-user in the information provided by the proposers. Because of this, the proposal guarantees the creation of a channel to communicate with users and help them solve some question they may have, and update the information when necessary. This is a good solution and would help mitigate the risk that could present in the future.", "q1r": 5, "q2": "This proposal guarantees full auditability by providing a web page which is already available to the voter, and which will be under permanent construction. This could allow anyone interested to track the progress being made and watch out for possible contingencies. Monthly reports will also be published, which will further expand auditability features. Regarding the metrics used for measuring success, the proposers will focus on the number of projects using the service provided.\n\nOverall, if implemented, the plans and objectives for auditability seem well though-out and balanced. This will give voters the ability to track progress as well as measure the proposal’s success.", "q2r": 4, "assessor": "z_assessor_2151", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2791, "q0": "\"The proposal's statement about the main goals of this idea is: to provide legal procedures, to classify operational risks, and to assist in establishing internal rules to prevent and manage operations.\" according to the internal regulatory framework,\n\n  the solutions outlined are very specific and easy to understand how this proposal will be implemented step by step, but in my opinion the proposal needs more specific identification of the company or developer group, which organization is the target, the group needs to clearly define who the target group is, and how to approach them to bring the support of the proposal to them, while knowing that each country has a different legal framework, and different legal requirements, but with the proposal to publish the supported language of this tool, it is two languages: (English, Spanish). so are these the countries the team is targeting and will make this toolkit available to them, there is no statement yet on defining the geographic area for this toolkit to function, and even so The team needs to give an example: specifically one of the legal criteria this toolkit will provide to clients for their internal use.\n\n   the group claims to have been funded since funding rounds 7 and 8, but needs a link to those projects and also outlines what the success of the proposal has brought to the community, and the group whether those proposals have been completed, that remains a mystery to this day.\n  as this is the idea of ​​developing a legal framework so there are very few legal risks that can occur, and the most worrying risk has been foreseen by the team and taken measures to address it. It is the acceptance and use of this tool. \"", "q0r": 3, "q1": "\"commitment time to complete this proposal is 6 months, but hope the proposing team can explain more about \"\"Translation of information to provide information in English and Spanish\"\" so the scale What will be the expansion of this tool? and this tool will be updated with all regulations of many countries or regions, in addition, the remaining timelines are provided specifically and appropriately. consistent with the goal and committed time to complete.\n  Expenditures need further clarification for all the group information presented in the budget table, for example Specialty Lawyers: 3,500x 6m: 21,000 so the lawyer's activity is a full-time timeframe. or part-time and how much time for a day, it is necessary to specify the salary for each milestone, the remaining expenses too, the group should clarify and break them down for financial transparency, and will more excellent for assessing whether the quality is feasible or not.\n  In the team information, too, it is still necessary to add details such as the identity of the 3 people, and the information related to them, whether the experience of those people is relevant to carry out this project, that Is the information required to evaluate the feasibility of this proposal high? \"", "q1r": 3, "q2": "I disagree with these statements of the proposal; \"This is a multilingual tool (English, Spanish), which is also applicable to any environment and country, regardless of their legal structure. This ensures scalability and great adaptability.\" First of all you have to determine what your regulatory frameworks are related to in a country, and each country's regulatory framework will be different maybe Europe will be different from Asia, you should consider declaring this. this makes me doubt your attorney statement, i have an example for crypto regulatory framework can you apply it to china country,\n and the proposal also commits to provide the steps and roadmap for the implementation and application of this toolkit, on the website of such a proposal that does not fully show the proactive support of the community to monitor, to expand the process. The model needs to be publicly available on popular social networking platforms for the community to know, so it is also a part of Marketing.", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 12, "ne": 2, "ng": 5, "nfo": 5, "vca_o": 1}, {"id": 4686, "q0": "The issue raised identifying proponents needing a compliance strategy is one that needs to be addressed in this challenge, which addresses the challenge's questions to have procedures and implementations in place. As best practices for identifying and categorizing the operational and legal risks they face, the author establishes internal mechanisms to prevent them. This proposal describes the problems of the challenge. This solution can address the challenges faced by solutions by providing procedures and best practices for identifying and categorizing the operational risks faced by the legal profession. The proponent also establishes mechanisms to prevent management and control of the above issues.", "q0r": 5, "q1": "The timeline of this proposal was developed by the author in 6 months of work: the first bimester from October to November 2022, the second bimester from December 2022 to January 2023, and the third bimester from February to March 2023. This timeline is completely reasonable to be able to implement the project successfully. The success of the proposal is clearly described by the author as it provides the community with a consistent and well-structured compliance tool that is easily accessible to participants and in three languages. This solution perfectly fits the challenge it creates an internal strategy that helps us to anticipate risks and prepare for new projects without being dependent on previous training and the general knowledge of our predecessors.", "q1r": 5, "q2": "KPI progress is clearly defined through monthly monitoring of the team's work plan. The index is easily measured through testing on the website http://newcryptoreality.com/ making it easier for followers to track through search and the time someone accidentally clicks on the Web then the page will store the number of participants. The team consists of 3 key people including one who is a lawyer with a Master's Degree in Compliance specializing in presenting ideas, two is a professional designer Mateo Parada, and the third is a translator. will verify the text. The funding budget for this challenge is $24,000 less than 20% of the full challenge budget. The author's budget is broken down into reasonable expenses. I believe that if funded, this project will be successful. This is a completely new project and waiting to be funded.", "q2r": 5, "assessor": "z_assessor_2608", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8847, "q0": "As finding lawyers who have knowledge over cardano are difficult to find in current society and new onboarded projects or startups can't afford these lawyers, Hence to counter such scenario the proposer's team wants to develop a framework so that any person can use it while beginning the project so that he shouldn't have any legal or financial blockage over future , this will also help in structuring the projects still more efficiently and help the new comers to continue the project without any barriers in the future, Hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed task doesn't involve much of a risk where it just needs 2-3 expert lawyers ,who have great knowledge over legal terms of cardano development project, where this task can be achieved by proposer himself where he is a Lawyer with Master Degree specialized in Compliance, owner of the company Public Compliance SAS. he has even worked on fund 7 and fund 8 projects ,with this he'll be having proper idea on what are the barriers will funded catalyst face, other than that when content is ready uploading them over dedicated web can be achieved easily as team consist of A professional designer and translating can also be achieved without much difficulty , Hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit contains clear goal on making the legal aspects for small enterprises of blockchain who should not be stopped by legal and financial laws and making it available over English and Spanish, it has introduced the experience of the proposer in law practice and he's contribution in fund 8 and fund 7, audit has produced list of challenges his objectives can resolve.\nThe audit has displayed displayed detailed budget breaking idea to complete the project , it even has provided detailed timeline to make the project successful one, Hence with great goal ahead to help the people, The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9002, "q0": "This proposal seeks to utilize compliance and legal experience to develop a document/process for ensuring that projects are able to identify and rectify potential compliance issues prior to opening them. This field is lacking on the blockchain. So, a document/process outlining compliance would have a positive impact for every project and proposal on Cardano. And it would go a long way to achieving the goal of this fund by giving each project a tool by which they can evaluate their own legal and financial needs. This would be broadly applicable to every project. Additionally, the tool will be provided in Spanish and English, thereby increasing its impact.", "q0r": 5, "q1": "This project team has a lot of experience in compliance issues and the Cardano ecosystem. The team is ideally suited to create this tool based upon their experience and skillset. The budget breakdown looks fine, but it does lack detail. It could have been more specific and enabled a better overall assessment of the project. The timeline suffers from the same lack of detail. It looks doable and there are no issues with it, but it could have been much more specific. I would have liked to see specific milestones and KPI goals built into the timeline. Again, the team information of the lead is present and available to be evaluated, but the other team member information is rather vague. It would have been preferable to include more details so that the assessment could evaluate the proposal’s chances of success. The lack of detail is the reason for the lower score of 3. ", "q1r": 3, "q2": "This project has a clear goal with an identifiable marker of success. The desire is to prepare a compliance tool that enables Catalyst proposals and Cardano projects to identify legal and financial compliance risks. The goal is worthy. The metrics for success are present, but less detailed than is preferred. The team will provide monthly updates on a website and will give project updates in spanish and english to anyone willing to check it out. They will also work with the Catalyst community to give updates on their work. OVerall, the proposal is promising, and I believe it can be done by the team and be transparently audited, but more detail regarding this would have yielded a higher score. ", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11767, "q0": "The idea of providing a legal compliance tool for projects on Cardano is a good solution, in line with what was sought in this Challenge. The team gave a clear, concise presentation of how such a project would benefit the ecosystem and the community. The authors argue that providing best practices and procedures will help project owners on Cardano “identify and categorize the operational and legal risks faced and establish internal mechanisms departments to prevent, manage, control and respond to them”. The solution proposed by the team is, to build a compliance tool on the website in three languages: English, Spanish, and French. Specifically, this tool is set up including: code of conduct with detailed compliance policies and procedures, lessons learned from errors encountered, financial and non-financial causes, strategies to meet compliance requirements… The proposal's aim is to help project owners on Cardano learn from mistakes, starting with a practical and easy-to-implement strategy. The project implementation process can thus become more smooth. In my opinion, legal barriers, lack of tools, and professional financial and legal consulting services seem to be becoming obstacles preventing the success of many blockchain projects. Personally, I believe that with this recommended compliance toolkit, it will be easier for projects launching on Cardano to access and select strategies to manage risk response, even when faced with challenges. non-compliance incidents. This is extremely important to help remove difficulties and increase the probability of success for projects deployed in our ecosystem. The solution proposed by the authors is comprehensive, synchronous, and appropriate in the current situation. I believe the solution will actively support the development of projects in the Cardano ecosystem. Especially, in the winter of the crypto market, we need to take advantage of this precious time to help projects prepare, be ready to deploy, and explode when the market enters a new uptrend cycle. The point to comment here concerns the risk of the proposal, the team thinks that the risk of users being suspicious of the information provided could prevent the solution from being successfully implemented. However, I think that some other risks also need to be foreseen and solutions to overcome. Specifically, one is the risk in the translation of specialized terms that make it difficult to understand the information, because the translator is not a specialized lawyer. Second, the tools provided may not completely solve the difficulties of the users. Because the information on the web is provided one way, project owners may have problems that arise beyond the content that compliance tools can solve. The solution I suggest is to provide an additional online Q&A consulting and answering service (every 2 weeks), helping to solve problems beyond the documentation. Third, the drop in the cryptocurrency market can affect funding budgets. Therefore, I suggest having a provision for price fluctuations of 10-20% of the total projected budget. Overall, I appreciate the impact of the recommendation, so I gave it a 5-point rating.", "q0r": 5, "q1": "The feasibility of the proposal is also described directly and clearly by the author. The implementation roadmap is given as 6 months (from October 2022 to March 2023), including 3 major phases. Specifically, phase 1: researching, compiling, and translating documents. Phase 2: launch dedicated web. Phase 3: web improvement and product delivery. The implementation process is detailed and logical for each month. A group e-mail communication channel, will be available at the end of phase two. However, I suggest that the team add a web marketing campaign to the roadmap (via Facebook, Youtube, Twitter, and within the Catalyst community itself). This makes the compliance tool more accessible to interested parties. The budget of the proposal is divided into sub-categories. However, I feel some costs need clarification. For example, the cost of working meetings with translators and web designers $1000 each. Will this cost be spent on face-to-face or online meetings? Is this the cost to open the meeting or is it understood as the cost of web design and the cost of translating documents? I did not find the cost of document translation and the cost of web design in the budget allocation. If so, this cost should have a specific unit price: unit price $/hour of document translation, or unit price $/page of the translated document. This will help the community understand how the funds will be used specifically. About the team, the project owner is a Lawyer with a Master's Degree in Compliance and also has funded proposals from Fund 7 and 8. I believe, the team has enough capacity and experience to successfully implement it. this proposal. I rate 4 points in this section because some of the contents need to be supplemented and clarified above.", "q1r": 4, "q2": "Regarding auditability, the team has given a number of criteria to evaluate such as: monthly reports, and metrics to be tracked (use cases, how many funded proposals are using the technology tool). Since the product of this proposal is a website in 3 different languages, I believe the community can fully audit it at any time during the implementation stages. However, it is a pity that the author failed to provide specific KPIs to measure the auditable success of the proposal. For example, the target of web visits (per day/week/month), what is the minimum number to achieve? Similarly, the number of proposals funded using the compliance tool (per month/quarter) that the author expects to achieve? Communities need detailed metrics to understand how success will be measured. Therefore, I rate 4 points in this section, after deducting -1 point for lack of audit KPIs.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12696, "q0": "This proposal does address the challenges of local businesses and receivers of funding by reaching a solution of Compliance. This team understands the legal complications of receiving funding from an outside source which still may not be trustful as we still see many countries unsupportive of cryptocurrencies. The solution provided is to carefully carry clients throughout the framework process in order to get them situated and provide guidance to move forward.\n\nThe risks presented by the team are nowhere near exhaustive. It is true that there is informational/source doubt to trust the entity at first, however, it is as important to still discuss the main risks for the project to be launched successfully. Many of these risks may include lawful jurisdiction and government intervention. It is a known fact that in 3rd world countries, cryptocurrencies are still slowly being adapted and coming with trust and so it is crucial for legal compliance support of this caliber to be able to accommodate and recognize the appropriate risks properly. Even while mentioning that the information given may not be of high trust, the team has put no effort into releasing more information regarding their structured rescue plan.", "q0r": 3, "q1": "Overall, the detailed plan and breakdowns of the budget and team sufficiently explain the project work outlook. However, they could go into a little bit more detail. \n\nLet us take a look at the timeline first. The team has outlined the project into 3 phases which work well in terms of simplicity and iterative development. The study of the information provided on compliance could be explained furthermore by what specific sources to refer to while learning about the structure of the tool they are building. The communication is also not well explained as it is equally important to know the specific communication routes that the team chooses to go with. In terms of a budget of 24000, it seems that the project is highly feasible by cutting costs and reducing the pricing of consulting a legal entity. Finally, looking at the experience of the team, the professional lawyer seems to have several years of experience in attorney firms and is also very well indulged in Cardano's ecosystem. Considering various facts, I think it is fairly likely this proposal can be implemented successfully if there was more exposure to the auditability of the project.", "q1r": 4, "q2": "This proposal seems to be very lacking in terms of auditability. It provides information on how crucial metrics like expanding use cases and workflow status can be shown through a web page. However, this is entirely a centralized report from the team and may not be equally regulated. So how do I trust them not to be biassed and not \"rig\" the details? To come remotely close to tracking progress, I would need to have the comforts of working internally with the team without any privacy. A simple web page is as good as running your own personal press company printing good news. What would instead benefit the auditability of this proposal is definitely a regular update like the team suggests, but with very concrete evidence of the progress. The use case report would definitely be an indicator for this kind, but, before getting to that point where the project scales, it would still be necessary to track the team's progress constantly. Many things such as conferences, and weekly scrums with the community will aid in that element of auditability.", "q2r": 2, "assessor": "z_assessor_3454", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Provide procedures and best practices to identify and classify the operational and legal risks faced and establish internal mechanisms to prevent, manage, control and react to them. ", "experience": "Member since October 2021, CA. Proposals financed in funds 7 and 8. Lawyer with Master Degree specialized in Compliance, owner of the company Public Compliance SAS. \nhttps://www.linkedin.com/in/carlos-eduardo-gonz%C3%A1lez-fern%C3%A1ndez-23b27055"}