{"id": 416513, "author": "michiel", "title": "Cardano Lawyer (EU-region)", "url": "https://cardano.ideascale.com/a/dtd/416513-48088", "category": 26596, "amount": 22700, "description": "Many of the activities and novel products by proposers on Cardano/Catalyst fall under existing regulations. It is not easy for startups to access this knowledge or expertise + costly. ", "f6_no_assessments": 17, "f6_rating": 4.000000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 6669, "q0": "The purpose of this challenge is to create the basis for legal and financial solutions for proposers, and this project fits perfectly within that space. The project’s value proposition is simple and very easy to understand. Michael, the proposer, brings forth an idea to create a service wrapped as a think tank that will also be part of the wider DLT360 project, with the function of answering the day to day legal questions that proposers might have, and basically devote a significant portion of his time for this endeavor. \n\nThere will be a growing need for legal advice within the crypto space, and there are opportunities for any kind of projects, no matter how big or small. While other proposers come up with large, scalable solutions (marketplaces, workshops, etc) which are absolutely fantastic proposals, there is also room for smaller projects, like this one, but much more targeted and ready to assist proposers with minimal set-up fees. I am definitely in favor of this smaller type of proposals at this point in time (“let a thousand flowers bloom” philosophy) before increasing our common efforts towards extensive undertakings that need a solid base of practitioners around all the geographical areas where proposers activate - and right now there aren’t many statistics diving into these matters. \n\nSo this would be a very hands-on approach, a grass-root project that can activate very close to where proposers feel the majority of their pain points, and with a great possibility of offering sound advice quickly and effectively. Excellent impact therefore. ", "q0r": 5, "q1": "Michael, the proposer, has an excellent background and this for me is a very strong indication that the project sits on solid grounds and can be implemented successfully. He is a lawyer and entrepreneur, but most importantly a long time contributor to the Cardano ecosystem and especially active within Catalyst. I will provide two examples that showcase his extensive involvement: within the DLT360 team and within Profila.\n\nProfila is a marketing platform with extensive privacy features that allows its users to interact with companies while controlling their own data. The platform is live and the project has already received  funding from as far back as Fund6. DLT360 is a scalable team of regulatory experts focused on delivering value within the Cardano ecosystem. They have strong academia, industry and EU institutions connections and are well positioned to tackle most projects within the legal / risk management space. They already have a multitude of projects in the pipeline and are a constant presence during town halls. \n\nThe timeline looks very solid as well. Over the three months of the project, the first would be devoted to the set-up and would see the first two office days with “open doors” for any proposer, which will of course continue in the following months. In addition, the second month would bring to light a roadmap with important legal topics to work on - perfect opportunity for the wider community to look into the project and perhaps provide insight. The last month would see the creation of a blog and Swarm sessions devoted to legal questions. \n\nOne uncertainty, which was highlighted by the proposer as well (extra points here) is that without introducing any economic incentives (payment vs service) there is a risk that his service might be overwhelmed with too many questions and a prioritization will have to be put in place (who should get priority, can one pay to jump the queue, who gets to judge, based on what criteria?). While this is of course a valid point of concern, given the multitude of legal / regulatory projects to be funded, I feel that reaching such a bottleneck, although painful in the short term, can be a great booster for one’s activity over the long term and a very good selling point when asking for additional Catalyst funding. \n\nIn conclusion, the project is very strong across the board from a feasibility standpoint. ", "q1r": 5, "q2": "We have fairly good auditability possibilities here, but with some room for improvement. The proposer argues that the office days will be accounted for with timesheets, and also the reports / findings / Q&A will be made available, in addition to the usual Catalyst weekly updates. Of course, participating in the swarm sessions can only increase his level of accountability towards the community.  \n\nSince the proposer is well connected with existing projects funded under Catalyst as far back as Fund 6, with many of the projects being also dependent - he is most definitely already familiar with the standard operating procedures and all the processes set-up by IOG / the community to ensure consistent reporting. I therefore see low risks of the community not being able to properly monitor this proposal. \n\nI do have one suggestion though. Since any legal advice is exclusively qualitative by its nature, and highly dependent on the practitioner offering it, it is very difficult for the community to judge the quality offered. So in this respect any kind of additional mechanism that would create a feedback loop between proposer (Michael) - proposers (customers) - community (stakeholders) would be of great value. Perhaps setting up an anonymous feedback mechanism after each office day or at the end of the project for each of the proposers with which it has interacted during the three months. Anything on this point would be extremely valuable in order to build the case that the service is actually benefiting the community. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1162, "q0": "The proposer offers legal advice for companies operating in the EU area using Cardano and leveraging Catalyst to develop their projects. \nHence, the proposal addresses the challenge.", "q0r": 5, "q1": "The proposer claims to be the writer of 9 already funded proposals. I would have loved to see the links for an easy reference. \nThe proposer is aiming to deliver the proposal by dedicating 2 days monthly for a full year to answer questions on legal matter, mainly for Catalysts participants. \nThe proposer is already working in a firm - DLT360 consulting - who offers help on this matter. \nThis proposal has been voted but not funded in Fund 7 and this demonstrates the reliability of the project. \nMoreover, I find very useful that the proposer will take some time to write a report of the questions already answered to different teams/companies (in an anonymized way). ", "q1r": 5, "q2": "The information presented are very clear, the budget will be entirely dedicated to cover the salary of the proposer for the working days dedicated to Catalyst. \nNevertheless, in some sections of the brief [e.g. IMPACT] the proposer limits himself to a mere copy paste from a previous section. \nI understand the proposal is very simple for its nature, but a bit of differentiation could have helped. ", "q2r": 4, "assessor": "z_assessor_2215", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 14605, "q0": "The proponent identified the difficulty of projects in the Cardano ecosystem that are faced with numerous legal questions around regulatory compliance, tax, AML/KYC, payment services, etc and the solution comes with consulting a lawyer. However, this is often expensive, and their services rarely include cryptocurrency and blockchain expertise. Therefore, the proponent – ​​with long experience in the related field, will provide legal services for the benefit of the Cardano community. The main activities of the proposal are presented clearly and specifically. Results will be made anonymously available to the Cardano community, where blogs on topics of interest to the community are also written monthly. This will be a knowledge resource for the community to actively refer to in the future, improving the community's understanding of the legal issues that exist in the Cardano ecosystem. This legal consulting service is highly adaptable because the proponent has a large network of lawyers around the world. So this service can grow to be widely used in many countries. Besides, the challenges are also clearly identified by the proponent – ​​along with it is a very reasonable solution. Since the proposed team's working time is limited to 1 day/week, they will have to select the most pressing and/or frequently asked questions and deal with them. So I have a question for the proponent, is it possible to increase the execution time in the future? Because the Cardano community is growing in number, 1 day a week probably won't be enough to meet the community's consulting needs.", "q0r": 5, "q1": "The team member himself has experience in cryptocurrency, law, and information about him is also detailed in the related LinkedIn lines. Not only that, but to increase the quality of service, the proponent also provides information about the people who will support him in the project. The proponent has given a fairly detailed roadmap including the tasks and the timeline for performing those tasks. In general, the two main jobs that this project does is to set up a blog to post legal topics and answer the most frequently asked questions of the community and directly provide legal advice for other proposals. So the roadmap will revolve around blog development, research on the most frequently asked questions, and consulting services. In addition, a combined legal smart contract and smart contract product will be announced to the community. However, the information about this product has not been presented in detail, all that is related to this project that I can refer to is through the link that provides an introduction to the team collaborating with the proponent. : https://www.dlt360consults.com/about. At the same time, I have not seen the proponent have a specific marketing plan to promote his service. How do people know about your legal service?\n  Another thing that makes me confused here is that earlier the proponent said he would have one \"\"working day\"\" per week. However, in the roadmap, the time to perform the work is shortened to 2 days/per month. I hope the proponent will explain this problem.", "q1r": 3, "q2": "Again, the proponent listed specific tasks and outlined quantitative indicators to track project progress, all of which will be periodically updated and made public. The community can rely on KPI reports verifying project effectiveness. The only reason I didn't give this section a perfect score is that the proponent hasn't made a specific commitment to how many proposals he and the team can take in in a specific timeframe. For example, I would love to know how many proposals his 1 day/per 2-week office day will be targeted to answer questions for? And how many “Cardano Projects” newsletters will be updated every 2 weeks on the blog?", "q2r": 4, "assessor": "z_assessor_4075", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14243, "q0": "This is not a good proposition. The proposal will become a SPOC, providing knowledge and legal advice for Cardano projects. This proposal raises the issue of matching challenges. The proposal will solve one question of the challenge, which is: \"How to come up with solutions and provide legal consulting services for funded projects,\" and propose to solve the question. this question. To answer the question \"Can this proposal expand in the future?\", then the answer is possible. Their solution will answer the legal questions sponsored proponents may face in cases like: building a DEX; offering tokens; financial services; offering NFTs or even meme tokens; crypto and blockchain legislation around regulatory compliance, taxes, AML/KYC, payment services, and more. As described, their way of doing things is to work with the DLT 360 blockchain, covering the European market and European legislation regarding stakeholders in the crypto industry, and handling the legal questions of the Cardano community. Their idea was to have a \"business day\" each week where people could call or write to the attorney who developed the proposal, setting up a video conference to ask questions. The attorney will keep timesheets to let the community know about the type of work he does. For legal questions and answers, all company information or personal data will be made anonymous and made available to the Cardano community for their own benefit. Attorneys will blog monthly to highlight topics of interest to the community. In addition, he also has a large network of attorneys around the world that he can help project developers contact if they have a specific legal question in a jurisdiction outside the Union. European Union. I am not really convinced by his arguments and ways of doing things. I wonder why he doesn't gather more lawyers in Europe and other continents to work together. Or link to another proposal to ensure the number of lawyers and teamwork will be more objective instead of subjective. His reputation only affects a few projects and does not guarantee all funded European projects will use his services. I noted that he has provisions for risks and offers solutions to solve them. However, that solution didn't really convince me. In my opinion, the immediate issue he needs to be concerned with is to gather a group of qualified and experienced lawyers in the law of digital currency and blockchain to provide legal support for the proposals funded in Europe, then expand the scale of development. In addition, lawyers can use their relationships with bar associations and governments to quickly grasp changing regulations and ensure the objectivity and legality of advice. In this challenge, there are many proposals submitted, with the goal of providing a solution to legal support for funded projects, so the community will have to consider the scale, quality, and impact. projects with high dynamics. Therefore, I do not appreciate the impact of this proposal. The scope for development of this proposal is smaller than many other proposals I have evaluated.\n", "q0r": 1, "q1": "He made a work plan for the first quarter of the year. The plan is quite detailed. His goal is to provide 2 business days per month for legal advice on funded proposals. I am interested in work efficiency, how many projects do you aim to consult? Advice on what issues? How's the quality? As described, he will: Update every 2 weeks to other Cardano proponents via Catalyst coordinator call; Updated every 2 weeks in the \"Cardano Projects\" newsletter; Monthly project process and KPI reports sent to Catalyst team and made public for verification; and the quarterly Swarm Session during office hours (at the end of town) for a Q&A session on legally funded projects. Regarding the budget, the fundraising budget accounted for less than 5% of the total Challenge. The fundraising budget only charged him with expenses, up to 900 EUR/day. This is not a small number, but the service he provides will only be limited to 2 days / month meaning there will be a limit on the number of projects that will be legally supported. As far as I know, some other proposals also provide attorney lists for projects, but their prices are not too high, only from $20 - $60 / attorney / hour and have a target number of proposals. specific legal support will be provided. I agree that good lawyers deserve a high salary when they advise, but he has not been right and convinced me. In addition, this project also needs expenses for project management, audit, communication, compilation of consulting materials, partners, ... but he did not mention. Fundraising budget is not too high, but recalculating the costs as I suggested above, the budget will be much larger. About the group, there is only one member, Mr. Michiel Van Roey and he consulted his wife who is an expert in the tax field. He has experience and qualifications as a Lawyer, the community can verify through Linkedin. With these arguments, I still hold the above opinion, he should finalize his proposal and maybe combine with experts / lawyers in the area or join work networking platforms to keep attorneys and proponents funded. With the current proposal, I don't appreciate the feasibility.\n", "q1r": 1, "q2": "Regarding work goals, lawyers will provide 2 days/month to answer questions from project developers. At the same time, he also produces regular (real) publications with information for the Cardano community. And they hold meetups every quarter where key industry experts and people from EU institutions share their knowledge of crypto-related legislative and regulatory work. He will post them publicly for the community to check. It is recommended that he synthesize objective feedback from legally supported projects so that the community can evaluate the quality of the services he provides. The success of this proposal will contribute to solving legal issues that projects are and will face in the process of initializing and operating their projects. At the same time, he will provide a useful source of blockchain legal information for global readers, the blockchain community, and project developers. The success of the proposal is related to the challenge, which is what the challenge is aiming for: to provide the right solutions and legal advice for the funded proposals. This is a new proposal and has not yet been tested.", "q2r": 2, "assessor": "z_assessor_3950", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 13748, "q0": "Continuing to be a legal issue around influencing and hindering the development and adoption of cryptocurrencies in the world. Proposal to bring the idea of creating the European Union's cryptocurrency advocacy advisory body helpsCardano's stakeholders have legal questions and become the SPOC for knowledge, this is appropriate for the Cardano community and addresses the challenge of legal barriers. The idea of studying the legal profession, publishing publications and handling legal questions of the Cardano community is the main goal of the proposal in line with the resolution of future legal issues, which is expanded to be great to lay the foundation for cardano community development. In order to propose to be highly effective I would expect the author to have solutions that store documents, questions, answers, videos, etc. legal solutions, so that users who want to be consulted can view the information via Github, Telegram, Youtube, etc. This reduces the overlap in questions, questions, Highly effective for the proposal. The proposal challenges too many questions (100 questions piled up at a time) to mitigate this challenge the author has prepared the content of advice and implementation materials. The risks associated with lawmakers' bias against the cryptocurrency industry have not been mentioned by the author, which has an effect on the success of the proposal, the possible solution is: the author should have a positive impact on lawmakers to thereby create a new perspective for them, create a catalyst for the success of the proposal.\nIn line with the author's challenge, the proposal is expanded not only in Brussels, Europe, but the proposal will help the Cardano community in the world overcome legal barriers.\nRating:4\n", "q0r": 4, "q1": "The proposal raises the legal issues that cryptocurrencies and crypto stakeholders are having. Regulatory hurdles are slowing the development of cryptocurrencies that lose confidence when entering blockchain or Cardano. The author has come up with reasonable solutions to solve this problem. Making the proposal is a European Business & Technology Lawyer and a cryptocurrency entrepreneur with 10 years of experience, author of several legitimate cryptocurrency publications, having worked with DLT360 https://www.dlt360consults.com/. There is no doubt about the author's ability to implement the proposal, not only that the proposal also has additional help from the DLT360 team, and a tax lawyer has been clearly shown on LinkedIn. The 1-year project implementation time is appropriately allocated by the author forevents, meetings, seminars on interesting topics around legality and Blockchain, DAO, financial law. This work done 2 days a month does not seem to be enough for legal issues, the author should consider that at least 1 working day per week. The budget analysis is that the public money for the consultation of 900EUR /day is not really convincing, I will agree with the plan to implement the author's proposal when proposing to adjust the implementation plan for one working day per week. \nRating: 3\n", "q1r": 3, "q2": "The proposal provides a roadmap with important milestones in a 1-year period broken down by quarter, the work done in each month and the implementation of the report for Projrect Catalyst these reports are done every 2 weeks through https://ico.profila.com, the work done can be audited transparently through the reporting that are the What we expected. I agree that this proposal is auditable. The proposal also holds a meeting each quarter to discuss legal topics, in addition to making the audit better the author should have information about the consulted content, publish more videos, or store documents on wedsite, Github for the Blockchain community and Cardano to refer to the legally useful information for cryptocurrencies. \nRating: 4\n", "q2r": 4, "assessor": "z_assessor_3777", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 12923, "q0": "The idea of creating the European Union's cryptocurrency lobbying advisory body helps cardano answer legal questions that aim to help users understand the legal impact on the Cardano community and solve the legal barrier challenge. The main objective of the proposal is to carry out the study of the legal profession,produce publications and handle the legal questions of the Cardano community in accordance with the resolution of future legal issues. The expanded implementation of the proposal could lay the foundation for the sustainable development of the Cardano community. Solutions to store documents, questions, answers, videos, legal solutions have not been offered. It is necessary to have information so that we and those who want to be consulted can see the information via Telegram, Youtube is highly effective for the proposal in providing legal information to users. The challenge of building effective solutions to provide legal services is achievable. The risks of the proposal related to the ability to handle large workloads have been minimized in more positive forms. Risks due in the implementation process may also be related to the acceptance of the legal information mentioned Michiel should also be concerned about this, to minimize the need for a positive impact on lawmakers.\n Rating: 4\n", "q0r": 4, "q1": "The proposal offers reasonable solutions to address the legal problem that cryptocurrencies and crypto stakeholders are having. The development of cryptocurrencies is heavily influenced by legal influences affecting the participation in blockchain or Cardano by developers. Implementing the proposal is a European Business & Technology Lawyer and a cryptocurrency entrepreneur with 10 years of experience, author of several legitimate cryptocurrency publications, having worked with DLT360 michiel's capacity to make the proposal, adding help from the DLT360 team, and the tax lawyer (Michiel's wife) makes the possibility of success of the proposal even greater. The plan to organizedetailed events, meetings, seminars on legal topics and Blockchain, DAO, proposed financial law is carried out as planned. However, the implementation of legal advice during the month is too little compared to the issues that need to be solved, which will make more sense when a person will have counseling sessions. Michiel has given specific timelines for 3 months to implement the proposal and will repeat the next 3 months of the year to resolve the work that is a reasonable and favorable plan for the successful implementation of the proposal. The amount of requested to be paid for the working day is not really reasonable, there should be specific numbers for the working hours, the workload is settled during the working day. Rating: 4", "q1r": 4, "q2": "The introduction of the roadmap has been carried out with important milestones in the 1-year period broken down by quarter. Making a report to Projrect Catalyst through https://ico.profila.com, the KPI gives not really clear we need specific numbers such as: What are the questions asked? How many legal issues are resolved? it is necessary to make videos, or store documents on wedsite, Github for the Blockchain community and Cardano to refer to the legally useful information for cryptocurrencies. What is shown in the KPI report is very important to be made public so that the audit can be carried out. \nRating: 3", "q2r": 3, "assessor": "z_assessor_3514", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11769, "q0": "“Cardano Lawyer (EU-region)” is a good idea that links well with the setting of the “Legal & Financial Implementations” challenge. The author of the proposal, who is also a European Union cryptocurrency and technology lawyer, is to offer one \"business day\" service every 2 weeks as an individual. This service will receive and answer cryptocurrency legal issues from the Cardano and Catalyst communities through a variety of methods: call, mail, or online conference. Topics of interest to the community will be gathered and written on a monthly personal blog by the author. The aim of the solution is to provide the Cardano community with free and specialized cryptocurrency legal aid. I appreciate this proposal's effort to support the community. The participation of attorneys with a deep understanding of the crypto industry will bring great value to the Cardano community. What I wonder is how the author will coordinate the reception, processing, and selection of projects to help in order of priority? What are the criteria for projects to receive the author's connection and support? This can lead to a number of risks associated with untimely support due to an overload of requests, and support being interrupted due to a project that may have problems during implementation that the author could not support to follow closely from beginning to end. I appreciate the impact of the solution. However, because some contents have not been clarified above. My score in this section is 4 points.", "q0r": 4, "q1": "Regarding the progress of the project, the author has provided a detailed description of the work to be done in the first quarter, then repeated in subsequent quarters of the year. The project roadmap information is, in my opinion, detailed and clear. However, what makes me wonder is whether this community support service is for a limited time or only for one year. This relates to the project budget of $22700 converted to EUR, calculated on the basis of the salary Catalyst will pay to the proponent (equivalent to 900EUR/day*2 consulting days/month*12 months). So I would like to ask after this money is used up, will the author continue to support the community? About the team, the author has provided a profile of his experience in the field of cryptocurrency law with attached links and in-depth legal articles published. I believe that the author has enough capacity and skills to successfully carry out this project. My rating is 5 points.", "q1r": 5, "q2": "This project in my opinion is auditable. Here, the author has provided the necessary KPIs to measure success. Namely, bi-weekly updates to other Cardano proponents via Catalyst coordinator call, a bi-weekly publication of \"Cardano Projects\" newsletter on the personal web (https:// ico.profile.com). A timesheet will also be periodically provided to the community by the author for monitoring and evaluation. I believe that the community has enough facts and figures to understand the expected results of this project. So I rate 5 points in the audit section.", "q2r": 5, "assessor": "z_assessor_3279", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9326, "q0": "Your suggestion is relevant to the problem to be solved. The legal field is a difficult one to combine with crypto law so it will increase in difficulty but in reading we see the suggestion you made that you are a European Technology lawyer based in Europe. based in Brussels with 10 years XP in tech law and author of several legal crypto-publishing (since 2015 see links below), you are well organized and networked in Brussels to find the right people for your organization. So I have quite a bit of confidence in you. The issue of crypto regulation is important and you need to develop it firmly in each region. And if your project develops well in Brussels, including the European market and European legislation regarding stakeholders in the crypto industry, then from these regions this will spread well. Hopefully this project will be taken seriously and well. I see potential.", "q0r": 5, "q1": "In my opinion, after reading about the details of your first quarter time plan give details. But your budget should clearly convert all steps in USD because people reading the project come from many countries around the world, so it is necessary to choose the currency unit in USD for easy visualization. Although you have converted to USD after totaling, I think it should be changed in the whole process for everyone to follow. You provide details about who will work on the project with a link I can't access, it's quite inconvenient to have to log in.", "q1r": 4, "q2": "With the measurement proposal to track your project progress, I find it a bit general and not too clear to visualize. The success of this project is suggested by you that your workday 1/day per week is filled with questions from the Cardano community. In my opinion, the success of the project is still needed to solve those questions and convince everyone in the Cardano community. I also looked at your F7: Lobbying for favorable legislation: Crypto4Europe advocacy in Brussels. In addition, the author needs to provide additional success metrics such as regular (practical) publications with information to the Cardano community of 10 publications/ fortnight... This provides additional visibility. clear and make the challenge more verifiable. ", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9007, "q0": "This proposal would create an impact in helping to solve legal issues for projects on the Cardano chain. The proposer is offering his time free of charge to projects or proposals seeking legal advice in the EU. He also has connections beyond the EU and this proposal budget would essentially go to paying him two days a month to work on Cardano legal issues. This addresses the legal elements of this challenge well. \n", "q0r": 5, "q1": "The proposer is an experienced lawyer who works on Cardano projects already. He is familiarized with the block chain and willing to serve for two days a month in return for budget money from Catalyst. The timetable is doable, the budget is fair, and his througoghness in terms of presenting his proposal are sufficient to determine this is more than feasible.", "q1r": 5, "q2": "The proposer intends to provide regular updates on meetings and topics discussed. There will be analysis and a frequently asked questions feature. This proposal is clear, straightfoward, and auditable. \n", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"id": 8853, "q0": "Most of the people wont be having knowledge on crypto laws and regulations, and finding crypto lawyers is never an easy task, hence getting experienced crypto lawyers through online mode is  a great idea where client can get connected with lawyer and can take all the legal suggestion required for his project. This proposal can be very helpful in future where catalyst projects are growing everyday and client can get their lawyers at minimal cost , hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The biggest challenge here is finding the crypto lawyers and obtaining the lawyer at minimal cost , as their is very less experienced crypto lawyers around the world. Demand for these lawyers is vast  and consulting them at minimal cost would be challenging, since the proposer has already contacts available with him currently this make the task achievable as setting up a call wont be difficult task now a days through online mode. hence, with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal contains , on which are the days he wants to make available to the people, and the proposer has partnered with DLT360 team which is great.\nThe proposal should have more elaborated on budget breaking  instead of cutting out short,the proposal even contains proper timeline chart for completing its project and has proper key indicators to work with hence The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8387, "q0": "This is one of the most interesting project this round as the product is the author himself and he will use his own knowledge and experience to help other Cardano proposals to stick with EU regulations. In fact, it will probably work and the author is right to raise many issues related to taxation, payment, policy and so on, therefore basically all projects from the beginning could use this support to bring their products into European market more easily. As he is the only \"product\" sold here, lack of time will become the main risk and it is good that he is aware of that. I also agree that the idea to solve the list of general questions will partly help but it will need more as the amount of projects is very huge in various sections.", "q0r": 4, "q1": "The detailed plan is represented clearly based on the cycle of 03 months. It includes many activities such as report, consultancy, roadmap..then summarize the general questions in the end so it is convinient to access the information. The breakdown is fine compared to the \"product\" experience and the working time is informative, it makes everyone feel worthy to pay that amount for the service. A great bonus is that we only pay for the author but he has his own team DLT 360 and his tax expert in the house who can support him to answer our questions but we do not pay to them.", "q1r": 4, "q2": "For this project, the KPI / metrics here will be his time to answer the questions and do research to publish the report so it is a little bit vague for investors. However, it is not related to the author because if investors wants to exploit the \"product\" as much as possible, it is them who decide the questions and how to use him in the most effective way. Agree that this project will be considered successfully when we can use all of his time and many projects can overcome EU regulations to get into the market, certainly we need another reports to track these cases. To conclude, it is a quiet nice project and if you invest on it, it will save your time and bring more advantages to you when reaching European market.", "q2r": 4, "assessor": "z_assessor_2979", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7533, "q0": "Since Cardano's proponents' activities and new products are subject to current regulations, it's not easy for startups to access this knowledge or expertise + it's expensive. Proposals solve the challenge with excellent detail and provide insight into current vulnerabilities in today's customer feedback systems. The advantage of this proposal is that the author is a European Business & Technology lawyer and crypto entrepreneur with 10 years of experience having this knowledge and legal expertise as a technology lawyer and European Union cryptocurrency and wants to use it for Cardano projects by helping Cardano stakeholders with legal questions + become SPOC for knowledge. I find this to be a great solution for those who don't know about the legal rights of cryptocurrencies who are not familiar with cryptocurrencies, this proposal also appreciates an important part of helping people build trust in Cryptocurrency investment and helps us to see if there is a fraud or requires legal assistance for crypto, this model will make it easier for players to see the crypto market. To reduce the risk of this proposal is to find the most pressing and/or frequently asked questions and address them together to provide general guidance on important concerns that not only benefit an individual. projects but also for the industry as a whole. The author also raises the risks involved which I think is a good proposition worth considering.", "q0r": 5, "q1": "The proposal has a very high chance of success, as the proponent himself is a qualified European lawyer with a sizable number of years of experience in the IT industry, the author has worked for large law firms and currently running his legal firm this is a cryptocurrency expert I found the author to have a good understanding of what to expect on this matter, but joining crypto experts is different from This proposal may be of minor concern, as such experts are currently very limited. In addition, the author has meetings every quarter, with key industry experts and people from EU institutions who share their knowledge of legislative and regulatory work related to electronic money. The proposal is very ambitious and the proponent also provides details on what to do next. I doubt the production project is successful if it is funded. Proposer's previous experience as a European Technology lawyer with additional legal studies and work experience in Switzerland and the USA, with 10Y XP in technology law and written articles previously related to the topic demonstrating the expertise required to develop the proposal, he is the author of several legit crypto publications I think the project succeeds due to the author's existing experience. He also has an extensive network of lawyers around the world outside of the European Union with the DLT 360 blockchain, including the European market, and he also handles legal inquiries from the Cardano community.", "q1r": 5, "q2": "The group is listed in detail with the names and LinkedIn of the participants very clearly to help followers easily identify who they are. Michiel Van Roey is the lead manager of this challenge and he also works with the DLT 360 team (Heinz, Jonas, Mauro) and his wife a tax specialist. The funding applied for this proposal is $2,700. Time Michiel Van Roey will work 2 days per month for the Cardano community on all legal and regulatory matters that may be relevant to them, DLT 360 to gather legal and regulatory know-how (2 days/ month at 900/day).", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2795, "q0": "\"the main goal of this proposal is to provide free legal advice to financial-related legal entities, the commitment of this proposal is to dedicate one day a week to legal assistance and advice in the area world euro of which the subject of this project is a member, so this proposal met the requirements of the challenge presented.\n  All explanations and examples of the proposal are detailed and specific, and the proposal also claims to be working with the DLT 360 blockchain to gather more knowledge regarding Cardano and the advisory plan. proposed provides that there will be a certain time when the questioner may not always be able to get an answer and that there is a basic knowledge provided of the relevant laws,\n  \n   The risk is also identified that is not responding to the community's questions, and the proposal also has a solution to optimize it, I also agree with that solution, but in my opinion, there should be a plan for the website like me, mentioned above and integrates common questions and uses AI lawyers to answer automatically, this way won't get stuck in traffic for questions\"", "q0r": 4, "q1": "\"Through the presentation of the proposal's roadmap, I would like to have a few questions: if you announce it, this proposal will mainly only provide a Blog about questions related to the questions in the current period. 3 months, and after that there will be Blogs on other topics, so is there any flexibility for the community's questions, but my opinion is still impactful, so there is an automatic response system. for common questions, while still ensuring the confidentiality of the questioner's identity.\n  Also in the budget table, the presentation is not really convincing, the team should break down each expenditure further for example: how many days will you work to receive 21,600 EUR, in addition, it is proposed to declare the salary. is 900/ 1 day, so the team needs a link that shows what the basic salary of your country is per day and what is the lawyer salary. to ensure the reasonableness of paying your lawyer's salary.\n  the proposal provides links to the social media pages of himself and his wife, both attorneys, that is the statement of the proposal, very friendly to the topic but actually the feasibility is not satisfactory. request to give my high score. \"", "q1r": 3, "q2": "\"I know your work to implement this proposal will operate primarily on online platforms and writing e-mail messages, and commit to videoconferences to ask questions, but The proposal does not state on which platform the conference will be held, it does say that the indicators are announced periodically on: https://www.dlt360consults.com/ but periodically what times on monthly or weekly,\n  * Also, I can give this advice if you don't have a communication plan, how will our community know you are the provider of those services, so only people who know you can ask you support and advice,\n    so it's very unlikely to help the community, who aren't aware of this proposal, and whether the successes you've outlined can be implemented. The team should note this important point that support needs to be known by many people, so it can affect the scale of operations, there are many ways to do that. Please add these comments to your proposal so that it satisfies the valuable community request and you have a chance to receive funding from Catalyst through votes.\n  \"", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 13, "ne": 3, "ng": 5, "nfo": 5, "vca_o": 1}, {"id": 1836, "q0": "This proposal has addressed the legal problems that the projects in Cardano and crypto community is facing. The great thing about this proposal is the projects in the Cardano ecosystem can request legal advice from this proposer especially for those based in the EU. It is stated in the proposal that the risk of having too many advice requests from the community is justifiable because it is only 1 person (the proposer) will be giving the legal EU advice to the Cardano projects. In terms for scalability for this proposal, it is only scalable locally in the EU since it is only the proposer will be working on this and he dedicates his time for only 2 days a month. ", "q0r": 5, "q1": "The proposer has the experience in the legal sector and had been funded before in F7. The proposer seeks for more funds as there are plenty of Cardano projects seeking for his advice. The timeline given is possible to execute with limited resources such as time and manpower. Given his expertise in this area and have helped the Cardano community, the budget requested is sensible for legal advice 2 days a month and there is additional work that the proposer is going to put in such as writing legal reports and blogs. The proposer is working in other projects, and it will take a lot of effort to deliver this project. However, the community have been seeking his advice before and the proposer was able to deliver his promise.", "q1r": 4, "q2": "This proposal is auditable by the community with the reports and blogs regarding legal topics that the proposer will publish publicly. The proposer will also update the community in the Catalyst coordinator calls and producing newsletters weekly. The community will be able to monitor the progress with the information produced by the proposer. In terms of delivery dates, there were not specific days and how many hours stated when the proposer is taking his time off for when he will produce those reports and communicate with the community. A consistent day of the week will have the Cardano community easily monitor his progress. ", "q2r": 4, "assessor": "z_assessor_2274", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 1205, "q0": "This project is by a lawyer who is working in the European Union. He proposed spending 2 days a month to help the cardano community learn, and get advice on legal issues related to the development of crypto projects in the EU.\nThe form of work he proposes is to receive calls, respond to emails ... personal advice on the days he registers for legal assistance to others. I appreciate his personal contribution, his experiences. However, this form is still manual, and the amount of time spent is too little to make a great impact on the community. He might suggest developing an AI legal aid tool, or a legal search website would be much more effective.\nTherefore, I cannot give this project a high score.", "q0r": 4, "q1": "I know his potential is huge, given his long experience in the legal profession. However, the plan he came up with, with the intention of spending 2 days a month advising the community, and being able to maintain such work for a whole year is quite vague. Since I don't know exactly what he will do in those days, it depends on who will call him, who will email him. I think, to make his work more feasible, he should join the groups, catalyst meetings and introduce himself to the groups that are implementing crypto projects in the EU to have a clear work statement. clearer. Funding should be calculated according to the number of working hours, or the time it takes to create Q&A documents on crypto-related legislation.", "q1r": 3, "q2": "I believe his legal publications on cryptocurrencies in the euro area after days of legal advice will be very useful to the community. However, he needs more clarification. In the 2 days/1 month he spends with the community, how many hours does he work, how many legal cases does he handle...\nTherefore, his contribution is positive but not enough information for us to verify the quality of the project.\nI hope he will suggest more efficient ways of working, and easier to verify and evaluate the quality of his contribution to our community. Finally, I support this contribution but cannot yet appreciate the presentation.", "q2r": 3, "assessor": "z_assessor_2217", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14829, "q0": "With the main purpose to assist those facing a variety of legal questions around regulatory compliance, taxation, AML/KYC, payment services, etc when receiving funding to build out DEX or token offering, as can be seen, the proposer has prepared quite well what is required in this section. We have the main target audience mentioned above, in addition to the way the project is conducted in a relatively detailed manner. In particular, to avoid exposing customer information to the outside, the author decided to anonymize the company name as well as the individual. This not only ensures that the client's weakness is not caught by a competitor but also makes the help from the project fairer and more transparent. In addition, to ensure that when receiving unresolved legal or tax-related questions from outside Europe, the author will seek the help of a large network of lawyers around the world. This not only increases the number of projects supported but is also a way to promote the ecosystem to a wide range of lawyers. In addition, the way to solve the problem of overloading is also reasonably used by the author, yet in my opinion, it has not been able to completely solve this problem. Imagine, you only work one day a week, but the number of projects that need help comes from many different fields, no one is the same, so how can you solve it in 24 hours. In this case, I recommend, that the author should extend the number of questions or after how many days will no longer accept questions, along with that, take an extra day to select the questions related to others so that it only needs to be explained once instead of for each company.", "q0r": 4, "q1": "Overall, this is a good plan, full of timelines and things to do in each stage. In particular, the project also gives priority to Cardano users who have legal or tax problems, by using half of the working time in 1 month to support Cardano projects. In addition, the budget will mainly be used to pay the proposer - the only member who is also the host of this project. However, there is one concern that I hope the author can give a satisfactory answer to. It can be seen that the proposer intends to work together with DLT 360 team (Heinz, Jonas, Mauro), as well as receive help from his wife - an expert tax lawyer when receiving questions in relation to taxation, but In the budget section, we don't see the author mentioning paying these people. Then, will they only join the project as volunteers or will there be a payment for them, I hope the author can clarify this issue. In addition, we already know the experience and skills of the author through the introduction, but only have their LinkedIn. The proposer should briefly summarize their outstanding achievements, education, and skills so that voters can assess whether they are really suitable for the project.", "q1r": 3, "q2": "If the above two sections still need to add some ideas, then in this part, all information is provided by the proposer. As can be seen, after 4 working sessions, the author will submit monthly project process and KPI reports for Catalyst teams and available to the public for verification. This is to help the voter as well as the author to accurately track the development of the project. In addition, we also have the success that perfectly fits in well with the purpose of the project. Perhaps, it would be better if the author could be specific about the minimum number of projects you can help with after each working day. This is the only proof of the project's success.", "q2r": 5, "assessor": "z_assessor_4104", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 14969, "q0": "Initially, the proposer points out the common troubles that many startups in the Cardano community face, which is the lack of intelligence about legal obligations, especially in the field of technology in general and crypto in particular. The solution offered is that Cardano hires the author as a tech lawyer, who provides answers to those who are in need through mails, calls or video-conferences. Moreover, he commits to share the questions and answers made between the customers and the lawyer to the Cardano community anonymously. Monthly blogs to highlight the topics of interest are also available. Personally, I believe this would help the Cardano community understand more about legal obligations they have to obey before and after writing for a funding proposal. Furthermore, the more knowledge they acquire, the more confident they become. This eventually incentivizes them to write a funding proposal, make a startup and actualize their innovative ideas to develop a better Cardano ecosystem. However, there are some omission points that I would like to mention. Firstly, the writer has specifically stated his experience, profession as well as determined why he is suitable for the position, yet I think that 1 person and 2 “office days” a month would not be enough. As stated in the risk section, if there are 100 or more requests received within 1 day, which might be true concerning the highly growing speed of the Cardano community, some of the questions would remain unclarified and cause dissatisfaction among the community. In my opinion, the mitigation of picking the most concerned topic would not be effective. Accordingly, there are a few options that I would like to suggest from a personal point of view: gather more people and work as a team, increase the number of “office day” days or answer simple questionnaire mails daily and only approve calls and video-conferences for complicated problems. Secondly, the author did mention that FAQs and hot topics would be kept highlighted on his blogs, as well as regular informative cases would be public to the Cardano community, though, he did not describe how he is going to keep the information within the community only. From my point of view, making such intelligence accessible by Cardano users only would bring about more users towards the system and greatly benefit it. Additionally, it seems like giving away this project’s funds for charity if that knowledge is public for everyone. As regards, I suggest the project developer describe more about this problem.", "q0r": 3, "q1": "In this section, a clear plan was provided with 3 different milestones settled. Generally, it takes 3 month to finish one quarter, when some new publication topics will be released. The process of each quarter will be repeated 4 times throughout a year. In addition, a brief introduction about the proposer is given, including an affiliate link for further background checks (work experience, skills, education,...). Also, the proposer gives specific required salary per day, along with a total amount of money needed for a whole year. Nevertheless, $22,700 is not a small figure, which I believe would need a thorough consideration. I believe that the writer is a mindful and professional individual through careful notations and additional information given. Besides, in the part describing people who will work on the project, the author mentioned working with 3 other partners, yet, there are no explanations about what roles or tasks they have in this project. One small suggestion of mine is that he should clarify this part.", "q1r": 4, "q2": "Very particular and reasonable KPIs were given in order to deliver the best result possible. Nevertheless, I suggest that the team should use some proper tools such as JIRA to help them easily keep track of the progress. Moreover, they should also describe how they are going to post regular reports ( social media platforms or any relevances) so that the community as well as the Catalyst keep up with what phrase they are in. One point that I appreciate from this section is that they divide the KPIs into 2 different periods: the short-mid-term and the mid-long-term. This is very helpful for evaluating the process. Finally, some measures of success as well as SDGs were given obviously. These point out a very objective vision from the developers, which is to assure the long-term growth of the whole system as well as create a better society.", "q2r": 4, "assessor": "z_assessor_4118", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "I have this knowhow and legal expertise as EU crypto & tech lawyer and want to put it to use for Cardano projects by helping Cardano stakeholders with legal Qs + be SPOC for knowledge. ", "experience": "European Business & Tech lawyer and crypto entrepreneur with 10Y XP, author of several legal crypto publications and lawyer to crypto startups, already working with think tank DLT360 https://www.dlt360consulting.com/ (today unpaid) to provide legal clarity to Cardano community"}