{"id": 417402, "author": "rffx", "title": "Tanzania Cardano Think Tank", "url": "https://cardano.ideascale.com/a/dtd/417402-48088", "category": 26596, "amount": 35000, "description": "Lack of legal support to Funded proposals and Cardano ecosystem in Tanzania.", "f6_no_assessments": 10, "f6_rating": 3.7, "videos": [], "media": [], "f6_assessments": [{"id": 7158, "q0": "The idea aligns well with the objectives of the challenge, as it intends to establish a center in Tanzania to help aid the mainstream engagement within the public policy space by shaping legislation and providing innovative policy alternatives for the adoption of Cardano and blockchain at large. The problem here is the lack of legal support to fund the projects in the Cardano ecosystem in Tanzania. As the proponent pointed out that this center would also serve as a hub for the facilitation of Cardano ecosystem awareness campaigns and a bridge for collaboration between local entities and the Cardano. In my view, they explained the problem situation and their proposed solutions very well, but dedicate little space in the impact to explain the support parts referring to the other project would be executed. However, I still think the idea is something really useful and can support effectively to other funded proposals in Tanzania. I think that for us to understand well how this would work, it would be interesting for the proponent to explain the detail of progress, and how the update process would be. Overall, I believe the impact would be real, positive, and likely to be successful, in line with our current goal. ", "q0r": 4, "q1": "The feasibility of the project, in general, is good, but I don’t think that part is explained satisfactorily. Starting with the script, we are told that the project would be duration of 1 year, and the activities would develop according to the quarters of the year. The roadmap is very simple, however, the explanations are very superficial. For example, in the first quarter would be “an extensive legal and financial study will be made to the project”. I think the proponent could have detailed this much better, will this study look like? Who will work on it and do what in detail? What exactly are they looking for during this study? The same thing I think for the second quarter of the project: “an extensive research on acquiring the necessary documentation and necessities of an establishment of the project”. How would that research be done, and in what form is the document expected to be so that it can be researched? Regarding the budget, 35000 dollars are requested, a high amount. But I don’t think the bidders adequately explained how this amount would be used, as again the information provided is superficial. For example, I would like to understand why this “Incentive for the team of 5” would cost 15000 dollars. What is the value of their month of work, how many days a week would they be working on the project, and for how many hours a day? What would the project manager, lawyers, and accountant do in their work routine to justify this salary? And 5000 dollars will be earmarked for marketing and communication in the whole year, but it is not detailed how the marketing will be done, for example, what strategies will be adopted and by what means this campaign will be publicized. As presented to us, the budget explanation is very basic, not being able to generate full understanding. And finally, speaking of the team involved, I think this part was good but there is also room for improvement. The names, backgrounds, and a little history of each team member are told so that we can get to know the satisfactorily, but I think that some profiles should be included on social networks or sites like LinkedIn, and Github… (except for Evans Kisanga, also a Cardano expert on the team), through which we could see the work of those involved in the practice. For these reasons, I think that all the important information about feasibility (script, budget, and team presentation) is not adequately explained and a revision is necessary.  ", "q1r": 3, "q2": "Unfortunately, the auditability of the project is very shallow. The proponent does not provide us with good auditability of the process, what we do know is that success can be measured based on the document or legal study. What will be the important milestones? How will they associate with the project phases? I think the proponent just names what they are going to do, but doesn’t explain. So we need more details on how this process would be in practice. It would be important, in my view, for the team to report the work process, how their routine would be if there were challenges if all team members fulfilled their roles each week, and so on. This can be easily monitored since we already have a very detailed roadmap, so we have a base of content to go by. We also know that the progress will be evaluated each month but a bridge must be established between the team and the Cardano community (through telegram, discord, etc), which they could use to update on the development process. Regarding the final results, unfortunately in this part, the explanations are much more abstract, we know that the goal here is “build a strong advocacy center that can mobilize public support and influence policies and legislations for adoption, a world or workspace in which projects can easily ensure they are setting out on a safe endeavor legally and financially speaking, where the stress of compliance doesn't stop the growth potential Cardano Ecosystem has”. However, it would be necessary for us to be more precise with the information to be measured, with more palpable consequences about success. How can we measure the “strong advocacy center that can mobilize public support and influence policies and legislation”? What indicators will indicate that the strong advocacy center where the stress of compliance doesn't stop the growth potential Cardano Ecosystem has? In summary, unfortunately, I don’t think there are objective and valid ways to monitor this project, and this part needs good improvement.  ", "q2r": 2, "assessor": "z_assessor_2879", "no_vca": 4, "ne": 4, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 11772, "q0": "“Tanzania Cardano Think Tank” is an idea related to the goal of the “Legal & Financial Implementations” challenge. The solution proposed by the authors is, to establish a Cardano Center in Tanzania, operating in the form of an NGO, attracting local experts to participate. The aim is to support regulatory policy for Catalyst-funded proposals in Tanzania and to raise blockchain and Cardano awareness for local organizations. Although this is an idea suitable for a challenge setting, I personally consider the information related to the impact of the solution to be incomplete and unclear. Here, the content of the proposal is to build a Catalyst Community Connection and Legal Aid Center in Tanzania. However, I could not find any impact assessment information around this solution. For example, what are the legal issues that crypto businesses may face in Tanzania? What are the challenges faced by Catalyst-funded proposals in Tanzania when implemented in the local business environment? In addition, I personally would like the group to provide more information about the model of the Center in Tanzania, what are the expected size, organizational structure, and operation? This will help the community understand the scope and likely impact of the solution on the Cardano community in Tanzania. Unfortunately, this was not mentioned at all by the team in the solution description. The only risk raised by the group was on the educational side, of the difficulty of convincing legal and financial professionals that projects were not just “scams” but real. Personally, I think that there are still some other risks that the group needs to consider. Specifically: one is, that is difficult to attract legal experts and lawyers who are really knowledgeable about blockchain to participate in consulting and supporting the community. Second, the risks involved in accessing and providing legal support to Catalyst-funded proposals in Tanzania. How do connect with project owners, encourage them to come to the Center, and really effectively support them to implement the project? These are all issues of public concern regarding the impact of this solution. I rate 3 points, deducted -1 point because the impact content is not specific, and -1 point because the risks have not been considered.", "q0r": 3, "q1": "Regarding the proposed implementation roadmap, the authors plan to conduct it in 1 year, including 4 phases (3 months each). In it, the team spends 3/4 of the total time (9 months) focusing on legal research and collecting documents related to the establishment of the project and crypto currencies. The last 3 months will be used to open a forum with stakeholders: media, policymakers, and regulators. I assess that, with this long research path, the remaining time will be less for communication, approaching and attracting lawyers and legal experts to join the Cardano center in Tanzania. This also made the task of providing legal assistance to the proposals in Tanzania unfeasible, as the group did not have enough time to do so. The budget is given by the team, I personally think is not clear and convincing. Specifically, what should the rental cost of $500 for 12 months be interpreted as? The group did not specify the cost of renting office space for the Center or the cost of hiring people to support the operation of the Center. $15000 (equivalent to more than 42% of the total project cost) is reserved for 12 months of expenses for a team of 5 people: 1 project manager, 2 lawyers, 1 accountant, and 1 secretary. I would like to ask how much is the specific cost for each HR position? Do they work full-time or do they still work in parallel with other professional jobs outside of the project? Not to mention, communication costs $5000 for brochures, prints, and flyers, so how are the quantity of each type and the unit price calculated? All these costs lack unit price and quantity information. This makes it difficult for the community to assess whether the stated expenditures are really reasonable or not. Regarding the team, of the 3 members of the team, only one author has a reference link to the profile. The remaining two members lack linkage information, so it is difficult to assess whether their capacity and experience are suitable for project implementation. So I made a deduction of -2 points on budget and team. My rating is 3 points.", "q1r": 3, "q2": "Is this project auditable? Personally, I rate the project as auditable, however the success metrics are unclear. Here, the team is expected to provide monthly legal research (up to 30 days) as a measure of success. However, I think the team needs to come up with specific KPIs. For example: the number of lawyers that the group will approach monthly, the number of lawyers who will join the center, the number of proposals that are approached and supported by the group, etc. In the roadmap section of the solution , the group setup the goal of “attract more professionals into the Cardano ecosystem, an estimated 30 lawyers and 20 accountants.” In my opinion this number should be included in the audit as a measure of success KPIs. Communities need specific metrics to accurately measure outcomes and what project success will look like. My rating is 4 points on this section, -1 point deducted for lack of KPIs required for project audit.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 33, "q0": "The challenge brief calls for “implementing legal…boundaries and frameworks.” In response to that challenge, the proposal discusses growing the accessibility of legal support for the Cardano ecosystem in Tanzania.  To achieve that objective, the proposers envision creating a center to work on shaping legislation.  The proposal would benefit from a few more specific descriptions including how the proposers will reach legislators, what tools and resources they will use to influence policy, and which issues specifically they will work on. While they mention “tax” and “free-markets” those topics are so broad that the proposal risks a reduced impact due to lack of specific focus. ", "q0r": 3, "q1": "The proposal gives significant detail about the three proposers, including a LinkedIn profile for Evans Kisanga. He appears to be a highly engaged Catalyst community member with some experience working in finance in Tanzania.  Three websites are referenced, however one is not in English. The other two describe government agencies in Tanzania. The proposal would be strengthen by providing additional evidence to substantiate the claims that the proposers will be able to reach and influence legislators in order to achieve the objectives of influencing legislation favorable to Cardano. Additionally, using the Lido National tool to search for other proposals authored by Evans Kisanga reveals that he has submitted five other proposals in this Fund9 with a total budget requested across all 5 proposal of $529,820. Searching for “rffx” which is the ideascale handle listed as the lead proposer of this proposal, reveals another 4 proposals (aside from this one and the 5 mentioned previously) with another $114,900 requested. It would strengthen this proposal to describe how the work across all of those proposals would be managed in the event they are all funded. ", "q1r": 4, "q2": "As mentioned in one of the public comments, the KPIs could be strengthened by adding more concrete details. The two metrics listed are “make a document (legal study)” and “the document or legal study was done in a maximum of 30 days.” It is not clear to me what is meant by document or legal study. It also isn’t clear what the time frame of 30 days was used, since the roadmap describes that the project will last for one year. Additional metrics and milestones would be helpful to track the project across the full year of anticipated operations. Additionally, the PA guide suggests referencing a public channel to distribute metrics and KPIs and the proposal would be further strengthened by developing and describing this communication plan. ", "q2r": 3, "assessor": "z_assessor_2030", "no_vca": 23, "ne": 8, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 488, "q0": "This proposal's aim to create a think tank center in Tanzania is a great idea! Excluding this one, 28 projects have come through catalyst that are based in Tanzania, 9 of them are in this fund and another 9 have been funded! Having a place to go on the ground for legal resources only serve to increase their chance of success.\n\nTwo star because this proposal falls short of spelling out exactly what kinds of help these 9 and future funded can expect to receive from the center. \n\nThe challenge asks for proposals to \"provide legal & financial services and support\" with success in the form \"direct access to these solutions.\" Here are some questions you might think about answering for the community to help us understand the intent and impact of what you're trying to build:\n\nHow do you plan to \"aid the mainstream engagement within the public policy space?\" Meetups? Webinars? Visiting legislative offices?\n\nWhat does \"facilitation of Cardano Ecosystem awareness campaigns\" look like? Are these flyers? Community gatherings? Radio advertisements?", "q0r": 2, "q1": "The proposal does a great job laying out a year long timeline with 3 months long milestones. The budget is broken down well with line items details. The proposal provides team information, all of which with pertinent to executing on this project!", "q1r": 4, "q2": "The proposal does a great job providing how they will internally measure their progress as well as two outputs the community can look for to follow project progress. We have love to see some hard or soft metrics that ties back the challenge key metrics around Use Case, Impact, scalability or adaptability. Some way to do this might describe legal environment before the center and how the center might affect that. Perhaps some specific targets of helping specific numbers of projects in the area (there are 9 funded proposal based in tanzania). ", "q2r": 3, "assessor": "z_assessor_2098", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 4977, "q0": " Establishing a think-tank is a good thing and will contribute to supporting funded proposers with the knowledge, skills and resources to navigate the legal and financial frameworks. Undoubtedly, public education and public policy engagement is still need more to be done to educate and onboard regulators in the economy to harmonize with Blockchain initiatives. If the think-tank is started as a Non-governmental organisation (NGO) will be able to work private and government agencies to welcome Blockchain and Cardano projects in Tanzania. \n\nI would however advise the team to really do more of media publicity especially on radio, TV and social media including press conferences to call on the government and private sector regulators in the Tanzanian economy.  ", "q0r": 4, "q1": "The 3-member team such as Evans, Lubeto and Lucy is sufficient to deliver, and with the outlined educational and professional experiences, it's relevant to the success of the project. I am particularly happy to see a high court advocate in Tanzania as a project team member and I hope Lucy (Advocate) will play a pivotal role to engaging her colleague Advocates at the High Court to secure the legal backing that will empower funded proposers in the delivery of their projects. \n\nThe timeline is clearly elaborated for the period of one(1) year and the total budget of 35000 USD makes it feasible. however, it would be appreciated if the team could indicate what Miscellaneous budget of 3000 USD stands for?. In a challenge like this, it is important we learn to mitigate loss of funds and maximize funds to deliver on projects. Aside this, the team experience and timelines are feasible for a successful implementation. ", "q1r": 5, "q2": "The proposal mention that, progress will be evaluated each month to determine lapses and success of every objective and action plan.  Generally, If the advocacy center is established in order to \" mobilize support and influence policies and legislations for adoption\", there would be improvement in making Catalyst projects sustaining and impactful.  Hence, this proposal is auditable and I hope the progress reports will be shared via the excel and legal study documents as indicated by the proposal, with access for catalyst team and project stakeholders to evaluate success and impact. ", "q2r": 4, "assessor": "z_assessor_2650", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 6998, "q0": "- As we all know legal is always the most important issue for all projects. Failure to understand the law can lead to very high potential risks. But currently in Tanzania they do not have legal support for the funded proposals. With the Tanzania Cardano Think Tank idea. I think this is a very good idea.\n\n    - Here the group has raised the issues that are. Lack of legal support for funded proposals and the Cardano ecosystem in Tanzania. I found the problem the group raised to be well suited to the challenge. And very true to the real situation of the people of Tanzania. are encountered.\n    - To solve the above difficulties the group has come up with the solutions that are. A center will be established in Tanzania. supported an established NGO that aims to attract professionals to it and help increase the accessibility of legal aid. and support for the Cardano ecosystem in Tanzania. The center will serve as a support for Cardano ecosystem enhancement campaigns and will serve as a bridge for collaboration between local organizations and the Cardano ecosystem. I find the solutions mentioned to be very good, these solutions can completely solve the difficulties that the people of Tanzania are facing.\n\n     - The risks that the proposal may face have also been outlined as follows. The main risk will be the educational aspect, there must be a way to explain to legal and financial experts that the projects are not \"scams\" but real, However, the team also has a plan to Reasonable risk reduction is to hold face-to-face seminars and promote social media. I find the above solution to be very reasonable.", "q0r": 4, "q1": "   -  In the section provide a detailed plan, including progress and milestones. I see the proposal team has identified a specific timeline. That will complete the plan in a period of 1 year. With a period of 1 year I think it is reasonable to complete the tasks set out. The progress of the project has also been detailed in each Fund. already have objectives and results to be achieved as stated in the proposal. I have no further comments on this.\n\n    - With Please provide detailed budget breakdown. With a budget of $35,000 and has been broken down into six different items to cost. I think with the breakdown as above is reasonable. The proposed team has also calculated very carefully to minimize the cost of their project. With a cost of $ 3000 to reserve for the case of lack of budget. I think is also reasonable.\n\n    - When asked about the section providing details about the people who will work on the project. I see here that the group has listed three members. There are specific tasks assigned to each member. Through researching in the proposal, I found that the capacity and experience of the members are very good. About the identity of each member, only one member is easily authenticated by having a link to access. As for the remaining two members, it is not easy to verify their identities.", "q1r": 4, "q2": "    -  With a description of what you will measure to track your project progress. Here I see the group has outlined two KPIs that are. prepare a document (legal research), and the document or legal research is done in up to 30 days? I find the indicators outlined to be clear. However, the above indicators are not easy to measure.\n\n    - In the Success section of this project what does it look like? The only success cited by the group was the construction of a powerful advocacy center that could mobilize public support. but the group has not mentioned any more specific successes. However, I think it is enough to successfully build such a powerful hub.\n\n    - Presentation on funding section. This is a new project that has never been funded. However, I see this proposal, if successful, will bring great benefits to the people of Tanzania. I hope this proposal will receive a lot of support from the community.", "q2r": 4, "assessor": "z_assessor_2856", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"id": 7411, "q0": "Established an NGO dedicated to supporting Cardano projects in Tanzania, under the auspices of the law. This is a great project and it fits the Challenge perfectly\nI am really impressed with the [SUMMARY] section Summary of your relevant experience, you have enough expertise, diverse in areas such as business consulting, law, social protection, and understanding of the ecosystem Thai Cardano. At the same time, the organization wants to combine with 3 main ministries such as BRELA, capital markets, and TRA so that companies can be legally registered and established, this is an extremely right step for the project to succeed and develop long-term development\nIn terms of risk, the project is worried about convincing experts that the project is real, and a sustainable organization. In addition to organizing seminars, and meetings, using media as the project outlined. I have a few suggestions as follows: do strong legal and financial research, present it scientifically, and clearly state the advantages that the project brings to society, to legislators. Report business activities regularly. Such as transparency, operating within the legal framework, and protecting users. Turn this risk into an advantage to be able to collaborate with legislators. I hope my contribution makes the project stronger. For this part, the project deserves 5 points\n", "q0r": 5, "q1": "The plan is divided into 6 sections with many detailed processes, all lasting for 1 year. The right time for the project to implement. As for the budget, the project has a full list of expenses, the total budget of $ 35,000 accounts for 7% of the entire Challenge, this is a number that is suitable for a project that lasts for a whole year, everything is quite convincing.\nThe team consists of 3 members, with extensive experience spanning areas such as finance, information technology, and court defense. Perfectly suitable for project implementation. In addition to EVANS KISANGA with a social network link, the project should provide this information to the remaining 2 members, for the community to check and interact with.\nWith the information I received, the members have participated in other projects in this fund and the previous fund, so how to ensure efficient work, how to allocate time if the project is granted capital. Please make it clear for the community to accurately evaluate. It's just a small question for us, we are happy to give 5 points for this part\n", "q1r": 5, "q2": "With 2 metrics listed, that's the result achieved, they are easy to quantify and highly intuitive. In this project, progress is assessed monthly, so the metrics you should list in more detail, such as a summary of legal research, the number of documents collected, registration of legal entities, the number of marketing channels, and images of the media sessions... At the same time, the project provides specific links to update the development progress, and the results achieved. Make the project easy to promote the quality of work, and easy for the community to check and quantify\nThe success of the project is a huge leap for the Cardano ecosystem in Tanzania, making it transparent, legislators doing their job well, and users protected. I believe that when the project is successful, the project will create a great resonance throughout Africa and beyond. I would like to give 4 points in this part because of the lack of detail in the audit\n", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9016, "q0": "This proposal would have a large impact on the cardano ecosystem, especially in tanzania. This proposal would create a NGO (non-profit) organization that would serve as a public voice for Cardano in the country. This team would research the process and then work to get the appropriate legal and financial status in the country. Then they would help other projects in Tanzania gain legal status, help to promote cardano among the legal and financial powers in the country. The team would also work to promote cardano country-wide and provide training and assistance to those who want t o know more and get started in crypto. The goal is also to legitimize cardano and crypto projects within the country so that they are seen less like scams. This is a positive way to impact the legal and financial status of cardano in tanzania. The reason for a 4 and not a 5 is because the impact is limited to a single country. But the more organizations that function like this, the better.", "q0r": 4, "q1": "I am uncertain whether or not this proposal is ultimately going to be feasible. The team is solid, and they have the experience to accomplish the goals here. The problem is that the scope of work looks fairly high, and the team may be overwhelmed by the amount of work, especially because they are working on previously funded projects and have submitted more projects to this fund. There are a lot of tasks to accomplish. The process will take time. They did plan on it taking a full year, so there might be enough time to accomplish everything the team plans on. But it is also possible they run into roadblocks due to the nature of what they are trying to accomplish. There are also risks that seem to be unmentioned. There is always a risk of bureaucratic red tape that is unseen. There is a risk of active opposition by those in authority over the NGO process. Additionally, while they plan on opening dialogue with policy makers, there is no evidence in the proposal that they are connected in a way to assess feasibility here.", "q1r": 3, "q2": "The goal is clear in working to create a non-profit organization to advocate for Cardqno in Tanzania. This needs to happen, such an organization should exist in every nation of the planet. Ideally, this proposal would have provided more specific steps to accomplish their goals. There are questions in my mind regarding feasibility or outreach steps to take. Also, what are the key metrics they plan to measure? The metrics are vague and based upon the roadmap. The roadmap does have sufficient detail, but there are elements outside their control in the roadmap. The concept of legal research is vague and not well-defined in terms of the goals to be accomplished. The auditable metrics are not measurable or certainly attainable by the team. There should be tasks and steps that the team can complete listed here, especially in terms of outreach. How many people will be talked to? How many contacts will be followed up with? Etc. Again, this needs to happen and I believe in the goal, but I am very uncertain whether or not this is feasible. ", "q2r": 3, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9111, "q0": "This proposal will help to provide legal support to the funded proposals and the Cardano ecosystem in Tanzania. This proposal introduces the idea of establishing a center in Tanzania to support Cardano ecosystem awareness campaigns, as a bridge for collaboration between local organizations and the Cardano Ecosystem. It also provides the community, media and stakeholders to build solutions, policy to favorable legislation, reduce tax, and free-market environment that advances individuals' creativity and innovation in building on the Cardano Ecosystem. This NGO will help not only individuals but all businesses through the right channels BRELA( https://www.brela.go.tz/ ), Capital Markets (https://www.cmsa.go.tz/), TRA (https://www.tra.go.tz/), which are the entities where companies in Tanzania are legally registered and constituted. \n\nAs such, this proposal is in line with the challenge's goal of providing legal support and guidance to Catalyst-funded projects. The proposal also introduces a risk in convincing legal and financial professionals that projects are not scams but real. They also offer educational solutions through meetings, seminars, websites, media. I find this solution to be reasonable.\n", "q0r": 5, "q1": "The project will be implemented in 1 year in phases: the first 3 months, they will do legal and financial research for the project; The next 3 months, they will research and collect documents for the establishment of the project; The next 3 months are legal research related to the regulation, protection and encouragement of crypto-related innovation… Throughout the year, the center will serve as a Cardano hub that facilitate other ecosystem sustainable goals. I find the time to research and collect documents to set up the center is a bit long, 6 months, the project team should find a way to shorten the time to achieve better efficiency. I see in the risk section that the solution is to organize seminars and meetings, but in the roadmap in the last 3 months, it only says that it will start an open forum with the media, policy makers and regulators. , it is not clear how many meetings will be organized, how many seminars, who are invited... The project team should make a more specific plan for easy implementation.\n\nThe project requires a budget of USD 35,000, of which the NGO registration fee is USD 1,000, the cost for 5 people (project manager, lawyer, accountant, secretary) USD 15,000, marketing and communication USD 5,000… The project team should allocate costs for organizing meetings and seminars such as documents, costs for guests, rental of venues, etc.\n\nThe project implementation staff consists of 3 people, of which 2 are law graduates, one is an active members and collaborators in Catalyst, in accordance with the project's requirements.", "q1r": 4, "q2": "The project's method of assessing progress is make a document (legal study), the document or legal study was done in a maximum of 30 days? But they don't offer a way for the community to control. Their success is building an advocacy center with public support, influencing policies and laws to support projects. The project team should aim to support as many funded projects as it is more convincing.", "q2r": 4, "assessor": "z_assessor_3021", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 14463, "q0": "The proposal targets the legal section within the Cardano system in Tanzania - which seems to lack legal support. The proposal will provide a center run by reputable NGOs to raise awareness about the Cardano ecosystem and act as the middlemen between Cardano system and local authorities in Tanzania (BRELA, Capital Markets, TRA) where businesses are legally recognized. The proposer could highlight the demand for legal support in Tanzania (by giving numbers of proposals, local context, background information). This is intended to provide more publicity for the Cardano ecosystem and in turn gives the Cardano community more advantages that could facilitate their creative works. This is meaningful for proposers in Tanzania who wish for their proposal to be funded but lacks the necessary resources to write a sufficient one. The solution is effective and practical by providing those very resources (connections, legal support, education). The proposer could also mention how the operation of this center will encourage more proposals coming from Cardano community in Tanzania or spark innovation for newcomers in the country. This impact is important as it means more people will know of the Cardano community and their ability to facilitate innovation. The Catalyst community will benefit from this and it will become a win-win situation. Cardano may become the forefront community for proposal-makers of the blockchain community in Tanzania. The support from the NGOs also means more viable proposals will be written, thus contributing to the Cardano ecosystem directly. The main risk is that legal and financial professionals shun from joining this project for fear of fraud. Gaining trust from these people is important as they also act as credentials and validate the project. The proposer chooses to mitigate this by offering 1-1 educational outreach (meetings, videos, social media,..) to give a sense of reliability and transparency - which is reasonable. From those early steps, the proposer may form partnerships with reputable organizations, figures, ambassadors to endorse the reputation of their project.", "q0r": 4, "q1": "The roadmap is quite detailed. The proposal will be carried out in a year, with every 3 months for a specific stage of activities. Reading the key milestones, one could see that the project puts an emphasis on extensive study and research of related areas (legal and financial study, market research, cryptocurrencies. After this, the forum will be launched with the validation of “policy akers, and regulatory institutions, press release and media engagement”, which really adds to feasibility as this confirms how the project is legitimate and ready to be utilized. The proposer also points out how this will be a Cardano hub whose support will extend to other ecosystems - this expansion can be beneficial for Cardano. Therefore, the goals are clear. Similarly, the budget breakdown is quite satisfactory. However, there are parts where more specification will be necessary. In “incentive for the team of 5”, rather than arrive at a total amount of 15000 USD, the proposer should specify how much will go to each position (1 project manager = ? usd; 2 lawyers = 2 x ? usd = ?usd,...). What the budget for “Marketing and Communication” does well is that it includes marketing materials (but regrettably not the amount of money for them). Moreover, an amount of 5000 usd for a whole year is a bit too general and vague to assess its practicality. The proposer should break it down into smaller stages of marketing (Stage 1: ? usd, Stage 2: ? usd,...) and the procedures involved (printing posters/flyers/…: ? usd, poster advertisement posters: ? usd, advertisement paid to professional companies (if any): ? usd). This is well explained in “educational outreach and awareness) where it includes a budget breakdown for certificates and catering. Miscellaneous fees should also be specified (transportation: ? usd, contingency plan: ? usd) - this makes sure the proposer has a clear plan for the budget and helps them to utilize the budget effectively. The team profile is good in that each team member is clearly introduced with their specialization, place of employment. The expertise of the team members proves to be much needed in this proposal and ensures the quality of human resources (member of Catalyst community, web development, researching, legal advisors working in tech companies). With these credentials, the team earns a good reputation and increases feasibility. The team could also give a specific role of who does what to make a clear picture of day-to-day activities. The explanation for further funding in later rounds is reasonable and reflects the long-term scale of their big project.", "q1r": 3, "q2": "The progress will be measured through monthly evaluation. However, the proposal should rephrase the key metric to make it clear that key metrics are measurable (which increases auditability and easier to track progress). The current phrasing is a bit confusing and can be misleading. “The document or legal study was done in a maximum of 30 days?” (as cited) can be understood as a yes/no question – whether the legal study is done after at most 30 days - or it can also mean “The number of documents and legal study done in 30 days”. These are a bit different, therefore requiring clarification. It is more advisable to choose a measurable key metric (such as the latter) where clear numbers can be given to track progress. The definition of success is reasonable and well–aligned with the proposal. However, to objectively assess whether the proposal achieves this success, some indicators (advantageous policies, number of professionals participating, number of NGOs, number of positive feedback from users, number of Cardano projects made by users of this legal center) should be provided. The proposal comes with SDG goals, which is suitable with what the proposal is trying to achieve.", "q2r": 4, "assessor": "z_assessor_4055", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "By laying out an amicable solution to help through established NGO to attract professionals to it, and help grow the accessibility of the legal support and support to Cardano ecosystem in Tanzania.", "experience": "\nBusiness consultancy agency,\nMasters degree in ICT law, Bachelor degree in law, Bachelor Degree In Social Protection,\nMembers and active contributors in Catalyst communities ( GTH, C4C, CATH, CETH), Catalyst Proposal Assessors, Front and Backend developer, F8 funded proposers.\n"}