{"id": 417654, "author": "cerpofficial", "title": "Cardano ERP for Catalyst", "url": "https://cardano.ideascale.com/a/dtd/417654-48088", "category": 26596, "amount": 100000, "description": "There is currently no intelligent, open-source Cardano-native accounting/auditing system.", "f6_no_assessments": 12, "f6_rating": 2.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 6679, "q0": "The value proposition behind this proposal is to develop an open source Cardano-native accounting system, that allows for an efficient tracking, reporting and auditing funded projects. I believe there is a poor fit between the proposal and the existing challenge, and I shall bring forth two main arguments. Here they are. \n\nFirst, for me it is not clear what advantages such a system would bring, compared to classical accounting systems. My background includes accounting / financial matters, and I can’t really be accused of not being knowledgeable with the subject. I am however at a loss when trying to imagine the features and benefits of a Cardano - native, or rather any blockchain - native accounting system. What would such an accounting system have on top of a regular one, will it be on-chain, will it provide cryptographic proofs of entries performed, or generally how will it differentiate itself from any other accounting system? The proposal does not shed any light on these topics, it only states that “we will scope the needs of stakeholders, then architect and deliver an MVP which meets scoped needs”. This is a clear case when the proposers’ level of understanding of stakeholders’s needs is still incipient, and a much better understanding of the needs has to be gained before proposing such an undertaking.\n\nSecond, accounting systems are by definition country / regime specific. Each institution has to obey a certain framework when doing its books, be it US GAAP / IFRS standards for large institutions, or simply the country-specific accounting / tax rules from the place it resides, in case of small and medium enterprises. How would a Cardano native system account for all of this, will it have country-specific modules, will it be fully customisable? Will you be able to change accounting practices, tax brackets, VAT systems, amortization schedules? Again, the proposal stays silent and there is no meaningful information regarding these aspects. \n\nConsidering all of the above, and taking into account the many questions unanswered with regards to the value proposition, I have to maintain a slightly negative stance towards this proposal’s impact. ", "q0r": 2, "q1": "I see a rather poor feasibility for this project. First, there are major red flags with regards to the team’s description. The proposer states that the team members are experienced, and we are being asked to go through the resumes posted on their website in order to have more details. When doing this, I was very surprised, and not in a good way, to see that although there are quite a few resumes posted there (five), their quality is simply very very poor. All the names are anonymised with black markers (so you can’t really know the names of team members!) and the information within all of them is again unclear, ineligible, the formats are all different, they look like they have been scanned with very old equipment, and the information within is likewise. Very bizarre names of companies, awkward backgrounds and universities and little information that you can actually verify. Of course we are not being provided with any linkedin links or other references. I hate to be judgemental, but this is a major red flag for me, that in an open, decentralized system, a team chooses this anonymization path. \n\nIn a similar fashion, we are not offered any kind of information with regards to the timeline or the budget. For the budget we are only informed that the project would require 2.000 hours to complete, at an hourly rate of 50 USD/hour, without any other split between milestones, phases or anything else. Timewise, the scoping document would require one month to complete, the architecture another month, development and testing would end by month five, and in the sixth month we would be delivered the MVP. Again, a very poor level of detail regarding the entire project. \n\nFor an excellent proposal I would have expected to see: \n\n- full names for the team and appropriate resumes\n- a better level of detail with regards to the product. How will the scoping document be performed, who will be the stakeholders interviewed? What will be the split of hours between the phases of the project, and how will quality be measured?\n- a pre-existing github library with past projects\n- a real timeline, with milestones, deadlines", "q1r": 2, "q2": "A similar level of detail is present within all the auditability sections. The proposer states that the product will have four modules; general ledger, accounts payable, accounts receivable and audit reporting, but not much else. For an excellent proposal I would have expected to see: \n\n- full transparency of the team behind the proposal\n- already opened communication channels: Discord, Telegram, Twitter\n- a commitment to open-source development\n- a commitment to have at least monthly development reports and regular AMA sessions \n- a pledge to participate in weekly town halls and organize break-out rooms\n\nLacking any of these items, I can only be neutral towards the auditability prospects of this proposal. ", "q2r": 3, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 490, "q0": "There is indeed \"no intelligent, open-source Cardano-native accounting/auditing system\" and this proposal aims to solve just that. The solution detailed aligned with the challenge brief--CERP for Catalyst will provide a direct access to a financial service funded projects with accounting and auditing needs can use. Only four stars because it is not clear from the proposal [IMPACT] responses how funded projects will be able to access CERP for Catalyst. \n\nWill they just be launching a docker ready open source code that projects will need to deploy? Will they be launching a smart contracts along with parameterized integration code? Will there be a sass product? How exactly will it be \"infinitely scalable?\" Who are these mystery \"stakeholders\" ? The answers to these questions will heavily affect the impact of this project. \n\nThe proposal identifies one main risk and as a sound mitigation strategy. ", "q0r": 4, "q1": "The proposal has high level milestones and timeline spanning 6 months. Would have love to see more details about some those high level items. What are the technical aspects (architecture, software stack, technologies, will you integrating existing apis)? Perhaps \"communicating with stakeholders to scope requirements\" would have been a worthwhile pre-proposal activity. Without more details about the work, the community has no way of gauging its feasibility. What happens if after scoping requirements we learn that 100K is not enough? \n\nSame thing for budget, who are these stake holders and how can the community access the budget if it is \"subject to stakeholder requirements feedback?\" If there is so many unknowns, how did we come up with 2000 hours? \n\nThe proposal has identify a main risk of shortage of funding. The mitigation solution of delivering a MVP and applying for more funding is an unreasonable risk for the community. It would be better to scope out the project to be able to draft a complete proposals that numerates what funded proposal can expect from this solution.  What can we expect from the MVP?\n\nThe proposal has provided profession background information. It also directs people to their website with full CVs of additional team members. Many of the CVs have redacted information like name, and current employer. Seems like a link to linkedIn profile or CVs specifically for this proposal (linked directly in the proposal) would have been less confusing. With current employer redacted how can the community audit those references?", "q1r": 3, "q2": "The proposal does not provide any details about how it plans to measure track progress (project management) internally, nor does it provide any direction of where the Cardano community can go to follow along. Will you be posting weekly or monthly development updates somewhere? Will there be a public kanban or other board? gitbook, notion, medium, or equivalent updates?\n\nThe the proposal has four high level features listed as their definition of success. Would have love to see some more complete sentences with verb to help the community audit the success of the proposal. How does the community test or audit the general ledger? What should they be able to do?\n\nWould have also like to see the proposal's defintion of success be tied directly back to the challenge's definition of success so the community can audit that the thing being delivered is the thing asked for in the challenge. ", "q2r": 2, "assessor": "z_assessor_2098", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1875, "q0": "Accounting for the Cardano ecosystem does seem needed.  It's difficult to point to much in the challenge brief that particularly speaks to accounting, but there's nothing obvious that's maligned.  That is partially down to low quality of the challenge brief (obviously not caused by this proposer).", "q0r": 5, "q1": "References to staff are lacking, with no transparency and low credibility signals for the ability to do the type of technical work needed to implement complicated accounting systems together with the Cardano blockchain.  \n\nReferenced staff clearly have no present technical experience with Cardano.  Relying on a long training cycle does not provide any confidence in feasibility of this proposition.\n\nThe plan described does not actually describe how the project would be done, and the proposal is not satisfying the guidance for proposers.  Milestone and budget breakdowns are not present. Proposer could improve by writing milestones of specific progress, showing what specific achievements would occur during expected timeframes, which resources and skills would be used during the process, and then breaking down the overall budget by type of contributor.  ", "q1r": 1, "q2": "No metrics are offered that would be relevant to the Catalyst community.  Number of projects running on their MVP platform, amount of funds under management, and other measurements of proposed operational  details would be ways to measure success of the result.  Progress against milestones (if milestones had been written) might be meaningful progress measurements.  Because there is no specific plan, it is hard to suggest any other ways to measure progress.", "q2r": 1, "assessor": "z_assessor_2282", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2964, "q0": "Building an ERP system from scratch is an extremely ambitious goal. The proposers have submitted four proposals in Fund 9, one to build the main system (https://cardano.ideascale.com/c/idea/417652), two to train developers for it in Asia (https://cardano.ideascale.com/c/idea/417653) and Africa (https://cardano.ideascale.com/c/idea/420496), and this one to deliver ERP functions for Catalyst.\n\nThere is little question that the complex tasks of Catalyst will require increasingly sophisticated management tools over time. Indeed, there is widespread dissatisfaction with the capabilities of Ideascale. However, it seems fairly unlikely that a brand new ERP system will be able to take over these functions effectively in a way that existing tools cannot deliver. Notably, the proposal indicates a plan to deliver only General Ledger, Accounts Payable (with COTI Pay integration), Funds/Revenue receipts and Financial/Audit Reporting functions, subject to confirmation with Cardano stakeholders.\n\nOverall, I salute the ambition of this team with this ambitious idea. If successful, it would be an important application in the Cardano ecosystem. It also fits the scope of this challenge to introduce financial and legal implementations to Cardano. However, because of the extremely broad scope, which also produces that very significant implementation challenges discussed below, I agree but do not strongly agree that the proposal effectively addresses the challenge. It would be more appropriate for the proposers to begin with a narrower proposal to scope an ERP system and build focused components of it.", "q0r": 4, "q1": "The team on this proposal appears to have extensive experience as ERP consultants. However, they do not identify significant experience with software development, and this is a large software development project for which they are seeking over $600K in funding across their four proposals.\n\nNotwithstanding those large funding requests, this funding appears unlikely to be sufficient to build a complete ERP system, even one with the somewhat limited initial scope identified in the proposal. More important, there is virtually no development plan articulated. Among other things, there is no indication what platforms will be used, what programming languages, etc. No specification is provided except the four expected capabilities noted above, with the proposers stating that they will “communicate with stakeholders to scope requirements”. Running a development effort of this magnitude requires more than this, as I have learned as a CEO and executive of organizations building software applications.\n\nThere is also no detailed budget breakdown, simply an allocation of 100 hours to scoping and 1900 hours to implementation, at the reasonable rate of $50/hour.\n\nThe main proposal also states that the proposed system will involve the “tokenization of everything”, which would require deep integration with the Cardano blockchain. There is no explanation of how this is planned to occur. There is also no explanation why it would make sense to store all of the data of an enterprise on chain – much of this will presumably be private information that would not obviously benefit from tokenization (or if there is a benefit, it should be further explained). It should be noted that this proposal will apparently not have adequate resources to succeed unless the main proposal is funded.\n\nFor all of these reasons, I disagree that the information presented indicates that the proposal is highly likely to be delivered effectively. Given the ambition of this project, it would seem more reasonable to me for the proposers to start with a proposal to define a structure for the proposed ERP system based upon technical investigation and stakeholder discussions. The proposers explain that they have refined their proposal based upon input received on a previous proposal in Fund 8. I would encourage them to keep engaged and further refine the proposal in Fund 10.", "q1r": 2, "q2": "The proposers define success in terms of delivery of expected functions for General Ledger, Accounts Payable (with COTI Pay integration), Funds/Revenue receipts and Financial/Audit Reporting. For a development project which is based upon delivery of specific features, it is reasonable to define success in terms of delivery of those features.\n\nHowever, because of the lack of a detailed project plan, it will be difficult to track progress towards these features. Given the very large budget requested, the Catalyst community is entitled to a better plan for tracking progress.\n\nFor these reasons, I neither agree nor disagree that sufficient information is provided to track and audit the progress of this proposal.", "q2r": 3, "assessor": "z_assessor_2374", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 5670, "q0": "The focus  of the legal and financial implementation challenge is to present direct access to solutions which provide financial and legal services, support and guidance to emerging projects in the Catalyst Ecosystem. The model of this project fit this challenge, per my analyst of the project. The central idea underpinning the project is to support and help streamline the current auditing structure deployed by the catalyst community for proposals. In view of this, the proposer presents a more inclusive target audience for the project, namely: the Catalyst Fund audit committee, Cardano Community, and Catalyst Fund recipients. But I prefer a more detailed outlooks of the Cardano ERP that highlights the distinctive features of Cardano ERP which gives it an edge over the existing systems. According to scripts,the main objective here — to ensure that the Cardano system allow for easy and transparent integrated auditing, tracking, and reporting of funded projects. I appreciate that this project offers the opportunity to scale up the adoption of blockchain based solution and also enhance the auditing process within the ecosystem. However, I suggest the proposer provide more perspective on the key features that gives maximum benefit to the Catalyst fund auditing committee, to the community and to the recipient of fund in the auditing processes. The team suggests that by this project, it will address the need to get accountants and lawyers into the Cardano & Catalyst space. But, how would this be achieved? Clearly there is a need for a clarity on how this project would benefit both direct and indirect stakeholders within the ecosystem.  Again, is the Cardano ERP model to be used only in the catalyst space or it would be made available to the businesses? If indeed this would be made available to businesses, what’s the strategy?", "q0r": 4, "q1": "On the basis of the information presented on feasibility, I think more detail is required to make the project more feasible. Starting with, the team’s profile presented for this project shows a team with an extensive EPR experience and working knowledge of EPR system, an expertise that would be very relevant to this project. Given the ambitious nature of this project, I am satisfied with the overall profile of the team. More important is the profile of Gopakumar T. Nair, very precise and detailed with attached link that confirms his expertise and his existing projects. In that regard, I would have wish R “Jay” Jackson attached links or reference to complement his profile. Apart from that, with the designation of roles to each team member, we know what each team member would be doing. Additionally, the framework designed for the roadmap is not only simplified but also shows a clear scope of work for the team and the expected activities for each specified timeframe along the roadmap. Finally on the budget, the information presented is very generic. There isn’t a detailed breakdown of the budget. For instance, items like develop the ERP, testing of ERP, architect and MVP are all items that has their separate market value. Therefore, for a more transparent, understanding and accurate budget, I suggest the team redesign the budget to reflect a more detailed budget breakdown of each item. Additionally, per my understanding of the project, I think some items could have been included in the budget, these include project management fee, a contingency fee and possibly a team fee.", "q1r": 4, "q2": "The information presented to audit the project’s success is not sufficient. According to the proposer, “ we will measure success by the scoped modules we successfully deliver. We anticipate the following functionality: General Ledger, Accounts Payable (COTI Pay integration), Funds/Revenue receipts, Financial/Audit Reporting”. Based on the aforementioned, I think what's presented here are just functionalities that comes with this project but not solid KPIs. Therefore, the aforementioned points shows little alignment with the objective of the projects. For a more concrete and precise parameter to measure the project’s performance, KPIs like the number of proposals that was audited successfully using the Cardano ERP model, the feedback from the Cardano community and proposers on the use of Cardano EPR tool and the number of businesses that adopt the EPR tool. In case these point are considered, I prefer the team to also specify whether they would document any report on these KPIs. And how do they intend to collect information on these KPIs? Again, would the team update the community on the information on the KPIs and how frequent would it be done? Finally, I also suggest the team consider catalyst social media channels to update the community on these parameters.", "q2r": 3, "assessor": "z_assessor_2734", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7160, "q0": "The proposal perfectly meets the proposed challenge. Here, we seek financial services that can support and guidance to emerging projects in the Catalyst Ecosystem. In this case, the project will be an intelligent open-source Cardano-native accounting/auditing system consisting of a GL, COTI Pay integration, funds/revenue receipts modules, and financial + audit reports. The Cardano ERP for Catalyst seeks to allow for easy and transparent integrated auditing, tracking, and reporting of funded projects. The project stakeholders will be the Catalyst Fund audit committee, Cardano Community, and Catalyst Fund recipients. The proponents will scope the unique needs of stakeholders, then architect and deliver an MVP that meets scoped needs. In other words, the project is extremely relevant and I believe that it will address the need to get accountants and lawyers into the Cardano & Catalyst Ecosystem and provide direct access to solutions that provide financial and legal services as well as support and guidance to emerging projects in the Catalyst Ecosystem. Therefore, the goals of helping to establish effective solutions to explore and provide legal & financial services and support to funded Proposers will undoubtedly be achieved, which in the end will undoubtedly help Cardano to become more and more respected and widely used.", "q0r": 5, "q1": "The script provided is very shallow. We know what was going to happen very superficially. My suggestion is for the proponent to go further into explaining each of the activities - we know what would happen and when, but not how. This detailing would certainly increase the level of quality of the explanation of the process. Regarding the budget, I found that the amount requested (100 thousand dollars) is quite compatible with the complexity of the proposal. The money would be used for Scope and document requirements (100 hrs) and Architect, to develop, test, and deliver MVP (1,900 hrs) with the estimated average labor rate of $50/hour. However, I think we would need to know more about their work routines, including whether they would be working part-time or full-time on the project (even though we know the value of their work hour which is about $50/hr. I'm doubtful about not having a marketing or legal team... involved here. In my opinion, these professionals would be as important as the architect, developer,... - as they would work n the ergonomic interface and project dissemination. The duo of professionals involved is very well presented. But we do not have their LinkedIn besides long explanations of their background. Tt would be better if the whole team was already defined (this would convey more security on the whole)", "q1r": 3, "q2": "The auditability is the weakest part of the proposal, unfortunately. About the process, it is said that Cardano ERP for Catalyst will exist as an MVP (this proposal) of the scoped modules and be used by the Cardano Community, Catalyst Fund recipients, and Catalyst Fund audit committee (finished product). But everything is still pretty abstract. What would be scoped? How often? How would the Cardano community be aware of this news? I think the information was only half given, unfortunately. Proponents seem aware of the need to keep the community up-to-date but don't explain well how this process would be. Speaking about the ultimate success, I thought they focus on the delivery of an MVP having the following functionality: general ledger, accounts payable (COTI Pay integration), funds/revenue receipts, financial/audit reporting… Besides that, the proposal did not mention how the consequences for Cardano would be measured. Really, in my perception, we need to have quantitative and qualitative data to analyze the impacts of all this in our blockchain, and that was aside here. For these reasons, I consider that auditability is inadequate and deserves a good review.", "q2r": 2, "assessor": "z_assessor_2879", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7413, "q0": "Cardano ERP for Catalyst will provide the accounting and auditing framework for funded projects. This helps projects improve product ownership, making operations transparent. So this proposal is perfect for the Challenge\nCatalyst is the largest decentralized fund in the world today, most of its activities are through consensus from the community. Accounting and auditing for Catalyst helps the fund operate more efficiently, properly assess the steps taken and plan for the future. They also have their own team. Can the project present its advantages for Catalyst to choose? Has the project started yet? Please present to be able to attract Catalyst\nIn addition to the risk of funding shortfall that the project has envisaged. In my opinion, there is a bigger risk, that risk is auditing projects that have been and are being funded by the Catalyst fund, sometimes it's just a small project, a plan, a product. And the owners of those proposals are not specialized in finance, the projects are spread around the world. Does the project have a plan for this part of the risk?\nI rate 4 in this section\n", "q0r": 4, "q1": "The proposal should present the plan in more detail, with clear timelines. March, April do not know what the proposal will proceed. February architect is what to build, how many steps to complete. Which array to develop and test in May? With the above suggestions and related suggestions, the team is carrying out 4 projects on F9, how will the team members ensure the work and allocate resources if funded? After I researched the members' CVs myself, all of them were blacked out with photos and necessary information, making it difficult to identify. I don't appreciate this, it's really inconsistent with transparency and professionalism\nRegarding the project budget, there are 2 items, please list in detail the activities corresponding to the number of working hours, it will be easier for the community to evaluate. For example, building a 16-hour process, 60-hour project architecture, 8 hours of content adjustment... the total project time needed is 2,000 hours (x 50$/h), so the cost of applying for a grant is $ 100,000, accounted for 20% of the total Challenge, which is quite a large number. The project should consider this issue, can reduce the labor value, or split it into 2 proposals in 2 different funds, thus helping the project to be easily approved by the community. With all the above reviews, I disagree with the feasibility of the project, I only give 2 points in this section\n", "q1r": 2, "q2": "The project outlined 4 KPIs to measure project progress, the ledger KPI I really don't know how to quantify, looking forward to a more specific explanation from the project. With the remaining 3 KPIs, I evaluate them as easy to quantify, quite intuitive. At the same time, the project should provide a specific path where the project updates its progress and results, so that it is easy for the community to follow and check. The project can add indicators such as which projects use the data to prove the legality and effectiveness of the audit that the project brings to Catalyst. These are two very intuitive and powerful indicators of project success. The success of the project will help standardize the activities of proposals in Catalyst, the numbers speak louder. I rate this part 4 points", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8128, "q0": "\"Cardano ERP for Catalyst\" is a fresh take on the \"Legal & Financial Implementations\" challenge. The proponent raised an important issue for the Cardano ecosystem \"There is currently no smart open-source Cardano accounting system\". ERP is no stranger to business people and financial accountants in organizations including the government. The complete ERP system will include a financial accounting module. The integration of ERP with Cardano's technology to create a smart open-source Cardano native accounting system for Catalyst is fantastic.\nI found that the team's solution identified most of the challenging problems and argued well. The project has created an MVP on the Cardano ecosystem. This system will enable easy and transparent integrated audit, tracking and reporting of funded projects. The audience of the project will be the Cardano Community, Catalyst Fund recipients, and the Catalyst Foundation audit committee. Additionally, it will address the need to attract accountants and attorneys to the Cardano & Catalyst Ecosystem and provide direct access to solutions that provide financial and legal services and support. and guidance for emerging projects in the Catalyst Ecosystem.\nThe author identifies a major risk of possible underfunding and mitigates this risk by MVP is not the end product of this proposal.", "q0r": 4, "q1": "With this plan, the author has stated the tasks and milestones but has not presented them in detail. A budget of $100,000 representing 20% ​​of the total budget for Challenge. The budget division is also not detailed and clear. My opinion is that the team should also provide a more detailed project plan for the community to easily monitor and evaluate. At the same time, have a clearer budget allocation plan. This will also help the team reduce the financial risks that the team mentioned above.\nIn the group information section, I had the opportunity to learn about other proposals of the group in Fund 9. Like the evaluation of those proposals, I found their capacity and experience to be completely consistent with the goal. of the proposal. They all have decades of extensive experience in consulting and general development for ERP systems. The members' CVs are provided by the author on the project's website.", "q1r": 3, "q2": "The author says that they will measure success with modules to the extent that they deliver success, including functions: ledger, accounts payable, accounts receivable and financial reporting/ audit. I think that the team should provide a measurement index to make it easier for the community to visualize. For example, in terms of the scope of stakeholders, which indicators should be concerned and which indicators should be considered during the development and testing stages.\nThis is a new project, that needs funding to implement the project. So whether the project is implemented or not depends on whether it is funded or not. Once funded, the success of the project is determined by the fact that the Cardano ERP for Catalyst will live and be used by the Cardano Community, the Catalyst Fund recipients, and the Catalyst Fund audit committee.", "q2r": 3, "assessor": "z_assessor_2956", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 9017, "q0": "Cardano ERP for Catalyst proposes to develop an Enterprise resource planning program on Cardano to be used exclusively by the Catalyst team and funded proposals. The impact is questionable because the first part of the process is to interview the stakeholders as to what will meet their needs. So without having that information in the proposal, the proposer is seeking funding to determine the needs. There does not seem to be sufficient detail to determine whether this would create a positive impact, or whether it's feasible. In principle, the idea has some merit, but I am not certain that it would be the most useful tool for projects to manage their resources. I appreciate the desire to develop a Cardano-ERP and apply its usefulness to Project Catalyst, but it would seem to be a better use of funds to come back to Catalyst once the CERP is already an MVP to demonstrate how a version might be useful for Catalyst. ", "q0r": 3, "q1": "The first phase of this project involves determining the requirements for the rest of the project. There are hours given and a budget request of $100,000 but without specific requirements there is no specific budget breakdown. For example, there are no hours listed per module, or per month, just a general amount given. This is not sufficiently detailed to determine whether the project is feasible. The detailed plan involved six lines of text and only two of them are meaningful: “Communicate with stakeholders to scope requirements (month 1),” and “Architect (month 2), develop (month 5), test (month 5), and deliver an MVP (month 6).” This is not sufficient detail to determine the viability of this proposal.", "q1r": 3, "q2": "Auditibailty and clarity suffer from the same problem as feasibility. This proposal does not provide enough information to this assessor to determine whether this project would be sufficiently auditable. The team seems to have the experience, and I have no doubt in their competence or ability to complete what they have laid out. I just would have preferred more detail here and more specifics before advocating to give $100,000 toward this proposal when there are so many much more impactful and clear proposals in this found challenge.", "q2r": 2, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14244, "q0": "This is not a bad proposal. I am proposing a solution to build an accounting/auditing system for easy and transparent tracking and reporting of projects funded by the Catalyst Foundation. This proposal posed the right issue for a challenge. The problem solves the question \"How to provide financial solutions for sponsored proposals.\" Specifically, the solution to the problem of transparency in the use of the funded budget of projects funded by Catalyst The proposal is infinitely scalable and can be used anywhere in the world. The proposal is a good solution. Catalyst-sponsored projects developed on the Cardano ecosystem will have high transparency, increase credibility, and attract people to join the Cardano community. Specifically, their proposal is to develop an accounting and auditing system framework for funded projects, making it easier for project stakeholders to track and control transparency in the use of funds. sponsored books. The project stakeholders will be the Catalyst Foundation audit committee, the Cardano Community, and the Catalyst Fund recipients. They are expected to create the following modules: ledger; accounts payable (integrated with COTI Pay); money and revenue receipt; and audited financial statements. The solution solves the problem that currently funded projects still report their financials manually and without audit to increase transparency for them. This problem takes a lot of time and can cost additional 3rd party accountants or audits. They should focus on expertise to develop the project in the best way, and the accounting and auditing will be handled by this proposal. I agree with their reasoning. The proposal introduces the risk of a funding shortfall. Do you know how they describe this risk? The solution also does not involve dealing with the risk. I think that this proposal may face security risks because they are not a professional auditing company, not really reputable in the market. Sponsored projects will be concerned about the security of their operations, information, and/or customers being hacked and sold. Finally, in my opinion, it is recommended to add a module to store smart contract/transaction numbers for comparison and lookup. The score for impact is 3.", "q0r": 3, "q1": "Praise them for having a specific action plan. Proposed implementation period totaling 6 months: Stakeholder consultation on scope requirements (January); Architect (February), develop (May), test (May) and launch MVP (June). The timeline is pretty good. The proposal is successful when its MVP is used by the Cardano community, Catalyst Fund recipients, and the Catalyst Fund audit committee. The question here is \"Is your goal that the proposals funded at Fund 9 will use MVP?\". This is a big number, and it's really not easy to do in 6 months. But if it does, this is a really good proposition. However, I and the community do not know where to check the progress and results of the project because they do not mention it. In terms of budget, the fundraising budget accounted for 20% of the total challenge. A budget has a specific spending plan. There is no budget for communication, marketing, and additional budget estimates. These are two important expenses. Their fundraising budget is quite high, but they have not fully calculated all the costs that need to be paid. This is a minus. Regarding the group, their group consists of 2 members. Praise them for having specific tasks assigned to each member and putting their experience in line with the assigned work. However, there is no affiliated address like LinkedIn so that the community can verify the identity and experience and qualifications of members. The proposal still has a number of issues that need to be clarified and resolved. Therefore, the feasibility is not high.", "q1r": 3, "q2": "They do not provide any metrics to measure the success of the project. For example, how many projects will they attract to use this service? How are the projects evaluated after using the service? How does the community objectively assess the quality of the project? And in particular, the community is not really easy to check the quality of their services. I understand that a successful project will drive adoption and improve product ownership. It will address the need to attract accountants/auditors to the Cardano & Catalyst Ecosystem and provide direct access to financial services provisioning solutions, as well as support and guidance for the emerging projects in the Catalyst Ecosystem. The success of the project is related to the challenge. But they need transparency and publicity for the report to be more convincing. Because the issue of transparency in the use of funds is a matter of concern to the Cardano community. At the same time, this is a new proposal that has not been tested before.", "q2r": 1, "assessor": "z_assessor_3950", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14628, "q0": "The project was created to solve the problem there is currently no intelligent, open-source Cardano-native accounting/auditing system. CERP will be an intelligent open-source Cardano-native accounting/auditing system for Catalyst, consisting of GL, COTI Pay integration, funds/revenue receipts modules, and financial/audit reports. Cardano ERP for Catalyst will be a Cardano-native open-source accounting/auditing system. A native Cardano system will make integrated auditing, tracking, and reporting of funds projects simple and transparent. The Catalyst Fund audit committee, Cardano Community, and Catalyst Fund recipients will be project stakeholders.\nThe proposer has provided a list to include the expected core modules, but there is no in-depth technical explanation. I recommend the proposer to add other professional content, such as what algorithm the project will be built on, or what kind of programming language will be used, the addition of the above information is very important and critical to the technical success of the project. In addition, the addition of case studies should also be considered because the proposer does not provide a specific example.\nIf the project is successful, it will address the need to bring accountants and lawyers into the Cardano & Catalyst ecosystems, as well as provide direct access to solutions that provide financial and legal services, as well as help and direction to new Catalyst ecosystem enterprises. And the above content is aligned with challenges. However, the proposer does not have specific key metrics including expected numbers and timelines for project implementation.\nProposer describes the only risk as the lack of funds to complete the project. In my opinion, the proposer has confused risk and problem. The funding shortfall was at the heart of the project's original problem, and it could be solved by the requested funds. Listing a detailed budget plan, along with a contingency list can completely solve this problem. In addition, I suggest that the proposer pay attention to other risks such as audit/tax / legal related activities if the project is implemented.", "q0r": 3, "q1": "The project is expected to be completed in 6 months. The proposer provided a to-do list but didn't have a detailed timeline to track the progress of the above tasks. It is difficult to understand how the team will evaluate the work if the proposer does not have a detailed description of this. Therefore, I propose the proposer supplement this section with the following contents: work content, starting time, expected completion time, who will be responsible for the evaluation of that content, etc. The above content is extremely necessary to ensure the quality and progress of the project.\nBesides, the list of budget allocations is not detailed, the proposer only lists generalities, and there is no specific plan to use the budget. In which, the total project time is estimated at 2000 hours, with the amount spent for 1 hour being $50. So the total budget is $100,000. $5000 for scope & document requirements and $95,000 for architect, develop, test & deliver MVP. I found this to be a major shortcoming of the project because of the content in the risk resolution section, the proposer identified that the only risk was the lack of funds to complete the project, but the team did not establish a detailed budget sheet. I recommend that the proposer re-add this content in as much detail as possible.\nI noticed that the two co-founders of this project are both experts in the fields of technology and finance, and they have many years of experience working in the multinational technology world. This will be a good factor to help create a solid foundation for the project. However, some information is still missing regarding the associates who will work with the two founders throughout the project.", "q1r": 2, "q2": "Proposer does not provide key performance indicators for the objects mentioned in the Auditability content such as general ledger, accounts payable, funds/revenue receipts, and financial/audit reporting. Besides, the team also did not specify a specific time to start the project. It is difficult to judge the success indicators of a project based on the information the proposer has provided. I propose that the proposer redesign a roadmap that fully shows the contents such as the job description, specific date/month to be implemented, and required results of that content.\nFinally, the success of the project is considered as Cardano ERP for Catalyst will exist as a minimum viable product of the scoped modules and will be utilized by the Cardano Community, Catalyst Fund recipients, and the Catalyst Fund audit committee.", "q2r": 2, "assessor": "z_assessor_4076", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14692, "q0": "Cardano ERP for Catalyst will be an open-source Cardano-native accounting/auditing system after the project. So there are two points focused on the project: the accounting and auditing system is straightforward to the vision of the Cardano development team, and the current Blockchain technology needs to be developed to the next level. Besides that with your deep experience in general development and development for ERP systems I believe the project will be absolutely possible. I agree that this project aligns with the challenge and can promote adoption and improve product ownership. It will address the need to get accountants and lawyers into the Cardano & Catalyst Ecosystem. And also provide direct access to solutions about financial and legal services as well as support and guidance to emerging projects in the Catalyst. Plus, this service Ecosystem Cardano ERP for Catalyst can be infinitely scalable and able to be used anywhere in the world. But as you said because of a shortage of funding we will have additional proposals for a final product. So I would like to know more about funding that is making use of these new solutions and services and how many of these new implementations are mutualistic to the project in the additional proposal.", "q0r": 4, "q1": "During the timeline of 6 months, you have shown exactly the plan for each month. But I think it will make sense with more detailed information for each step and what work needs to complete every month. You divided the budget into 2 parts: Scope and document requirements, Architect, develop, test, and deliver MVP. But I want to know how to calculate the budget for each step actually each month. Regarding allocation, there is a good point with professors from the ERP field. So with the experience what exactly is the position for them for the project in Cardano ERP for Catalyst for 6 months.", "q1r": 2, "q2": "The way you measure the success is good but not enough to get the funding. We want to know clear quantitative indicators to track project performance to consider the funding for the project. In the project, Cardano ERP for Catalyst will exist as an MVP (this proposal) of the scoped modules. It will improve the ability to extend and Sustainability of the Administration of Cardano Community, Catalyst Fund recipients, and Catalyst Fund audit committee when finished.", "q2r": 4, "assessor": "z_assessor_4095", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "CERP for Catalyst will be an intelligent open-source Cardano-native accounting/auditing system consisting of a GL, COTI Pay integration, funds/revenue receipts modules, and financial + audit reports.", "experience": "The proposer has 30 years' experience as a master ERP consultant and CPA (inactive). The Cardano ERP core team has many decades of broad and deep experience in general development and developing for ERP systems.\nPlease see developer team CVs at our linked website."}