{"id": 418502, "author": "nvhieu", "title": "Automated funding 4 funded projects", "url": "https://cardano.ideascale.com/a/dtd/418502-48088", "category": 26596, "amount": 63900, "description": "Funded projects currently lack the tools to support financial Implementations. Each project has a different tool and executes in a different way. These tools are often used manually by project manager", "f6_no_assessments": 7, "f6_rating": 4.190476190476191, "videos": [], "media": [], "f6_assessments": [{"id": 6690, "q0": "There is a very interesting value proposition behind this proposal and it connects extremely well with the challenge, which is, as a reminder, to create the legal and financial tools that can assist Catalyst proposers in better managing their projects from these points of view. In concrete terms, the proposers wish to create a smart contract dapp designed to automatically disburse ADA following certain conditions.  \n\nThis is definitely a very nice feature to have in the not-so-near future, when the Catalyst system will be fully decentralized. However, as it is now the case, this function is still performed by IOG staff, and it is rather a manual process, for good reasons, probably the most important one being that behind every ADA payment to proposers there is at least a proof of life mechanism in order to weed out potentially bad actors. As well as the general reporting that definitely acts as a checks and balances mechanism to make sure that proposers actually deliver on their promises before receiving all the funds. \n\nAnother point worth mentioning is that this proposal has already been submitted in fund 7, but was unfortunately not funded. One of the excellent assessments of that proposals already mentions in great detail the problem highlighted by me as well - the fact that the function is performed by IOG, and also the fact that it is likely that IOG is already working on a solution, and the team should definitely double-check with them before embarking (again) on this quest. I feel that it is a massive missed opportunity that the team does not mention this topic in this proposal: have they or have they not interacted with IOG between fund 7 and now? If yes, we should have been told. If not, it’s just a sign that they could perhaps do their homework better in the future. \n\nHence, with these two caveats (1 - that there are no near-term plans for decentralizing this treasury function and 2 - that we are still not informed of any collaboration with IOG), there is nevertheless a case to be made by the proposers. But given the expected long term horizon on which this project would become useful, I am only offering three stars in the impact section. ", "q0r": 3, "q1": "The team is in a good position to deliver on this proposal. They are a stake pool operator, are part of the Plutus pioneer program and have received funding from as far as fund 6. They seem to be a two-person team, and they do an excellent job at presenting themselves within the proposal: we are being offered several social media profiles for each and bullet points of their expertise and background. A great addition to this proposal would have been perhaps a listing of all the funding received as well as the status of their ongoing projects or any deliverables already finalized, since we would have been in a much better position to judge the quality of their work done and hence the feasibility of this proposal. \n\nTimewise, the project would take six months to complete, and the proposal offers sufficient intermediary milestones. For example, after two months we would have the research part of the project already established, with the aim to find out and map the current status of Catalyst funding, which most likely would involve an ongoing dialogue with the IOG team, as well as identification of best paths forward to automate the processes. After four months the smart contracts would be ready to be run on the test net and there would be a bug bounty program put in place to identify possible errors. \n\nThe budget is only lightly sketched and is set out on a monthly basis for each of the devs involved (one devops and one dapp architect) with a bit of project management set aside. I think a great addition to this proposal would have been for instance if hourly rates and estimations of the necessary hours were provided for each of the milestones, since I find it unlikely that they will devote their full time exclusively for this project for such a long period of time. And again, this topic had already been highlighted by a previous assessment, and we are not seeing any improvement whatsoever, which is the second indication that the team needs to do their homework a bit better. \n\nGiven all the flags highlighted above, I can only offer three stars for this proposal’s feasibility.", "q1r": 3, "q2": "The auditability section of the proposal is very light, and we are rather being offered a detailed roadmap within - which is still good information but perhaps not positioned in the best possible place. There is also no pledge to offer monthly progress reports towards the community - again, a rather standard expectation and approach for most of the excellent Catalyst proposals funded. It is again a missed opportunity to capitalize on already provided feedback from the community from previous rounds and come back with a much stronger value proposition and an increased case for auditability and transparency. Sadly this is not the case, and I have to subtract one star at this chapter due to this situation. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 7162, "q0": "I thought this idea was very good in terms of impact, it is fully aligned with the objectives of the challenge and I’m sure it will generate good results for Cardano. Here they are proposing that the disbursement process to all Cardano members of funded proposals is very manual and time-consuming. It can lead to delays in project development time. The idea is that change this funding using smart contracts. Monthly payment of funded proposal can be released to an address of a smart contract. Based on pre-set conditions these ADAs will be distributed to the member's wallets. This condition usually includes information such as Time, completion schedule, and the number of votes of shareholders. From what I understand, this proposal is about a financial service that helps the proposer, project manager, and accountants in paying project costs to each member. The advantage here is that by sharing the smart-contract template with the community, other project owners can verify each line of code and apply smart-contract to their projects. So I think the project fits well with the objectives of the challenge because the proponent explains that the Dapp, which is designed to send ADA under certain pre-set conditions, will allow easy scaling with the number of projects increasing after each fund. Dapp also enables fast disbursement, easy audit, and enables transparency of decisions. Other than that, I think the impact of the proposal has the potential to be maximum.", "q0r": 5, "q1": "The proponent explains in a detailed and extensive way what would be done in this project, however, I think the roadmap is not clear in the sense of being able to visualize the activities well. For example, the activities would last 6 months, which are listed in the topics. Ideally, we would know what happens in each month of this time interval. I think we managed to understand very well what would be done and in what way, just this visualization of temporality is not safe, so I would say that the script is good, but it needs to improve. And because there are many activities, it is a little difficult to define where one would start ad another would end. The budget (63,900 dollars) is very well explained, the proponent divides the total amount into several parts so that we can understand clearly the need for this money even though I think that a very high amount is requested. We know what the value of the hour of work would be, but it would be even more interesting if, for example, it determined their working day, that is, how many days a week and for how many hours a day they would work (certainly I also saw the google doc link that was attached but it is not what I concern). The part of Budget for Marketing, in my opinion, could be better detailed. What will the marketing campaign look like? What is the marketing strategy? Finally, speaking of the team, I think this part is very good because all the necessary information is provided so that we can understand who we are dealing with. We know the names of the professionals involved, as well as a summary of their professional assignments and their LinkedIn profile, Github, and email. This gives a lot of confidence in the team. Therefore, I think the feasibility is already good, with only a few points to improve.", "q1r": 4, "q2": "Project auditability is good, although not perfect. We can work here on two things: the development process and the final result. Regarding the development process, it is said that progress would be measured based on completed tasks. From what I understand, the objective here is the complete development of the project, in addition to some quantitative goals such as collecting feedback and updating the Bug Bounty program; providing a tool to help the community automatically distribute wages to project team members, which would help fund managers less work, they can focus more on the business. Indeed, we must know the project process, but I also think it is important that we know what these numerical facets and the qualitative impact of the whole thing were. With this, I believe that the proponent’s suggestion on how to audit the project would be increased and we could be more confident about the final impact of this project.", "q2r": 4, "assessor": "z_assessor_2879", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 495, "q0": "This is an excellent idea and certainly many funded teams would find useful. \n\nOf the 900+ funded proposals so far, more than half (560) of them had a team of two or more members, 324 of them 3 or more members. This is not even counting contractors not listed on the proposal. \n\nThe proposal has detailed description of their solution that's reasonable and easy to understand. \n\nThe proposal has identified one risk and provided a reasonable mitigation strategy. \n\nWhile PAs deeply familiar with the challenge brief can make the connection, would have love to see a call and response style detail about \"how your proposed solution will address the Challenge.\"", "q0r": 5, "q1": "The proposal has a detail implementation plan with milestones and timelines spanning ~6 months. There are two big milestones with six deliverables for each. \n\nThe proposal has a very detailed budget breakdown with 16 line items as well as rates for different roles. \n\nThe team has all of the core competencies to complete the project--they have provided links to their linkedIn profiles for references and verification. ", "q1r": 5, "q2": "The team has provided detail about how they plan to manage and track progress internally as well as where the technical and non-technical community can go to follow along with the team's progress. \n\nThe proposal has two defined definition of success. Would have love to see an explicit link back to the challenge's definition of success, but 5 stars all around nonetheless. ", "q2r": 5, "assessor": "z_assessor_2098", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2837, "q0": "\"the way this proposal solves the problem of the request challenge is to provide a Dapp to send ADA according to the wallet condition in the smart contract, but there is no specific explanation who will be the user of this Dapp, because as far as I know how to disburse the eligible proposals to track the percentage of each group's proposed work to qualify for Catalyst's funding, moreover, in my opinion, the proposal team needs to cooperate on this issue with the fund side to apply this method, but without cooperation it is difficult to apply payment to all funded projects, and there is also the cost of each smart contract because of the number of smart contracts. Projects eligible for funding are not few.\n  and if your provided Dapp can integrate projects to calculate the number of proposals funded in each round to facilitate monitoring and disbursement according to the plan, the team needs to explain more about the problem. This topic is more specific.\n   In addition to the risks proposed by the team, if I would like to advise one possible risk is: what tools will the team use to verify the completed work of difficult-to-identify proposals such as: education, or only based on the conditions of the smart contract, if only using the confirmation of the conditions of the smart contract will be difficult to identify the community development proposals, and there may be fraud in the declaration of the conditions. of smart contracts. Here are a few suggestions for suggestions to include them. \"", "q0r": 3, "q1": "\"As the proposed work is mentioned in the project progress, it seems that, once the funding is granted, the proposal team will begin to study the current funding process, and many other requirements will begin. research, so the proposed team has not been proactive for research before applying for funding, if we research first and have experiment, we will highly appreciate the initiative and feasibility of the proposal.\n  Also in the marketing budget section, there is no statement as to how the marketing will be done by traditional marketing or by promoting on popular social platforms, and will spend on it. what in marketing to run out of $2,500, this needs to be clarified more from the proposal side. and there are many more parts that need to be clarified for example: Budget to rent a Virtual Private Server on Google Cloud Provider $3,000, how long will this part be rented and it is better to split them up.\n   for the team part, the proposal is very complete, but I see that the group has some members participating in some other suggestions, will this affect the work progress when it is mass funded, The team has not announced any commitment to parallel completion yet. \"", "q1r": 3, "q2": "\"First I would like to mention a markup of the proposal that has been funded in other rounds but has never provided links to those proposals, nor a brief description of initial success. of the funded project has brought benefits to the community.In this matter, please consider providing more to increase the credibility of the proposed team,\n  In addition, the group has a commitment to support the community on the metrics that it has provided, for example, it will publish its progress at certain intervals, make it widely available to ensure transparency for the audit. community approval and is also a condition to finance the remaining requested amount.\n  The success of this proposed project claims to shorten the disbursement time of the projects, more than this, I see that the funding fund they do is doing very well but, if there is a delay, most of them have their own reasons. of that project, for example not completing the schedule for the 1st disbursement, and many other reasons that contribute to the delay that people see.\"", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 14, "ne": 3, "ng": 5, "nfo": 6, "vca_o": 1, "reply": "Thank you very much."}, {"id": 11736, "q0": "The problem with this proposal is how to build a smart contract to automatically disburse between the wallets of project members. Currently funded projects lack financial support tools for implementation, each project has a different tool and implements it differently. These tools are in a state of being used manually only by project managers. Project Catalyst is a long-term project that with the status of disbursement to all staff of the grant proposal team is very manual and very time-consuming, it affects the development of the project. With these difficulties, the proposed team has come up with a solution to build smart contracts to support smart monthly payments more easily. Therefore, I think the problem raised by the group is completely reasonable and suitable for this challenge.\nBy changing the funding source using this smart contract, the monthly payment of the proposal is transferred to the address of this smart contract, from the pre-set conditions, the money will be poured into the wallets of the members. I think this solution completely solves the problem that the projects are experiencing. It is not only a solution for project owners, proponents, project managers, and accountants to pay project costs for each member. It can also verify each line of code and apply smart contracts to their projects. For the members who receive money from the project it will also be clear and transparent, they can actively monitor it.\nI agree with the team's output that we cannot foresee the risks in building this smart contract, we can only face them when making the transition from the public mechanism current to smart contracts. How to avoid the risks of appearing the proposal team can only study the returns accounts in some proposals before funding support to understand how they pay monthly.", "q0r": 5, "q1": "There is nothing left to refute, the plans do the job of the proposal. Perhaps having learned from the previous fund, the team has come up with a clear and detailed work schedule, and the implementation time is also specified. The plan was shortened within 6 months, the team listed the work order and formed the final product, releasing a smart contract for the community to use.\nTransparency and clarity are reflected in the budget table that the team has broken down, we can see that the team has shown in great detail and meticulously the budgets spent for each job. However, what I and the community both see is that the budget level that the team is calling for this fund is higher than the previous fund, while the previous fund has also been over-budgeted, which leads to the project not being invested. So if we continue to stay at this fund if the budget is more, will the project be invested or not, should the community put in the effort to support the project?\nThe group of people involved in this project is people with competence and experience in information technology, from LinkedIn references and their information pages, which is enough for us to believe in their ability to work on this project.", "q1r": 3, "q2": "The proposal team shows us the project's progress as measured by the completed tasks each month, with this doing the work measurement closely. The tasks that have been assigned by the team to each group are required after each month they have to complete those goals. With this measurement, I think it is completely consistent with the proposed solutions and will bring the project to success more easily.\nAs analyzed above, the success of the project is clearly defined. When the project is completed, it will not only bring convenience to managers to reduce jobs and focus on business development but also for the community, there will be a tool to automatically distribute salaries to member of the project team.\nHowever, this proposal was pre-funded and met the criteria for approval but was over budget and unsupported. So at this proposal, I think we should also adjust the lower budget for the project to be invested in because it brings great benefits to both managers and members.", "q2r": 5, "assessor": "z_assessor_3273", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13803, "q0": "The proposal is about a tool to support the financial Implementation of funded projects.\nThis concept is fantastic in my opinion and essential for financed initiatives. The proposal precisely satisfies the requirement of the challenge, which is to offer financed projects with solutions and services to operate lawfully in their home countries in order to assist create new opportunities and give project owners peace of mind. By establishing conditions in smart contracts to automatically distribute funds across project members' wallets, the tools significantly assist project owners in reducing the workload associated with tasks like progress monitoring and paying project participants.\n\nFor the above reasons, I am giving 5 stars to the proposal.\n", "q0r": 5, "q1": "Due to the references, links, team member skills, and experience that the proposer has provided, it is evident that they are quite confident in the proposal's likelihood of success. The budget is provided in thorough detail, including employee descriptions and a spreadsheet that I haven't seen in any other proposal. The proposed budget is reasonable for each line item. Timeline and work assignment are clearly shown in terms of what is being done, how it is being done, and by whom. As a result, I am rating this suggestion five stars because it is realistic", "q1r": 5, "q2": "The proposer offers a roadmap that includes milestones and a precise time frame for achievement, which makes it simpler to follow the project's progress. Additionally, this initial plan was presented in fund7 and met all approval criteria, which I believe would be a benefit to take into account. I'm rating this idea 5 stars as a result.", "q2r": 5, "assessor": "z_assessor_3832", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14246, "q0": "The proposal has a good impact. This proposal aims to build a smart contract to automatically disburse between the wallets of project members. ADA will be sent under certain pre-set conditions. The problem with the proposed proposal is that it is suitable for challenge. proposing a solution for optimizing the disbursement process between project members' wallets and having high transparency. The proposal helps Cardano-funded projects to be disbursed quickly and transparently. They will build smart contracts by which the monthly payment of the sponsored proposal can be transferred to a guaranteed address in accordance with the terms specified in the smart contract, including but not limited to: time, completion schedule, and number of votes of shareholders. The proposal can scale in the future, a solution for many projects. By the way, the Smart Contract will be tested on a few projects that the team is working on. After successful testing, the team will write the document and publish it for the community to use. With the successful running of the smart contract, the proposal will provide effective solutions for funded projects. It provides a financial service that helps proponents, project managers, and accountants pay project costs for each member accurately and quickly. The proposed solution would replace the current manual disbursement method, solving time problems, fraud, or legal disputes if the transfer is wrong. Their arguments are clever. This will be the optimal solution for budget disbursement for funded projects. When implementing projects, it is not necessary to hire an auditor to review revenue and expenditure and report at the end of the period once this Dapp is available, all disbursement plans have been planned and execution conditions are met. It is not recommended to hedge any risks. However, the proposal may face reputational risks. Can it be handled in the case of a wrong address or wrong conditions? There is no denying the impact of this proposal.", "q0r": 5, "q1": "They made a specific plan. It is proposed that the total project implementation time is 6 months, with specific work details for each period of 3 months and 6 months. The timeline is reasonable. In terms of budget, the fundraising budget accounts for nearly 13% of Challenge's total. A fundraising budget is a detailed spending plan. However, there is no additional budget plan, so 5% of the total funding budget should be estimated. Regarding the group, the group consists of 3 members, but the group does not assign specific tasks to each member. The experience of the members is related to programming, computer science, and management. However, if it is proposed to provide a legal and financial solution through smart contracts, the team should hire or have a member who is a legal and financial advisor to ensure the accuracy of the terms of the contract. It also lends credibility to the proposal, attracting more projects to use the service. The community can verify the identity of members via Linkedin. They have a degree. The disbursement of a project's budget does not stop at paying members, but can also pay costs for partners. So, smart contract terms and disbursement plans are very important to dispute disputes or scams.", "q1r": 4, "q2": "They have set goals to measure success in stages: after 1 month, after 3 months, after 4 months, and after 5 months. They will be public on the cardano2vn.i website and will provide monthly reports on github (https://github.com/cardano2vn). Project feedback should set a target number of projects using Dapp, to demonstrate the quality and effectiveness of the project and the results of marketing activities. Success is related to challenge. This is the issue the proposed projects are interested in. They take a lot of time and effort to disburse... This proposal was submitted in Fund 7. However, the team's efforts are appreciated for the positive improvements in Fund 9. They plan more clearly; their budget is more specific and relevant, in particular, good aim.", "q2r": 4, "assessor": "z_assessor_3950", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "This proposal aims to build a smart contract to automatically disburse amongst wallets of project members. dApp is designed to send ADA under certain pre-set conditions.", "experience": "We are SPO, The member of the Plutus Pioneer Program,Blockchain tech-savvies,Eastern Townhall moderators/co-hosts, We have been funded at FUND6, FUND7 and FUND8"}