{"id": 419012, "author": "projectnewm", "title": "KYC Solution", "url": "https://cardano.ideascale.com/a/dtd/419012-48088", "category": 26596, "amount": 125000, "description": "If an artist isn't registered with a performance rights organization/we cant identify the identity of said artists, there is no way to confirm ownership over the Intellectual property rights.", "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"id": 6701, "q0": "NewM will be a decentralized music ecosystem, a marketplace where artists can monetize and take control of their work. The team behind the project has great development plans and they are betting big on Catalyst funding, since this is one of their five Fund 9 proposals funding the core of the project, for a total of 480k USD, and an additional proposal seeking funding for an open source project that will indirectly benefit NewM. \n\nThis proposal seeks funding for the establishment of a KYC verification process and a legal assessment of their marketplace’s business model according to the US legal framework, and it is well aligned with the challenge. As a reminder, our goal here is to create the legal and financial tools that can assist Catalyst proposers in better managing their projects from these points of view. Let’s go through the project in a bit more detail. \n\nFor a better understanding of the subject it’s necessary first of all to put things into a wider context - and that is to understand the great potential of the music royalties market. More than a decade ago the industry was suffering due to extensive piracy, but in the last years the industry has begun to grow again, due mainly to online streaming and its advantages compared to the old distribution channels: convenience, personalization, accessibility. Therefore the music industry is generating constant revenue every year, and there is even a school of thought that considers the royalties associated with it to be an asset class of its own. Barron’s estimates that US annual royalty revenues to be over 40 billion USD, while the proposers estimate the overall market for at over 1 trillion USD (a bit optimistic let’s say). The main idea being that the music royalties market has a great potential to tap into, and gaining even a small market share from the overall pie is going to be a very lucrative business in the long run. \n\nThere is also a very good scalability potential behind the project, since after the development phase, the marginal cost of servicing an additional artist, an additional NFT or an additional smart contract are negligible in comparison to the high margins ubiquitous among the industry. \n\nWhy is this KYC problem important? Because in order to service artists, or any user for that matter, NewM needs to be able to identify the persons behind so that they can do business together (confirm ownership of intellectual property, payment of royalties, etcetera). KYC for a market platform is a core functionality, and it is extremely important to get it right the first time, first of all to be compliant with the applicable legislation, but also to offer a seamless user experience. \n\nIn conclusion, NewM has excellent development prospects, can be a tremendous asset for the Cardano community in the long run, and this proposal is well aligned with the challenge.", "q0r": 5, "q1": "A first excellent point relevant for the proposal’s feasibility is that the proposal is complemented by a white paper in which the concept and business model are presented in great detail, and the writers go to great lengths to ensure that no details are left out. There are extensive descriptions of the functionalities of the marketplace, the utilities of the token they wish to launch as well as how the DAO accompanying the marketplace will function. \n\nLet’s talk about the team. Ryan, the CEO, has a very deep understanding of the music industry, can articulate extremely well the value proposition that NewM can bring and he is also in charge of developing partnerships. Florian, the finance guy, was instrumental at the beginning, since he was the one that shaped the business model. Andrew, the CTO and security guy, has a long track record of delivering open source tools to the Cardano community, amongst other the development of a Cardano node CLI tool (command line interface). Including advisors, they have onboarded in excess of 30 members, very diverse in their backgrounds and a fairly geographically distributed team. All of them are presented on their website with links to their profiles (and what music they listen to, of course). So there’s a solid team behind the project. \n\nLet’s talk about funding sources and financial viability. Right now the team self-funds the development of NewM, and they are securing additional funding through their own stakepool. A strength of NewM’s business model (once it launches) is that it will not be reliant on just one stream for revenues - from the beginning the marketplace will focus on two separate sources of revenue: a streaming component trying to give established streaming companies a run for their money and a marketplace component focused on fractionalizing and distributing intellectual property rights as NFTs. In the whitepaper we are also offered a breakdown of their token distribution, which will begin modestly in 2022 and will continue until 2027. In conclusion, in addition to Catalyst, NewM will have various revenue streams, another excellent indication of the project’s good feasibility prospects. \n\nThere are however a few potential flags that I would like to highlight. Let’s analyze them individually.\n\nThe roadmap is split into six stages (identify compliance officer, hire him/her, identify partners, due-dil on partners, agreement with partners and legal precedence check). But sadly the budget is less than perfect, since it does not offer sufficient details to judge its reasonability at least. A first observation is that this proposal only asks for funding for a very small part of the overall project - just the compliance / KYC matter. 50k USD will be spent for a legal opinion and precedence check, 18k USD for operations costs for the KYC solution and 32k USD retainers fee for the compliance officer. They also mention that they will “hire an additional member for KYC compliance if funded.” But there are many questions unanswered. Who will perform the legal opinion and precedence check? Is there a due diligence process for the selection of the external lawyer? If they will hire an additional member how will that interact with the external advisors? Why is such a high retainers fee for a compliance officer and what does it actually represent?\n\nThe roadmap / budget / proposal / white paper contain some confusing information, even contradictory at times. While this is understandable up to a point, since the project is probably very dynamic, it would have been a great show of strength and organization skills if everyone from the team would be on the same page and would manage to successfully update relevant information in all the necessary places. One example of this: while the budget sets aside a specific caption for “KYC solution operational costs'', in the feasibility section we are being told that “ an additional member for KYC compliance will be hired”, while in the white paper it is stated that iDenfy (an off-the-shelf KYC solution) will be used for user identification. \nidentity verification. So which is the correct version we do not know: requesting funding for an in-house solution or to cover for iDenfy fees and operational costs?  \n\nConsidering the multitude of confusing information especially with regards to the budget, I deem four stars as appropriate. ", "q1r": 4, "q2": "The team is in the right spot to ensure full auditability of the project. They have already set-up community engagement tools (Discord, Telegram, Twitter, etcetera) and are frequently present on podcasts (Learn Cardano for instance). The founders are making themselves available within these channels and are actively engaging in discussions with the community when being queried regarding the details of the project (I have firsthand experience on this). We have therefore good reasons to believe that the Cardano community will be in a good position to interact with the team, as they are connected to the ecosystem in more than one way. \n\nTheir development will be Cardano - native, and Plutus will be the core programming language behind their development, so there’s a bonus point for developers. \n\nThere are also a few minor negative points that I would like to highlight. The proposers are stating that the success is measured through minted IP rights and the default rate during the KYC process, but we are not being offered any additional details into how those processes will proceed. And a few other general pieces of information would have helped if presented: will they adhere to an open-source architecture? Will they hold regular AMA sessions with enthusiasts? \nWe are also told that they have onboarded security advisors and they are constantly auditing their systems, but will they also try to reach a formal certification at a certain point in time? \n\nOverall fairly good auditability prospects, with minor details that could have been better explained and a few blind spots for voters. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 5, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 7165, "q0": "The idea is good, I thought it essentially would encourage creative and artist to work in the Cardano ecosystem. But I don’t think it fully meets the objectives of this challenge. Here, we are seeking to fund projects which provide financial and legal services, support, and guidance to emerging projects in the Catalyst Ecosystem. So that, many projects will broaden their horizons and increase their impact on the Ecosystem once legal and financial frameworks are explored and established. But from what I understand the project would establish a KYC verification process there will be also a legal assessment of fractionalization of music IP rights to ensure full compliance with the established legal framework in the United States. I think that in theory, this proposal is perfect for the “Film + Media (FAM) creatives unite” challenge in Fund 8, but in this Fund 9, I think doesn’t fit for the “Legal & Financial Implementations”. It is not clear why this KYC solution is beneficial, especially for the Cardano community. I also saw the Youtube video which is over one hour. Honestly, watching this long video made me tired when I tried to find the important content in that video that does not exist in this short proposal. Despite the proponent detailing well what the impact of this project would be, I think it is very theoretical, the proponent does not explicitly explain how this very complex technology could be built. Due to the lack of direct explanations of how the project would be developed, I really can’t be completely sure that the intentions will be achieved. In summary, it would be necessary for the proponent to explain very clearly how the idea would leave the theoretical field for practice, that is, which parts would constitute the whole; which phases would need to be developed for the final product to be delivered; which professionals would be working here, which can tell us what needs to be done, when, how and by whom. So that, we have a solid view of the project creation.", "q0r": 3, "q1": "Unfortunately, all the information we need in this part is either missing or insufficient. Starting with the script, six stages are reported, such as “identify appropriate third-party KYC compliance officer”, “hire compliance officer”, “identify potential partners”, etc. According to what is said, all these stages are very superficial. I think what the proponent needs to be done here would be to explain what would happen in each stage, detail very well the activities of each stage, preferably how long each one would take to be done, and who would be responsible for it, and how it would be done… Now speaking of the budget, the proponent asks for 125 thousand dollars but nothing is explained about how it would be divided and why. What is the need to order 50 thousand dollars for the “legal opinion and precedence check” part? What is the salary of the professionals involved? Because it is not explained into which parts it would be divided, so we also do not have details about them. It is always necessary to justify how the money would be used in detail, especially if it is such an expensive project. In addition, I think it would be necessary for the proponent to make it clear which professionals would be involved in the project and how much they would receive in salary, or explain the different aspects of the project would cost, such as legal opinion and precedence check, KYC solution operational costs, compliance officer retainer fee. Finally, regarding the team, unfortunately in the proposal only direction information that “team can be found at bottom of projectnew.io website. We will hire an additional member for KYC compliance if funded.” And from what I found on that website, not much information is said about the team which there are so many members, they are just listed which their names, title jobs, and LinkedIn profiles. We need to know more about their backgrounds, what role they would play in the project, how they would work (for how many hours per week/month, for example), how they relate to the Cardano ecosystem, etc. So I think the feasibility here is not adequate, this part of the project needs a complete overhaul.", "q1r": 2, "q2": "Again this part of the project is unfortunately very superficial and inadequate. Starting with monitoring the proposal, the author just claims that he will “measure successfully minted IP rights as well as the default rate during the KYC process”. How could we access such information? How would we be aware of the work routine of those involved? So I think it would be essential for the proponent to better explain what these metrics are and how they would work in practice. And about the final results, we must understand if the main objective of this project was achieved. The notion of success is also very abstract with the definition of the proponent “Success will be represented in a seamless KYC process upon the creation of an artist account.” I think it would be necessary to elaborate clearer objectives, both numerical statistics to be achieved, and qualitative objectives. Therefore, I regard the audibility suggested by the proponent as incomplete, requiring further improvement.", "q2r": 1, "assessor": "z_assessor_2879", "no_vca": 5, "ne": 3, "ng": 0, "nfo": 2, "vca_o": 2, "reply": "Faulty Rationale/and bias in the Auditability and feasibility sections. In both cases, the Assessor lays out the information provided for both feasibility and auditability. Then the assessor claims that they are inadequate, only asking for \"clearer objectives\". The objectives are clear, and will be easily measurable, and auditable."}, {"id": 1063, "q0": "Although I was unable to find sufficient information in the Impact section, by looking at the attached whitepaper, I feel that I have been able to understand and analyse the intent behind this project better.\nFor context, the idea being proposed is that: Artists will be able to stream their music on any of the popular platforms - Spotify, Apple Music etc. And they can choose to have their income, in the form of streaming royalties, fractionalised through the power of NFTs and Plutus smart contracts that will act as a legal contract between the artist and anyone who will buy one of the fractionalised assets. For this step to be conforming to US regulations, the Newm platform will need to implement a solid KYC process for the artists and for anyone who wants to move their assets from the platform.\nI think that the entire Newm project, not just this specific proposal, has great potential and can see how it will positively impact the Cardano ecosystem if it gets enough attention. So, from this perspective, I highly agree with the first part of the proposal.", "q0r": 5, "q1": "The team has identified 6 stages on the roadmap for this part of the project dealing with KYC. I appreciate how for each important step, they slow down and take the time to analyse if the identified potential partners are on track with what they intend to achieve. From my experience of hiring people and finding partners, the time allocated in deciding whether the people you will be working with are the right ones, is one of the most important steps in a start-up, as a bad decision could potentially bring everything down.\nUnfortunately, on the budget side, the team has not taken the time to get into any kind of details. I am unable to identify if the budget asked is feasible or not. There are 3 sums allocated to 3 categories, but without any hours of work, hourly rate or fixed fees described.\nBut, when looking at the team, I can say that they seem to have done an amazing job at finding so many talented individuals with such a large palette of skills. I don’t see any missing skill amongst them and I have no doubt that they are the right people to bring this project forward.", "q1r": 4, "q2": "When reading the answer from the project’s progress question, I couldn’t rightly understand what the proposers mean when they say “the default rate during the KYC process.” Since the answer provided is very short, I could not find another piece of information that would have helped me better understand it. Otherwise, with the first part of the answer, the number of minted IP rights, I must say I find it to be a good metric, as it’s also one that can be verified on-chain and therefore always public.\nMoving on, when looking at the concise team’s perspective on their success, I do not necessarily see further examples of success than what they have already provided. What I would have found to be more relevant, though, were some hard figures behind this success — the number of seamless KYC checks that would mean that the project produced favourable results. Would it be 100? 1000?\nOverall, even though the answers were very short, I generally agree with them; hence, I rate the auditability section with a 4.", "q2r": 4, "assessor": "z_assessor_2192", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2973, "q0": "This proposal properly addresses the challenge setting. The challenge setting rightly articulates the difficulties of legal compliance for new projects. The funding request for this project directly addresses a legal requirement, Know Your Customer, in the specific context of how the business operates, and where its legal exposure is most prevalent. ", "q0r": 5, "q1": "This team is highly knowledgable. As listed they have over 60 years of development expertise, with Andrew Westberg as their lead developer. Andrew's contributions to the ecosystem are well known and he is highly capable as a developer. The legal team in question is also exemplary. Robert Stewart was the NYSE Euronext Chief Counsel for Intellectual property, and currently operates an IP focused law firm. The finished result from this team is highly likely to meet the objectives and goals that they state in the proposal, which will facilitate a traceable method for knowing that an artist is due royalties, and the person in contact with NEWM matches the appropriate party.", "q1r": 5, "q2": "This proposal lays out a reasonable set of steps to achieve the stated goal. Their ability to track KYCs of parties, and their ability to track minted rights on to the block chain will enable metrics that can be properly tracked to prove a successful implementation. It will be easy to track the new hire listed in the proposal as well. The NEWM team members are all listed on their website. Once the new hire is made, an update to their website referencing this person will be sufficient evidence for that portion of the project.", "q2r": 5, "assessor": "z_assessor_2376", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9028, "q0": "This project seeks to create a kind of DID but less anonymous so that the artists who use their platform will be able to be identified as the proper digital rights owner. This sort of system could improve other apps who wrestle with similar issues surrounding Know Your Customer (KYC). The impact though, would be limited to just this project and website. This is a legal and financial issue, and could potentially create a useful blueprint for other projects to follow, but that is not explicitly stated in the proposal. There will be legal compliance and other checks, so I imagine the team would be willing to share their experience upon completion, but that is not a guarantee. ", "q0r": 4, "q1": "The team has sufficient skill to complete this project, but as it stands, the proposal lacks sufficient clarity to determine feasibility. The time table looks right, but it is missing clarity and additional detail to really evaluate. The budget is not consistent in the proposal, and it is broken into three large vague categories. This would need to be edited and re-submitted for this proposal to be considered complete and deserving of a higher feasibility score.", "q1r": 3, "q2": "The proposal is clear in what it is trying to solve and in how it wants to accomplish that, but is short on details how it will do the work. Likewise, the auditibility is minimal. There is no attempt to detail reporting, or public accountability. There are metrics of success which would be a good measure of the overall effectiveness of the proposal. There is also an end goal that would sound like a completed solution. Overall, this is a good objective, but it is not sufficiently clear to be able to rate it higher. \n", "q2r": 3, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "Assessor is showing bias and inconsistent reasoning. \"Team has sufficient skill to complete this project\" yet \"lacks sufficient clarity to determine feasibility\". If the team has sufficient skill to complete, then the project is feasible."}], "solution": "We must offer a Know Your Customer solution to alleviate the lack of identity and allow seamless verification of artists credentials.", "experience": "Andrew Westberg (Creator of Phyrhose, JorManager, PoolPerks, etc) leads our dev team with over 60 cumulative years of professional experience. Our legal team has over 25 years of legal experience."}