{"id": 419399, "author": "javiersv", "title": "Cardano4Charities", "url": "https://cardano.ideascale.com/a/dtd/419399-48088", "category": 26596, "amount": 8000, "description": "Every day, more financial power is transferred from the traditional fiat rails into the cryptoverse. Currently, many use-cases for money are not available for crypto users, e.g. donations to NGOs.", "f6_no_assessments": 8, "f6_rating": 3.583333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 7166, "q0": "The idea itself is very good and seems to be useful for the Cardano ecosystem as a whole but I think it doesn’t fit into the goals of this challenge. It is about spending time educating the important NGOs and charities in crypto tools, mechanics and general infrastructure, including teaching them how to set up their own (non-custodial) wallets and receive, and make transfers of crypto assets. The idea, as the authors point out, will focus on the adoption of Cardano infrastructure (Cardano wallets, ADA on- and off-ramps, etc.). I found it very interesting how donors can benefit from financial advantages by making crypto donations as it allows the donor to claim a fair market value charitable deduction, and also the idea that contributes at least half of the funds raised by this proposal to the charities that adopt Cardano infrastructure and start accepting ADA (and other CNAs) donations. Even so, I didn’t think that the proposal aligns well with the objectives of the challenge because it fits better with the challenge of crypto education. Therefore, I believe that in terms of impact, the proposal does not fit this challenge, although I think it’s still a very good idea.", "q0r": 3, "q1": "The feasibility of this project is low, we were able to understand in general what would be done. We have a roadmap, which lists the activities that would need to be developed for the project to become a reality in 5 months. But at the same time, it lacks a lot of detail. It is said the setting up meetings with all the NGOs, foundations, and charitable organisations, setting up in-person meetings,… but we don’t know how many meetings would take place, where would they be, who would expose the content, etc. In the last month of the project, the proponents point out that they will contribute at least half of the funds raised by the proposal to the NGOs and charities that effectively adopt Cardano tools and infrastructure. Why would it take so long?  And the milestone that “ensuring practical adoption of crypto infrastructure by the NGOs, foundations and charitable organisations”, how could they measure the “practical adoption” metric? I think it would be necessary for proponents to break the timeline into smaller scales and to provide more detail for each of the activities. Talking about the budget, an 8 thousand dollars is requested, which was divided into 2 parts but these are not explained clearly. For example, we know that “at least 50% of the funds will be used to make crypto donations to the NGOs and charitable organisations that take our courses and participate in our sessions”. Do we really need to do that? Why we don’t use all of the fund to develop the project to improve their general knowledge of crypto? It is said that this donation aims to encourage NGOs and charitable organisations to adopt and help with familiarization, but it doesn’t seem like a good idea for me. Secondly, the team says “the remaining funds will be used to cover all the expenses required for the successful implementation of the proposal, as set out in the steps plan described above...” The information is said very superficially. We don’t know how the budget would be used clearly, who would do them, in what order, and why? How is their work routine? How many hours per week they would dedicate to the project? The price of their work, etc. Finally, regarding the team, we are informed in a very detailed way about who is involved, their names, their careers, and previous experiences… but it would be essential to know their CVs, LinkedIn profiles, and how they relate to Cardano. Overall, I think the whole topic needs improvement.", "q1r": 2, "q2": "The measurement of progress would be based on 3 indicators, consisting of a list of all the NGOs and charitable organisations they reach out to, the sessions and courses they hold with them, and the donations of the funds. I think they are sufficient for us to monitor the progress of activities, but I think that’s the basics. In addition, to know if it is essential for charity, we also need to know how the NGOs and charitable organisations understand crypto tools, mechanics, and general infrastructure, what impacts were generated for Cardano, and how this can be measured directly. In addition, I also would like the proponents to make it clear how such information would reach the members of the Cardano community. Talking about the final results, the proponents are based only on the completion of the project but not do think about the consequences for Cardano. It is not thought how the reflection of this would be measured in Cardano. So I think this part could still improve.", "q2r": 3, "assessor": "z_assessor_2879", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 35, "q0": "This elegantly conceived and well-written proposal would add value to the Cardano ecosystem by encouraging adoption of the technology and token by a NGOs and their donors. The metrics and goals are clear. The project is sustainable because after the initial investment of time and energy has occurred to get the NGOs to accept donations, little further effort will be needed to support future donations. The only reason to score this proposal a 4 rather than a 5 is due to the lack of connection to the challenge. The challenge calls for “building effective solutions to explore and provide legal & financial services and support to funded Proposers.” Nothing in this proposal would achieve those objects, and the proposers would have been better served by finding a different challenge and explaining the fit.  ", "q0r": 4, "q1": "The proposal lists the full names of the two proposers, but does not provide LinkedIn links. I could guess at the profile for Javeir Sanchez Valiente, but was less certain I found Ines Alfaro on LinkedIn. The proposers state that they have strong connections to NGOs, but it is difficult to verify this information in the absence of public details. The budget amount request (8,000) is not that high, so I only deducted one point as a result of the missing CV info. The project is very straight forward and described in an organized and easy to understand way that gives significant confidence that it will be implemented as designed. One potential risk might have been the lack of doners willing to send ADA to any onboarding NGOs. The proposers have solved this by pledging to donate some of the funds they receive to any NGOs are that agree to accept ADA. ", "q1r": 4, "q2": "The proposers provide a good road map, which contains both key milestones and a timeline. The audit method of creating a spreadsheet to track meeting dates, onboarded NGOs, and funds transferred would be clear and easy for the community to understand. The proposers could even use their reporting and the transparency of Project Catalyst as a marketing tool in their conversations with NGOs. Any organization that joins their project will get a lot of exposure to the Cardano community who might then want to donate more ADA. ", "q2r": 5, "assessor": "z_assessor_2030", "no_vca": 24, "ne": 7, "ng": 15, "nfo": 2, "vca_o": 1}, {"id": 1067, "q0": "This year, due to the terrible war in Ukraine, the Cardano community has been more active in organising donation campaigns to support their cause. But finding NGOs willing to accept donations in crypto, and even more so, in ADA, was not an easy task. Therefore, I find the idea behind this proposal to be coming at a perfect time, now that crypto is gaining some traction and the people holding crypto are willing to donate some of their funds for noble causes. As the proposal mentions, the transparency that is at the base of blockchain is what would make the adoption of crypto by both donors and serious NGOs even more appealing.\nAnd I highly appreciate the fact, that half of the funds requested for this proposal - which are quite low, in my opinion - would be donated to NGOs that will adopt ADA and thus get them started on a future path.\nOverall, I find the proposal to be solving an important issue, that could potentially impact not just the Cardano community, but the lives of those who need it most, as well.", "q0r": 5, "q1": "I find the plan presented to be very comprehensive, with a clear timeframe provided. I find that both the steps to be implemented, as well as the period of time approximated to be well planned.\nHalf of the budget - $4000 - will be donated to some of the NGOs who will be accepting payments in ADA. But the remaining half of it doesn’t contain a clear description of what it will be used for, except that it will “cover all the expenses “. Which I do not doubt, of course, but what are those expenses? The team should have provided us with clear information about the costs they will incur, as to help us better judge if the budget was well-drafted. For example, what would happen if the expenses will be higher than the team anticipated? Will the team stop their work on it or will they continue and pay out of their pockets?\nWhen looking at the team description field, I notice that we have been provided with two names and a brief description of the experience related to the needs of this proposal. According to it, the proposers seem to have the knowledge and relations needed to successfully implement the proposal. What I would have hoped for, was a way to objectively verify their skills, like perhaps a LinkedIn profile link, a website etc. \nConsidering the information provided, I will rate this section a 4, as some of the missing details are important in assessing the proposal.", "q1r": 4, "q2": "I find the progress tracking to be reasonable, considering the tasks at hand. An excel sheet should suffice in recording the contacted NGOs and filtering them based on the answer provided. Obviously, they have noted that all the transactions will be on blockchain, to offer transparency in regards to the destination of the donation half of the budget.\nThe success definition is also very reasonable, and possibly feasible. Having 4 or 5 major NGOs adopt Cardano would be a great deal, and considering the fact that the team is located in Spain, makes me confident that they have the possibility to personally contact several large organisations.\nTherefore, I find the auditability section to contain the information needed for a proper assessment, as such I agree that the proposal can be well evaluated.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4981, "q0": "The focus of this proposal is on making crypto assets accessible to charitable organizations and NOT geared towards providing legal and financial support to funded proposers or Catalyst related projects. The idea is although good, however, I would like to suggest this is more tailored towards the challenge purpose of providing legal and financial services support for funded proposers to effectively implement ideas without legal and financial setbacks. It's a good thing to make donations in crypto to NGOs and this puts the idea more on adoption and use-cases, which would've been better if submitted under DAOs or Cross-Chain categories in order to leverage Blockchain stakeholders and resources through Catalyst and Cardano to provide funding support in forms of donations to these charitable organizations. ", "q0r": 2, "q1": "Firstly, I think a 2-member is enough to work on this proposal. The skills and experience is really insufficient especially regarding working with charities. I am not able to find target location of NGOs or which country will the proposal be implemented. I think the team should include more specifics information to the idea for more clarity and better understanding. \n\nThe milestone and timeline should be more CLEAR and specific. at least, indicate which month (s) in 2022 the proposal will be implemented and when will be the end date of implementation. This will give voters and assessors more information on what actually this proposal seeks to do, how to do it and at what period of time. A second look or some modification should be done on the proposal and align the aims to match with the challenge goal and success metrics. ", "q1r": 3, "q2": "For AUDITABLITY, the proposal needs to be more apt on success metrics that relates to the challenge category - Legal & Financial Implementation for funded proposers. As indicated in impact criteria, the proposal really seemingly would not fit in this challenge since it overlooked its contribution to providing legal or finance service that would help funded proposers to freely implement ideas in their respective countries and organisations without legal wars. \n\nThe team should include how it will report progress and success to Catalyst especially in a more online manager since Catalyst operates in a virtual world of Cardanonians and Catalysts. This will ensure transparency, accountability and capacity of team to manage the requested funding and achieve the proposal idea towards achieving challenge goal. ", "q2r": 1, "assessor": "z_assessor_2650", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 5676, "q0": "The proposer clearly identifies a existing problem that need to be addressed. Scaling up the adoption of Cardano blockchain requires that Cardano establishes its presence in every sector. Therefore, to have a presence in the charity industry is a great initiative. The end goal here is to provide educational engagement to most important NGOs and charitable organizations on crypto tools and to encourage and facilitate the adoption and acceptance of crypto donation by these NGOs and charity organisations. Does this satisfy the legal and financial implementation challenge setting? Given the model setup for this project, it possible to advance the adoption of this initiative if implemented elsewhere across the world. Hence this proposal address the challenge. Therefore, I think this could be a future reference point and springboard to scale up the adoption of the Cardano Network on a large scale. I suggest the team outline a long term plan to sustain this project.\n", "q0r": 4, "q1": "Based on my preview of the feasibility, I think the information provided could be improved. To start with, the budget lacks the needed breakdown and details required. For instance, the proposer tells us that half of the budget would go to charity but I prefer he gives us the details of this allocation. How much would each charity NGO or charity organization receive? I suggest the team gives us more clarity here. Again, by the budget we see that the proposer doesn't tell us what the other half of the budget would be used for. In my view, I  envisage that this project would require budget allocation for items like educational content, event space (education), miscellaneous and team cost if possible. Therefore the team could include these items and provide information on the cost for these items. Aside that, I am satisfied with the roadmap, it presents detailed description of what the team intend to do within a specific timeframe. Additionally, the team presented for this project have a background relevant to the project. Already both team members have work experience with charity organization and NGO. But I prefer the propose gives references or links that support the profile of the team.\n\n", "q1r": 4, "q2": "The information presented for auditability is not sufficient. The proposer presents a clear framework of the milestones required at each stage of the roadmap. In respect of that, the proposer presents a detailed approach to record data on these milestones in an excel sheet. However, we are not told whether the data collected would be made available to the community. Per the objective of the project  —\"to have at least 4 or 5 major NGOs or charitable organizations adopt relevant Cardano infrastructure tools, such as wallets (Daedalus, Lace, Nami, Eternl, etc.) and fiat on- and off-ramps (e.g. accounts in centralized exchanges and experience with decentralized exchanges), and start accepting crypto (and, particularly, ADA and other CNAs) donations from the public\", I entreat the team to restructure their KPIs to include, the number of NGOs that adopt relevant Cardano infrastructure tools and the number of NGOs that start accepting crypto (ADA) as donations. These parameters gives a clearer perspective of how the progress and success of the project can be audited.\n", "q2r": 3, "assessor": "z_assessor_2734", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8899, "q0": "There are lot of people who fear to transact  through crypto since its unstable many a times ,hence bringing in charity concept with crypto will be big boost for both NGO's and Donor's , here NGO's can also hold these crypto coins for long time and can sell at best time to get the maximum profit, and Donor's also will be exempted from tax deduction where entire money will reach to the NGO's instead of Govt or other ruling parties involved in Financial aids, with NGO's holding these coin for long time there brings stability in crypto hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed task doesn't have many risks involved and not difficult to task to complete , finding a genuine NGO's will not be a difficult task, the only task here is making NGO's understand the real value of crypto and its futuristic ideas so that these NGO's will not sell their crypto immediately after funding is completed, The task of making them understand also needs a good speaker the proposer has failed to explain who'll be holding the responsibility of achieving that other than that plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has failed to explain who'll be communicating with NGO's and how they are going to make these NGO's understand how to use crypto wallets ,to achieve this some\nsession needs to be taken for all the NGO's, other than this, it has clear idea of timeline of the project and proposer could have elaborated over his budget breakdown still more efficiently, the proposed plan has proper key indicators for completion of project hence the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9030, "q0": "This proposal would increase the financial usefulness of cryptocurrency by seeking to bring more non-profits, NGOs, and charitable foundations to Cardano. In doing this, Cardano could see increased financial usage as people are able to donate ADA to their favorite charity, or NGO. This could be a very beneficial project, especially as the proposer plans to make in-person demonstrations, thereby increasing the likelihood of uptake. ", "q0r": 4, "q1": "This is a completely feasible proposal. The team plans to develop a list of charities and reach out to them face to face. He has experience and is connected to some currently. He will demo how to take advantage of Cardano and then make donations to them. This seems completely feasible. ", "q1r": 5, "q2": "This is a simple proposal with a clear and compelling vision. The auditability is there with a spreadsheet of every NGO contantacted and data related to that. This will be made public. In the end the goal is to see just 4-5 major NGOs or charities adopt even just a Caradano wallet where they could begin to receive donations. This could be a major turning point in seeing increased adoption of the Cardano system, The budget is relatively small and this seems like a worthwhile effort. Small price for a big potential success. ", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 14074, "q0": "This proposal sets out to educate NGOs about blockchain and especially the potential benefits of accepting and encouraging donations via crypto currency. As someone with experience in the NGO field, I know the proposers are right when highlighting that many NGOs have a bad reputation of misspending their funds or not being transparent enough. Blockchain technology could surely help with the latter, though surely not the former. \nNoble as the idea might be, I’m sorry to say that the proposal makes it difficult to see too much alignment with the challenges set out in this category because the solution they propose does not seem to provide the financial and legal services to support other emerging Projects in the Catalyst Ecosystem. What they are proposing, instead is to raise awareness amongst NGOs on crypto and use some of the funds themselves as donations – in an attempt to nudge NGOs to accepting ADA donation. This will, probably, make more people outside the blockchain familiar with Cardano, but the actual impact is very difficult to foresee or evaluate. \nThe proposers offer a 6 point plan of implementation which contains, among other things making up a list of NGOs to contact, setting up initial meetings with them and offering practical support to NGOs in adopting blockchain solutions and, in the end, donating half of the funding itself. \nThe plan, however, does not contain any KPIs. How many NGOs will the list contain? What are the criteria used to select them? For eg, the 2 proposers are part of NGOs in Spain. Should we assume that they will start with those organizations? \nThe timeline is a rough one and one has to do the math to realize that this can be 5 month long programme, though that is quite unclear. \nSo, I’m sadden to say that I do not believe the proposal meets the impact criteria. \n", "q0r": 2, "q1": "This is a small team, made up of 2 people, which is realistic as a core team for the proposal they and they mention having experience in the NGO area the legal area and 2 years in crypto. I wish they would have added their LinkedIn profiles or specific details on their NGO and legal advisor experience, as this information cannot be checked and is very scarce\nAgain, as I said previously, the idea in itself  is not bad, but there are quite a few aspects which are completely outside the proposers’ control and it is difficult to see how the implementation would work. We do not know how they plan to choose the NGOs and then they plan 2 weeks of basically called calling (though via email). With no numbers, it is hard to understand what that really means. \nOne of the steps of the implementation plan is to deliver ‘short educative coursed on crypto infrastructure’ but they do not plot any time for the development of these course. They also do not say who will design them, though I would assume it’s the two proposers themselves. \nIn step 5 of their plan, they mention “ensuring practical adoption of crypto infrastructure’ by NGOs they will have given courses to. Though that is an ideal desired outcome, it is hard to establish a  direct link between that and he proposal itself, because that depends on other factors, outside of the proposers’ control. \nThere is, literally, not explanation of the budget and no details on how the proposers came up with that amount.\nThe only KPI mention is the one under how success will look like, where they hope to get ‘at least 4 or 5 major NGOs to adopt Cardano infrastructure tools.  \n", "q1r": 2, "q2": "In the absence of any real KPIs I believe it would be very hard to track progress. The proposers mention an excel sheet of the NGOs they would reach out to and of the courses they would deliver, but they give no benchmark for any of those. \nI’m afraid that I have to give a rather low score on this as well. \nOverall, this is not a project I believe can be successfully implemented. \n", "q2r": 2, "assessor": "z_assessor_3891", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "We will reach out to the most important NGOs and charitable organisations to educate them in crypto tools and adoption to encourage acceptance of crypto donations, benefiting donors and organisations.", "experience": "We are a team of 2 with c. 2 years of experience in crypto (as users, investors, members of communities, voters, etc.) and with experience in legal practice. We have worked with several NGOs and charitable organisations in the past, both as volunteers and legal advisers."}