{"id": 420545, "author": "npaquoc87", "title": "Legal & Financial Consulting Hub", "url": "https://cardano.ideascale.com/a/dtd/420545-48088", "category": 26596, "amount": 42336, "description": "Currently Funded Proposals need the advise about the legal and finance & accounting. However, there is lacking of financial and legal experts who have knowledge and practical experience on blockchain.", "f6_no_assessments": 13, "f6_rating": 4.3589743589743595, "videos": [], "media": [], "f6_assessments": [{"id": 7170, "q0": "I think the idea is very good and necessary, and theoretically fits well with the objectives of this challenge. The proponents intend to create online courses attracting legal and financial employees of Funded Proposals as well as the financial and legal experts who are interested in blockchain. The course contents will cover the basis of blockchain technology and Cardano Blockchain, the overall financial and legal framework for blockchain, challenges, and issues faced by blockchain start-ups as well as the solutions for such challenges and issues. The proposal is very beneficial for Vietnam, as it will act in the blockchain education in that country. I think the proposal has everything to work out, because it’s an ongoing project, and the team has already shown preparation and determination to fulfill the mission of teaching Cardano to others. Therefore, I think that the impact of this proposal has the potential to be maximum, deserving 5 stars.", "q0r": 5, "q1": "The feasibility of the project is quite simple to understand and very detailed. The proponents provide us with all information we need to know what would happen, when, how, for how much money and who would be involved in it. First, regarding the script, the month in which the project would be developing are informed: October, November, and December. We know exactly what online courses were going to take place in each of these periods, so we have a great understanding of the process to come. So the script part is fine. Now speaking of the budget, the requested money ($42336) would be divided into 5 parts in very detail: 3 content courses, marketing activities, and financial & legal retainer services. Besides that, they also add 5% on top of the proposed budget for the reserve fund to avoid the price fluctuation risk. That already allows us to have a very good understanding of how the requested funding would be used. Even in terms of working hours, we know how much each small part of the whole would cost, and how much time to perform each task would cost, that is, I think this part of the budget is very well explained as well. Finally, the team presents its members in a very complete and detailed way. For example, we know their names, and main functions, attached a series of profiles of the social network, including LinkedIn and Telegram, that is, we have a way to prove what is being said, and finally a small (but satisfactory) explanation of what they have been doing. Apparently, it is a very well team that is fully capable of carrying out this project successfully. in summary, the feasibility of the project is very good.", "q1r": 5, "q2": "I think this project is highly auditable because the proposers clearly explain how the monitoring of both success and partial results would be done, but there is room for improvement. All data presented as process auditability are about numbers. This works for us to understand how big the project is becoming, but I don’t think it’s enough for us to measure the human impact of the thing. It would be interesting to promote those online courses in the selected areas to understand: did the project have a positive impact on the Cardano community in Vietnam? Has people’s project been changed for the good? Did it help needy communities to support themselves better? etc… I believe the analysis here needs to be more human than numerical. Now speaking of the final results, we have many direct indicators: course video uploaded on youtube channel, Youtube channel reaches 500 subscribers after 6 months; uplevel fanpage reach 1.000 liked after 6 months; Telegram/Zalo channel reach 200 people joining after 6 months; 5 funded proposals were supported and share feedback, the feedback will be shared publicly via our social channel. I think it would be necessary to understand the impact of these cleanings on communities, if they were positively affected, what changes were observed, how people started to improve their proposals, in what way this all benefited the Cardano ecosystem, etc. It would be necessary for all this data to be gathered in a final report and that this is be sent either via any platform already used by the community. Overall, I think the auditability is very good, but it can improve in some points to make it perfect.", "q2r": 5, "assessor": "z_assessor_2879", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 14250, "q0": "This is a proposal that has a positive impact on the challenge. This proposal provides a course for legal and financial professionals on issues facing blockchain startups and provides legal and financial advisory services. The proposal posed the right problem for Challenge. Specifically, the proposal will address 2 questions of the challenge: training financial and legal professionals to provide legal and financial services to sponsored proposers. It can be seen that their goal is broader than Challenge's requirements, not only providing legal and financial consulting services for funded projects, but this proposal will also provide legal consulting services and financing for all funded and unfunded blockchain startups. This is a proposal that has a positive impact on the Cardano community because it helps to increase the number of communities, the quality of the community with financial legal expertise, and ensure that the projects are funded. Cardano is fully legal and operates legally. I appreciate the proposal that has a specific implementation plan and appropriate arguments. The course content will cover the following: the basis of blockchain technology and Cardano Blockchain; an overview of the financial and legal framework for blockchain; the challenges and problems that blockchain startups face; and the solutions to those challenges and problems. These are the most fundamental issues for a blockchain startup. The proposal presents two risks: 1/The risk of language barrier: they are not really fluent in English, so Fund 9 will focus on advising on Vietnam's Sponsored Proposals and training the Vietnamese legal and financial experts to establish the Vietnam Financial and Legal Advisory Center. 2/The risk of a low ADA price. Solutions to overcome two risks 1/In the next phase (Fund 10), cooperate with colleagues in other countries to create a Global Financial and Legal Advisory Center. 2/Add 5% above the proposed budget for the reserve fund to avoid the risk of ADA price fluctuations. I agree with the risks and solutions proposed. However, in my opinion, the proposal may face some other risks: 1/Risk of shortage of human resources: the proposal has not yet issued a survey report on the list of financial legal staff who are interested in this field. There are no options for communication and marketing to attract legal and financial staff to participate in the courses. It is suggested that there should be seminars, links with law firms, financial companies, Vietnam bar associations, etc., to introduce the blockchain field and job opportunities in order to attract potential employees. At the same time, cooperate with universities to disseminate knowledge and information to students. This is a potential human resource in the future. 2/Risks about the quality of training experts. The proposal did not mention the speakers/experts of the courses. Who are they? It is recommended to publicize the list of speakers/experts at the course to ensure transparency and quality of the course. 3/Risk of course quality. The proposal will provide teaching videos instead of online courses with experts. Will it hinder the interaction between learners and experts? It is recommended to organize online courses and have video recordings posted on the website. Blockchain is a new field that requires more interaction with experts for legal and financial staff to ensure quality. Some additional comments the proposal has not yet provided a plan to control the quality and qualifications of legal and financial staff. Training through creating educational video clips instead of holding an online class makes it impossible to know if an employee is attending or not. And when there are too many proposed employees, what are the best practices for blockchain startups to evaluate qualifications to select the right legal and financial staff? This is a good proposal, there are only a few points for improvement. And this is only a proposal for funded projects in Vietnam, I hope the proposal will expand its scope and reach to other countries.", "q0r": 4, "q1": "I appreciate the planned proposal and the clear implementation roadmap. The proposal identifies two project timelines: Following the completion of educational video clips within 3 months of funding, the provision of legal services and financial retention for 5 sponsored proposals over the next 3 months follow. The proposal timeline is pretty good. However, the proposal has not set a target number of legal staff or qualified financial staff with professional qualifications to provide legal and financial services for the five sponsored proposals. People can check the progress of the project. The measure of the success of the project depends on YouTube views, dwell time, engagement rate, and number of subscribers. Every month, these metrics are compared. I believe these figures only reflect a part of the success of the project. Our goal is that the 5 funded proposals will be provided with legal and financial services. The proposal has a solution. Will that problem be solved or not, and how is the quality of the service? In addition, we are also interested in the qualifications of the legal and financial staff after they are trained. Are they really potential employees who can solve legal and financial problems for future projects? About the budget: The fundraising budget of the proposal accounts for more than 8% of the total challenge. Budget proposal: $40,320 for project team and communication, and $2,016 for risk management. The price of ADA may completely decrease in the future or the project will incur some costs. It is recommended to have an additional budget plan of $2,016 (5% of the total funding budget of the proposal). Their group consists of 3 members. Give the team compliments because all members have the members' experiences that match the proposed tasks. We can easily verify the identities of members on LinkedIn and Telegram channels. All members have professional qualifications and work experience relevant to the job. However, unfortunately, the proposal has not assigned specific tasks to each member. As mentioned in section A, providing instructional videos is not really effective and ensures maximum training quality for legal and financial staff. It is suggested that the online teaching option should be considered instead of just using video lectures. In addition, the proposal has not yet provided an option to select five proposals funded in Vietnam to provide legal and financial support services. The question here is, what is the criteria for selecting five sponsored proposals in Vietnam to provide the service? Who will provide legal and financial support for the five funded proposals? Your group or learners? Is there a mechanism to ensure the quality of consulting services? I appreciate the feasibility of the proposal. This could completely become a potential project in the future. Just keep in mind some of the issues above.", "q1r": 4, "q2": "The goal of the proposal is clear. This project will be successful when: learners have access to a rich source of video lectures; 5 sponsored proposals have been supported and shared with positive feedback; their feedback will be shared publicly via social media channels. As can be seen, the implementation process and results of the project are easy to check. However, to make the project more prestigious, I suggest that it should have a directory of legal and financial staff taking courses and be able to use quality tests. This directory will be the source of potential future workforce providing efficient financial and legal services to funded proposals and blockchain startups. At the same time, in the next phase, the projects that will be funded in Fund 9 will be surveyed to know that Vietnam's funded projects are having legal and financial problems. Anyway, I believe this will be a very beneficial source of information for the project to develop in the right direction. The project will have a positive impact on the funded projects in particular, the legal and financial staff, and the Cardano Vietnam community in general. It will provide knowledge and job opportunities for legal and financial staff in Vietnam. Build up potential talent connected with funded projects and blockchain startups. The publicly posted course video recordings are a useful resource for Vietnamese and global students, financial legal staff, and project developers. The success of the project is entirely related to the challenge, which will provide human resources to solve legal and financial problems and develop the Cardano ecosystem. This is a new project, and there is no test product yet. To develop blockchain human resources in Vietnam, the project must be expanded and popularized among students at legal and financial training universities. I appreciate the transparency of the project. It would be more perfect if it improved some points.", "q2r": 4, "assessor": "z_assessor_3950", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1845, "q0": "This proposal addresses the challenge perfectly by providing legal and financial solution via video education including advisory services to the Cardano Catalyst community that are funded. Their target audience for this proposal is the Vietnamese community. They can scale slowly globally as they provide the education videos and services in English as well. The team do plan working together with the Community globally as well after they finished with this project. They have stated the risks in their proposal but those are minor risks. What I think that could be major risk is the laws & taxes about cryptocurrencies is not enough or solid enough in the Vietnam. Possible solution is to be updated their country’s laws and have regular updates on their education videos.  ", "q0r": 5, "q1": "The team have plenty of experience in the legal and financial sectors which have the credibility to execute this project. They have provided the project timeline and milestones which is practically achievable in the timeframe of 6 months. As far as for the budget, they have broken down where the funds are allocated. I have checked lawyer fees, accountants’ rates, medical fees, travelling expenses, and inflation rate in Vietnam and the requested budget is reasonable. The success rate for this project is high as they will be providing basic legal and financial video education including small services. ", "q1r": 5, "q2": "The team have broken down what and how the community can audit their progress and success. By having the number of subscribers in Youtube, number of users in Uplevel Fanpage and number of users in Telegram. They also will have client feedback forms which will be shared publicly for those who used their product and services. This is auditable and will increase their credibility and trust within the Cardano community on their expertise. ", "q2r": 4, "assessor": "z_assessor_2274", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2955, "q0": "The problem statement actually addresses the challenge needs in helping to create solutions to help resolve legal and financial issues faced by the funded projects. The teams look to develop educational courses to help financial and legal experts understand the ecosystem to help with advisory services. This project will have a significant impact on the Cardano ecosystem with great added value. This proposal has a good KPI on the impact and uses case whereby it looks to be useful to the funded projects as a vital need in this challenge by educating financial and legal experts in the field of the blockchain ecosystem to help them provide a needed advisory role to the funded projects. This project will also have a significant impact on an already funded project because it can be mutual to the funded project as the challenge request.", "q0r": 5, "q1": "The team is made up of experience in the area of blockchain educators, financial and legal experts in the blockchain industry and already funded proposals owners with an experience in the catalyst project workflow. I personally have verified their skills on their personal profiles in their provided links and am much impressed with their experiences and skills. My little issue has to do with their budget fund which is $42336, although there have been provisional details on the breakdown of the budget. I feel their hourly charges are on the high side and will be very grateful if the team will have a second look at their budget.\nThe team has provided a brief detailed plan that looks at their goals like creating their educational clips and providing legal and financial retainer services for 5 funded proposals on a pro-bono basis. Their timeline also looks at 3 months from the funded date which addresses the completion of the educational clips and a detailed timeline of video clips. The following 3 months also cover providing legal and financial retainer for 5 funded proposals.", "q1r": 4, "q2": "The provision of sufficient information by the team to help the catalyst community have an idea of the progress and success has been provided. Reviewing the budget as a point of audit interest in every proposal, I think the budget looks on the high side and suggested a review of the per hour charges that have been assigned to some categories. The Key performance indicators have been well stated and aligned to the challenge needs, for instance, the use case of this project to other already funded projects and the impact of this proposal on other already funded projects which looks mutualistic. In my view, the KPIs provided can actually be used to quantify the success of this project. I will also personally urge the team leader of this project to also have good auditing of their expenditure and ensure that funds are really allocated to the specific cost center.", "q2r": 4, "assessor": "z_assessor_2371", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4893, "q0": "The proposal aims to create and provide free education courses for financial and legal experts who the proposer recognises their lack of knowledge and practical experience on Blockchain. In addition, the proposers also provide retainer services for the Catalyst funded proposers free of charge.\n\nThe proposal team consists of Blockchain educators, funded proposal owners, financial and legal experts who work in Blockchain start-ups.\n\nThe requested fund is USD42336.\n\nThe education course also targets financial and legal practitioners in other industries so as to attract more of these experts into the field of Blockchain providing the required services.\n\nThe proposal has considered the cultural environment it is in. The team members are Vietnamese. They speak English. For the course materials, they are conducted in Vietnamese with English subtitles and in the initial stage to first set up a pool of Vietnamese financial and legal experts with this project.\n\nIt also considered the financial impact negatively on the budget due to the current market situation. To overcome this, they have included a buffer of 5% over the budget as reserve.\n\nI see that this proposal fits in the challenge goals and it is also in line of the campaign objectives. The funded proposal owners would have access to the financial and legal advice and opinion in carrying out their funded projects.\n\nWith this I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposal has a plan to start the project upon the funded date of fund 9 to create education videos and to provide legal and financial services for 5 funded proposals.\n\nThese activities will spread over 6 months after funding.\n\nThe proposal team consists of three members who by their professions and experience are related to the financial and legal field. However I failed to see the specific allocation of the tasks among the members in their plan. I also failed to see the work involved in the translation into Vietnamese, as this is their initial stage to focus on the Vietnamese financial and legal hub; neither do I see the related  cost provision in the budget. Furthermore, the project manager, Mr Quoc Nguyen has two other proposals in his hand although they are farming out filming, design and marketing service. These factors as I see it would hinder their implementation of the program.\n\nWith the above reservations I would settle for a rating of 3 to agree nor disagree that it is highly likely this proposal will be implemented successfully.", "q1r": 3, "q2": "The proposal provides the KPIs and the goals with timelines for reporting. The KPIs are relevant to measure the success as far as general audiences are concerned. Please see below the doubt I have on the use of these metrics for specific audiences.\n\nThe proposal is targeting the financial and legal experts and at the initial stage to bring in the Vietnamese speaking professionals into this Cardano Blockchain ecosystem. Bearing in mind this objective, the measure of project progress should reflect this requirement. I have difficulty understanding how the proposed KPI ensures the objective is met. Subscribers, views and likes may come from the general audience, not necessarily those from the financial and legal sector.\n\nIn view of the above I have reservations and therefore I neither agree nor disagree the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 3, "assessor": "z_assessor_2631", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 7691, "q0": "This is a proposal that comes to provide a solution to project proposers on cardano catalyst by giving them online coaching as soon as they receive funding or before submitting proposition. The project seems partient because many of the members who submit projects seem for the majority not to know about financial management, budgeting, administrative and legal aspects for the implementation of their project solution. With consultation from experts in the above fields and having experience on blockchain, this project provides a solution to the challenges faced by members of the community. With the establishment of a platform and online consultancy courses, they will be equipped on different subjects in order to better carry out their projects or better execute them.", "q0r": 5, "q1": "The experiences of the bidding members prove a good implementation of the project, the members are experts from different management fields; project management, finance, administration, having worked in startups and have knowledge of the blockchain and therefore able to provide consultations (online courses) to members of the cardano community, which means a flawless execution of this proposal.", "q1r": 5, "q2": "The information provided provides information on how their solution will be implemented, from the provision of financial and legal educational video courses to members of the network within a short period of 3 months. The progress audit is possible from the monthly report before the second installment of the funds and proposers have also provided the relevant links to their website, Telegramm link, and google docs which will allow the follow-up  and let know about the number of educational video courses put online, the number of proposers trained and the availability of a coaching platform in deadline.", "q2r": 5, "assessor": "z_assessor_2915", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8914, "q0": "As there is lack of lawyers who have knowledge over cardano, and there is even lack of financial advisors  who knows how block chain works, so this is the reason why lawyers and financial advisors are in great demand and in turn they are demanding high charges for each sessions, hence by educating the current lawyers and accountants it will remove the scarcity present in the market which decrease the cost of lawyers where it'll be easy to each individual to approach the lawyer, hence this projects helping in maintaining the balance in the lawyers and accountants number in the society, hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "All the team members involved in the project have more than 10 years of experience in legal services, and other team members have  worked as finance & accounting of multinational companies. where knowledge and experience of these people will be of great help.\nThe proposer's team can capture the lawyers and accountant who have less demand in the market , due to lack of experience even though if they have talent, proposer's team can make these guys understand the importance of cardano eco system and make them to attend the session.\nExcluding above point setting up an online call and conducting session will never be an difficult task, hence with minimal risk involved with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has mentioned all the team members who'll be working in the project and have introduced their experience in each field with expertise, the audit has even explained about how the team is going to extend its project to fund 10, the presented plan could have elaborated still more on budget breaking, because the team has estimated budget of more 42000 dollars which is definitely a huge amount.\nThe presented plan has decent timeline where it should have provided time to market about the course in the beginning,  by which proposer could have earned more audience ,with decent key indicators mentioned the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9053, "q0": "This proposal seeks to create a network of Vietnamese legal and financial experts in addition to provide pro-bono legal work for five funded projects. This is very impactful, but the overall reach may not be as large as some other proposals. Still, the concepts here rae solid, and should create a positive ripple effect of Cardano’s influence. The more content that Catalyst can initiate, the better. In this case, there will be a fairly aggressive schedule of creating video content covering a wide range of crypto topics in both the legal and financial realm. The team will work to network and connect with professionals inside and outside the ecosystem in order to upskill the crypto knowledge of those on the outside and create a community with those on the inside. This technique is proven to be effective in other realms I have experienced. Overall, this is highly likely to be impactful, but may be limited in scope.", "q0r": 4, "q1": "The team has the experience to develop and work the plan they have laid out. The budget is acceptable for the amount of work they plan to complete in the timeframe laid out in the attached documentation. The education videos have been a way to increase the community, especially if they are shorter and targeted and answering specific questions. This seems doable by the team in the timeframe and on budget.There is sufficient detail present, and an awareness of experience that leads to an increased trust in this proposal.", "q1r": 5, "q2": "This proposal has sufficiently detailed metrics to see they have a clear direction.They plan to measure stats on the educational videos. They also plan to provide feedback on the five funded proposals that they provided pro-bono legal work to. They are part of the catalyst team and larger Cardano family. I would assume they plan to provide feedback on their progress to the greater community, but they did not explicitly express their plan for this. Overall, this proposal is clearly detailed and the team is qualified to bring this to completion. Ideally they would have provided a slightly bit more detail on accountability, but as it is there is enough to commend this proposal. ", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9644, "q0": "The problem is very true today: many people are knowledgeable about Blockchain technology but have no knowledge of Economics and Legal. In contrast, most financial and legal professionals are not properly understanding the knowledge and value of Blockchain technology. The need to supplement the missing knowledge of both groups of people or provide an environment for them to connect and support each other is certainly inevitable.", "q0r": 5, "q1": "A big problem but the solution is not adequate, the information in the plan is too simple. Based on the reality and different characteristics of the 2 groups, I can give more suggestions at the first stage: \nFor the first group: engineers or people who are knowledgeable about Blockchain technology need advice or support. provide legal and economic advice for their projects rather than having to self-study. \nFor the second group: legal and economic experts first need to supplement the basic knowledge, the value brought from Blockchain technology. They do not need to know too much about the technique and they should be self-study or provided with tools to support their self-study. \nNext stages: connect them together or they will find each other to work on projects together.", "q1r": 3, "q2": "The table describing the necessary costs is quite detailed and easy to follow in practice. The point that is not reasonable in the section \"To provide free-of-charge advisory services to 5 Funded Proposals\": The Proposals will certainly have different complexity and require different time and quality of advice. Therefore, it is more accurate to determine a different implementation budget based on the number of “hours” of each Proposal.", "q2r": 4, "assessor": "z_assessor_3073", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10394, "q0": "Courses involving blockchain are always topics attracting the community. Blockchain users want to learn more about blockchain in all aspects. This proposal is a plan for a legal and financial course relating to blockchain. It’s a good course for people learning about financial and legal knowledge. However, when we look at the title \"Legal and Financial Consulting Hub\", we may think that it is a legal and financial consulting project. If the purpose of the project is about legal and financial course, the title should relate to education. So, anyone can understand the proposal more clearly. One more thing, the course will be taught in English however the project will focus on the Vietnamese community. Either way, this project will benefit the blockchain community, including Cardano. In the training program, Cardano is one of 3 blockchains that will be taught.", "q0r": 4, "q1": "The team has 3 people and they all have experience about finance, business and accounting. They clearly have an advantage when teaching finance. They have calculated in detail in using the budget for teaching, marketing and risk management. The timeline for this project is about 6 months, including the educational video clips and teaching. I see that the teaching time is 190 minutes when I look at the lesson plan. I think 190 minutes is a short time. The team should allow additional time for discussion, especially consulting financial risks. ", "q1r": 4, "q2": "They will use Youtube for uploading their course videos so everyone can watch and follow. They also have specific goals. For instance, after 6 months, their Youtube channel will have 500 subscribers. The target for their fanpage is 1000 likes and their Telegram/Zalo group will have 200 members. They also publicize feedback from the participants on their social media. The project is really useful and transparent.", "q2r": 5, "assessor": "z_assessor_3183", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12224, "q0": "The proposal addresses the challenge effectively and delivers a thorough plan which aims to educate the professional legal and accountant about blockchain and also provide financial and legal advisory retainer services for Catalyst Funded Proposal on pro-bono basis. It is good proposal to promote Cardano in Vietnam and I think, it is good idea. In addition, the team looks well known about the courses that will teach to the professional and it is value added in the proposal. Furthermore, I find, the plan is prepared well by the team, this can be seen on the language that going to use to educate the professional in Vietnam as well as in advisory, preparation of the fluctuation ADA price that would impact their fund. Given the information provided, I agree the proposal meet the challenge. ", "q0r": 4, "q1": "It is certain that the team is capable in relation to the activities they already carry out, that is, in what concerns projects with sustainable objectives. The proposer provides timeline and milestone for delivering their proposal with link attached as well as the budget. However, I do not find the information about the connection between the budget and timeline that the team propose. It would be positive if we are provided the connection between the budget and the timeline therefore, easy to monitor the funding. In term of people who engage in the project, the proposer provides detail information about it, thus, it gets clear picture who do the jobs. In addition, it sound achievable thus, I agree that this proposal will be implemented successfully.", "q1r": 4, "q2": "We have the information about what will be done regarding auditability even though, the proposer does not split what to be measured and how will be measured and no KPI’s used be measured, which mean the proposer provide the information indirectly. This is alright for now and hope they can provide complete and precise information including of using KPI in their reporting later. Meanwhile, we have also the information about the project success looks like and I think it is sufficient information to find the success of the project. overall, I give this proposal a ranting of 4 for auditability.", "q2r": 4, "assessor": "z_assessor_3367", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12473, "q0": "The proposal fully meets the challenge's setting. Our Catalyst project community is increasingly expanding through each Fund. In the future, the number of people participating in the Catalyst community will continue to increase dramatically. We can see more and more projects with ideas, very high performance, and already funded. However, among them, there are also some projects that have not been implemented and managed well in terms of finance and accounting. That leads to many impacts on the progress, and quality as well as not completing the set objectives of the project. The budget breakdown of some projects is sketchy and general and has not been detailed, so it is difficult to visualize the detailed financial picture for the project in order to raise capital appropriately, optimally, and accurately for the current projects and subsequent rounds. Because money is the blood of the project, finance and accounting need to be focused on. In addition, in some countries like Vietnam, the official legal framework for blockchain and virtual currency projects is not yet in the stage of discussion and completion. I believe it is the same in many other countries as well. Therefore, creating a Legal & Financial Consulting Hub is extremely necessary, meeting the limitations and needs of currently funded projects on Catalyst. Helping projects understand the legal framework for blockchain and manage their finance well to scale their solution into business and achieve the project's goals. In the future, this project will have a very good impact and be an in-depth information channel for projects on Catalyst to help develop the project and the Catalyst community to grow stronger.", "q0r": 5, "q1": "In terms of solutions, the idea of ​​this project is very good and practical. If it is implemented, it could help a lot of projects funded on Catalyst. Help projects and proposers have an accurate view of details and help them have an information channel to learn and improve their knowledge of finance and accounting. Project team members have a lot of experience in finance & accounting, finance & fintech. Three of the four project members have more than 10 years of professional experience (Mr. Brit Nguyen, Ms. Julie Vo, and Ms. Phuong Pham). All information of project members is provided fully and clearly with LinkedIn and telegram. I must say this is a very good team. The budget breakdown is also very detailed and specific for the project's category from content to Marketing and is committed to providing free consultation for 5 projects funded on Catalyst.\n\nIn short, the proposal is 100 percent feasible.", "q1r": 5, "q2": "The project is easily testable. The proposal has planned a very complete and detailed schedule for the project with a very clear roadmap. All content, duration as well as publication date have been planned in detail. Since it is a course project with video clips and posted on Youtube, we can completely check the project's KPI accurately and transparently through the number of views, comments, the number of videos posted, and the number of videos. the number of subscribers to the channel. In addition, there are telegram groups and fan pages. We can also check the number of author posts as well as the number of members of each channel. The 5 projects that the proposer pledges to offer for free will still be posted and tested by the community on their media channels. Therefore, this project can be easily audited.", "q2r": 5, "assessor": "z_assessor_3420", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12931, "q0": "The proposal identifies the issue of course-level ccancer for financial and legal professionals. Solve them the problem that blockchain startups face, and legal and financial advisory services. The problem is in line with the installation challenge at Fund 9. The problem solves two challenge questions: training financial and legal professionals to provide legal and financial services to funded Proponents. The proposal helps increase the number of quality communities with financial legal expertise, ensuring that Cardano's funded projects are fully legal and legally operational. The proposal has a good impact on legal experts, providing financial legal solutions for blockchain startups and sponsored proposals. Financial and legal advisory services for funded Proposals. Projects can be done better than positively impacting the Cardano ecosystem. The proposal identifies the risks affecting the proposal, the solution using bilingual English and Vietnamese is suitable for the english proficiency of the participating members, adding an additional 5% of the contingency funding for ADA fluctuations is appropriate. We have an opinion on the risks in legal advice that need to have specific information, citing the laws this is the basis for avoiding risks when implementing.\nI rated :4", "q0r": 4, "q1": "The proposal identifies 2 timelines: Completing educational video clips from the date of funding, providing legal services and financial retention for 5 Sponsored Proposals. The timeline of the proposal is reasonable, there are specific implementation contents. However, the proposal does not set a target for the number of legal and financial personnel trained to qualify for professional qualifications to provide legal services. Check the progress of the project will be measured by YouTube views, stop time, number of comments and number of subscribers; and by comparing these figures each month. The proposal's funding budget accounts for more than 8% of the total Challenge. The proposed budget has a spending plan: $40,320 for the project team, media and $2,016 for risk management. The proposal has an additional plan plan of $2,016 (5% of the proposal's total funding budget). Hemade the three-member proposal. No specific tasks have been assigned to each member. The experience of the members is in line with the tasks of the Proposal. Verify the identities of members on linkedln and Telegram channels. The members all have professional qualifications and work experience suitable for the job. As mentioned above, the provision of teaching videos is not effective and ensures the quality of training for legal and financial staff. \nI rated: 3 ", "q1r": 3, "q2": "Follow the implementation route with indicators: Course videos uploaded on youtube channels and 5 Sponsored Proposals have been supported and shared feedback. Specific reports on the number of courses taken were given, the number of attendees. We have an opinion: It is recommended that there should be a portfolio of legal and financial staff taking courses, which can use the quality test. Provide knowledge and job opportunities for legal and financial staff in Vietnam. Kpi proposed is: 500 subscribers to YouTube channel, reach 1000 interactions on Fanpage, 200 participants zalo, Telegram. The proposal can be determined successfully through the KPIs given.\nI rate:4", "q2r": 4, "assessor": "z_assessor_3514", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We will creating the education courses on pro-bono basis for financial and legal expert to understand the issues facing by blockchain start-up as well as the legal & financial advisory services.", "experience": "Our team consist blockchain educator, Funded Proposal Owners, financial & legal expert who are working in blockchain start-ups in Vietnam."}