{"id": 421110, "author": "nmkr", "title": "Connecting KYC to Tokens", "url": "https://cardano.ideascale.com/a/dtd/421110-48088", "category": 26596, "amount": 90000, "description": "KYC verifications can slow down our business activities", "f6_no_assessments": 10, "f6_rating": 2.9, "videos": [], "media": [], "f6_assessments": [{"id": 7172, "q0": "I disagree that this proposal fits the objectives of the challenge. Because here our goal is to provide direct access to solutions that provide financial and legal services, support, and guidance to emerging Projects in the Catalyst Ecosystem. This proposal is about “developing a framework for a KYC token - not dedicated to one wallet - that can be used to get verified automatically to ensure safe and fast crypto transactions”. But how will this especially help many emerging projects in Catalyst which are facing legal and financial issues which block them from moving forward? Because in my opinion, the objectives of this challenge are aiming for Cardano projects could broaden their horizons and increase their impact on the Ecosystem once legal and financial frameworks are explored and established. I can’t see what the direct benefits would be for these majors, so I think the proponent should make it clearer why he chose to launch this proposal in this challenge. It doesn’t seem in line with the metrics here, maybe this project will fit better with the Dapps challenge, for example. Therefore, as much as the application is useful for Cardano, it would be meeting only one of the facets necessary for the challenge to be adequately addressed. So unfortunately, I will give a low note for the impact.", "q0r": 3, "q1": "The script provided is shallow. We know what was going to happen very superficially. My suggestion is for the proponent to go further into explaining each of the activities – we know what would happen and when, but not how. This detailing would certainly increase the level of quality of the explanation of the process. Talking about the budget, the asking amount is high and it is divided into four steps. It’s given a good breakdown, but we don’t know within those parts how much each thing would cost. If this had been defined, we would certainly understand the monetary use better. Finally, speaking of the team itself, once again the necessary information is unfortunately lacking. We don’t know who the professionals are who would work here, nor their names, their resumes and examples of previous. Ngoaij tru Ann-Kristin Mackensen: CFO at NMKR (previously NFT-MAKER), the proponent just provided a list contains:  External Lawyer: From our partner law firm, Senior Fullstack Developer, Designer / Front-end / Back-end, Sales Consultant. With this, it is not possible to understand if they have the technical preparation for this project. Therefore, I think that all the topics (script, team and budget) that are cited here are inappropriate, all deserving more explanation and detail.", "q1r": 2, "q2": "I don’t think auditability of progress is adequate because the proponent say It will base itself on number of reports / information which the proponent receive concerning KYC requirements for a company and for the App. He also need to see that the verification, token generation and transfer works. Then he need to start a use case with a partner who accepts our token to measure real-life transactions where KYC is required. I think we should have some way of auditing the tasks of professionals, tasks that would generate the goals to be analyzed. Both parties are required to be evaluated. It is necessary for the team to prepare monthly reports, for example, on how their work routines have been, and make them available to the entire Cardano community. Regarding the final results, in my honest opinion, the goal is ambitious: “A framework for creating KYC tokens, that is accepted from many customers, partners and companies and which can actually decrease the time of verification for a transaction.” We will continue to achieve this: “How can we more accurately and objectively measure whether the project is actually being adopted by stores? It would be interesting for the team to do some research gathering information about which stores are using the technology and in what way. It also essential that the team analyze the direct impacts of all this for our blockchain and also for legal and finance? And how has this impacted the… of the …? All this information must be measured precisely and brought to the Cardano community in a simple and appropriate way. Unfortunately, I don’t think the auditability is enough for us to accurately monitor the project.", "q2r": 1, "assessor": "z_assessor_2879", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 37, "q0": "The proposers have identified a critical problem – for crypto to become widely adopted, it must connected to the legacy financial industry in more place, and that requires compliance with a legacy KYC process. It is extremely difficult to manage a legacy KYC process in the decentralized crypto and DeFI ecosystems. \n\nThe challenge calls for implementing financial frameworks for crypto projects, so the problem responds well to the challenge brief. The team proposes creating a KYC token to resolve this issue. \n\nAs a risk, they identify that the token could be transferred, thus negating the benefits of the KYC process.  KYC stands for “Know Your Customer.” If a KYC token could be transferred to an unknown person, it would completely defeat the purpose of the activity. Failure to mitigate this risk would completely undermine the effectiveness of the project. In order to demonstrate a more certain impact, the team needs to do a better job of explaining how they will mitigate this risk. \n\nAdditionally, as someone who has worked extensively with KYC in the legacy financial industry, an equally critical part of the process involves data protection and privacy. Putting KYC information onto a token suggest that information will be publicly available on the Cardano blockchain. The team needs to explain how they will protect and ensure user privacy.  ", "q0r": 3, "q1": "Ann-Kristin Mackensen is the only named proposer. Her LinkedIn profile shows considerable experience with NFTs, start-ups, M&A, and investment activities.  She serves as the CFO of NFT-MAKER, which appears to have a full NFT offering within the Cardano ecosystem. While the proposal references an external lawyer from a partner law firm, the team’s experience would be strengthened by demonstrating their knowledge or understanding of the KYC process.  The amount requested is 18% of the challenge budget.  The budget is fairly vague, with only $15,000 allocated to “Step 1” which is to “assess security topics of the token, e.g. transfer between wallets.” The whole point of blockchain tokens is that they are public and transferrable. Therefore, this is a critical obstacle for the team to overcome. As mentioned above, if this problem can’t be solved, the proposal will neither be feasible nor have impact", "q1r": 3, "q2": "As mentioned above, the roadmap is a bit vague. Regarding auditability, it would be helpful to know what the team would do with the remaining funds if they are unable to find a solution to the token-transferability issue after receiving the first $15,000. There are no measurable metrics or KPIs that would allow the community to understand whether or not the project is on track. The proposer provides a compelling description of success – that the envisioned KYC token would decrease the time of verification for a transaction. It would be helpful if they expanded on this idea to describe how much of a time reduction might be anticipated, how much cost this would save, or what other benefits would be realized, and how this information would be measured and communicated to the community", "q2r": 3, "assessor": "z_assessor_2030", "no_vca": 23, "ne": 7, "ng": 16, "nfo": 0, "vca_o": 1}, {"id": 1075, "q0": "The idea behind this proposal does sound intriguing and I would love it, if it could actually work, namely, to have the ability to have KYC tokens issued that could be used to verify my credentials for every transaction where the token is accepted. Yet, I see another risk that the team has not identified and that can prove to be a much bigger challenge than finding a solution to locking the token in a specific wallet, without the ability for it to be transacted. And that is, how to actually get the token widely accepted? Would Binance, for example, be accepting this token? They would have to be willing to trust it 100%, as it would put their business in jeopardy if there were even a minor problem with it. I do not see that happening, and I do not see it happening for any bigger company in the upcoming future. If that token were to be issued by Binance? Well, then, that would probably change a lot, since they are a very big company, with a large reputation to uphold and with a lot of influence in the space. Please, do not get me wrong, I have been following NMKR since the beginning and I love their product, it’s just that I do not see how this token would be implemented on a larger scale, at least, not yet. Maybe wait until NMKR gets to be one of the top companies in the blockchain space and then issue this token?", "q0r": 3, "q1": "The NMKR team has devised a 4-step plan for the execution of their project. I like the fact that the first step is finding the solution to their identified risk, namely, the issue of transferring the token between wallets. Only after that issue is solved, do they proceed with the rest of the development, ending with identifying the projects and companies where their token could be implemented. Having said this, I find the implementation plan to be sufficiently detailed and clear, however, what is not mentioned anywhere in the proposal, is the duration period for the entire project and for each step individually. Neither do I find any time-related metrics in the budget section, that in my opinion, is really too light on details. It contains only a number associated with each of the 4 steps, without any additional information. I understand the NMKR team has a very busy schedule, but if they do decide to ask the community to fund their projects, they need to find the time to put in a minimal effort, otherwise, it could lead to a precedent, where if they get voted anyway, they wouldn’t bother to complete any of their proposals in the future, because they get voted anyway, and I am sure, that is not how they envision the process. I would say the same applies to the team description that contains only 1 name and a bullet list of jobs needed to finalise the project. I understand they are one of the most famous projects on Cardano, but precisely because of that, they should consider to set an example, not just for the Cardano community, but for the ones outside of it too. There is enough animosity and tribalism in the space, we don’t need to feed it any further.", "q1r": 2, "q2": "Although I found it not very easy to follow, the description of the progress measurement contains sufficient information to be able to get an idea about how the team will look into this matter. What I would have found even more helpful, would have been a mention of where the community would be able to get these insights as well. As, in the end, the Cardano community is the one who will be judging the proposal and its success, not me or any other PA. \nSpeaking of success, the answer provided, although succinct, is actually sufficient in having a complete picture of the project’s success, which also seems to be reasonable and achievable.\nAs such, I find myself agreeing with the information provided in this section. I will remove 1 point for the fact that the information is sometimes too dense, lacking punctuation and thus giving the impression of a rushed job, making it not so easy to follow.", "q2r": 4, "assessor": "z_assessor_2192", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2956, "q0": "Reviewing the proposal, I am not very much impressed with the intentions of the proposer. This is a very brief and not much elaborated and concise submission by the proposer to help voters with an adequate understanding of the project. Of course, in as much as KYC( Know Your Customer ) slows down processes, it is in my view very important for it to be done to curb things like money laundering, using of bots and many other checks and balances. This implementation in my view won't be mutualistic to already funded proposals. In the view that KYC is not mandatory in most instances. Looking at the stability of this project, I seriously don’t think this project will scale very well into the future. The proposal has to review the concept very well and make modifications.", "q0r": 3, "q1": "This project was poorly conceptualized with a lot of inefficiencies. First of all, taking a look at the requested fund of $90000 I beg to differ here with such a fund request with a poorly modelled budget to give justification to this proposed project. reading through the details of people who will work on the project I was a bit disappointed by the details provided there. A very scanty provision made by the proposer is unacceptable in the view of the catalyst community. The summary of the relevant experience was a total deviation from the requirement. There is not enough links and reference to support evidence for a successful implementation of the project. This proposal lacks the description of resources necessary for the project and the timelines needed to ensure an implementable plan. Last but not least the proposer did not write anything on the risks involved and how to mitigate those risks. This project doesn't look feasible and needs modification. ", "q1r": 3, "q2": "For an audit to be accurate, in my view I think enough audit evidence should be provided. This project has insufficient milestones which will help one to measure the progress of the project given the key performance indicator (KPI) which throws more light on providing financial, legal services, support and guidance to emerging projects in the catalyst ecosystem. There seem to be little in this project to help achieve the KPI needed to ensure the success of the project. Looking at the use case of this project, not many funded proposals will make use of this solution and hence fail to meet the metrics to ensure success.\nFinally being an assessor with great knowledge of financials, I think the budget of this project is not realistic and many financial details need to be provided. This project fund request exceeds 25% of the challenge category fund allocation.", "q2r": 3, "assessor": "z_assessor_2371", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2966, "q0": "KYC is a very important function in financial markets, and is becoming increasingly important for Web 3 activities as regulation increases. Exploring ways to use Web 3 technologies to increase the efficiency of KYC processes is a worthwhile endeavor. KYC is clearly related to the goal of this challenge to seek legal and financial implementations.\n\nThe challenge for this project is that the issuing of a token as a record of KYC is only the final step of a very complex KYC process, involving the actual assessment of KYC and the acceptance of it by a particular entity. For example, I am an investor in a Web 2 KYC/AML business called NorthRow (https://www.northrow.com/) – it has taken this company many years to develop a platform that performs these essential KYC tasks effectively. The proposers seem to recognize this challenge in one of their auditability responses (“Then we need to start a use case with a partner who accepts our token to measure real-life transactions where KYC is required.”), but the proposal focuses almost entirely on the token issuance process.\n\nFor these reasons, I agree but do not strongly agree that the proposal effectively addresses the challenge. I suggest that the proposer should consider a revised proposal that includes a more integrated approach to the overall KYC process.", "q0r": 4, "q1": "Of the 5-person team proposed, only one member appears to have been identified: Ann-Kristin Mackensen. The only information on Ms Mackensen provided in the proposal is that she is CFO of NFT token company NMKR – there is no indication of expertise with KYC. From Ms Mackensen LinkedIn profile (https://www.linkedin.com/in/ann-kristin-mackensen-0895b291/), it does appear that she has investment and business experience, but not specifically related to KYC.\n\nThe detailed plan for the proposal is extremely high-level, suggesting that the proposer intends to start from a blank slate in planning how the proposed KYC token would work. This would make sense in a more limited exploratory proposal, but a $90K project should have more detail about the plan. In particular, it should show a better understanding of how the proposal fits into the overall KYC process, as described under Impact above. In particular, $60K of the budget is designated to “set-up a prototype App including KYC verification and token generation” – this will be difficult to do without a plan on how the app fits into the KYC process. Finally, no basis is given for the calculation of the proposed budget, such as hourly or daily rates.\n\nFor these reasons, I disagree that the experience and plan presented indicates a high likelihood that the project will be implemented successfully. I would encourage the proposer to present a revised proposal that addresses these issues.", "q1r": 2, "q2": "The proposer states that she will measure the project outcome through reports on KYC requirements, but it does not say what these reports will measure. For example, one could measure the number of KYC transactions that take place. Or assuming that the proposal is only intended to achieve app development rather than an operational process, the reports might measure development milestones. However, the latter is not easily possible because the proposal does not include sufficient detail in its plan on these steps.\n\nIn addition, as noted above, the token focused vision for success of this proposal (“A framework for creating KYC tokens, that is accepted from many customers, partners and companies and which can actually decrease the time of verification for a transaction.”) does not take into account the broader complexities of creating a KYC service. I would urge the proposer to spend more time researching the complexities of KYC, and to create a more detailed proposal that reflects these complexities.", "q2r": 2, "assessor": "z_assessor_2374", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5065, "q0": "The proposal is basically to make a digital identity solution in order to speed up KYC compliance for individuals. The proposal is not very convincing where it says \" it may even increase the willingness of Start-ups to implement verification.\" This sounds like start ups are not looking to implement their own KYC. Perhaps NMKR sees a need for their own solution. Many projects rely on the current KYC practices of financial institutions. The use cases and impact are low.\n\nScalability is difficult to predict as different countries have different KYC laws. Adaptabilty to other countries around the world is similarly limited.", "q0r": 2, "q1": "Digital identity solutions are kind of a holy grail of blockchain development. It will be useful for a variety of things beyond KYC into voting, and credential verification. Large entities like IOG are putting a lot of resources into this and have not released a solution. \n\nThe proposer is a non-technical person who can not do this alone. The team is unnamed, and has not been formed. NMKR has delivered a lot of utility to the Cardano NFT space and has talented developers. \n\nHowever, the most useful, and innovative, utility of NMKR builds on WEB 2 technologies. Paying for NFTs with credit cards uses legacy systems, and may be diluting the usefulness of NFTs as an entry into Cardano as it delays the need to learn WEB3 tools. \n\nThe other value NMKR brings to the ecosystem is an extensive API. This approach, as opposed to an SDK, centralizes the services of NMKR, the opposite of the decentralized WEB many people want to see. \n\nThis team is not well positioned to implement this successfully.", "q1r": 2, "q2": "The assessments that the proposal describes are reports read by the CFO of NMKR. There is no mechanism for transparency described here. It will be very difficult to audit the progress of the proposal. \n\nOverall success may be easier to measure as it will be measured by users counted in the real world by objective measures. The proposal defines success as a widespread framework for speedy KYC. There are no objective numeric goals attached so it seems like success can be claimed at any time by showing any use.\n\nThe community will not be able to sufficiently audit the progress and success.", "q2r": 2, "assessor": "z_assessor_2669", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5684, "q0": "The adoption of blockchain is slow paced in Africa due to insufficient advocacy for its adoption. On the basis of this, I agree  with the initiative of the proposer that, via this initiative more could be done to foster adoption. The objective underlining this project is to help provide and engage the general public, mainstream media and stakeholders directly to build support and momentum for policy solutions for favorable legislation, reduce tax, and free-market environment that advances individuals' creativity and innovation in building on the Cardano Ecosystem. The end goal as indicated by the proponent suggests a clear alignment with the legal and financial challenge setting and also highlights its value proposition to the Cardano ecosystem. The adoption of favorable regulations for blockchain adoption via the advocacy of the team could be a reference point and a springboard to scale up the adoption of favorable blockchain regulations across the African continent. However, I prefer a more detailed information on the marketing strategy and educational outreach. Can these events be emerged as one? If not, what's the strategy for both? I suggest the proposer enlighten us here.", "q0r": 4, "q1": "The outlined plan set out in this roadmap shows a work structure spanning a whole year with timeline demarcations that specifies which activities are to be undertaken within specific duration. Ideally, we expect that, the design of the roadmap would complement and guide the effort of the team. Aside that, the script provides us with a detailed budget breakdown, indicating the key resource that would be required for project implementation. By far, the amount allocation for the identifiable items are within the market prices, per my understanding. But I disagree with a $1000 for an NGO registration. In my view, this amount is over priced and should be readjusted. Finally, the proposer present a three member team with expertise in advocacy, law and social protection. We can confirm from the attached links to the profile, that Mr. Evan’s Kisanga indeed has a background in social protection. However, in the absence of references and links to the profile of the other 2 members, how do we verify their expertise, to justify their competence in implementing this project. I would entreat the team to amend the proposal to capture this concern. Again, would these expertise be relevant to the project? Certainly, this could be a foundation to build on, especially knowing that the team would seek to attract lawyers onto the project. \n\n", "q1r": 3, "q2": "The information provided here is insufficient to audit the project. In my opinion, based on the overall success the project wants to attain — to provide and engage the general public, mainstream media and other stakeholders directly to build support and momentum for policy solutions for favorable legislation, reduce tax, and free-market environment that advances individuals' creativity and innovation in building on the Cardano Ecosystem, I think the KPIs should be reconsidered to provide indicators that shows a direct comnection with the overall objective. In respect of the overall objective, I suggest that the team consider KPIs like, the number of engagement with media and policy makers, the feedback from policy makers, the number of lawyers the team is able to attract to the project and a few others. Though these parameters are both quantitative and qualitative, they would be a more concise and accurate in assessing, monitoring and tracking the progress and success of the project.", "q2r": 3, "assessor": "z_assessor_2734", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7072, "q0": "To ensure that voters have a thorough grasp of the project, the proposer has submitted a very succinct and sparsely elaborated proposal. Even if KYC slows down some procedures, it is undoubtedly necessary in my opinion to stop things like money laundering and many other checks and balances. To me, this implementation wouldn't be mutualistic with funded ideas. I sincerely doubt that this project will grow very well into the future, especially given its stability. I regret to say that the proposal does not align with the challenge’s objectives and has no impact to the catalyst ecosystem.", "q0r": 2, "q1": "This project was structurally flawed and had numerous drawbacks. The proposed funding was not broken down correctly to support this project. Vaguely defined proposal team credentials and details. The proposer offered very little disclosure, which is inappropriate in the perspective of the proposal criteria of the catalyst community, including only providing one name and ghosting the other team members with only their positions provided. The relevant experience summary completely deviated from the criterion. There aren't enough references and links offered to support the idea that the project will be implemented successfully. This proposal lacks the timeframe and resource descriptions required to make it feasible. Moreover, the proposer made no mention of the potential risks and how to manage them. It is not possible to complete this project in my opinion.", "q1r": 2, "q2": "The project doesn't have enough milestones that can be used to gauge its development. A critical KPI that assesses how this project's use case compares to projects that have already received financing in light of the financial and legal challenges they have faced as a result of that funding is missing from this proposal. This proposal appears to include insufficient details to permit an audit of the progress rate. The requested budget is more than the percentage of the category funding allotment. This proposal's budget, in my opinion, is unfeasible, and further information regarding the finances is required.", "q2r": 2, "assessor": "z_assessor_2869", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12211, "q0": "This idea to be really useful and it can be very positive for the Cardano ecosystem. It's about creating an KYC and simplified the identification to improve the customer experience. \n\nThe justification for the problem is that customers currently have to provide their data many times which bring complexity in our business models and delays transaction through verifications on both ends, and the creation of this initiative would generate token as the tools for KYC credential, that is, one that can be used for 3-6 months; another advantage in developing this platform would be that this credential can be proof that they have gone through a verification process. \n\nHowever, two things could be better clarified more, the proposer should provide more specific type of this token which will be. Is it hard token or soft token? We know that in it, various information about customers would be identified on which the token will be delivered into the authorized person/user. How would customers allow what data to be provided? What would be the process of “creating” credentials for customer look like as the preliminary identifier before the token is being generated and sent? It is not however very clear how this would take place, once the Token was ready for use, how the verification process would be carried out that would result token, which would be presented for 3-6 month. If customer changed their device on accessing the information, would the token remain the same? how the token can replace the existing security as KYC identifier.\n\nThe Idea here would be very useful and positive for customers, businesses and the Cardano ecosystem. If the concerns that I commented were better clarified.", "q0r": 5, "q1": "Proposer provides the link reference to show the credibility along with the detail step of the plan, however the proposer should put more detail of the duration of the activities is need to be performed, could be better if it is divided into several groups: business tasks and technical tasks. The proposer should explain what actions would have to be taken in each of these groups, for example in the business tasks there would have to be the step #1: Assess security topics of the token and step #2: Evaluate the requirements to become a KYC provider and define the end-to-end business model incl. Business case. Then the remaining steps will become a technical task. \nWithin these groups the estimated time for each of these tasks could be defined. This is not strictly necessary, but it would help to deepen our understanding of the whole. How long would it take to build the initiative? \n\nfor the budget, the total amount of 90 thousand dollars (approximately) is well explained, however if the steps would be divided and those parts will be well detailed. For example, how many hours of work, so it will be well explained detail of budget per hour, however this budget topic is quite understandable. But already explained earlier that the proposer should put details of the token type ( hard or softoken), because the cost control process will be different.\n About the team, this part is average, because we don't have much information about Ann-Kristin Mackensen ; it would be necessary for the proposer to attach a small resume of the team, in order to understand more about their careers and previous experiences, and also if they have any kind of relationship with the Cardano ecosystem. As for External Lawyer; partner law firm; Senior Fullstack Developer; Designer / Front-end / Back-end and the Sales Consultant, it would be perfect if we could know a lot of information of these team, what they do professionally. \n\nFinally, I think that the feasibility is high, just needing a few points of deepening.", "q1r": 4, "q2": "The proposer will measure the outcome through reports / information they receive concerning KYC requirements, however they don’t put detail of the methodology to monitor the progress of activities. I think it would be important that they had defined and elaborate how this methodology works. \ntherefore, we couldn't have a complete understanding of what this way would be like to follow the succession of steps. \nAlso, for the report variables: how often it will be generated? who will validate it? are these also be made available to community members?). If the proposer had explained about framework for creating KYC token, what tool it is, how it works and what its objectives are for every project. It would also be interesting if they explained a little better about the framework, used as a way to measure progress through percentages or any kind of determined numbers which they can use as the KPI as the objective and efficient ways to audit the development process.\n\nIt would be necessary for proposer to explain not only for the decrease of the time verification for the transaction but also, are these tokens really being used by customers as expected? Has this changed the process of purchasing services and products, making it safer and simpler for both end consumers and companies? How can we see in a proven way what the consequences of this project were for Cardano? To summarize about the auditability of this project, I would say that the first part is great (to decrease the time verification), but the second is still very abstract, as there are no direct ways of perceiving the success scenario.", "q2r": 2, "assessor": "z_assessor_3366", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 12685, "q0": "The issue that needs to be addressed by the proponent here is that KYC Verification can slow down business activities and the proposal presents how it will add value to the Cardano ecosystem by developing a framework for KYC tokens - can be used and verified automatically to ensure safe and fast cryptocurrency transactions. The proposed solution immediately after verification in the respective application the user receives a token in his wallet and can even be transferred to his other wallets without resulting in a lack of security. This KYC token is valid for at least 3-6 months so that the user is automatically verified for each transaction for which the KYC token is accepted. As soon as the wallet is connected, the user is verified. Proper KYC tokens can reduce the verification time for each crypto transaction for which KYC is required. it can even increase the willingness of start-ups to do verification to become more secure so the proposal is fully scalable to solve future challenges. Given the impact of this proposal, I agree 5* for the impact of the proposal.", "q0r": 5, "q1": "The proponent has identified project participants as Ann-Kristin Mackensen- CFO at NMKR, External Attorney, From their partner law firm, Senior Fullstack Developer, Developer Design / Front-end / Back-end, Sales Consultant however I would like the proponent to be able to provide evidence of the relevant skills or required experience of the members involved in the project helps voters to better understand these members. The proponent requested funding for the project is 90000 In which this funding is divided and used in 4 steps of the project.  Evaluate security topics of 15000 tokens.  Evaluate requirements to become a KYC provider and define an end-to-end business model including 10000 Business Cases.  Set up a Prototype Application that includes KYC verification and 60000 token generations.  Set up a list of projects and companies that can claim KYC tokens and define a selling strategy of 5000. I think it would be better if the proponent could make a detailed plan and break it down into identifiable items for each workload, the unit price for each job, and the number of members for that work with each step of the project. the actual project implementation timetable is given in 4 steps by the proponent, looking at it can determine the progress of the project. the proposal has taken into account the risk and provided a solution to deal with that risk, from the above information I agree that this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposer has identified the project roadmap and milestones for achievement, I would like the proponent to be able to calculate the time to complete each step of the project as this will help voters can more easily assess the progress of the project. when the project is done successfully will create a framework for generating KYC tokens, which is accepted by many customers, partners, and companies and can really reduce the verification time for a transaction. Proponents said they will measure results through the reports/information they receive regarding KYC requirements for a company and for the App. This is a new proposal, but it has clarity and understanding in describing the problem that current KYC verification processes bring complexity to business models and delay transactions through verification in the country and came up with a clear, easy-to-understand solution to the problem by developing a framework for KYC tokens - not specific to one wallet - that can be used and verified automatically. to ensure safe and fast cryptocurrency transactions. From the above information, I agree that this proposal provides me with enough information to evaluate the progress of the project.", "q2r": 4, "assessor": "z_assessor_3449", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We are developing a framework for a KYC token - not dedicated to one wallet - that can be used get verified automatically in order to ensure safe and fast crypto transactions.", "experience": "Many transactions in crypto / NFT business get regulated mainly due to the money laundry regulations. KYC verifications is necessary but current verification processes bring complexity in our business models and delays transaction through verifications on both ends."}