{"id": 422389, "author": "loxeinc", "title": "Catalyst Mediation Treasury", "url": "https://cardano.ideascale.com/a/dtd/422389-48088", "category": 26596, "amount": 10000, "description": "Catalyst has recently faced many conflict situations between community members that were not handled in a good way nor with professional guidance to transform conflict into a positive outcome.", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1720, "q0": "The proposal is excellent, extremely necessary and useful for our community. It perfectly aligns with the objectives of the challenge, as it is described in the scope of the challenge that success would be “a direct access to solutions that provide financial and legal services, support and guidance to Emerging Projects in the Catalyst Ecosystem”. In the case of this proposal, the idea is to provide a mediation service so that members of the Cardano community, in general, can resolve their conflicts in a less expensive and bureaucratic way than in the legal system itself. With this, “legal” solutions would be provided, as the problems that would be directed to this sector would not need to reach that point; and with some conflicts that hinder our community from staying together and our ecosystem from getting stronger and more influential would be resolved. I think this solution is very interesting, since the project has been facing real conflict situations (this can be noticed even by some discussions in the Telegram groups). Such problems cause dissonance between projects, as the objectives are not achieved, precisely because the disunity results in difficulties in carrying out the practice of daily work, and this has an intense negative impact on our entire ecosystem, since Cardano is a relatively new blockchain that has as one of the pillars to maintain an active community that runs several projects, promotes many exchanges. It is natural that these situations happen, and I believe that until then no proposal has aimed to solve these cases in a more direct and “free” way (who would pay would be the Catalyst treasury, but at the end of the day this would be an investment, because once conflicts are resolved, teams will work harder and better, generating results that will bring profit to the ecosystem as a whole). A very positive aspect of the proposal, which indicates that success would most likely be obtained, is the fact that the action would be carried out by businessmen who are already used to the activity of mediation. The company Loxe Inc. makes available its official website, where we can get to know better the area of ​​activity of the professionals that compose it, and from what I understand they have two larger projects, and one of them is precisely to carry out a mediation process (in the case of the company's performance, contracts smart devices are used as a way of establishing the immutability of all the information in question, but this would not be done here, to avoid making the project more expensive). Speaking of funding, the asking amount is relatively low compared to other Catalyst proposals, which is a positive point, the proposers say that this round will be a test and if the idea is successful they will apply for future funding. One comment I would like to make is in relation to the thought risk: “the main risk related to this proposal is not having enough traction within the community and nobody asking for mediation and using the treasury”. I think it would be interesting if proponents could think of ways to publicize the possibility of mediation, so that the money is fully utilized and the most pressing issues can be resolved.\n", "q0r": 5, "q1": "The proposal is very viable, but still some details could be added. Talking about the script, as much as the project is simple to execute, it would be interesting if some more explanations were included. The first month after funding would be spent on creating the project website and mediation request form. I would like to know what the development process of these two products looks like: which professionals would be responsible for this, what would their work routines be like? What kind of information would make up the form? I believe it is as simple as possible, so that everyone who needs help can get it in the least bureaucratic way possible, but it would be beneficial if we had an idea of ​​the structure of this form. It would be equally positive if we knew better what the site would be like, what the contents would be, whether mediations would be done through online calls, etc. And from the second to the seventh month of the project, mediations would be carried out, at first it would be very interesting if the proponents had attached to the proposal some example of successful mediation done by them previously, so that we could understand how this process is in practice, how long it lasts, what strategies are used, etc. For sure the idea is great and much needed by our community, so these suggestions are more in the sense of understanding how the solution would be implemented. Now talking about the costs, the total amount of 10 thousand dollars is divided in some parts: the majority would go to the treasury of the mediations (8500 dollars); I thought it was a great idea that the cost per mediation was capped at $2,000, so that more groups and issues can be involved here, in a way that gets the most out of the proposal. Regarding the management and auditability reports, it would be nice if more details had been provided - what would that be, exactly? It would probably be periodic reports to keep the community and the IOG coordinator cited on how the project is going, but I would like a better clarification. The team involved here instantly conveys total confidence precisely because they are part of a company whose main activity is to carry out mediations. With this, we are very sure that they are people well prepared to deal with the problem in the most appropriate way possible. However, I would also like to suggest that more details be provided in relation to each of the professionals involved, especially because on the company's website we also have brief descriptions about each of them. It would be important for us to know a little better about their professional paths, projects they have been involved in before, how they are active members of the Cardano community. I think the proposal is in good hands and we managed to get a good understanding of the process and the costs, so it does deserve top marks in this topic, but it would be great if the suggestions I made were included as well.\n", "q1r": 5, "q2": "In addition to the first month's final product, it would be positive if we had some way to audit the site building process. As has been the daily work of the developers, who on the team would be responsible for this part of the proposal, exactly (some of the engineers, or would it be the interns, through supervised work?). Therefore, I would like the team to provide some content that says about what was behind the launch of the site, if there were any issues, how they were mitigated and so on. In the following months, it would be interesting if we had some way of auditing the mediation process. This also includes the process of publicizing the forms, once again I emphasize how important it would be for us to know better about the marketing process of this campaign, because we know that the objective here is not to sell a product, but to provide a resource to our members. community, so it would be important for us to know how the community would become aware of the possibility. It would also be interesting for us to know some details about the mediations themselves, such as which of the professionals would be participating in the sessions, if the parties attended, if the meeting was productive and as friendly as possible (obviously private matters do not need to be disclosed, I am talking more about how things were going, if according to plan, etc.). Speaking of success, finally, this would be considered when the funds were used to mediate at least 5 situations. However, in addition to understanding if the mediations actually took place, it would be very positive for us to know if the mediations were successful and if the projects “unlocked” from that, that is, if those who were having problems managed to solve the situations and the work that was being harmed can have a good continuity, generating the long-awaited positive impact for the Cardano ecosystem. It would be necessary, for us to know this, that the proponents carry out a survey with the people who participated in the mediations, in order to collect feedback, and also so that they can provide information on how their projects would be being developed after the mediation (and if possible in presented qualitative and quantitative data that could prove what is being said). That said, I believe that the proposal is indeed auditable, but in my view it would be necessary for the proponents to go a little deeper into how the monitoring of both the progress and the final scenario would be done, and leave all the information well accessible to the Cardano community (a The idea is to provide a session on the website that will be created, to maintain this channel of communication with our community).\n", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2521, "q0": "As the saying goes, Money can corrupt even the sincerest of people. Whenever there is money involved, there is always possibility of conflicts arising between the people incharge of managing that money. There are many conflict resolution mechanisms devised over time and every such method has its pros and cons. The most comprehensive of them all is being the legal recourse through a court of law. Although it can result in final and binding decisions on all parties, it can also be very time consuming and costly. To overcome these problems, many people restore to mediation which involves arriving at a mutually acceptable decision with the help of a Mediator which is often a government appointed, in case it is a formal mediation, or any person who is neutral and trusted by both the parties, if the mediation is informal.***\nProject Catalyst and the wider Cardano  community face many conflicts and disputes as there is a lot of money involved. One such conflict was between Sundaeswap and Cardstarter teams which resulted is a bad press for Cardano ecosystem. But there are a lot more conflicts which remain private but affects the implementation of the projects involved. Most of the times, people getting funded through Catalyst are very young with innovative ideas who have never dealt with the amount of money they get from Catalyst. This, sometimes results in team members in a project having different opinions regarding how to go about the project and ends in conflicts. To avoid having to take legal recourse to settle the disputes, it is always wise to try resolving these disputes through mediation.***\nThis proposal is trying to fill the gap of a mediator in the Catalyst and broader Cardano ecosystem. The goal of this proposal is to create a treasury for the community to use and have access to mediation service through the website mediators.ai, a Catalyst funded project built by Loxe Inc. This treasury will provide mediation service to anyone in the Catalyst and Cardano community .\nThis perfectly aligns with the objectives of this challenge to build effective solutions to provide legal & financial services and support to funded Proposers. ", "q0r": 5, "q1": "The project involves only 2 steps, the 1st being creating a website and form to accept mediation requests and the final part being receiving the application and helping the projects to resolve conflicts through mediation. The team consists of 3 members and is led by Matthias Sieber who has Masters in dispute resolution, is a Cardano Ambassador and has more than 2000 followers on Twitter.***\n\nThe total budget requested for the project is $10000 and a major part of this ($8500) will go to the treasury which will only be used when there is a mediation request.  The remaining $1500 will go towards website development and management of the project. The budget seems reasonable but my concern is that there is no budget allocated for advertisement and creating awareness about the project. There is also no mention of any plan to achieve this. Without the awareness, the project might not recieve many mediation requests which will defeat the whole purpose of the project.***\nThese facts show that the project is simple and feasible as it doesn't involve any technical developments. Only concern would be on marketting front and Project might end up not having much traction.", "q1r": 4, "q2": "The first steps in the execution of this project is the launch of the website. Once the website is live, the progress of the various requests received for mediation and the final results can be tracked easily. The information will also be shared publically about the quantity of mediations requested and provided each month, as well as the amount of treasury used during that period. The success of the project can be measured through the treasury funds used in the first 6 months of the project launch. Widely shared information with the community will make sure the the project can be easily monitored and audited. One thing to mention, though, is that the whole project is being run by the Loxeinc and is being implemented manually which is not in the spirit of Decentralization. Although the team has mentioned that given the small size of the project, they are doing it manually and they will think of creating a smart contract in the future if the project receives enough traction.\n********\nAs they say \"Really good mediation often results in a hug.\" I wish the team all the best.\n********", "q2r": 4, "assessor": "z_assessor_2312", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8954, "q0": "There is no society present which doesn't have disputes, similarly there are even disputes among the members in cardano eco system, sometimes dispute might be of small but it might affect massively to the block chain some mediation is needed to solve these disputes.\nHence to develop a treasury where these funds can be used by community members to resolve the issue by consulting the professionals of mediation.ai is a great idea, where it can stop the growth of any disputes and solution will be generated .Hence, this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The task mentioned is never a difficult one to achieve, where it just needs to build a website and maintain the transparency of the website,\nsince development of task can be achieved by  Loxe dev team where it currently has 2 full-time software engineers, 5 interns, volunteers and contractors. hence with provided team the website can be built.\nHowever the team is directly connecting with mediators.ai for mediation , who have expert members to complete the task, with mediators.ai already linked, it doesn't have any other risk involved to complete the project , Hence with with minimal risk involved and given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has mentioned clear goal to achieve, where it wants to utilize the specific fund for solving the disputes through mediatio.ai, the proposer should have come with still more efficient ways to tackle the challenges that might occur, suppose what precaution will the team takes if the funds are over and what to do out of the left out funds, the proposer should have presented us some data on how the team will maintain the treasury and how will the members be organized in treasury committee, the audit should have even presented how will the team going to prioritize the disputes for funding, other than that with simple timeline and budget breaking. The information provided is sufficient to audit the progress and the success of the proposal. ", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 13069, "q0": "I am not a native speaker. I agree that the answer covers most of the criteria. Disputes and conflicts in a community are inevitable. Although the Cardano community is very active, disputes and conflicts will still exist. Especially in a project being carried out by colleagues, disputes can quickly arise. This project offers a conciliation-based solution that is very suitable for the project at a relatively small cost.\nThe measurement indicators need to be clarified in the proposal. How many funding proposals are making use of these new solutions and services? Scalability of the project.\nMediation will reduce a lot of disputes and conflicts, so a successful project will help a lot in creating a thriving Cardano community. While the risk to be addressed is specifically that there is not enough traction in the community, and no one is asking for mediation and use of the treasury.", "q0r": 4, "q1": "First of all, the Catalyst Mediation Treasury is a new project that has not been implemented before, but with a group that has worked on previous proposals, this is the point that proves the reliability and effectiveness of this proposal.\nThe member description in the proposal is very detailed, and the ability of a team member to successfully implement this project is very high. However, in the budget section, the audit and management reports only account for 1000/10000 for more than seven months of project implementation.\nThis plan is not difficult to implement, the cost is not too high, and the ability to administer is not difficult, but the biggest barrier is the use and understanding of the language when the stakeholders are from many countries in the region. Different domains in the Cardano community. Therefore, translation software or translation staff must require high accuracy, and users should use their native language to speak when they are not fluent in English.", "q1r": 4, "q2": "Timing is clearly outlined by the team. In detail, the amount used for each milestone is clarified after the campaign is done using their reports.\nThe KPIs clearly state that they consider the proposal successful if the community has used the treasury within six months of funding.\nThe solution to mediation is straightforward, but it will be effective in the Cardano community when there are difficult-to-resolve disputes, reducing a lot of conflicts in the community.", "q2r": 5, "assessor": "z_assessor_3566", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14775, "q0": "The proposal makes a statement for the current situation of the Cardano community that is the conflict between community members that has not yet been able to handle well as well as guides to bring the conflict in a positive direction. The proposal team offers an idea to build a project to help community members mediate conflicts professionally. I appreciate this idea and believe that when the project is successfully implemented, it will bring huge benefits to the Cardano ecosystem community.\nThe team very clearly explained the situation and clearly indicated the necessity of the project for the community. The project has set out the goal of reconciliation of conflicts and wishes to bring a positive impact to the community. However, in this part, the community needs to see more clearly the features and functions of the project. The main components and main activities of the project should also be mentioned in the proposal. The project should also identify the potential audience they are targeting. At the same time, they must clearly state how their project affects these objects. The more detailed these contents are, the more the proposal will be appreciated for its impact.\nThe goal of the project was clearly defined by the team. These goals are all intended to support the key metrics / KPIs set by the challenge. The results that the project aims to be presented clearly to each part, sometimes to each stage. Through the proposal, the community can see that the project meets the goals of the Challenge well and the impact of the project on the community is quite large.\nThe team determined the difficulty in implementing the project was that there was not enough traction in the community and no one asked for mediation and the use of the treasury. Faced with this challenge, the team has taken reasonable measures to minimize the risk.", "q0r": 4, "q1": "The team explained very thoroughly how to do the project. The community is provided with an overview of the direction of the team. The project implementation plan is considered by the team to be quite simple. The proposal also offers a 7-month roadmap. However, the proposal is still not detailed enough to be appreciated for this project implementation plan. The roadmap should outline the tasks to be performed. The team should also break down the work and define the results for each milestone. The plan should have a realistic timeline to complete the given tasks in a reasonable manner. The proposal must show a reasonable plan not only in terms of what they will accomplish but also how it should be, as well as detailing technical aspects such as architecture, language, and technology needed to execute the plan. In addition, the team should also clearly define the positions and the number of people needed to carry out the proposed project. If possible, The Proposer should provide information (evidence, witnesses, or links...) about the skills and experience needed to carry out the activities mentioned in the proposal. This detailed content will help the community see the potential and ability to achieve the project's goals.\nTurning to the budget plan, in general, the proposed budget for the project is quite reasonable. Due to the simple nature of the project, the team can only list 3 items to spend when implementing the project. Each category is transparent about the amount to be spent. The budget plan is presented in easy-to-understand bullet points.\nThe project is led by experienced and talented founders. They promise to use the available knowledge and skills to bring the project to the desired success.", "q1r": 4, "q2": "Details of the project's objectives are outlined in this section. The goals are completely consistent with the set plan. The criteria to evaluate the success of the project are set by the team. They described the goals and requirements for each phase of the project extremely well. The team will regularly report to the community the results of each phase. However, the team should include in the proposal specific quantitative indicators so that the community can easily compare the results when the project is completed with the target number. From there, the community can make accurate judgments about the potential of the project. Pictures of the success of the project have been provided by the team in great detail. This shows that the team has taken the project seriously and pursued the goal.", "q2r": 4, "assessor": "z_assessor_4099", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "A treasury to be used by the Catalyst community to request professional mediation through mediators.ai, a Catalyst funded project.", "experience": "Legal tech company founded in 2021 by prolific Catalyst community members."}