{"id": 422550, "author": "scinstitute", "title": "Imani Web3 Legal Services Portal", "url": "https://cardano.ideascale.com/a/dtd/422550-48088", "category": 26596, "amount": 50000, "description": "Legal services for the Web3 Crypto Blockchain space are difficult to navigate. The greatest challenges are determining what services are needed, where to obtain said services, and providers to trust.", "f6_no_assessments": 8, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 910, "q0": "Legal certainty in the blockchain industry, and more specifically, in the Cardano ecosystem is a necessity that has not been covered yet, but needs to be in order for projects and applications to gain adoption and be more at ease in their development. This proposal tackles the challenge set in this fund by providing what could be considered as the first step towards legal compliance. Establishing a bridge between blockchain projects and legal service providers can help projects gain a better understanding on how to comply with different jurisdictions and act in a more secure way. This proposal tackles a specific problem set in this challenge, however, it doesn’t mention how it would benefit the Cardano ecosystem in a specific way. A brief explanation on the benefits this proposal would have for Cardano would be very helpful and useful. A defined roadmap on scalability would also help voters gain more insight on the future impact of this proposal. Well detailed elements, are the sustainable development goals. The voter will be able to see what this proposal is trying to achieve and some useful metrics to measure the progress in this area.\n", "q0r": 4, "q1": "The professionals working for this proposal have the experience, skills and knowledge necessary to implement the solutions which are outlined. The voter has accessible ways to validate the expertise of the proposers, and sufficient links and information is provided to them in this regard. A good indicator which leads to believe that the proposers are capable of carrying out their objectives, is the fact that they have obtained funding in previous funds, as indicated in the proposal. When it comes to the team which would work on the “one-stop shop for legal support”, a more detailed explanation on the number of persons required to carry out different tasks would help the proposal gain more depth. Regarding the budget, this proposal has an in depth explanation on the specific amounts required for each specific task, and as someone who has a degree in Law and is working in a law firm in Europe, it does not seem unreasonable considering the goals it is trying to accomplish. In matters of project duration and time lapse, the proposers provide a defined roadmap and different objectives that will be worked on each month, perhaps stating which part of the team will work on the different areas would make the time lapse clearer, but overall, it is precise and well-structured. At last, a list of potential risks is not taken into account, and it would be good to address how specific problems, such as the approach to different jurisdictions, would be tackled.", "q1r": 4, "q2": "While this proposal provides the voter with a roadmap, solid metrics to define success and the methods that will be utilized to track progress, in order to be fully auditable, a public channel which the voters could use to track this proposal would be needed. For future funds or\nIn the future, this feature could without a doubt ensure that auditability is fulfilled. That being said, most of the criteria which cover this section are fulfilled.", "q2r": 4, "assessor": "z_assessor_2151", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1172, "q0": "The proposal is addressing the challenge as it aims to deliver a smarphone app and Saas web application to guide a team in the identification of the regulatory framework they would need to operate in, based on their geographical region, to choose the right tools for their projects (do they need a new token ? Shall they use NFTs...?) based on their budget/capital raising strategy, which legal structures will enable the team to easily enter the market (1)\nThe tool will be built such that the users will follow a dynamic path that will guide them thorugh the main answers concerning legal issues/finance matter, at the end of which the users will interact with a professionist to guide the team through the launch of their project. (2)\nThe proposer claims that this solution is unique. I believe this proposal instead is very similar to this other proposal https://cardano.ideascale.com/c/idea/416507, submitted within the same category, and I think the two could work together to build a powerful tool such the ones described in both briefs.  The database built after this proposal would serve the scope of the other proposal that I linked above. \n\nFew questions (see numeric reference above)\n(1) do you mean contracts with third parties, company denomination ...?\n(2) Would there be a different path to follow in the case of projects already launched ? \nI am rating this proposal 5 stars because the team is leveraging on an already existing company and the plan looks solid. However, I strongly encourage the team to consider their integration with the team of the proposal mentioned above, to avoid having tools that are competing with eachother instead of building a unique powerful tool.", "q0r": 5, "q1": "The team aims to deliver this proposal within 6 months from the funding date. The team also states there are no risks associated with this proposal, as they have full confidence in being one of the premiere providers of legal services in the Web3 space. I partially disagree with this vision, for the following reasons.\nThe team forecasts one month to identify the leading chains (leading chains are well already known, going thorugh the market cap rank is already a good indicator), create employment / FTE requirement plan (this shows lack of estimation for the budget requested. How can you forecast the budget need if you first need to evaluated a headcount ?).\nIntegrate with BlockchaininBusiness.io (part of another proposal, so this is raising the risk of not being delivered if not funded ?).\nThe team also forecasts 2 months for building the dynamic path (conversational forms, reporting modules, app intefrace...) and 2 months for database population, data entry and validation of effectiveness of captured data. \nThis is unclear to me, I believe the presence of a database behind the app/Saas is a must, otherwise how can the app/Saas guide the user through the series of questions ?\nThe budget is quite accurate, although, based on my experience, I believe some of the items are underestimated, for example the creation of user interface will require more than 1000 dollars.\n\nThe team includes at least one experienced legal professionists which is very competent in the field of blockchain regulation. This justifies my score 4/5.", "q1r": 4, "q2": "The information provided are quite accurate: the timeline and budget are well outlined, the KPIs are clear and allow a day to day progress tracking, as the indicators are showing the number of projects onboarded using the tools, number of regulators engaged, google analysis and web traffic ect.\nThe only part that I see missing is the logic behind the tool creation, a simple flowchart would have been helpful to understand the approach strategy with the client. \nAnother point that I see missing is the fee applied to the clients: is it fixed or varying according to the project size/complexity ?\nDue to the minor missing points stated above, I am rating this section 4/5.", "q2r": 4, "assessor": "z_assessor_2215", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6617, "q0": "Starting a Web3-related project is not an easy task for everyone in terms of legal frameworks. It is actually very confusing and it could discourage many of the potential entrepreneurs from participating or running one, and this is something that directly affects Cardano. This proposal is really helpful in that sense; its goals are correctly aligned with the ones set up for the challenge, they found the problem and a potential solution and it is definitely scalable since it is mentioned that the team is planning to store information from legal frameworks in a database so that it could help project leaders to realize how it suits them to continue. The fact that there will be a SaaS web application framework and a mobile app is a plus too. (Rating given: 5)\n", "q0r": 5, "q1": "The proposer presents a detailed plan to implement the project, added to a road map in which the team specifies a 6-month milestones work schedule. Moreover, the road map describes the activities for this period of time, it also provides the team some sort of flexibility since it seems not too strict in terms of finishing dates, which means it is quite balanced. One of the strongest aspects of this proposal is related to the project leaders, and it is because the team counts on 2 experienced people in taxing and legal frameworks. Finally, it could be said that the budget seems a little expensive, but it is also true that it provides sufficient details and it is mentioned that it should cover the costs to implement the sustainable program of the project, meaning that they won´t need any other fund in order to function. (Rating given: 5)\n", "q1r": 5, "q2": "The scope of this project is wide, and so is the amount of ways to measure its success of it. The proposer presents a series of metrics that could lead the team to valuable information in order to accomplish this task. Regarding the operational metrics, it is clear that they are thought to show how well the team works and how impactful it is, while the strategic metrics are focused on the scope of the project. In conjunction, they both function as a powerful tools to measure the progress and the potential success of the legal services web. By providing these metrics, the team shows that they clearly understand the settings of the challenges and that they have their objectives aligned with them. (Rating given: 5)\n", "q2r": 5, "assessor": "z_assessor_2822", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7179, "q0": "The proposal is great and corresponds very well to the specific objectives of this challenge, as the proponents state the contextualized problem that they are solving is a lack of clarity in who to talk to when deciding on launching a blockchain project - specifically one that may involve raising capital with NFTs, utility tokens, or security tokens. From what I understand, the idea is that create an application that could guides entrepreneurs and businesses to internationally compliant legal services and structures relevant to Web3 Crypto Blockchain providers. This initiative also would be benefits Web3 Crypto Blockchain developers globally. The project would assist developers in determining where and how to set up their operations to legally and profitably operate within their respective target markets. With this, I believe that the proposal is of high value and fits very well with what we are looking for in this challenge.", "q0r": 5, "q1": "The feasibility of the proposal is very good, with only a few details to improve. We do have all the information that is needed to measure the viability of this project. For example, the team tells us what would happen during 6 months of the development of this project. The roadmap gives us a general idea of what would be done, and the proponents also explain what would be done monthly in detailed. The app-building process involves many things, each of which should have been informed and detail. Talk about the budget, we know how the total amount would be divided into parts, but each of them could have been better explained. To cite the legal services: they ask 10 thousand dollars for this, it is a very high value, it would be important for us to understand exactly how long this process would take place and who would be in the line of forwarding here. Because they are high values, the more detail there is, the better. Without knowing exactly how many hours they will dedicate to the project, we have no idea of the value of their work hours. And finally, talking about the team, this part was great. We know exactly who we would be dealing with, their names, and previous experiences as well as their resumes through their LinkedIn profile, and how they relate to the Cardano ecosystem. Therefore, I think the feasibility of the project is great, with only a few small points to improve.", "q1r": 5, "q2": "The proposers define several ways in which the proposal development process can be followed. The team provides us with mostly numerical indicators to monitor the success of the project (number of projects served, number of inquiries generated, number of regulatory frameworks listed in the database, number of regulatory frameworks listed in the database, etc). These are clear ways to see if the project is successful, but we need to go further. It would be very positive for us to do qualitative analysis, in addition to quantitative ones, so that we could more deeply measure the impact of this project on our blockchain. And about the process, it is not very clear how this information will reach the members of the Cardano community, how will these reports be shared with everyone? Are they posted on Google Drive, or Telegram and community discord channels? The proponent states that such information must be measured, but it is unclear how it would be shared with members of the Cardano community. Now talking about the final results, the success scenario is outlined with quite a specificity, so that we can verify that our goals have been achieved, as we can see from the following excerpt: “through a unified seamless web experience, users will be able to gain a clear perspective on the best options for the location and regulatory oversight for their project; and have an understanding of the issues and legal requirements that may govern their ability to operate as planned.” In this way, we can not only see if the goals were achieved but if what was promised to be done is being fulfilled in the right way and by the intended people. In summary, I think that the proposal is very auditable, it just needs to be clarified with the community Cardano can actively participate in this auditability, and it can be deepened with some qualitative analyzes added to the quantitative ones.", "q2r": 5, "assessor": "z_assessor_2879", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7829, "q0": "The proposal contains a project which is aimed at creating a mobile app as well as an SaaS web application framework with the aim of providing all legal services that Web3 project developers will require. It also aims to assist developers in determining where and how to set up their operations legally and profitably. Additionally, the team aims to use their project to provide clarity for blockchain projects which deals with raising capital with NFTs, utility and security tokens.\nThis proposal has  effectively addressed the challenge and for that reason I will give it a 5 star rating.", "q0r": 5, "q1": "The proposal has given an elaborate and pragmatic plan with which they intend to execute the project. \nThe experience and skills of the team commensurates with the project they plan to undertake. All the legal skills as well as the financial knowledge needed to make this project a reality is embedded in the team behind this proposal.\nThe time frame given to accomplish this project as well as the budget presented is reasonable and achievable.\nThe proposal is therefore highly likely to be implemented successfully. I will therefore give it a 5 star rating.", "q1r": 5, "q2": "The proposal has clearly shown all the task that will be accomplished every month for the next six months. These key metrics with accompanying milestones will make it very easy for the community to audit the progress and success of the project. Additionally, the team will be providing updates of the project to the community through the channels.\nThe information provided in the proposal is sufficient to audit  progress and success. For this reason I gave it a 5 star rating.", "q2r": 5, "assessor": "z_assessor_2924", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8960, "q0": "As Web3 Crypto Blockchain is growing in market exponentially ,but for such Web3 Crypto Blockchain there is limited number legal advisors and financial advisors available in the market , even the charges for such legal advisors is very high where normal people cannot afford them, Hence to develop an app which is conversational and guides entrepreneurs and businesses to internationally compliant legal services and structures relevant to Web3 Crypto Blockchain is a great idea, where people can get easy services of legal administration without much effort involved , Hence ,this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "Completing a task which holds all legal jurisdictions about Web3 Crypto Blockchain is never an easy task, since Web3 is still in developing phase where still it doesn't have proper regularities in certain countries, But the proposer has nearly 25 years of experience in tax-efficient legal structuring and large tax dispute management, and working on International Tax Law at the University of Montpellier researching the Tax Frameworks of Crypto Currencies and Assets, The proposer team has even other member who is lead of development , with these experienced provided the task can be achieved, The proposal contains clear data on how to start the technology, then build website and use the results to make App at last , hence with preplanned ready and Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposed plan could have added other team members who will be working on this project which would have been a boost to the project , since the proposed plan of building interactive App cannot be completed by just 2 members , Excluding above point the audit has presented proposed solution in very detailed manner it involves each step to complete the project.\nThe proposed plan has well structured timeline to complete the project, the audit even contains detailed budget breaking idea, The audit has excellent key indicators which are divided in to Operational measures and Strategic measures to measure the success rate of the project, Hence,the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9082, "q0": "This proposal will develop a conversational webform application that will help guide projects through a workflow that will help them identify their legal needs. This tool could be incredibly impactful if developed and marketed to the ecosystem. Any project could access this tool to assess their own legal needs and be directed to an appropriate resource, even the possibility of being connected to a real live lawyer. This tool would satisfy the goals of the challenge by providing legal and financial advice to the community through a broad targeted platform. The advice would answer a series of broad questions depending upon the circumstance of the individual project. Questions such as which nationality to locate the project in, what is the ideal legal structure, what kinds of regulation will they be subjected to and many others. If successful this project would be an incredible legal asset to the Caradno and broader blockchain ecosystem.", "q0r": 5, "q1": "This proposal is well developed and laid out with an experienced team. There is a clear timeline with specific and measurable details. The KPIs are well aligned with the goal of the proposal. The project will take six months and there are clear steps to be taken at each phase. The team has sufficient development skill and experience to tackle this project. The team, while involved in other projects has sufficient time to complete the proposal as specd. The budget is also appropriate for the scope of the project. There is enough detail to assess it and it looks appropriate for the work to be done. There are clear categories and divisions of the budget that enable a clear overview. Overall, this team is professional, experienced and capable of seeing this through. \n\nI will offer a single caution, however regarding the answer offered to potential risks. I grew up in America and have limited experience with European and Middle eastern cultures, so it may just be a cultural difference. However, the confidence that the team is “one of the premiere providers of legal services,” and, “There is nothing that will prevent our ability to successfully deliver the project,” feels certain to invoke Sr. Murphy (see Murphy’s law) himself. To my ears it comes across as a form of Greek hubris complete with a sense of dark foreshadowing. I would prefer to see an honest assessment of possible risks and solutions for them rather than this potentially over-confident approach. This does not affect the score here due to the professionalism and clear experience throughout the rest of the proposal, and so is offered as a caution to what is an otherwise perfect proposal.  \n", "q1r": 5, "q2": "This proposal presents a clear goal of developing a tool to provide clear, applicable, and immediate legal advice to all sorts of crypto projects, and it lays out a clear set of measurables to be audited. These metrics cover the wide range of projects that this tool is marketed to. The tool has a clearly wide applicability and the metrics being measured represent that well. This proposal does a really good job detailing both the operational metrics post delivery, and the strategic metrics to determine the usefulness. The goal for success is always very detailed and clear. Overall, this proposal is well-done and detailed. I look forward to voting for this myself. ", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12934, "q0": "Recommend a chat app platform about legal advisory services related to Blockchain Providers Crypto Web3. The problem is consistent with the challenge. Building a platform to provide legal advice services to blockchain-related individuals and organizations is in line with the objectives of the Fund 9 challenge. The solution helps to increase the number of communities, the quality of communities with legal expertise, ensuring that individuals and organizations developing projects on Cardano have full legality and legal activities. Proposing to offer the solution is a SaaS web application application application and framework: providing an application platform, providing workflows and databases of legal/legal regimes and their approach to Web3 cryptocurrency blockchain technology. The solution impacts well and ensures that projects in the Cardano Ecosystem have professional legal solutions. We assume that the proposal would run the risk of not being able to cover the full legality of all global projects. Most of the time, each country has a separate legal system, which requires a large and good team of consultants. This for a new proposal is very difficult. The proposal should focus on a few areas of the best understanding to create a solid position, then begin to expand. The proposal aims to provide remote legal solutions to support projects, however, in the process of implementation, the projects will have difficulty in completing all procedures and documents to apply for approval of the project to operate, work with the management agency ... but in the area of the project there may not be lawyers/ experts with enough experience, knowledge in the field to further support. So what are they going to have to do? It is recommended to build a network of connections with key regions and spread globally to ensure adequate service provision to customers. In addition, projects need to be protected by copyright, intellectual property. The proposal should add this important area to the advisory portfolio. \nI rated: 4", "q0r": 4, "q1": "The plan is implemented for a total period of 6 months, the first month. Specific criteria: determine the number of projects served, determine the number of requests created, determine the revenue model, etc. The given plan has appropriate implementation timelines, streamlined work, and concerns. The techniques and structures of building application conversation models have not been explained in detail. Deploying the technology requires a plan to build UI /UX, the mobile application does not have a specific plan. The proposal does not mention where the results will be made public so that the progress of the project can be checked. The $50,000 funding budget accounts for 10% of the total Challenge. The details of the budget spending plan are suitable for each item, we can see how much money is being spent as planned. The proposal does not have an additional budget plan. The proposal needs to reserve the budget of 5% - 10% of the total funding budget to help prevent risks. The project was built by a single company - Imani Partners that advises companies operating on the chain in a variety of ecosystems (BTC, ETH, ADA, etc.). It was founded by Izzat-Begum B. Rajan. And another member is Andrew Forson , head of technology @SCI, each member is assigned specific tasks. The experience of the members is suitable for the job. Verify the identities of members on the LinkedIn channel. All members have professional qualifications suitable for the job.\nI rated: 4 ", "q1r": 4, "q2": "The proposal has a specific implementation roadmap, the completion timelines are appropriate. The measurement index is given in accordance with the implementation roadmap. We have not been able to monitor the measurement indicators, suggest the need to store the details, related documents on GitHub with open source to facilitate the monitoring. Progress reports have not been committed by the author. The proposal does not give specific indicators to measure the success of the project such as: within 6 months will provide legal advice for how many projects will be provided. Kpi proposes that the completion of the application put into operation is appropriate, with a commitment to integrated reporting on jurisdictions and regulatory frameworks related to token generation projects and NFT from security, taxation and other aspects. We recognize thatthis is a project that can have an impact, legal support for all projects around the globe. So link with other legal projects on the Cardano platform to have a wider, more extensive network, to regions such as Asia, the Americas, Oceania ... Or legal organizations in countries and global regions to expand the project. We agree to propose to successfully identify with the right KPIs.\nI rated: 4", "q2r": 4, "assessor": "z_assessor_3514", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Imani Partners proposes a conversational app platform that guides entrepreneurs and businesses to internationally compliant legal services and structures relevant to Web3 Crypto Blockchain providers.", "experience": "Izzat-Begum has +/-25 years of experience in tax-efficient legal structuring and large tax dispute management and is a Ph.D. candidate in International Tax Law at the University of Montpellier researching the Tax Frameworks of Crypto Currencies and Assets. Forson is the dev lead."}