{"id": 422511, "author": "loxeinc", "title": "Mediation Training & Certification", "url": "https://cardano.ideascale.com/a/dtd/422511-48088", "category": 26596, "amount": 19948, "description": "Conflicts within the Cardano community are at large inadequately addressed due to a lack of blockchain-adept dispute resolution specialists.", "f6_no_assessments": 12, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"id": 1726, "q0": "The proposal completely aligns with the objectives of the challenge. Here, a training program is suggested for about 20 people to become mediators (to resolve conflicts so that they do not have to involve the legal system); This perfectly serves the objective of promoting “a direct access to solutions that provide financial and legal services, support and guidance to Emerging Projects in the Catalyst Ecosystem”. The stated problem is that there are many conflicts within (and outside) the Cardano community that are inadequately handled (“many emerging projects on Catalyst face legal and financial issues that prevent them from moving forward”), and there are few mediation experts these days. available. Mediation would be precisely this process in which the parties try to find a solution to their problems with the support of a mediator, who is someone who is technically prepared to deal with this type of situation in the best possible way. Mediation, according to the proponents, does not mean that a third party will make the decision that will completely dissolve the parties' problem, but will guide them through alternative solutions, which do not have to fall into the legal system, which despite from sometimes being indispensable, it is still quite bureaucratic and expensive. So if more mediators are available within our community, the chances of us being able to resolve conflicts properly will increase a lot, and this will be extremely positive for the entire ecosystem, because once situations are unlocked, the problems that previously prevented projects are executed will no longer get in the way of getting the work done. This will generate an increase in team unity (since conflicts often occur between members of the same project), which will enhance the daily work of projects and thus increase the results that would be generated; which would directly contribute to Cardano's overall growth and establishment. In addition to the idea being very valid, it is extremely positive that the proponents explain in detail what the training program for new mediators would be like, which would include parts such as: “integration into mediators.ai (optional for new mediators) + NFT for successful completion program success + ongoing support for a minimum of one year for new mediators”. It is possible, through the information given, to understand how the program would be executed in practice. And it is very relevant the fact that, apparently, it is not necessary to have any specific training to become a mediator, it is enough to be interested and to know how to speak English - if the proposal is successful I think it is a good idea to launch this course in other languages ​​widely spoken by our community, to increase accessibility to mediations for people from different backgrounds. That said, in my view the proposal is highly relevant and fits very well with what the challenge seeks.\n", "q0r": 5, "q1": "It would be very interesting if the activities proposed in the roadmap were more detailed, so that we have a more solid understanding of the project development process. For example, in September, the registration of interested participants would be carried out, as well as the definition of the dates and times of the synchronous sessions. I would like to know how the team intends to publicize the course opportunity, how the Cardano community could become aware of this possibility, in which media they intend to advertise, and in what way (what would the marketing process look like, say?). To increase our level of understanding of the training program, I would like to know what topics would be addressed at each meeting. It is said that “the 40-hour mediation training introduces the basic principles and methods of alternative dispute resolution. This training program provides a solid foundation and mediation skills through lectures, small group exercises and role-play, and is rich in theory and practice.” What would these basic principles and resolution methods be? Although the proponents have defined some milestones, such as by October it is expected to have at least 10 accredited mediators and by December the first cases are being resolved by these mediators, it would be beneficial if we had a little more detail about the course itself and about how it would be publicized. Even the proponents themselves define it as a risk to the project to have a lack of interest in the program (less than 10 participants), so it would be important to know how this situation could be avoided. Speaking of funding, the measured amount of approximately 20,000 dollars, the amount is divided quite satisfactorily. We were able to understand that part of the money would go towards Zoom accounts, part would go towards creating the NFTs and part towards project management (with a value of 34 dollars an hour of work for these tasks). I believe it is important to make it very clear that the training will not be free, because from what I understand the mediators will have to work for the program for a period of 2 years (minimum) to reward the teachings received, I think this is quite fair but it needs to be very explicit, to avoid further problems. Finally, thinking about the team, there is total confidence in this team, both due to the fact that the company behind the proposal (Loxe Inc.) already has good experience with the mediation field; both for the richness of detail with which each member is presented (for example, we know a lot of information about Renata Valrée, we know that Mathias already has a good involvement with Cardano, etc.). That said, I believe the proposal is very viable, only a few details could be added.\n", "q1r": 4, "q2": "The proponents suggest very valid ways to audit the proposal, but in my opinion they are not enough for us to have a complete monitoring of this project. They suggest the partial results that can be used so that we can verify if the proposal is developing as expected (for example, in September the “links to relevant posts and media related to the promotion of the proposal in the Catalyst community + definition of dates would be analyzed”. and schedules based on information from interested participants + number of registered participants”). But how could we evaluate the first activities being developed in the project, behind these small successes? As I commented on feasibility, how could we first audit the training program dissemination? And how could we verify that all interested parties were registered, and if the number of participants greatly exceeded the expected, with what criteria would a selection have been made? Regarding the development of the project in a more advanced way, how could we verify if the meetings were happening as they were agreed in relation to the dates and the contents that would be passed in each one? I think it would be necessary for the team to collect this information at the end of each month, so that we could understand what was done that month, and also how, what activities were behind the achievements, what challenges were faced that month, and so on. Such information could be taken to the community in written reports, which could be disseminated for example through the community's Telegram and Discord channels. Talking about the success scenario, the proponents state that “we will consider this project successful if we manage to get at least 10 registered participants and 10 mediation certificates issued at the end of the course. Our goal is to have 20 dedicated participants signed up instead of just 10, which we consider the ideal outcome.” But in addition to training future mediators, it would be very positive if 1) we had some way of collecting feedback from those who participated in the program; 2) we could have more knowledge about their performance, that is, they would actually be acting as mediators, how many cases would they be solving per semester (for example), if the cases would be relevant to Cardano or not necessarily have to do with our ecosystem... If If we had more details about the consequences of the project, perhaps our understanding of whether the project actually achieved what the challenge proposes would be increased. With that, I believe that auditability is good, but it could be deepened in some aspects.\n", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 909, "q0": "Conflicts between parties in the Cardano ecosystem are only growing, and the legal institutions are not prepared to provide a solution in a way that’s fast and efficient. This proposal tries to address this problem by providing mediation training to interested participants. It tackles this challenge by providing solutions to arising legal problems in the form of train mediators who will try to find a balanced solution that benefits both parties involved.\n\nThe way it will add value to the Cardano ecosystem is by training and certifying members of the Cardano community who have the desire to get started in dispute resolution. In turn, these members will help catalyst and other Cardano projects solve the conflicts they may have. This is great for Cardano since it builds a solid foundation for solving disputes in a way that’s more beneficial for the ecosystem than starting proceedings before the court of any legal court or tribunal.\n\nRegarding scalability, the certification this proposal would offer not only is applicable to US based conflicts, but also international conflicts. Therefore, the voter can assume scalability to address future challenges is viable. Besides, what the proposer are trying to offer, is certification for mediators to get started in dispute resolution through the platform “mediator.ai”. Because of this, scalability in their operation would imply training more participants, which shouldn’t be too hard to achieve.", "q0r": 5, "q1": "The proposer’s skills and experience match the goals and objectives of what they are trying to accomplish. Enough evidence is provided to the voter in the form of personal, professional and academic history and links to official portals that can verify the data provided. The voter can observe that the skills of the proposers, such as certified estate planning mediator or Adjunct Professor in the Negotiation, Conflict Resolution at California State University (in the case of the person in charge of carrying out the training), match the objectives and requirements of the proposal. This is good to see, since it shows that the team that would carry out the roadmap has the knowledge and experience required to successfully obtain their objectives, the fact that the founders of the company in charge of the operation are catalyst members also helps in this regard.\n\nRegarding the team, the members and their assigned tasks are provided along with their LinkedIn accounts and some detailed information on their background, which allows us to have a more complete view of the team structure and their different functions.\n\nWhen it comes to the budget, the amount being asked is a bit less than 20,000 dollars, and it is divided into sections such as: instructors, project management or NFT. Looking at the different sections of the budget and the amount for each of them, the total number seems reasonable. For example, the most expensive section of the budget, which refers to the Instructors, is the average wage an Instructor in the state of California will receive per student.\n\nThe proposal also provides a timeline that includes some key milestones. While this timeline is short and concise in the information it provides, in my opinion it gives the voter the ability to comprehend what will happen and when through the different stages, which basically will be the last months (September, October, November) of the current year.\n\nAt last, the proposal mentions the only possible risks could be lack of interest from participants or cases where the instructors are unable to provide the training. The solution they provide to this is to return the money to Catalyst, which seems like a fair solution. Considering this proposal centers around training people, I can’t think of any other risks that could arise, besides problems with the NFT mint or technical problems. If the team work on that, I see the solutions they provide very fitting and practical.", "q1r": 5, "q2": "As mentioned earlier, the proposal provides a timeline with key milestones which need to be covered to determine success. To measure these milestones, the team will use some already determined metrics for each phase of the project. For example, one metric which will be recorded in September will be the number of register participants. In my opinion, this metrics are great to measure success since they track every step of the project development.\n\nPerhaps, mentioning a public channel where voters could track this progress, would have helped them to know the exact place where they could follow the proposal’s development.", "q2r": 4, "assessor": "z_assessor_2151", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thanks for the suggestion to indicate where the voters could track our progress. Our Twitter account is one way of doing that: https://twitter.com/LoxeInc"}, {"id": 1171, "q0": "The proposal objective is to deliver a training to people who want to become mediators, in order to take out from the court simple cases that can be solved before reaching a trial. \nThis is a smart approach who can help small companies and teams to survive avoiding heavy legal expenses and long processing times for their cases.\nThe training would be provided over a month and it requires an effort of 40 hours.\nThe new onboarded people after the training would provide their services on mediators.ai, that will be available soon on the Cardano mainnet.", "q0r": 5, "q1": "The team is including members who are well experienced in the field of mediation and can provide this type of training.\nRisk 1 Timezone might be an issue to follow the training for people not residing in US.\nRisk 2 Abandon rate especially if the training will be given for free must be taken in account.\nI hope the team will provided recorded sessions and a final test to validate the competences of the mediators. \nI personally appreciate the idea that accredited mediators will receive an NFT as validation of their competences. \nI also like the fact that the new mediators will be supported for a minimum of one year by the trainer(s).", "q1r": 4, "q2": "The proposers provided a detailed budget breakdown and the timeline for this projects, which is variable according to the number of people who enroll and when they will enroll (a minimum of 10 participants is required to start the course).\nI would have liked to see a proposed agenda of topics presented during the course, that's why I am rating this section 4/5.", "q2r": 4, "assessor": "z_assessor_2215", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2949, "q0": "The idea of ​​this proposal is very good and necessary, which is Provide DRPA Certified Mediation Training to members of the Cardano community and reach out to mediators.ai to provide services, mediators their dispute resolution staff to the community while conflicts within the Cardano community are currently not fully resolved due to the lack of qualified blockchain dispute resolution professionals. This is a concern of many people, because as far as I know, currently in the community, there are no (or a few that I don't know) individuals, groups or organizations with skills and reputation to come forward to solve the problem. resolve disputes or litigation because most of the laws of many countries have not yet accepted the legalization of digital currencies. If successfully organizing the training courses, it will create capable mediators to help many emerging projects on Catalyst in particular (the Cardano community in general) not face financial related problems. legal & legal, helping them to develop better.", "q0r": 5, "q1": "In the timelines that the proposal provides, the first milestone is advertising, but here it is not specified how to advertise, by what means to attract subscribers to participate. Although the target number of participants is quite small (10 people), but I think the way of advertising is very important because in my opinion this segment will attract less participants. It would be better if the author detailed it for everyone to follow.\nAs for the budget, the proposed capital requirement of $19,948 seems to me to be reasonable for the amounts mentioned. Regarding the team, the instructors, advisors, and people in charge are all characters with great experience and skills, presented in detail, very specific. Attaching links to each person's profile so people can verify their identity is a plus for the recommendation.", "q1r": 5, "q2": "As suggested, the KPI here is to have at least 10 registered participants and 10 conciliation certificates issued at the end of the course. The proponent also states that the project progress will be tracked for implementation step by step and the stated milestones:\nSeptember 2022:\n- Links to relevant posts and media related to promoting the proposal in the Catalyst community;\n- Definition of date and time based on input of interested participants.\n- Number of registered participants.\nOctober 2022:\n- The NFT policy ID is minted.\nDecember 2022:\nBrief reports and videos include statements provided by instructors and students.", "q2r": 5, "assessor": "z_assessor_2365", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6616, "q0": "Perhaps this proposal is not the most innovative of all, but it is vital for a healthy and sustainable development of the Cardano ecosystem. Providing a mediation training program to form mediators that listen to people in conflict, facilitate dialogue and help them find an appropriate solution to the problem will solve a great portion of the potential issues within the projects on the network. The program consists in a 40-hour training to introduce “the core principles and methods of alternative dispute resolution”. The proposal features a clear problem statement and a possible solution, aligned with the settings of the challenge, and so it addresses the challenge very effectively. (Rating given: 5)\n", "q0r": 5, "q1": "\n\tThe proposer team is formed by a group of experienced people who claims, and provides evidence, to be able to teach the principles of mediation. With extensive careers, the members of the group have expertise in areas related to the proposal: mediation, conflict management, and negotiation. The proposal counts with a broken-down budget, which may lack some details that would allow the community to understand and visualize where these values and calculus come from. Expressing it would make it better in terms of transparency and reliability. The team also proposes a segmented roadmap under the milestones perspectives, that despite being limited in time, it provides the group with some flexibility in order to deal with potential inconveniences. (Rating given: 4)\n", "q1r": 4, "q2": "As was mentioned before, the roadmap was planned from a milestones perspective, which is definitely useful when it comes to auditing the progress. Checking which steps are completed and which ones are not is an efficient way to measure the actual success of the project. The team also provides key milestones that appear to be realistic and so this shows they are down-to-earth. Secondly, the proposer states that evidence of the execution of the program will be presented and later on, a report of the outcome. Since the certificates are going to be minted NFTs, the community will be allowed to verify the results, giving the project a great image because of the transparency. (Rating given: 4)\n", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 7439, "q0": "The project offers a DRPA-certified mediation training course, which is a really interesting aspect. Helping to build a bridge between the parties, thereby resolving legal issues, this project is suitable for the Challenge\nWhen there is a dispute, right and wrong are only relative, it is important that the two sides find a common voice and change their perspectives to find the optimal solution. This is really difficult without a neutral mediator who doesn't make decisions but helps to understand. And qualified mediators will receive certified NFTs on completion of mediation training that meets the training requirements of all local courts in the California Dispute Resolution Act (DRPA), this is a sustainable certificate kept on the blockchain, a great combination with technology\nAs for the risk of a course with less than 10 participants, the project should provide a way to mitigate this, not end it. For example, delaying the course start date, and combining interaction with Cardano communities through communication networks such as Telegram, Fb, and Twitter. This is a very useful course, people will be interested because of the explosion of projects in the next period. I'd be happy to rate this Impact 5 out of 5\n", "q0r": 5, "q1": "This project is a new step forward with the project to create http://mediators.ai/ in fund 6, which is planned to be mainnet in July 2022 to provide dispute resolution services to the community. Help the steps of the plan take place synchronously, timely, and reasonably. All have been listed in detail by the project in 3 months, instructors with 40 hours in training need 10,000$, the total application fund is $ 19,948, accounting for 4% of the total Challenge, a number consistent with the explanation.\nThe team has 3 main members, with a detailed list of experiences and abilities, I evaluate the members with a deep understanding of conflict resolution, peace building, and negotiation, very suitable for project implementation. There are also 4 extra members available to assist. Too great to get a 5 on this part\n", "q1r": 5, "q2": "5 KPIs are listed to measure project progress, all reported every month. These indicators are quite intuitive and easy to quantify. The project please provide a specific link where the project updates these processes, making it easy for the community to monitor. In addition, I would like to add another KPI indicator, the number of members who follow the link that the project updates progress, they may be potential objects.\nThe success of the project when creating 10 certified mediators, helps blockchain projects in general and Cardano, in particular, gets closer together, building a harmonious community and serving the community. I'd be happy to rate it 5\n", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7695, "q0": "The problem described by the proposers meets the challenge, the conflict regulation does not seem to be applicable on the blockchain, which brings more organization of specialized training in this area of ​​law so that the members of the network are equipped on the peaceful settlement of conflicts between them and between members of the communities benefiting from the projects. The establishment of the certification platform as mediators.ai as proposed was a need and therefore solves a problem for members of the cardano community.", "q0r": 5, "q1": "The members of the team carrying the proposal seem to be experienced in various fields including law, blockchain and peaceful conflict resolution, they have experience with the establishment of a legal business since 2021 and law enforcement program firms. settlement of disputes in several countries, so we can hope for the successful implementation of this project. It should also be noted that the plan presented is reasonable in a short time and with a detailed budget corresponding to the challenge.", "q1r": 5, "q2": "The plan presented seems to promise to measure success based on the publication links of the proposal and the media of the courses but also the implementation of the solution itself. It should also be taken into consideration that the evaluation should be based on the number of participants registered and certified according to the period and for this question.  A part from the monthly reports, the proposers have also provided the relevant links to their website and google forms which will allow the follow-up of the project until the effective implementation.", "q2r": 5, "assessor": "z_assessor_2915", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8956, "q0": "As disputes are very commonly seen in all development fields, sometimes even small disputes also causes big effects sometimes, so to reduce the disputes and mediate the issue some qualified persons are needed, in blockchain finding such mediators are very difficult, Hence to overcome such scarcity of mediators the proposer wants to develop a solution where he can train these mediators and work as mediators if the disputes occurs between any parties in the block chain , the idea of making them will be big boost where later they can join and make mediators.ai to make carrier out of it, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed task is not very much difficult to achieve where it wants to train the mediators and certify them, as proposer has worked as former Director for the Dispute Resolution Program for the City of Los Angeles, with her experience the task can be easily achieved ,  Renata has worked as instructor for the 40h mediation training, which shows that proposer has proven experience in both teaching and mediation , there are even other members who have completed Ph.D in mediation , the team even wants to certify the students upon completion  of course, where they can make carrier out of it, hence with minimal risk involved and With given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has introduced all the team members of the project with their relevant experience in both teaching and as well mediating, it also has produced clear picture on how onboarding starts and later continuing with teaching and certifying in the last.\nThe audit has clearly mentioned on how the mentioned problem will be countering the challenge and how it can decrease the scarcity of mediators in cardano eco system, the audit has decent budget breaking idea and decent timeline to complete the project. Hence with minimal risk involved and provided experienced team, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 9080, "q0": "This is an incredibly impactful project for the Cardano ecosystem. The proposal sets out a clear plan to train up to 20 mediators from within the ecosystem. This training would lead to an official mediator certificate. Participants would receive a university level education on mediation, for free. The training is state licensed in California to provide this training. The result would create a group of mediators trained and certified to perform professional mediation. This could resolve many disputes within the catalyst community, and larger Cardano ecosystem. There would also be a special minted NFT certificate proving completion. This is an incredible opportunity for Catalyst to improve the legal ecosystem within Cardano and far beyond. Giving people the training to do this can even provide a livelihood for people looking to upskill or transition to a full-time online role. Overall this project would have a large impact on the goals of this challenge and of the Catalyst goals. ", "q0r": 5, "q1": "The plan is straightforward and workable. There is significant detail in the timeline and the budget, and details of the team. There is no doubt that they can pull this off. They have laid out how the training will work. There is already an interest form gathering information about those interested in becoming mediators. The plan includes follow-up with the new mediators so that they can receive coaching as they put the skills into practice. The budget includes a reasonable fund for the instructor especially considering the presented reality of what is normally charged per student. The proposer is especially skilled and qualified to offer this training, has done it multiple times in the psat and is willing to do it at a steep discount. There are no questions about feasibility here.", "q1r": 5, "q2": "The goal is clear, and the proposal lawy out a clear path toward achieving it. The metrics of success are detailed and appropriate. The goal is to train 10-20 new mediators that would be certified by the end. This alone will complete the proposal successfully. The audit metrics are also appropriate and more than sufficient. There will be a monthly update for each of the three months, culminating in a report that contains a video and statement from instructor and participants. This is the ideal proposal that should be funded by Catalyst, and I believe it will be successful.", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 11910, "q0": "This proposal dialogues very well with the goal of the challenge as to provide  legal services and support to the funded proposers. \nThe proposal is about providing DRPA certified mediation training to the members of the community along with access to the their Dapp mediators.ai for offering dispute resolution services to the community. \n\nI believe this idea will definitely have an immense influence on dispute resolution within the cardano community and help many emerging projects to move forward without facing any legal issues .\n\nAs it is trying to create the dapp for mediation training and certification on cardano and thus it is aligned to the challenge statement. \n\nI think it's great how the authors were  concerned with contextualizing in a very narrative way how this project would take place as they describe in detail all the crucial information  regarding certification, on boarding, offering of NFTs and support for new mediators. Moreover, it clearly depicts how the proposal is able to scale to address future challenges.\n\nIt can be clearly understood that the successful participants of the program will not be limited to mediate blockchain related disputes only based in California but also  will have global impact and encourages the use of cardano dapp around  the world. \n\nThe proposed solution helps to resolve blockchain-adept disputes within the cardano community and thus it clearly articulates how the project if funded adds value to the cardano ecosystem. \nThe proposer is aware of certain risks and has already got strategies for mitigation. \n\nIn my opinion this project will definitely have a huge impact within cardano community because if the proposal is funded the community can resolve their disputes:\n (i) in a confidential and non public forum so as to not alarm their current and future investors and participants\n(ii) in an inexpensive way as they can use their funding to develop platforms and solutions rather than on lawyers and \n(iii)can resolve in less possible time.\nHence I strongly agree that the proposed  solution addresses the challenge effectively in a targeted and relevant manner. ", "q0r": 5, "q1": "The proposing team is highly qualified to carry out the feasibility study laid out in the proposal.\nAll the details of the core team members are provided with their individual expertise and experience along with some useful links such as LinkedIn profiles. Their experience and exposure to the community mediation will ultimately help them in executing the proposal.\n\nA detailed budget breakdown is mentioned .The mentioned budget is reasonable and divided into identifiable subcategories of tasks to be undertaken. The proposal will require additional funding after the successful completion of this study and report finalization. It will be used for the new proposal to incorporate learned lessons and improve scalability.\n\nThe proposal has considered all the possible risks and challenges which they will require to look into for the subsequent phase after this proposal.\n The proposal outlines the complete road map for the project and the plan, dates and milestones seem solid and achievable.\n\nConsidering the above facts, this feasibility study proposal is highly likely to be completed I strongly agree and a score of 5 will justify. ", "q1r": 5, "q2": "The team is highly concerned with auditability as they mentioned the milestones one could use to track its progress. There is a detailed plan which helps in monitoring the progress.\n\nReading the proposal we can understand that the proposal for auditing provides all the information regarding when the desired outcomes of the project can be expected to reach.\n\nThe deliverables of this proposal are declared clearly along with the delivery time for example, the close out report will be submitted by December 15 2022.\nWe can clearly monitor the progress of the proposal by using the evidences that will be provided by the proposal for each milestone.\nI think this part of the proposal is very clear and complete . We have all the required information like steps, milestones and the time in detail which will be sufficient as an evidence to testify the execution of the project.\n\n However, as this is a feasibility study the milestones of this proposal are the final report of the study and I believe  the auditability here is pretty good .Hence I strongly agree that there is sufficient information to assess and overall I give a  score of 5 for auditability.", "q2r": 5, "assessor": "z_assessor_3312", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12079, "q0": "The \"Mediation Training & Certification\" proposal identified a challenging and necessary issue. The proposed solution is to provide DRPA-certified mediation training to members of the Cardano community and access to mediators to provide community dispute resolution services. . This proposal solves many of the problems posed by the project, helping the community to directly access solutions to provide financial and legal services, support and guide the community. The team proposed to give specific examples in the presentation with arguments with core principles, clear methods, and specific, feasible, and highly effective numbers. It shows that the proposed team has carefully researched how to provide a quality mediator training course that answers the question: How to solve the community's need for mediation when a dispute occurs? Mediators are important to the legal system because they reduce the burden on the courts and provide more relevant and meaningful outcomes for the parties. Therefore, the proposed solution addresses the challenge in a targeted and appropriate manner. The proposal identified a number of risks and proposed solutions to overcome all of them. The proposed group risk indicates that in the event of force majeure that the instructor and the backup instructor are unable to conduct the training or are not interested in the program (less than 10 participants), the solution you offer We will return all funding received to Catalyst. However, I have suggestions for the team on solutions to overcome and limit the risks that you have pointed out. In this risk, you only solve one side of the problem that when the project is not done you will return the money to Catalyst, I hope the course can solve the problem of force majeure so that I can This is happening because this is a good proposition given the continuous development of the Cadarno ecosystem – the emergence of more and more complex types of disputes, and to maintain order, a dispute resolution mechanism and formality are required. you choose here to solve this problem. Instead of paying back the grant I hope you will be able to deal with these risks by anticipating possible problems and coming up with a solution to it. In addition, I suggest adding a risk that when the price of ADA drops sharply in the market, it will affect the proposal, so you have a backup budget that will ensure the interests of the participants and the success of the proposal. I rate: 4 points.", "q0r": 4, "q1": "The proposal provides clear timelines for performing the work with specific objectives for each job. Regarding the timeline, the proposal team presented a plan towards the goal of having 20 dedicated participants sign up instead of just 10, which you would expect. However, I hope the training time will be longer because to create and evaluate whether they are really capable or not requires a longer enough time than the 2 months you set, the more optimal results. Proposal implementation results are easily verifiable. Evidence provided to demonstrate implementation of each step and milestone is provided by you on the Catalyst community; NFT. The proposal accounts for nearly 4% of the fund's budget (19948) and has a reasonable spending plan for each specific activity. But hoping that you will have more suggestions in the additional budget to prepare for possible risks. Proposing to assign specific tasks to each member; have experience related to the assigned task; The identity of the group members is easy to verify. Work is based on the ability and experience of each team member. List of core groups and easy-to-identify, authenticated members at linkedin, github, and related legal sites. I rate: 5 points", "q1r": 5, "q2": "Proposals provide KPIs, making it easy to accurately quantify the effectiveness of the proposal and easy to test. Proposal metric successfully measures the number of links to related posts and media related to promoting the proposition in the Catalyst community; Number of registered participants, Summary reports and videos including statements provided by instructors and students. Measurable and easy-to-check Metrics/KPIs can be accessed anytime, anywhere, clearly showing the number and results of work. The proposal clearly states that when the training course can have at least 10 participants registered and 10 conciliation certificates issued at the end of the course. You are aiming to have 20 dedicated participants sign up instead of just 10, which we would consider the optimal outcome. This proposal is workable and I think it will be much more successful than the other. with you think. Offers direct access to solutions that provide financial and legal services, support and guidance to the community. The proposal is brand new, but participants can take advantage of Fund 6's Mutual Beneficial Dispute Resolution proposal once it goes live on the mainnet (July 2022). If funded, be in the top 10% of voting ratings. Besides, the project is 100% in line with SDG 16 of the United Nations: Peace, Justice and Strong Institutions. I rate: 4 points.\n", "q2r": 4, "assessor": "z_assessor_3353", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 13453, "q0": "This proposal seeks  to resolve conflicts within the Cardano community by providing  blockchain-adept dispute resolution specialists services. This service will be offered in the form of mediation, a process where disputing parties find an amicable solution to their issues with the help of a mediator or third party. This proposal provides DRPA-certified mediation training to members of the Cardano community and subsequent free access to mediators. Thus this proposal effectively addresses the challenge", "q0r": 5, "q1": "The plan includes a well laid out approach and will be carried out over the period of four months making  the  schedule reasonable. The proposal's stated funding is feasible  and can assist in achieving the goals. The proposal also features a team that has a the needed qualifications and expertise. Since that the proposer has identified potential challenges and provided some solutions, the proposal has a strong possibility of being implemented successfully.", "q1r": 5, "q2": "The proposal includes  important metrics for assessing the  performance of the proposal, in addition to a flexible schedule and a detailed strategy. The proposal also gives an exhaustive overview of the identified problem as well as a recommended solutions to the challenge. Hence  the information provided is sufficient for evaluating the success and progress of the proposal.", "q2r": 5, "assessor": "z_assessor_3648", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Provide DRPA-certified mediation training to members of the Cardano community and access to mediators.ai to offer their dispute resolution services to the community.", "experience": "Legal tech company founded in 2021 by prolific Catalyst community members, former Director for the Dispute Resolution Program for the City of Los Angeles"}