{"id": 422549, "author": "jpg.store", "title": "JPG DAO: Legal Review", "url": "https://cardano.ideascale.com/a/dtd/422549-48088", "category": 26596, "amount": 50000, "description": "Across the crypto ecosystem and within Cardano exist a lot of tokens that can be construed as securities under the North-American and European laws raising issues of legitimacy and legality.", "f6_no_assessments": 8, "f6_rating": 3.7083333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 828, "q0": "Whereas JPG Store is a leading, important, and widely respected platform on Cardano, I don't think this proposal will have a broad-based impact in providing \"direct access to solutions which provide financial and legal services, support and guidance to emerging Projects in the Catalyst Ecosystem.\"\n\nFunding this proposal will of course help JPG Store navigate securities law in the formation of JPG Store's DAO, but in order to provide maximum benefit to the ecosystem as a whole, I believe the proposal should've included a component that shares some of the findings of JPG Store and their legal counsel with the Cardano community. Even if it required the allocation of more treasury funds, I think commissioning a summary statement or article by your legal counsel that could be published, or even just holding a Twitter Space and/or recorded livestream about issues you ran into navigating legal considerations in the formation of the DAO, could greatly benefit additional projects in the Catalyst Ecosystem. The formation of compliant DAOs in the US is a huge legal issue that deserves some attention and investment from the Catalyst community, but I believe we also have a responsibility to try and share lessons learned via Catalyst funding as broadly as reasonably possible within the community.", "q0r": 3, "q1": "I have little doubt that JPG Store will successfully utilize funds awarded from Catalyst to form the JPG DAO. However, because it's possible the process could be more time consuming than currently expected, it would've been better if the proposal broke down legal considerations to work through with more granularity, and explained potential mitigations in case there are time/cost overruns.\n\nAlso, while I have little doubt that the proposal will result in a legally compliant, JPG DAO, the challenge of forming a DAO that preserves the community driven nature of a platform while also complying with US securities law may be a difficult needle to thread, so if success is measured by how well this balance is struck, that kind of success may not be easy to attain. ", "q1r": 4, "q2": "The proposal states that \"The progress would be tracked as checklist against the Howey test to ensure we don’t fall under the definition of security ... \" but I'm a little unclear about whether this checklist of the Howey Test will be published, or reported in monthly Catalyst coordinator reports, or whether it will just be tracked internally by the JPG Store team. Also, the proposal states that it will have the following impact: \"This will empower other entities within the Cardano ecosystem and crypto as a whole to learn from our roadmap and launch other utilitarian tokens.\" But unless more granular reporting is published by JPG Store's team or their counsel on how the JPG DAO navigates its legal considerations, it may not serve as a particularly useful case study for other Cardano projects to learn from. Simply seeing that JPG Store formed a DAO that has not drawn unwanted attention from the US SEC or other regulatory authorities won't necessarily be a big learning opportunity unless more details about decisions that were made are eventually shared with the community. ", "q2r": 3, "assessor": "z_assessor_2136", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1089, "q0": "At first sight, one might consider that for now we're still in the early stages of the crypto space and because the laws keep changing at a rapid pace, trying to find solutions and set standards in the legal domain regarding tokenisation, DAOs and token utility might be considered premature. However, I think that by starting now to implement solutions, even if they were only for the short term, the developments could help the entire space grow and advance.\nHowever, I would have liked to read more information about the efforts of the JPG team in this venture. As it stands at the moment, the proposal only has minimal information for each of the three main sections and as such, gives the impression that the funding request is put in place just to further their project, without any consideration for the Cardano Community at large - here comes to mind their wording “to learn from our roadmap”, which implies that the findings will not be made available to the Cardano Community in the form of a separate document, but only as a mention in the project’s roadmap.\nFurthermore, the team mentions the formation of their DAO, yet it is completely unclear what the role of this DAO will be, why it is needed and how will the rest of the community benefit from it.\nOverall, I find myself in a position where I neither agree nor disagree with the potential impact the proposal could have on the entire ecosystem.", "q0r": 3, "q1": "I understand that the purpose of this proposal is to find solutions for JPG Store’s DAO tokenisation model, yet I feel there could be a lot more information in the detailed plan section, than just the fact that over a period of 2 weeks, they would be spending 15 hours of consultation with a legal team to come up with a solution for their token model.\nFor the start, I’m asking myself what considerations do they already have? What are the main roadblocks and what potential directions would they be taking? A few sentences about this would have proven that the preliminary discussions with the said legal team have produced at least a minimum of ideas.\nThe budget the team is asking for is $50000, which will be spent entirely on the legal consulting firm. While I am not a US citizen, I know that law firms are expensive in the United States. In the proposal, the rate asked is of $2000 an hour per partner from the  Schulte Roth & Zabel LLC, which is one of the top firms in New York and Washington DC.\nWhile most well-paid lawyers ask for around $800 an hour, I have googled the hourly rates of top lawyers, and indeed some are asking for $2000 an hour, especially those who specialise in taxation, antitrust, restructuring and mergers and acquisitions.\nBut considering that the rate is extremely high, I would have expected the JPG Store team to consider offering some explanations as to why this particular firm is so important in achieving their goals and why they decided to work with them and what particular skill do the partners at the firm have in regards to the crypto space.", "q1r": 3, "q2": "For auditability, the solution the team offered is sensible but they might have forgotten to mention how they plan on letting the community assess the checklist evolution. This aspect is very important, as the funding is successful upon the community voting, paying fees and supporting the blockchain. As such, it is vital to offer as much transparency to the projects funded by the treasury.\nAs mentioned in the impact section, the role of the DAO in the context of this proposal is unclear, so having it mentioned in the last paragraph of the auditability section when describing the vision of success for the project, is to me very confusing. And the DAO is not just mentioned, but it is the focus of the entire answer, looking to me like it was taken from a different proposal and not from this one.", "q2r": 3, "assessor": "z_assessor_2192", "no_vca": 12, "ne": 6, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1421, "q0": "Bringing on more accounting and legal support requires projects that can afford to spend the time and resources educating the expensive professions on web3 prior to specific goals, unless these organizations have a history in the space. When considering the impact on such a (relatively) small amount of funding for the scope of legal and accounting framework, JPG Store has a clear advantage as a profitable company in the ecosystem. Their ability to leverage the existing relationships from top legal counsel in North America, primarily the USA where there is still many questions especially related to DAOs and Securities Laws. \n\nThe primary deviation from the Challenge proposal can be seen in this request (10% of the Challenge) being allocated for only JPG Store’s DAO and it’s legal review. While I believe this to be a net positive for the overall Catalyst / Cardano Community due to their large footprint and very active community - it should be noted that this will be a blueprint for others to follow, not a tool to replicate the process. \n\nIf the community were to pick a clear market leader to set an example with the best lawyers in the country (high cost, selective clients) I believe this would be a worthy spend for high overall community impact. For these reasons I give this a 5/5 ranking.", "q0r": 5, "q1": "Since the work is broken down on two sides, education for the legal team from JPG Store as well as the legal experience and execution it’s worth considering the feasibility of both parties involved. \n\nFrom my research Schulte Roth & Zabel LLP is a top tier legal team in the general financial world with experience going back at least to 2015 when the CFTC discussed their thoughts on Bitcoin. This means they have spent the time being engaged in regulatory discussions, educating existing financial institutions, and being thought leaders in the legal crypto space. This alone makes me more confident the spend on this proposal would bring a clear opinion to the overall community on how DAOs can succeed in Cardano. \n\nJPG Store and Blake (Founder) have been very open and engaged with the broader Cardano community as they have launched and built the marketplace. From hosting Twitter spaces addressing key concerns, often taking the feedback to reverse a decision they may have made too hastily even, shows me a level of empathy and engagement needed in building the initial framework for a DAO. \n\nFurthermore this direct access has given Blake a great name and the company rocketed to the #1 Marketplace on Cardano. With this broad of a reach (90%+ marketshare) it’s likely the largest active community using an app on Cardano. \n\nWith the high calibre legal team + the large community visibility of JPG Store, I think there is a high likelihood of creating a solid legal review of a DAO structure that any number of USA based companies could mimic. For these reasons I give this a 5/5 ranking", "q1r": 5, "q2": "While the Challenge parameters are a little vague on distinct Key Metrics to track, I believe that Auditability will be quite straightforward for this proposal. There isn’t a deliverable beyond a legal review and checklist against the Howey Test ( the legal US test to determine if a Security is being issued ), this increases feasibility and gives us a clear deliverable for Auditability. \n\nI would like to see JPG Store also include appropriate legal opinions and notes that help others create a framework or example to follow as they build different companies. While each of these companies would require their own legal counsel, it would likely save 100’s of thousands of dollars in billable hours over time. \n\nFor the simplicity and the clear deliverable I give this a 5/5 ranking. ", "q2r": 5, "assessor": "z_assessor_2241", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1963, "q0": "The proposing team are the people behind jpg.store, one of the most widely adopted NFT marketplaces on Cardano. They have grown into an important actor in the Cardano ecospace and staying compliant with the law is a requirement for future success. The “Legal & Financial Implementations” challenge setting intends to fund proposals just like this one in order for them to stay compliant. They intend to perform a legal review, which aligns perfectly to the “Legal & Financial Implementations” campaign brief. As a result, they will receive 5 points in terms of impact.", "q0r": 5, "q1": "The proposers are as mentioned the team behind jpg.store. They are very credible in this regard and have already started initial discussion with the legal party they intend to continue their work with. Additionally, the nature of the proposal, a legal review, is very feasible as long as funds are provided. The budget is outlined clearly, legal fees are expensive and the proposal is transparent in this regard. There is little to no doubt that any risks will challenge the feasibility of this legal review. 5 points in terms of feasibility.", "q1r": 5, "q2": "The proposal is “simple” in its nature that they intend to perform a legal review. In that sense, a roadmap with detailed planning can be of a simpler nature. The proposers will use a Howey test as their method of progress tracking, which is a well suited method for the purpose. The few parts to improve in terms of auditability could be to provide a public channel/blog where the progress is provided to the community during the legal review. Also, the definition of success is a bit hard to define as a measurable goal since staying compliant with the law can be hard to properly assess. All in all, the auditability is great given the scope and nature of a legal review and it will receive 5 points as a result. ", "q2r": 5, "assessor": "z_assessor_2290", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6740, "q0": "JPG store is a Cardano based NFT marketplace which also provides assistance to the artists in the community. Through this proposal they are reaching out to the Catalyst community because they intend to launch a DAO and token, and are seeking to fund a discussion with Schulte Roth & Zabel, a law firm, in order to help them choose the best path forward in order to avoid risks which can materialize down the road, for instance that of the token being considered a security under the existing legislation. \n\nThere is a very clear value proposition in front of us, and the proposal is very well aligned with the challenge, since its purpose is, remember, to fund projects that can help Catalyst proposers to better navigate the legal and financial challenges. The risk that the proposers would like to steer clear of (being considered a security) is definitely real, and we only have to go as far as recalling the well known SEC vs. Ripple case, which is still ongoing. While this is definitely one of the few prominent cases of such nature, and not proof of an endemic problem in this direction, the fact that the JPG store decides to cover all bases here is a laudable thing. \n\nConsidering all of the above, this is definitely a proposal that fits well with the challenge. ", "q0r": 5, "q1": "Here is how the project would take place. The JPG store’s executives would enter discussions with legal experts to ensure the creation of a DAO. The budget is very simple to understand. The legal assistance will materialize in 30 hours of assistance, out of which 20 would be charged by 2 partners (for an hourly fee of 2.000 USD) while an associate would charge 10 additional hours, for an hourly fee of 1.000 USD. The hourly rates are slightly on the higher end, but in the end it is each voter’s responsibility to judge the value for money for each individual proposal. \n\nA rather weak part of the proposal is the presentation of the team, or rather its lack thereof. We are merely informed that, from JPG store’s part, their “C-Level executives will be interfacing with the law firm”, but we are not being told who those executives are. Unfortunately, neither does their website shed more light into the matter, because the entire team sits behind pretty NFT photos and nicknames (Blakelock, Shabro, Yellowbutt, etcetera). Of course, privacy is an important matter, but I believe that executives of important Cardano projects (especially when asking for funding) have a duty of transparency towards the community, and this is definitely not the case here. \n\nFrom my point of view, the team’s anonymity is a very major issue, and I can’t hold a straight face and offer more than three stars given that the community is not able to verify even a basic identity of the founders.  ", "q1r": 3, "q2": "There is an excellent point of reference offered to track the progress of the project, and that is a checklist against the Howey test. For those not in the know, the Howey test was designed by the US Supreme Court in 1946 to assess whether a certain business arrangement (a leaseback of a citrus plantation in that case) constituted or not an investment contract. The test in itself had withstood the test of time, and, albeit now there are other ways to ascertain that problem, it remains an important point of reference not only in the US. \n\nWhat would have turned this proposal into an excellent one is a feedback loop through which the Cardano community can also benefit from funding this proposal. For instance, considering the already rather steep pricing behind this consulting project, it would not have cost too much in additional money to ask the law firm to document the discussions had and turn them into a report that can be shared with the community and be of reference point for future Cardano projects that will be faced with similar challenges in the future. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7178, "q0": "Theoretically, the idea is good and fits the objectives of the challenge, however, the proposal is explained in a very superficial way. I agree that the Cardano ecosystem exists a lot of tokens that can be construed as securities under the North-American and European laws raising issues of legitimacy and legality. And the proponent intends to create a JPG DAO and tokens are in line with the legal requirements and outlines of the land. By sitting down with the partners and associates at Schulte Roth & Zabel LLP, they would discuss the plan the team has for the DAO and its token. However, as I said at the beginning of the analysis, the proposal as a whole is very abstract, we know that it would be a legal business but what issues would be addressed exactly? I think the proponent does not explain how this project “bring the DAO and token into the confines of the law to ensure long term growth of JPG”, what this “We will be sitting down with the partners and associates at Schulte Roth & Zabel LLP to discuss the plan we have for the DAO and its token”… In short, nothing is said about the practical part of this initiative, how this legal review would happen, how would it be done so that we would have more confidence in the process. In general, I think the idea is a good one and it aligns with the goals of the challenge, theoretically, as it certainly seems to be a project that will help improve the Cardano ecosystem. However, I could not understand the activities that are developed here so well. I would like it to be better explained in practice.", "q0r": 2, "q1": "The script of the proposal is extremely superficial. It is explained the project would be executed over 2 weeks, which I believe is the total project development time. All we are told is that “in this time period, the team would use up 15 hours of consultation with the legal team to reach decisions regarding the path JPG needs to take to create its token”, perceive that the proponent does not detail the activities that would be carried out? We know what would be done, but not how it would be done. The roadmap only mentions that the project will be done in 2 weeks, and its activities are not explained so it would be a lie to say that it is possible to understand the process. What happens in pre-production? Who will do that? Regarding the budget, a very high amount is requested, but the same thing happens: we are informed in a very basic way about expenses, for example in “Partners: 2000/hour”, “Associate: 1000/hour”, and “10 hours * 2 partners + 1 associate = 50k”. But who will do what, in what order, and why? Why would the partners cost 2 thousand dollars? I think all parts should be carefully detailed, mainly because they are such expensive values. Finally, speaking of the team, we don’t know details about those involved. We need to know who we are dealing with to have confidence that they are capable of executing the project. Who are they? What are their names? What jobs have they done before? How can we prove that they are prepared for this? It would be necessary for them to present us with a brief curriculum with their past experiences and also what kind of involvement they have with Cardano. Overall, the whole topic needs improvement.", "q1r": 1, "q2": "Auditability is not adequate. It is said that progress tracking would be done through a checklist against the Howey test to ensure they don’t fall under the definition of security as they fine tune the narrative and functionalities of the token and DAO. But we don’t know about the pre-production process, or all the steps necessary to get there? It is said that the project would majorly be executed in collaboration with a legal firm, but again the information given is very superficial, we don’t understand exactly how the collaboration would be done from each part of the project as a whole. It is also unclear how this information would reach members of the Cardano community. In my view, to improve this, the roadmap should be better detailed, from which weekly reports should be generated, for example, on how their work routines have been, and make them available to the entire Cardano community, its partial results were achieved, etc. There would need to be several smaller goals, and measurable data, that would allow our community members to understand if this was achieved and how. Unfortunately, I don’t think the auditability is enough for us to accurately monitor the project. It deserves to be further explored and more details need to be added here.  ", "q2r": 1, "assessor": "z_assessor_2879", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8959, "q0": "We have seen in cardano eco system alone there are lot of tokens being minted everyday , every proposer wants to have his way of tokenization , most of the proposer have no idea whether these tokens are legal and advisable to be used in all places of the world, Hence to counter this challenge the legal team wants to ,review the coins minted and wants to check the law regulations North-American and European laws whether it is passing all the legal regulations so that no security concern might occur in the future, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposal doesn't involve any risk where the proposer's team has to find the best legal advisors from North-America and Europe, and set up the meeting and discuss whether these DAO created are legal and whether these JPG DAO in line with the legal requirements and outlines of the land.\nThe proposer's main job is finding the best advocates from North-America and Europe who have all legal knowledge related to block chain ,the browser could have even added about what measures will the team take if the tokens are not legitimate, with minimal risks involved  plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposed plan is very simple where they want to get the lawyers and verify the JPG DAO's, the audit should have added what are the measures that their team will take if they find any JPG token is not legitimate, will they create any awareness or will they file a report in court so that such coin will be on hold for particular of time and later that can be banned so that people will not be  fooled from fake coins, The audit has mentioned the proposer is using 50k dollars for the project where it is huge money for such project ,where 10 hours fees is 50k dollars which is way too much to audit the progress, with simple plan produced the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9081, "q0": "This proposal is to pay for legal assistance for a single project, jpg.store to be able to legally create a token that will shield the business owners and the NFT owners. This is a complicated and expensive project that has the likelihood of becoming a case study in how to develop a legal token that upholds the ideals of decentralization. The reason for the low score is that while this may end up having a huge impact in the long-run, the cost/impact ratio feels really out of line compared to the rest of the proposals in this challenge. This is seeking $50,000 to spend only on lawyers. No shade thrown here as excellent legal counsel costs top dollar. But to set aside 10% of the entire fund budget for a single project to develop a legal strategy feels off to me. I would rather fund two or three other proposals that may have a larger radius of influence. This is my assessment, but I recognize that jpg.store has a huge following, and that they may be a trendsetter in this regard. The influence here could be tremendous if their legal team helps them to create a unique solution to developing a completely legally compliant token that also is able to uphold all the values of Cardano. So, in my opinion it is not worth the price, but others will disagree, and if so I would be happy to see this succeed. ", "q0r": 2, "q1": "This is a short term project with minimal detail in the budget, but the detail provided is more than enough. The budget is literally just going to the lawyers. The goal of this is to meet with the lawyers, and then let them create a legal framework for accomplishing the goals of the jpg.store Token. The lawyers will do their work and then jpg.store will move on that advice. Really straightforward, nothing to really document or worry about here. The team is not even setting side funding for their own executives’ time to be reimbursed. There are no questions about feasibility here.", "q1r": 4, "q2": "The goal is clear, and the project’s visibility ensures that once completed, this will be known by the community. There are no metrics or auditability statements other than to ensure the token is not treated as a security. This is straightforward and achievable by the lawyers. It would have been nice for the team to put a little extra detail into this element. But they plan to be done in two weeks post-funding. I believe it will succeed as planned.", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "We want to consult with the best North American legal experts to ensure the creation of the JPG DAO and token are in line with the legal requirements and outlines of the land.", "experience": "The team at JPG launched the marketplace in the second week of November 2021. Since then JPG has pushed to create a user driven marketplace servicing all NFTs on Cardano. We have registered JPG Store as a legal business in North America within the confines of the local law."}