{"id": 423039, "author": "dlt360team", "title": "DLT360: Securities Law & Tokens", "url": "https://cardano.ideascale.com/a/dtd/423039-48088", "category": 26596, "amount": 12500, "description": "Token issuance is fundamental for most blockchain projects, communities & companies. However, securities regulation around the world is about to create sweeping obligations, which must be mapped", "f6_no_assessments": 8, "f6_rating": 4.083333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 6746, "q0": "We have in front of us a value proposition that fits extremely well with the challenge. The DLT360 team are offering to perform a mapping exercise of the emerging regulatory framework applicable to securities and the issuance of digital assets, and they wish to begin with the US and the EU markets, which is a very logical step since they are indeed the biggest potential markets that attract such products, given the increased levels of funding accessible compared to other jurisdictions. \n\nJust as an example, a very high impact area is of course the connection between launching a token and the risk of that token being categorized as a security under the applicable legislation, since this usually entails great regulatory risks as well as a significant burden for the team launching the token. \n\nIn conclusion, an excellent fit with the challenge and a very good scalability potential since everyone from the community can benefit from the study. ", "q0r": 5, "q1": "The DLT360 is a team of regulatory experts which devote a significant portion of their time to projects tailored for the Cardano community. Their core team consists of 15+ experts, and it is extremely good news to see that the team has actually increased since Fund 8. They are backed by additional contributors, academic partners, leaders from relevant business sectors as well as having government connections, especially in the EU. Hence, they have a strong presence in this niche market of offering legal consulting services around the blockchain industry. They have been extensively funded in the previous Catalyst rounds and are well seen within the community. This is perhaps the best proof that in general, DLT360 manages to identify the needs of the community and turn them into projects with significant added value.  \n\nTheir success can also be perceived as a headwind as well, since I have to draw the attention right now to their significant workload. As a brief recall, they were initially funded in Fund 6, and afterwards have been very successful at proposing winning projects in Fund 7 and 8, and, at this point, it is rather challenging, as a PA, to even track all their ongoing projects. The depth and breadth of the projects they onboard is also extensive, ranging from data privacy, metaverse interoperability, industrial applications, agriculture, and so forth. \n\nOf course, taking on such an extensive workload can potentially increase the overall operational risks and decrease the perceived feasibility of any additional project. As examples of these risks I bring forth potentially overlapping deadlines, under-delivering on the lowest impact projects, difficulty in distinguishing the added value of one project over another, increased stress, and many others.  \n\nThe budget proposed here is very reasonable, both in terms of the hourly rates proposed (30 to 100 USD/hour, depending on seniority) as well as in the hours necessary to complete the task: 200 research hours and 30 expert review ones. Modest budgets are reserved for graphic design and for interviews and webinars. \n\nTimewise, the project would take ten weeks to implement. The first two would be focused on gathering the necessary information regarding legislative proposals in the US and EU, the following four would focus on answering the specific questions (digital assets classification, securities specific topics, identifying responsible regulatory bodies, disclosure obligations, etc.). The last four weeks would focus on putting all the information together and connecting it with DLT360’s existing reporting platform. \n\nConsidering the modest budget of the proposal, compared to the existing DLT360 workload (that being my most significant worry) I think this project is highly feasible, sits at the core of the team’s competencies and deserves five stars. ", "q1r": 5, "q2": "The team is doing a very good job at identifying the relevant performance indicators for this proposal: legislative proposals analyzed, questions answered, presentations or reports created, and a few others. An excellent proposal would have included an initial target for each of these categories. Sadly, we don’t have such actual figures. \n\nThe silver lining of having so many ongoing projects is that it is rather easy to assess the auditability of each additional project. DLT60’s projects are tightly connected and since the reporting mechanisms are similar, the team is of course already aware of Catalyst’s reporting process. Hence, we do not have any additional risks for the community not being able to properly oversee and keep itself informed with the developments of this proposal, or any other DLT360’s project for that matter. \n\nMy following comment is very similar to the one I have made in the previous funding round, since it still holds true: The team has already built a website that acts as a reporting tool. \nAlthough it has slightly more informative pages compared to Fund 7, there is still no information of recent presentations, articles, research done or at least a general update for all the ongoing projects. Albeit being a work in progress, an excellent addition to it would be to upload live presentations / slides / supporting materials as soon as possible and be accessible for the community as an intermediate deliverable until the projects are finalized. Also, for the sake of transparency, a user-friendly list of funded proposals would definitely be appreciated.   \n\nIn conclusion, given the lack of specific targets for the performance indicators, but more importantly to the existing website which is lacking in substance after so many successful funding rounds, I deem four stars as appropriate. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 371, "q0": "The proposal effectively addresses the challenge. Building out a legal understanding for token issuers in the US, EU, and beyond is extremely helpful to funded proposers in the Catalyst space. \n", "q0r": 5, "q1": "The team behind the proposal seems to have the expertese needed to be successful with a proposal around legal regulation of digital assets.\n\nThe risks section proposes the most pressing issue that can come to mind regarding the proposal. It offers a general mitigation strategy of constant updating. It would have been great to see more risks listed in this section pertaining to usage and accuracy of information along with their associated mitigation strategy. \n\nThe detailed plan section does include good information pertaining to timeline and associated deliverables. This helps create a more robust understanding of the proposal and what it aims to achieve. \n", "q1r": 4, "q2": "The proposed solution section does a nice job of illustrating the problem and solution at hand from a broad perspective. Unfortunately there isn't a clear plan set forth. The reader knows they will be mapping out regulator obligations in the Navigator and Risk & Opportunity section of their project, but there isn't a sense of what this mapping out will result in. What is the experience like for a token issuer looking to obtain information on the regulations that could impact them? More clarity on this would be very helpful to understanding the projects goals.\n\nThe proposal is enjoyable and does a good job of showing off a challenge accurate proposal that has big impact. The only thing its missing is a bit more context on what the end result would be.", "q2r": 4, "assessor": "z_assessor_2070", "no_vca": 20, "ne": 2, "ng": 12, "nfo": 6, "vca_o": 1}, {"id": 524, "q0": "While this proposal does provide \"A direct access to\" legal advice, having a central repository to access \"mapped Securities regulation around the world\" is an excellent first step thinking about a token project. \n\nFive stars because the proposal explicitly  calls out  the challenge setting goal of \"providing funded proposals with solutions and services to operate legally in their residing country\" and provides a reasonable justification for why this solution answers that goal. \n\nOne primary risk has been identified along with a sound mitigation strategy. ", "q0r": 5, "q1": "The has provided details about milestone and timeline spanning 6 to 10 weeks, diving into two big chunks. \n\nThere is a detailed budget with four line items covering different types and stages of the work. \n\nThe team already has experience with similar projects in the space; they are the right folks for the job. ", "q1r": 5, "q2": "The proposal has provided 6 metrics they plan to track. Would have love to see how they plan to manage the work from week to week and how the community can follow along. \n\nThere is one definition of success, would have love to see it clearly linked back to the challenge's definition of success so the community can easily gauge that the solution deliver is what was asked for in the challenge.  ", "q2r": 4, "assessor": "z_assessor_2098", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 1407, "q0": "Yes, this proposal effectively addresses the challenge by researching and providing community guidance/information on incoming regulatory requirements in the US and the EU, and then will include additional jurisdictions. This will help improve the legal and financial implementations since groups will be easily able to find which regulations apply in their jurisdictions, and how they can proceed. \n\nThis type of proposal will likely have a major impact on the ecosystem by creating a robust overview of existing securities regulations by jurisdiction, something that does not currently exist in the community. By introducing this overview, groups will not need to spend countless hours doing research for their regulatory requirements, and it may also reduce the likelihood of projects proceeding without having done their due diligence, thereby causing issues down the line for the projects themselves and their users. ", "q0r": 5, "q1": "Yes, given the experience and plan presented, it is highly likely that this project will be implemented successfully. \n\nFirst off, the DLT360 team has an excellent track record of providing very high quality useful information to the Cardano community. Having been funded for several rounds now, this group continues to expand their repertoire by focusing on the unique legal and jurisdictional challenges facing the blockchain space. It is no doubt that if funded the team will continue to deliver this high quality material. \n\nOverall the plan is clear and easy to follow. Exploring the existing legislative proposals and breaking them down by their component parts into a series of 20+ questions to help blockchain projects and teams. The team also has a lot of experience in-house to complete the work and has their budget set at a very modest amount. Given the potential impact of this proposal, the low budget and potentially high return makes this project an easy win for the community. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nThe DLT360 team also has a great track record of showcasing their products and successes to the community through events such as the TownHalls and Ideafest. The team continues to engage across the community and are known for their outstanding work. \n\nSince the plan is straight forward, it's quite easy for the community to audit. Moreover, they do a good job at providing their KPIs that align nicely with the plan. Being able to see exactly what they analyzed, how deep they went on answering their questions, and the reports provided to the community, anyone interested will be able to see whether the team met their objectives. \n\nWhile not reducing a mark, I would encourage the team to consider a more tangible success measurement. While it's great to have a \"clearly mapped out legal environment\" there is no real way to evaluate \"clearly mapped out\". Clear by what standards? Who is telling you it's clear? Will you have community engagement sessions to validate the findings and questions? ", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3643, "q0": "The proposal aims to provide in-depth assessment of the legislative landscape in the USA and Europe regarding the issuance of securities tokens. The proposal has been presented in the correct challenge of “Legal & Financial Implementations”. The main risk of quickly evolving and uncertain regulatory frameworks was successfully identified by the team, their mitigation plan is to follow closely the developments and update the work. To summarize, this is an excellent and much needed project for the Cardano ecosystem.", "q0r": 5, "q1": "The team is composed by legal senior advisors and a legal analyst, all of whom seem to be well educated and knowledgeable about legal compliance. Unfortunately no links to personal LinkedIn or similar websites was provided in the proposal or in their website. The timeline provided seems reasonable and achievable with the team described. Their goal is to have content created based on the research done by week number six to ten since starting the project. The budget breakdown seems reasonable with the majority of the funding dedicated to the research and content development by legal analysts.", "q1r": 4, "q2": "The proposal describes several KPIs for measuring and tracking progress of the project. Such as number of reports created and legislative proposals analyzed. What it’s missing is  the site where this information will be posted for the community to audit. It would also have been valuable if they provided a goal to reach for each KPI. For example are they going to analyze every State in the US and every country in the EU? Or just focus in the most popular ones? Other than that I personally think the proposal provides enough information and auditability material. ", "q2r": 4, "assessor": "z_assessor_2465", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9084, "q0": "The goal of this proposal is to have the team behind the proposal to do legal research into upcoming legislation from the US and EU regarding crypto. Upon the completion of their research, they will update some pages on their website with this information. There is no mention of a public report that is not attached to their website. And based upon the information in the proposal and available on their website, I am not sure if those resources will be freely available, or will require some sort of payment. If they are freely available, then this proposal can have an impact on the community that is aware of the DLT360 website, or that come across any information that the law firm may choose to publish. But at assessment time, there was no obvious plan in the proposal to make the information publicly available. So based upon the proposal, I would have to say it is likely that the impact will be limited by the lack of a clear plan to report out to the catalyst or beyond their website. ", "q0r": 2, "q1": "The project itself appears very feasible for skilled and qualified law firms such as the one making the proposal. The main thrust is to research the legal realities coming with new legislation in the US and EU and then to create reports containing that information. The budget is appropriate for the number of hours for these tasks, and is designated accordingly. The time frame looks reasonable to accomplish the work and matches well with the goals of the project. I have no doubt based upon the website alone that this team will do an excellent job of preparing and presenting the information in an informational and visually appropriate way. This would have been given a five if there had been just a bit more detail regarding the timeframe in terms of deliverables, or measurable tasks. ", "q1r": 4, "q2": "This proposal lays out a clear plan, but I am concerned that it would not be audited by the community. The metrics that they measure could be entirely metrics as there is no clear indication that the team intends to report their findings in a public manner. Their website has reports, but they are incomplete, and the navigator is currently behind a password. This could be easily explainable, but the proposal was not detailed enough in this way, and it was submitted so late in the process, that there was no time for comment during the refine and finalize phases. That is why I have given it a 3. ", "q2r": 3, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14255, "q0": "This proposal has a good impact. This proposal will outline emerging securities regulations and obligations around the issuance of tokens and digital assets. The problem they raised is suitable for the challenge. It addresses two regulatory aspects that sponsored proposals may encounter: Securities Law and Tokens. According to their description, their approach is that the proposal will start with legal research in these 2 areas in the US and EU and then scale up, branching out into other jurisdictions. As can be seen, this proposal will provide funded proposals with solutions and services to legally operate in their country of residence. This proposal addresses one of the most fundamental regulatory challenges facing Catalyst-funded projects: how to issue tokens in a compliant manner. DLT 360's solution was to study the Lummis-Gillibrand (US) Bill and the Market Regulations in Cryptocurrency (EU) to map out these obligations in the Navigator, while also assessing the risks. Our Risk and Opportunity Radar contains related risks and opportunities. In addition, presentations and reports will provide an in-depth assessment. I assess that this solution will be a useful tool that can provide legal support to help sponsors around the world (first of all, the US and European countries) ensure the Regulation stock. Their argument is consistent. They have a risk perception that \"the content of the new laws can be understood at a higher level, the detailed terms and obligations will be subject to change as the law is finalized,\" and I agree with the solution. law they propose. The impact score is quite high, but not a perfect score because they still have a lot of work to do.\n", "q0r": 4, "q1": "They have an action plan. They will implement this proposal within 10 weeks (2.5 months). However, the timeline and work in the plan are not really reasonable. They should conduct a survey to collect data on token sale proposals and find out what problems these proposals have been facing. What obstacles do they face? Implement a communication plan for marketing, soliciting token issuance proposals at Fund 9 for consulting and service provision. They have not set a target quantity and quality for the service they will provide. The community needs to know exactly how many funded proposals this proposal will legally support. How many tutorial answers are public? How many documents are provided? How many seminars are held? How many countries/regions did they research in the field of Securities Law & Tokens? The community can track and monitor the proposal's progress by visiting https://www.dlt360consulting.com/. Regarding the budget, the fundraising budget accounts for 2.5% of the total. challenge, the budget is not too high. However, this budget is only for expenses: research & development of content; evaluated and edited by senior legal experts; graphic design; interviews & webinars with legal experts. There is no budget for project management, website management, budget for communication, contingencies... The team should recalculate details of costs and budgets. Regarding the team, The team consists of four main members and other members of the DLT360 team. They have specific tasks assigned to each member. However, they do not provide an affiliate address like Linkedin or similar, and they have not fully described and provided the qualifications and work experience of DLT360 team members. I appreciate them asking questions. This is a pretty real problem. I appreciate their focus on resolving Securities Law and Tokens issues in the US and Europe before expanding to other regions. However, it is necessary to review the implementation plan and spending budget.\n", "q1r": 3, "q2": "I do not appreciate the transparency of this proposal. The proposal has no metrics of project success. It's hard for the community to test the quality of service they provide for sponsored proposals. They should add a rating index and community interaction on the platform to discuss the issues consulted and answered. The success of the proposal is pretty well described, which will clearly map the regulatory environment for token issuance in the US and the European Union. The success of this proposal will, of course, have a positive impact on the challenge. This is a new proposal and has not yet been tested.\n", "q2r": 1, "assessor": "z_assessor_3950", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14287, "q0": "This proposer provided a clear and concise description that addresses the challenge. Their problem statement best describes the challenge. The idea behind will back and help those who are already in and those who wants to join the ecosystem. Because most parts of the world is battling with the legalization of the ecosystem into their economy. This proposal will have very good impact on the Cardano/Catalyst ecosystem. It clearly describes and articulates how it will add value to the Cardano and Catalyst ecosystem in general and It will help the users with very strong legal backing across globally. Just in case this proposal comes into existence users of the cardano and catalyst ecosystem will easy find lawyers who best understand the ecosystem and can well defend them in any situation they find themselves in. The KPIs in the porposal have a good profile and their background and their experience so far I believe they can do the job. Also looking at the future I think this proposal scale to address the future challenge as well.", "q0r": 5, "q1": "With the experience and skill set of the team I think they can preform if given the chance. The proposal came with a reference link which talks about the team but I was looking forward to see links for example like LinkedIn which best describes their working experience and what they doing right now. Rather the reference link leads to their own website which doesn’t move me. Their budget breakdown is very understandable and readable, it clearly shows how the money will be disburse. With the way their budget is structured if they are going to work according to their plan I think the purpose of this proposal will be achieved. Also the proposal seen not to address anything about additional fundings because there’s no plan or additional estimate which talks about additional funding. They also did showed and stated how they are going to implement their plan as well, and it comes with the kind of activities they do will do in each week. The proposal also seems to address the architectural and technical plan to implement it but they didn’t talk about the kind languages they are going use in reaching out to the world. Because in my own view for someone to buy into your idea that you are selling you have to use a language that the people seem to understand better. Lastly their risk assessment is very convincing with what they stated I quote “ To mitigate this risk, we will make sure to monitor legislative developments closely, and to update our work accordingly” and it a brilliant idea.", "q1r": 4, "q2": "There was something I was looking out to see in the team which is an accountant or a finance person but I found non. My question is who is going to manage their finances while there is non in there. I truly admit I said it earlier that I like the way they have breakdown their budget but my issue is the one to manage it. Their timeline was breakdown into weeks and it is well structured and for that I approve of it. ", "q2r": 3, "assessor": "z_assessor_3956", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "DLT360's Legal Team will map out emerging securities regulation and obligations around token & digital asset issuance, beginning in the US and EU and later branching out to other jurisdictions.", "experience": "DLT360's Legal Segment consists of a team of senior lawyers with many years of experience in leading international law firms, combined with a team of talented junior legal analysts with the legal research background necessary to fulfil this objective."}