{"id": 423077, "author": "quasar", "title": "Global Compliance 200+ Jurisdiction", "url": "https://cardano.ideascale.com/a/dtd/423077-48088", "category": 26596, "amount": 26700, "description": "Project Catalyst is the largest global digital nation state in history and must address the global legal & financial regulations to have peace of mind and confidence in Catalyst.", "f6_no_assessments": 8, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 6747, "q0": "There is a very interesting value proposition behind this proposal, but as well a very complex regulatory landscape encompassing it. The aim is to create a compliance as a service tool that allows proposers to access a decentralized identity solution for performing the KYC onboarding process. When implemented, such a tool would be an excellent off-the-shelf solution for other projects activating in the niches of marketplaces or any other products including fiat on-ramps or exchanges of value with its users, since there will be a necessity to perform KYC procedures for each user, the extent of which being dependent on the location of the business and the location of the end user. \n\nA great challenge here is the fact that the KYC regulatory requirements vary from country to country, and it will be extremely challenging for any solution to cater to an audience wider than a single country without extensive resources dedicated to the research of each particular jurisdiction’s particularities. We are not being explicitly told, but judging by the jargon used in this proposal, it will cater for US-based proposers / businesses. And it is rather understandable to see that the excellent marketing pitch behind the “200+” title is not backed up by a real world-wide value proposition.\n\nGiven the above context, I would judge the scalability potential of such a tool as average, since I can’t think of extensive economies of scale when jumping from servicing one country to another, given the very diverse regulatory background. In conclusion, there is a good fit between the proposal and the challenge, whose role is, as a reminder, to develop legal and financial tools that can make the life easier for other proposers in these respective areas. ", "q0r": 5, "q1": "The three person team makes a very good job at presenting their credentials, track record and history within the Cardano ecosystem. Deryck is a financial services industry expert, present in the blockchain space ever since 2017. Rodolfo is a highly visible Cardano community member, and he has been involved extensively in the previous funding rounds, both from a proposer and an assessor role. \n\nLet’s talk about the timeline. The project has two main parts: a business one and a technical one. The business side would take four weeks to complete, and will include identifying a compliance service provider and signing a contract. What is rather unclear is who will be the beneficiary of this service rendered and how exactly will the proposal incorporate any legal entity for this end. The technical side would take ten weeks to complete, and will include the development of a module for receiving requests, connecting to the service provider’s dashboard and deploying the system on cloud. \n\nThe budget is rather lightly sketched, with the majority of the funds being used for the development and business parts, of course. Hourly rates are fairly reasonable, 80-100 USD/h, and we also have minor captions set aside for cloud storage and purchases of licenses. An important part which is definitely lacking is the project’s financial sustainability. It would have been a great addition to the proposal the inclusion of details regarding what kind of pricing mechanism would be used (if any) to sell the service to future proposers or to companies developing dapps. \n\nAnother important aspect which is not mentioned, and can have a very detrimental effect on the project if not being taken into account properly, is data privacy. Perhaps in the EU more than in the US this is the case, but definitely given the importance of the topic especially for a business model relying on a third party to collect and handle very sensitive personal information, it would have been a great addition for the proposal to at least deliver an assessment of the risks stemming from this direction. \n\nKYC is definitely a very challenging topic, and given the lack of details for the project’s financial viability, data protection and business model, I think four stars are sufficient for the feasibility section. ", "q1r": 4, "q2": "The team is making a solid case for auditability. On top of using an agile methodology, the team promises progress reports and tracking via github, Kanban boards and commits. Agile-specific reports will also be used: sprint burndown for example. \n\nAs a side note, before embarking on the project, I also suggest that the team enters into a discussion with a specialized lawyer regarding potential liability issues with regards to asking / rendering KYC services to third parties, since these liabilities can be significant and a huge risk is not taken into account. \n\nSuccess of the project would imply a viable proof of concept system that can accommodate for all the US-specific compliance regulatory requirements and sanctions verifications. An excellent addition would have been a more detailed overview into how the selection of the business provider would take place, as well as offering us comfort that the team has the internal competence to deploy a good due diligence process during the selection process. This item is paramount again, given the very sensitive personal information in the scope of the service provided. From my point of view this issue alone is a good enough reason to offer only four stars to the feasibility’s proposal. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 3, "ng": 1, "nfo": 1, "vca_o": 2}, {"id": 525, "q0": "A KYC-as-a-service is an excellent idea that will save funded projects many many hours of labor and costs implementing KYC....and this speaks directly to the challenge brief of \"providing legal service to funded proposers.\" \n\nThe Business and technical solution is simple and clearly defined with over 18 specific \"Compliance and Reconciliation\" listed. \n\nThe team is aware of associated risks and has a solid mitigation strategy. ", "q0r": 5, "q1": "The proposal has a detailed timeline and milestone with breakdown of the two main prongs of this project, both spanning a toltal of 14 weeks. \n\nThe budget is broken down with line item details of different types of costs.\n\nThe team has all of the core competencies required to deliver the project. ", "q1r": 5, "q2": "The proposal has provided details about how it plan to manage the project internally as well a way for the community to audit and follow along the work. \n\nThe proposal has a clear definition of success that is easily auditable by both the technical and non-technical community. Would have love to see the team tie this definition explicitly back to the challenge's definition of success. ", "q2r": 5, "assessor": "z_assessor_2098", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 1173, "q0": "The proposal aims to deliver an integration of a reliable anti money laundering/ financial crime enforcement network compliance and monitoring services into existing KYC services for funded projects to use.\nThis seems a very useful tool to help projects dealing with transacted money avoid being involved in illegal activities and be compliant with the law. ", "q0r": 5, "q1": "The proposal is likely to be implemented successfully as the team has several years of experience in the insurance sector and includes members who have been granted several proposals in the previous funds. Although this is not necessarily an indication of success for the presented proposal, this is surely a good indicator. \nThe budget breakdown shows the team is dedicating most of the resources to the development of the tool to be deployed. \nThe proposal would be accomplished in 14 weeks, requiring an effort of 18 hours per week. ", "q1r": 5, "q2": "It is not fully possible to assess the challenge mainly for two reasons. firstly, the average PA is not familiar with acronyms such as KYB/AML/OFAC/FINCEN. Yes, of course, Google is our friend, but explaining the acronyms within the brief would ease the readability of it. \nSecondly, some of the phrases are not clear, or they lack of descriptive support. For example:\n\n1)\"This project is to provide an Issuer in the Decentralized Identity ecosystem\"\nwhat is the decentralized identity ecosystem ? is it build on Cardano ?\nIs this going to be built from scratch ? Because from what I see there are already existing similar solutions (see https://mattr.global/ecosystem)\n2) \"The result of the KYC process will be delivered by a trusted service provider\"\nThe trusted service provider is mentioned only ONCE in the brief. However, it is clear from the rest of the brief that the trusted service provider is the company that will provide the Compliance onboarding resources (API).\nWhat is the advantage of getting the Compliance onboarding resources ? How these will work ?\n\nthat delivers a Verified Credential as the result of a KYC onboarding process.\n\nThe team also lists a series of past proposals but it seems that the current proposal is derived from only one of the listed ones.  \n\nHowever, the timeline, the budget, as well as the KPIs are well listed in the proposal brief, so the results can be monitored and tracked after funding.", "q2r": 4, "assessor": "z_assessor_2215", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4939, "q0": "The creation of a Compliance-as-a-Srevice business model specifically geared towards the legal and financial implementations of Catalyst funded proposals is a potential gamechanger for the Cardano space, insofar as it would help to make the whole ecosystem much more regulation-friendly in the eyes of supervisory agencies worldwide by incorporating the KYC/KYB/AML/OFAC/FINCEN requirements that professionals make an effort to verify the identity, suitability, and risks involved with maintaining a business relationship, typical of most if not all countries where there are currently Catalyst funded projects underway.", "q0r": 5, "q1": "The team is a diverse group with experience in SSI, fintech, credit, technology and human development, with a track record of contributions to the Catalyst community, such as those made by Rodolfo in the LATAM Cardano Community and as a Challenge Team Member, CA, vCA and so forth. Their experience as funded proposers, coupled with their vast and diverse backgrounds in finance, telecoms, tech and poject management ensure that they will be able to carry out the task they have set themselves. The timeline and budget for both the business and technical aspects of the proposal are clear, and ensure that the proposal will be implemented successfully.", "q1r": 5, "q2": "Although there are no previously quantified metrics for KPIs, the proposers indicate the success of the proposal will be visualized through the release of the Proof of Concept system that will allow them to showcase demos and trials of AML/BSA, FINCEN Reporting, OFAC/PEP/Sanctions along with transaction monitoring, case management, and UDAAP alerts. Furthermore, as far as progress reports, they have adopted Agile methodology based on the tools provided by github, and the advancement will be tracked by github issues, project views and commits, while intermediate progress will be reported as Sprint Burndown, a KPI metric that shows the progress as percentage of each development sprint. These are deemed sufficient, both in terms of measurement and public availability, to adequately audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7180, "q0": "This project is very interesting and relates well to the objectives of the challenge, which are to provide an issuer in the Decentralized Identity ecosystem that delivers a Verified Credential as the result of a KYC onboarding process, so that deliver a trusted service provider. The idea here is to deliver a compliance-as-a-service model that helps users to mitigate risks as much as possible while complying with regulations. Users may go through the KYC verification process and receive a credential that can be shown to other parties as a proof of having passed the KYC process. Once approved, there is a list of compliance and monitoring services that are available. Besides that, this scenario is a real use case of a using RegTech and risk management to prevent or mitigate the concerns around regulation, usability, and adoption. I think this fits in a lot of ways with that we are aiming for, as it will help integrate reliable AML/BSA FinCEN compliance and monitoring services into existing KYC services for funded projects to use. Therefore, I believe that the impact would be real, positive and likely to be very successful, in line with our current goals. ", "q0r": 5, "q1": "We have a script that is not bad, but not ideal either. We know what happens in the project development process, but at the same time, such actions are not well situated in time. We can make the order they would happen but not exactly how long each of them would last, which creates an obstacle in the total understanding of the process. For example, in the first 4 weeks, 4 activities would be carried out. Does that mean 1 per week? Or would some take longer because they would be more complex than others? Who would on them, and what would their routines be like? I think it would have been better if the activities in two phases had been divided into time intervals, such as every week. The proponent should also have detailed each of the actions in greater detail. About the budget, it is possible to understand the basics of how the money would be used, but again there could be more details. Why would the “purchase of initial licenses for trials and demos” part cost 3,500 dollars? What would be the working hours of the professionals? If we know what their routines would be like and the value of their working hours, surely the understanding would be deeper. And finally, speaking of the team, I think the level of detail is satisfactory. We know their names, resumes, LinkedIn profiles, and how they fit into our community. In general, the topic is average, as there are good parts but also many others to improve.", "q1r": 3, "q2": "Unfortunately, I found several problems to be solved in this part of the proposal. The proposal does not have a roadmap here. Without a detailed schedule, the Cardano community would not have the means to properly audit the project process, as we would not know what has to be done, when and by whom. We don’t have small goals to continually achieve, nor deadlines to meet. Therefore, this must be resolved. I think this could be done, first of all, by establishing a detailed roadmap, and a budget that involves dates and deadlines. Besides that, in my view, the proposal is satisfactorily auditable based on the data provided, which are mostly numerical. Regarding the final results, the proponent claims that success would be seen through “the release of the Proof of Concept system that will allow us to showcase demos and trials of AML/BSA, FINCEN Reporting, OFAC/PEP/Sanctions along with transaction monitoring, case management, and UDAAP alerts”. We know what your goals are, but they are quite broad, it would be more appropriate if the team set some more specific and objective goals, easier to verify. Overall, this part is satisfactory in terms of tracking progress, but not the partial result of the projects.  ", "q2r": 3, "assessor": "z_assessor_2879", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8392, "q0": "The project clearly fits the challenge of being able to actively support emerging projects in Catalyst with business and technical services that help users to mitigate risks. The project has many compliance features and reconciliation features for emerging projects to choose from.\nUnfortunately, these support services have not been described in more detail, specific examples of trusted companies to provide the Compliance onboarding resources or AGENT that act as a REVIEWER, as well as the compliance models that were provided before should be mentioned as a specific examples so that the community can more easily assess the impact of the project.\nThe risks mentioned here are involved when dealing with contractual terms with financial related institutions, however, I think the solutions should be described with a clearer plan than the present. The author can analyze more clearly how to find and approach financial companies.", "q0r": 4, "q1": "The timeline of the project lasts 14 weeks with two main tasks, Business task and Technical task with general descriptions of important tasks to be done, however, I personally find these timelines are quite general, It will be better if the way to process those steps, as well as the elements necessary, are also described.\nThe budget is described in line with the timeline and refers to the hourly unit price and the total estimated time of completion. As a result, the community can assess the reasonableness of the project more easily.\nThe two main team members have extensive experience in the blockchain, Cardano community and received funding for proposals before, also participating as Community Advisor for some rounds. The author describes quite carefully the experiences of the members as well as provides information about LinkedIn for readers to easily evaluate.\nBecause of the above strengths, I give this section 4 points.", "q1r": 4, "q2": "The ways and tools for the community to track the progress of the project are specifically mentioned (GitHub tools, project views: Kanban board, Sprint Burndown to follow the intermediate progress).\nThe success of the project is quantifiable so that the community can measure its success of the project.\nHowever, if there is an additional point, I think the KPIs for the public to monitor the project that the author mentioned should be described more clearly, specifically what it is, the completion time as well as the specific quantitative numbers for each KPI", "q2r": 4, "assessor": "z_assessor_2979", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9085, "q0": "This proposal seeks to develop a partnership with a compliance authority and then develop an api that can be used in other projects seeking to mitigate risks of doing business. This tool would be useful for any blockchain project seeking to validate the compliance of information or individuals looking to financially interact with the project. Having this be an api that is publicly accessible on the blockchain would be an impactful legal and financial tool available to projects. Additionally, since the team will do sufficient research into various compliance providers and not attempt to manage it all on their own, the proposal's impact improves substantially. The only reason to give a 4 and not 5 is due to the potentially limited impact of who this would be targeted at. Would every proposer utilize this service, probably not. And since it is a project with a doable, but limited scope, its impact may also be limited. ", "q0r": 4, "q1": "The team putting this together has the experience and qualifications to accomplish this proposal. The budget is defined and appropriately designated. The timeline gives enough detail to see that it is feasible. Even though it is not the most detailed I have seen there are milestones and measurable goals that can be audited and made public. The budget is likewise not overly detailed, but sufficiently clear to see that it is doable under the timeframe. Based on the information available in the proposal, there are no questions regarding whether or not this will be feasible. The team should be more than capable of accomplishing this project in time and on budget.", "q1r": 5, "q2": "This team has a set of metrics that they will measure, but they have not been made available to the public until the project begins when they publish data on github. The link was not included in the proposal, but would be available upon request, I am sure, or even quick perusal of their website. The metrics will be made public as they make progress on accomplishing the development phase, but it would have been good to give appropriate auditable metrics in the proposal for the sake of assessment. Apart from a lack of detail, this proposal seems likely to succeed in creating a positive impact for the community, and I would vote for it.\n", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12380, "q0": "AML (Anti-Money-Laundering) regulations play an important role for startups and developers. In the European Union in particular, there are already registration requirements for crypto service providers. This registration is then also associated with KYC compliance. Every product that deals with crypto has to deal with this at some point. Therefore, it is great if there is a help guide and this allows the Cardano community to gather knowledge quickly and find a suitable solution.\nHowever, there is a star deduction because it does not go into detail about which regulations of which country are looked at in more detail. In the European Union, for example, it is easy, but not in South America.", "q0r": 4, "q1": "The proposal contains a timetable that seems realistic. Especially the division into Business Task and Technical Task is pleasant and you can easily imagine how the project will be tackled. \nA team description is also included. As you can see, the team consists of three people, one of whom - Rodolfo Miranda - has already worked successfully on other proposals. This reinforces the idea that the proposal can be implemented. Especially in the technical area they are strongly represented.\nHowever, I can not fully agree here, because I miss the legal aspect in the TEam. Especially with KYC and AML, a Lawyer would be really important, especially if you then implement technology.", "q1r": 4, "q2": "The milestones are clearly formulated and also seem realistic due to the amount of work involved. Github is used for communication, which is not surprising due to the technical nature of the team. The intermediate steps are also displayed and the progress is indicated in percentages, which is pleasant for the Cardano community. The Github page wasn't set up yet, which isn't necessary - because it is completely new - before the project is funded.", "q2r": 5, "assessor": "z_assessor_3405", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Integrate reliable AML/BSA FinCEN compliance and monitoring services into existing KYC services for funded projects to use.", "experience": "The team has relevant experience in SSI, fintech, credit, technology and human development, with a track record of contributions to the Catalyst community. See linkedin profile links here, and more details in Team section:\n\nDeryck Lance\nPatrick Rivenbank\nRodolfo Miranda\n"}