{"id": 383771, "author": "jorgejaqa", "title": "Clean water, raise awareness.", "url": "https://cardano.ideascale.com/a/dtd/383771-48088", "category": 26242, "amount": 58413, "description": "清洁的水是用20升的瓶子装的，不是来自 \"可饮用 \"的水，因为硬度大，而加密货币被看成是庞氏骗局。", "funded": 0, "upvotes": 16642348, "downvotes": 22763579, "votes_result": 6121231, "votes_cast": 122, "f6_no_assessments": 6, "f6_rating": 2.2222222222222223, "videos": [], "media": [], "f6_assessments": [{"q0": "I would like to start by congratulating the team for their remarkable social commitment. We need more individuals like you in the Cardano community. The purpose of this proposal is to address the issue of accessibility to clean water in remote communities with high poverty rates. The author of the proposal, an SPO, seeks funding for the installation of water purification systems in communities that lack access to basic services. Several communities in the region face this challenge, which is entirely in line with the mission of Cardano from a social perspective. I must admit that I find it very difficult to evaluate this proposal, since I believe it is an excellent proposal. However, in the way the proposal is described, and considering not only the social aspect, it is difficult to find a direct alignment with what is asked for in this challenge. Although it is mentioned that as part of the installation of these systems, knowledge characteristics of the Cardano ecosystem is imparted to these communities, no impact metrics are presented to assess it from that point of view.\r\n", "q0r": 3, "q1": "I don't have many comments concerning the feasibility of the project. Given that the team already has a part of project underway, and from what they mention, they need funding to reach out to other communities, I believe they have the necessary skills and experience to pursue the project. Regarding the budget, there are also opportunities for improvement. Team members present a final value that is representative of the cost of installing a system in a community. In order to make an accurate assessment of the costs, a breakdown of the installation is necessary. How much will it cost to install the system, purchase the system, transportation, manage the project, and set up the installation room, for example?\r\n", "q1r": 4, "q2": "Auditability is not a problem here. Within four months of receiving the funding, the team plans to install the five water purification systems. All of the installations will be open source, describing the drafts, locations, equipment, and details for replication all over the world, which is very positive. Nevertheless, it is necessary to make much greater efforts to ensure that operations are transparent for the community. The project mentions, for example, that initial installations have already taken place. Thus, it would be useful for all information to be provided on the website. Perhaps installation photos and cost reports verified by professionals?\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 22, "ne": 8, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "Clean water for everybody is a good and noble idea. The problem statement and solution disconnected for me, I fail to understand how the water integrates with the blockchain and how it increases the utility of the chain. I would like the team to rework the problem statement and solution to be aligned. ", "q0r": 1, "q1": "From the described experience it seems the implementation of the water systems will be successfull. I fail to understand how the purification systems ties in with the blockchain backend, I would love the team to expand.", "q1r": 1, "q2": "I would like the team develop a detailed roadmap with milestones. I would like the team to breakdown the expenditure further per site - is all the funding going to water purification hardware. I would like the team to think about the funds to maintain the purification systems. As the proposal stands at the moment I believe the project will be challenging to audit.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 20, "ne": 0, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "This is a great Idea for humanity using the pool AGUA to provide water for low income community. The Impact is seen but the proposal is not well structure to articulate the Ideas, After checking https://agua.gratis/, I now understand the idea better  and its Impact, I would suggest instead of asking for fund to provided water directly , its better to ask for fund to support AGUA pool-which in turn provides water from the profit just like you did before. That way in my opinion , the impact will cover both cardano ecosystem and  the local communities . The problem statement and solution can be rephrase to better articulate this idea.\r\nSee the proposal guideline  as well", "q0r": 3, "q1": "The experience of the proposer is seen here: https://github.com/jorgejaqa and his passion towards supporting communities with water , But I would suggest the proposer should set up a Team with required Skill to handle the SPO and the Project as well. The Plan is to support about 5 municipalities according to the proposal but there is no roadmap , definition of success and others thing that could make this proposal more feasible .", "q1r": 2, "q2": "There is no budget breakdown and no KPI to enhance audit. I would suggest the proposer check funded proposal to see how he can improve this proposals in the next fund.", "q2r": 2, "assessor": "z_assessor_430", "no_vca": 17, "ne": 0, "ng": 10, "nfo": 7, "vca_o": 1, "reply": "Also budget breakdown and reasonability is a concept for the Feasibility Score and not the Auditability one, where we have provided 9 SMART KPIs and a Gitbook where we will be reporting all of our activities, so the proposal is Totally transparent and auditable by the community!"}, {"q0": "I really love the meaning this project will bring to people there, and it will absolutely solve the problem that is met. \r\nThe team has detailed info that shows that they're well aware of the problem and context surrounding the place that they want to solve the problem, and their solution can make an impact on the Cardano community. \r\nBut lacking key metrics is hard to assess whether the project aligns with the challenge or not. Even reading the proposal we will know what the provided numbers say, but my advice is that the team should set some specific key metrics to show what they're really considering to.", "q0r": 3, "q1": "There is no roadmap and budget breakdown to clarify how the team implements the project and uses the budget. Therefore, it's hard to measure the feasibility of this project. \r\nIn addition, lacking solution detail also can't help us understand how the team can solve the problem, there is an attached video but It cannot help that much. \r\nSo, my advice is that the team should provide some detailed steps and plan that they will go for it. And have some risk-relevant with the implementation will help the proposal get a high rate for voting. ", "q1r": 1, "q2": "We can't audit this project because lacking a roadmap, key metrics, and implementation plan detail. \r\nEven more, this project needs a plan with more than just technology. I love to see their team can show how they can organize to reach and help these communities, that need some community development skills. And there are, maybe, some risks with the government that the team will meet and have to solve when on. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The given problem statement is defined and involves most aspects of the challenge. The idea of the proposal is very cool to bring clean water to people in cities in Mexico. This proposal is completely within the scope of the challenge\r\nThere is clarity in the problem description and the proposed solution. Although the solution describes the challenge, the proposed concept makes sense, the absence of a blueprint affects the testability of the proposal. To get funding, I think the team should rewrite a plan that includes more detailed and clear roadmaps, team-level information, and KPIs.", "q0r": 4, "q1": "There are no details regarding the author team. Please provide additional information and evidence regarding your experience. The more people know about the mind behind the project, the easier it is to trust you.\r\nIt would be nice to see the risks and challenges. Due to the lack of information, I do not think this proposal can be implemented well", "q1r": 2, "q2": "$58,413 requested but no explanation to see how to use required capital\r\nAlmost no one can check the progress of a proposal without knowing the timeline. Suggested testability is low, as it doesn't show roadmap along with development plan, detailed explanation of each step, milestones and deliverables of each part, progress and some ways to community measures the success of the proposal. Because without a blueprint, without KPIs and measured data, there is no way to check the progress and success of the proposal.", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "This proposal is about giving to the community clean water, increasing health, and creating the awareness of the Cardano project one litter at a time. This is a quite creative idea. However, the problem is abstract; I can not understand relationship between Clean water and raising Cardano awareness. There is no roadmap, KPIs,... as a result, the solution remains unclear. Therefore, based on the given information, I disagree that this proposal effectively addresses the challenge, I can rate it with a score of 2", "q0r": 2, "q1": "This company profile is described enough for understanding [has several years in the water, wastewater treatment industry and solar, and has already started with this project]. There is no information of demo/pilot provided. Besides, the budget structure for each activity is not provided and explained. In similar, the risk is not defined. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is plenty of information on installations provided. However, there is a lack of (1) The budget items structure and explanations of calculation base for each installation; (2) Roadmap with KPIs/ Metrics\r\nTherefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 17, "ne": 0, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "为社区提供清洁的水，提高健康水平，并在一次次的垃圾中建立起对Cardano项目的认识。", "experience": "该公司在水、废水处理行业和太阳能方面有几年的经验，我们已经开始进行这个项目。"}