{"id": 381055, "author": "mlabs", "title": "MLabs DTF (Dao-Traded-Fund)", "url": "https://cardano.ideascale.com/a/dtd/381055-48088", "category": 26233, "amount": 70400, "description": "目前的区块链DeFi解决方案是高风险的，一些投资者喜欢波动较小的投资策略。", "funded": 2, "upvotes": 153644976, "downvotes": 9582829, "votes_result": 144062147, "votes_cast": 787, "f6_no_assessments": 13, "f6_rating": 4.487179487179487, "videos": [], "media": [], "f6_assessments": [{"q0": "该提案涉及到当数字资产成为主流时，对被动投资的潜在的非常大的需求。为了正确看待这一影响，我建议加入量化参考，如美国目前的被动投资市场规模约为50万亿美元，或美国股票市场总市值的50%。有一个被动的、更容易的解决方案，让那些没有时间、兴趣或专业知识的人自己挑选代币/硬币，以获得数字资产的风险，当然有助于支持采用DeFi和Cardano生态系统。\r\n对于问题的陈述，我想指出，一个单一的被动投资工具不一定比更广泛的加密货币市场的平均波动性要小。波动性较小的市场是拥有大规模的被动投资工具和机构/长期资本的结果（例如，被动投资占美国股票市场总额的50%）。此外，目前还没有为加密货币市场定义的指数（类似于股票市场的标准普尔500指数或纳斯达克指数），因此我希望看到更多关于如何为iDTFs设计资产配置和平衡策略以及目标风险/收益状况的细节。我的专业是资产管理和股票投资，如果这个项目要实施，我非常乐意为团队贡献更多的想法。", "q0r": 4, "q1": "MLabs显然在生态系统中拥有重要的经验，是Cardano上一些最大项目的幕后推手。如果MLabs能够具体说明并强调负责这个项目的人的相关经验，将更有助于社区评估该提案。建议的预算和时间表被适当地分解为详细的工作块。  在技术可行性方面，提案解释了一些技术和实施的核心功能。在财务/操作方面，我建议提案人也要包括更多的清晰度，例如，将使用什么算法来选择资产范围和资产权重；如果它将优化最小的跟踪误差或更低的过度风险回报率；谁将决定投资策略以及如何选择这种人。此外，在MVP阶段之后有一个高层次的计划，也将有助于社区评估该项目。", "q1r": 4, "q2": "基于iDFT的核心功能，该项目是可以审计的。但我希望看到一些指标来定义MVP在启动时的成功，例如，管理的目标资产，或相对于更广泛的市场的波动。正如我在影响部分提到的，我相信一个被动的策略不一定比大盘的波动性小，因此问题陈述可能需要一些修改。可以考虑的一个选择是，通过被动策略，实现在加密货币中的广泛接触，同时为投资者节省时间和尽职调查的努力。", "q2r": 4, "assessor": "z_assessor_684", "no_vca": 14, "ne": 10, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "该提案建议实施一个DAO交易基金，允许人们购买一篮子专注于特定领域的不同项目代币。ETF是目前金融领域流行的投资工具，它允许人们投资于更广泛的细分市场，并帮助消除做个人选择的努力。在Cardano中引入这种类型的产品与快速增长的DeFi生态系统可以提供很大的影响，让一系列新的投资者使用他们可能喜欢的DAO交易基金，以简单的方式参与。提议者详细介绍了这种方法可以有一些优势的关键原因，这提供了证据，证明这是一个有效的解决方案，解决了一个问题。具体来说，他们列出了多样化、较低的成本和长期的回报。这里要给出的唯一反馈是，这种解决方案为最终消费者提供的另一个关键好处是节省时间。投资者不需要像他们举的例子那样找到所有的DEX，然后单独购买，而是可以在更快的时间内直接使用DAO交易基金。对于一些投资者来说，如果他们想更容易地进入和离开市场或特定市场，如Cardano DeFi或Cardano DEXs，这将是至关重要的。总的来说，很明显，这种解决方案有潜在的大量需求，因此可能在生态系统中产生巨大的影响。", "q0r": 5, "q1": "该提案背后的团队是MLabs，他们与IOG合作，帮助执行Cardano协议的部分内容。除此以外，他们还与生态系统中的许多DeFi团队合作，帮助他们执行自己的解决方案。该提案团队提供了一个链接到他们的Github仓库，在那里你可以看到一长串对Haskell项目和Cardano生态系统的贡献。提案的关键部分在预算中被分解，每个部分所需的小时数产生了最终的预算总额，其中每小时的成本是80美元。该团队有大量的证据证明他们的专业知识，并且有一个合理的预算和范围，这个项目看起来非常可行，可以以高标准执行。", "q1r": 5, "q2": "提案组列出了一套功能，以及完成所需时间的预算。一组成功标准点被添加，类似于里程碑的完成点。没有添加关于最终产品的关键绩效指标。该提案团队提供了他们的Github资源库，显示了大量的开放源代码。该团队没有明确说明该提案是否会开放源代码并提供给社区。如果有与他们认为将产生的资金类型相关的更具体的关键绩效指标和一个开源计划，就可以给这个提案一个完整的评级。", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "你好，ada的选民们!这个挑战是 \"提升Cardano的DeFi\"，这个提议与这个挑战一致，原因如下。Defi本质上仍然与高风险相关，这可能是对入驻用户的一种阻碍。这项建议旨在通过创建ETF来减轻Defi的一些风险，在这里你可以获得多种资产的风险，而不是把所有的 \"鸡蛋 \"放在一个篮子里。这可能是有帮助的，因为很多人都想获得这种新技术带来的上升空间，同时又能尽可能地减少风险。在新技术中，也有很多项目可能无法长期运作，所以在Defi中获得多个项目的风险，你可以真正利用上升空间，而不会在一个项目中过度利用自己。我已经看到 \"加密货币Etfs \"的概念在其他连锁店中越来越受欢迎，所以我们知道，如果做得好，这可能会点燃大量的采用，并有助于促进Cardano上的Defi!", "q0r": 5, "q1": "MLABS是这个提议背后的组织，所以当我们评估他们是否有能力执行时，应该从这里开始!当涉及到卡诺的Defi时，它仍然是早期的，但是在阅读了他们在提出的计划中的证书后，我必须说他们极有可能能够实现。这是因为MLABS在Defi开发方面经验丰富，是卡诺和催化剂社区中众所周知的团队。他们是iog plutos的合作伙伴，并雇用了超过65名开发人员来帮助建立潜在的未来大厅标志的Defi应用程序，如圣代交换（Dex）和液体金融（Defi贷款平台）以及更多。这让我们看到他们很受尊重和有能力。当我们看一下他们的实施计划时，我们也可以看到他们执行这个建议的开始阶段的能力。例如，他们给了我们明确和透明的估计，说明他们将如何使用资金，实施将需要多长时间，以及他们将需要多少人力资源来启动。", "q1r": 5, "q2": "在评估这个提案是否可以被审计时，让我印象深刻的是，他们给我们明确估计了这个提案的实施时间。这让我们作为选民有了跟踪提案进展的死线。我也鼓励选民在审计提案的进展时，看一下关键指标部分。他们承认Defi on Cardano是早期的，所以很难对日活跃用户或锁定的总价值等测量进行比较，我实际上很欣赏这一点，因为Defi on Cardano仍然处于起步阶段，我们没有数据来评估这些关键指标。然而，他们确实给出了一个竞争性的承诺，即随着空间的发展和数据的透明化，他们将提供这些关键指标。例如，对于tvl，他们说：\"我们将有能力扩展，以处理任何变成的负载。\"这意味着tvl的负载无论多少都可以处理。这意味着我们可以通过查看Finished Dapp是否安全地处理资本流入或不安全来审计其准确性。 对ADA选民的总结 - 如果在许多人看来，在这个阶段有一件事对Defi很重要，那就是安全，所以我尊重他们在谈到能够处理任何数量的资金进入这个提案的成品时，在地上插了一面旗子。正如Michael saylor所说，最强大的资金将永远吸引财富。所以对我来说，这意味着一个安全的方式来投资加密货币Etfs是目前在Cardano上培养defi最重要的。Mlabs写了一份漂亮的提案，推出他们的mvp（这个提案的dapp），并在我所说的关于处理tvl的参考资料中承诺，无论资本的负载如何，都会使其安全。", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Proposal addresses the problem of users seeking alternatives to volatile markets. This project will ad value to the Cardano ecosystem by attracting new users to Defi on Cardano and connecting to other Defi projects. The key metrics are perfectly aligned with the Challenge as they are identical. This project is able to scale as it will be open source and has a governance system.", "q0r": 5, "q1": "Relevant skills and team is provided via github page. They have been actively working and contributing to many Defi projects in the Cardano ecosystem. The budget seems reasonable and is broken down into identifiable items that shows how many hours are allocated to each item and a total of 880 hours to complete the whole project seems doable. They explain in great detail what they want to build and what the core functions are, but they don't go into the technical details on how they will build this. Providing the reader with the technical details will show them your building process and boost confidence in your abilities. There are considered risks throughout the proposal, it would have been nice to view them all in one place, but at least they are there. They will address the risk of resources lost due to bugs, by submitting their work to the certification process at IOG.", "q1r": 4, "q2": "They provided a roadmap with milestones of different parts of project that gets completed. The milestones can be used as KPIs, but it would help to have user based KPIs and transaction KPIs. The more KPIs you provide the easier for the community to track the performance of your project. They address the problem of volatility in Defi markets being unattractive to some users. They solve this by offering stable alternatives to new and experienced users.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 25, "ne": 6, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "An outstanding idea for pooling investors into a decentralized trading fund focused on Cardano Native Assets.  This is likely to be a popular Dapp if successful since it provides an easier way to gain exposure to a complex marketplace. The plan includes development of automated processes for the vault, distribution of fees/discounts, and governance.", "q0r": 5, "q1": "MLabs is one of the stronger development teams in the Cardano ecosystem with experience with Haskell, Plutus, and Rust developers.  The project plan is broken down into 9 features and funding for changes. A minimum viable product is described for the core functions and deposit options. They have outlined a plan for MVP in 8 months and launch in 12 months.  They acknowledge that the scale of the launch is dependent on the pace of assets available to invest in over the next year. ", "q1r": 5, "q2": "MLABs provides an answer for each of the 12 requested metrics, though most of the answers are either TBD or vague.  Nevertheless, the core goal to facilitate the utilization of dapps on Cardano seems trackable. More importantly, the clarity of the project plan will provide a base upon which progress can be measured.", "q2r": 4, "assessor": "z_assessor_145", "no_vca": 24, "ne": 3, "ng": 21, "nfo": 0, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralisation can be for economic empowerment. However, it is important that DeFi projects have good accessability and also enable to bank the unbanked instead of just beeing an elitist project. I have done some personal research on both DeFi and microlending especially with a focus on Global and social justice and hope to bring in a valuable perspective on accessability for poorer people with my reviews in this challenge.  As someone who has already traded with ETFs, i also know how the fundamentals of them work and am able to assess whether this project makes sense. This proposal offers a good solution to some points of this challenge, like accessability to DeFi. A tokenized asset has the potential to offer DeFi accessibility even to people that don't have a lot of money. This will clearly add value to the Cardano ecosystem if it is done in a comprehensive manner and will support native tokens and DEXs.\r\nThe proposal has formulated metrics that align with the metrics of the challenge.\r\n In the way the project is planned, it should be perfectly able to scale with the growing cardano ecosystem. Feedback: Since you already considered my feedback ahead of the assessment phase, I have no further feedback.", "q0r": 5, "q1": "The proposers are very transparent about their background and seem competent and up to the task. They provide proof that they know coding and the different layers of Cardano. It is highly likely they are up to the challenge. The proposer has a realistic idea about the number of people and work hours that are required for such a task. The buget is well-defined, fine-grained and rationable. The different parts of the budget are realistic and clearly show where the money goes. While the hourly rate is a bit high it is comprehensible that a company has a bit higher costs to carry than single people that don't have any of the business costs. The proposers have set out a plan for the case that the project will take longer time and have higher costs. The timetable is realistic for a project of this scope. The plan of implementation is shown and seems realistic. Technical aspects are only explained superficially and could be more detailed to get a more in-depth view of what is going to be done. Challenges and risks to the project that might occur are not really discussed.  Feedback: Since you already considered my feedback ahead of the assessment phase, I have no further feedback.", "q1r": 5, "q2": " A detailed roadmap with milestones and a time horizon is presented. The targeted problem and the solution are explaind clearly and comprehensible. Hence, overall this proposal is audible.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 10, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This project will help to improve the development environment of DeFi, it will help to mitigate some of the risks associated with cryptocurrency investing as the proposer said in their solution brief. \r\nMoreover, the proposer also lists some important points that this project will impact to the Defi, therefore, impact the Cardano ecosystem. \r\nThe proposer also outlined very detail the project's success will be and described very detail the key metric they choose for this project, and all of them shows that met with the challenge settings. ", "q0r": 5, "q1": "The proposer explained clearly about their solution with samples and feature explanation, that can help anyone to assess their tasks in the \"What success look like\" part, that very details in months.\r\nMoreover, they have a page of budget breakdown that is very clear by work-hour, as if you have experience in dev, it's all reasonable and realistic. \r\nTherefore, I rate 5 for the feasibility. No more comment on it, they're made all perfect and I believe that they will do it right. ", "q1r": 5, "q2": "This proposal is driven by a very experienced team, they're IOG partners with over 65 Haskell developers working on some of the ecosystem's biggest projects - including SundaeSwap, Liqwid... \r\nMore than that, they made this proposal so perfect and clear that will help our community simple to audit the project on single tasks.\r\nThe proposer didn't have a part to show their relevant risks and how they face them, but in the detail of the proposal, I can see some challenges that they also have the plan for that. So I think this proposal is 100% auditable. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 15, "ne": 5, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "Mlabs' proposal seeking to create pools of assets that help to mitigate some of the risks associated with cryptocurrency investing. Proposal mentioned importance of such funds like Ardana, CardsStarter, Player Mint etc. - for diversification, lower costs and Strong long term returns. Thus the challenge is effectively addressed.", "q0r": 4, "q1": "MLabs is IOG partner, has over 65 Haskell developers that developed Sundae Swap, Liqwid, etc. The proposal can be successfully implemented. The detailed plan mentioned multi-asset vault structure, tracker, re-balancing functionality, multi-asset dep functionality, The detailed plan will make implementation successful", "q1r": 4, "q2": "The road map structured into 1st , 3rd, 5th, 8th months and the expected launch date of 4th quarter 2022 will make auditing effective. The budget has a detailed breakdown to make auditing easier and effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The ability to create this kind of infrastructure for ETF-like investments is important and would represent an impactful addition to Cardano DeFi. One can argue about the usefulness of curated baskets and rebalancing that the average investor is unlikely to understand. However, it seems to be a worthwhile return on investment and good value for ADA holders.", "q0r": 4, "q1": "MLabs's track record and association with IOG make it highly likely that the project will be a success. This is a very impressive team and one of the largest pools of Plutus talent.", "q1r": 5, "q2": "The amount of detail presented both in the proposal and whitepaper is impressive. The technical detail and cost breakdown are not matched by sufficient performance metrics and it would be difficult to assess before completion if the project is succeeding or failing.", "q2r": 3, "assessor": "z_assessor_692", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The proposal is feasible when creating valuable asset groups and minimizing the risk of high price fluctuations, suitable for investors who do not want large fluctuations. The project is open to everyone and suitable for the challenge. The proponent should add some similar and more prominent utilities than an ETF (for example, if I own a DTF, can I vote for separate projects in the fund? ", "q0r": 4, "q1": "Proposers that mention MLabs as an IOG partner should still add the identities, expertise of the participating members and should include detailed documentation on how/demo/specs/features/ will be apply. The proponent has provided a monthly and quarterly timeline that will perform some functions with an hourly cost, the estimated cost of 160h*80$ should provide more information or predict risk issues.", "q1r": 3, "q2": "The proponent provides a roadmap for the implementation of the functions, but has not yet seen the additional KPIs needed to measure. It is necessary to add the risks, difficulties and challenges of the project, especially the unknown resource portion, how many people and teams are involved.", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal as implemented will not deploy an open financial solution within six months, as indicated in the proposal. Additionally, may increase exposure to security risks given that defi projects associated with indexed assets are maintained separately and outside of the scope of this financial solution. Finally, the proposal as funded wouldn't negate the introduction of venture capital, and may actually make it an easier point of entry into Cardano defi solutions. \r\n\r\nWith that said, basket funds offers users more familiar vehicles that may offer a healthier balance for certain risk and investor profiles. ", "q0r": 4, "q1": "It's clear that the organization is already active in the Cardano space, and very aware and hands on with defi projects that have the potential to form a part of the basket(s). The fact that 60+ developers are already on the books means DD&I can ramp up very quickly. The main variable may be allowing the team time to assess the early evolution of defi projects that have the potential to be indexed over the course of 2022. ", "q1r": 5, "q2": "Good, high-level breakdown of quarterly project timelines and deliverables. ", "q2r": 5, "assessor": "z_assessor_716", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "The proposal alligns with the challege goals. Specifically it attempts to solve the problem of decentralized ETFs. This proposal also make it clear that the product will be very attractive for new comers to the ecosystem that want to minimize risks. Furthermore, the proposal includes many metrics like the type of tokens to be made into DTFs and so on. ", "q0r": 4, "q1": "The proposer presented a link to their GitHub account which seems to be very active and includes many Cardano-related projects. The projects are also segmented into steps and categories and into hours needed for each category. They also provide a realistic timetable that leads to an MVP and then to further added features.", "q1r": 5, "q2": "The project presents a clear roadmap with different incremented goals. A lot of milestones are also given divided into categories and monthly goals. Finally, the team seems to understand the problem at hand and has a clear idea about how to solve it.", "q2r": 5, "assessor": "z_assessor_768", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The creation of a DAO ETF would significantly boost the early Cardano DeFi space with the ability for members to efficiently diversify their risk.", "q0r": 5, "q1": "The MLabs team are Plutus partners and have worked with IOG + multiple Cardano DeFi protocol's during their v1 development. The present a coherent timeline, budget and implementation plan in this proposal. The combination of their team, past project work and plan to implement this solution are all pointing to high chances of a successful proposal implementation. ", "q1r": 5, "q2": "This is one of the most complete/structured proposals in this challenge by one of the strongest Plutus development shops currently building in the Cardano DeFi ecosystem. ", "q2r": 5, "assessor": "z_assessor_769", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "MLabs DTF - ETF创建了资产池，有助于减轻与加密货币投资相关的一些风险。", "experience": "MLabs是IOG的合作伙伴。我们有超过65名Haskell开发人员在生态系统的一些最大的项目中工作--SundaeSwap、Liqwid等。"}