{"id": 381671, "author": "johntmeuser1", "title": "Cardando Long Staking Rewards", "url": "https://cardano.ideascale.com/a/dtd/381671-48088", "category": 26233, "amount": 60000, "description": "桩池-智能合约提供小额APY平均1-5%的APY。我们如何为定期定额-智能接触提供激励？", "funded": 0, "upvotes": 21164573, "downvotes": 37159364, "votes_result": 15994791, "votes_cast": 414, "f6_no_assessments": 12, "f6_rating": 1.4444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "影响\r\n总的来说，这个想法很好。如何将目前的APY从1-5%提高到更多！？这个提案中明确提出了问题，但没有深入解释这个问题的解决方案。该提案指出，开发一个定期抵押/智能合约协议，但我们没有如何解决。这样一个想法，如果完全开发和实施，肯定会吸引大量的用户，从而提高Cardano生态系统的价值。谁不希望有8%或10%的年利率！？哇！！！。由于缺乏数据，对想法和解释的深入阐述，这个提案无法扩展未来的挑战。建议中没有KPI，很难将KPI与挑战设置进行比较。\r\n", "q0r": 1, "q1": "该提案没有包括一个可以提供更多关于该团队或至少关于这个想法背后的人的信息的链接。我们甚至没有链接可以让我们深入了解实现这个想法所需的必要技能和知识。至少有一些通过LinkedIn的链接会很好，因为这给正在阅读该提案的Cardano生态系统的人带来了一些安全感。预算被强调了，但是钱的数量并不合理，也不清楚到底要分配什么。正如我已经提到的，由于缺乏信息，我们对团队中的人数没有一个清晰的认识。该提案没有为该项目如何实现制定一个明确的计划，也没有一个详细的可实施计划。没有计划!也没有详细说明可操作的任务和执行顺序，以及项目执行过程中的表现。提案中没有提到实现这个项目所需的资源，也没有提到工作完成的时间框架。建议书最好能解释执行所需的技术方面和技术，并列出可能出现的风险以及发生风险时如何解决。", "q1r": 1, "q2": "为了使该项目获得资金，有必要制定一个带有里程碑和关键绩效指标的路线图，很遗憾的是，这些指标并没有在这份提案中列出。由于我们没有能够让我们深入了解这个想法实现情况的参数，社区无法监督项目的进展情况。太糟糕了!但是，这个想法肯定是伟大的，并且会引起任何关心自己钱财的人的兴趣。", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 17, "ne": 9, "ng": 6, "nfo": 2, "vca_o": 2}, {"q0": "While the idea would be nice if it could be implemented, the proposer does not provide any explanation as to how the rewards would be generated. Staking rewards are on average 4-6%, so it's not clear how would his contract, even through term staking, would generate additional revenue.", "q0r": 1, "q1": "There is no plan, no reference, no budget explanation.", "q1r": 1, "q2": "There are no success metrics, no roadmap that could be audited and no risk and challenge analysis.", "q2r": 1, "assessor": "z_assessor_318", "no_vca": 23, "ne": 0, "ng": 19, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is not feasible at the moment because it lacks basic information to track its progress. The proposer should add evidence of relevance skills and experiences. This can be a linkedin profile or previous similar work completed by the proposer. Furthermore, the budget should be broken down into identifiable pieces. The proposer should also add a back up plan in case additional funds are needed. In addition to that, a timetable to complete the work should be included. My advice to the proposer is to look at the previous funded proposal and use them as reference to better structure this proposal.\r\n", "q0r": 2, "q1": "The product the proposer wants to build is not clearly described. The problem is not clearly stated. The proposer should also add key metrics and goals of the proposal", "q1r": 2, "q2": "The proposal doesn't include any information that will help track its progress.  The proposer should add a roadmap with reasonable milestones. Metrics and KPIs that define success should be added too. This proposal can be improved and get a chance of getting funded in the future. As it is right now I don't have a positive note on its suitability.", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 18, "ne": 0, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The proposal claims to offer a methodology of higher returns by long-term stacking. This is not in alignment with the Cardano protocol where the Staking reward is not based on tenure and the proposal is not clear on how the extra returns are earned/produced. ", "q0r": 3, "q1": "The proposal does not include any past references of the proposer and is also not clear on how the additional value/money is created for the increased reward. Therefore it is difficult to appreciate how the proposal will be implemented. ", "q1r": 2, "q2": "The proposal is for 60K USD and does not provide how the money is allotted for implementing the project. The outcome KPI and the end state is not clear. Therefore it is difficult to audit the proposal. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 18, "ne": 0, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is lacking in details and should be explained more in-depth so all community members including those who are unbanked or unfamiliar with Traditional Finance (TradFi) may also familiarize themselves with the project's direction. That said, the proposal itself is a great idea, having been modeled after traditional banking certificates of deposit schemes. This could prove beneficial to those interested in potentially more stable longer-term, higher rewarding, DeFi products.", "q0r": 3, "q1": "Feasibility is in question in many areas. The execution, construction, legal, regulatory, custodial/non-custodial, budget usage are all concerns that have not been addressed. The proposer's experience is aligned but less technical and more practical. It is suggested that the proposer, expand the proposal by providing more details, addressing the areas above at minimum, and resubmitting for the following funding round. The proposal is interesting enough and if feasible and auditable could be a great opportunity to ADA, possibly native token, holders.", "q1r": 1, "q2": "As mentioned in the feasibility section, the proposal lacks any metrics related to audit-ability. Again, I would like to encourage the proposer to build out a fully detailed proposal and resubmit it for Fund 8. Include key metrics, how success is measured, relevant risks, and other pertinent criteria. If the proposer requires assistance please reach out to a member of The Catalyst School, a former/current proposer, or just another community member.", "q2r": 1, "assessor": "z_assessor_591", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "There's very prominent difference about staking in Cardano and in any other cryptocurrencies: not-locked. User can easily move their ADAs and still get rewards. In this proposal, author giving information to get higher rewards with staking for a long period to smart contracts. With my understanding, author generally want to make protocol for long time staking like locked staking to gain more rewards. Maybe author can described more about the idea to gain more rewards in detail.\r\n\r\nWith Cardano there is another possibility to get bigger staking rewards: increasing transaction in Cardano ecosystem. Because Cardano's ecosystem is still growing, our rewards came from ADA reserve + small transaction fees.", "q0r": 2, "q1": "Budgets are not realistic as proposer asking 12% of the total rewards from this Challenge and not breaking down the budget. I think this proposal is still a raw idea and need to be discuss more with community forum then build a team with proper experiences. Author should create model about how the protocol can gain a higher yield than existing staking.", "q1r": 1, "q2": "No roadmap, no key metrics and success criteria. Without three of them, this proposal can not categorized as an auditable proposal. Author need to discuss with DeFi community first to explain how the protocol will work.", "q2r": 1, "assessor": "z_assessor_639", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "I am a pool operator and also staking ADA, also I would love to get 5% more bonus/year when staking for long time. Because I have been staking for 1 year but my reward is still the same as someone new to staking 1 month. This doesn't seem fair at all. But actually, if we think more deeply, we will see that paying higher rewards for stakingers for longer is just in line with the way banks operate. Because the bank needs to use your money for the time you commit to leave the money in their bank. As a result, the bank will encourage you to deposit longer by increasing your APY if you deposit for a long time so they can use your money to lend. As for Cardano's Ouroboros mechanism that works under the Proof-of-stake consensus mechanism, using a smart contract to lock your ADA for a period of 6 months or 1 year does not bring any benefit to the system. chief. Besides, encouraging people to staking for such a long time may affect other Defi activities such as borrowing and lending because users will consider whether to put ADA in Defi or staking. If the APY staking 1-2 years is larger than putting ADA into Defi to do related operations, Defi will be prevented from developing.", "q0r": 1, "q1": "The proposer said that he/she understands the benefits between crypto and traditional banking is very important- 1usd vs 1 ada - value difference. This is not a required experience for the implementation of this proposal. This is actually more of an idea than a proposal. This is just a proposal that wants Cardano to change the way it rewards long-term stakingers. But the proposer did not give a valid reason why Cardano should do so", "q1r": 1, "q2": "No timeline or clear deliverables have been mentioned thus making it hard to audit. The proposal has not define what success would be. This is just a recommendation to Cardano about rewards for long-term staking", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about developing a term staking/smart contract protocol allowing users to gain more rewards for a dedicated time/day/month/year stake or pool. The problem statement is not likely to describe the problem and is not explained in detail. It seems that this proposal is incomplete. The solution's direction is very abstract but worth trying for completing in the following fund. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "This proposer's profile is not provided, and, there is no proof/link for verification. As a result, definitely, there are no grounds to agree on the feasibility of this proposal, however, my only advice would be: in case it is necessary to complete this proposal in the next Catalysts in the future, the proposer should pay attention to ensure that the following components are fully met: (i) Goals and target; (2) road map (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge. Based on the given information, I disagree with this proposal's feasible, and would give it a score of 2.", "q1r": 2, "q2": "For an incomplete proposal like this, auditability / transparency can't be guaranteed. Therefore, my only advice would be: the proposer needs to ensure that the following components are fully met: (i) Goals and target; (2) road map (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge. Based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 15, "ne": 4, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is extremely vague in its wording. It does not offer rationale for why yield should increase and, more importantly, does not elaborate the risks that have to be entered either on the smart contract code risk or the systemic risk to achieve these yield gains. In an environment where Cardano is perceived as relatively slow but more prudent and verifiable, this is an unwanted direction to add hype without adding detail, innovation or safety net.", "q0r": 2, "q1": "The reader of the proposal learns nothing about the team, roadmap or qualitative milestones, only numbers plucked out of thin air. It is the shortest and poorest presentation of a business plan asking for $60k I have ever seen. The proposal does not elaborate on \"relevant experience\" except by comparing \"1usd vs 1ada\" which makes me doubt that the proposers have a thorough understanding of cryptocurrencies or DeFi.", "q1r": 1, "q2": "This proposal does not present any auditable performance metrics, milestones or timeline. There is no information whatsoever by which mechanisms and technical means the targeted yield increase is to be achieved. There are no links to Github and no whitepaper that would help assess how or by whom the smart contracts necessary to lock value for pre-defined periods are to be created. The budget of $60k is not broken down at all, making it impossible to tell how effectively the funds would be deployed.", "q2r": 1, "assessor": "z_assessor_692", "no_vca": 15, "ne": 4, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "I understand this proposal is to provide term staking for ada like some exchanges like binance are doing. You can add more complete information such as benefits and risks than current practice to highlight the proposal and impact the ada holder community.", "q0r": 2, "q1": "Staking into pools not only takes rewards but also participates in many other transactions, you should add more information to clearly explain how it works, related metrics, decentralized system will work how to move. The amount requested 60000 needs to specify the details of what it is used for and the cost of each item", "q1r": 1, "q2": "Roadmap and indicators to be achieved when implementing the project is necessary for the reader to clearly understand your desire to implement the project, it should be further elaborated", "q2r": 1, "assessor": "z_assessor_697", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Staking rewards is a decentralized finance solution to support PoS mechanism, and does warrant careful considerations as liquidity will be \"locked\" in smart contracts; and as inflationary pressures means real adjusted rewards have an increasingly nominal value. However, the proposed means of assuring the continued fidelity of PoS doesn't demonstrate how it would be achieved, and how it alters current designs (e.g., lottery system, inflation schedule). Alternative solutions to encourage long term delegations should be considered. ", "q0r": 2, "q1": "Funding doesn't translate into a mandate from the greater Cardano community to implement these changes. Or even support from IOG. ", "q1r": 1, "q2": "No way to manage expectations with the information given. ", "q2r": 1, "assessor": "z_assessor_716", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal in question, while a good idea, has provided a very vague idea for the problem statement, and does not include enough information for one to be confident it would add a measurable impact for the defi ecosystem on Cardano. I believe that this does not really fit the \"boosting Cardano's defi\" challenge; could possible fit under \"miscellaneous challenge\"? ", "q0r": 2, "q1": "The proposer does not give any information on who will be undertaking the research or how exactly the budget will be broken down and distributed, more information needed.  Currently with the amount of information provided the budget that is quoted of $60k in my opinion is not warranted. ", "q1r": 1, "q2": "There is no roadmap/time horizon listed or any KPI's. At this stage there is not enough information on this proposal for the community to track progress. In conclusion, a clearer definition of the solution to the problem is needed as well as a fleshed out detailed plan so if funding is given it is accounted for and easy to audit. ", "q2r": 1, "assessor": "z_assessor_858", "no_vca": 15, "ne": 1, "ng": 13, "nfo": 1, "vca_o": 1}], "solution": "开发一个定期定额/智能合约协议，允许用户通过专门的时间/天/月/年的定额或资金池获得更多奖励。", "experience": "了解加密货币和传统银行业务之间的好处是非常重要的--1usd vs 1 ada --价值差异。"}