{"id": 383214, "author": "tobrien", "title": "Climate Finance For Small Farmers", "url": "https://cardano.ideascale.com/a/dtd/383214-48088", "category": 26233, "amount": 12000, "description": "农业现代化要求小农户在没有安全网的情况下承担生计风险。", "funded": 1, "upvotes": 38124024, "downvotes": 31684484, "votes_result": 6439540, "votes_cast": 387, "f6_no_assessments": 5, "f6_rating": 3.5333333333333328, "videos": [], "media": [], "f6_assessments": [{"q0": "该提案有效地解决了挑战，即通过为一个非常重要和有效的供应链提供解决方案来发展DeFi Cardano空间。我在农业供应链上工作了几年，从农民到跨国公司，可以体会到这样一个提案的重要性，以及它可能对人类、自然和通过提供解决方案对Cardano带来的影响。该提案确定了一个有可能影响挑战的问题，但仍然需要一些研究/白皮书来完成。该提案有可能为Cardano生态系统增加巨大的价值，但除了提到市场的规模外，最好能增加一些关于金融规则和流程的信息，以及它与DeFi机制的关系。\r\n该提案的几个关键指标和目标与概述的挑战设置一致。尽管这些挑战提出了一些具体的关键绩效指标，但并没有提及。虽然现在还处于早期阶段，但如果能增加一些估计，如该应用程序在每个阶段将包括多少农民，那就更好了。增加一些关于拟议试点的内容（农民、供应链、价格、作物、关键挑战）会非常有帮助。", "q0r": 4, "q1": "该团队经验丰富，该提案提供了足够的信息来证实它。该团队也在Cardano和催化剂生态系统中活跃了几年。如果能提供更多关于加纳当地项目和团队领导的信息，那就更好了。预算概述清楚，并分解为可识别的项目，对实现既定目标是合理的。作为一个企业家，我可以估计，对于目标来说，成本是非常适中的，需要更多的资金。建议者的目标是向投资者融资，这很好，但这将是在年底，可能在这个过程中需要更多的资源（即开发、流动资金）。如果能在提案中提到这一点，并提供更多的信息，那就更好了。该提案提供了一个现实的时间表来完成工作。\r\n农业供应链是复杂的，有许多挑战将是重要的，需要提及和注意的。比如贸易商的目标、物流或现金流循环需求。同样，如果能有更多关于试点项目的信息，以评估其可行性，会有帮助。  ", "q1r": 4, "q2": "该提案有明确的路线图、步骤、预算、时间估计和可交付成果。要解决的问题和解决方案非常复杂，虽然信息呈现的顺序很好，但还需要更多的细节，将在几个月后随白皮书一起提供。潜在的风险和挑战并没有像可行性部分提到的那样得到特别处理。扩大衡量成功的指标/KPI将是有益的，例如预期的农民数量和他们的经济改善。然而，进度可以根据3-6-12个月内要实现的里程碑进行审计，我相信这些里程碑将为社区提供与重大的、可扩展的挑战有关的重要信息，而预算是非常合理的--所以我在这里给出了全额的预算。", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "你好，艾达的选民我很高兴看到这个提案以及我在审查中的角色，因为我可以看到这个提案的影响以及它与挑战的联系可能会在翻译中丢失。本提案与挑战的结合方式如下1.这项提案将有助于解决许多defi dapps缺乏的一个问题，那就是与现实世界和现实世界的资产/产业的联系！ 2.2.2.Cardano defi还很年轻，所以当涉及到平滑Cardano上Defi的边缘时，我们将需要支持许多实验。这个建议将与催化剂分享任何与加强defi daps有关的教训和数据。特别是在defi和农业之间的联姻!3.本提案旨在解决的问题是创建一份白皮书，一个工作原型，以及其成品的概念证明，已经表明有两个潜在的玩家使用他们的Dapp，这些玩家将被纳入Cardano提升Defi的本机。第一个 \"玩家 \"将是那些利润很低的农民，他们可以通过种植有机作物和可能通过与买家联系来减轻他们利润低下的风险而从这个提议中受益；第二个是投资者，他们可以通过将资金流入农业/国防工业而获利。在这部分审查中，我们需要退一步问自己，什么会真正促进Cardano的Defi？有一点是，如果我们看看农业的发展方向，我们可以看到Defi和气候数据空间将是目的地。这是因为农业是一个周期性行业，其数据效率低下，导致许多人放弃了产量。还有许多联系不紧密的农民，他们的作物可能是高质量的，但这些作物没有被收购，这导致了很多浪费。区块链可以解决我们传统系统的这两个故障。区块链首先为农民提供了一个出售和购买数据的市场，其次是一个可以将农民与当地和国家边界甚至世界范围内的买家联系起来的市场。我认为这个建议的影响将是最有益的，因为它是一个概念证明，可以让解决农业世界面临的这些问题的球滚动。", "q0r": 5, "q1": "我不认为我们对这个计划的实施有任何担忧，因为资金是1.2万，这在我们的总体预算中并不是一个巨大的数字，但 \"投资回报率 \"或上一节中解释的意图的回报率远远超过1.2万的数字。我对建议的实施有信心的原因是：1.因为团队有丰富的经验；2.计划本身并不雄心勃勃，因为它的目标是创造一份白皮书，并且已经明确规定了资金和时间的需要。它还以一种非常可行的方式扩展成一个原型和概念证明，包括对每一步的简要总结，表明这个概念证明将首先在哪里开花结果（加纳）。我相信，当涉及到提案时，\"骑师 \"是最重要的部分，这就是为什么我邀请Ada持有人查看下面的团队证书的原因\r\n 乔纳森-科赫（负责人）\r\n\r\n乔纳森在提供贸易领域的解决方案方面拥有超过30年的经验。乔纳森在全球40多个数字贸易/定制/贸易便利化项目中拥有实践经验。他是贸易平台方面的专家，该平台通常被称为 \"单一窗口\"，是世界贸易组织（WTO）贸易便利化协议中倡导的主要贸易便利化工具之一，该协议已生效并得到170多个国家的批准。乔纳森曾担任许多海关/贸易便利化实施项目的项目主任，包括肯尼亚、卡塔尔和阿曼。他大量参与咨询工作，担任香港特区政府下一代电子贸易系统的首席顾问。他是希腊政府的首席顾问，帮助制定其国家贸易便利化战略和路线图。他还领导了许多国家的技术援助/可行性研究。他作为东盟经济共同体的专家资源，帮助制定东盟的无缝贸易便利化指标。\r\n\r\n乔纳森还担任过各种国际组织在贸易便利化和政策问题上的专家资源。他是国际货币基金组织的访问学者，曾担任联合国亚太无纸贸易专家网络（UNNeXT）的国际咨询委员会成员。\r\n\r\n蒂莫西-奥布莱恩（负责人）\r\n\r\n蒂姆在为雷神公司、花旗集团、德意志银行、东京银行、丹斯克银行、飞利浦医疗、Cerner医疗、挪威航空大陆航空以及最近的谷歌工作时，拥有20年的建立关键任务应用程序的经验。自2019年以来，Tim一直与Cardano技术合作，是Atala PRISM先锋计划的成员。最近，Tim的主要关注点是使区块链的力量为每个人所用。蒂姆有6年的区块链开发经验，经营着有超过15名雇主的区块链开发公司。蒂姆是奇点大学的成员。\r\n\r\n \r\n\r\nCraig Young (顾问)\r\n\r\n克雷格是国际知名的国际支付专家。作为SWIFT的前首席技术官和Diem协会的现任首席技术官，Craig为实现跨境支付做出了不懈的努力。克雷格磨练了深厚的技术知识，使我在晋升到高级领导职位时拥有独特的视角。我曾在全球电信和金融服务机构（包括 SWIFT 和 Verizon）担任副总裁和首席执行官，负责技术、产品开发、工程和网络安全业务。\r\n\r\nGerhard Eschelbeck（顾问）\r\n\r\n格哈德被广泛认为是网络和系统安全方面最重要的专家之一，他曾被邀请向美国国会介绍他在信息安全方面的研究，他也经常在主要的行业会议上发言。\r\n\r\n他在2003年、2004年被评为InfoWorld的25位最有影响力的CTO之一，并在2006年第三次获得这一荣誉。格哈德经常为SANS的20大专家共识作出贡献，确定最关键的安全漏洞。格哈德也是一位备受推崇的作家，也许因出版 \"漏洞法则 \"而最为人所知。他是通用漏洞评分系统（CVSS）的发明人之一，并在管理网络安全领域拥有许多专利。", "q1r": 5, "q2": "这个提案绝对是 \"审计友好型 \"的，因为他们已经为每一部分资金制定了如下的时间线。2个月内完成白皮书，3个月内完成工作原型，概念证明将是6-12个月的永久收益。这使我们能够让团队对提案的每个过程负责。", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 16, "ne": 11, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The proposal matches the challenge in that it would create a dApp to support investing in smaller farms with the goal to help the farmers change to a more climate friendly farming.", "q0r": 5, "q1": "I will say here, that the majority of the text of this proposal is about the proposing team and their experience and background. This is certainly great but the idea in itself is very complex and would have benefitted from more content and actionable steps of the project itself and the prior work the team has done. It seems that the team focusses on Africa with this project as this is where they are already working on similar projects. It would have been interesting if the team will be expanding this tool, if the tool will be used exclusively in Africa or if it would be a good tool to adopt to other countries. It would have been great to provide the rationale with a comparison of (government) subsidaries in other countries and the impact that these funds had on emissions when smaller farmers changed to more sustainable farming - it would have been easier to understand the impact, that this proposal might create.", "q1r": 4, "q2": "While it is a great idea, due to the lack of actionable steps, this proposal is difficult to audit and transparency is not as high as in other projects. One of the three references provided in the proposal does not work, the budget is broken down too broadly as is the roadmap. ", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 22, "ne": 1, "ng": 18, "nfo": 3, "vca_o": 1, "reply": "Why is writing a whitepaper about a project hard to audit?\nThe product of this proposal are whitepapers. "}, {"q0": "The proposal as-is lacks detail to make a good opinion of what its impact would be. The general idea seems good, but the proposal remains vague on the details enough that it's hard to picture what the mission is, how will revenue be generated, why would investors invest in the project, etc... In addition, the project reminds me of Kiva, a cardano-powered lending platform that is already well established and has been mentioned by Charles Hoskinsons himself on multiple occasions. There is no mention of how this platform is different or better than other lending platforms, and how it would attract users and investors.", "q0r": 2, "q1": "The team is small, but with the right people, it could be possible to achieve this in the proposed timeframe. However, the proposal is light on the details as far as planning go, with only some very high-level targets exposed. ", "q1r": 3, "q2": "The proposal doesn't lay out success metrics, and the milestones are very high-level. Risks and challenges aren't adressed, and the roadmap is vague.", "q2r": 2, "assessor": "z_assessor_318", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I think reviewers   need to consider more carefully how you approach gradingf projects whose goal is to write a \nwhitepaper and/or buld a research pilot. These kinds of projects are extremely valuable as they can be \ndone on low budgets as proof of concepts  to prove the value of moving on to a larger project. \nWhat does a proposer who proposes writing a white paper have to do for auditability? \nHow to address risks since documenting a failed outcome might be as important as document a successfull outcome.\nWhat is a success metric for writing a whitepaper on a pilot? \nWhy is the milestone \"veru high risk\" pilots are supposed to fail sometimes and the lessons learned are very valuable.\nIf someone whats to research-  on a low budget  -someting like micro-lending how much should they say about the outcome \nif its research we arn't sure of the outcome. \n\n "}, {"q0": "The problem is not so much tied to this challenge, but the solution and the success metrics in this proposal fit the challenge setting. \r\nHowever, there has no content in this proposal shows that it will bring any value to the Cardano ecosystem and so on the detailed plan. \r\n", "q0r": 3, "q1": "This proposal only overviews about benefits and features for users only.   \r\nIt lacks all the basic info for assessing the feasibility. Include: \r\n- Detailed implementation plan for knowing what will do. For developing this system, it should add more info about: coding, function, technology support below... \r\n- Detailed roadmap: this proposal doesn't have it. All info that relates to the timeline is their success metrics with a short brief without explanation. \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. ", "q1r": 2, "q2": "The proposal doesn't have a roadmap with detail and realistic timeline. So we can audit this project. \r\nThe key metrics are clear but there is no detail for clearing about them\r\nThe proposal has detailed explanation of the problem and how the solution can address it. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I think reviewers   need to consider more carefully how you approach gradingf projects whose goal is to write a \nwhitepaper and/or buld a research pilot. These kinds of projects are extremely valuable as they can be \ndone on low budgets as proof of concepts  to prove the value of moving on to a larger project. \nWhat does a proposer who proposes writing a white paper have to do for auditability? \nHow to address risks since documenting a failed outcome might be as important as document a successfull outcome.\nWhat is a success metric for writing a whitepaper on a pilot? \nWhy is the milestone \"veru high risk\" pilots are supposed to fail sometimes and the lessons learned are very valuable.\nIf someone whats to research-  on a low budget  -someting like micro-lending how much should they say about the outcome \nif its research we arn't sure of the outcome. \n"}], "solution": "撰写一份带有工作原型的白皮书，概述了分配小农户农场现代化方法风险的有利可图的方式。", "experience": "https://www.cardanonocode.com/leadership.html"}