{"id": 383622, "author": "austin.m.negron", "title": "anetaBTC, decentralized wrapped BTC", "url": "https://cardano.ideascale.com/a/dtd/383622-48088", "category": 26233, "amount": 45000, "description": "我们必须有一个协议，在Cardano上解锁比特币的价值，以充分优化Cardano DeFi的潜力。", "funded": 1, "upvotes": 96594383, "downvotes": 12247294, "votes_result": 84347089, "votes_cast": 822, "f6_no_assessments": 6, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "该提案希望实现一个包裹BTC的解决方案，该方案被命名为anetaBTC，可以在Ergo和Cardano区块链上使用。比特币是目前市场上最大的区块链网络，许多第一层区块链已经产生了比特币的包装版本，以便它可以在这些生态系统中使用。由于DeFi的普及和使用案例，一个能让比特币在Cardano和Ergo生态系统中轻松使用的解决方案将可能是一个高影响力的解决方案。该提案团队已经提到并考虑了其他包装好的比特币协议，如目前在以太坊上使用的wBTC。在他们的文件中，他们概述了一些主要的区别，其中一个主要方面是anetaBTC是非托管的，这有助于防止第三方风险。这种对市场的理解以及他们的解决方案相对于现有解决方案的优势，有助于进一步证明该解决方案可能实现的潜在影响和采用。", "q0r": 5, "q1": "这个团队没有在他们的提案中列出，但是如果你访问他们的网站，你可以找到这个团队，其中一些人还添加了LinkedIn的资料--https://www.anetabtc.io。他们没有提供预算明细，也没有提供任务清单和实施的每个阶段的时间分配。一些技术团队的背景资料提供了适度的证据，证明他们有足够的技术背景。建议书或他们的网站上没有提供Github或代码库，如果能看到这一点就好了，可以帮助验证他们在该领域的专业知识。所提供的文献资料详细说明了wBTC和anetaBTC之间的比较，并解释了一些架构，这有助于证明该团队的专业知识。为了得到更好的评价，最好能得到更多关于团队背景或代码库的资料，以进一步相信这个提案是可行的，因为建议的提案复杂性很高。还需要一个预算明细，以展示拨款的情况。", "q1r": 4, "q2": "由于所提供的文件和提案本身的解释，提案的清晰度达到了良好的标准。提案中没有包括成功目标或关键绩效指标。提案组一直在写博客文章，分享项目发生时的信息，这使得人们更容易发现项目组发生的情况。如果能增加更多的信息，说明这个项目的哪些部分将是开源的，什么时候开源，这样社区就可以审计技术实施情况。一些具体到anetaBTC可能首先被整合的关键绩效指标也会给社区带来更多的信心，在完成后可以审计这个提案的影响。", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem of bringing the value of Bitcoin to the Cardano ecosystem. They will ad value to the Cardano ecosystem by enabling Bitcoin holders to bring their BTC to Cardano Defi. Their key metrics align with the challenge in the sense that they will drive BTC holders to Cardano Defi. The proposal is able to scale as wrapped BTC is essential in Defi.", "q0r": 5, "q1": "The relevant skills and team has been provided in a linked medium article. It's hard to track some of them down. It would've been beneficial to ad linkedIn or Github pages to make that process easier for the reader. They have been bootstrapping up until now so 100% of the budget will go to the research and engineering team. The release of version 1 is Q1 2022 which is around the corner and sensible. They provided a link to a lite-paper on Medium that delves into the technical details of how and what is getting built.  They haven't provided a list of risks considered, but since the community will be able to vote on protocol changes they will be quite resilient to anything that surfaces in the future.  ", "q1r": 4, "q2": "They provided a roadmap with milestones in the linked document. They have KPIs in their Roadmap as well as a section where they list future tasks and additions making it very easy to track the performance and progress of this project. The problem they address is bringing BTC value to Cardano Defi and they solve it by building a wrapped BTC product that enables users to unlock their BTC value in Ergo and Cardano.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 27, "ne": 3, "ng": 24, "nfo": 0, "vca_o": 1}, {"q0": "This proposal matches the challenge brief very well in that it would use a bridge to enhance cross-collaboration and usecases across different protocols.", "q0r": 5, "q1": "The team provides an active twitter account that has a decent following and can be used as proof of prior work and to see if the team has an active following, which it seems they have. They also provide references for prior work and a very good overview on their base principles and how their skillsets as a team is distributed between engeneers and researchers. The way that the team is able to describe the technical information for the assessors and voters is very well thought out which I find very important. I find that it is highly likely that this team and this proposal would be a great addition to the Cardano DeFi network.", "q1r": 5, "q2": "Team has provided enough and important information about their related skillset, their prior work and the technical relation and reasoning for this project. The roadmap and actionable steps can be found through the provided link on Medium, which is where the team provides additional information on their protocal, team and progress of the project. I´m deducting one star of the rating, because the budget itself is not broken down. This is necessary for this community, even with a promising project so that new as well as established community members provide transparency and trust within our community for future funding rounds.", "q2r": 4, "assessor": "z_assessor_19", "no_vca": 23, "ne": 2, "ng": 21, "nfo": 0, "vca_o": 1}, {"q0": "The Cardano ecosystem really needs a protocol to unlock the value of Bitcoin on it as the problem in this proposal mention. And as the solution and its detailed explanation, I think it can help to make it. \r\nBut the proposer needs to show some key metrics or KPIs that the team will focus to complete. \r\nBy the way, the idea is very simple and clear, that's the reason why I rate 3 out of 5 even not having key metrics. ", "q0r": 3, "q1": "As their technology explanation, it's not too simple to estimate what their work will do. Hence, wish that they can add a more detailed roadmap to the proposal to help us assess whether the required budget is reasonable or not, and the feasibility of their implementation plan. \r\nMoreover, there is no info of the team attached to the proposal, except the interview video. As a normal user that not familiar with the founder, we cannot measure how much we can trust him and his team. So, my advice is the proposer should provide some team info. \r\nEven it a vital idea, but lacking of a lot of above info, so I have to rate 2. ", "q1r": 2, "q2": "The proposer does not provide enough materials for auditing the project, including a detailed roadmap of implementation, key metrics, or KPIs. \r\nMoreover, the proposer didn't provide any relevant risk to their project.\r\nAbout the problem and solution, the proposer shows that their team has well aware of the market context and their solution can help us explain clearly and clarify what will help to solve it.\r\nTo me, I really need to see this idea come real, but the proposal lacks a lot of info for having a high rate. ", "q2r": 2, "assessor": "z_assessor_671", "no_vca": 16, "ne": 3, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal aims to trustlessly (through smart contracts) wrap bitcoin for availability for use on the Cardano and Ergo blockchains. This proposal clearly identifies a problem that would be very beneficial for the Cardano defi ecosystem; to be able to tap into liquidity from the Bitcoin blockchain, this would be a major kickstart for migrating and gaining TVL on chain for the Cardano defi ecosystem as a whole. I feel like this proposal aligns very closely to the challenge of \"Boosting Cardano's defi\".", "q0r": 5, "q1": "The team that is listed on the whitepaper is clearly qualified to undertake the task set forward in this proposal, the proposer clearly outlines the individuals involved with the project and provides references as to current and previous academia.\r\nThe asking budget seems very reasonable for the task at hand, however a more detailed breakdown of the funds is lacking. All in all I feel the timeline given for the tasks to be completed is also very realistic and achievable. ", "q1r": 4, "q2": "The proposal does have a fairly detailed roadmap in the form of an image, and all the time lines given seems reasonably achievable. Although KPI's would be a valuable gauge in progress which currently aren't listed. In conclusion this proposal very clearly understands the problem at hand and seems to have a viable and achievable solution to the problem. ", "q2r": 4, "assessor": "z_assessor_858", "no_vca": 14, "ne": 4, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "Because of the references (Xclaim, Ren, Interlay) this proposal does effectively address the challenge of the proposal. Technical proposal updates have provided insight into progress (80% renVM protocol integration with native ERGO assets). It would be nice to have more of a gnatt chart style roadmap with milestones and technical progress and would hope this is planned later in development. ", "q0r": 4, "q1": "Due to the merit of the team and the work done so far I agree that the proposal will be implemented successfully. There should be a more detailed whitepaper soon (before 2022) if the public $NETA sale is supposed to take place Q1 2022. ", "q1r": 4, "q2": "The information provided is too high level to be able to audit and, progress is not reported in a systematic way but the team and references included inspire confidence in the project. (The technical updates have shown roughly what team members are working on but with no timelines, it would be nice to have a team breakdown with topics they are dealing with in a table)", "q2r": 3, "assessor": "z_assessor_950", "no_vca": 21, "ne": 3, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "anetaBTC是一个去中心化的、完全在链上的、包装好的BTC产品，允许用户在Cardano和Ergo上无缝解锁其BTC价值。", "experience": "anetaBTC是一个研究驱动的协议，就像Cardano和Ergo一样。anetaBTC是由来自麻省理工学院、赫尔辛基和莫斯科的CS博士们开发。"}