{"id": 383715, "author": "ralph.chutikul", "title": "Energy Finance |Clean energy X DeFi", "url": "https://cardano.ideascale.com/a/dtd/383715-48088", "category": 26233, "amount": 56000, "description": "包括Cardano生态系统在内的所有区块链中的DeFi快速增长，但有0个基金或用例进入清洁能源领域。", "funded": 0, "upvotes": 27719662, "downvotes": 27222952, "votes_result": 496710, "votes_cast": 306, "f6_no_assessments": 5, "f6_rating": 3.066666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Proposal identifies the need to bring existing financial solutions to the Defi space. They will ad value to the Cardano ecosystem by bringing a lot of new users to the  space with this clean energy Defi model. The metrics of the proposal are aligned with the challenge in the sense of growing Cardano's Defi. This project will be able to scale as there is a huge clean energy market out there.", "q0r": 5, "q1": "They have a team of 3 with relevant experience except for Defi experience. You need to get a Plutus developer on this team as they are essential to have onboard from the start. They provide a website with a demo of what the UX would be like. The budget isn't broken down or explained. The community needs to know how you plan to spend these funds. If you  provide a clear budget breakdown it also shows your approach to solving this and could boost voter confidence in your abilities. The product with all its features will be finished in 12 months, which is reasonable for what needs to be built. They explain in detail what the different use cases are for the tokens and NFTs. No technical details have been provided on how they will build this. yes they already have a demo to show user experience, but the community needs to know how the backend will function. Providing these technical details will boost trust in your abilities. They haven't considered any risk/challenges. Not being aware or prepared of future risks will slow you down.", "q1r": 2, "q2": "They provided a roadmap with milestones, making it easy to track the progress of this project. They still don't mention who will build these smart contracts in the first 3 months, so it could  potentially take longer. They didn't provide any KPIs. In order for the community to track the performance of your project you need to ad KPIs. User KPIs are very good at tracking performance. Like How many users join your platform. How many tokens gets minted. etc. They recognize the problem of bringing clean energy financial markets to the Defi space and they intend to solve this by creating a Defi protocol that encourages clean energy.", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 23, "ne": 9, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "Impressed. This could be the next big thing, not only in Cardano DeFi, but DeFi in general. This is, in fact, three solutions in one. I'm not sure about the Utility Pay because people might not want to part with those \"beloved\" ADA tokens (if they have a choice, they HODL and stake). But if it does have potential, you should talk to the Coti team and see if their ADA Pay solution could be used in the renewable energy sector.", "q0r": 4, "q1": "I went through the docs on the website and listened to the pitch in the ADB competition (the video). You guys are really smart! I was left wondering what exactly have you done with those private sector players like Schneider Electric. If you are really working with them it should have been mentioned in the proposal. To make sure this idea has legs you will need to grow your team and bring in experienced team members who can help you scale. You will need muscle in engineering but also in marketing and community building as you mentioned on the video. Let's hope you get to tie those connections through Project Catalyst.", "q1r": 3, "q2": "If I had to rely only on the proposal text I would say it's not completely sufficient but that combined with the presentation and the website paints a holistic picture of the the solution. It is quite clear what you want to deliver and, with some added transparency, the progress can be quite easy to audit, too.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "Great idea, definetly in the scope of the challenge fund.\r\n\r\nI have read the proposal, watched the video, visited the website, and it seems as a share token, where an owner holds a share of an asset (in this case solar panel) and based on this share (enft) he gains a percentage of return. \r\n\r\nClean energy is an important part of our world, and this can boost its adaptation and spread. \r\n\r\nRating given 4.\r\n\r\n", "q0r": 4, "q1": "Based on the information provided, I am confident they can deliver. The webpage works, they already have a partner for solar panels and their experience is reasonable.\r\n\r\nRating given 5.", "q1r": 5, "q2": "The roadmap is provided in reasonable detail, yet I am missing more details on key metrics (number of users, number of artists working on eNFT, number of cooperation with owners of solar panels etc.)\r\n\r\nBudget is not divided, so we do not know they will use it.\r\n\r\nRating given 3.", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This project will tokenize the clean energy asset like solar rooftops as NFT and tokenized renewable energy credit validated from real-world IoT meters to be used in DeFi. This project will attract a lot of green energy users and encourage more of them to make this world better. In 2020, renewable energy sources accounted for about 12.6% of total U.S. energy consumption and about 19.8% of electricity generation. \r\nHence, if this project success it will bring a lot of value to the Cardano network. ", "q0r": 5, "q1": "Developing this type of dApp, there includes a lot of activities: coding, marketing...\r\nBut the proposer has no content about how this project will be made and run to success. It only contains an overview of the idea, some key features only. \r\nThere is no roadmap, and the required budget has no detail of which part and how it will be used for. ", "q1r": 1, "q2": "The proposer provides nothing in this proposal that helps to audit it. No plan, no roadmap, just some of the key metrics in this proposal.\r\nThere is also no info about the problem explanation. But there is content to say how their solution can affect on users and communities. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The proposal correctly Identifies a problem of lack of renewable energy and audibility in the Defi sector and seeks to close the gap. However it is unclear how the proposal's tokenized assets will actually be implemented and what actual value they will bring to the ecosystem as a whole.", "q0r": 3, "q1": "The team obviously has experience within the renewable energy field but it is unclear what experience they have when it comes to blockchain. The large amount of funds requested requires an in depth breakdown in to determine the actual feasibility if the project and where the funds will be allocated.", "q1r": 2, "q2": "A timeline has been provided but no metrics on what exactly success looks like. For example a smart contract is mentioned that supports the eNFT framework but what does this smart contract specifically do? Is it intended to pay out dividends?", "q2r": 2, "assessor": "z_assessor_745", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "带来一个DeFi协议，使用来自现实世界的代币化可再生能源信贷的DeFi基础，帮助推动绿色融资。", "experience": "一个由3人组成的团队，在东南亚地区拥有10年以上的可再生能源、平台业务发展背景和绿色融资经验"}