{"id": 383888, "author": "mallabs", "title": "On-Chain Data Analytics", "url": "https://cardano.ideascale.com/a/dtd/383888-48088", "category": 26233, "amount": 92820, "description": "DeFi协议需要高密度的、历史上完整的、逐点的定价和资产信息，以及分析工具。", "funded": 2, "upvotes": 312524109, "downvotes": 4979911, "votes_result": 307544198, "votes_cast": 2235, "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"q0": "Another great proposal from Mallabs, enabling complex on-chain analytics for the Cardano ecosystem to use.\r\nThe proposal addresses the need for upcoming DeFi for quality inputs by bootstrapping a dedicated warehouse hosting service.\r\nKey metrics are mentioned and include a number of data feeds, monthly users, queries and analyses.\r\nThe project is fully aligned with the challenge.", "q0r": 5, "q1": "The proposing team is well known to the community, with a development on its own advanced Dex as well as getting funded in Fund6.\r\nThe team is highly competent with an expert in Haskel programming from academia. The team has sufficient experience and capacity to deliver and are well known in the community.\r\nThe budget is clear and covers the cost of personnel as well as the first 6 months of warehousing service.\r\nThe length of development seems reasonable, over one year with several milestones to report on.\r\nThe possible risks have not been addressed in particular, but given the team background and the well-developed proposal, I do not consider it as high impact to deduct points.\r\n", "q1r": 5, "q2": "The proposal has a clear roadmap, steps, budget, time estimate and deliverables.\r\nThe proposal fits the challenge goals, by building the tools for all DeFi apps to use\r\nIf successful, such tools will be a foundation for the upcoming DeFi explosion on Cardano.\r\n", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 25, "ne": 4, "ng": 20, "nfo": 1, "vca_o": 1}, {"q0": "Financial institutions need data to make investment decisions. Block chain seems to be an excellent place to organize that data. The proposal makes a clear case for impact. \r\n\r\n\"Bringing portfolio managers to the blockchain will unlock a significant source of total value locked for the entire ecosystem.\"\r\n\r\nAnd explains the importance of data\r\n\r\n\"1. Data quality, in terms of granularity, and dependability is vital for researching and implementing portfolio management strategies in terms of. \r\n\r\n\r\nThe premise seems logical and correct:\r\n\r\n\"2. For the Cardano DeFi ecosystem to mature and for DeFi to continue its evolution...educated and evidence based decisions \" is necessary\"\r\n\r\nThe proposers point out the existence of this same resource in traditional financial eco-systems, which is convinvince that blockchain DeFi will need the same resources\r\nPerformance determines acquisition of investors..\r\n\r\n\"3. High quality research and data is associated with brand perception in traditional finance; institutions proudly display the comparative scores of their market research with other institutions. Adding a product that's highly perceived by traditional investment circles adds credibility to the blockchain, which in turn helps onboard retail and large institutional traders.\" Great use case!", "q0r": 5, "q1": "One can not ask for more credibility (feasibility to complete) than is evidenced in this proposal team's experience and team members profiles. Especially from the point of Haskell development experience. This is an excellent use of community funds.", "q1r": 5, "q2": "Roadmap is clear. But more importantly expectations are simple and measurable.", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does an excellent job of addressing the challenge. The real life implications of success are clearly stated and are absolutely correct, The better tools the ecosystem has, the more traditional finance players will want in. ", "q0r": 5, "q1": "Success seems likely. There's so much in this proposal that even if they miss the ecosystem would benefit. \r\n\r\nIt would be helpful to see how the other oracle/ data providers fit into the picture. This tool could easily become a standard for the Cardano ecosystem so how it works with the other tools is important. ", "q1r": 4, "q2": "Clear set of goals, detailed budget breakdown, several KPI's. \r\n\r\nThe first 4 goals will require some contact with the team but the rest will be available to the community (which will be a great opportunity for stress testing). ", "q2r": 5, "assessor": "z_assessor_252", "no_vca": 22, "ne": 1, "ng": 18, "nfo": 3, "vca_o": 1}, {"q0": "This proposal addresses the challenges effectively. The proposer has clearly identified a problem with the challenge and has articulated how it adds value to the cardano ecosystem. The key metrics and goals are aligned with challenges. Furthermore, the proposal can also be scalable in future challenges. \r\n", "q0r": 5, "q1": "This proposal is highly feasible in my opinion, based on the amount of information included by the proposer. The team is composed of high technical profiles. The proposer has managed to provide the evidence of the skills and experiences of the team with their respective linkedin profiles. The budget has been broken down into identifiable items. Since I'm not a technical folk, my judgement of the correctness of the budget is purely based on my intuition. Furthermore, a comprehensible timetable to complete the work is provided in the proposal. Also, a plan with the steps needed to complete the project is in the proposal. Altogether, the proposal is filled with all the information necessary to believe in the feasibility of this project. Information such as risk and challenges that the project may encounter is also included in the proposal.", "q1r": 5, "q2": "This proposal should be auditable based on the information included in it. The proposal includes a roadmap with reasonable milestones. The proposer expects to launch in december 2022 which should be one year from now. The metrics and KPIs that define success are strong and align with the challenge. Altogether, this proposal has provided a clear description of a problem and a solution described thoroughly.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 16, "ne": 4, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The proposal outline creating a data warehouse of on chain data related to DeFi. The core benefits of this proposal are it gives detailed real time data that can be integrated into other analytic solutions or for trading purposes. The higher the availability and quality of this data the more efficient the markets become which further helps to bring in more capital and adoption. By having solutions that make the area of data easier to consume there is a potentially massive impact in opening up the doors to more developers who can create financial applications on top of it that benefit the ecosystem. ", "q0r": 5, "q1": "The proposal lists three software engineers and provides their LinkedIn profiles. The team represents members from Maladex a DEX being built on Cardano. On the Maladex website you can find whitepapers and technical information that provides further evidence that the team has the expertise to implement this solution. The team has both a financial and functional programming background that is high valued for building a DEX and the mixture of these experiences make the team very suitable for a high availability real time data feed for DeFi related data. The budget is broken down into key areas such as development and the data warehousing costs along with the hours and rates applied. Due to the proposal teams current experience and evidence of knowledge it appears highly likely they are well suited to executing this proposal", "q1r": 4, "q2": "The clarity of the proposal is high, the team explain the reasons why access to this data is important and the attributes it needed to truly provide a benefit (e.g. real time speed + provide a depth of data). Basic KPIs have been provided around the users and amounts of queries. It would have been good to provide some examples of potential initial users to this system or any partnerships forming and then applying some more specific metrics to these initial uses cases to help provide confidence in auditing the impact of this proposal. The team mention they will design an open source stack for this solution which as well as the data being publicly available help provide different ways that this work can be audited.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "开发具有高密度和高质量数据的链上数据分析实验室、模型验证和实验工具。", "experience": "传统金融业的资深人士、量化师、经验丰富的Haskell开发者。"}