{"id": 384325, "author": "adilabd", "title": "Incrypture - Smart Structure", "url": "https://cardano.ideascale.com/a/dtd/384325-48088", "category": 26233, "amount": 50000, "description": "证券化解决了贷款人和借款人需求之间的错配问题，但目前的解决方案反而让中间人受益。", "funded": 1, "upvotes": 47280024, "downvotes": 11962984, "votes_result": 35317040, "votes_cast": 292, "f6_no_assessments": 4, "f6_rating": 3.75, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=28723"], "media": [], "f6_assessments": [{"q0": "这个项目是第7号基金中更大的Incrypture项目的一部分。该团队提出这个项目是为了通过代币激励的证券化，使借款人直接受益，甚至是发展中市场的小借款人。证券化解决了贷款人和借款人的需求不匹配的问题，但目前的解决方案反而有利于中间商。该项目可以改变DeFi的游戏规则，并推动DeFi在发展中市场的大规模采用。这个项目肯定是第7号基金中值得关注的一个项目，可以为Cardano社区带来巨大的回报。\r\n", "q0r": 5, "q1": "鉴于其团队成员的综合经验，该项目极有可能获得巨大成功。团队提供相关的路线图，并要求有合理的预算。团队提供的白皮书有深度的技术解释。问题陈述和提供的解决方案相匹配，都能有效地解决挑战。这个项目的成功衡量标准是非常合理的，但缺乏时间目标。这个提案的其他缺点是没有详细的预算明细。团队只提到了开发人员的总时数，但没有详细说明时数的细分。我对团队的建议是用更详细的信息更新提案。", "q1r": 4, "q2": "建议书中提供的成功标准是合理的和可实现的，这使得项目是可行的和现实的。团队没有提到他们将在哪里公布项目的执行进度，使他们的网络成为监督或审计项目的唯一来源。成功标准是相关的和可行的，使它不仅是可审计的，也是现实的。然而，该团队可以通过在Cardano论坛上公布详细的预算支出来改善这个项目的执行情况，以便社区成员可以对其进行审计。即使提案中存在所有的缺陷，这肯定是一个非常有潜力的项目，需要被投票。", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "(This proposal cannot be considered in isolation but the assessor should be aware of the team's other three proposals as well.)\r\n\r\nIf I understood correctly, the team has already developed C# software for Fannie Mae / Freddie Mac and now they would like to create the same Credit Risk Transfer solution but this time built on Cardano. This would essentially mean that huge government sponsored clients start using solutions built on Cardano. That's huge!\r\n\r\nThe solution is aligned with the challenge brief and can have a massive positive impact.", "q0r": 4, "q1": "The plan is written on such general level that it is a bit difficult to get into the nuts and bolts of it.\r\n\r\nThe team is highly skilled and experienced.\r\n\r\nThis Project Catalyst funding would help the team to build the MVP and later get further funding from other sources.", "q1r": 3, "q2": "There are no KPIs / metrics tracking the progress, only the outcome. This makes it a bit difficult to audit. As for the budget, it's quite realistic and the time commitment basically means that if both of their main proposals are funded, this will employ both the founders full-time for four months.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 21, "ne": 1, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "The proposal brings a new kind of a Defi product to the Cardano stage which will bring researchers, developers and users together. ", "q0r": 5, "q1": "The credentials of the team are impeccable. The amount of research and patents behind them is staggering. ", "q1r": 5, "q2": "Once the proposers sufficiently confirm their identities, then this will be a large step forward transparency- and auditability-wise.  The budget seems plausible, however the breakdown of it leaves a bit to be desired. The project does not mention open-source, but they will allow for user feedback. ", "q2r": 3, "assessor": "z_assessor_832", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This proposal has the potential of laying out the groundwork for a platform that could become a fantastic driver of Cardano DeFi. It's quite a preliminary effort, however; they're aiming just for a MVP, and success is defined as having one issuer and one user. ", "q0r": 4, "q1": "Experience of the team seems relevant, but it looks like they'd need at least some external developers that might be hard to find (Plutus/marlowe talent is hard to come by). The project timelines are quite aggressive, the plan only allows for a month of development and a month of testing before having a PoC to get user feedback. This does not seem particularly realistic, given the cutting edge technologies to be used. \r\nThe budget is very brief, and is only considering cost of developers, I assume the core team tasks will not be funded by this proposal, but it's not clear.", "q1r": 3, "q2": "There is one clear goal, that is hard to verify (one issuer/one user), and a very nebulous goal of having an \"MVP developed\". How would that look like? A smart contract deployed on the testnet? A number of mortgages securitized through it? A basic interface to set up on-chain securitization? ", "q2r": 2, "assessor": "z_assessor_941", "no_vca": 20, "ne": 4, "ng": 15, "nfo": 1, "vca_o": 1}], "solution": "由代币激励的证券化直接有利于借款人；甚至是华尔街没有服务的发展中市场的小借款人。", "experience": "数学家、计算机科学家、结构性金融专家和一位曾广泛交易抵押贷款支持证券的SPO。"}