{"id": 385032, "author": "wolstaeb", "title": "DeFi+Catalyst🔥 Retroactive Finance", "url": "https://cardano.ideascale.com/a/dtd/385032-48088", "category": 26233, "amount": 91740, "description": "为了用建立在风险调整后的债券曲线上的新融资模式快速资助催化剂团队，我们需要一种人们理解的用户体验。", "funded": 2, "upvotes": 263139806, "downvotes": 7642963, "votes_result": 255496843, "votes_cast": 1440, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "i strogly agree because the proposal is in line with the challenge above and looking at the solution by creating Conduct user research with behavioural data to design and prototype a mobile app that turns people into impact investors are very important.\r\n\r\ndue to The team having experience in product management and design, impact investing, fund management, financial markets software engineering, accounting etc. We are also organising a legal-tech community and the Catalyst Eastern Townhall, this shows clearly that this proposal has an impact on the cardano ecosysrem.\r\nThe key metrics goal and visions of the proposal has been outline properly on how to solve the challenge today and in the future thst is to design and prototype a mobile app that turns people into impact investors.\r\n\r\n\r\n", "q0r": 5, "q1": "Yes! \r\n1.because looking at thier past experience and the team layout show perfectly the prosal will be active if funded.\r\n2. Good and correct links are provided for more imfo. on their website. And the links are sufficiant.\r\n3. the teams level of competent is also accurate.\r\n", "q1r": 5, "q2": "every information provided above is sufficient to audit with correct links and good roadmaps to know all the run downs if the proposal is been funded.\r\nThere are also correct metrics and KPI's the deines the success of this proposal if funded.\r\n the solution to adress the the above challenge is also clear and the proposal has also tackled vivid problems in the above challenge that will surely be solved if this project is funded. And their  contingency plans in place for various outcomes to.", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 23, "ne": 3, "ng": 11, "nfo": 9, "vca_o": 1}, {"q0": "This apparent problem absolutely needs to be helped for boosting the Catalyst project. The successful image of this project that the team led will help the Cardano ecosystem develops faster. \r\nTheir key metrics that are defined as input activity associated with the user research will not just help CA to measure their future results but also clearly show that their way of developing this idea is aligned with what this challenge given. ", "q0r": 5, "q1": "The proposer includes many referral links and documents to help us assess its feasibility, and is completely clear and detailed. He also attach some affiliate proposals, go with their team background I believe that they have a strong ability to finish the scope in this proposal well. \r\nAlign with the plan, the budget is reasonable and explained well that who will use that budget and for which task they will cover. \r\n", "q1r": 5, "q2": "This roadmap is detailed and easy to help audit this project. And I believe that these key metrics that measure will help Catalyst community improve so much as it will. And the explanation about the apparent problems with how this project can solve is fulfilling to visualize how the successes impact Cardano ecosystem. \r\nThe only thing I recommend proposer should give more is the risk in their implementation plan. ", "q2r": 4, "assessor": "z_assessor_671", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "proposed to solve the problem of designing and prototyping a mobile app that turns people into influential investors. This proposal is likely to succeed based on the definition of success set forth in the plan.", "q0r": 4, "q1": "The team with experience running East Catalyst City Hall. as well as CA's experience and proposals funded in previous funds. Robert O'Brien is Co-Organizer of Catalyst Eastern Town Hall, a Catalyst Community initiative in Cardano that is considered a great start and provides credibility to the proposal. development roadmap, budget divided into separate categories, clear development plan", "q1r": 5, "q2": "The proposal has a clear roadmap, timelines for completing items, and KPIs to check progress. clear, specific and workable solutions to the given problem", "q2r": 5, "assessor": "z_assessor_706", "no_vca": 14, "ne": 2, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "利用行为数据进行用户研究，设计并制作一个移动应用程序的原型，将人们变成影响力投资者。", "experience": "销售点、会计和ERP系统的产品和用户体验设计。影响力投资和金融市场软件工程。"}