{"id": 384987, "author": "cargofe2", "title": "Study and Pilot in Colombia", "url": "https://cardano.ideascale.com/a/dtd/384987-48088", "category": 26235, "amount": 5000, "description": "Colombia en criptomonedas, está desarrollando un piloto de la autoridad financiera que influirá en el futuro de Cardano en este país", "funded": 1, "upvotes": 40137061, "downvotes": 19022659, "votes_result": 21114402, "votes_cast": 276, "f6_no_assessments": 4, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta de realizar un análisis exhaustivo de los resultados del sandbox regulatorio de 1 año promulgado por la autoridad de supervisión financiera de Colombia en relación a la implementación de criptodivisas es interesante, y altamente factible. Sin embargo, viendo que los objetivos del reto apuntan a la creación de un entorno de leyes más favorables o menos perjudiciales para el espacio de las criptomonedas, con un enfoque en PoS y en las particularidades de Cardano, creo que una futura iteración de esta propuesta debería centrarse en el aspecto de cabildeo y creación de redes del reto, más que detenerse en el análisis de los experimentos regulatorios, de los cuales meses después de iniciadas las pruebas, se puede entender que el resultado más significativo es que las instituciones financieras y las plataformas de criptomonedas pueden sostener alianzas y operar sin conflictos, a diferencia de lo que ha sucedido en Colombia en el pasado. También hay que señalar que, según la información disponible en español, la SFC sólo ha aprobado 4 criptodivisas para ser emparejadas con el peso colombiano durante este proyecto piloto/ sandbox regulatorio: bitcoin, ethereum, litecoin y bitcoin cash, lo que significa que ni Cardano ni una criptodivisa PoS participarán en el piloto, con la consiguiente ausencia de pruebas derivadas del mismo para las consecuencias regulatorias que necesariamente conllevarían las especificaciones PoS frente a PoW.", "q0r": 2, "q1": "El equipo es claramente muy competente y tiene la experiencia necesaria en el sector público en Colombia, con una empresa de consultoría ya en marcha para desarrollar el análisis descrito, y el presupuesto está claramente establecido y desglosado. Dicho esto, su enfoque principal parece ser el registro territorial/de tierras, sin experiencia verificable en el sector de las criptomonedas, ni en la comunidad de Cardano antes de Fund7; recomendaría encarecidamente incorporar esta información en una futura iteración del proyecto. Aunque el documento final propuesto es seguramente factible para el equipo, no hay KPIs claros que den cuenta del cabildeo o el trabajo en red; sugeriría como potenciales métricas el número de entrevistas a realizar, especificación de organismos gubernamentales a abordar (como los que conformarán el Comité Evaluador, como la Presidencia de la República, la SFC, la Superintendencia de Sociedades y la Unidad de Información y Análisis Financiero, entre otros), etc.", "q1r": 3, "q2": "La información proporcionada muestra que habrá un producto conciso al final del periodo estipulado de 3 meses, que mostrará el éxito de la propuesta. Sin embargo, como se ha dicho anteriormente, no hay KPIs claros para poder medir o auditar el progreso del análisis y del informe. En este caso, recomendaría que el análisis se desglosara en entregables que puedan utilizarse como indicación mensual del progreso realizado, ya sea como capítulos independientes (por ejemplo, en relación con la regulación anterior o las posturas de la SFC hacia la criptoeconomía, las alianzas que participan en el sandbox regulatorio y el historial de sus miembros con respecto a las cripto, etc.) o, como se ha indicado anteriormente, como número de entrevistas realizadas, con sus grabaciones/conclusiones como posible entregable para fines de auditoría.", "q2r": 2, "assessor": "z_assessor_787", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposing team has filed 2 proposals that are complementary. By performing analytic research on what the Colombian government is intending to impose as legislation, the informational chart from the other proposal can be updated to conformity. By doing this, the chances of successfully influencing legislative decisions rises significanlty. Such an analytical documenbt could hold great value for future ventures in the cryptographic sphere on Colombian territory. ", "q0r": 5, "q1": "The proposal authors have relevant experience in the fields of law and government in Colombia and have provided evidence of this experience. By intending on making their research open-source, they are in a position of potentially helping a lot of projects. This increases feasibility significantly as cooperations will be desirable. ", "q1r": 5, "q2": "The proposal has a complete set of auditables. There is a clear roadmap with funding breakdown, definition of succes after 3/6/12 months, risk analysis and concrete prospected release date in place along with measurable KPIs. Very good work. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 25, "ne": 4, "ng": 18, "nfo": 3, "vca_o": 1}, {"q0": "This is a proposal on researching and piloting the application of electronic money in real life to see how it is received by citizens in Colombia. The proponent has legal experience in Colombia. The project is needed at the present time, raising public awareness about blockchain technology and cryptocurrencies in the countries.", "q0r": 4, "q1": "Researching the community response as well as building a legal framework, a technology foundation for bringing cryptocurrency to life is absolutely necessary, and completely feasible at this stage of blockchain's development.", "q1r": 4, "q2": "After the process is completed, the results of the research will be made public, and recommendations for next steps to raise awareness and practical application of cryptocurrencies will be made. This is a necessary stepping stone, supporting the serious implementation of cryptocurrencies into life.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "Great idea. However, the proposal does not give a clear indication of the campaign that would enable favorable regulation. I would be glad if the team create a framework to serve as a reference point for favorable legislation in Columbia.", "q0r": 4, "q1": "This team has experience lawyers and individuals in the public sector to achieve their goals. After reading the proposal, I am not getting a detailed plan and focus outcome for the project. I think the team should make their strategy clearer. What kind of specific benefit is the proposal aiming to measure.", "q1r": 3, "q2": "There should be detailed activities for which the budget would be used. Also, the proposal should show how activities would be documented. This would be helpful for tracking and auditing.", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Estudiaremos el piloto en curso y obtendremos la información necesaria para determinar las posibles consecuencias.", "experience": "Quince años de experiencia en el sector público colombiano en entidades como el Departamento Nacional de Planeación."}