{"id": 381585, "author": "rodes", "title": "ADA 4 Science", "url": "https://cardano.ideascale.com/a/dtd/381585-48088", "category": 26248, "amount": 200000, "description": "Science corruption and fundings have forced our public policies & laws to a high level of biased and tailored policies. it needs to change.", "funded": 0, "upvotes": 15586089, "downvotes": 23639594, "votes_result": 8053505, "votes_cast": 96, "f6_no_assessments": 8, "f6_rating": 2.208333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Creating a place that would connect researchers that would want to cooperate on studies and papers/ publications in the field of blockchain would help with connecting researchers all over the world making it easier to replicate studies in the field, connect and give access to publications. However, in his solution he states that governments rely on science in their policies, but this would usually refer to either peer reviewed papers that are in highly regarded national or international journals, or internal government papers. So I doubt that his solution would fit his vision of how science can impact governmental decisions. It is also unclear if the page would reward scholars for their peer reviews and how the onboarding process would work and how this proposer would create a digital identity of the researchers on the platform to verify that they are fit to peer review other research.", "q0r": 4, "q1": "The proposer wants to set up a team after funding - which means, at the moment feasability is not assessible, since there is no team and the proposer themselves does not have the necessary skillset. I´m a researcher with more than 7 years of experience and I have gone through several rounds of having my own papers peer reviewed and published in academic journals and I am also an academic peer reviewer myself and I find it problematic to be so casual about the peer review process for actual science papers. Peer review processes in academic journals are generally blind, so the reviewers do not know the authors of the paper. I find that the chance of corruption and creating bias is higher on an anonymous networking platform where papers are connected to upvoting. I do not think that science requires \"upvoting\" and I think this is exactly what causes bias. There is also \"researchgate\", which is an open access research platform that is globally accessible and does kind of what this proposer is trying to set up. The question is, why would this solution be better than the existing one and the other question is, whether it is useful to create an extra space for researchers in the crypto field as this would detach their findings more from general research. I would also want to know, how the papers on this networking site would get published? How will he connect the page to academic journals - which is where researchers publish papers in order to be cited, listed on the academic search engines and so forth. So basically, by excluding the research of some fields onto a networking site, as a result this research will actually be less visible and connected as it is probably not going to be listed in the usual science databases. Generally, what I´m saying with all these words is - the proposer has forgotten to take most of the issues that go together with publishing research into account and should put more work into making clear, why an extra repository/ social media for researchers in this field would be necessary and how to avoid small group bias and how to make sure that quality standards for science don´t get affected.", "q1r": 3, "q2": "To create this platform, the proposer would have had to mention some of the risks involved when dealing with science. Just stating that they want to change something is not viable. Peer review processes for academic research should require a specific knowledge in this area and in the area of research designs, peer reviewers must be able to detect internal and external validity issues. Since there is no mentioning of any digital identity of the scientific community members, auditability of the project itself is difficult. Other issues concerning auditability are in regards to the budget allocation being just 30%/40%/30% on three categories without giving any specifications. This would be relevant since the proposer is asking for the whole amount of funding of this challenge. Without a team, auditability is also difficult since the relevant skillset can´t be assessed. Risks have not been addressed. ", "q2r": 2, "assessor": "z_assessor_19", "no_vca": 21, "ne": 12, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposal lacks an understanding of the problem (there's no such thing as \"objective of UNBIASED Sciences\", as any research in sociology of science has been discussing since a long time ago) and the solution is actually a statement and not a concrete solution. ", "q0r": 2, "q1": "The budget is unreasonable and has no information on how it will be distributed within the project. No experience from the team was given. \r\nTo improve the proposal, I suggest following the guidelines at: https://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit ", "q1r": 1, "q2": "Roadmap and deliverables are not clearly presented to the community. And as the proposal needs to be improved as a whole (specially in how the solution impacts the community or Catalyst), it is hard to be audited. ", "q2r": 1, "assessor": "z_assessor_386", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The proposal \"ADA4Sci is a platform where scientists can get together and develop a paper from the debate of ideas and perspectives\" is vague and leaves a lot of scope for interpretation. It is difficult to estimate the effectiveness when the aim/end state is vague. ", "q0r": 3, "q1": "The proposer claims to be a research scholar. The proposal does not seem to have any references to past contributions or publication to substantiate his experience. ", "q1r": 2, "q2": "The proposal's budget of 200K is not justified in the proposal. The proposer allots 40% of the budget that is $80K to \"start working on the platform after a brainstorm of ideas\". This to my mind is not justified. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 21, "ne": 1, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "The impact of this project, in terms of creating a space for international information sharing and vetting, is very promising. The solution statement didn't make sense as a solution statement, however, in the context of the project. Beyond the mention of marketing, it's unclear how this proposed site will attract eminent scholars.", "q0r": 4, "q1": "It is not clear to me that anonymous peer review on a social media style site would have less bias than the traditional peer review process. Additionally, social media incentives and ingroup biases could make these problems worse, and it's not clear to me that the proposer has considered these problems. The proposer has a set of credentials but no direct links to their work, nor do they have a team yet, which would be invaluable in assessing feasibility.", "q1r": 3, "q2": "There is not a communication channel or existing team, nor any links to prior work done so far. This makes the proposal difficult to audit now and going forward. The budget in the roadmap does not have clearly itemized or auditable actionable steps. The proposer is asking for the full sum of this challenge fund, which if approved, would mean no other miscellaneous challenges could be accepted. ", "q2r": 3, "assessor": "z_assessor_501", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "\"I have read this proposal carefully, but I still don't understand if the platform the team wants to build is a website or a dapp or a community. If it's a dapp, I think the dapp challenge will be more suitable for this proposal.\r\n\r\nIn addition, the proposer mentions the impact of this proposal as \"\"Most of the impact from this project will be from marketing associated with a successful project hatched by the ADA community. however, it will also be involved by the science generated which is related to blockchain policies, research, and investigations developed within the ADA4Sci platform\"\". This impact is very general and doesn't specify what the problem the proposal really wants to solve.\"", "q0r": 1, "q1": "There is no way to determine the proposer's experience as there is no additional information given. All are just ideas, even the proposer needs to spend 3 months brainstorming ideas and planning for the proposal. This means that currently this proposal is just an idea without a specific plan", "q1r": 1, "q2": "There is limited information about what this plan is concretely going to deliver and therefore would make it almost impossible to know what success measures or any other metrics could be use to track and follow the progress of this proposal.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 22, "ne": 1, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "The problem statement convinces me very much [as a public policy researcher], however, this is not explained in detail. I think this is a great and interesting idea, after all. The solution is clearly showing what the proposer intends to do for solving the problem.\r\nTherefore, based on the given information, I agree with this proposal's impact, I can rate it with a score of 4", "q0r": 4, "q1": "Proposer profile [with professional experiences as Engineer, MA, MSc, and Ph.D. (Cand.)], as well as his networks, are described as a great benefit for this proposal, however, there is no proof/links for verification. The roadmap is clear, however, the budget breakdown and risk are not provided.\r\nTherefore, based on the given information, I disagree with this proposal's feasibility, I can rate it with a score of 2", "q1r": 2, "q2": "As mentioned, this problem and solution's idea is quite convincing to me. However, the plan did not provide me enough information, especially the following: (1) Profile with reference/proof (documents/links,...) for verifying; (2) Budget structure; (3) KPIs/ Metrics. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "The project is just an idea with no clear view on how to perform it. The investigator doesn't know how to create an \"unbiased science\" and expects to come up with the answer after brainstorming for three months. The science community already has a peer review system to produce reliable knowledge. While the system is not perfect I don't see in this proposal the added value, beside saying it will create 'true unbiased science'", "q0r": 2, "q1": "Science is a vague topic. to goes from engineering sciences to natural and social science. this proposal is just vague with ne clear KPi's or metrics. there is no team in place besides the Principal investigator that  only have expertise in engineering. it is very unlikely this proposal will be successful, due to lack of expertise and knowledge about the challenges ahead and solutions to overcomes these challenges. For instance, how will you compete against the peer review system that already exits and researchers needs in order to obtain funding and recognized among their peers. How will you deal with intelectual property?", "q1r": 1, "q2": "The proposal is just an empty proposition. the funding asked is very big but no clear budget or roadmap or KPI's metrics is in place to provide sufficient information for an audit.", "q2r": 1, "assessor": "z_assessor_761", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "Since the challenge opens the way for proposals with different ideas from the other challenges, this proposal fits right for this challenge. ", "q0r": 5, "q1": "I as I read through the proposal, even if the author tried to explain the plan it lacks a detailed explanation.  Having a detailed implementation plan helps proposers identify more about what they want to propose and keeps expectations realistic and in this case, I felt the thought and time spent on this proposal don't show successful implementation potential.", "q1r": 2, "q2": "Having a proposed idea with such a vast timeline has to be well equipped with all the information needed to anticipate the progress of the proposal. But this fails to demonstrate further insights for readers to audit the progress in the futre.", "q2r": 2, "assessor": "z_assessor_762", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Science is becoming the most important source of evidence for Governments and expert advisors when developing Public Policies.", "experience": "My personal and professional experiences as well as my networks are of great benefit for this project:\nEngineer, MA, MSc and Ph.D. (Cand.)"}