{"id": 382363, "author": "arturictus", "title": "NFTree protocol", "url": "https://cardano.ideascale.com/a/dtd/382363-48088", "category": 26248, "amount": 70000, "description": "Climate breakdown is increasing the severity of weather conditions as floods, storms, unprecedented heatwaves, deadly air pollution.", "funded": 0, "upvotes": 14558267, "downvotes": 24750076, "votes_result": 10191809, "votes_cast": 97, "f6_no_assessments": 7, "f6_rating": 1.4761904761904763, "videos": [], "media": [], "f6_assessments": [{"q0": "No words about what the projects specifically does and how it's going to be implemented.", "q0r": 1, "q1": "Not sure as nothing specific was provided. The GitHub link only has one text document and no code we can understand the skills from.", "q1r": 2, "q2": "No roadmap, metrics or goals provided. I've seen it on their github repository, but it also has to be a part of the proposal.", "q2r": 2, "assessor": "z_assessor_446", "no_vca": 24, "ne": 0, "ng": 14, "nfo": 10, "vca_o": 1}, {"q0": "reforestation projects to get financed via NFTs and connecting then for CO2 credit is a viable and a noble initiative. However the proposal in consideration has not provided any more details that the idea to evaluate. ", "q0r": 2, "q1": "The proposers Github repo are impressive from the Developer profile point of view however to implement the idea in the proposal, therewill be a requirement for more detailed roadmap and plan. ", "q1r": 2, "q2": "The proposal is for $70000 however no details regarding how the estimate is arrived at have been included in the proposal. There is a need to have a rough breakdown of the budget to evaluate the wether the project can be successfully audited.", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 21, "ne": 1, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "\"Creating a Marketplace for reforestation projects to get financed via NFTs is a great idea to help reduce environmental pollution and reduce CO2 in the atmosphere.\r\nThis will encourage people to invest in reforestation projects more easily. Combining earning an investment and building a good environment is something that has a huge impact on the earth and society.\r\nBut I still haven't seen a proposal that gives a specific solution and how to implement this idea\"", "q0r": 2, "q1": "\"The team's relevant experience is a great fit for a proposal like this. But I don't understand why they don't include relevant links to confirm their identity and experience in this proposal. I tried accessing the proposal's github, and there is most of the information about the members and roadmap of the proposal in it. I have a recommendation that they should include that information in their proposal, not leave it all in github because maybe some CAs won't access your github and will underestimate this proposal.\r\n\r\nBut there is no milestones or a financial plan provided in this proposal\"", "q1r": 3, "q2": "\"-This proposal did not present any success metrics needed to define the auditability of this proposal.\r\n\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 18, "ne": 0, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "The idea sounds great but this proposal is just a draft without any information. \r\nIf the team still wants to propose this idea in the next fund, I recommend that they should have a well-prepared plan. \r\nAnd for being assessed high impact they should make a paragraph to tell how their idea adds value to the Cardano ecosystem. And they should consider more about the challenge to make their own suitable key metrics to the challenge. ", "q0r": 1, "q1": "For getting a high assessment about the feasibility of this idea. My recommendation is that the plan should include info about features, user store, vision, goals... and to show that your team can make it come true, must include: marketing activities, coding activities with timeline, event organization... one of the important things I really consider on this idea is that how can we connect the real tree with your marketplace and value it. \r\nAfter all, make a detailed roadmap that can help everyone understand what your team wants to do and will get in each period. Then breakdown the budget that must be fitted with the plan and the roadmap. Your idea will be funded is everything reasonable. \r\nLast but not least, remember add some potential risk and could be your plan to get rid of them. ", "q1r": 1, "q2": "The team lacks of: roadmap and key metrics. For helping Catalyst community audit the proposal, the team should give a detailed roadmap with a timeline that is realistic. \r\nOne more thing that the team doesn't have here is a detailed explanation about the problem, and their solution is just a brief in the overview, that all make sense how they will solve the problem or how hard they study about the problem to make a best solution. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 20, "ne": 5, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal has a problem that within the challenge but has nothing in detail. It doesn't have info about how it will impact on Cardano ecosystem. \r\nIt also doesn't have any key metrics or plans to measure whether what this idea brings is meet the challenge or not. ", "q0r": 2, "q1": "This proposal lack all basic info for assessing the feasibility. The short brief is not enough for assessing. It should inclcude: \r\n- Detailed implementation plan for knowing what will be done with their solution to address the problem. Not just about the features, but also includes use cases, technology explanation, marketing, activities... the more detail is great\r\n- Detailed roadmap and budget to assess that are they reasonable with plan or not \r\n- Team info to clarify the ability to execute the plan \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. \r\n", "q1r": 1, "q2": "Cannot scoring the auditability of this proposal because it lacks everything for that. For auditing the progress and success of the proposal, it must have: \r\n- A roadmap with milestones and a time horizon for achievement. And metrics/KPIs that define the success of the proposal. Those 2 will help Catalyst track and audit in periods. \r\n- Clear understandable description of the targeted problem. And the clear understandable solution that addresses the problem. These 2 will help to know what is this proposal expects up front. \r\nThis proposal have none of them. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 18, "ne": 2, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "There is nothing in this proposal. The problem look within this challenge and the solution fits with it. \r\nBut, the proposer only shows that. He doesn't provide any key metric or info to prove that this solution will help the Cardano ecosystem. This proposal failed to impact. ", "q0r": 2, "q1": "My advice for this team is to have a good proposal and enough materials for assessing the feasibility they must give info about a detailed plan they will do, roadmap that with a clear timeline of activities will get, then clarify team member info for more trust, the budget that is reasonable with the plan and roadmap, risk-relevant that team will face off. \r\nTechnically, this idea of the project will have a lot of technical stuff but they don't describe any of them, including smart contract, protocol, marketplace... even more in the user point of view including UX/UI, user cases... ", "q1r": 1, "q2": "The proposer provide nothing in this proposal to audit it. \r\nNo plan, no roadmap, no key metrics in this proposal.\r\nThere is also no info about the problem explanation and no info to say how the solution can help to solve the problem.", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 19, "ne": 2, "ng": 8, "nfo": 9, "vca_o": 1}, {"q0": "There's little to work with here. Maybe flesh out the proposal next time to give us an idea on how you choose to approach this. ", "q0r": 2, "q1": "No idea on how this will happen unfortunately. We need more information ", "q1r": 1, "q2": "There's very little to work with to guarantee that the project will be executed let alone auditable. ", "q2r": 1, "assessor": "z_assessor_700", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Marketplace for reforestation projects to get financed via NFTs, those NFTs will be connected to CO2 marketplaces to reward investors.", "experience": "Jeremy Agnew: Product Manager\nArtur Pañach: Smart Contracts, Full-Stack developer\nMarc Blanes: Design, UI/UX\nRicardo Carretero: gamifica"}