{"id": 383705, "author": "despas.damien", "title": "ADAGLASS Data Intelligence Platform", "url": "https://cardano.ideascale.com/a/dtd/383705-48088", "category": 26248, "amount": 28525, "description": "There isn't a platform for Cardano's stakeholders to monitor and visualise the performance, growth and opportunities of the ecosystem", "funded": 1, "upvotes": 27701499, "downvotes": 18772501, "votes_result": 8928998, "votes_cast": 93, "f6_no_assessments": 3, "f6_rating": 3.777777777777778, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=10531"], "media": [], "f6_assessments": [{"q0": "As a Data Analyst myself, I understand the importance of quality data in order to make informed decisions. The lack of a platform to monitor and visualise the performance, growth and opportunities of the Cardano ecosystem limits users, SPOs and Delegators ability to get optimal results from their actions. The proposal addresses this issue with a customized and robust platform that could not only be beneficial for the whole community in general but also help solve problems in [Improve and Grow Auditability] and [New SPO Business Opportunities] challenges, by providing meaningful data to Auditability and actionable insights to attract new SPOs. The profit potential through subscription plans adds even more value to the community and economic sustainability for the project. It is also possible to scale up the platform to encompass a exponential growth in the user base and the ecosystem through infraestructure investments.", "q0r": 5, "q1": "The team clearly has enough background knowledge to succesfully implement the proposal with their 20+ combined experience in providing end-to-end IT and digital services. Their skill set should allow them to conduct it with security and agility. Although they specified the type of team members required, they did not specify the number needed and how they will find those members. The budget seems reasonable and is broken down into identifiable items, but it is not clear which will be the provider for each one. Additional funding will be acquired through crowdfunding and initial investment from the proposer, which shows their willingness and confidence in implementing the proposal. The implementation plan states every task, but not detailing how each will be done. The timeline seems realistic and projects full implementation within a year. A more detailed description regarding the cited aspects should improve the proposal's feasibility.", "q1r": 3, "q2": "There are several tasks within each quarter that could have individual deadlines for better tracking of the progress. The milestones given for 3, 6 and 12 months show measurable indicators, except for \"well-known brand in the community\" which is vague and it does not specify size and quality for the core team. Nevertheless, the steps listed should allow progress tracking satisfactorily.", "q2r": 4, "assessor": "z_assessor_951", "no_vca": 23, "ne": 12, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "The end-to-end data and intelligence platform with community-provided data can bring out the health of the ecosystem and identify opportunities for new entrepreneurs. Business intelligence is crucial for value commitment and to generate analytical frameworks to handle projects. Considering these points if feel the proposal is addressing a challenge. ", "q0r": 4, "q1": "The proposer team has a strong foundation in the technical domain with the required education. The sustenance of the initiate by stake pool is not very clear. In the present-day competition in the SPO community, there is a need to estimate the staking requirement for any meaningful profit to finance a data aggregation company. More clarity of the subscription model for revenue generation also was required. ", "q1r": 4, "q2": "The fund requested is reasonable for the activity as mentioned in the proposal. However, for sustenance and growth, a viable business model will be a critical requirement. The proposal would have been more auditable or verifiable if it includes tokanamics and more info on the stake pool operation.  ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 17, "ne": 0, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "As there does not seem to be another challenge within this proposal fits the proposal is correctly placed here. The proposal accurately  identifies a problem and provides a solution of a data Intelligence platform. It clearly highlights the benefit it will bring to the ecosystem if correctly implemented.   ", "q0r": 5, "q1": "The team appears to have the requisite experience with external links provided. The funds requested are in line with the time frame and scope of initial work as the proposal states it will be also generating funds through a token launch. It would be great to see possible challenges and risks to the project with specific regards to security defined in future proposals.", "q1r": 4, "q2": "The project has defined a very ambitious roadmap and metrics with which to measure success. However it would be great to see KPIs directly related to the requested funds and not the project as a whole as without this it is difficult to determine the audibility of the proposal", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Introducing a Data Intelligence platform that observes, orients and shares data for e2e visibility, unbiased and actionable insights", "experience": "20+ year team experience providing E2E IT and digital services across CX, Cloud, Cyber, Data for public and private sector organizations"}