{"id": 384543, "author": "jeffghome2020", "title": "University/College Outreach", "url": "https://cardano.ideascale.com/a/dtd/384543-48088", "category": 26248, "amount": 4900, "description": "We need to reach out to university and college students and graduates to raise awareness of Cardano and the opportunities that exist.", "funded": 2, "upvotes": 79823487, "downvotes": 5580265, "votes_result": 74243222, "votes_cast": 134, "f6_no_assessments": 3, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"q0": "With the amount of misinformation around Cardano, there is a need for outreach programs to improve the visibility of Cardano. With this aim, I feel that the proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The social media handle has around 500 followers and has been tweeting with ADA focus. I will not agree with price action tweets to promote ADA as found in the handle. However, the proposer has the capability to reach the masses. With an aim to address a high concentration student population it is likely to be beneficial for the ecosystem overall. ", "q1r": 4, "q2": "The proposal is for social media engagement to market students to \"educating them with daily zooms and assisting in proposal development \" this is a subjective aim and may or may not be measurable. However, the amount requested is reasonable and may bring in a disproportionate ROI.", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "\"I really like this approach of the proposal. The idea of this proposal is a very sustainable idea because it creates benefits for all parties: People with good ideas will be supported to create good proposals, Catalyst will have more quality proposals and better proposals. People who help connect people with ideas to Catalyst also receive some money for helping fund the idea.\r\n\r\nWith this approach, the proposal can completely develop strongly in the future without having to rely on Catalyst's money but still bring benefits to Catalyst.\"", "q0r": 5, "q1": "\"The team behind this proposal have all the experience to be able to make this proposal like: Founder of Cardano Outreach, fund4/6 winner, they have reached 3320 students on twitch and zoom.\r\n\r\nIn addition, they have more than 3,000 following people on twitter that can help them get enough attention of everyone to achieve their target for this proposal\"", "q1r": 5, "q2": "\"Proposer has shown us a concrete plan with clear KPIs in this proposal. Proposer also outlines how they use the funds they have invested in their work.\r\n\r\nBesides, tracking the progress and results of the proposal is also quite simple, just track the number of people reached, the number of participants, and the number of ideas submitted and all these parameters can be check easily\"", "q2r": 5, "assessor": "z_assessor_645", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "This proposal is about educational outreach to students/graduates about Cardano blockchain and its opportunities. This fits well into the Community Events Challenge, though they stated in the proposal that they did not win funding in Fund5, the reason they did not put in under a specific challenge. ", "q0r": 3, "q1": "The proposers are Fund4 and Fund6 winners for the outreach programs they have been doing. They have experience in idea proposals, project leading and outreach and so they can implement the proposal effectively. The plan mentions the events they will be having on twitter, zoom and telegram in detail. The proposal can be implemented effectively.", "q1r": 4, "q2": "The timeline is not clearly showing but the budget breakdown is clear to make auditing a bit easier. ", "q2r": 3, "assessor": "z_assessor_688", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "We intend to incubate interest in the blockchain by educating them with daily zooms and assisting in proposal development with the targets.", "experience": "Founder of Cardano Outreach, fund4/6 winner, we have reached 3320 students on twitch and zoom! A former manager and unversity grad."}