{"id": 385048, "author": "amolagg", "title": "AI in geological analysis", "url": "https://cardano.ideascale.com/a/dtd/385048-48088", "category": 26248, "amount": 8000, "description": "Current Geological Analysis techniques are invasive in nature and very expension.", "funded": 0, "upvotes": 16938466, "downvotes": 22524386, "votes_result": 5585920, "votes_cast": 95, "f6_no_assessments": 5, "f6_rating": 1.2, "videos": [], "media": [], "f6_assessments": [{"q0": "This problem is indeed hard to put into any other challenge than the miscellaneous one, due to its specified nature (pun intended). The core idea aims to use deep learning algorithms to expand the ways to do non-invasive geographical analysis. It would benefit the proposal highly to include some information on how this would be relevant to the Cardano Ecosystem directly, and how the proposal aims to integrate into/use Cardano. The proposal is very briefly explained and would need more information about the actual product and process in order to be understood and assessed. These two key points mentioned would increase the understandability of the project and strengthen the problem statement. In my experience as a Community Advisor for several funds, having a clear connection to Cardano along with a clear problem statement followed up with an understandable and detailed solution is key while drafting proposals. At the moment due to the lack of information, it is hard to comprehend the scope of the project (timeframes, milestones, costs etc. But), but we'll get to that later. Based on these aspects mentioned above, I strongly disagree that this proposal effectively addresses the challenge.", "q0r": 1, "q1": "The proposal could use a lot more information of the process of development, along with a description on how the geological analysis techniques will be developed and used, and what their impact is in contrast to currently used ones. I am by no means a geologist but I do have a fair bit of experience working as a researcher, and I would suggest adding more detail in the proposal in order to make it more understandable and tangible. Both for people with domain expertise in geology, but also for those without. \u2028It would also be beneficial with a presentation of the core team/proposers who will be working on the project. How many years experience with geology does the team have, does it consist of several members, is the prototype for geological analysis (mentioned under 'relevant experience') used today? Where can we learn more about it? Is the product aimed to be used with academics? More importantly after answering all of these questions, I would suggest providing a verifiable source that can further strengthen the competency and experience of the team members. Maybe through LinkedIn-profiles, partnered universities, etc. Lastly, I would have liked to see a more detailed budget plan included. How much money will be used for development, materials etc. And how many working hours are estimated from start to finish (maybe per week)? All in all, due to the lack of necessary information, I strongly disagree that it is likely that this proposal will be implemented successfully.", "q1r": 1, "q2": "As mentioned before, this proposal would benefit highly from having a roadmap included with milestones on an estimated timeframe. This way it could be audited in a transparent way, and the community would be able to follow the progress during development (preferably through media channels or website of the project). Some suggestions of key questions to answer: How many months/years will it take to develop the initial prototype? How will it be tested and by whom? How long will the testing phase be and how will success be measured (KPIs)? \u2028Also, what happens if something unexpected goes wrong during development? How does the team aim to combat potential challenges during the process? Having a short text on reflections on these questions from the team included in the proposal will strengthen the credibility and perspective of the team, and if those reflections are shared with the community it will strengthen the overall trust and transparency of the whole project. Because of the reasons just described, I strongly disagree that this proposal provides me with sufficient information in its ability to assess the progress in attaining its stated goals. ", "q2r": 1, "assessor": "z_assessor_349", "no_vca": 21, "ne": 14, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "The proposal is to sponsor research for a noninvasive Geological survey using AI. The proposal will contribute to Geology however its benefit for Cardano looks remote and may not address the challenge except to create goodwill in the Scientist community. ", "q0r": 2, "q1": "The proposer has one year of experience as a Deep Learning Engineer and had been an Interned at Google. This may not be sufficient for the proposed Research. High-end reserch will require academic guidance from a Univercity. ", "q1r": 1, "q2": "The proposal is to fund Research project for an AI-based Geological survey. There is no major plan presented and who will validate the research. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 21, "ne": 0, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been voting since Fund 4 and have experience analyzing business requirements from 7 years of delivering software as a QA engineer.\r\nThough the problem statement is clear, it does not seem to me like it pertains to Cardano. The solution, while it does address the problem statement, is too vague in my opinion and again it is unclear what the role of Cardano, or blockchain for that matter, would play here. A good proposal should always outline this, in order for non-technical voters to understand why it would be valuable to fund it. Due to this and the lack of any type of KPI or concrete goal, I have to strongly disagree that this proposal effectively addresses the challenge.", "q0r": 1, "q1": "The proposer claims to have 1 year of experience as a Deep Learning Enginner and to have interned at Google, but no references are provided to prove this. Please keep in mind that it is pretty much expected of all proposals now to provide at least a Linkedin profile, or something similar, where the community can see your relevant experience and background.\r\nI strongly disagree that this proposal can be implemented successfully, due to the lack of information on the team who would work on this, no details on how the budget would be used, no risk analysis and no plan outlining the technical approach and the usage of resources concretely. Please keep in mind that these are all vital parts of a proposal.", "q1r": 1, "q2": "Unfortunately, no roadmap is provided, there are no KPI's and it is basically unclear what this proposal aims to do to better the Cardano ecosystem, so I strongly disagree that this proposal is auditable.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 22, "ne": 4, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is about building a Non-Invasive Geological analysis system, highly efficient and accurate through Deep Learning Algorithms. It seems that this proposal is incomplete. The problem statement [current Geological Analysis techniques are invasive in nature and very expansion] is clear but not explained in detail. Conceptually, I think the proposed solution has a certain fit for the challenge. The solution is oriented towards building such a platform having satisfactory and has potential impact if completed. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1.", "q0r": 1, "q1": "It's not easy to evaluate a proposal that is incomplete [limited information of experience, doesn't have any roadmap or KPIs, and of course the risk is not defined]. Therefore, definitely, there are no grounds to agree on the feasibility of this proposal, however, if I had to give one piece of advice, I think: in case it is necessary to complete this proposal in the next Catalysts in the future, the proposer should pay attention to ensure that the following components are fully met: (i) Goals & target; (2) road map/timeline (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge. Based on the given information, I strongly disagree with this proposal's feasible, and would give it a score of 1.", "q1r": 1, "q2": "For an incomplete proposal like this one, transparency can't be guaranteed. Therefore, I don't have much advice. Based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 17, "ne": 4, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "Thank you for your interest in natural matters. besides i would like to know the real problem you bring up is that we are going to have explicit concrete method in Geology. Do you want a method to protect nature or a clear method to exploit more effectively? When the problem is clear I think we can understand the effective method that AI will bring", "q0r": 2, "q1": "In terms of feasibility, I hope you can elaborate more on your personal profile as well as your team such as whether there is someone responsible for the financial or blockchain aspect. Also I hope you can show us the short and long term project roadmap. And the criteria you need to achieve in the future, I think it is necessary for your project. The nature of this project requires state permission as well as a high level of expertise in geology. Currently, many countries can already use AI for jobs ranging from geological measurement and analysis to real estate. This project will be more feasible if you have specific plans and clear roadmap. From there we can build from high community demand.", "q1r": 2, "q2": "In the roadmap I hope you can describe what value you want here, \r\nvì số tiền bạn chi cho AI là rất tốn kém. you require an investment of up to 8000$ which is quite a large amount.You should explain how you will use this money? For how long and how can people see you using it?", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Through Deep Learning Algorithms we can build Non-Invasive Geological analysis system, highly efficient and accurate.", "experience": "Got funded for developing prototype of a Geological System.\nDeep Learning Engineer- 1 year\nInterned at Google."}