{"id": 380930, "author": "torben", "title": "Trustful Global Projects", "url": "https://cardano.ideascale.com/a/dtd/380930-48088", "category": 26240, "amount": 80100, "description": "Застройщики и клиенты хотят успешно работать вместе, но заключение соглашений или осуществление платежей на международном уровне сопряжено с определенными трудностями.", "funded": 1, "upvotes": 26222273, "downvotes": 19472003, "votes_result": 6750270, "votes_cast": 157, "f6_no_assessments": 7, "f6_rating": 3.6666666666666674, "videos": [], "media": [], "f6_assessments": [{"q0": "Я хотел бы поздравить автора с этим предложением, помимо того, что оно очень хорошо соответствует цели задачи, оно очень хорошо написано, информация подана так, как и должна быть: прямо, кратко и ясно. Предложение идеально подходит для задачи, поскольку оно направлено на создание платформы, которая будет регистрировать ряд информации о выполнении проекта в блокчейне Cardano, как цитирует автор: \"спецификация программного обеспечения, объем проекта, расписание проекта\" и т.д. Это очень хорошо отвечает тому, что мы ищем в задаче, что, безусловно, повысит надежность транзакций для тех, кто не может нанять внешнего посредника для работы над своими проектами, и автор очень хорошо аргументирует важность создания такого продукта. Часто те, кто хочет запустить проект, не делают этого из-за отсутствия уверенности в том, что представлено, в то время как разработчики также могут чувствовать себя неуверенно в отношении обещанной оплаты. Эти и многие другие детали действительно препятствуют успеху некоторых проектов, поэтому устранение этих пробелов не только повысит ценность нашего блокчейна, но и увеличит количество проектов с участием различных экземпляров вселенной Cardano. Автор ясно дает понять, какие цели он преследует при разработке этой платформы с помощью тем, чтобы синтезировать и усилить то, что объясняется в первой части предложения, и идеально согласовать с тем, что предлагается в задаче. В дополнение ко всему этому, в конце процессов все равно будет генерироваться NFT, что добавит еще больше ценности предложению.", "q0r": 5, "q1": "Безусловно, этот проект находится в надежных руках, не в последнюю очередь потому, что он был прекрасно представлен и описан здесь. Нам известны области компетенции главного автора, а также другие компоненты, составляющие команду, однако было бы полезно более подробно рассказать о каждом из них, ведь то, что у нас есть, это только и их имена и функции. Всегда интересно узнать, каков их предыдущий опыт, примеры проектов, которые они уже выполнили, как долго они работают в этой области и т.д. Об этом можно было бы рассказать в коротком тексте для каждого члена команды или даже приложить их профили в linkedin. Что касается того, что будет сделано, в течение какого времени и в какой последовательности, нам дается разбивка по месяцам и основные задачи, которые будут выполняться в эти периоды времени, но поскольку это очень обширный и сложный проект, было бы важно, чтобы эти шаги были более подробными. Например, я думаю о том, каким будет маркетинг этого проекта, это очень хороший продукт и полон потенциала, но как он попадет в поле зрения разработчиков? И как будут представлены преимущества его использования? Часть раскрытия информации не была объяснена здесь, я пропустил это, в дополнение к детализации упомянутых задач. Таким же образом, было бы положительно, если бы было более подробно описано, как будут использоваться деньги финансирования, у нас есть разбивка денег на определенные цели, но автор мог бы больше разъяснить, как каждая из них будет происходить. Я снова приведу в пример маркетинговую часть: как будут использованы $4300? Зарплата человека, который собирался с ней работать, плюс платная реклама на каком-либо канале, если да, то на каком?", "q1r": 3, "q2": "Для меня это была та часть предложения, которая больше всего заслуживает внимания. Проект очень большой и сложный, поэтому требует постоянного и тщательного мониторинга. Происходит много действий и в течение длительного периода времени, и мы уже знаем, в приблизительном смысле, какие намерения у каждого дела, которое должно произойти по мере того, как проходит каждый месяц. Поэтому, например, можно решить проводить периодические встречи с некоторыми членами сообщества, которые технически способны следить за ходом проекта, чтобы убедиться, что все делается так, как обещано, и в намеченные сроки. А если нет, выявить недостатки и коллективно разработать способы их устранения. Кроме того, команде было бы полезно представлять результаты постепенно, то есть, если бы на протяжении месяцев показывались данные и объяснялся точный текущий статус проекта. Положительно, что автор определяет намерения пользователей, от 9 до 12 месяцев 200 зафиксированных разработчиков, использующих инструмент, и 1000, когда проект уже идет полным ходом, это способ измерения успеха. Другим способом, как мне показалось, было бы понять, сколько ассоциаций с ID Atala Prism будет сделано благодаря этому проекту, таким образом, можно было бы проследить с другой точки зрения, насколько успешно внедряется инструмент.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Excellent proposal regarding a much-needed application.  Blockchain technology holds much promise but proper interfacing with existing legal and contractual frameworks is an important infrastructural need.  The proposes describe a system that would allow developers and entrepreneurs to find matches and complete contracts in a seamless manner.  Successful execution would strengthen the Cardano ecosystem development environment.", "q0r": 5, "q1": "This is a challenging proposal with many difficult components.  The proposers have clearly described how they will approach the development of the project but even if well executed there may be challenges which are difficult to overcome in the first year.  Nevertheless, this is a worthwhile endeavor to support.", "q1r": 4, "q2": "The team has articulated specific goals for 6, 9, 12 months and beyond.  The team and budget are well described so there is a clear expectation of who will be working on the project and what their responsibilities are for succcess.", "q2r": 5, "assessor": "z_assessor_145", "no_vca": 25, "ne": 3, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": " The idea is not specific for Cardano and can be generalized for any decentralized activity. the software proposed to be built will enable developers and proposers to work in a trust-less environment. The dispute resolution mechanism needs more clarity. If there is a dispute regarding the completion of work. How will the system handles the issue will determine the success of the system. However, the proposal is addressing an important challenge in this ecosystem. ", "q0r": 4, "q1": "The team claims more than ten years of software and blockchain development experience. The idea has been clearly articulated and feasible. There will be a  requirement for a set of smart contracts for performing the role of intermediaries. The requirement of oracles authenticating status update and compliance to specification to work do need clarification. However, the team seems to have enough capability in overcoming the problem. References to past work would have added immense help for evaluating the proposal. decentralized environment. ", "q1r": 5, "q2": "The proposal includes detailed timelines and budget breakup. The work to be done is clear and can be measured in a quantitative manner. The end state is also clear. The project can be audited and successes can be easily measured.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "This is one of the necessary ideas to help develop the Cardano ecosystem. It will protect the benefit of both developers and product owners to the successful product that both want to get. This idea will not just be for Cardano ecosystem only but also worldwide because of its crises that happens every day on traditional platforms. Hence, this idea will drive a lot of user to join and bring a big effect on Cardano ecosystem. Their goals also can promise about that impact. ", "q0r": 5, "q1": "The team has a very detailed roadmap that divides into 2 phases of implementing their plan, and all the detailed broken-down budget is reasonable for that plan. We can visualize their roadmap through \"Goals\" session in the proposal, and all are clear with the activities and numbers. \r\nHence, the budget they require is fitted with that timeline and be detailed in the field of activities. \r\nThe only thing I advise them is that they should give more info about the team members and some risks that they are aware to control. It will help Catalyst make a high assessment of their plan. ", "q1r": 4, "q2": "The team has enough roadmap detail and key metrics that help to audit this project easily. \r\nThey also have a well aware about the problem context and make a better solution by time to help improve Catalyst development. And that is very easy to understand what they gonna do. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposal to help create an environment that connects dapp developers with their customers is an encouraging idea. This helps to accelerate the application of dapps by customers, reduce the cost of advertising projects to customers, and this communication skill is not good for every project or has a professional team. .", "q0r": 4, "q1": "A good idea needs a detailed plan and strategy to make it work, which is what complements your proposal. Having a more detailed plan, a strategy to attract the free community as well as organizations in need should be done properly from the beginning. In addition, you need to have clearer KPIs for each stage that show the feasibility and persuasiveness of the project.", "q1r": 3, "q2": "I see a good profile of the team member, however it is recommended to add the member's public information through the profile: Github, Linkedin or related certificates. In addition, you should officially announce the youtube channel or website so that the community can comment, as well as check the project progress.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "This is a good idea that could add value and positive impact to the Cardano ecosystem if it comes to life. It's good to have a platform that will connect customers and developers. The plan is described in detail and could have a global impact because that was the idea from the beginning, connecting clients and developers around the world. Again it can operate at the local level ass well, there is no concept.", "q0r": 3, "q1": "The plan is well made, described, but it is not clear when the whole idea will start with realization and when it will be finished in terms of Q1 2022 or Q2 2022 and so on. The plan is divided by months but in my opinion does not give 100% certainty that it will be executed. Although it was suggested in the comments to provide information about the team for some reason that did not happen which further raises my suspicions. It is not clear that the team really exists because they didn't provide any links of LinkedIn or Github page.", "q1r": 1, "q2": "Due to the poorly set roadmap with dates, my opinion it is very difficult to follow the progress of this idea. The amount of money required given that we have no real insight into the team behind this idea i think is exaggerated. If we consider that the budget for this Catayst F7 is $250,000. The suggestion in the comments was that the funds should be brake up and that funds should be reqested in the upcoming Catalysts, but for some reason the suggestion was not taken in consediration. KPIs are missing in this proposal!", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 17, "ne": 4, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The proposal has great idea about connecting the customers and developers. It helps developers having job and customer find what they need and save time. I would like to see more attractive ideas to attract more users in the first stage of the project. ", "q0r": 3, "q1": "In my opinion, the proposal mentions about ways to increase users, but not give a detailed marketing plan to attract freelance developers in the first stage. Therefore, some clear system or procedures should be considered to make this proposal effective and raise prestige. ", "q1r": 3, "q2": "The proposal gives a clear roadmap and goals. However, it should list out the number of developers and customers participating in the platform which makes it easier for auditing. Also, the proposal should give a more detailed background of the core team by putting Linkedin, Github or any related sources for gaining trust. ", "q2r": 3, "assessor": "z_assessor_678", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Предоставьте платформу для автоматизированного, защищенного от несанкционированного доступа и верифицированного исполнения контрактов (платежи, этапы, юридические вопросы). Укрепление доверия между сторонами", "experience": "10+ лет разработки программного обеспечения, 5+ лет предприниматель, пионер Plutus и Atala, разработчик блокчейна"}