{"id": 381358, "author": "jaggerbellagarda", "title": "Verifiable NFT-based resumes/CV", "url": "https://cardano.ideascale.com/a/dtd/381358-48088", "category": 26240, "amount": 25000, "description": "Текущая проверка опыта работы и документов, связанных с работой, может быть дорогостоящим и длительным процессом.", "funded": 1, "upvotes": 39254036, "downvotes": 6328784, "votes_result": 32925252, "votes_cast": 174, "f6_no_assessments": 6, "f6_rating": 3.9444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "Идея предложения довольно уникальна и, как мне кажется, похожа на продукт IOHK Atala Prism, но с использованием NFT.\r\n\r\nПоскольку я сам родом из страны третьего мира и сам являюсь старшим разработчиком, я не понаслышке знаю о подделках и фальшивых документах/дипломах, которые выдают людям. Источник этих подделок обычно не в университете, а на открытом рынке, поскольку в настоящее время проверка подлинности этих документов сама по себе является дорогостоящим мероприятием для компаний ИЛИ высших учебных заведений из других стран.\r\n\r\nПоэтому я полностью согласен с тем, что данное предложение решает очень уникальную проблему в открытом мире и предоставляет очень хорошее решение этой проблемы на основе NFT.", "q0r": 5, "q1": "Опыт команды хорошо представлен со ссылками на их профили в linked in. Будучи сам разработчиком, я заметил, что технологический стек уже выбран, а опыт команды соответствует технологическому стеку, который они выбрали для разработки Front end, Backend и blockchain.\r\n\r\nС точки зрения опыта, я думаю, что знания Plutus упущены, и я бы поставил полный балл, если бы разработчик блокчейна также упомянул о своем участии (участие в PPP/успешное завершение) в экосистеме Cardano.\r\n\r\nС точки зрения плана, я чувствую, что он очень хорошо написан, а бюджет и затраты сокращены, чтобы выполнить цели бюджета F8. Однако, по моему мнению, этот бюджет можно было бы разделить еще больше, а не называть большую цифру $20k, например: сколько разработчиков будет работать, какова их ставка в час/месяц, и как была достигнута эта цифра в 20k?\r\n\r\nПлан, однако, очень хорошо изложен. В подходе к решению четко указаны цели и объем решения, а также технический подход. приятно видеть, что команда уже продумала высокоуровневые наборы функций и то, как они будут подходить к реализации этого предложения.\r\n\r\nВ целом, поэтому я согласен с тем, что это предложение, скорее всего, будет успешно реализовано.", "q1r": 4, "q2": "Представленный здесь план является достаточно подробным. Временные рамки 1-3 и 4-9 месяцев, которые указаны, также разделены на задачи, и каждый набор задач хорошо разделен на наборы функций.\r\n\r\nЭто очень хорошо, так как сообщество может тщательно отслеживать прогресс по неделям. Я вижу, что это в какой-то степени соответствует методологии Agile, и я надеюсь, что команда будет следовать Agile и учитывать мнение сообщества в процессе работы над предложением.\r\n\r\nОбщие цели проекта дают хорошее представление о том, как выглядит успех и куда, в конечном счете, ведут нас более мелкие временные возможности с точки зрения общей картины. Поэтому я полностью согласен с тем, что предоставленной информации достаточно для проверки прогресса и успеха данного предложения.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Авторы предложения хотят представить проверяемые документы и опыт, связанные с работой, представленные в виде НФТ. Это определяет проблему в постановке задачи, которая решается разработкой dapp, поэтому предложение соответствует задаче. Авторы четко указывают множество способов, которыми они собираются добавить ценность в экосистему кардано, в основном через верифицируемую, децентрализованную информацию, которую невозможно подделать. В качестве ключевого показателя эффективности я могу принять достижение поставленных целей по неделям, что кажется достаточно справедливым, учитывая, что других показателей предоставлено не было. Как разработчик я не вижу проблем с масштабированием проекта в условиях растущей среды, и мне нравится инициатива, которую они проявили, чтобы уже сейчас поговорить с потенциальными партнерами перед лицом некоторых учреждений.  Это решение дополнит экосистему, и особенно если многие люди начнут использовать этот способ проверки подлинности учетных данных, уменьшится количество подделок документов и других часто возникающих проблем при приеме на работу. У меня нет никаких опасений по поводу этого предложения. Удачи команде, я желаю вам успехов!", "q0r": 5, "q1": "Авторы предложений дают ссылки и прямое указание на свои имена и навыки, которые мне удалось проверить, немного погуглив. Судя по всему, для работы над этим проектом привлечена значительная команда, и тип и количество членов команды уже определены. Бюджет четко очерчен, и он кажется разумным для той работы, которую необходимо проделать, чтобы проект был успешным. Сроки, установленные для всей работы, кажутся реалистичными. Имеется очень конкретный план реализации всего проекта, что я, как разработчик, могу оценить. Все технологии, которые будут использоваться, перечислены и кажутся законными для выполнения поставленной задачи. В проекте достаточно ресурсов для успешного создания проекта с нуля, но я бы предложил посмотреть другие проекты с открытым исходным кодом и то, что они сделали, чтобы минимизировать общую работу.  Упоминаются некоторые риски и проблемы, а также возможные решения некоторых препятствий на пути.  В целом, кажется, что проект осуществим, и за ним стоит хорошая команда с их именами и званиями.", "q1r": 5, "q2": "Мне нравится, что команда запланировала подкасты и присутствие в социальных сетях, но я бы хотел, чтобы у них был канал discord или какой-то другой способ сообщить своим избирателям и членам сообщества о том, как идет развитие и прогресс проекта. Метрики и KPI действительно подробны, что редкость. Мне понравилось то, что у команды есть отличное определение успеха, которое кажется мне, как разработчику, реалистичным. Дорожная карта с этапами технической и нетехнической реализации логична и последовательна. Есть четкое описание целевой проблемы, связанной с проверкой подлинности опыта работы человека, и четкое описание решения, которое было очень хорошо продумано.  Мне очень нравится, что авторы проекта посмотрели глазами своих будущих пользователей, увидели, чего они ожидают от своей платформы, и разработали план по ее реализации. В целом, я думаю, что проект будет легче отследить, если у команды будет способ получать постоянную обратную связь от сообщества, а также информировать сообщество о ходе работы.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Считайте это предложение очень ценным, поскольку оно направлено на упрощение процесса проверки трудовой и учебной биографии, чтобы сделать его более дешевым, а также избежать мошенничества. Проверка трудового стажа, по сути, является бюрократическим и дорогостоящим процессом, и я уже видел другое предложение, которое рассматривало этот вопрос, доказывая необходимость его изображения. Если этот процесс будет осуществляться через генерацию NFT, зарегистрированных в блокчейне Cardano, это может принести большую пользу нашему сообществу и облегчить процесс найма людей как для самих кандидатов, так и для компаний\". Авторы хорошо аргументируют преимущества проведения этого процесса верификации через наш блокчейн, полагаясь на постоянство и неизменность (как он говорит) технологии для получения желаемых результатов. Они также заботятся о том, чтобы четко определить, какие выгоды получит каждая часть общественности: люди, академические институты и компании. Таким образом, я считаю, что этот проект непосредственно направлен на создание высокоценных приложений для нашей экосистемы-бенефициара.", "q0r": 5, "q1": "Меня впечатлило то, как команда подробно описывает, как именно будет использоваться каждый тип пользователя в приложении, что говорит о том, что у них есть полные технические знания и планирование в отношении представленного здесь содержания. Набросок сценария также является образцовым, то есть мы знаем 1) когда это произойдет 2) кто это сделает 3) что произойдет. При этом не так много вопросов, кроме того, что как можно больше деталей - это всегда хорошо, мы могли бы узнать больше о том, что будет происходить, например, больше делений на блоки задач. Команда также озабочена подробным описанием того, как она намерена расширить сферу применения инструмента, что, опять же, положительно, поскольку показывает, что они осознают важность этой части предложения. Что касается финансового раздела, я считаю, что эта часть была поверхностной, сумма, запрашиваемая на финансирование, очень высока, что требует очень хорошего объяснения, почему необходима такая сумма. Хотя есть разбивка затрат по частям, она неглубокая. И, наконец, о команде, участвующей в проекте, у нас есть подробная информация о том, кто они такие, в индивидуальном порядке, это очень важно, чтобы вызвать доверие, и с такими объяснениями передается большая уверенность в том, что они способны успешно реализовать проект. Очень хорошо, что они даже приложили профили linkedin, что дает нам возможность узнать их даже больше, чем подробности в предложении. Я бы улучшил только финансовую часть объяснения.", "q1r": 4, "q2": "Дорожная карта проекта очень подробна, так что у нас есть материал, необходимый для контроля за ходом дел. Автор также устанавливает в конкретной теме, какими будут цели и решения проекта, что многое говорит о проверяемости, но эта часть могла бы быть более подробной. Мне бы хотелось, чтобы команда уделила этой части столько же внимания, сколько, например, сценарию. Здесь необходимо установить мост между командой и сообществом. Как будут представлены эти частичные результаты? Нам нужен надежный способ мониторинга выполнения проекта, потому что, несмотря на то, что он не такой междисциплинарный (я говорю это потому, что в некоторых предложениях задействовано так много областей знаний, что мы можем даже немного потеряться в том, как контролировать проверяемость), это все равно сложная идея. Было бы важно, чтобы команда периодически представляла отзывы о проекте сообществу, например, это можно было бы делать ежемесячно. Итак, я думаю, что есть некоторые вещи, которые нужно пересмотреть, когда речь идет о проверяемости.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "A problem and a solution to the problem have been identified, and the idea has some potential but its usability, as it is presented, seems to get stuck in the early stage of the project and I will explain it in the next section why I think so.\r\n\r\nSome key metrics are defined and are outlined with the challenge objectives but more are needed to evaluate the impact of this project to the community and to the Cardano ecosystem", "q0r": 3, "q1": "The project aims to create a system where people can store info about their studies and work experience, info that will be endorsed by relevant third parties, and will be frozen on the blockchain as a Proof-of-Trustworthy, in a form of NFT, for further reference.\r\n\r\nWhen creating and making public a CV the person who is looking for a job is having in mind at least of couple of directions to follow: 1. to get the attention of the potential employer and (if necessary) 2. to hide his intention, in most of the cases, of leaving the actual employer.. Starting from this points some major drawbacks are at the horizon. A job offer is based on a series of requirements, and thus giving the possibility of each potential candidate to adapt his/her resume to meet those requirements and not being filtered out. They don't have to lie, just to make the resume more attractive. Saying this, why people would like to take snapshots of their resume that wont match in some aspects over time?\r\n\r\nSecond issue, regarding the request to the employer to endorse the working experience of an employee who is leaving, who would want to be so nice and do this freely knowing that the company will lose an (valuable) asset?\r\n\r\nReworking this proposal and finding a viable usability for the project ma give a better chance for a successful implementation.\r\n\r\nAccording to the LinkedIn profiles posted as reference for the team members it looks they don't have the necessary experience to help them implement the project. Additional relevant references are required to get the better result of the assessment.\r\n\r\n", "q1r": 2, "q2": "The proposer is not aware of any challenges and risks relevant to a successful implementation.\r\n\r\nBased of the info provided, even the idea has potential, it seems unlikely for the project to succeed.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 20, "ne": 2, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The proposal presents an excellent and innovative use case for NFTs to solve real-world issues. The technical challenges are negotiable and the author is rightly approaching the adoption problem by aiming to onboard one university which can bring about a cascading impact on the whole ecosystem. Overall the proposal is effectively addressing a core challenge. ", "q0r": 5, "q1": "The proposer has carried out research in this new area which could solve old problems and has come up with a workable plan. The has a detailed breakdown and does not seem to have major technical risks. There is a very high chance that the project will be implemented successfully.", "q1r": 5, "q2": "The project has a clear roadmap and task analysis. The steps are well-defined and achievable. The aim to get one university to sign up is a healthy idea to try out the project. Considering these parameters it is felt that the proposal is auditable. \r\n", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 2, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The idea of using NFT minting as proof of academic and work achievement is very good. There are several proposals in this fund with a similar angle in different categories, but this one expresses the problem and potential solution in a very coherent and logical way and with a credible roadmap. I am worried about this technology to reside in a startup with so many experienced team members without specifying the fee it will charge users for their service after successful completion. This looks like an attempt to get R&D funded by Project Catalyst while retaining the IP and future revenue from potential success.", "q0r": 2, "q1": "The proposer is already known to the Cardano community and the team is experienced and skilled to carry out the proposal. I doubt that the $25K or a MVP using 1 company and 1 academic institution will be indicative of the success or possible flaws of the implementation.", "q1r": 3, "q2": "The proposal uses repetitive wording and lengthy lists to create an illusion of thorough analysis without explaining how this proposal is different from its many competitors, how institutions can be onboarded and what the risks are. To me, the most worrying flaw of the proposal is the lack of separation between startup and Catalyst proposal, or how this proposal's benefits are unique to Cardano.", "q2r": 3, "assessor": "z_assessor_692", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "Возможность проверки подлинности документов, связанных с работой (т.е. степеней), и опыта работы в качестве нефункциональных токенов (НФТ).", "experience": "Команда состоит из 5 человек - бизнес-разработчика, технического архитектора, scrum-мастера, мобильного эксперта и разработчика блокчейна."}