{"id": 381393, "author": "valerio.mellini87", "title": "DeFi tools for Content Creators", "url": "https://cardano.ideascale.com/a/dtd/381393-48088", "category": 26240, "amount": 10000, "description": "Karma ориентирована на создателей контента, чтобы помочь им финансировать и структурировать свое призвание.", "funded": 1, "upvotes": 37298570, "downvotes": 6549748, "votes_result": 30748822, "votes_cast": 191, "f6_no_assessments": 5, "f6_rating": 4.133333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Автор предложения хочет создать платформу, на которой создатели контента смогут взаимодействовать со своими подписчиками новым, более интерактивным способом. Постановка проблемы отсутствует, но я неявно уловил идею, и она хорошо подходит для задачи, которую ставит автор. Я верю, что такие платформы станут обычным явлением в будущем, поскольку я уже слышал подобные идеи, но это первое реальное предложение. Привлечение творческих людей, таких как создатели контента, многое даст экосистеме. Метрики соответствуют настройке предложения chellenge. Я не слишком уверен в том, что проект легко масштабируется, поскольку сейчас работа ведется одним разработчиком. ИМХО в предложении не хватает команды, потому что идея заключается в создании довольно большого количества контента, и не было упомянуто о повторном использовании усилий других членов сообщества. Предложение абсолютно точно добавит в экосистему то, чего не хватает, а именно больше создателей контента и их последователей, что эффективно для роста сообщества.  В целом, это достойное предложение, и я бы очень хотел, чтобы оно оказало влияние на сообщество.", "q0r": 5, "q1": "Автор предложения предоставил ссылку на свой linkedin acocunt, и у него есть необходимые навыки для выполнения такой задачи, но в этом случае время будет проблемой. Однако тот факт, что он стоит за своим проектом, называя его своим именем, придает проекту более реальный характер и вызывает доверие. Валерио имеет представление о том, какую команду ему нужно собрать, чтобы довести предложение до успеха, но, полагаю, пока не нашел людей. Мне кажется странным то, что он упомянул о необходимости дополнительных средств, если ему придется нанимать людей (что было бы замечательно в данном случае), но, похоже, он не собирается этого делать, поскольку он не просил об этом бюджете и скорее планирует работать сам. Хотя это благородно, это не оптимально для успеха. Бюджет можно было бы немного разбить на части, например, почасовую ставку и оценку работы. Я не уверен, что установленный график является реалистичным для одного человека.   Предложение рисует действительно четкую карту токеномики проекта, что встречается нечасто и заслуживает похвалы. Автор предложения упомянул о таких разумных проблемах, как поиск создателей контента и сохранение конкурентоспособности по сравнению с другими платформами, что опять же трудно сделать одному человеку. Я бы предложил автору проекта посмотреть, какие инструменты уже созданы сообществом, и использовать их повторно, чтобы ускорить процесс разработки и сосредоточиться на поиске контрактов с создателями контента. В целом, я не уверен, что это предложение осуществимо, но я призываю автора искать команду и повторить попытку в следующем раунде финансирования!", "q1r": 3, "q2": "Отслеживаемость проекта не упоминается в предложении. Я не увидел способа для сообщества следить за развитием или прогрессом проекта. Я бы предложил, основываясь на том, что делают другие предложения, завести канал в telegram или discord. Это поможет найти будущих людей для работы, а также создателей контента и просто последователей проекта в одном месте. KPI кажутся актуальными, но не указаны метрики, с помощью которых можно измерить эти KPI. Дорожная карта достаточно понятна, этапы актуальны для проекта, и я благодарен автору за оценку времени. Предложение могло бы иметь лучшее описание целевой проблемы, но формулировка решения кажется надежной и понятной.   В целом, у катализатора проекта есть возможность проверить прогресс проекта перед выделением средств, но ИМХО автор предложения должен дать возможность сообществу также следить за прогрессом проекта.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Эта идея прекрасно согласуется с основной целью вызова. Здесь намерение состоит в том, чтобы создать Dapp, где люди вне вселенной блокчейна могут, как цитирует автор в начале предложения, лгать и манипулировать нативными действиями без особых трудностей. Отличием здесь будет очень \"дружелюбный\" интерфейс, как он его описывает, я считаю, что тогда это будет эргономичная и простая для понимания платформа; кроме того, Dapp не будет на 100% ориентирован на один тип аудитории, будут создатели (которыми могут быть люди или небольшие группы) и сторонники. Таким образом, целевая аудитория будет разнообразной, а благодаря простоте работы с токенами и NFT, Cardano, несомненно, получит большую выгоду, полностью достигнув того, что предлагает эта задача. Очень хорошо, что автор описывает нам, что каждый участник (создатель или сторонник) мог бы делать, какими будут основные действия в Dapp, давая нам твердое понимание того, в чем суть этой идеи и как это будет происходить на практике. Я считаю, что это ценное предложение и что оно принесет положительные результаты для нашего сообщества.", "q0r": 5, "q1": "Описание об авторе очень короткое, он мог бы написать небольшой текст, который объясняет, помимо его рабочих функций, некоторые предыдущие опыты и проекты, в которых он участвовал. Однако этот пробел восполняется, когда он предоставляет нам свой профиль linkedin; но я думаю, что идеальным вариантом было бы более подробное представление, а также linkedin. В конце предложения автор упоминает других специалистов, которые будут работать в команде, но, насколько я понимаю, у него до сих пор нет определенных людей, эти специалисты все равно будут наняты. Было бы лучше, это дало бы больше уверенности, если бы у него уже была сформированная команда, но так как этого нет, я предлагаю, чтобы этот найм был сделан на основе большого количества исследований, и когда команда будет сформирована, будет проведена какая-то встреча с остальными членами сообщества, чтобы представить ее. Автор не включил никого в команду, созданную для продвижения Dapp, как будет происходить реклама? Важно, чтобы этот проект был широко разрекламирован, так как его основная цель - облегчить жизнь людям в плане управления туземцами, даже тем, кто не из нашего сообщества, конкретно. Автор представляет дорожную карту, шаг за шагом, который необходимо выполнять каждые 3 месяца, мы можем знать, чего он хочет достичь в каждый период времени в целом, потому что деталей не так много. Что касается разделения финансирования, то детализация удовлетворительная, мы знаем, куда идет каждая часть запрашиваемых денег. Но сумма в основном делится между зарплатами тех, кто этим занимается, она не думает, как я уже говорил, ни о каком маркетинговом плане, больше, чем необходимо для успеха предложения. Поэтому я предлагаю пересмотреть эти детали, чтобы еще больше поднять уровень предложения.", "q1r": 3, "q2": "Автор представляет нам некоторые KPI, которые вкратце представляют собой количество пользователей приложения и количество токенов, которые будут созданы/обращены. Однако, поскольку это очень сложный и дорогостоящий проект, я думаю, было бы целесообразнее проводить ежемесячный мониторинг. Таким образом, автору необходимо установить более конкретные цели для прохождения каждого месяца, было бы еще лучше, если бы он рассмотрел работу, которую нужно сделать в меньшем масштабе и предоставил детали; например, в первый месяц, что бы вы делали в неделю? Как бы мы могли провести аудиторскую проверку? Возможно, избрать несколько подготовленных членов команды, чтобы внимательно следить за ходом проекта, за всеми фазами его развития. Таким образом, я считаю, что да, автор предоставляет нам контент для работы над аудируемостью, но из-за проекта, я чувствую, что есть необходимость в еще более подробном и конкретном контенте, который можно периодически отслеживать, а результаты этого анализа доводить до сведения остальных членов сообщества.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "There are a large number of content creators who could sell NFTs,royalties and fan tokens if the technical threshold to create, sell NFTs and present NFTs are made userfriendly. This proposal is aiming to address this important issue and more such experiments are required to create a user-friendly NFT world. Therefore it can be said that the project is addressing an important challenge in the ecosystem. ", "q0r": 5, "q1": "The proposer has five years of experience in software development and good academic background as seen from his LinkedIn profile. The proposer also has to onboard a Plutus developer for the development of smart contracts which have to be included in the site. The proposal is for creating a site that will enable minting and selling of tokens on Cardano easily. This can be used by content creators and others to raise funds for their enterprise or work. The proposer should be able to implement the project successfully.", "q1r": 5, "q2": "The fund requested is in alignment with the task in hand and seems a reasonable estimate. The project has economic sustainability and may bring value to the ecosystem in a reasonable time if successful. The project has well defined achievable task. Therefore the project is assessed as auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 18, "ne": 2, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "The proposal includes a nice dapp overview and the github wiki link provides solid content but the proposer does not include any in depth technical documentation on their dapp/plan to get to MVP. ", "q0r": 3, "q1": "Usually the dapp technical design and team development comes before funding requests, odd to see it in reverse here. 3/5 because the proposer has a solid well built github wiki/team development plans mentioned in proposal. The proposer has technical plutus development experience.", "q1r": 3, "q2": "The proposer goes into strong detail in the github wiki, less so in the proposal budget/roadmap sections. Still so for the development of an MVP this proposal is solid.", "q2r": 4, "assessor": "z_assessor_826", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The Karma solution is a unique dApp for content creators and consumers and effectively addresses the dapp challenge.", "q0r": 5, "q1": "The main developer of this project has a Cardano background receiving the Emurgo developer certification. The Github link contains good details on the technical components of the system. ", "q1r": 5, "q2": "The information provided in this proposal is sufficient and includes a roadmap, GitHub Wiki, budget, KPIs, Risks and a initial product feature set. ", "q2r": 5, "assessor": "z_assessor_828", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "Миссия заключается в создании инструментов для создателей контента и фрилансеров для получения средств и укрепления их брендов с помощью токеномики.", "experience": "- Архитектор программного обеспечения в области микросервисов и облачной архитектуры с опытом работы 5+ лет\n- Сертификация Emurgo Cardano Developer Associate"}