{"id": 381623, "author": "grisemetamoonverse", "title": "NFT market place to metaverse", "url": "https://cardano.ideascale.com/a/dtd/381623-48088", "category": 26240, "amount": 21000, "description": "В наши дни нфт на кардано - это в основном pfps. Привлекательная экономическая идея nft, которая привлекает множество пользователей, что способствует росту экосистемы.", "funded": 0, "upvotes": 15357776, "downvotes": 16446756, "votes_result": 1088980, "votes_cast": 146, "f6_no_assessments": 5, "f6_rating": 2.0, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=11740"], "media": [], "f6_assessments": [{"q0": "Постановка проблемы, приведенная здесь, проста для понимания, а ее решение решает одну из актуальных проблем, с которой сталкиваются многие художники, желающие публиковать коллекционные издания одним махом с простым пользовательским интерфейсом.\r\n\r\nТаким образом, рынок NFT с массовым запуском NFT является потребностью времени. Я согласен, что это предложение эффективно решает проблему, однако, на мой взгляд, можно было бы дать больше деталей, особенно в том смысле, что они утверждают - \"разработали cnfts с функциональностью на платформе, установленной ...\". - Я вижу там скриншот, где программа запущена на localhost, простая демонстрация (видео) ИЛИ демонстрационный тестовый сервер были бы намного лучше, чтобы сообщество могло проверить сделанные заявления.", "q0r": 4, "q1": "Я немного разочарован написанием раздела \"Опыт и план\" для этого предложения, хотя идея мне очень понравилась.\r\n\r\nОтсутствует подробная информация о каждом члене команды, и трудно проверить утверждения автора предложения о том, что у них уже есть определенный уровень пользовательской базы и ведутся разработки.\r\n\r\nПлан представлен в том смысле, что они хотят достичь в следующие 4 месяца и 3 месяца, привлекая больше пользователей на свой рынок, но я не понимаю, как предложение отклонилось от решения (которое говорит о способности генерировать массовые NFT) в части привлечения пользовательской базы на рынок? Я имею в виду, что разве не должен был автор предложения дать описание (пошаговый план), разбитый на недели, 3 месяца, 6 месяцев? Я вижу, что намерение может быть хорошим, но описание разрозненное, и за ним трудно уследить.\r\n\r\nКроме того, разбивка бюджета не обоснована. Какие усилия, по мнению автора, необходимы для достижения полностью функционального (d)app, которое рассчитывает на 21000 USD, которые запрашивает автор? На мой взгляд, усилия по фронтенду и бэкенду должны быть разделены на почасовые ставки, и сообщество должно получить более подробную информацию о том, сколько усилий (время * почасовая ставка) необходимо приложить для завершения каждого из разделов (фронтенд, бэкенд, тестирование).\r\n\r\n Это, на мой взгляд, не является дисциплинированным способом обучения сообщества, поэтому я вынужден не согласиться с тем, что это имеет высокую вероятность успешной реализации.", "q1r": 2, "q2": "Здесь я также не могу согласиться, в предложении говорится о 3-4 месяцах, чтобы привлечь как можно больше пользователей кардано на свою платформу, а также приводится оценка бюджета на разработку кода бэкенда/фронтенда.\r\n\r\nЧто упустил автор предложения, так это когда реализация будет завершена (1-2 месяца??), каково текущее состояние реализации, как мы как сообщество будем отслеживать прогресс этого предложения и с кем мы будем связываться?\r\n\r\nДля этого проекта нет буквально никаких публичных профилей (github/ссылки на него), также нет никакой доски mira/jira, где они отслеживают свой прогресс (текущее состояние) по сравнению с будущими реализациями (основанными на том, будет ли это одобрено). Это делает, имо, это предложение трудно поддающимся аудиту, и поэтому я вынужден с ним не согласиться.\r\n\r\nЯ бы посоветовал автору предложения посмотреть на успешные предложения предыдущего раунда и повторить попытку в следующем раунде. Удачи", "q2r": 2, "assessor": "z_assessor_454", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "To be honest after reading the proposal twice I'm not a 100% sure if it's a platform to launch NFTs or just a marketplace for NFTs. There were a lot of  abbreviations I didn't understand like: \"peps\", \"atm\", \"bsc\" \"cNFTS\". I searched for them, but I'm still unsure about some of them. Since the proposal wants to build a dapp or some kind of a decentralized platform, it should fit the challenge it's in. The proposal has some issue with clearly articulating what problem does it solve and how will it bring value to the cardano ecosystem. For me there were glimpses but the overall picture eludes me. The metrics are related to the platform growth which is reasonable and in line with the growth measurement. I'm not sure about the proposal being able to scale, but I'll touch on that in the feasability section. Compared to other proposals this one is missing a couple of key items like: the team standing behind the proposal, skillsets, challenges that the project is expecting to fail along with a couple of minor ones. I'm sure this proposal will bring something to the table, because the idea to mix games and an nft marketplace is very intriguing to me. As a developer I'm a bit woried about the implementation, since no specific people or needed skillset is mentioned. Overall I believe this project could have some impact for the cardano community if it's better structured and a couple of key elements are added in.", "q0r": 3, "q1": "Unfortunately the authors of the proposal haven't left any links or references to team members or skillset necessary for the proposals implementation. This is really a bummer for me, because a known team standing with their names behind an idea brings more credability to a proposal in the eyes of the voter. Maybe the proposer has forgotten to include team members or just hasn't gotten the clear idea of the skillset necessary to finish the implementation. The budget is just an outline without any specific breakdown. I would suggest to the authors to check out other proposals and I believe it could be greatly beneficial for them to do so to improve their own proposal for the next funding rounds.  I saw a lot of interesting ideas in this proposal, but none of them felt like a well formulated plan yet. So there's no clarity for the implementation as well. As I mentioned I'm not sure if the proposal will be able to scale since the team members or possible team members are not mentioned and neither are future challenges or a specific roadmap with concrete milestones. The technical aspects of the proposal are not mentioned.   I encourage the proposers to work on this and give a new and improved version that has all the suggestions from myself and the comments implemented in the next funding round. Good luck! ", "q1r": 2, "q2": "There was no mention of any place that the cardano community will be informed about the progress of the project. I've found that a discord or a telegram channel does wanders for forming a community arround an idea. There are some relevant metrics concerningg adoption and possible user count for the platform, which is great, because no process can be optimized if it's not measured first.  The description of the whole proposal can be more clear so that anyone can understand it. It will help if not so many abbreviations are used. The problem statement as well as the solution needs some work. My suggestion would be to put yourselves in the shoes of the voter that sees your project for the first time and should understand what it's all about by a glancing read. Overall I thing the tracability of the project is not great. \r\n", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "An NFT marketplace and metaverse gaming would be things that could bring tremendous value to the cardano ecosystem. As they've stated, there are a large amount of users in the gaming industry and there are large economic incentives with NFTs at the moment.", "q0r": 4, "q1": "This proposal does not provide any information on their team, nor does it provide details on a comprehensive plan of action. With little details to go off of, its hard to say there is a high likeliness of success.", "q1r": 1, "q2": "This proposal does not provide sufficient information to audit the success and progress. It gives an overall mission statement with some research points, but there are no KPIs, no information on the team, no roadmap, and very limited information on the budget breakdown.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 20, "ne": 0, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "This main point is about cnfts with functionality on a platform set up to be integrated for mass nft launches. The problem statement is not quite convincing, and not explained in detail. Besides, the solution was not clearly explained in detail [without a goal, roadmap/milestones,...]. As a result, not likely to address this challenge of developing Dapp and unclear impact. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "Since this proposal did not provide a clear intention of what is going to do, and lacks important components of information [no team/proposer's profile, no goal, no roadmap, no KPI/metric,...], It is hard to evaluate how feasible it is. My advice is: the proposal's solution should be clarified in detail for answering the question of: what is the function of this dapp, how long does it take to build it, who are your partners, what should the KPIs/metrics be to measure the success,... After all, based on the given information, I can not agree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "Since this proposal lacks important components of information [no team/proposer's profile, no goal, no roadmap, no KPI/metric, no budget explanation for each item,... auditability can not be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "The proposal states they have developed a platform that will help with mass NFT launches. This is an interpretation from solution statement as it was hard to follow. The proposal mentions the growth of NFT marketplace and suggests they will help to onboard more users with their solution. No details are provided on the existing solutions in the market and what is different from their solution that they have started working on. It is very unclear on what additional value this proposal is making beyond the existing platforms and clearly defining the differences.", "q0r": 2, "q1": "No team information is provided nor is any sources to showcase their existing work and execution. It is very difficult to gage whether this proposal is feasible to be executed by the proposal team. A basic budget break down is provided however no evidence as to who will execute those deliverables and any evidence they can deliver on those statements.", "q1r": 1, "q2": "The only success objective mentioned is 'The success for this sub section of the project will look like many cNFT collections being easily launched on our platform.'  This statement alone doesn't provide much confidence for usage of effective success objectives. No KPIs are also provided. The proposal requires more clarity on how it differs from existing solutions and then should include information on existing metrics of success and other relevant KPIs.", "q2r": 1, "assessor": "z_assessor_758", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Мы разработали cnfts с функциональностью на платформе, настроенной на интеграцию для массовых запусков nft.", "experience": "Наш проект находится на траектории развития с целью привлечь как можно больше пользователей. Мы полностью укомплектованы и постоянно растем."}