{"id": 382341, "author": "raghu.thakur", "title": "Dapp for Art & Creator Discovery", "url": "https://cardano.ideascale.com/a/dtd/382341-48088", "category": 26240, "amount": 30000, "description": "Только 3% художников могут быть обнаружены и продвигать свое искусство и талант с помощью цифровых технологий. Принятие криптовалют среди художников составляет 0,004%.", "funded": 1, "upvotes": 34179549, "downvotes": 13275146, "votes_result": 20904403, "votes_cast": 184, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Я согласен с тем, что данное предложение эффективно решает поставленную задачу. Постановка проблемы описывает хорошо известную проблему в традиционной сфере создания произведений искусства. Решение, предложенное для этой проблемы, не вызывает сомнений, поскольку блокчейн и децентрализация находятся в центре существующих проблем централизации/монополии.\r\n\r\nОднако предложение, на мой взгляд, могло бы представить некоторые статистические доказательства цифр, приведенных автором в постановке проблемы (только 3% художников могут быть обнаружены). Криптовалюты принимаются на уровне 0,004%. Кроме того, решение утверждает в 10 раз большее принятие криптовалют при 91% меньших затратах, было бы здорово, если бы сообщество было осведомлено о том, как автор достиг/нашел это число. Любая дополнительная информация, которая поможет сообществу проверить ваши утверждения, будет полезна, иначе это просто заявление, за которым нет сути.\r\n\r\nВеб-сайт уже создан, и у них есть работающий продукт до определенной степени, и я считаю, что отсутствует часть децентрализации, ради которой было сделано это предложение. Однако мне непонятно, что продукт существует уже более года, и как получилось, что они дошли до децентрализации именно сейчас, и какие усилия были предприняты за последний год или более с их стороны для продвижения децентрализации? Было бы неплохо, если бы эта информация была представлена здесь (в основном, их кривая обучения, когда они выявили эту проблему централизации, потому что, если она была там с самого начала, они просто наткнулись на cardano и почему они не могли взять контракты solidity на базе Ethereum, чтобы иметь первую версию этого? Теоретически они могли бы просто использовать конвертер ERC20, чтобы перевести свой проект на Cardano).\r\n\r\nВ любом случае, в статье есть место для улучшений, но идея интересная, так что я с ней согласен.", "q0r": 4, "q1": "Основная команда, стоящая за этим предложением, вполне прозрачна, и их публичный профиль представлен здесь.  Только один из указанных членов команды занимается технической стороной, но его профиль на github и участие в Хаскеле/функциональном программировании не видны.  \r\n\r\nКак участник программы Plutus pioneer и старший разработчик я знаю, что кривая обучения программированию на Plutus не такая тривиальная, как на языках высокого уровня, таких как java/javascript и др. Так что для сообщества было бы неплохо, если бы мы могли получить более подробную информацию о репозиториях github и/или других разработчиках, которые будут участвовать в конференции и либо были частью программы Plutus pioneer, либо сделали другой вклад в открытый код?\r\n\r\nПредставленный здесь план разделен на шаги и довольно подробен. Успех через 3-6-12 месяцев хорошо описан. Однако, чтобы поддержать 3-месячный рубеж, я не вижу никакой дальнейшей разбивки бюджета на стадии MVP. Написано Back-end разработка платформы, но что именно они подразумевают под back-end? Умный контракт (с кодом offchain-onchain), какой протокол хранения они будут использовать (например, arweave???).\r\n\r\nТехнические жаргонизмы, такие как \"проверка прототипов моделей для отдельных компонентов\", не помогают читателю (не говоря уже о разработчике вроде меня) легко понять, чего могут ожидать избиратели/члены сообщества, что это на самом деле означает?\r\n\r\n\r\nТакже как эта цифра (25k $) была достигнута? Для сообщества было бы лучше, если бы автор предложения еще больше разбил эти бюджетные требования по человеко-часам, и разбил бы стадию MVP на последующие 2-недельные спринты и/или меньшие сроки. Некоторые предложения здесь предоставили jira board с такой реализацией.\r\n\r\nПоэтому как CA я должен дать этим предложениям более высокие оценки, и дать этому предложению такую же оценку, как и им, было бы несправедливо.\r\n\r\n", "q1r": 3, "q2": "Я бы сказал, что информации, представленной здесь, достаточно. Хорошая часть заключается в том, что указано, как выглядит успех через 3-6-12 месяцев, но, на мой взгляд, это следовало бы разбить на части, чтобы сообщество могло отслеживать прогресс раз в две недели (если не еженедельно).\r\n\r\nЯ думаю, что у сообщества есть возможность проверить прогресс и успех этого предложения, но автор мог бы сделать лучшую работу, чтобы дать больше уверенности в том, какие меры они предпримут, чтобы иметь в виду масштабирование с самого первого этапа. Например, Cardano уже разобрался с масштабированием задолго до запуска Hydra, я считаю, что для любой платформы, которая стремится к широкому внедрению, сложные вещи должны быть разобраны в самом начале, и если это сделано, то об этом должно быть известно сообществу через это предложение.\r\n\r\nВ целом, хорошая статья, но есть еще возможности для улучшения.", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": " There is a need for onboarding visual artists to blockchain which provides a secure and decentralized means to monetize the art. This initiative to provide a networking site with smart contract-based remuneration has the potential to onboard a large number of artists including photographers. This is relatively low-hanging fruit and achievable. ", "q0r": 5, "q1": "The proposers are already running an artist networking site and are experts in the domain. The team also has a clear plan and aim. The current proposal is to create an MVP and a working model. This platform also aims to attract artists by offering work which by itself will start boosting adoption. Therefore it is highly likely that the project will be implemented in earnest. ", "q1r": 5, "q2": "The proposal is detailed and includes a clear roadmap. Their work schedule has been provided in detail. The proposal will have visible outputs and adoption can be measured in quantitative terms. Thus it satisfies all requirements for audibility. The success can also be measured based on the number of artists the dApp onboards. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 15, "ne": 1, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposal does addresses the challenge, and have an interesting outlook of creating a social network platform in the blockchain, thus increasing the adoption of users. Moreover, this does not just increase adoption but give opportunities to unsung creators that want to share their work and skills on the Cardano ecosystem. The proposer have even set milestones that they want to achieve and gave detailed overview on how creators can benefit using the dApp.", "q0r": 5, "q1": "The front-end interface for Bluetook looks alot like Facebook, and I believe it will easily adopt users to use it. Given the team members that have experiences in various fields, I think the dApp can be developed successfully. In addition, the whitepaper have clearly planned for its ICO tokenomics.  The main concern are risks management that the proposer have not mentioned. (Such as, when both party of creators agree via smart contract to create something, what are the risks involve in doing so? What happens if once they have agreed on the smart contract and the \"get together\" does not actually happen? How do creators avoid from being scammed through this?). These are essential for bringing confidence to the users/voters.", "q1r": 4, "q2": "The funding required are well allocated in terms of business, development and marketing. On the whitepaper, the proposer have mentioned all phases to achieve their goal on gaining users. And based on the proposal above, I do believe that the proposer wants to kickstart on the MVP stage within the 3 months as the budget has stated. Roadmap are detailed, with integrations on Artano (marketplace) and galleries, have shown that the proposer's vision of the project. Although, this will be a big leap, it will be helpful if there are key metrics to be tracked for better auditability. ", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal fits the challenge and gives a brief general overview of the problem it's trying to solve. The proposers didn't outline how this would add value to the Cardano ecosystem. Still, given that the product they have prior is already active, there is no doubt that this will drive adoption by utilising this technology.key metrics align with the proposal; as detailed in the plan, the project is measurable via tokens and transactions flow.", "q0r": 4, "q1": "The proposers primarily link to a startup called bluetook, which the team is trying to integrate and build on top of Cardano. a small team is put together which has the relevant experience from the startup bluetook, but should be aware that Cardano is an entirely different beast and requires an understanding of how it works under the hoods to properly take advantage of Cardano's features to make this project a success.  The project offers a fair overview of what they want to achieve in the 18-month timeframe, but the budget doesn't match what they are setting out to achieve. What's being asked is less than what is used in their budget breakdown. I didn't see any relevant challenges risks that the team will face as to whether or not it will hinder the project's success. Details and context were missing; a little more light should be shed on the information that the proposal lacked, such as risks, key performance metrics, more emphasis on the problem etc.", "q1r": 3, "q2": "Short Milestones are outlined briefly, and KPIs are non-existent. We get a brief description of the targeted problem and more of an emphasis on their solution, but as a viewer, we don't understand the problem and how it fits in with the solution. More information on the problem and examples of how things work today rather than jumping straight to the solution.", "q2r": 3, "assessor": "z_assessor_903", "no_vca": 16, "ne": 3, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Децентрализованное обнаружение искусства и его создателя с помощью социальной сети. В 10 раз большее принятие криптовалют художниками и клиентами при 91% меньших затратах.", "experience": "Bluetook работает более 1 года и содержит 1700+ художников, 50 тысяч курируемых изображений. В число основателей входят художники, технологи и менеджеры с 17 патентами."}