{"id": 382311, "author": "lpanchot", "title": "No code, audited Smart Contracts", "url": "https://cardano.ideascale.com/a/dtd/382311-48088", "category": 26240, "amount": 20000, "description": "У Dapps нет простого способа создавать, управлять и исполнять смарт-контракты. Разрабатывать контракты сложно, а аудит стоит дорого.", "funded": 2, "upvotes": 126635128, "downvotes": 9785911, "votes_result": 116849217, "votes_cast": 665, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "Авторы предложения хотят сделать использование смарт-контрактов бескодовым. Это означает, что люди будут иметь UX, не требующий никакого кода с их стороны. Проблема выявляет возможность познакомить обычных людей со смарт-контрактами, даже не подозревая об этом. Это окажет большое влияние на принятие экосистемы cardano, если она распространится. Это влияние принесет ценность экосистеме cardano благодаря тому, что люди узнают об этом. Ключевые метрики разумны для проекта и обеспечат хорошее отслеживание для оптимизации процесса и проекта в будущем. Как разработчик, глядя на вовлеченных людей и описанные полномочия и навыки, я не вижу проблем с масштабированием проекта. Единственное, что мне хотелось бы увидеть, это способы взаимодействия с сообществом. Справедливо отметить, что один из авторов оставил ссылку @telegram, чтобы люди могли связаться с ним, но канал discord может вырастить настоящее и вовлеченное сообщество. Это предложение внесет недостающий элемент в текущую экосистему, привлекая обычных людей в сообщество кардано.  Мне очень нравится это предложение, удачи, и я буду следить за вашим прогрессом.", "q0r": 5, "q1": "Мне всегда нравится, когда предлагающие оставляют ссылки на свои профили, потому что это приносит определенную уверенность и, более того, вызывает доверие ко всему проекту. По моему опыту, избирателям очень нравится, когда авторы предложений гордо стоят со своими именами за проектом. Команда, состоящая из квалифицированных специалистов, уже готова и работает над реализацией предложения и, AFAIK, идет точно по графику. Бюджет достаточно прост и изложен понятным образом. В ресурсах авторы предложения объясняют с помощью картинок (лучшее средство), как работает алгоритм, и он достаточно прост и понятен, чтобы работать без проблем. Как разработчик, помня о работе, которую еще предстоит сделать, я верю, что команда сможет закончить работу в сроки, которые они сами для себя установили. План является разумным и содержит ответы на вопросы не только о том, что мы строим, но и как. Ресурсы, на которые даны ссылки в предложении, помогают понять возможные детали реализации или хотя бы некоторые из них. Мне нравится, что один из разработчиков является разработчиком haskel, поскольку это первоклассный гражданин в экосистеме разработки cardano. Технические аспекты могли бы быть немного более конкретными, но я говорю из любопытства. Авторы проекта составили довольно подробную дорожную карту, поскольку их KPI очень амбициозны. Проект синхронизирован с тем, что уже сделано, и их проект станет блоком, на который смогут опираться другие разработчики для создания своих собственных приложений.", "q1r": 5, "q2": "Единственное, что меня беспокоит, это возможность отслеживания проекта. Поскольку у них есть сайт, я надеюсь, что они создадут раздел, где авторы смогут размещать сообщения в блогах или какие-то отчеты о ходе проекта и о том, как он продвигается. Метрики и KPI кажутся актуальными. Мне нравится, что они напрямую связаны с определением успеха проекта. Дорожная карта и этапы на этом пути достаточно конкретны, чтобы пункты можно было реализовать последовательно и не нарушить сроки, отведенные на проект. Имеется четкое и понятное описание проблемы, которую необходимо решить, а также простое, но хорошо проработанное решение.  Мое небольшое предложение - авторам предложения стоит посмотреть глазами их будущего сообщества и подумать о том, как создать канал discord, где это сообщество сможет развиваться и помогать им в проверке их работы. В целом, мне нравится предложение, и я буду голосовать за него. Удачи вам в этом и последующих предложениях!", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "n order to bring the threshold required to use smart contracts down these kinds of no-code systems are mandatory and they have to be made prolific to improve adoption.  The proposal aims to build smart contract templates for the most common use cases. This will address the core challenges in the smart contract ecosystem. ", "q0r": 5, "q1": "The team consists of more than five people with balanced composition and they have produced a prototype with an open codebase. The experience and qualification is sufficient to carry out the building of smart contracts and the web interface. The work so far is professional. Therefore the team will be able to complete the proposal.\r\n", "q1r": 5, "q2": "The aim of the proposal is to build a system that can be used by people from nonprogramming backgrounds to use deploy smart contracts. This is a must feature and Marlow is aiming to achieve this. Therefore the aim and the outline are clear and the proposal implementation details are sufficient to trace the progress of the proposal. Therefore the proposal can be monitored and success can be measured. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "As information about the capabilities and value of smart contracts disseminates through society, easily deploying smart contracts without the need to write code has the potential to onboard a lot of new users to blockchain in general and Cardano in particular. The more reliable and easy to use \"no-code\" solutions the Cardano ecosystem can provide the better. This is why I believe the impact of the project proposed can be quite significant and matches the goals of this challenge perfectly.", "q0r": 5, "q1": "The team provides full details about themselves with links to their LinkedIn profiles from their website. They seem to be a mix of passionate young developers. Given that they have already started working on the project they are requesting funding for, there is a high likelihood that the project will be successfully implemented. Also, because of this, the outlined timeframe seems realistic and doable. The budget is on the small side, but given that it looks like they have self-funded the project up to this point it is likely that they are going to continue to do so.", "q1r": 5, "q2": "I would have liked to see more attention given to the KPIs, but other than that all the elements are there to make for an easily auditable proposal if funded. The timeframes and metrics are described clearly and would be easy to follow.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Мы создали решение без кода, которое позволяет пользователям создавать, управлять и исполнять смарт-контракты.", "experience": "Мы создавали этот продукт в течение 8 месяцев и в настоящее время интегрируем его с PAB. https://clearcontracts.io/team"}