{"id": 382444, "author": "fellx27", "title": "Medusa Wallet", "url": "https://cardano.ideascale.com/a/dtd/382444-48088", "category": 26240, "amount": 30000, "description": "Существует множество веб-кошельков, которые используют потенциально небезопасный сценарий обработки ключей. Medusa должна исправить это.", "funded": 1, "upvotes": 54997507, "downvotes": 7588102, "votes_result": 47409405, "votes_cast": 233, "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": " Wallets like NAMI have added great value to the echo system. Therefore encouraging more wallets with API support for integration and smart contract compliance will improve adoption. More open-source wallets also improve onboarding developers. Therefore this proposal is addressing an issue in the ecosystem. ", "q0r": 4, "q1": "The proposer had made adawallet and plans to develop a new version named Medusa 2.0. The security features he claims to need to be validated. The author's credentials are not explicitly included in the proposal he is also running a stake pool with an aim to support the wallet development. Based on the work that has been published in the site, it is felt that the author has the capability to carry out the project. ", "q1r": 5, "q2": "The output of the proposal is to build a new Cardano wallet and open source it. The proposal claims to achieve seven features which include a few security features like 2FA. The use of deeply researched security model needs validation though. The feature list is clear and the budget breakdown is very conservative. Therefore the project is auditable. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge by innovating current wallet with added security features. I somehow feel easier to use 2FA authentication to just sign up and login to the wallet, so that's a plus, in my opinion. What concerns me is how do the proposer plan to adopt users to use the wallet in terms of usability (UI & UX) whereby current users are comfortable with existing wallets such as Yoroi & Daedulus. I am a UI/UX designer, and I was wondering if there are more detailed laws of UX (such as Aesthetic-Usability/ Miller's Law..etc) within the front-end interface. Yoroi & Daedulus have quite user-friendly UX but there are features that lack of flow (for example; Yoroi Wallet - unable to categorize transaction based on the user's needs. Or a feature where user can manage its portfolio..). Thus, I would love if the proposer can explain further \"user-centric approach\" as this is essential for adoption of users.", "q0r": 5, "q1": "I believe the proposer have great experience in developing based on the above. However, key metrics to measure are not detailed and roadmap are not mentioned, therefore, it will be difficult for voters to see success in this proposal. I see that the proposer has mentioned that the old Medusa wallets have over 1000+ users, but how can we increase the number of wallet holders in the next 3 months, or 6 months. A list of ways to market the product (such as; Within 3 months, there will be an airdrop of free NFT(s) from creators of Cardano that has been using Medusa to people who follow our Twitter. This is just a rough example.) should be clearly underlined to ensure confidence of the project. ", "q1r": 3, "q2": "Seems to me that the funding required are reasonable, but I feel that there is more that needs to be broken down; such as business advisors, marketing budget, and risk budget..\r\n\r\nThere are users that are done with Yoroi and Daedulus  (especially Yoroi) due to it having synchronization issues at times and other reasons. A good way to improve and innovate this proposal is to have a UX survey analysis on what the users want in an application since there is already a working product. Why have UI/UX like Daedulus when you have a brilliant idea that can create a different yet unique approach. This will definitely impact on making a great, secured, 100% anonymous, and user-friendly dencetralized application. ", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 16, "ne": 7, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal to build v2 of the Medusa wallet for Cardano users is effectively addressing the integration piece of the dapps challenge. ", "q0r": 5, "q1": "The team has already built a Cardano wallet (1st developed during the ITN) and has proven capability to bring wallet solutions to Cardano mainnet. The proposal section outlining the features to be added allows the CA to analyze the magnitude of work that will be completed under this proposal. The requested funds amount is appropriate given the fact this is already deployed on testnet. ", "q1r": 5, "q2": "The proposer includes an extensive feature list, budget and overall plan to implement the Medusa v2 wallet on mainnet. The info is sufficient to audit progress.", "q2r": 4, "assessor": "z_assessor_911", "no_vca": 22, "ne": 1, "ng": 15, "nfo": 6, "vca_o": 1}], "solution": "Платформа Medusa 2.0 имеет уникальную глубоко проработанную модель безопасности. Подробнее в описании.", "experience": "4 года разработки для экосистемы Cardano;\nСтепень в области компьютерных наук и цифровой безопасности;"}