{"id": 382825, "author": "tihomir.dimov", "title": "Divine Blockchain - Phase I", "url": "https://cardano.ideascale.com/a/dtd/382825-48088", "category": 26240, "amount": 35000, "description": "Плохой контроль температуры, условий хранения на протяжении всей цепочки поставок является самой распространенной причиной потери качества вина.", "funded": 1, "upvotes": 45396300, "downvotes": 7037170, "votes_result": 38359130, "votes_cast": 144, "f6_no_assessments": 6, "f6_rating": 3.611111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Предложение начинается с описания разработки и развертывания DApp для решения проблем мониторинга качества вина по мере его транспортировки по логистическому пути. Но это, по сути, самое близкое касание к целям задачи, и поэтому я не согласен или не согласен с тем, что оно соответствует. Автор предложения описал критичность мониторинга качества и времени, проведенного вином на пути распространения, но не предложил конкретики того, как это будет достигнуто. Есть упоминания об Индустрии 4.0 и IoT, однако они никак не связаны ни с разрабатываемым DApp, ни с его будущими функциональными возможностями. Мы все знаем о EmurgoTrace и ScanTrust от Cardano, последний используется в качестве механизма отслеживания в грузинской винной промышленности для аутентификации бутылок от фермы до стола. Если данное предложение должно стать усовершенствованием этих существующих приложений, то для получения более высокой оценки оно несколько неадекватно описано.", "q0r": 3, "q1": "Я сижу на заборе с точки зрения способности этого предложения предоставить рабочий продукт, главным образом потому, что не хватает соответствующих деталей. Конечно, два члена команды названы, но в их профилях LinkedIn нет прямого опыта в разработке DApp, который мог бы обеспечить уверенность. Похоже, что Intellics Engineering больше ориентирована на автомобильную промышленность, и нет никакой информации о текущих и прошлых внедрениях блокчейна, как было заявлено. Если опыт автомобильной промышленности будет использован для улучшения отчетности о качестве вина, поскольку он связан с транспортировкой продукта, это должно быть лучше объяснено, чтобы создать связь между их опытом и предполагаемым развертыванием. В предложении описаны этапы 16-недельного периода, который сосредоточен на исследовании, разработке концепции и создании прототипа, и представлены расчеты затрат на запрашиваемые 35000 долларов США. Кажется, что существует несоответствие между перечисленными 16-недельными мероприятиями и предполагаемым распределением средств. В то время как калькуляция расходов ориентирована на разработку, мероприятия, которые планируется провести, в большей степени ориентированы на исследования. Я считаю, что это предложение может выиграть от более четкого описания самого DApp в качестве отправной точки. Каковы его функциональные возможности, что и как он будет отслеживать, кто будет участниками цепочки, от которых зависит получение качественных данных, и какие виды электроники и оборудования для мониторинга будут использоваться. Отсюда можно определить основные этапы и путь развития, что при правильном и согласованном расчете затрат может повысить шансы на осуществимость проекта. Автор предложения также может добавить подробности о том, каким опытом он обладает и не обладает; и, исходя из того, что у него есть, показать связи с разработками в области блокчейна, как заявлено. А из того, чего у них нет (например, разработки в Plutus), - как они будут получать такую экспертизу. Описанные здесь этапы могут стать отправной точкой без какой-либо помощи со стороны Catalyst и будут хорошей основой для более существенного предложения DApp в будущем раунде финансирования. Удачи.", "q1r": 3, "q2": "В предложении мало того, что обеспечивает высокую степень уверенности в проверяемости. Помимо сайта intellics.com, на котором нет существенных деталей того, как проект будет реально решать представленную проблему, нет ни githubs, ни аккаунтов в социальных сетях, которые могли бы обеспечить возможность отслеживать прогресс и задавать вопросы. Дорожная карта и основные этапы исследования будут источником данных, которые они смогут представить Catalyst и сообществу, однако нет никаких упоминаний о том, как будут распространяться открытия. Это предложение, особенно учитывая, что оно относится к задаче DApp и Integration, будет оценено выше, если будет представлен GitHub. Авторы также могут сообщить о результатах своей концептуальной деятельности, возможно, используя gitbook или аналогичный механизм публикации. Тем не менее, я предлагаю, чтобы команда сначала провела исследовательскую деятельность, чтобы закрепить идеи и направление, так как это приведет к более подробному предложению для последующей подачи.", "q2r": 2, "assessor": "z_assessor_42", "no_vca": 25, "ne": 14, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "The proposal will provide a dApp with temperature sensor integration and tracking capability to monitor the storage condition of Wine. This is appreciated as a standard use case for blockchains in general. There is a need to create a demonstrable and well-marketed solution to improve adoption. Therefore the proposal is very much in alignment with the challenge. ", "q0r": 5, "q1": "The proposing team has about 20 years of experience in engineering and management. The solution proposed in a standard use case for blockchain is being experimented with and under implementation. Therefore there is likely to be a paved road technically ahead of the team which will substantially reduce the technical risk. I believe that with this consideration there is a strong chance the team will be able to complete the proposal in time.", "q1r": 5, "q2": "The fund requested in this phase is about one-fifth of the total estimated cost. The fund caters to developers, Project managers, and misc activities. The end state and KPI of this phase I is to build the dApp including both frontend and backend. However, the allotment for funds for software developers is only $ 7000. Notwithstanding the project clearly brings out steps and is auditable. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The idea here can be well defined in the following snippet: “real-time wine quality tracking across many supply chain checkpoints, supported by a blockchain ownership and monitoring solution”. This proposal aims to store in the Cardano blockchain some characteristics about the quality of wines, such as their location, temperature, etc. Unfortunately, I see several points to be problematized here. The situation is similar to another proposal that also deals with the world of wines, which I evaluated recently (Wine open market - Stappato, present at the following link: https://app.ideascale.com/t/UM5UZBq7U). We know what the idea is, but there are not enough explanations for us to understand well how all this would benefit the Cardano ecosystem. It is not specified how this bridge would be established, which technologies would be used, how Cardano would be integrated, in a detailed way, in this project. All we are told is that the blockchain would be used to store some information, which would be tamper-proof, traceable and all the other advantages that the blockchain provides. But little is said about it. The proposal is concerned with explaining the crux of the issue much more - guaranteeing final consumers control over the entire wine-finding process - than how all this would use and impact Cardano. Another point I would like to highlight is: as in the other proposal on wines, I find it difficult for the target audience here to actually purchase these services, use this platform (from the attached photo and from the understanding I had, it would be a Dapp). How to reach people who are commonly unaware of blockchain? How to persuade them to use this Dapp, in addition to wanting to have greater control over the wine they will purchase, how would they relate to Cardano? The target audience here would be consumers of refined wines, usually older people and those with good purchasing power. In general, this is the target audience for fancy wines, right? I am not generalizing and putting them in boxes, but more practically, it is not a part of the population that uses blockchain. I would like to understand more in depth how this adoption would take place. In other words, unfortunately I do not see this proposal as something that will guarantee a good return for Cardano, both because it is something extremely specific, a very unique niche, in which consumers need a good direction to use blockchain (if the author had better explained the user experience, maybe this issue would be clearer); both because I could not visualize, in practice, how Cardano would be used here.", "q0r": 1, "q1": "Explanations about the company involved, Intellics Engineering, are confusing. To begin with, they say they have experience in many very different areas, such as \"space technology, hotel systems and market industry\". How would it work in such diverse fields? What do they do with blockchain specifically? Have you ever worked with Cardano, or was it another blockchain? What is \"Industry 4.0 and IoT\"? It would be very positive if they had made a clearer definition of what their activities are, conceptualizing these different definitions that I mentioned last, in this way the understanding of the CAs would be much more solid as to who they are and what they do. Individually, the situation is much better, since they make the linkedin profile of their members available. With that we can get to know them individually, but that doesn't make up for the lack of knowing who would do what in this project. It would be necessary for them to clarify who would work here, developing which role and carrying out which activities. About the roadmap, we know which phases would be done and their respective costs (the funding requested would only cover the first phase). In the first phase, for example, the construction of the Dapp would be carried out, this would take 4 months and cost USD 35k. Right. But who would work here? The smaller tasks are defined, in fact, in the topic \"this phase will contain several important milestones\". This allows us to understand what would be done and in what order, as well as how long each activity would take. However, each topic could be detailed better, there is no way to fully understand the development of the project without knowing who would be responsible for each part, for example. The budget is explained in a somewhat superficial way, it is said how the money would be distributed, but each topic should also be more detailed. For example, 6k for marketing. It is said that some promotional materials would be made, such as pamphlets, shirts and publicity on social media. But in what way? What social media? How to reach the target audience? As in the marketing example, the other expenses could be better broken down. In summary, I think it's a little difficult to understand the activities of this company, but it's possible to get to know each stakeholder well; the roadmap is present and satisfactory, although not very detailed in some ways, as is the budgetary justification. The topic is well covered, just needing some adjustments.", "q1r": 4, "q2": "The proposal is admissible through the data provided in the KPIs part, I found it positive that these data are quite diverse and are not limited to just measuring the amount of products/transactions performed. But some parts could be better explained; for example, user satisfaction. How would that be done, would any research be carried out? And what research? Would the results be shared with the rest of the Cardano community, and if so, through which platform? In my view, however, there could be more KPIs directly focused on the benefits of the Cardano ecosystem. In other words, if new members were acquired for the community, if they are active, if they suddenly started other activities within the ecosystem beyond the use of this Dapp. In the \"Challenges/Risks\" section, some possible obstacles are outlined, and a good way of auditing the proposal would also be monitoring if such problems really happened and if they were resolved. All this data must be directly presented to the Cardano community, as it is a project that has several phases, an idea would be that there was a meeting at the end of each stage, to situate the community on how the development is going and the results already partially obtained. I believe this topic was well thought through by the author, but some tweaks would make it even better.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 27, "ne": 12, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Innovative solution to create an IoT-cork that transmits storage data on-chain to an app. By doing this, the owner can ensure better quality for wine. This could also impact insurance policies on shipments, which can decrease costs overall as there would be less loss of shipments and proof of transportation conditions in the data log. There seems to be a real opportunity to go broader with this in the future and extend this to shipments of all kinds, reaching a larger market. ", "q0r": 5, "q1": "The proposers have the engineering knowledge, but some details were not entirely clear to determine the feasibility of this project correctly. That is: how the cork works. Judging from the gallery images on the website, the cork will need to be replaced by this device in order to determining the climate of the bottle's interior. Could this re-opening of bottles impact product quality and will this bottle be regarded as a loss in a shipment lot? Clarification on this could improve the proposal. ", "q1r": 4, "q2": "The requested funds is reasonable as the proposing team intends to continue later phases of the project with generated revenue. There is a thought-out plan present in the proposal and several risks have been considered. What could improve the proposal further is an explanation of how potential clients would be reached. The marketing plan mentions various forms of advertising, but not how clients could be actively aproached like sending out agents or attending economic gatherings. Including more information on how this would be done would improve the auditability and assure how 100k clients could be accomplished within the first year of operations. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 26, "ne": 3, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "The proposal tends to a create an application to ensure quality authentication and real time monitoring of wine production to the consumers with specific attention to temperature monitoring with the view to confirm quality of the products to the end users. It is nice idea and it aligns with the campaign challenge which will definitely expand  the adoption and depth of the DApps ecosystem in Cardano including onboarding of more members.", "q0r": 4, "q1": "From the information provided, the team's qualifications and experience did not give me enough confidence that they can deliver this proposal. None of the team's experience in the winery business. In addition, the budget is not well detailed to justify the fund requested.", "q1r": 3, "q2": "The proposal main objective is create a Dapp and there is no mention of exact date to deliver this MVP. The KPIs mentioned is not related to this phase of the proposal.", "q2r": 2, "assessor": "z_assessor_9", "no_vca": 26, "ne": 2, "ng": 19, "nfo": 5, "vca_o": 1}, {"q0": "I’ve seen another proposal that is tackling wine and I’ll make the same comment here. The wine market size is enormous nowadays and its projection is to grow from USD 340,23B in 2021 to almost USD 0,5 T in 2028 (https://www.fortunebusinessinsights.com/wine-market-102836#:~:text=The%20global%20wine%20market%20size,6.06%25%20during%20the%20forecast%20period.). Therefore, it has a huge potential to those who enters in this market. Moreover, the e-retail is growing in a fantastic speed, the growth projection to 2022 is about USD 5,4 T in 2022 (https://www.statista.com/statistics/379046/worldwide-retail-e-commerce-sales/). Coming with all this growing environment, the e-commerce will start (and has started) to focus on quality as well, and here is where this proposal enters, guarantee of quality. If you be able to achieve just a fraction of this volume you’ll create a huge impact in ADA community.", "q0r": 5, "q1": "I really approve how this proposal was written, it brings all the confirmations needed (about the team’s capability).  Furthermore, the budget seems solid and it follows a reasonable timetable.\nHowever, I would like having a risk map more explored. I’m not talking about this phase specifically, but the whole project. E.g. how about the competitors? I do not think that there is someone using the same technology as you, however, since the big sells go inside containers or it needs some specific logistic business to provide the service, is there possible for them to guarantee the quality of the product during the transportation (implementing one temperature’s sensor inside a container, for example) in a cheaper way? The same with the warehouses and selling points. Of course your solution focus and guarantee the bottle, but there are some other products (meet, e.g.) which uses the batch quality.\nOne info that could be added is the expected (or real) price of the product and how much it is going to cost to wineries (to estimate how the price would change to the final consumer).\n", "q1r": 4, "q2": "I like the timetable however I do think it could be added some milestones (although the whole phase 1 is quite short).\nThe KPI provided is to the whole project, aiming to achieve 100K users and USD 100K revenue (are you going to raise USD 1 per user early?)\nIt could be added #wineries, #countries attended, #wines in the platform, #of grape, etc. (it would make the project more robust to those who are arriving in the platform).\n", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 23, "ne": 5, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "Отслеживание качества вина в режиме реального времени во многих контрольных точках цепи поставок, поддерживаемое решением на основе блокчейн-собственности и мониторинга.", "experience": "В течение последних 3 лет Intellics Engineering занималась блокчейн-продуктами и разработала множество систем для Industry 4.0 и IoT."}