{"id": 383537, "author": "game.changer.wallet", "title": "GameChanger: smart contract support", "url": "https://cardano.ideascale.com/a/dtd/383537-48088", "category": 26240, "amount": 9000, "description": "У GameChanger уже несколько месяцев нет кодового DAPP-коннектора. Шелли DAPP возможны, но необходима эра Goguen DeFi, использующая тот же JSON API.", "funded": 2, "upvotes": 111642694, "downvotes": 4112351, "votes_result": 107530343, "votes_cast": 676, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "Wallets are a crucial part of basic Cardano infrastructure and it is absolutely necessary to enable as many wallets as possible to support smart contract functionality. This is a basic requirement to have a user friendly dApp ecosystem.", "q0r": 5, "q1": "Given the team's past work and activities and the fact that GameChanger wallet is operational for some time now there should not be any problems with implementation of their plan. Plan is sufficiently thought out and presented, understanding of the subject is obvious.", "q1r": 5, "q2": "Everything necessary for auditing is basically there, although it would be nice to see more details, for example instead of \"increased number of pioneer users and DAPPs wanting to start integrating with GC\", I would prefer \"100% increase of pioneer users interacting with GC\". More concrete examples are very welcome with regards to auditability.", "q2r": 4, "assessor": "z_assessor_65", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "GC is a wallet with a lot of unique features including a json Dapp connector which needs integration into gougen era smart contracts.  The feature set of GC will make it uniquely powerful once this integration is achieved. ", "q0r": 5, "q1": "The team has produced GC without VC capital or token drops. They are highly qualified and motivated to improve the product. There is some uncertainty in the roadmap regarding the status of the PAB, but the goals are clearly defined and I anticipate the team will meet their goals. ", "q1r": 5, "q2": "The key features and goals are outlined clearly.  The budget is modest and funds one developer for 3 months. The KPIs will come primarily from wallet usage statistics. In 6 months time it should be easy to assess the ROI of the project. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 19, "ne": 2, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The proposal suggests providing an easy way for people to integrate and use smart contracts in DApps in a no-code environment within the GameChanger wallet. Improving user experience is a large part of what will help push crypto mainstream by letting people more easily interact with the DApps and services being built in the ecosystem. The proposal solution looks to further help within the ecosystem by helping educate developers on the technology involved. With both end users and developers potentially benefiting from this work there is a high chance the proposal could have a great impact in the ecosystem.", "q0r": 5, "q1": "Three team members are listed in the proposal all with their LinkedIn profiles added. There is experience from Emurgo a core organisation within the Cardano ecosystem and the main developer behind GameChanger which is an established wallet in the community. It is clear the team has the technical expertise and experience to execute against the proposal outlined. The budget breakdown is basic with little details added however the requested funds are also low so this is of minor concern. The key features and goals of this proposal are detailed and the timeline given sounds realistic given the teams experience.", "q1r": 5, "q2": "The proposal is clear with explanations on the current ecosystem around the PAB and how those factors influence the execution of this proposal. Relevant KPIs have been added. The main area for improvement would be around the work being open source and a Github repository for the work that has been implemented. Upon searching around the website a Github profile was hard to find, what was found was the following repository - https://github.com/BlockwideTeam/gamechanger-dapp-cli It would beneficial for the community if the wallet implementation was open source (it might be and I haven't found it) and then easily showcased in these proposals both for auditability and for education amongst the community", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Мы будем исследовать и добавлять поддержку смарт-контрактов, стремясь обеспечить самую простую возможную интеграцию DAPP, чтобы помочь строителям и студентам.", "experience": "GameChanger Finance обеспечивает большую ценность благодаря кошельку нового поколения и dapps, объединяя вкладчиков Gimbalabs, Dandelion и Yoroi."}