{"id": 384087, "author": "richhuth", "title": "Cardol.io - Portfolio Tracker", "url": "https://cardano.ideascale.com/a/dtd/384087-48088", "category": 26240, "amount": 25000, "description": "Экосистема Cardano разрастается все больше и больше. Становится все труднее легко и эффективно отслеживать свои активы в новых проектах", "funded": 1, "upvotes": 50854191, "downvotes": 9366918, "votes_result": 41487273, "votes_cast": 266, "f6_no_assessments": 8, "f6_rating": 4.458333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Авторы проекта хотят создать инструмент, который будет выступать в качестве портфельного менеджера для всех активов кардано, включая NFT, и строить на его основе премиальный опыт. Это слабое место экосистемы cardano в настоящее время, потому что ей не хватает обычных dapps, которые есть в других цепочках. Это принесет большую пользу и вызовет радость в сердцах кардановцев. Существует четкая дорожная карта, которая добавляет растущую ценность экосистеме кардано. Ключевые показатели не только важны, но и реально существуют. Многие проекты пренебрегают KPI, что очень жаль. Метрики, заложенные в этот проект, кажутся релевантными, если говорить как разработчик и обычный пользователь cardano. Предложение сможет масштабироваться без проблем, авторы учитывают и ожидают будущего роста, что замечательно. Я не вижу ничего недостающего в этом предложении, поскольку оно короткое, но сделано очень хорошо. Это один недостающий кусочек головоломки, и за него нужно проголосовать ИМХО.  Удачи Ричарду Хуту и Мишель Брукс!", "q0r": 5, "q1": "Нет недостатка в доказательствах, связанных с полномочиями Ричарда и Микелеса. Они подтверждают то, что указано в предложении. Команда создана и уже работает. Это то, что я хотел бы услышать как будущий инвестор в их начинание. Бюджет четко распределен и имеет смысл по сравнению с работой, которую необходимо выполнить. Предлагается реалистичный график выполнения работ. Я буду следить за ходом реализации этого проекта. Есть разумный план реализации, хотя мне бы хотелось, чтобы он был немного более техническим или хотя бы имел ссылку на место, где описывается архитектура.  Технические аспекты интересны мне как разработчику, но я понимаю, что они ни в коем случае не являются обязательными. У авторов есть план потенциальных рисков и проблем, которые они должны уметь преодолевать, и, судя по тому, что я читал в проекте, они это сделают, потому что они к этому готовы. Мне нравится, что у авторов проекта есть план самофинансирования, и они не будут полагаться на финансирование со стороны сообщества в течение длительного периода времени. Это очень важно, так как показывает, что они планируют будущее и планируют развиваться.", "q1r": 5, "q2": "Проект уже запущен и работает некоторое время. У него есть твиттер, а также несколько других мест, где любопытные кардановцы могут следить за ходом проекта. В твитах упоминается прогресс проекта и выполняемая работа. Предоставленные метрики имеют отношение к успеху предложения, а также предоставлено четкое \"определение успеха\", которое также имеет отношение к делу. Да - разумная дорожная карта, этапы и выполнимые временные рамки для достижения всех упомянутых в проекте целей.   Четкая и понятная постановка проблемы и ее решение.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is a great and complex implementation that could improve adoption and usability on cardano blockchain,  beacuse Wallet app is a huge pain on all newbie ADA holders. The proposal articulates how it will add value to the Cardano ecosystem and for the stakeholders (in deep detail for users, professional and so on.. ).\r\nAs a SPO I think that any Cardano delegator want to see his wallet asset rappresentation and market value in simplicity and instantly.\r\nAt the same time the statement of how problem is to be solved is well being specified with implementation and with revenue model, definition of success that support economic model.", "q0r": 5, "q1": "The proposer team is very well skilled about the whole context and, knows the Cardano community very well because they work as developers and there is a functional pilot (Emurgo Cardano dev).\r\nThe scope of the solution is well explained (e.g. how the funds will be spent, what features will be implemented, and so on…).\r\nIn my opinion (I'm 20 years experienced senior information manager on financial sectors) the budget requested is coherent with the elapsed.", "q1r": 5, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, with  KPI metrics that are shown. It's good that is that the proposer has briefly mentioned possible difficulties and how to deal with them (e.g. competitors, delay,…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 32, "ne": 7, "ng": 17, "nfo": 8, "vca_o": 1}, {"q0": "Great idea and vision for the project. Dashboards like this are needed because the cardano space is becoming more and more complex, being able to simplify and manage data is becoming more important for everyone.", "q0r": 5, "q1": "The team and their items are promising. One thing I would re-commend is to talk a bit about privacy. How will the portfolio data be stored? I know for myself I would not want to disclose my holdings to an app that could easily be breached. ", "q1r": 4, "q2": "Roadmap, milestones, and plan all seem good to me. It helps to see some prototyping and initial website to help solidify the ideas here.  ", "q2r": 5, "assessor": "z_assessor_119", "no_vca": 29, "ne": 1, "ng": 19, "nfo": 9, "vca_o": 1}, {"q0": "The idea is very good and proposal is well-strucutred, with a clear problem statement and solution. It also does address the challenge as a new Dapp would be developed and potentially attract new users - and make the life of the existing one much easier.\r\n\r\nHaving a dashboard to track figures and prices is essential in any investment enviroment. It facilalte the life of those who have assets, assisting also to make correct and fast decisions.\r\n\r\nHowever, as mentioned in the proposal, there other apps that that track assets. If these players decide to include Cardano asssets as well, I see the impact of this project decreasing a lot. \r\n\r\nI particularly liked it states the intended business model ahd the launch will be divided in phases.\r\n\r\n", "q0r": 4, "q1": "The project is already ongoing (halfway through), was funded in F6 and the proposer seems to have enough exeperience.\r\n\r\nPlan is sensible and time-framed.Budget breakdown is clear though the project is a bit expensive.", "q1r": 5, "q2": "There are clear milestones and time-framed metrics with targets. \r\nThe risk management part is also well done,  my main concern here would be the competition risk though. the mitigation strategy is a bit vague on what they intend to do in case these apps include cardano assets in their portfolio. More compettive differentiation would have to be offered", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 18, "ne": 2, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "With the launching of dApps and other Defi applications in Cardano there will be a requirement for portfolio aggregators and managers. Therefore there is a use-case for such sites in Cardano. ", "q0r": 4, "q1": "The proposers have a combined experience of more than 10 years and they have rightly identified a monitisaton plan for sustenance of the website. It looks viable and will contribute to the richness of the ecosystem. They are likely to be technical hurdles and there is a need to have a team to support the long-term plan. ", "q1r": 4, "q2": "The project has competitor patterns and templates to emulate or to better; therefore, there is a benchmark for comparison. The budget breakdown is not detailed, and there is a need for more explanation utility token and the stakepool. The cost for development and maintenance till Defi assets are created in Cardano is also not clear in the proposal. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposer covers one of the pain point of tracking our portfolio in Cardano Ecosystem, especially CNFT which will benefit for many.", "q0r": 5, "q1": "The team was transparent and state the fact about the challenges they might facing along the way.  It has a clear phases and plan, But it lack alternate solution for mentioned risk such as Delays - hire more team? collaborate with others within the community? \r\nReally appreciated the honesty how hard it is to juggle and run a self-funded project, but they need to plan the solution when it happen. ", "q1r": 4, "q2": "The propose state a clear metrics for success including how the community can track the progress through available medium, but lacking a project tracker in details.", "q2r": 4, "assessor": "z_assessor_646", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is a great idea. The execution part of Phase 1 have been completed through self-funding and Phase 2 is already in progress. Though, it would be great if the proposer could share the wireframes of the platform. Moreover, the proposal does fit into the challenge where it adds value to existing users and will definitely attract new users. Portfolio tracking is useful for many investors or even new investors to manage their respective assets in the ecosystem. The proposer has also mention to include great features when the users stake in their pool which I think would be a good incentive on both the SPO & delegators. This will have great impact as an innovative utility in the Cardano ecosystem. Therefore I am giving this proposal a rating of 5. ", "q0r": 4, "q1": "The proposer team states that it has the necessary experience and have also given links of references. In addition, risks are clearly defined and how their success have been measured with clear key points. The proposer have also given their long-term vision that I feel is important for the success of any proposal. They have also mentioned that the tokenomics of their token OLIO will be coming soon, also their beta of the portfolio tracker in December of 2021. I am giving this a 4, as I feel that the proposer could also add applications that have existed on other ecosystem as reference of this proposal.", "q1r": 4, "q2": "The proposer provides a clear roadmap for the implementation with clear milestones, risks and a defined time horizon. There are also several metrics that measure the success of this project. Also, the proposer have clarify the budget allocation and cost breakdown in a reasonable manner. ", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 17, "ne": 4, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The project aims to deliver a browser interface to address the growth of Corona holders with multiple NFT related info and other tokens. All the planned features will be consolidated into one single simple web-based application. Despite the project listing several risks analyses. Still, I believe the team should provide a certain degree of clarity and assurance when users install and use your program, so – did your codes, and the application would be audited independently, for instance.", "q0r": 4, "q1": "The project is divided into five phases and has already completed phase 1. With the team experiences listed, the project progress already being started, and the complete work breakdown structure for the entire project life provided, the project is likely to deliver per timeline. The team should also compare and do a small analysis on the currently available products or applications that possibly have a similar function and feature as your application.", "q1r": 4, "q2": "Information on what to do for each phase is provided explicitly, with the detailed breakdown clearly down to Q3 2023. Details of how a $25,000 was requested for this project have also been listed. I have high confidence in the team with a clear mandate to deliver the project and the challenge team members easily to follow and report on the project progress.", "q2r": 5, "assessor": "z_assessor_726", "no_vca": 15, "ne": 4, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Создайте консолидированную приборную панель для отслеживания портфеля ADA, нативных токенов и NFT в различных dapps и проектах, с которыми интегрировался пользователь.", "experience": "RH: Fullstack-инженер, ранее руководил Cardano stakepool и в настоящее время участвует в программе EMURGO Cardano dev program\nMB: Информационный дизайнер и инженер по данным"}