{"id": 384550, "author": "viktormux", "title": "DLT & AI for Transport & Logistics", "url": "https://cardano.ideascale.com/a/dtd/384550-48088", "category": 26240, "amount": 10000, "description": "Повторяющиеся устранимые недостатки в работе транспорта и логистики, вызывающие задержки, дополнительные расходы и выбросы загрязняющих веществ.", "funded": 0, "upvotes": 17316812, "downvotes": 18011458, "votes_result": 694646, "votes_cast": 144, "f6_no_assessments": 8, "f6_rating": 1.708333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Процветание сосредоточено на проблеме устранимой неэффективности в транспорте и логистике, предложение состоит в том, чтобы объединить ИИ и DLT для снижения неэффективности. Dapp, который сможет это сделать, будет полезен для экосистемы и для транспортных систем доставки. Предлагаемая идея предполагает создание рыночной системы обмена грузоперевозками, однако в предложении не определено, как будет реализовано решение. В постановке задачи выделены три различные широкие цели: задержки, дополнительные расходы и загрязняющие выбросы, однако в предлагаемом решении не описано, как эти проблемы будут решаться.\r\n\r\nНеясно, как они будут использовать ИИ и DLT в совокупности для улучшения логистики и транспорта. Например, ИИ - довольно широкое понятие, будут ли они использовать рекуррентные нейронные сети, например, сети LSTM (долговременная кратковременная память) или метод линейной регрессии для поиска оптимальных маршрутов. Необходимо также четко определить, что означает DLT. Предложение выиграет от сотрудничества с организацией, которая сможет сформулировать, как ИИ будет использоваться в задаче, как DLT и ИИ будут сочетаться и какую пользу это принесет. Однако предложение выглядит так, как будто оно хочет оказать положительное влияние на сообщество Cardano/Catalyst, возможно, им стоит поискать возможность создания партнерства в следующем раунде финансирования Catalyst.\r\n\r\nВ предложении не указаны контуры успеха или KPI, это может быть количество пользователей платформы, сделки Ada на бирже грузоперевозок, экономия времени при использовании платформы или количество партнеров, заинтересованных в подписании на этап тестирования концепции. Соображения о том, как решение может быть масштабировано в будущем, например, как будет происходить вывод продукта на рынок в случае успешной разработки.\r\n\r\n", "q0r": 2, "q1": "Компания Cargonetwork, безусловно, обладает опытом в сфере транспорта и логистики и может дать ценное представление о том, как любая система искусственного интеллекта может повысить эффективность логистических перевозок. Однако в сфере разработки программного обеспечения и ИИ не хватает опыта, что означает, что им потребуется нанять новых сотрудников или вывести эту часть проекта.\r\n\r\nВ плане должно быть указано, как будут достигнуты результаты, какие навыки необходимы, а также бюджетные ассигнования на рабочие элементы, однако это не было добавлено в предложение. Возможно, создание дорожной карты результатов, демонстрирующей, как будут потрачены $10 000, было бы ценным, это улучшило бы ясность в деталях реализации.\r\n\r\nУчитывая, что стоимость создания любой системы искусственного интеллекта, вероятно, превысит $10 000, предложение, скорее всего, быстро превысит бюджет, и Cargonnetwork не указала в предложении никаких смягчающих мер или рисков. Нет никаких сроков, когда решение будет архивировано, поэтому трудно сказать, может ли оно быть реализовано в заданные сроки.", "q1r": 2, "q2": "Неясно, как будет проверяться прогресс проекта, ключевые показатели эффективности, на которые обращено внимание в кратком описании задачи, ищут измеримые цифры роста, такие как достигнутые пункты дорожной карты, полученная прибыль, измерения роста, интеграции с существующими клиентами или новыми клиентами. В предложении не указано, как сообщество может отслеживать прогресс, будь то на своем сайте, в публичном хранилище Git, новостях, блоге или социальных сетях, что затруднит определение успешности проекта. Однако у них есть блог на сайте: http://www.cargonetwork.es/blog/, но он не обновлялся с 2014 года и, похоже, не имеет широкой аудитории.", "q2r": 1, "assessor": "z_assessor_332", "no_vca": 15, "ne": 10, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "This is a draft proposal of 120 words without any attached document. They request $10k to build a DLT with AI applied to logistics and transportation.\r\nUnfortunately we are not given any detail on how and what they plan to do.\r\nFrom the comments it appears that the team was looking to join with other people from the Cardano community and bring their own field experience to build something of real use. We can only advise them to continue seeking through more means that just the Catalyst project, such as the Cardano forum, and other known social platforms.\r\nI give only 1 star since there is nothing to be funded as of now but I really encourage the team to continue.", "q0r": 1, "q1": "The experience is given through a company website operating since 2005 in logistics and transport. This is a good start but this is only half of what would be required to build something using blockchain and AI. The team should seek experts in these fields and have them join their proposal.\r\nI can only give 2 stars in this criterium since we do not have enough details but the actual experience in the field is a very good start.\r\nIt would have been interesting to have more information related to the inefficiencies mentioned in the problem statement and how blockchain and AI could be used to remediate them.\r\nTo draw in developers and engineers you need to give them an interesting problem to solve.\r\n", "q1r": 2, "q2": "This is only a draft proposal, a request to build a team but not a real proposal yet. So only 1 star.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "There is a market for \"Fright Exchange\" where the people requiring Transport can find the best available operator in a decentralized manner. The proposer wishes to engage with the Developer community in Cardano to create an AI model for his experience. This is a good use case for decentralized apps. However, there are a large number of unknowns in the proposal and a more clear ideas will be required. ", "q0r": 4, "q1": "The proposal is to \"put our expertise in the Transport and Logistics sector at disposal in order to build a work team together with the Cardano community.\" this i under stand is to connect with Cardano developers and build a \"Fright Exchange\" by offering their experience. The plan is in the early stages. The is a requirement to identify developers interested in this and find an estimate for the work involved. 10K USD looks to be on a very conservative side to do anything meaningful in this area. ", "q1r": 3, "q2": "The proposal is in idea form and needs a throughout the plan to estimate its suitability.  The fund estimate has not been justified with rationale and looks very less for the work involved in building any sort of value exchange software in Cardano. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been active in project Catalyst since fund 4 and I have experience analyzing business requirements from over 5 years of delivering software solutions for small business and corporations as well.\r\nThe problem statement is relatively clear, but to make your proposal more impactful, you could have mentioned an example of such an avoidable inefficiency. That would have helped give the voter a clear practical view of something that isn't working right.\r\nThe solution, unfortunately, is very vague in my opinion. First of all, I would suggest that if you use acronyms in the problem statement / solution, then you immediately explain them below, where you can, because lots of voters are not familiar with blockchain and tech terminology in general and you want to reach as wide an audience as possible. Second, I do not see a solution outlined, only a general statement on how Distributed Ledger Technologies and Artificial Intelligence \"are meant to improve logistic and transport operational processes\". We would have needed to find out how you would use these technologies to do this.\r\nIn the detailed plan it is mentioned that the project would like to create a Managing System and a Freight Exchange and make them interoperable, but it does not mention how this would be done, nor does it give an example of how the product would look at the end and what the use case is here (or the targeted audience). I strongly disagree that this proposal effectively addresses the challenge, as it fails to specify what exactly it aims to do and there are no KPI's or a concrete plan here.", "q0r": 1, "q1": "The proposer has only mentioned that they are operating since 2005 at CargoNetwork, a Transport & Logistic solutions company in Europe, but they have not mentioned in what capacity. No information is given either about a team or who the people with the necessary tech skills to build these products are. Please note that it is necessary to add credentials which specify this information, so that ADA holders can understand who will be working on this.\r\nDue to the missing information that I mentioned above, as well as no breakdown of the budget or details on how it will be allocated, no risk analysis and no plan outlining the technical approach, I have to disagree that this proposal can be implemented successfully. Please note that this is all crucial information that you need to add to a proposal.", "q1r": 1, "q2": "I strongly disagree that the information here is sufficient for this proposal to be auditable, or clear to understand. It needs to clarify what it wants to do and it needs a roadmap of how it will do it, as well as KPI's to help track its progress.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 18, "ne": 6, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "\"Logistic and transport are always a real issue that blockchain can apply and make huge changes. Therefore, a solution for blockchain development in the field of Logistic and transport is definitely a solution that has a great impact on the development of Logistic and transport.\r\nBut for this proposal we need more than just an idea to be able to implement in practice.\r\nHope to see the team add the necessary information such as: what are the features of this solution? Who are the customers using them? What is the implementation plan?\"", "q0r": 2, "q1": "The CargoNetwork where the proposer works is a logistics and transport company. This is very suitable for the implementation of this proposal. But the lack of specific product description, plan, roadmap, and work assignment for members is a barrier that makes the proposal unfeasible.", "q1r": 2, "q2": "As mentioned in the other sections, there is limited information about what this plan is concretely going to deliver and therefore would make it almost impossible to know what success measures or any other metrics could be use to track and follow the progress of this proposal.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 0, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "The proposal is not reliable because there is almost no detailed content: no plan, detailed PKI. The writer has not given a specific technological solution. While the problem they mentioned is DLT & AI - are two areas that require very technical expertise. Therefore, I do not really agree with the too sketchy content that they have presented here for funding.", "q0r": 2, "q1": "In my opinion, I don't really feel the seriousness of this project, they almost don't present anything, there is no identity of the working team. If your team wants funding, work responsibly and hard at it, and prove you're worthy of support. I doubt the feasibility of this project.", "q1r": 2, "q2": "DLT & AI is a difficult area for most of the community. Through public code, only a few people who work in depth of code can participate in testing. Moreover, it is important that the working group is not detailed enough. So I doubt if I appreciate this project.", "q2r": 1, "assessor": "z_assessor_648", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This proposal focuses on combining DLT and AI to dramatically improve logistic & transport operational processes. This idea is great but it seems that this proposal is incomplete. Conceptually, I think it has a certain fit for the challenge and the logistics sector. In case this proposal needs to be completed in the future, the proposer should pay attention to: (1) Clarifying plan retribute development; and (2) What are expected advising services ?. Based on the given information, I can not agree with this proposal's impact and would give it a score of 2.", "q0r": 2, "q1": "This proposal comes from an organization - CargoNetwork (from the Logistics sector), so from the perspective of logistics, the feasibility can be seen, however, in terms of AI and technology, I am not convinced. As mentioned, the idea is great (combining AI and Logistics). However,  it's difficult to evaluate how feasible an incomplete proposal would be. Therefore, definitely, there is no ground to agree on the feasibility of this proposal, however, if I had to give one piece of advice, I think the team should focus on finding a partner in the AI technology sector [SingularityNET, for example] for completing this idea [with (i) Goals and target; (2) road map (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge]\r\nBased on the given information, I disagree with this proposal's feasibility and would give it a score of 2.", "q1r": 2, "q2": "Since this proposal is incomplete, auditability can not be guaranteed. Therefore, I don't have much advice, except that: the proposer needs to pay attention to the principle: judgment, information must be correctly associated with evidence and documents. Based on the given information, I strongly disagree with this proposal's auditability and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "Improving and widening the use of the Cardano blockchain in the transportation and logistics sector could both be very impactful endeavours. But it's very unclear from the proposal in its current form how and what would accomplish this and what are the goals of the team. A clearer implementation plan and more details would be required to fulfil the vision outlined in the proposal. As the field could be impactful for the general adoption of Cardano and I would recommend resubmitting the proposal to a future fund with a clear roadmap, KPIs, a detailed budget and a clearer description of the project goals.", "q0r": 2, "q1": "The proposal's objectives in its current form seem to be networking with the Cardano community and figuring out ways to better integrate Cardano in the transportation and logistics sector. This in itself is a very good idea, but I don't see why treasury funds need to be involved. \r\nOther than that, the exact objectives of the proposal remain unclear in the current iteration of the proposal.\r\nRework and resubmission are advised.", "q1r": 2, "q2": "As no metrics, no clear roadmap is provided, and no planned deployment date is mentioned, I would strongly recommend including these in any future iteration.\r\nI would have liked to see a clearer explanation of what exactly the team would like to implement, even if in broad terms at the moment, and how they think their short/medium & long term goals can be achieved.", "q2r": 1, "assessor": "z_assessor_681", "no_vca": 14, "ne": 2, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "DLT и искусственный интеллект в сочетании призваны значительно улучшить операционные процессы в логистике и транспорте.", "experience": "Работает с 2005 года в CargoNetwork, надежной компании, предоставляющей решения в области транспорта и логистики на европейском рынке."}