{"id": 385002, "author": "realjosiah", "title": "Thrift Mobile Wallet", "url": "https://cardano.ideascale.com/a/dtd/385002-48088", "category": 26240, "amount": 16420, "description": "Отсутствие кошелька, ориентированного на сбережения и финансовое здоровье через DeFi, ориентированного на развивающиеся страны. Токен THRIFT.", "funded": 1, "upvotes": 35098440, "downvotes": 14037356, "votes_result": 21061084, "votes_cast": 206, "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "Проект хочет создать мобильное приложение - кошелек для сохранения и обработки всех транзакций ada вместе с метриками и полезной информацией. Мне нравится идея о том, что экономия означает предвидение, я согласен с этой оценкой, поскольку, как сказано в предложении, бывают хорошие и плохие времена, и нам нужно готовиться к обоим. Предложение находится в правильной постановке задачи по созданию приложения для использования сообществом. Этот проект принесет пользу сообществу кардано в целом, а поскольку они планируют, что мобильное приложение будет простым и легким в использовании, они могут привлечь и сторонних участников. KPIs соответствуют стоящей перед ними задаче, и как разработчик я считаю, что уровень детализации технической реализации заслуживает восхищения. С описанной командой я не вижу проблем с масштабированием в будущем. Я уверен, что все задачи будут решены. Возможно, мне бы хотелось, чтобы авторы больше смотрели на то, что уже сделано, и использовали это, вместо того чтобы строить все снизу вверх, но оба подхода имеют свои преимущества. Я не вижу недостающих необходимых частей из перечисленных в предложении.  Как у разработчика у меня нет никаких опасений по поводу этого предложения, и я призываю людей проголосовать за него.", "q0r": 5, "q1": "Есть много ссылок на linkedin, которые я обычно ищу в любом случае. Если имена указаны, первое, что я бы сделал, это поискал их в Линин. Мне нравятся те, кто поддерживает свой проект своим именем. Это повышает доверие к проекту в моих глазах избирателя. Члены команды уже сгруппированы и работают, поэтому я бы сказал, что тип и количество, необходимые для реализации предложения, проверены. Бюджет можно было бы разбить на почасовые ставки, чтобы было легче сравнивать с другими подобными проектами, но в остальном все хорошо расписано, куда пойдут деньги. Предложенный график кажется мне, как разработчику, реалистичным для выполнения описанной в предложении работы. План реализации более чем разумный, он конкретный. Для тех из нас, кто прочитал 40+ предложений, редко можно увидеть столько технических деталей, перечисленных в предложении. Будучи сам техническим специалистом, я могу оценить усилия по описанию архитектуры и технологий, которые будут использоваться. Мне нравится, что есть фотографии того, как будет выглядеть возможный дизайн реализации. Это дополнительные усилия, которые нравятся членам сообщества, потому что им легче представить, будут ли они использовать такой кошелек на ранней стадии.  Упоминаются некоторые возможные проблемы, а также процесс, которому команда будет следовать для их преодоления. Люди с таким большим опытом не должны испытывать проблем с решением задач. Единственное небольшое замечание, которое у меня есть, - это отсутствие исследования того, что уже существует и может быть использовано повторно, но это не так уж важно, поскольку каждый разработчик, работающий над чем-то новым, приобретает новые навыки, и чем меньше повторно используемого кода, тем лучше становится разработчик. Так что это своего рода инвестиция в будущие проекты, над которыми будут работать разработчики. Удачи вам и вашему предложению на этапе голосования!", "q1r": 5, "q2": "Как сообщество будет отслеживать прогресс проекта? Это один из вопросов, который я задаю себе, и авторы не разочаровали и здесь. Каждые две недели в социальных сетях будут появляться обновления о ходе реализации проекта, и это здорово, что это прямо обещано и упомянуто в проекте. Многие авторы предложений не уделяют должного внимания доступу сообщества к информации о ходе проекта. Упомянутые KPI являются релевантными и описывают успех предложения, если они будут достигнуты. Я не увидел таких показателей, как коэффициент принятия, загрузки приложений и т.д., что несколько разочаровывает, поэтому я бы предложил команде добавить их в будущие предложения. Полезно сравнить свои ожидания с реальностью. Была предоставлена разумная дорожная карта и этапы, а также временные рамки для работы над всеми необходимыми описанными задачами. В предложении была указана четкая проблема и соответствующее ей решение.   В целом я считаю проект проработанным, но если они смогут добавить канал для получения обратной связи от сообщества в виде discrord или telegram chnnel, это будет полезно для обеих сторон.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "It is a nice idea to provide some financial education to the people using some savings and costs analysis implemented in the wallet, yet I am not strongly convinced that it will be as successful as predicted.\r\n\r\nTo boost this, it would be nice to see what current wallets are missing and what your wallet will offer that will shift them or attract new people to it. Right now, I feel that there are too many wallets and I think if the only feature would be savings and costs analysis, staking...I do not see a large impact on cardano adoption (which is a challenging goal).\r\n\r\nYou would have to come up with something breaking, but you are facing a large competition. Cardano has already multiple wallets if I am not mistaken.\r\n\r\nRating 3.", "q0r": 3, "q1": "Given the experience and detailed roadmap, I believe that they have a solid idea of how to finish and implement the final product. \r\n\r\nRating 5.", "q1r": 5, "q2": "I am strongly convinced that their progress and the final output can be easily audited -\r\n\r\nwe can audit the progress\r\nwe can audit the final product\r\nwe can audit and measure the number of users\r\netc.\r\n\r\nDetailed KPI provided\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "I believe this proposal effectively onboards new users that aren't typically engaged in defi to the Cardano blockchain, which fits the challenge category well.\r\n\r\nAlthough there are many mobile wallets already competing for this title, this one seems to be targeting Africa, which may give it a local advantage verses wallets more tailored to western audiences. This could fill a very important purpose of onboarding those users better and more seamlessly.", "q0r": 4, "q1": "The proposing team consists of a Plutus Pioneer who has founded previous IT and blockchain startups, and has been working to bridge the traditional financial world. Other team member includes a developer with significant experience in the Cardano ecosystem. \r\n\r\nI think based on the team, and prior works combined this will produce a favourable outcome for both the proposal and project catalyst itself. The plan is very details and includes specifics such as which functions are to be finished and delivered into the end product. This gives me high hope that they will be successful with this proposal.\r\n", "q1r": 5, "q2": "The roadmap really looks fantastic, sensible yet worthy milestones and you have the KPIs listed for the milestones. The detail you have added to the roadmap makes it easy to audit and verify the relative success of the proposal!\r\n\r\nThe team also plans to update their socials every two weeks in order to stay accountable to the community, in addition to the detailed roadmap included.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 16, "ne": 2, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The implementation of a savings wallet is well placed within the challenge and if successful will clearly bring value to the Cardano ecosystem as a whole.", "q0r": 5, "q1": "The team is clearly defined with LinkedIn links and relevant experience of all members provided. The funds are clearly broken down and reasonably allocated. The plan is clearly presented and it is nice to see they are thinking of possible failure points even if none are currently apparent.", "q1r": 5, "q2": "The roadmap is well defined and a large list of auditable KPIs are provided with bi-weekly status reports promised therefore this tells me the project success will be easily auditable.", "q2r": 5, "assessor": "z_assessor_745", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "It seems like a good proposal to me, because today there are many people with difficulties managing their expenses and they cannot find a way to save for times of emergency or when they really need that financial help to solve a problem.\r\nFinancial health is increasingly important in a world where the economy is the basis of everything and I believe that this project can improve the quality of life of many people.", "q0r": 4, "q1": "A team with so much experience has no doubt that it will guide a project that can be developed successfully in the future.\r\nIn addition, that the savings plan is personalized may attract users.\r\nI am missing a detailed explanation of the steps to follow to achieve the objective to be able to decide if this project, indeed, will be successful.", "q1r": 3, "q2": "I think there is a lot of information lacking on the method to achieve the objective and that expanding it would be important to attract investors.\r\nAfter reading the proposal I have continued with the doubt of how to carry it out.\r\nAlthough I support the idea, I think a more detailed explanation is needed to be able to rate it as really good.", "q2r": 2, "assessor": "z_assessor_829", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Разработать удобный для пользователя мобильный кошелек с финансовым интеллектом, чтобы стимулировать принятие Cardano через сбережения и открытые децентрализованные финансы.", "experience": "Наша команда имеет 35-летний опыт работы в области блокчейна, финансов, машинного обучения, бизнес-аналитики, африканского бизнеса и больших данных."}