{"id": 385120, "author": "adosiawolf", "title": "P2P Manufacturing with Adosia IoT", "url": "https://cardano.ideascale.com/a/dtd/385120-48088", "category": 26240, "amount": 40000, "description": "Производство централизованное, требующее больших накладных расходов на транспортировку, что негативно влияет на окружающую среду.", "funded": 1, "upvotes": 42600128, "downvotes": 17746744, "votes_result": 24853384, "votes_cast": 247, "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Это интересное предложение по развитию экосистемы Cardano путем применения платформы IoT P2P, NFT drop и смарт-контракта Cardano для рынка, разработка dApp поможет развитию экосистемы Cardano. Если это предложение будет финансироваться и управляться правильным образом, оно будет хорошо развернуто и принесет пользу реальному миру и полезность Cardano, поэтому оно будет поддерживать следующие разработки и инициативы, как того желает автор. Я думаю, что это предложение имеет хорошее влияние на экосистему Cardano и сообщество.", "q0r": 5, "q1": "На первый взгляд, содержание предложения очень короткое, без достаточной информации о команде и доказательств работ, но после прочтения ссылки на linkedin, Adosia White paper и Github Adosia, я понял специализацию автора и работы, выполненные командой. Но мне не хватило ссылки на подробную информацию о членах команды и сотрудниках.  Кроме того, я не смог найти в этом предложении информацию о Куинне, интересно, работает ли он с вашей командой, играя важную роль на рынке смарт-контрактов Cardano, и почему он не в вашей команде, а только хлопец.\r\nЖаль, что автор предложения не разбил бюджет на идентифицируемые статьи, такие как: сколько членов команды будут использовать различное оборудование 3d принтера, сколько времени это займет с зарплатой рабочего часа для каждого члена,... Если это будет четко изменено, я думаю, что целесообразность этого предложения будет высоко оценена сообществом.\r\nЯ думаю, что 12 месяцев - это реалистичный график для рынка, но хранение тысяч дизайнов и сотен операторов 3d принтеров будет сложной задачей, если автор предложения не подразумевает маркетинговую стратегию, поэтому бюджет на маркетинг также необходимо учитывать.\r\nЧто касается технологического аспекта, я считаю, что эта IoT платформа основана только на Wi-Fi соединении, и это нормально на данный момент, но было бы лучше, если бы автор добавил некоторые дополнительные средства, такие как сотовая сеть (3G/4G/LTE), Lora, RFMesh, ... для динамического размещения аппаратного блока в некоторых областях.\r\nВ этом предложении не указаны проблемы/риски, такие как сложность/качество продукции 3D принтера не может удовлетворить спрос конечных пользователей и способы их снижения/изменения.\r\nВ заключение, я все еще считаю, что это предложение может быть успешно реализовано, если оно будет управляться правильным образом.", "q1r": 4, "q2": "Аудируемость этого предложения недостаточно хороша для легкого отслеживания сообществом, и автору предложения необходимо внести изменения в него, потому что он не предоставил измеримые метрики или KPI для оценки определения успеха. Было бы хорошо, если бы автор предоставил подробные метрики, например: через 1-2 месяца после финансирования, создание front end для marketplace, в следующие 2 месяца создание аппаратной сети 3d принтеров внутри команды и т.д.\r\nУчитывая потенциал и работу команды, я думаю, что дорожная карта и этапы в течение 12 месяцев вполне жизнеспособны.\r\nВ целом, я ни согласен, ни не согласен с проверяемостью этого потенциального предложения и надеюсь, что автор предложения уделит этому больше внимания.", "q2r": 3, "assessor": "z_assessor_777", "no_vca": 14, "ne": 9, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The project is great. ADOSIA is one of the few Cardano community members dealing with tangible products (like their ag devices). Perfectly matching the Challenge. Integrating digital (blockchain+internet), and physical technology  Normally, a 5 star rating.  However, this rating is 4 starts. Only because the impact of this proposal depends on adoption by two niche groups of customers: People interested in operating 3D printing services as a business (part time or full time) PLUS customers for those kinds of services. So significant impact might take quite a while. But it will come as 3D printing becomes more mainstream.", "q0r": 4, "q1": "ASOSIA's demonstrated performance in the real world building devices, even before CARDANO tells me they can complete the tasks they have proposed to complete. They exist with or without Project Catalyst funding. Different from so many other proposals which have  no life without Catalyst funding. And if unable to produce what they promise, go on to something else. Not ADOSIA. for that reason 5 stars. ", "q1r": 5, "q2": "The whitepaper, links and the Adosia.com website provide all of the needed information to fully grasp the essences of the proposal which when combined with  what is described or explained in the text of the proposal clarifies the proposal. But I did have to use all the sources that were provided. If others do not, they might miss the full understanding. The information is there.", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 18, "ne": 4, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Interesting idea to decrease the shipping and protect the environment by IOT 3D Pritning, If the demand would be high - which I assume will be increasing over time - it can serve as a place not only for solo entrepreneurs but also companies for marketing and sharing via web.\r\n\r\nI think that on a scale 1-5 this can potentially impact cardano on 4. \r\n\r\n\r\n", "q0r": 4, "q1": "the linked in profile is posted, and the website is already running. I have a strong belief they can deliver, yet it would be nice to see more information about the team to increase the creditability. \r\n\r\nI find it strange that the team is 20 members at the top and then15 members below. This would require more clarification and detail about what does it mean. \r\n\r\nrating given 4.", "q1r": 5, "q2": "the progress and the overall product can be audited, yet this information is missing in the proposal, but I can imagine how it would work:\r\n\r\n1. code and interface progress\r\n2. number of users\r\n\r\nBut it would be nice to have it stated.\r\n\r\nThe roadmap is provided in reasonable detail.\r\n\r\nRating given 4.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is accurately placed within dApps and integrations and successfully highlights a problem and solution whilst bringing value to the ecosystem through a functional marketplace. ", "q0r": 4, "q1": "The team seems to hold the requisite experience  however I would like to see more of the team listed to fully prove this. The funds requested seem reasonable however as it is a large amount I would like to see a more detailed cost breakdown in the future.  and so I can only agree", "q1r": 4, "q2": "The roadmap laid out is reasonable and well spaced however there are no KPIs referenced and. It would be great to see hard figures that can be measured.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "As an IoT technological person, I feel this proposal very interesting, decentralizing market from manufacturer to user/buyer using IoT P2P platform combined with Cardano smart contract and token distribution models is a good way to develop the Cardano ecosystem. It funded and deployed successfully with metrics of Product MVP within 3 months, production software within 6 months and marketplace within a year, I think this is a valued real world use and utility to Cardano that this proposal delivered. By hence, it will support the following development and operational initiatives in the future.", "q0r": 4, "q1": "The proposer provides reference linkedin with specialties to show evidence of relevant skills and experience needed to implement the proposal but I could not find any link for details of team members. The Adosia White paper is so impressed with roadmap and many supporting information and also the Github of Adosia/contracts that some readers could ignore if not read carefully. I think it would positive if the proposer provides some important details of some team members, their works and especially about the relationship and role of Quinn in this proposal because he is a key for smart contract marketplace on Cardano.\r\nThe budget is not broken down into identifiable items, it is better if the Author gives detail number of people and work hours for each work, for example: 2 people * 40 hours * 50$/h for build out marketplace front end, etc.\r\nI think 12 months is a realistic timetable for marketplace but harboring thousands of designs and hundreds of 3d printer operators are a difficult if the proposer does not imply to the marketing strategy and so the budget for marketing also needed to take into account.\r\nAbout the technology aspect, I find this IoT platform just based on the wifi connection and it's ok for now, but it would be better if the proposer add some complimentary media such as celular network (3G/4G/LTE), Lora, RFMesh,... for dynamically placing hardware box in some areas.\r\nThe challenge/risk is not implied in this proposal such as the sophistication/quality of 3D printer product could not meet demand of end users and the ways for mitigating/changing.\r\nAt last, I still believe this proposal is likely to be successfully implemented if it is managed in a correct manner. ", "q1r": 4, "q2": "About the roadmap and milestones within 3-6-12 months are still ok for achievement. But the metrics or KPIs is not appropriate to this challenge, not clear for definitiion of success for community tracking and following. It'd be better if the proposer could give out details like: building out marketplace front end in the 2nd month, enable team members with various 3d printer hardware in the 4th month, execute dynamic NFTs drop using 3rd printers in the 6th month, hardware installation in the 7th month,... \r\nBy this reason, I don't think the auditability of this proposal  is good enough for community tracking easily and hope to see the modifying on it.", "q2r": 2, "assessor": "z_assessor_775", "no_vca": 15, "ne": 6, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "Развертывание открытого p2p-рынка для создания новых экономических возможностей для монетизации 3d-проектов и выполнения децентрализованных заданий на печать", "experience": "В Adosia работает более 15 постоянных членов команды - от опытных разработчиков Cardano до старших инженеров-конструкторов из Spacex."}