{"id": 381649, "author": "quasar", "title": "Mechanism Templates for Funding", "url": "https://cardano.ideascale.com/a/dtd/381649-48088", "category": 26236, "amount": 9000, "description": "Le mécanisme de financement actuel de Catalyst ne peut pas faciliter un financement rapide, en raison de l'infrastructure d'Ideascale.", "funded": 0, "upvotes": 24214600, "downvotes": 21260789, "votes_result": 2953811, "votes_cast": 225, "f6_no_assessments": 9, "f6_rating": 1.8148148148148147, "videos": [], "media": [], "f6_assessments": [{"q0": "Malheureusement, je ne pense pas que cette proposition soit d'une grande utilité pour l'écosystème Cardano et qu'elle réponde bien aux objectifs du défi. A commencer par le fait qu'il s'agit de quelque chose de très large. Le soumissionnaire veut créer un serveur discord pour discuter et avec cela résoudre plusieurs problèmes de Catalyst, cités sur un site web que nous n'avons pas pu ouvrir (un message d'erreur apparaît). À aucun moment, il n'est spécifiquement question de moyens plus rapides, plus efficaces et plus transparents de distribuer le trésor de Catalyst et de rémunérer les professionnels impliqués dans les différentes activités de l'écosystème, comme le souhaite le défi. Il me semble que le promoteur veut résoudre beaucoup de choses à la fois, mais sans un objectif et un plan d'action détaillé, il n'est pas possible d'être sûr que l'une de ces choses sera réellement résolue. C'est comme si l'on promettait beaucoup, mais que l'on ne présentait pas d'argument sur la manière de tenir ses promesses. Mis à part le fait qu'il existe déjà un espace dans les fonds de financement pour signaler les problèmes ; Ce ne serait pas une chose nouvelle, je pense. Par conséquent, non, la proposition ne répond pas aux objectifs du défi et ne semble pas propice à être financée.", "q0r": 1, "q1": "Le promoteur affirme être très actif au sein de la communauté. Cependant, que serait \"Cardano Evangelista\" ? Le fait qu'il soit CA et administrateur d'un serveur discord (lequel ?) ne le rend malheureusement pas prêt à résoudre des problèmes, car ces problèmes seraient de différentes natures et il me semble que nous avons un auteur qui comprend très bien les bases de Cardano, mais qui ne montre pas nécessairement une préparation technique pour résoudre différentes situations. Je pense qu'il serait plus approprié qu'il constitue une équipe, avec des professionnels de différents domaines de connaissance, c'est-à-dire des développeurs, des concepteurs, des publicitaires, etc. de cette façon, probablement, la gamme d'options pourrait répondre aux besoins des problèmes abordés. Il serait également important pour nous de savoir quelle a été sa proposition financée, il met son profil à disposition sur ideascale, mais il n'est pas possible à travers la page de déduire quelle a été sa proposition réussie. En ce qui concerne le scénario, il n'y a malheureusement pas non plus d'informations à ce sujet. Nous n'avons pas l'établissement des phases à accomplir, nous ne savons pas quelles étapes le promoteur suivrait vers le succès, nous ne savons pas quelles activités seraient faites, dans quel ordre et pourquoi. Il n'y a aucun moyen de comprendre le processus. Le financement n'est pas non plus justifié. Pourquoi 9k ? Serait-ce le salaire du soumissionnaire ? Mais par rapport à combien d'heures de travail ? Combien de temps cette proposition serait-elle élaborée ? Il ne m'est pas agréable de dire cela, mais ce sujet de la proposition est assez impuissant : nous ne comprenons pas pourquoi l'auteur serait prêt à exécuter la proposition ; il n'y a pas de scénario ; il n'y a pas de justification pour l'argent demandé.", "q1r": 1, "q2": "ALERTE : ce soumissionnaire a copié et collé, dans la partie \"Principaux paramètres à mesurer\" de la proposition, ce qui figure dans la description du défi. Cela dit, il n'y a rien à revoir ici. Il n'a pas pensé à sa proposition d'une manière unique, il n'a pas élaboré de moyens de l'auditer, il a juste utilisé les modèles prêts à l'emploi présents dans ideascale. Il n'y a aucun moyen d'auditer cette proposition. La création du canal discord serait l'activité principale ici, l'idéal serait que le promoteur rassemble les principaux débats et les informations dites sur son canal et apporte ce contenu au reste de la communauté Cardano, ou même que certains membres de la communauté participent au canal pour effectuer un suivi en direct. Mais malheureusement, il ne se soucie pas de trouver des solutions d'audit, il se contente de profiter des modèles tout faits, comme il l'a dit précédemment.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 26, "ne": 16, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "There are no real details here on what is actually going to be provided, most of the proposal is just a reference to the challenge itself and other documents. Why do you need $9000 to set up a discord server? Whilst I have yet to go through all the proposals from QUASAR in this fund, I did so In fund6 and they were all of a similarly vague format. Please provide a concrete proposal with clear deliverables and time frames.", "q0r": 1, "q1": "There is no clear plan presented. Part of the main experience presented is that the proposer has submitted 50 ideas and had 1 funded. This in itself says something about how the proposals were perceived. I remember reviewing all the ideas by QUASAR in fund 6, and reading all the other reviewers comments on their proposals in the voting stage. The proposals were all relatively vague, with difference expertise stated for each one with no evidence to back them up. They were rated poorly by all reviewers. I have little confidence this proposer will successfully deliver on this proposal given this history and the limited details provided in this proposal.", "q1r": 1, "q2": "There are no clear deliverables or associate timeframes. No metrics for success have been presented. Please provide a clear timeline of what you will deliver by when so delivery can be audited. Please also provide some clear metrics with attached goals so that success can be measured.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 34, "ne": 3, "ng": 27, "nfo": 4, "vca_o": 1}, {"q0": "The problem statement regards the constraints imposed by ideascale and proposes some side solutions to overcome them such as a discord server and other mechanisms. Although the global idea and problem statement seems to fit within the challenge goal, the proposal did not address with clarity how the problem will be solved. It shows two examples of possible mechanisms, one is a tweeter event and the other is related to an identity token, but couldn't grasp the linkage to the general idea. I'd suggest elaborate the idea with more details and concrete examples.", "q0r": 3, "q1": "The team is composed of well known and accountable members of this community with at least one proposal funded. However the proposal laks details and concrete action plan; it provides an overall budget with no breakdown or explanation; it doesn't provide timelines; and KPI/metrics are missing. With the lack of this critical information it is impossible to evaluate positively. I recommend elaborating the proposal in more detail following the guidelines and assistance from the community.", "q1r": 1, "q2": "The proposal is not well developed, it looks like a good idea that needs a lot of refinement. The authors need to work on to show accountability to the community. The project does not include metrics or KPI to track progress, not even show an action plan with due dates. It is also not easy to understand what the concrete solution is. For the lack of this critical information I can not evaluate that this proposal can be audited in case of being funded.", "q2r": 1, "assessor": "z_assessor_554", "no_vca": 18, "ne": 3, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "Primarily, there is no a description of the structure of the templates or mechanisms that would facilitate the rapid funding of proposals.  Without such a description, it is difficult to establish how the templates or mechanisms of the current proposal would be a better instrument compared to the current process developed through Ideascale.  The links provided do not offer a clear idea of the structure of the tools that are intended to be built, therefore, I believe it is difficult for the reader and will be difficult for the voter to understand and imagine the potential impact of the proposal. ", "q0r": 3, "q1": "- Without a clear understanding of the impact of the proposal, it will therefore be difficult to establish its feasibility. And unknown feasibility means no feasibility. And, as I mentioned in the \"Impact\" section, in my opinion, lack of understanding of impact is due to lack of at least a basic description of the structure of the tools that the proposal intends to build.\n\n- Please provide information about the other team members (academic formation, experience, etc)\n\n- There is no detailed description of the budget.\n", "q1r": 3, "q2": "Are the suggested KPIs intended to measure the performance of the proposal or the characteristics of proposals applying for fast-track funding? It is difficult to establish the measurement scenario.", "q2r": 3, "assessor": "z_assessor_541", "no_vca": 27, "ne": 5, "ng": 21, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement isn't defined very well. It is a general statement that Ideascale is not a good enough infrastructure to facilitate rapid funding, but it doesn't specify which parts of Ideascale should be improved, and in what way, to improve this.\n\nThey write that they will test governance and identity solutions for proposals on a discord servers. These solutions should have been explained more in detail to make it possible to assess the impact of their proposal.", "q0r": 1, "q1": "There is no explanation of what the budget will be used for, and in what timeframe. \n\nBased on the lack of detailed explanation in the proposal, I didn't get the impression that the proposers have a high level of commitment towards the project.", "q1r": 2, "q2": "They haven't specified well enough what kinds of mechanisms and templates they will build (or which specific problems they will solve), thus it is very difficult for the community to assess the success and impact of what they create.\n\nThey haven't stated any specific metrics that defines what it would look like if this project was implemented successfully. They have simply copy-pasted the text from the campaign brief, not addressed how they will approach these questions specifically.\n\nNo roadmap or milestones included, this makes it impossible for the community to audit the progress.", "q2r": 1, "assessor": "z_assessor_73", "no_vca": 25, "ne": 7, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "\"The solution will be a discord server to test alternative goverance and identity solutions\", it states. However, the Discord invite link is expired.", "q0r": 1, "q1": "As is the case with many of the prior proposals from this particular proposer, it is a bit difficult to pinpoint what exactly is being proposed. A bunch of links leading here and there is hardly a proposal. Not sure if this is a merit: \"50+ Proposals submitted, 1 funded, 50% delivered\".", "q1r": 1, "q2": "Rather than showing a roadmap or KPIs, the proposer has just copy-pasted measures from the challenge itself.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 26, "ne": 0, "ng": 20, "nfo": 6, "vca_o": 1}, {"q0": "The proposer is a well respected member of the community and the proposal is aimed at dealing with the challenge. However, the proposal is a Discord server where the actual solutions will be discussed, therefore more of an indirect benefit. Key metrics are very broad, almost as the challenge itself. I did not manage to find the clear value in the proposal except as enabling space where the actual solutions referring to the challenge might be tested&explored. To my understanding, the challenge should asses already the solutions, not the forum to discuss solutions.", "q0r": 3, "q1": "The proposal has a technical part which is setting up a Discord and then a human part where solutions to the actual challenge shall be discussed. There are many risks in this proposal due to unknowns in the acceptance of the new platform and actual good ideas being born there. The risk of lack of people or good proposals actually emerging has not been addressed. I would assume that the Challenge goal would be more in the direction of already solid solutions. The budget is a lump sum with no breakdown or milestones in itself, more related to the solutions to be tested. The proposer is experienced and valued Cardano community member, so there is a high possibility of delivering if funded.", "q1r": 4, "q2": "The proposal has key metrics which are related to the solutions to be tested. It is a bit difficult to measure the deliverables since it will be mostly descriptory, not a solution ready to be implemented and impact measured. Time horizon or milestones are not clearly defined. If the selected solutions are to be implemented, there would be a way to measure and compare to Catalyst.", "q2r": 4, "assessor": "z_assessor_160", "no_vca": 25, "ne": 4, "ng": 16, "nfo": 5, "vca_o": 1}, {"q0": "Unfortunately, the links provided with the list of itens to be addressed in this proposal are not available and, hence, it becomes really hard to assess its potential. As suggestions, I'd try to include at least some examples in the proposal body to avoid issues like this. \n\nIn addition, the proposal is really vague on how they intend to address these issues (whatever they are) with no clear strategy or plan. It just says its going to multiple mechanisms and template but it doesnt tell how. It would be imporant to have mentioned here how the interaction with community/users/stakeholders would occur and what would be the chosen approach to do so. It is also mentioned that the solution is based on a discord server to test alternative governance but it doesnt explain why it chosen or how they would be tested.", "q0r": 2, "q1": "In regard to the team, it is not mentioned how many people are involved and the experience described is a bit vague, with no links provided to verify the info. It would be important to tell a bit more what proposer technical background is and what is its experience in establishing governance.\n\nThere's also no plan defined nor a budget breakdown. As to the plan, it would be imporant to include how the itents in the list would be prioritized (planning phase), how they would be tackled (development), tested in the community (validation) and rolled out (implementation), all distribuited along weeks/months and with clear deliverables. For the budget breakdown, it could be splitted into working hours and necessary tools, for instance.\n\n", "q1r": 1, "q2": "Theres a KPI section but the content in it is too subjective and has no really measurable KPIs. It would be imporant to see how many itens they addressed, the quality of the solutions and how many users they intend to reach. If possible, with clear targets and the evolution over time.\nAs theres no plan, there are also no milestones as well.  If a proper schedule were made available, it wouyld be important to see the main milestone in each project phase highlighted.\n\n\n", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 23, "ne": 8, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "The problem described is inline with the challenge expectations, but I believe that the lack of rapidity may not rely only on the Ideascale infrastructure. But the solution proposed to test other governance model shows that it is not only the infrastructure the only issue.", "q0r": 3, "q1": "A budget breakdown and a timeline are missing. The provided links are not working and the presentation of the team members is missing.", "q1r": 2, "q2": "From my point of view the provided KPI are not all auditable. The team members should describe what \"Fast\" means (in terms of days or weeks or months). Is Fast meaning 7 days, 2 days, 2 weeks, etc? ", "q2r": 2, "assessor": "z_assessor_457", "no_vca": 25, "ne": 1, "ng": 19, "nfo": 5, "vca_o": 1}], "solution": "La solution sera un serveur discord pour tester des solutions alternatives de gouvernance et d'identité.", "experience": "Dans Catalyst en tant que proposant, conseiller, équipe Challenge. Évangéliste Cardano, administrateur sur discord. Plus de 50 propositions soumises, 1 financée, 50% livrée."}