{"id": 383284, "author": "glaxas", "title": "Catalyst Circle Treasury Management", "url": "https://cardano.ideascale.com/a/dtd/383284-48088", "category": 26248, "amount": 11400, "description": "O Círculo Catalisador precisa pagar os custos operacionais e os membros do Círculo para as funções desempenhadas. As transações precisam ser documentadas e gerenciadas.", "funded": 2, "upvotes": 70138850, "downvotes": 3679374, "votes_result": 66459476, "votes_cast": 142, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Devido ao fato de o Fundo7 não ter um desafio específico para o Catalisador, concordo que esta proposta está enfrentando o desafio. Na minha compreensão da proposta, não se trata de ampliar nossa comunidade, mas de aumentar a longevidade e a eficiência do Projeto Catalisador. Com um foco específico em lidar com o lado econômico do Círculo Catalisador. A proposta trata de um aspecto/problema muito importante e oferece uma solução potencial a longo prazo, criando um sistema que tornará o manuseio dos Círculos Cardano \"Treasury\" mais fácil e transparente. Tanto para as atuais gerações do Círculo Catalisador, quanto para as futuras. A solução que a proposta sugere é a longo prazo, que fala da compreensão da \"maquinaria\" catalisadora como um todo e com esperanças de otimizar a eficiência para todos os envolvidos.", "q0r": 4, "q1": "A proposta apresenta a equipe central que parece ter experiência dentro da Comunidade Cardano, mesmo que a equipe atual não tenha propostas financiadas por trás deles. Eles parecem estar ativos na finalização de uma proposta financiada pelo Fundo6, mas aqui seria útil com alguns links ou mais \"provas\" de que a equipe atual estará envolvida. Atualmente, são fornecidos perfis do LinkedIn, mas um deles não funciona e o resto não fala pela experiência em contabilidade e operações comerciais. Se a proposta incluísse estes perfis, a equipe seria apresentada de forma muito mais credível e clara. Não sou de forma alguma um contador, mas pela minha experiência na gestão de organizações e comunidades, sei da importância de ter especialistas trabalhando no lado econômico das coisas. As sugestões de como administrar o Cardano Circle Treasury são apresentadas de uma forma muito clara, passo a passo. Como a proposta está se concentrando em um prazo mais curto (3 meses), a alocação orçamentária parece razoável, pedindo apenas cerca de 5% do orçamento total do desafio. A alocação orçamentária também inclui a estimativa de horas de trabalho e distribuição de recursos, o que aumenta ainda mais a credibilidade da proposta. Concordo que é altamente provável que esta proposta seja implementada com sucesso.", "q1r": 4, "q2": "O roteiro é muito claro e se estende por um período de 3 meses, basicamente até o próximo fundo(8). A fim de torná-lo ainda mais claro, eu teria gostado de ver prazos estimados em todos os marcos, já que o único prazo previsto é o primeiro (12 Dez-2021). A equipe promete ter o sistema criado como fonte aberta, o que é uma forma maravilhosa de aumentar a transparência do projeto. Como a comunidade será capaz de acompanhar o desenvolvimento, além do GitHub? É um tanto complexo encontrar medidas mais \"abertas\" de sucesso, uma vez que é criado para uma parte muito pequena e especializada da comunidade, mas que tal compartilhar o progresso dos testes do sistema ou atualizações de desenvolvimento através de canais de mídia social ou TownHall etc? Também vale a pena mencionar que a equipe para esta proposta pode mudar com o próximo fundo, se eu entendi a proposta corretamente. Isso significa que a transparência é de suma importância se a equipe de desenvolvimento tiver a intenção de mudar ao longo de diferentes etapas. Posso ter interpretado mal a proposta, mas talvez a proposta possa apresentar os planos a longo prazo de uma maneira mais clara? Talvez incluir um plano de visão menos detalhado para os próximos fundos (8-9) para convidar a comunidade a participar do plano de longo prazo. Finalmente, gostaria de ter visto uma pequena seção onde a equipe descrevesse alguns dos desafios ou riscos que poderiam surgir durante a fase de desenvolvimento, e como eles planejam lidar com eles. A perspectiva será sempre importante em qualquer situação, e isso me levaria, como membro da comunidade, a ter ainda mais fé na proposta. Eu não concordo nem discordo que esta proposta me forneça informações suficientes para avaliar o progresso na realização de seus objetivos declarados.", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This is a proposal related to supporting accounting, spending, compensation, salary... tools on the cardano platform. An essential support tool for any company or workgroup that wants financial transparency, financial organization in a more methodical, professional and automatic way.", "q0r": 4, "q1": "The proposal is practical and highly feasible, but it is necessary to specify more clearly how to deploy it to the market to serve the majority of the community, as well as the relevant experience of the working team.", "q1r": 4, "q2": "In the proposal, it was mentioned that the code is completely public on github, so the community can check the project progress as well as the implementation progress of this project.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The \"Catalyst Circle Treasury Management\" proposal addresses the objective of challenge which is to pay operating costs and circles for their performed duties. The Catalyst circle is important for the Cardano Ecosystem and that the team has contributed time and effort to make this possible. ", "q0r": 5, "q1": "The team is comprised of strong 3 team members from Catalyst Challenges. The budget is reasonable and broken down in detail. They also updated what the community can expect after Fund 7 and the handover for fund 8 treasurers. The proposal is reasonable and pave the way for future development.", "q1r": 5, "q2": "The roadmap with milestones/KPI are available so the community can keep track of their progress. The system that they plan to build along with the documentation in GitHub will be open source and  available for public usage.  ", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about building a system that makes CC operations frictionless and auditable when it comes to resource allocation. This is a great and meaningful idea. As we know, the Catalyst Circle plays an important role the Cardano's Governance as a whole. The problem convinces me, and is clearly described, and explained in detail. The solution is clearly defined showing a potential impact on the Cardano ecosystem in long term. Therefore, I strongly agree that this proposal effectively addresses the challenge, and can rate it with a score of 5", "q0r": 5, "q1": "Proof of feasibility from the team profile can be seen, with the external links for verification. The budget is provided with a clear items structure, and explanations of the calculation base. Risk is not defined. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of information with proof for verification. It would be better if risk/challenge (with mitigation) is added.\r\nBased on the given information, I agree with this proposal's auditability, I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal addresses the issue of  managing the Treasury fund's financial operations and obligations in a simple and clear manner. . They state that by developing and implementing a treasury management system they can help ensure that money provided by Catalyst is spent in a manner that is auditable and transparent. This seems to be something that will definitely support the Cardano/Catalyst ecosystem. This is very important, and therefore I rate this proposal 5 for impact.", "q0r": 5, "q1": "The team members are experienced in business and accounting and links are provided for their LinkedIn accounts. The budget is broken down and understandable. They have requested $400 to build the accounting system from scratch. I don't know if this will be enough, but they do mention that they might need additional funds in future. They have set out a plan with actionable tasks and a timeline and it seems realistic to me. The are already busy testing the solution and mentions that it is going well.", "q1r": 5, "q2": "The Proposer mentions that the \"system that is being built will be open source and available for the community to use elsewhere.  The onboarding documentation for future treasurers will be public as well as part of the CC github Playbook\". This ensures that the progress of the project can be followed and makes the project auditable. The KPI's given makes sense and will also provide the community a way to track how the project is going. Maybe provide a space where the community can already now start tracking progress.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Construir um sistema que torne as operações CC sem atritos e auditáveis quando se trata de alocação de recursos.", "experience": "Nossa equipe é composta por Conselheiros Comunitários e membros da Equipe de Desafio com experiência em contabilidade e operações comerciais."}