{"id": 383969, "author": "dionyziz", "title": "Research DAO", "url": "https://cardano.ideascale.com/a/dtd/383969-48088", "category": 26248, "amount": 100000, "description": "A pesquisa no campo da ciência da cadeia de bloqueio freqüentemente recebe financiamento de forma opaca, e a pesquisa fundacional permanece sem financiamento.", "funded": 0, "upvotes": 21536729, "downvotes": 27534651, "votes_result": 5997922, "votes_cast": 126, "f6_no_assessments": 6, "f6_rating": 3.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta proposta é apresentada de forma clara e compreensível, tanto com declaração de problemas (fortalecimento da pesquisa financiada com foco na cadeia de bloqueios) quanto com solução (Research DAO, tem como objetivo financiar trabalhos de pesquisa acadêmica revisados por pares no campo da ciência da cadeia de bloqueios). Após ler cuidadosamente os valores, objetivos e processos em seu website, eu diria (a partir de minha experiência no trabalho como pesquisador) que o DAO segue bons padrões e procedimentos acadêmicos. Cardano já tem a reputação de ser minucioso em sua pesquisa e desenvolvimento, e por minha compreensão e opinião, esta proposta/projeto ajuda Cardano a ser mais do que já é e pretende ser. Mais pesquisas revisadas por pares não só aumentarão as oportunidades de colaboração com as universidades, mas também expandirão e desenvolverão a ciência da cadeia de bloqueio como um todo, enquanto fortalecem a credibilidade do que já foi pesquisado. É um processo lento, mas um processo focado na capacidade de sobrevivência e desenvolvimento a longo prazo. O financiamento solicitado é bastante substancial, cobrindo 50% do orçamento total do desafio, mas com uma perspectiva de longo prazo, parece ser um investimento que vale a pena. Isto, é claro, depende se o projeto tem como objetivo solicitar fundos futuros. Eu defenderia que esta proposta pertence mais ao desafio diverso do que os DAOs adoram Cardano, uma vez que se trata de um DAO real, e não de uma ferramenta desenvolvida para facilitar a integração dos DAOs em Cardano. Concordo plenamente que esta proposta trata efetivamente deste desafio.", "q0r": 5, "q1": "A equipe central (de 9 membros) parece ter uma boa compreensão do ecossistema Cardano e no campo acadêmico. Em minha experiência acadêmica, ter membros de equipe de muitos níveis acadêmicos diferentes (e universidades em 3 continentes, que a equipe afirma ter) é benéfico para cobrir muitos níveis diferentes de alcance. O que eu gostaria de ter visto é uma apresentação detalhada da equipe principal e talvez alguns exemplos de suas universidades parceiras. Talvez minha limitada experiência em organizações descentralizadas esteja criando conceitos errôneos (se for esse o caso, corrigirei a situação), mas descentralizada não significa anônima. Um aspecto que fala muito bem do nível de viabilidade da proposta é o fato de que o projeto já está em funcionamento, com parcerias de vários outros Blockchains (A rede Harmony, para mencionar Um. Pun pretendido). Se o projeto sofre de desafios durante o desenvolvimento e a escalada, ele não depende apenas do financiamento potencial que receberia do Ecossistema Cardano. Também gostaria de ver uma alocação mais profunda do orçamento incluída na proposta. Atualmente, as únicas informações incluídas são os fundos totais (100k, 50% do orçamento total do desafio), e que a equipe pretende utilizar esses fundos para cobrir os custos de viagem e participação em conferências. O que é realmente bom, mas estou tendo dificuldade em acreditar que todo o orçamento solicitado será alocado para isso. Possíveis inclusões poderiam ser: Quanto dos fundos solicitados será alocado para a participação em conferências? Quanto será coberto pelo desenvolvimento do website? Algum dos fundos irá para a equipe central? Ou a maior parte será alocada para financiar outros trabalhos de pesquisa no desenvolvimento da Blockchain (este último é sugerido na proposta, mas poderia ser apresentado mais claramente com números estimados incluídos). Os objetivos, plano, desenvolvimento e processos são muito claros após a leitura de seus documentos em seu website. Em suma, concordo (embora apenas) que é altamente provável que esta proposta seja implementada com sucesso (uma vez que já é um projeto em andamento com o objetivo de fazer mais do que já faz).", "q1r": 4, "q2": "Os resultados são claros e razoáveis, incluindo principalmente dar aos estudantes de doutorado a possibilidade de apresentar seus trabalhos em inúmeras conferências (com foco em universidades e instituições com financiamento insuficiente) e criar bolsas de pesquisa para pesquisadores que queiram fazer pesquisa em áreas relacionadas à cadeia de blocos/cilíndricas (Especificado no site claramente). Os marcos do projeto são basicamente apenas descritos como aumentando a escala destes conceitos, o que eu acredito (como pesquisador e Conselheiro Comunitário) é bom em sua simplicidade. A proposta seria ainda mais fortalecida se tivesse incluído alguns detalhes sobre medidas de sucesso (quantos estudantes a conferências, quantas universidades parceiras em que prazo, quantos trabalhos ou projetos financiados, etc.)\u2028Since a pesquisa será revisada por pares e que as auditorias são prática comum em qualquer academia, será possível para qualquer pessoa (mesmo fora da comunidade) acompanhar o progresso e o desenvolvimento dos \"frutos do trabalho\" provenientes deste projeto. O site contém informações realmente boas sobre transparência/auditoria que parecem legítimas e confiáveis. Finalmente, uma discussão sobre os riscos e desafios potenciais do desenvolvimento deste projeto aumentaria tanto a credibilidade da equipe (a perspectiva é benéfica em qualquer projeto) quanto minimizaria o risco de possíveis armadilhas durante o desenvolvimento. Concluindo, concordo que a proposta me fornece informações suficientes para avaliar o progresso na realização de seus objetivos declarados.", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 17, "ne": 12, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Eu realmente gosto da idéia e da proposta do DAO Research. Estou envolvido no Catalyst desde o início do Fundo 2 como um CA e depois como um vCA e proponente. Estou na órbita de Cardano desde 2017 e tenho acompanhado relativamente de perto a evolução da pesquisa no espaço e o nome de Dionysis Zindros foi mencionado muitas vezes pelos atores do ecossistema Cardano ao citar pesquisas fundamentais que levaram a avanços científicos neste espaço. A idéia principal por trás do Cardano é descentralizar tudo - a fim de garantir que o sistema continue a ser capaz de evoluir mesmo que um grande jogador seja \"retirado\". Todos nós sabemos que o nome de Cardano é sinônimo de pesquisa e fundamentos fortes. Eu pessoalmente tenho me preocupado em como descentralizar a pesquisa fundamental para garantir um caminho para o futuro que não seja 100% dependente do financiamento da pesquisa IOG - e esta proposta é um sinal na direção certa. A proposta tem um profundo significado e importância para o ecossistema Cardano e é capaz de ser escalonada se se comprovar que é um sucesso. Não se trata apenas de pesquisa - trata-se também de atrair as melhores mentes jovens para a melhor plataforma da cadeia de bloqueios baseada na ciência. Um casamento dos melhores com os melhores. Grande idéia para propor esta Pesquisa DAO - como um caminho para o financiamento de pesquisas acadêmicas abertas e revisadas por pares no campo da ciência da cadeia de bloqueio. Por que diz respeito a Cardano. Como afirma o proponente: \"o DAO de Pesquisa pode ser usado para melhorar Cardano, pois será de código aberto e livre de patentes\". Cardano é uma pesquisa fundamental... feita em código e comunidade. Somos uma pesquisa em andamento.", "q0r": 5, "q1": "Este tipo de proposta poderia ter vindo de qualquer um, mas não veio. Veio de antigos IOG de alto nível e afiliados de Emurgo e da cadeia de bloqueio de universidades e pesquisadores de criptografia, dados e segurança. Os atuais governadores do DAO de Pesquisa são: Zeta Avarikioti (IST Áustria), Foteini Baldimtsi (Universidade George Mason), Joseph Bonneau (Universidade de Melbourne), Sebastien Guillemot (dcSpark), Angel Leon (FrostWire), Andrew Miller (UIUC), Dionysis Zindros (Universidade de Stanford). Este é um who's who de mentes jovens e brilhantes dos campos da cadeia de bloqueio, criptografia, segurança e privacidade de dados que qualquer sistema de cadeia de bloqueio desejaria atrair. Para garantir a independência, o pessoal do DAO de Pesquisa é de várias universidades ao redor do mundo. Eles estão propondo uma nova maneira de descentralizar a pesquisa fundamental e estão dispostos a experimentá-la através do sistema Project Catalyst. Com a experiência e o plano apresentados, é certo que a proposta será implementada com sucesso - como todos os envolvidos aprenderão com o projeto. O fracasso e o sucesso são sucesso neste campo em evolução, pois precisamos de dados, modelos, projetos e tentativas práticas de descentralização da pesquisa. O orçamento alocado corresponde às etapas planejadas do DAO: (a) bolsas de viagem para estudantes de graduação, pós-graduação e doutorado, seguidas de (b) bolsas maiores para apoiar o desenvolvimento de novas pesquisas. Criticamente para o sucesso a longo prazo, o DAO planeja estabelecer um fluxo contínuo de bolsas dos parceiros de financiamento e membros, de modo a garantir operações contínuas.", "q1r": 5, "q2": "Como a equipe especificou, a totalidade do financiamento será tornada transparente por meio de publicação on-line no site dedicado https://researchdao.io/. Além disso, o corpo de pesquisa financiado pelo DAO será publicado sob uma licença aberta tanto para os trabalhos quanto para o código, tornando-o reutilizável para o ecossistema mais amplo. Como a fase inicial envolverá o financiamento de bolsas de viagem para estudantes de graduação, pós-graduação e doutorado que tenham sido aceitos para apresentar seus trabalhos de pesquisa em conferências revisadas por pares da área (inicialmente a Criptografia Financeira 2022) - espero que os potenciais auditores tenham um trabalho relativo verificando os detalhes, já que as pessoas envolvidas são pesquisadores proeminentes no espaço. Gostaria de ter visto melhor informação sobre quanto do orçamento vai para qual componente, mas pode ser que ainda seja cedo.", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 16, "ne": 12, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "I think F7: Open Source Developer Ecosystem would have been a better fit, but it certainly is a MISC proposal. Just about anything fits. I do question the amount of money needed for this proposal. ", "q0r": 4, "q1": "Website was informative, but I had trouble finding the nine team members talked about in the proposal or the website. I would have liked more information, or information more easily found, about the experience of these nine team members.", "q1r": 3, "q2": "Information provided about the idea itself seems complete enough. Just troubling that I had issues finding who the nine team members are, and the amount of money requested (being 50% of the entire campaign) is troubling to me.", "q2r": 3, "assessor": "z_assessor_363", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "\"Supporting peer-review research transparently is a great job for the blockchain field in general and Cardano in particular. Because when blockchain platforms are researched and peer-reviewed, there will be no unfortunate financial problems in the future and better community trust in Blockchain.\r\n\r\nBut I think the DAO challenge will suit the proposal better\"", "q0r": 4, "q1": "\"I see the proposer has brought out a lot of relevant experience of the team in the academic community and industry, including PhDs, post-docs and professors at large universities worldwide. But I don't see the proposer giving any names or specific information about the people on the team via Linkedin, Facebook, Twitter, etc. So I'm quite skeptical about the claims about the experience of this team.\r\n\r\nIn addition, the proposal does not set out specific goals and tasks according to the roadmap and who will have the right experience to do that work.\r\n\r\nIn addition, the proposal has not shown which universities or organizations the proposal intends to approach for funding\"", "q1r": 2, "q2": "I only saw a proposal to get a fund of 100,000 USD (accounting for half of the amount of this challenge) but did not see them stating how to use this money for specific jobs. This makes this proposal nearly impossible to audit.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "The whitepaper for this proposal is solid. It presents the problem that they are addressing with quality solutions in the Cardano ecosystem. Contributing excellent research with such transparency and open source are what differentiates cryptocurrency from traditional finance. This proposal highly supports Cardano and aligns with its purpose - technology realized through evidence-based science. Moreover, this proposal gives the opportunity for students to take part and have meaningful impact for the future, and Cardano.", "q0r": 5, "q1": "The proposer has given a verifiable plan and a practical timeline for implementing grants and funding for conferences. Though roadmap is not stated, the key objectives are.", "q1r": 4, "q2": "Partnered with Harmony for funding, and stated that it will be publicized on their website are evident for auditability. In addition, the roadmap are well detailed with clear vision of how it will be valuable to the Cardano ecosystem. ", "q2r": 5, "assessor": "z_assessor_669", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The proposal seeks to launch a program of research into blockchain education in theory and practice.  Reading through the proposal, it will well fit into the Community events challenge.", "q0r": 3, "q1": "The team is made up of 9 members of academic community and industry including PhDs, post docs and professors at large universities worldwide, and they can implement the proposal successfully. The plan outlined is well understood.", "q1r": 3, "q2": "The road map shows 3 to 6 months project work with a budget of $100.000 which is not broken down into details. Auditing might raise a number of questions on how much is spent on what?", "q2r": 3, "assessor": "z_assessor_688", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}], "solution": "O DAO Research financia pesquisas acadêmicas abertas e transparentes, revisadas por pares, no campo da ciência da cadeia de bloqueio, tanto na teoria como na prática.", "experience": "Nossos governadores são 9 membros da comunidade acadêmica e da indústria, incluindo doutores, pós-doutores e professores em grandes universidades em todo o mundo."}