{"id": 384697, "author": "daynakovacic", "title": "Cardano Film Studios", "url": "https://cardano.ideascale.com/a/dtd/384697-48088", "category": 26248, "amount": 37500, "description": "Há uma falta de conscientização global sobre a Tecnologia de Ledger Distribuído/Cadeia de Bloqueio. É percebida como apenas para o comércio ou crime.", "funded": 1, "upvotes": 49156066, "downvotes": 10958223, "votes_result": 38197843, "votes_cast": 107, "f6_no_assessments": 4, "f6_rating": 3.3333333333333335, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=0"], "media": [], "f6_assessments": [{"q0": "OK, this proposal is aiming to connect a movie with Cardano by including crypto currency in the script as a main part that this movie will be about. The funding will go to a connected CNFT project used for marketing and a draft/ first version of the movie", "q0r": 4, "q1": "The proposers do not provide enough information about their project. They claim to be in the midst of this project, but they do not provide references or proof of prior work or repositories to check the progress of the project/ film. They are in the process of securing 2 - 2.5 million dollars to make this movie, so it is not clear what happens, if the team is not successful in receiving enough funding, the proposing team should elaborate on this risk. Roadmap for the funding period is missing, budget breakdown is only connected to pre-production of the movie.", "q1r": 3, "q2": "Auditability of their measures of success is only possible, if the movie will be fully funded with over 2 million dollars, so at the  moment it would not be clear, how auditability of the pre production part of the project would look like. The proposing team has a couple interesting ideas how they would like to communicate with the community as well as raise awareness through movies, but it is at this moment all relatively loosely connected. It would be great if the team provided a github, a website and other social media that they might use to promote the project, so that it becomes more clear to the community, how this project develops and interacts with members inside and outside of the Cardano community.", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 18, "ne": 4, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The Miscellaneous Challenge is important as it can allow a space for projects that do not fit into other established Challenge categories, allowing for unique and wide-ranging ideas to proliferate. This project definitely addresses the issues presented in the Miscellaneous Challenge Brief, firstly, it is an 'interesting and valuable project that does not currently fit into other challenges', for sure. And, secondly, it does have to do with Cardano, and could show in a potentially widely distributed form, a 'story' about how blockchain tech can be used in a lived experience with positive effects, as well as pioneer a way to use the Cardano blockchain to innovate within the moving image business structures.", "q0r": 5, "q1": "Here I have to be honest and say that I can neither agree nor disagree that the team can carry out the project successfully.  I would like to see more about the creatives involved: the writer, DP, etc. I know that the 'story' is coveted IP, but, show us that you can 'tell a story'!  I would love to see this film!  Paint us a picture in the opening of the pitch.  \r\nI can also say that the proposal needs revision in terms of the ideas presented.  It is a bit confusing for me, with many ideas flowing out at once. One thing is to set out to make a 'studio' for many films to be made within, Cardano Studios, etc.  Another, is to make a specific film about the characters named in the proposed film 'Barracuda', which is great.  The use of cNFTs to market the production, etc. is great and I love the idea of showcasing the talent of an artist in the community of (what I call) First Peoples of America. Long term, something to do with music creation, etc. It is a lot to take in! To me, streamlining the project description into concrete 'do-ables' or deliverables, tied to the suggested budget, which is a reasonable ask at 18-19% of the Challenge total, and aligning KPIs to these- how will we as a community be able to assess progress in the timeline presented that are tied to specific goals, etc.- would make it a for sure 5 star evaluation. In my opinion, it is not there yet.  But, it will be with a few more passes and careful strategic attention.  ", "q1r": 3, "q2": "As suggested above, I believe the proposal needs some more work, and that from the opening problem statement to the 'Success Would Look Like' section, things need to be streamlined.  Given this, I have to kindly Neither agree nor disagree that with the information provided we could capably audit the success of the proposal.  ", "q2r": 3, "assessor": "z_assessor_210", "no_vca": 18, "ne": 8, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "It is difficult to estimate the effectiveness of the proposal. The output of any creative process can not be judged from the proposal. Therefore the idea to \"To show real life Cardano use cases through movie storytelling and develop blueprints needed for blockchain utilization for the film production process as a whole,\" on the face is addressing the challenge. ", "q0r": 4, "q1": "The lead proposed has about five years of experience in this field and has been a story producer. The creative side is highly subjective, and it is difficult to quantify success. ", "q1r": 3, "q2": "The fund requested is for the CNFT project, preproduction, and research for long-term goals. Any creative proposals, it give a lot of confidence to support if the proposer's contribution is apparent. At least the R&D component should be complete and placed before the community before the proposal is considered to be auditable. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This proposal focuses on raising awareness of real-life use cases for Cardano through feature films and creating Cardano film production templates for the industry. This is a great and attractive idea. The problem is clearly described, and explained in detail. The solution is clearly defined, the clear potential impact on the ecosystem in long term. Therefore, based on the given information, I strongly agree that this proposal effectively addresses the challenge, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is provided and described enough for understanding, skill, experience is suitable for implementation, with reference/proof (documents/links,...) for verifying. The roadmap is clear but some KPIs are not measurable. Budget explanations of calculation base are not provided. Risk is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "For better understanding: (1) Budget explanation for each item should be provided; (2) KPIs should be specific and quantitative; (3) Risk should be analyzed. Based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Aumentar a conscientização de casos reais de uso de Cardano através de filmes de longa-metragem e criar modelos de produção de filmes Cardano para a indústria", "experience": "Escritor/Diretor: 15+ anos http://www.linkedin.com/in/shivangm\nProdutor: 14+ anos em vendas https://www.linkedin.com/in/dayna-kovacic-a0821365/"}