{"id": 384785, "author": "chadle", "title": "Cardano NFT Search Engine", "url": "https://cardano.ideascale.com/a/dtd/384785-48088", "category": 26248, "amount": 30000, "description": "Não há aplicações que possam pesquisar fichas com base em metadados. Todas as aplicações atualmente pesquisam no ID da apólice e no nome do token.", "funded": 0, "upvotes": 18132182, "downvotes": 23027785, "votes_result": 4895603, "votes_cast": 96, "f6_no_assessments": 4, "f6_rating": 2.5, "videos": [], "media": [], "f6_assessments": [{"q0": "There is a large number of analytic solutions available in the Cardano chain now. The search of metadata is not very actively being pursued by the community. However, the tool if built and available might result in some innovative way of using it. The proposal could have included why such a search is required and how it can help the ecosystem. ", "q0r": 4, "q1": "The technical challenges involved in the project are well within the capability of an experienced SPO. Therefore there is a very good chance that the proposal will be implemented in earnest. ", "q1r": 5, "q2": "The hosting alone for backend and frontend will cost upwards of 500USD per month. The development cost can be approximated as the pay for one developer for 3-4 months. Therefore the 30000USD seems to be on the higher side and moreover the sustainability of the tool by providing backend service is not clear from the project. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 17, "ne": 0, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "\"I have a big question about why do we need an application that can search tokens based on metadata when we can search on policy ID and token name. I haven't really seen a significant impact from the proposal's solution.\r\nBesides, the team has not yet come up with a specific solution and plan for this idea to show the impact of the proposal's solution.\r\nThe team should focus on demonstrating the superiority of this project's search engine over current search solutions and how to implement them specifically. From there, voters and CAs can better assess the impact of the proposal\"", "q0r": 1, "q1": "\"How many people does the team have?\r\nWho are they?\r\nWhat are their specific experiences in implementing this proposal?\r\nLinks to information about team members?\r\nI have not seen the proposer mention these things in the proposal to show the feasibility of the proposal.\r\nThis search engine is still at Proof of Concept, not a specific solution, so the proposal's product implementation plan is not yet available. Therefore, it is very difficult to create a real product if everything is still just an idea\"", "q1r": 1, "q2": "There is limited information about what this plan is concretely going to deliver and therefore would make it almost impossible to know what success measures or any other metrics could be use to track and follow the progress of this proposal.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This proposal addresses the challenge as it relates to Cardano, and proposed a unique way to browse existing NFT in the ecosystem. But marketplaces have already have lists of NFT(s) with addition of being a platform for users to sell their digital assets.  On step five, elaboration on \"comment on NFT\" would be helpful to further understand the proposal that I'm currently missing out.", "q0r": 4, "q1": "As having platforms that allow users to search Cardano NFT(s), be it marketplaces or even websites such as wencnft.com/slavetothescreen.com, the key point missing on the solution is the value that it provides for front-end users. Though relevant experience stated are pretty reasonable, but what is lacking is the key metrics and future vision of the project. ", "q1r": 3, "q2": "Budget allocation is not provided, in terms of developing the Search Engine and the infrastructure funds. Breaking down the cost will be essential to have better auditability. Moreover, a detailed timeline of the steps given would successfully create a well verifiable plan. (When will the project be implemented ie; Q1/Q2 year. What are the challenges that will be faced to make the project successful. How can it benefit the community in the Cardano ecosystem, if there are other options to search NFT(s) based on policy ID and token name).", "q2r": 2, "assessor": "z_assessor_669", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "This proposal focuses on releasing a search engine that searches on Cardano tokens based on metadata [based on a worked test build but needs improvements]. Your problem statement makes sense and convinces me.\r\nConceptually, I think it has a certain fit for the challenge. The solution is having satisfactory and has a potential impact. Based on the given information, I can agree with this proposal's impact, and would give it a score of 4.", "q0r": 4, "q1": "Since this proposal lacks important information [team profile with links for verification, KPIs, budget breakdown, and of course, the risk], the proposed improvement plan of your search engine is not quite clear [even information of test version of this search engine is not provided]. Therefore, it is hard to agree on its feasibility. As a result, based on the given information, I disagree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "For better understanding, some information needs to be provided: (1) test result of this search engine; (2) team member profile; (3) Budget structure with explanation for each item; (4) KPIs; (5) Risk and mitigation. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Liberar um mecanismo de busca que pesquisa em fichas Cardano com base em metadados. Temos uma construção de teste que funciona, mas precisa de melhorias.", "experience": "Atualmente administramos o pool de participações BBHMM desde a ITN.  Nossa equipe gerencia a infra-estrutura e executa aplicações de segurança 24/7/365."}