{"id": 385019, "author": "allisonfromm", "title": "Catalyst Circle Mentorship", "url": "https://cardano.ideascale.com/a/dtd/385019-48088", "category": 26248, "amount": 10000, "description": "Os membros do Círculo Catalisador (CC) servem por curtos períodos de tempo. A mentoria do círculo anterior é necessária para assegurar transições suaves.", "funded": 2, "upvotes": 72145436, "downvotes": 4789758, "votes_result": 67355678, "votes_cast": 250, "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta proposta visa assegurar que a transição entre diferentes versões do Círculo Catalisador seja otimizada através da inclusão de um papel de mentor no processo. A partir do meu entendimento da proposta, isto visa assegurar que a qualidade entre versões seja mantida e que o novo Círculo tenha uma base sólida para se manter quando começar de novo. Considerando que a Governança Catalisadora está em constante mudança (visando a descentralização), é minha opinião (como membro experiente da comunidade) que isto seria muito valioso para acrescentar alguma estabilidade nas pessoas que são escolhidas para fazer parte do Círculo Catalisador. Isso afetaria todo o ecossistema do Catalyst, e com crescente importância no ecossistema Cardano como um todo, afetaria positivamente toda a comunidade Cardano. Como os fundos solicitados absorvem apenas 5% do orçamento total do desafio, parece ser um investimento econômico muito pequeno para um investimento a longo prazo no ecossistema como um todo. A solução está diretamente correlacionada com a declaração do problema tanto em uma perspectiva macro como micro, e detalhes sobre o processo são explicados claramente dentro da proposta. Sendo membros experientes da comunidade de Cardano e Catalyst, as pessoas envolvidas têm uma profunda compreensão do processo e do projeto. De modo geral, concordo plenamente que esta proposta trata efetivamente do desafio.", "q0r": 5, "q1": "As pessoas envolvidas são todas membros bem conhecidos da comunidade Catalyst. No momento de escrever esta proposta, ideascale anonimizou os perfis dos proponentes, tornando difícil a verificação da experiência e identidade da equipe proponente. O plano detalhado da proposta nos fornece uma estrutura clara e explicações e raciocínios subjacentes para as escolhas feitas. Gosto da idéia de integrar o CCv1, mesmo que seu período de serviço tenha sido oficialmente encerrado. Desde o momento em que estive envolvido no Catalyst, concordo com o foco dos proponentes em envolver membros anteriores da CC a fim de obter uma perspectiva mais ampla e maximizar as aprendizagens. O objetivo de refinar o processo eleitoral para o CCv3 também é uma boa inclusão nos objetivos da proposta. A repartição do orçamento é apresentada claramente com alocações de fundos para os membros do CCv1/CCv2, todos eles bem conhecidos dentro da comunidade. Concordo que é altamente provável que esta proposta seja implementada com sucesso.", "q1r": 4, "q2": "Uma lista de resultados claros é fornecida na proposta, juntamente com alguns KPIs divididos entre CCv1 e CCv2. A fim de aumentar a força e a clareza da proposta, eu teria gostado de ver um prazo estimado incluído no roteiro. Mesmo sabendo que cada CC serve por 3 meses e que a proposta visa focalizar a CCv1/v2 e, até certo ponto, a CCv3, seria benéfico incluir uma imagem mais clara do prazo estimado. Pode estar faltando algumas informações ou interpretações erradas, mas se esta proposta funcionar em conjunto com os Círculos Catalisadores, isso também significaria que as informações sobre o progresso podem ser incluídas nas prefeituras semanais? Se este for o caso, seria uma boa maneira para que as pessoas pudessem acompanhar o progresso do sucesso das propostas, e a transparência de todo o projeto. Também gostaria de ver algumas reflexões sobre gestão de risco, ou desafios potenciais (e como a equipe pretende lidar com eles) que possam surgir. Isso aumentaria ainda mais a credibilidade da proposta e da equipe por trás dela, e aumentaria a confiança no Círculo Catalisador, pois mostraria às equipes a capacidade de ter perspectiva. Em geral, concordo que a proposta me fornece informações suficientes para avaliar o progresso na realização de seus objetivos declarados. (", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 19, "ne": 14, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "O problema está claramente exposto e explicado nesta proposta.  Para que o Círculo Catalisador possa evoluir e melhorar com o passar do tempo, novos membros precisarão ser capazes de saltar diretamente para suas tarefas e responsabilidades sem muito tempo para aprender por conta própria.  Isto cria uma necessidade para os antigos membros de orientar e orientar os novos membros na forma de passar conselhos, dicas e sugestões até mesmo para o que não deve ser feito.  É justo dizer que a descentralização é o aspecto mais importante para o futuro de Cardano, e esta proposta faz um bom trabalho para explicar como a solução desta questão (ex-alunos não remunerados) irá contribuir para a futura governança de Cardano.  O tempo de todos é cada vez mais valioso hoje em dia e é uma grande idéia incentivar os ex-alunos a fornecer seu tempo e esforço para a mentoria de novos membros.", "q0r": 5, "q1": "Esta proposta é diferente da maioria, em sua simplicidade para o que é a questão em questão, e em sua simplicidade para como resolvê-la.  Não há realmente nenhuma explicação técnica necessária e existem apenas algumas variáveis a serem consideradas.  O orçamento é dividido em v1 e v2 do Círculo Catalisador, mas não tanto quanto a forma como cada ex-participante será compensado.  O orçamento é razoável e não retira de outros projetos potenciais.  Pode ser benéfico para os eleitores que não sabem quantos membros há no Círculo saber como cada membro será compensado, mas tudo isso é uma boa idéia e fácil de executar para que os futuros Círculos Catalisadores estejam bem equipados para fazer seu trabalho.", "q1r": 5, "q2": "Como foi dito acima, a complexidade do roteiro e dos KPI's para esta proposta não é mantida no mesmo padrão que a maioria das propostas devido à simplicidade e necessidade do que a proposta está pedindo.  Entretanto, pode ser benéfico incluir um número necessário de reuniões com novos membros para os ex-alunos, para que eles saibam o que se espera deles e como eles devem administrar seu tempo pessoal.  Acredito que o problema e a solução estão claramente definidos.  Também é claro que o problema tem potencial para crescer no futuro se os ex-alunos não tiverem nenhum incentivo para orientar os novos membros uma vez que seu tempo tenha sido cumprido.  Todos nós queremos que Cardano e seu sistema de governança sejam eventualmente totalmente descentralizados e bem sucedidos.  Esta proposta é obviamente um dos primeiros passos que precisam ser dados para garantir que isso aconteça.", "q2r": 5, "assessor": "z_assessor_990", "no_vca": 27, "ne": 17, "ng": 8, "nfo": 2, "vca_o": 2}, {"q0": "Cardano Circle has added value and provided a core base for the community to take responsibility. There is a need for continuity and to ensure accountability it will be better for the community to pay for the services it gets from its representatives.", "q0r": 5, "q1": "The proposal does not involve significant efforts from the proposer to implement. It is just a request to the community to pay for the services rendered by Community circle members. ", "q1r": 5, "q2": "The proposal is for paying an outgoing member to mentor the new incumbent. This payment process is required for maintaining the continuity. To ensure accountability, there is a need to pay the appointment holders. In this perspective, the proposal is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "It proposes something logical, to receive money for work that is currently being carried out and that receives no compensation, which is unfair in proportion to what they contribute to the community.", "q0r": 5, "q1": "This proposal has been submitted by a Catalyst Circle member so this person is spending a lot of time trying to help other people to do and understand the roll for what they have been elected. This shows by itself proven experience.", "q1r": 5, "q2": "Yes it is, it tells really well all the duties of the Catalyst Circle members and all the tasks they have to do to contribute to the Catalyst project.", "q2r": 5, "assessor": "z_assessor_765", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}], "solution": "Financiamento via Catalyst para garantir tempo adequado para que os membros do Círculo anterior forneçam mentoria e assistência ao novo Círculo.", "experience": "Os ex-alunos do CC são eleitos membros da comunidade catalizadora de setores-chave do ecossistema para identificar e resolver interesses mútuos."}