{"id": 384973, "author": "binh", "title": "An asset token platform on Cardano", "url": "https://cardano.ideascale.com/a/dtd/384973-48088", "category": 26243, "amount": 30000, "description": "Неликвидные активы (запасы, недвижимость, другие) были лишены ликвидности. Токенизация таких активов создает для них ликвидность.", "funded": 1, "upvotes": 41766547, "downvotes": 17752114, "votes_result": 24014433, "votes_cast": 136, "f6_no_assessments": 3, "f6_rating": 3.3333333333333335, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=3603"], "media": [], "f6_assessments": [{"q0": "This proposal directly addresses the spirit and intent of the Challenge.", "q0r": 5, "q1": "While the author is impressively educated, the how is missing. How will this project after the creation of its utility token and its asset token convince users to relinquish their ownership of real-world assets to this project?  While the technical seems largely covered, the business plan is missing in its entirety--> these are very very different customers to serve: \"Three main components of the asset token platform on Cardano:\r\n\r\n• Asset tokenizsation service\r\n\r\n• Barter exchange\r\n\r\n• P2P decentralized lending\r\n\r\n- The Vietnam asset markets:\r\n\r\n• Commodity inventories (of SMEs)\r\n\r\n• Real Estate\r\n\r\n• Corporate bond and equity.\"\r\n\r\nThere does not appear to be a plan to add business skill to this project team, therefore, the likelihood of this project's successful implementation is less than highly likely. ", "q1r": 2, "q2": "My earlier comment about the dearth of business plans underlies the general insufficiency of auditable plans for progress and success.\r\n\r\nThe roadmap is broad, containing actions that are actually quite large unauditable collections of actions, for instance: \"- July– December 2023: increasing member number of barter exchange up to 1000; connecting the platform with the global crypto exchanges.\"", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 17, "ne": 0, "ng": 9, "nfo": 8, "vca_o": 1, "reply": "1. Regarding Feasibility: you are absolutely right. In this 1st draft proposal, we are not giving an answer for how.\nIn the whitepaper, we are going to make a business plan in detail.\nWe are also verifying the types of risk this Project is going to face with.\n\nBriefly, the main types of risk include techical risk, economic and market risks, legal and regulatory risks.\n\nEconomic and Market risks: This business model relates to:\nTokenizing assets\nCustody and Asset evaluation/auditing;\nTrading and lending based on asset tokens;\n\nLegal and regulatory risks:\nThere is still lacking of legal framework to run Defi lending and crypto exchange in Vietnam. This model should get sandbox’s permission of the local government;\nTokenizing real estate assets also encountering with legal and regulatory risks; the legal framework for this is not clear yet;\nRegarding to tokenizing financial assets (equity and bonds), it is also lacking legal framework.\n\n2. Regarding to Auditability:\nI would like to add some for KPIs, which help Cardano Community doing audit easier in the implementation proces of the Project:\n\nRoadmap:\n-\tNovember – December 2021: building up development team\n03 DeFi developers, 01 legal expert, 01 banking and finance expert\n\n-\tJan – March 2022: Writing technical document and making MVP:\nKPIs:\n•\tTechnical document:\nTechnical design of the asset token platform on Cardano: \nAnswering the question: whether it is feasible technically;\n•\tBasic designing of MVP: including three key components (i) wallet application; (ii) crypto exchange (decentralized P2P lending model); and (iii) barter exchange;\nFund: raising fund from Catalyst Fund 7 (USD 30,000)\n\n-\tApr – Sep 2022: issuing whitepaper and accomplishing MVP:\nKPIs:\n•\tWhitepaper\n•\tAccomplishing MVP (wallet application, crypto exchange, barter exchange)\nFund: raising fund from Catalyst Fund 8 (USD 50,000)\n\n-\tJuly – December 2022: running test-net (building up a barter exchange with 100 SME members)\nKPIs:\n•\tBarter network: 100 corporate members\n•\tAsset tokenization value: VND 100 billion (USD 4.5 million)\n•\tTrading volume: VND 50 billion (USD 2.3 million)\n•\tLending revenue: VND 23 billion (USD 1 million)\n•\tCrypto holder participants: 10,000 persons\nFund: raising fund from public (IEO), USD 10 million\n-\tJan – June 2023: running main net (expanding member number of the barter exchange up to 500 SMEs; connecting with the global crypto exchanges)\nKPIs:\n•\tBarter network: 500 corporate members\n•\tAsset tokenization value: VND 500 billion (USD 22 million)\n•\tTrading volume: VND 250 billion (USD 11 million)\n•\tLending revenue: VND 100 billion (USD 4.5 million)\n•\tCrypto holder participants: 50,000 persons\n\n-\tJuly– December 2023: increasing member number of barter exchange up to 1000; connecting the platform with the global barter networks.\n•\tBarter network: 1000 corporate members\n•\tAsset tokenization value: VND 1000 billion (USD 44 million)\n•\tTrading volume: VND 500 billion (USD 22 million)\n•\tLending revenue: VND 200 billion (USD 9 million)\n•\tCrypto holder participants: 100,000 persons\n"}, {"q0": "This is definitely a good idea to address a problem that the Cardano chain currently suffers from, which is the lack of a market for trading traditional/real assets in its Defi space.  However the explanation for how it can bring value to Cardano is vague at best.  What about the idea will onboard those who are outside of the crypto environment, as well as those already using the linked platforms on Ethereum?  This proposal idea definitely falls within the specifications of the challenge, but again the KPI's and goals are vague and do not provide much of a \"how?\"  It also mentions goals of scaling up to more exchange members as time goes on but there is no explanation provided for how the project plans to do that either.  I would suggest for future proposals to go into more detail on how each goal will be accomplished.  ", "q0r": 2, "q1": "This proposal provides great references to how this idea has succeeded on Ethereum.  However it has not provided much information on the team's experience in this area.  Based on the roadmap it is unclear whether a team has even been established yet.  The requested budget seems to only be enough to propel the proposal through step 1 of the road map (paying the team through March to write the technical document.)  What is your plan for additional funding past that point?  How much additional funding will the project require?  Will the project use social media, a token sale, VC funding, etc?  As stated above, there is very little clarification on \"how\" any of the roadmap milestones are to be accomplished.  I am also curious what type of obstacles the project has ahead of it in order to successfully penetrate such markets as the Vietnam real estate market and others, both legally and politically.  I really am intrigued by this proposal, but in the future I would recommend being more thorough in order to justify the use of the Catalyst Fund.", "q1r": 2, "q2": "The roadmap for the project is not too ambitious for such a large proposed undertaking.  Each goal provides flexibility on when it is to be completed with a wide range of completion dates.  However that can also be viewed as a lack of knowledge on how long each goal will/should take.  The main goal for success of this challenge is to have four Defi dapps launched on Cardano in 2022.  Based on the roadmap this proposal will not be set to launch until early to mid 2023.  The roadmap also states that membership is to be grown leading up to test-net and into main-net but does not provide details on how the community will be grown.  For future proposals I suggest a heavier focus on clarity and process details.  ", "q2r": 3, "assessor": "z_assessor_990", "no_vca": 26, "ne": 6, "ng": 13, "nfo": 7, "vca_o": 1, "reply": "1. Regarding to Impact: the CA's comment seems not be consistent with the Score (2 stars). \nAs I am reading the CA's opinion about the impact of my proposal, I have feeling that CA agrees with the Proposal in term of its Impact on Cardano community. \n2. Regarding Feasibility:\n(1) I strongly agree with CA's opinion, This 1st draft proposal has delivered little clasification on \"how\" any of the roadmap milestones to be accomplished. \nIn the next stage, our whitepaper is going to handle this issues in more detail.\nAnyhow, I may add some more specific KPI indicators, which may help clarifying more clealy the implementation proces of the Project:\nJan – March 2022: Writing technical document and making MVP:\nKPIs:\n•\tTechnical document:\nTechnical design of the asset token platform on Cardano: \nAnswering the question: whether it is feasible technically;\n•\tBasic designing of MVP: including three key components (i) wallet application; (ii) crypto exchange (decentralized P2P lending model); and (iii) barter exchange;\n\nApr – Sep 2022: issuing whitepaper and accomplishing MVP:\nKPIs:\n•\tWhitepaper\n•\tAccomplishing MVP (wallet application, crypto exchange, barter exchange)\nFund: raising fund from Catalyst Fund 8 (USD 50,000)\n\nJuly – December 2022: running test-net (building up a barter exchange with 100 SME members)\nKPIs:\n•\tBarter network: 100 corporate members\n•\tAsset tokenization value: VND 100 billion (USD 4.5 million)\n•\tTrading volume: VND 50 billion (USD 2.3 million)\n•\tLending revenue: VND 23 billion (USD 1 million)\n•\tCrypto holder participants: 10,000 persons\nFund: raising fund from public (IEO), USD 10 million\n\nJan – June 2023: running main net (expanding member number of the barter exchange up to 500 SMEs; connecting with the global crypto exchanges)\nKPIs:\n•\tBarter network: 500 corporate members\n•\tAsset tokenization value: VND 500 billion (USD 22 million)\n•\tTrading volume: VND 250 billion (USD 11 million)\n•\tLending revenue: VND 100 billion (USD 4.5 million)\n•\tCrypto holder participants: 50,000 persons\n\nJuly– December 2023: increasing member number of barter exchange up to 1000; connecting the platform with the global barter networks.\n•\tBarter network: 1000 corporate members\n•\tAsset tokenization value: VND 1000 billion (USD 44 million)\n•\tTrading volume: VND 500 billion (USD 22 million)\n•\tLending revenue: VND 200 billion (USD 9 million)\n•\tCrypto holder participants: 100,000 persons\n\n(2) CA is also considering types of obstacles the project has ahead.\nYes, the Project is encoutering some types of riks, including the legal and regulatory risks.\nThere is still lacking of legal framework to run Defi lending and crypto exchange in Vietnam. This model should get sandbox’s permission of the local government;\nTokenizing real estate assets also encountering with legal and regulatory risks; the legal framework for this is not clear yet;\nRegarding to tokenizing financial assets (equity and bonds), it is also lacking legal framework.\nIn the whitepaper, we are going to present on these risks in more detail.\n(3) CA is worrying about the Project team. It is correct that the team is not established yet. \nBut now we are considering to build up the development team with the following members:\n\nNguyen Thanh Binh, team leader, Economics & Banking Expert\n03 Defi experts:\nNguyen Duc Nam: founder of DIASNFT.IO; major in servers, server app such as Cardano-node; Cardano-wallet; system architecture. 13 years of experience in building and developing websites and mobile apps.\nHoang Cao Cuong: founder of DIASNFT.IO; major in Smart Contract. 13 years of experience in building and developing websites and mobile apps.\nDr. Dang Minh Tuan: Head of Blockchain Lab, Professor of the Post Telecommunication Techology Academy; author of Vietkey typing code; Research on Blockchain since 2014 (Cryptography, Smart Contract, Consensus algorithms, etc.)\n01 Legal experts:\nTruong Thanh Duc: Lawyer ; more than 35 years of professional attorney experience in the fields of business, finance, banking, and insurance; 27 years of service and management in enterprises, including 19 years at 4 commercial banks.\n\n(4) Regarding to requested buget: \nCurrently, Proposer only requests fund for step 1 - to set up the development team and write technical document;\nWe are going to raise from Fund 8 (Cardano Catalyst) for next step - writing the whitepaper and making MVP (estimated USD 50,000);\nThen we will launch IEO to raise fund for Project implementation (running test net and further)."}, {"q0": "The proposal addresses the future where everything will be tokenized as mentioned by Charles Hoskinson by proposing a asset token platform. The proposal aligns with the challenge and tackles real world opportunities in the near future. The proposer also provide examples of reaseach in the space as we as similar projects on Ethereum.\nMetrics are presented in a way of a number of SME onboarded.\nHaving such an exchange would clearly benefit the wider DeFi (asset) growth on Cardano.", "q0r": 5, "q1": "The proposer is an experienced Ph.D with background in finance, but would need to build the team to deliver. The background info on similar projects is extensive, but the actual implementation on Cardano is a bit lacking due to the lack of IT background. With that in mind, time estimates might be arbitrary and are not adressed as risk. It would be beneficial to see some risk mitigation or possible challenges and is the reason for point deduction.\nThe budget is clear, for required personnel costs only. ", "q1r": 4, "q2": "Roadmap and milestones are defined, as well as measurable KPIs. It would be easy to monitor if the expected values have been reached to measure the success of the platform.\nThe problem (lack of real world asset tokens - inventories, real estates, others) that is addressed is clear and the solution (asset platform) is sound. The platform would provide liquidity for these assets by turning them into smaller parts which are more easily tradeable.", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 24, "ne": 5, "ng": 17, "nfo": 2, "vca_o": 1}], "solution": "Построение платформы токенов активов на Cardano, в сочетании с бартерной биржей, дает хорошее решение проблемы неликвидности реальных активов.", "experience": "Г-н Нгуен Тхань Бинь (руководитель группы): Доктор экономических наук (Virginia Tech, VA, США), 22-летний опыт работы в банковской и финансовой сфере."}