{"id": 367405, "author": "", "title": "Stop giveaway scammers", "url": "https://cardano.ideascale.com/a/dtd/367405-48088", "category": 26118, "amount": 23000, "description": "チャールズが最近のビデオで述べたように、多くの人がyoutubeで詐欺に遭っています。例えば\n\nhttps://tinyurl.com/cardano-forum-example", "f6_no_assessments": 6, "f6_rating": 1.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal raises the problem of giveaway scams and aims to provide a verifiable signature as well as a short video and a mailing list/website reporting scams. This challenge, tho, aims to set up community hubs and drive adoption through these hubs. Hence, this proposal does not meet the criteria set for this challenge. New users would not benefit from a video about possible scams, because it would not reach them. The video and the other ideas provided would only reach users that are already in the crypto community - again the reason why this proposal does not meet the challenge settings.", "q0r": 1, "q1": "The proposer wants to provide a short film, an ad campaign and language translation as well as verifyable signatures for employees of IOHK. Relevant experience does not match the objectives as the proposer states himself, so he would have to onboard a team to be able to implement his ideas. Given that there is no information about prior work or relevant experience, implementation of the proposal is at the moment not likely. While a verifiable e-signature would be good for people working with Cardano in official roles, the proposer does not state if he conteacted Emurgo, IOHK or CF to ask them if they have verifiable signatures or not and would be interested in a Catalyst community member providing this work for them, making it difficult to decide if the proposed idea is relevant seeing that both IOHK and Emurgo is a tech-focussed company and they might be able to set up or already have an e-signature like the one proposed by Edwin. Additonally, this proposal is kind of all over the place. The problem statement is about give-away scams. The signature solution is not included in the roadmap so no information about possible future implementation of this part of the proposal is given. The roadmap itself does not contain milestones and actionable steps so implementation is not likely at this point. Additionally, his idea is referring to \"Charles Video about give-away Scams\" and he wants to make a video about give away scams to give to Charles (and others). Well..... the propoer himself noted in his proposal that there is a video from Charles, so this proposal would clearly have to explain why an additional video would be better than the one that Charles H. already provided on this topic. While I´m not saying it´s not relevant, I am saying that necessary information to understand the value of the idea is missing. Prior commitment or work of the proposer is missing as information. Financial budget is broken down clearly, but the proposal would still add no value to this challenge so giving out funding in this challenge for this idea would not address the goals of this challenge effecvtively.", "q1r": 1, "q2": "No roadmap, no team, no milestones, nor actionable steps are given in this proposal making it not auditable. The relevant prior work (for instance contacting IOHK officials to ask them about the verifyable e-signature) has not been done or not provided in the proposal. The proposal does not meet the challenge criteria. No measures of success are given. No team is set up. Challenges and risks have not been addressed.", "q2r": 1, "assessor": "z_assessor_19", "no_vca": 14, "ne": 10, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "-This proposal does not address the objectives laid out in the challenge. The proposer wants to create more online awareness about scams happening in the crypto ecosystem. This challenge is about creating local (real world) hubs across the globe. The emphasis the key metric should be onboarding new users and growing Cardano ecosystem on ground level.\r\nI strongly disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 1, "q1": "-The solution as stated by the proposer is to create social media verifiable signature that the Cardano ecosystem could use in order to mitigate scams from happening.\r\nThis verifiable social media signature, under detailed plan is described as a short (30 seconds) video, that is to be used as an add to the official Cardano online community appearance. This video add should deliver the message that Cardano or the IOHK officials don't make any giveaways. From my own Youtube and other social media experience, this proposals video add solution a scammer could circumvent with ease. The scams that I have seen all were recorded, copied and redacted videos that run on loop with additional scam information. The scammer can edit any video and cut any part out or edit in any way. The proposed solution I don't expect to be a viable one against this difficult viral problem.\r\n-The budget for this proposal is extremely over extended, taking into consideration more than 20% of overall challenge budget. \r\n-The math in the budget description shoves some inconsistencies. For the short, 30 seconds, video add, the subtitle text translation into 100 languages is multiplied by 50$ per hour, this implies that per language it takes an hour to translate 30 seconds of video message. Furthermore the 100 languages are not described in any way nor is there a mention about which languages are intended for the translation.\r\nI rate the feasibility with a score of 1. \r\n", "q1r": 1, "q2": "-This proposal did not present any roadmap or success metrics needed to define the auditability  of this proposal.\r\n", "q2r": 1, "assessor": "z_assessor_276", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Although addressing scamming could provide some safety to the community as a whole which could, in turn, lead to adoption through users passing on their favorable experience to others, I'm not sure that anti-scam ads and verifiable digital signatures will address the challenge's view of success being that of \"creating local community hubs across the world where the average person can take part in their own language.\" If anti-scam campaigns do result in local community hub creation, I think the proposal could be improved by helping the voter to connect those two points in terms of cause and effect. Because I do not think the proposal will produce success as determined by the challenge definition, I am giving it a \"2\" rating.", "q0r": 2, "q1": "The proposer states that they have \"technical experience\" but do not elaborate on what kind of technical experience that is, nor provide any other links or information in that regard. The budget seems reasonable and is broken down sufficiently. However, as a video producer with 20 years of experience, hiring a 30 sec. ad crew for a small budget like 3K takes a degree of experience and competence in and of itself. If the proposer does not have such experience or a team member that does, hiring video professionals could be more difficult than anticipated. One very reasonable challenge to implementing this idea that is made known in the comments is that it could be difficult to achieve mass creator usage of the verified digital signature. I think the proposal could be improved if this challenge/risk were addressed in the proposal and thorough descriptions of experience were given. I give a \"3\" for implementation success.", "q1r": 3, "q2": "The proposer has definitely identified a problem and offered an understandable solution. Although a general roadmap of, creating mailing lists to making a website to creating/running a video ad to developing petitions, has been put into place, without a timeline to accompany the roadmap, it would be difficult to assess progress on this proposal. Further, this proposal does not include a way for key metrics, as defined in the challenge (new hubs, new devs, new users, new organizations onboarded), to be measured. In the future, the proposer could include a timeline with measurable metric outcomes as a way of improving it. For these reasons, I'm providing a \"1\" as the rating.", "q2r": 1, "assessor": "z_assessor_295", "no_vca": 13, "ne": 8, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The proposal highlighted a problem and proposed a solution, however the solution will need more details as to the provided solutions are more of suggestions than a true solution (\"First of all, we are creating multiple mailing lists (in different languages) where we announce people on ongoing scams (here people will have to report it).\"). \r\nI can neither agree nor disagree.\r\n", "q0r": 3, "q1": "No links to given experience was provided and no clear implementation plan with clear timelines and milestones .\r\n I disagree.", "q1r": 2, "q2": "the proposal provided sufficient information to audit the progress and success of the proposal solution, however , this is for a faulty and unclear solution to the given problem of the proposal.\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "While Anti-scam-measures are important, there are already many of them done feom many places. Additional measurements should always becwelcone hiwever, IF they are well planned. Maybe you should do a more thorough analysis of the current flaws and loopholes is the system and repropose with a more concrete action plan :)", "q0r": 3, "q1": "The plan could be more detailed and lacks a roadmap. While a rationale for the budget is there, it is not very detailed. You could provide some more background info about yourself as a person in order to give people a more credible pictures of your qualifications.", "q1r": 2, "q2": "While some products are defined, apart from that netrics and milestones are missing, so it is difficult to audit the proposals success.", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been a member of the community for almost an year now, I am fully aware of the scam problem in the crypto space and I have experience analyzing business requirements from 7 years of delivering software as a QA engineer.\r\nI think the problem statement is clear, since an example of a person being scammed is also given, but as a suggestion for the future, I think that if a video is mentioned in a proposal, it should be linked in it as well, to help give people better context.\r\nWhile I understand the idea and intention behind the first part of the solution (creating a social media verifiable signature for Cardano related officials), I have to echo what Steven Aldrich said in a comment and mention that I don't think it's feasible to add this intro to all the videos that are made in the future. Aside from the added effort to the people creating content, I don't think it would be very effective since:\r\n1. Like Steven said, scammers use live videos, which this intro would not apply to.\r\n2. Even if a solution for that were found, scammers would just use older existing videos.\r\nThe anti scam ads in multiple languages are a more viable option in my opinion, if only a way to bring them to the public cheaply could be found.\r\nWhile it is clearly mentioned that many people are getting scammed and most of us assume that everyone knows that it is bad for growth, I think that in order for this proposal to be more impactful, it should also mention specifically what problems scammers can cause:\r\n- they can scare people away from crypto, or worse, just from Cardano, for along time, or maybe forever\r\n- the longer this works out for scammers, the more other people will be incentivized to do this\r\n- they create a bad reputation for Cardano (if scammers are successful here, dishonest adversaries will use that as fuel to convince others the entire project is a scam). Worse, it could also attract media attention, the same way some Bitcoin scams have done it, making even people currently uninterested in Cardano think it's something bad.\r\n- they put a strain on Charles and other IOHK officials, which we, the community, should try to protect them from, if we can (Charles has received death threats about this, so it's not unlikely that other IOHK employees will get them as well.\r\nOtherwise, I think that the proposal is properly placed in this challenge, since to my knowledge, non-English speaking people are the most affected by this problem, which will negatively impact our ability to grow Cardano's community hubs.\r\nDue to the above mentioned reasons and the fact that no metrics for success have been mentioned, I have to disagree for now that this proposal effectively addresses the challenge. I want to reiterate however that the problem is indeed very serious (and very difficult) and we need this type of proposal to get funded eventually - it just needs to identify more viable solutions, in my opinion.", "q0r": 2, "q1": "Unfortunately, I do not think it is highly likely for the proposal to be implemented successfully, as lots of critical information is missing from it. I will present my suggestions on how the proposal can be improved below:\r\n- The proposer should provide more information about himself (LinkedIn page, previous projects, anything that would highlight his skills), in order to convince voters that he is able to get this done. It's good that relevant experience has been mentioned, but it also has to be backed up by a reference, in my opinion.\r\n- The proposer should identify and clearly outline what type of people are needed to work on this proposal (they were mentioned in the relevant experience section, but they should be identified by role) and how he would recruit them\r\n- The roles identified above should be used in the budgeting section (e.g. Animator-10h/$100, Editor 10h/$100, Writer, Narrator, etc). As it stands, the budget is too general to be convincing enough in my opinion. I don't have experience in the process of creating ads or films from scratch, but $100 per hour looks arbitrary to me at the moment. The campaign budget of $1000 per month also looks arbitrary. It should be clarified what platforms are targeted, how much running ads on them costs etc.\r\nThe website budget is also too general (we need to know every role and the associated costs). Note that in the meantime, this page (https://cfdb.atlassian.net/servicedesk/customer/portal/1) was created by IOHK for reporting scams.\r\nRegarding the text translations: I think the hourly rate is a bit steep there as well ($20-30 seems more realistic after a bit of Google searching). Also, in my opinion research would be necessary to identify what regions the people who are falling for the scams most are and target those languages first. Just deciding to translate into an arbitrary 100 languages would be inefficient.\r\n- A clear timetable of what would be done, when and by whom would also help the proposal build more credibility\r\n- As mentioned earlier, I think the proposer needs to consider the problem and the possible solutions more and thus also outline the risks associated with the proposal's approach and how they would mitigate it. One suggestion is to consider adding a margin error on the budget for unforeseen problems.", "q1r": 2, "q2": "I do not think the information currently present in the proposal is enough to audit its progress, since no metrics for success are defined, there are no KPI's mentioned and there is no clear roadmap to getting this done. However, as I mentioned before, the proposer has correctly identified a very valid problem in the ecosystem, we just also need to see a convincing solution to it. I hope you will come back to this (assuming the project does not get funded this round) and we will see it being done eventually. Good luck!", "q2r": 2, "assessor": "z_assessor_546", "no_vca": 11, "ne": 9, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "カルダノとIOHKの関係者のソーシャルメディアで検証可能な署名を作り、多言語での詐欺防止広告を作る。", "experience": "私は技術的な経験を持っていますが、そのためには、広告の経験、映像制作、翻訳のスキルなども必要です。"}