{"id": 369793, "author": "", "title": "1 Cafe to the World", "url": "https://cardano.ideascale.com/a/dtd/369793-48088", "category": 26118, "amount": 100000, "description": "ロイヤリティの向上、顧客エンゲージメント、ビジネスマネジメントの専門知識で中小企業を支援します。", "f6_no_assessments": 11, "f6_rating": 2.151515151515152, "videos": [], "media": [], "f6_assessments": [{"q0": "For sure token utilization in a cafe could improve the engagement from the community (for example: using it as reward that could be trade for beverages/foods). But, it's too general. We need more detail on how the token will be utilize, how can it attract more people to use Cardano or know Cardano, need more detail on the project plan.", "q0r": 3, "q1": "This proposal needs to have more detail about the usage of the funding (budgeting). And adding team members with expertise on Cardano blockchain would be great. ", "q1r": 2, "q2": "I don't see any KPI or how can the community do audit on the end-result. We need to know more where is the location of the cafe, and how does the token will be used (use case). Adding these details will increase the auditability & the success of this proposal.", "q2r": 2, "assessor": "z_assessor_282", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Even though the idea itself is interesting, it doesn't meet the challenge aims. Community Hub is a thing/place to encourage people to get interested and involved in Cardano ecosystem in general, while this proposal is focused on particular local business. This could be interesting, especially when you have a lot of Cardano branding all over the place. Connect it with regular community meet-ups or presentations and that could become a real hub. Or instead of selling your business, just offer governance tokens (Cardano Native) for every coffee, drink or whatever you have on menu :-)", "q0r": 2, "q1": "Experience of the proposer is relevant, however the plan is too general. I would like to see more details on how are you going to implement tokenization, with phases, also including some legal framework to your plan could be beneficial.", "q1r": 2, "q2": "Looking at the proposal there are no KPIs included. I'd suggest implementing phases of such project to be able to track completion of every one of it: including legal, technical and practical implementation. The author could also consider whether a business success is the most essential thing or rather treat his project as a \"proof of concept\" and serve successfully as a proof that such tokenization can work in real life world, with the usage of Cardano.", "q2r": 2, "assessor": "z_assessor_324", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal lacks details and will do well if the following are provided in subsequent applications.\r\n\r\nDetailed implementation Plan,\r\nTimelines and Milestones,\r\nKey metrics to measure success,\r\nCost implication and breakdown of requested amount to justify the amount.\r\n\r\ni disagree", "q0r": 2, "q1": "The proposal did not provide verifiable link to given experience and lack an implementation plan.\r\n\r\nI disagree.", "q1r": 2, "q2": "the proposal did not provide sufficient information to audit the progress and success of the proposal solution.\r\n\r\ni disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Interesting proposal which needs developement. It articulates how value will be added to the Cardano ecosystem and I am impressed by the strategy to buy 40% of local ingredients form local suppliers.", "q0r": 5, "q1": "No links are provided for as evidence of relevant skills. No realistic timetable and no resources for implementation.", "q1r": 3, "q2": "While this is a brilliant idea a roadmap with milestones for implementation and some metrics would be helpful.", "q2r": 2, "assessor": "z_assessor_348", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The problem statement is ill-formed (i.e. does not actually state a problem), and in addition is vague.  The idea of encouraging local participants to hold tokens which reflect partial ownership in a local business does have merit in terms of potentially increasing use of the eco-system locally, but the main challenge of encouraging world-wide adoption (eg outside English-speaking world, localised to culture) is not addressed and neither are any clear descriptions of the mechanics of how this solution would operate - it is even unclear whether the proposer is talking merely about just their own cafe or a generic solution which could help many small cafes.  Based on this evidence, I strongly disagree that this proposal addresses the challenge.", "q0r": 1, "q1": "Very few details are given of the owner's background with no supporting evidence eg links to professional sites or evidence of achievements stated.  There is no detailed plan, and what is offered is very vague.  There is no schedule/time-line, no budget, no discussion of possible challenges, requirements or any evidenced justification as to why the community should believe this is likely to be implemented successfully.  Based on this, I find it highly unlikely that this proposal would be implemented successfully", "q1r": 1, "q2": "No details of an audit plan are provided. There are no KPIs or any defined numerical metrics offered, or even any specific goals given.  There is nothing about how the proposer would engage with the community to update it as the project progresses, and no specific indication of what \"success\" would look like aside from vague terms and examples seemingly taken from thin air (40%) without justification, evidence or sources.  It is claimed that the value of the token would appreciate, but no evidence is given as to why this would necessarily be the case (tokens do not all succeed just by existing as we have learned by now in crypto), and there is no evaluation given of risks or challenges.  Based on this, I believe the information is wholly insufficient for the community to be able to audit to a satisfactory degree. ", "q2r": 1, "assessor": "z_assessor_403", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "There was no problem in the problem statement. There is no clear relationship between the idea presented and this challenge.\r\n\r\nDraft proposal. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "I agree to the proposal because it's in scope with the above challenge And Using  Cardano native token as a means for people to have partial ownership of local businesses could be an incredible way to grow Cardano community hubs and support local infrastructure at the same time.\r\n Sencondly will also scale to address futre challengies..", "q0r": 4, "q1": "i neither agree nor disagree because detailes was'nt explain that clear the vision on how everything is going to look like,\r\nthe budget must have some listed things to be use for.\r\nNo links to track..but the idea about the proposal sound reasonable so the should be more imfo's. is it needs to be funded", "q1r": 3, "q2": "No much informations to audit,  You can only visit his page and email him but no links to check past ecperiences..\r\n  No cleally laid out road maps to.. \r\n Has a clear understanding description about the challenge but not more info's to solve it...", "q2r": 3, "assessor": "z_assessor_447", "no_vca": 9, "ne": 3, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "I agree with this proposal because the problem has been identified ", "q0r": 4, "q1": "This proposal has no budget layout or plan as to how funds will be used appropriately. It also has insufficient links and risks factor considerations which makes it lack clarity.", "q1r": 3, "q2": "This proposal has no clear roadmap and timelines for solution accomplishment.\r\nThe description of implementation processes is not much.", "q2r": 3, "assessor": "z_assessor_497", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "The proposal appears to focus on launching a new ADA-based token that would be used as a loyalty system within a cafe (owned by proposer), which could then be tradeable externally and have some additional involvement with outside businesses, maybe help them raise capital somehow for their own businesses. It seems like a good idea to organize and incentivize involvement in a community/business hub, which could pull in additional businesses, but the details on the steps for that in this proposal are quite sparse. ", "q0r": 3, "q1": "The details, tokenomics, and business plan are unfortunately quite underdeveloped in this proposal. A rewards system based on a single business makes sense. How that will then involve other businesses seems to fall apart. Are other businesses giving equity ownership in their business in exchange for tokens? Or are they buying into the token pool and then using them for their own incentivization system? There's still some stuff to figure out here, on how it's grown beyond a single business loyalty program. Also, the proposal is asking for 100k, a reasonable chunk of change for a single fund, but gives no details as to how those funds will be allocated in development of the protocol. How do customers interact with the token? Do they use their own yoroi wallet, or is there an app for the cafe that manages in a side chain, but within the loyalty app (eg tracking your \"points.\"", "q1r": 2, "q2": "There are no KPIs, timelines, or steps listed in the plan, and thus no metrics that can be made to track or audit progress.  Such as 1. Launching of the new Token. (and give expected dates) 2. Getting app launched for internal tracking and rewarding of points (customers need the app or their own wallet), give expected launch dates... and so on.", "q2r": 1, "assessor": "z_assessor_517", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal contemplates a tokenized cafe, not really a Cardano Community Hub. ", "q0r": 2, "q1": "The technical tasks are not broken out, making it difficult to judge ability to execute.  It would be helpful to show a plan for promoting the token.  Unclear how the project will gain adoption. Considering the limited benefit to the Cardano community, the budget seems excessive. ", "q1r": 2, "q2": "There are no metrics or KPIs in the proposal aside from businesses purchasing 40% of ingredients from local suppliers.  It would be helpful to show clear deliverables and summarize risks and challenges.  ", "q2r": 1, "assessor": "z_assessor_607", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This is a great idea and relevant for the challenge. The solution suggested is very innovative and can create stronghold local community hubs. The problem is presented more as a statement than a problem. \r\n\r\nI would suggest presenting the proposal for your Cafe as a POC for a model that could be duplicated in multiple locations creating community-driven Cardano local hubs.\r\n\r\nMore info about the Cafe (location, number of places, space for meetings…) will be important and helpful. One suggestion is that you can start engaging with local Cardano community members, create a few events, and brainstorm together about the model. You will get first adopters and some teamwork support. \r\n", "q0r": 3, "q1": "There is very limited information to be able to evaluate the feasibility of the proposal. \r\nNeed more information about the proposal lead experience, what is the plan and next steps, and some key potential milestones. \r\n", "q1r": 1, "q2": "No KPIs, roadmap, and timeframe. No risks and challenges were considered. \r\nThere is no information to e able to audit the proposal. \r\n", "q2r": 1, "assessor": "z_assessor_636", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "1つのカフェの一部、大部分、または全部をトークン化することで、地域の集会所を中心としたエコシステムを構築します。", "experience": "カフェオーナー、ビジネスアナライスト資格\n\n大規模な組織や個人のソロプロジェクトで活躍"}