{"id": 370061, "author": "", "title": "Cardano Innovation Hub", "url": "https://cardano.ideascale.com/a/dtd/370061-48088", "category": 26118, "amount": 37300, "description": "調整のためのハブや、カルダノ愛好家が協力するためのスペースがないため、エチオピアでのカルダノの成長を制限しています。", "f6_no_assessments": 7, "f6_rating": 3.952380952380952, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal defines a clear and practical path to building exactly the type of Hub described in the Campaign Brief. The value to the Cardano ecosystem is clear - having a central space for members of the community to gather, learn, and collaborate would be extremely impactful. I am not sure that the proposal would scale, but I don't think it is designed to scale, nor do I think scalability is a necessary criteria for this particular challenge. ", "q0r": 5, "q1": "The proposer states that they are the manager of the hotel where the Hub will be established. It is very helpful that these specific details are provided, as this connection makes the implementation seem feasible. A detailed financial plan was provided to support the budget. The plan envisions that the Hub will become self-sustaining in six months, which is appealing. Two factors kept me from rating this aspect with five stars. I would have like to know a bit more detail about the proposers themselves, in order to validate their skills and experience. I really like the inclusion of the financial plan and don't want to be too critical given its inclusion. However, there are a lot of numbers I don't understand on the plan.  For example, the final column lists \"Month 12.\" I assume the numbers in this column do not apply only to the 12th month, but are they for the second half of the year? Or perhaps the year in total? I don't understand what the first column represents (prior to month 1). When I try to add the columns and rows myself, I can't get the math to work out. And I would like more detail around how they arrived at the revenue projections. I commend their efforts to include a budget as it is important to substantiate the funds requested. But more clarity is needed regarding the numbers. ", "q1r": 3, "q2": "A clear road map is provided that breaks the project into four distinct phases. Success would presumably be measured in terms of financial self-sufficiency, and the extent to which the available seats are in use.  The proposal is very clear and concrete regarding what they will build. ", "q2r": 5, "assessor": "z_assessor_278", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This proposal fit into the challenge brief and the team presented a well written proposal The document provided by the team shows step-by-step plan for the implementation with clear milestones and a defined time horizon. I believe this Proposal effectively addresses the challenge , I strongly agree.", "q0r": 5, "q1": "The Proposal claim to already own a co-working space but does not provide any link or information about the existing of the co-working space or the activities of the space in the past. Though given the well presented plan , the implementation will be successfully. For that i score 3", "q1r": 3, "q2": "The document Provides shows a clear plan and milestone for this project but lack the KPI for a sufficient progress audit of the fund, for that its not clear how to measure success in 3 , 6 and 12 months, for that i score 3", "q2r": 3, "assessor": "z_assessor_430", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "I strongly agree to the proposal because it's in scope with the above challenge due the following reasons \r\n1. Community space designed of openness and collaboration will allow people from local areas learn more about cardano and shear their experience.\r\n2. its also going to help improve the cardano ecosysterm by helping others without the knowledge of cardano interupt with others and get beblical details of it, because some people find it difficult to read.\r\n3. The key metric are stated correctly in building the Endubis Hub, that is the furniture aspect , monitors and how to operate everyrhing is detailed..\r\n4. The proposal can help solve future challengies because the vision and the mision of Endubis Hube is to help cardano communities in Ethiopia to come and learn about it and do more research.", "q0r": 5, "q1": "I neither agree nor disagree because looking at the targeted team it involves student of creating and tech, a young enterprenuer who wants to expand or start up a new business etc. So looking at this it would'nt help people from local areas get access to cardano so the Hub (cafe) should be opened to everybody that wants to learn about cardano.. But proposal have an accurate links to their websit and everything is in tourch", "q1r": 3, "q2": "Accurate links to audit and track the proposal if funded \r\n secondly has a clear solution on solving the problem or challenge because the bub is going to help locak aareas in Ethiopia grow through cardano...", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "The proposal takes a non-tech approach to growing the Cardano Community on a local scale, attempting to create a physical hub for those in Ethiopia interested in Cardano and developing for it. Most funds are dedicated to renovating the physical space. ", "q0r": 4, "q1": "The proposer gives a fair amount of detail as to how to they would renovate the space, and the planned philosophies of how the space would involve cross-communication between members of the community. They identified groups to target including students in the Cardano/development space, as well as young entrepreneurs. The plan is absent, though, on the details of how to reach those in that community (developers, entrepreneurs, etc), and how to attract them to want to come to the space. The plan is to do \"word of mouth\" exclusively, which presumes that the proposer has access to the particular networks and credibility within them to be able to spread the word to the right people and to attract them. Which there's no documentation to support, such as examples of communities or groups or universities or university groups that would be contacted. Which the proposer may have but doesn't detail at all in the proposal. How many people in these communities are they currently in contact with? Are there already a quorum of people interested who can be spreading the word to their respective communities. The hope appears to be that if you build it, they will come. The lynchpin of the plan, though, involves getting the space and plan to be known to those that would interested, and the steps to do that are not detailed here.  Furthermore, the proposal lists \"the capacity of the space is very limited.\" Which raises other questions -- how limited? 50 people? 20 people? If it's limited, how much can this realistically grow the Cardano community? Can there be plans to grow beyond the initial space if successful?", "q1r": 3, "q2": "I appreciate the timeline in the presentation deck which does list some loose KPIs (refurnishing the space), which is a bit nebulous on the metrics of real success (how much adoption is enough for this to be self-sustaining or to grow, what are longer term metrics of success such as dapps developing out of collaborations). The evaluation of \"what works? What doesn't?\"  Does not define what \"works\" or success means, how it's measured, etc. No is the definition of \"full\" or \"too full.\"  Further details or thoughts on optimal amount of attendance, turnover/churn, amount of interaction between members, traction of attendees turning into collaborations, number of projects resulting from the space, etc, have not been thought out at all but would be useful in future revisions of the proposal.", "q2r": 3, "assessor": "z_assessor_517", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "A coordination space in Addis Ababa fits well within the goal of scaling up as it holds the potential to grow the business and development side of the Cardano community in Ethiopia. The proposal will add value via a space for Cardano developers and entrepreneurs to work and collaborate. The proposal also contains a clear approach to maintaining the space as a Cardano hub free of charge while assessing a monthly fee for developers working on other non-cardano projects. ", "q0r": 5, "q1": "The proposer does not outline the relevant experience contained on the team only stating that one of the team members has a co-working space and may have expertise in supporting (budding) Cardano developers. The budget table in the attached google doc somewhat outlines the resource needs but omits any mention of cost for wifi (via Ethio Telecom WiFi Hotspots or a wireless mesh routing system) and does not clearly unpack the projected/estimated revenues-expenses rows across the 12 months. The budgetary needs listed otherwise appear to be reasonable however it is unclear if the price of $100 per month for individuals working on non-Cardano projects in the space are anticipated to bear the lion's share of the expenses going forward is reasonable. ", "q1r": 3, "q2": "There is a clear roadmap for designing the space, phasing in community members and cardano developers. The metrics that define success have more to do with the sustainability of the revenue the space can generate than the level of Endubis Hub growth. The problem is clearly articulated and the solution addresses that problem. This proposal might be helped by having a cyclic membership plan for Cardano Ecosystem enthusiasts allowing them to enjoy free access for 3 months (from the start of their time rather than the start of the project) and then in month 4 or 6 requiring them to submit a Cardano-related project proposal to maintain their free access to the space, this may prove to support the continual scaling up of the community. ", "q2r": 4, "assessor": "z_assessor_524", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is well addressing the challenge and provides a great local solution for Addis Ababa. As there is no local hub in the city, it makes sense to have one. The vision is well defined and has long term objective. The target market is well thought and having a common space to work and exchange ideas could be very fruitful. \r\n \r\nIt would have been good to have more information about how the local hub could scale and how many developers, students entrepreneurs, and overall members it could attract. From the google doc you shared, the max capacity will be 25 seats but more information in the main text would have been helpful. \r\n", "q0r": 5, "q1": "The plan seems feasible in terms of the idea and execution for opening the hub and the next steps are defined. However, there is some missing information (I looked also at the PPT and google docs) about the team, positions, and background to better understand the feasibility. The budget is also missing details and has only the total amount requested which makes it difficult to evaluate. \r\n\r\nIt is mentioned that you already have one operational hub and it would have been helpful to get more information about it and see the comparison between the two.", "q1r": 2, "q2": "The main clear deliverable described is the location. Missing some KPIs about the hub members. Finally, missing risk and challenges that will help better understand that those were considered. For example,  what will happen if the hub will not break even as forecasted. It could have been also helpful to have more information about how we verify that the hub is used only or mainly as a Cardano hub, as overall the objective is also to have a self-sustained operation.", "q2r": 3, "assessor": "z_assessor_636", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "I strongly agree that the proposal effectively addresses the challenge. My reasons are below:\r\n1. The problem needing to be solved has been identified and articulated.\r\n2. The proposal falls within the scope of the challenge brief.\r\n3. The proposal shows clearly how it will add value to the Cardano Ecosystem.\r\n4. Key Metrics and goals of this proposal have been stated clearly.\r\n5. The goal and metrics of this proposal falls within the scope of the challenge brief.", "q0r": 5, "q1": "I neither agree nor disagree that given experience and plan presented, it is likely this proposal will be implemented successfully. Why?\r\n1. The budget stated is reasonable.\r\n2 The budget has been broken down into verifiable items.\r\n3. The proposal offers a realistic timetable to complete the work.\r\n4. The structure of the team needed for successful implementation of the proposal has not been rationally and logically laid and broken down.\r\n\r\nBut:\r\n  The proposer provided no evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal.", "q1r": 4, "q2": "I strongly agree that the information provided is sufficient to audit the progress and the success of the proposal. Why?\r\n1. The location of the Hub has been clearly stated for easy traceability.\r\n2. A roadmap with milestones and a time horizon for achievement has been clearly laid out.\r\n3. There is a clear understandable description of the targeted problem.\r\n4. There is a clear understandable solution that addresses the targeted problem.\r\n5. The proposer has identified possible hurdles with sustainability and has provided a workable plan to handle it.", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "人々が経験を共有し、お互いに学び合うことができるように、オープンでコラボレーションを目的としたコミュニティスペースです。", "experience": "今はすでにコワーキングスペースがあり、カルダノの開発者にもっと仕事を集中できるようになりました。"}