{"id": 366965, "author": "", "title": "Treasury & Catalyst Proposal API", "url": "https://cardano.ideascale.com/a/dtd/366965-48088", "category": 26119, "amount": 17200, "description": "No public facing directory of all Catalyst proposals and funded projects: limits the potential to audit, iterate, and innovate.", "f6_no_assessments": 7, "f6_rating": 4.3809523809523805, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is based on making it easy to interrogate the data on funded proposals. Whilst in itself it is not helping to audit individual projects, it is important for the community to be able to track what is going on across the ecosystem. If this could also include information on audited deliverables of projects and produce statistics across challenges and proposers this could be of great use in iterating where and to whom future funding should go in terms of impact and successful project delivery.", "q0r": 5, "q1": "The proposers already have a demo project created and thus are likely to be able to deliver. They have a clear plan with timeframes and deliverables. ", "q1r": 5, "q2": "The proposal has clear deliverables and timeframes allowing progress to be audited. They have set some success metrics based on usage. It would be nice to add some goals to the metrics based on what they see as a successful set of numbers.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "This project will help with the transparency of highlighting information about all past information regarding Project Catalysts proposals that have secured funding.  Although it doesn't appear to extend to performing auditing of proposals, it has the potential to be the infrastructure where auditing results could be stored.", "q0r": 4, "q1": "The team does appear to have the required qualifications to work on the project as well as partnerships with previous Catalyst projects (Lido/PACE) that will help this proposal to not have to start from scratch.  A more detailed roadmap would be helpful with some of the content that would be included in each release.", "q1r": 4, "q2": "This proposal in terms of what is being developed/built and the timeline/milestones described will be auditable based on their roadmap.  As mentioned, a more detailed roadmap will help to make the assessment process more straightforward and would be something to consider in regards to including/consider in the development of the project itself.", "q2r": 4, "assessor": "z_assessor_13", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal does not seem to directly improve or grow auditability but it seeks to have an API which third parties can then use to for auditability purposes. At its base the API is spoken about as a repository similar to the one on ideascale but with increase search functions. Data apparently can be extracted from this new platform to be used as needed.", "q0r": 4, "q1": "Considering that the platform is already online, although not finalised, it gives ample confidence that the proposal can be completed successfully.", "q1r": 5, "q2": "Whilst it will be easy to audit the creation and finalising of the API, it is unclear how to audit the use of the API for Audit purposes and the quality of the results thereof.", "q2r": 4, "assessor": "z_assessor_281", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The project is already well under way, and the current website looks promising. My main concern with this proposal is that its biggest value-added proposition (integration with the PACE proposals) depends on the outcome of other proposals from this fund. While the other proposals seem likely to get funded, there will inevitably be iterations in the process, and it seems premature to build off of a project that is being actively developed in parallel.  The API is an interesting value-added proposition, but the data they could expose via said API is already public.", "q0r": 3, "q1": "The team looks able to deliver, and their current website bodes well for the rest of the tasks at hand. There is a well-defined plan, and the budget, which is well broken down, looks reasonable for the size of the task.", "q1r": 4, "q2": "The roadmap makes sense and explains a bit more about the in-depths of what the proposal proposes. However, the success metrics are a bit vague and hard to quantify. However, risk and challenges (such as partner projects not getting funded) are not addressed.", "q2r": 3, "assessor": "z_assessor_318", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Not only can those of us assessing can read about the proposal: we can see it in their website, where they already have a proof-of-work on display. How awesome is that? Pretty awesome. The website and project seems to speak to the challenge in a very direct way. As a data guy: I love this. More charts and easy to access data, please!", "q0r": 5, "q1": "They already have a good website on display where users can see the benefits, and so it is easy to see that their team can just take this and improve upon it using the funds requested. Seems Darlington is quite capable of proving the skills needed to make this happen.\r\nI am new to the CA process, but this proposal goes from presenting an idea, to then backing that idea up with plans that forms it into a proposal, and then goes an extra step by demonstrating functionality.", "q1r": 5, "q2": "The proof-of-concept (the website), and the rollout detailed provide many good values in many important values needed to succeed. Their team should do well. I only question the amount of money requested as possibly being too much, but I think myself I think of the terms of the team going forward from where they are...but where this team has already been, and has already been produced: should be taken into account. Seems like it would be justifiably rewarded. In this case: we can see and even start benefiting by this team's contributions.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 9, "ne": 3, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The problem and solution described are reasonable and within the scope of the challenge.\r\n\r\nCreating Open Repositories + APIs would make it easier for the community to develop projects that allow them to analyze data related to funded proposals and disseminate that information to the community in digestible ways. The idea of open source is important to avoid fragmentation and seek better distribution of information by the community.\r\n\r\nThere are relevant goals in the roadmap, indicating positive impact on the challenge. I would recommend including KPIs/metrics that make it easier to quantify the potencial for impact.", "q0r": 4, "q1": "The team describes experiences in software engineering and cloud engineering, besides operating the LIDO pool. there are few details/sources about previous backend development experiences or repositories. I would recommend including more info about the team's background.\r\n\r\nThe team made a partnership with the proposers of PACE, George and Jakob, members involved for several months in the development of projects on Catalyst, which brings more certainty that the proposal is viable.\r\n\r\nA reasonable and detailed plan was described, with a clear timeline and budget breakdown.", "q1r": 4, "q2": "There is clarity in the problem, solution and in alignment with the challenge.\r\nThere is a roadmap with clear goals that improve the conditions for auditing. I would recommend the inclusion of KPIs/more clear metrics to improve the auditability.", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 12, "ne": 8, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "This proposal provides a clear link to the challenge objectives. Transparency is the first step to audibility.", "q0r": 5, "q1": "The fact that this proposal provides an Alpha version of the product establishes the capability of the team to execute on the plan.", "q1r": 5, "q2": "This project can be audited by inspecting the code for the API and using the API endpoint. ", "q2r": 5, "assessor": "z_assessor_493", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "A non-gated, filterable repository of all proposals. Funded projects are followed, measured & updated in a public space. API for toolmakers", "experience": "Darlington: 14+ years of software engineering, 7 years of cloud engineering, 9 years of business and cloud technology consulting."}