{"id": 369368, "author": "", "title": "Audit via DAO", "url": "https://cardano.ideascale.com/a/dtd/369368-48088", "category": 26119, "amount": 8888, "description": "We need more audit", "f6_no_assessments": 7, "f6_rating": 1.8571428571428572, "videos": [], "media": [], "f6_assessments": [{"q0": "This is an idea to audit via a DAO, however the details of how this would be done are not provided. Perhaps the proposer should join forces with the SCATDAO proposal who are already further down this route.", "q0r": 2, "q1": "There is no concrete plan or deliverables and no budget justification for the requested $8888. Thus it is unlikely to be successfully delivered. TO work this would need a governance plan for the DAO, and then research and planning on what it would cost for the audits to be conducted.", "q1r": 1, "q2": "As the proposal does not actually set out any clear deliverables, it is not possible to audit the progress or success. Please propose an actual timeline with deliverables and provide some metrics on the produced audits which would define the success of this project.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "Incentivising community audits could stimulate productivity to track funded proposals and evaluate their progress. This proposal aims to achieve this by DAO. There are still some questions unanswered in the proposal: Who would be in the DAO; The entire community or a select cohort of token holders? What do these audits entail? Are they like CA-assessments or do they work in a different model? ", "q0r": 4, "q1": "Andrii is a known Project Catalyst veteran since the very beginning during Fund 1. Implementing a DAO to perform these tasks, without specifying how to be a part of this DAO creates uncertainty in terms of successful implementation. A more detailed elaboration of the plan could take away these doubts. ", "q1r": 3, "q2": "The plan needs to be worked out more step by step in a roadmap to verify this proposal more efficiently. There is no explanation how this DAO would fund itsself after the initial 8K USD. Which creates the question: What would happen if the DAO votes on a raise without having a form of income? \r\nThe fund of 8K USD is verifiable in the plan. however, the $888 is not. How exactly did this amount come to be? ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 14, "ne": 2, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "This proposal looks to target the main points of this fund challenge, but there is little description of how it will be accomplished.  The proposer mentions about how more auditing is requried, but again this proposal doesn't have very much concrete information about how to do this and what items will be looked at for auditing.", "q0r": 3, "q1": "The relevant experience listed of the proposer is quite limited and potentially doesn't have the required skills needed to develop a framework or plan for a scalable auditing plan.  There is no mention of a team to help and/or what the development plan is to create such a platform for auditing.  The concept of using a DAO to do this work is interesting, but again it fails to describe how the DAO will be setup, infrastructure, and other core items that would be needed to set it up.", "q1r": 1, "q2": "As mentioned in the other sections, there is limited information about what this plan is concretely going to deliver and therefore would make it almost impossible to know what success measures or any other metrics could be use to track and follow the progress of this proposal.", "q2r": 2, "assessor": "z_assessor_13", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "While idea is not very well articulated, we will eventually have to pass on the duty of auditing the progress of accepted proposals to a DAO or the community in genral. Whilst IOG is currently doing this work, with the increasing budget and therefore number of accepted proposals, IOG will not be able to keep up. I believe that IOG or Charles had already mentioned this and so this proposal is not very novel. IOG will have to find a way to pass their 'regulatory' duties over to the community with a correct reward system to match and budget will have to vary with number of proposals and be probably deducted from each challenge's budget amount.", "q0r": 3, "q1": "Proposer declared that he has been 5 years in the Crypto world and in Catalyst since Fund 1. While it is useful to understand how Catalyst works, that alone would not be enough to audit or take care of the auditing process for the winning proposals. Proposer did not mention whether he possessed other skills or knowledge. \r\nThe plan itself is not very cohesive and quite simple in nature. Little is said about how auditor will be selected and who will audit the auditors, there would be a need to have a CA & VCA system, similarly to Catalyst.", "q1r": 1, "q2": "No contact was made with IOG to define a path to transfer its powers to the community. The plan is still very rough. It is more of an idea. The general concept makes sense and is already being carried out by IOG. This is already a topic of discussion in the community.", "q2r": 1, "assessor": "z_assessor_281", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "There is no relevant information in the problem and solution statement. I recommend that the proposer use the space to promote the idea in an appropriate way.\r\n\r\nThe proposal is read as a rationale or draft and although the rationale is aligned with the challenge, there is no structured plan or items that allow measuring the impact on the challenge.", "q0r": 1, "q1": "There is no reasonable plan for understanding the necessary qualifications. The proposer mentions experiences with DAO, but subjectively, there are no links to sources of his qualifications.\r\n\r\nThe rationale behind \"Audit via DAO\" is exactly the goal of this challenge. The proposer does not seem to have realized that the challenge already allows the community to create proposals for the audit of funded proposals.\r\n\r\nThere is not enough information to indicate the feasibility of the proposal.", "q1r": 1, "q2": "Draft proposal.\r\n\r\nItems that allow auditability were not established.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Using smart contracts for Audit is a perfect way to help the proposals and help Cardano simultaneously. However, this proposal doesn't actually break down a specific problem within the challenge. It simply gives us the global obstacle. Surely we need to have more auditability in Project Catalyst.  How do you engage the community in doing audits? I feel like the usage of DAO is a good choice for helping the auditability but the proposal is missing a guideline on how to implement it. I can see you plan on doing it on a platform/websitem, but I see no funds for a web developer. This is why I neither agree nor disagree with the proposal. To the proposer, try to work out a plan on how you plan on implementing this.", "q0r": 3, "q1": "The proposer states that he has 5years of experience in the crypto world but no reference on what that experience holds. There is no reference towards experience in implementing smart contracts so more information is needed on the team to assess if they are capable of the proposal. The proposal itself is a great one but we are missing a plan. The proposer speaks of what the plan holds but not on how he plans to do it. I would like to see a clear definition of how to implement the smart contracts in Cardano and if the proposer is going to do this himself or if he needs a team for this. 888 is also a weird number to ask for the organizational cost. Building a website that holds smart contracts is out of this budget. That is why I don't see this proposal being successfully implemented in this fund.", "q1r": 2, "q2": "Since the proposal is missing a roadmap/milestones it is challenging to assess the auditability of this proposal. The proposer is hoping for tools that are not implemented yet, it would've been helpful if we had risk management on this. Based on this I strongly disagree that the proposal gives us enough information for further reviewing.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The idea meets the objective of the challenge very well, because it thinks of an innovative way to make auditability be applied, and in my opinion, a way that dialogues well with the objectives of the cardan ecosystem as a whole, because it invests in a broken decision and decentralization. However, what worries me here is that, unfortunately, not all members of the catalyst project have the preparation and experience to perform auditability correctly. It would be positive if the author included some meetings in the proposal in order to explain how to be an auditor, or even written content that would help future auditors. Because just the act of arranging with a certain number of people to do this and offering a reward was not enough to guarantee good autitability, in my opinion.", "q0r": 3, "q1": "We have no information about the author. All we know is that he is a longtime member of the Catalyst Project and has been studying cryptography for years. However, we need more details. In these 5 years, what have he done within the cryptographic world? What more specific subjects does he focus on studying and working on? What is your first training? Some places he's worked on, even if they're not related to the Cardano ecosystem? In addition, other people would be needed to run the project, like someone to organize the site he cites (probably a designer and a developer!), someone to follow up on the audits... Due to these details, I believe that we do not have good security about the people involved in this project.", "q1r": 1, "q2": "We have very little information about the auditability of this proposal. All we know is how much money would be paid for each audit and that the amount of auditors is not predetermined, it would be agreed with the community. And that there would be a website where the audits would be posted. Right, but we need even more details. For example, how would the success of this project be measured? As I commented above, who would oversee that the auditors would be doing a thorough job throughout the execution of the proposals they selected? In addition, there is the issue of technical preparation as well, which I mentioned in impact. Other doubts: regarding the dates, we are not given any notion of time for this project, and also how the future auditors would be recruited or even selected, if there was a lot of demand for this new role. Auditability here needs a review, a deepening.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 12, "ne": 8, "ng": 4, "nfo": 0, "vca_o": 2}], "solution": "DAO", "experience": "5 years in the crypto world, participant in Project Catalyst since Fund1\n\nVia DAO - many people with different backgrounds will do audit"}