{"id": 396556, "author": "erkoloco", "title": "DYOR Tool", "url": "https://cardano.ideascale.com/a/dtd/396556-48088", "category": 26449, "amount": 31600, "description": "With so many different projects being built, how can we assess them all using a consistent standardized framework?", "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 7032, "q0": "The proposal addressed the challenge by delivering an improved version of an already existing tool to help investors orienting their decision on any token and/or NFT collection in the market. \nThe tool is useful to a common user because a project having a smart contract audit does not mean it will be a good investment. There are several other factors that need to be taken into consideration while researching a potential investment before being comfortable committing some money.\nThe tool will allow also user to see what other users evaluated, in order to avoid researches on projects that have been evaluated previously by others.", "q0r": 5, "q1": "The team has been already funded in Fund 6 and 5 on the same project, demonstrating the capability of delivering the proposals, providing a working tool for 'DYOR'. \nAs this current proposal aims to ameliorate the already existing tool, it is very likely to succeed.\nThe team is also mitingating the risk of people not understanding the tool by providing training material, and dedicating a part of the budget for promotion of the tool to avoid poor adoption.\nHalf of the budget (31600 usd) will be allocated to development, which seems reasonable. 3600 usd will be dedicated to promotion/marketing. ", "q1r": 5, "q2": "The team provided their references, as well as relevant links such as their webiste and the Github repository.\nThe new features object of the implementation are accurately described, as well as the budget breakdown and the timeline checkpoints at 1, 3, and 6 months.\nIn particular, at the end of the first 6 months, the team will have held 10 research contests that encourage the use of the tools and incentivize newcomers in learning how to perform research, and collected new feedback on the tool as well.", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7553, "q0": "The challenge is addressed well by addressing the challenge metrics directly in its Auditability section. Open standards are addressed by provision of a Do Your Own Research tool. observable improvements are addressed by DYOR Tool V1 Improvements with a summary of a baseline to start from. Project synergies is addressed by Research Contests giving liveliness to the proposal implementation.  increase in open-source contributions is addressed by the intent to create and promote open standards. But there is no specific reference in the proposal to an open source licence and none provided on the GitHub repos themselves.", "q0r": 4, "q1": "Sufficient information is given on the teams experience together with LinkedIn profiles to provide assurance of their capability to develop and deliver the tool.  Additionally, a detailed plan is provided with a timeline and costed budget lines. Therefore, it can be reasonably expected that this proposal will be implemented successfully. ", "q1r": 4, "q2": "A good deal of detail is provided in the auditability section of the proposal. And this is cross referenced with the challenge KPIs (as referred to above). The measures and deliverables provided are clear and specific. Therefore there is assurance that sufficient information will be available to audit.", "q2r": 4, "assessor": "z_assessor_597", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8435, "q0": "After finding out about this proposal thoroughly, I think the proposal gives a very detailed and clear explanation of the project. They plan to build a new versions of DYOR Tool which is designed specifically for NFT project after the first version for tokens is completed. Also, they aim to continuously improve it based on the community feedback. The proposer shows that they are reliable and trustworthy team who working hard to provide the best services for the Cardano community, even the newcomers who could use this DYOR tool to assess a new project before investing in it. Also, the team know their strengths and challenges about their projects as they try to promote their project to community by regularly organize contests. Therefore, I think this project need more support from the community to further develop and provide a full package of research tool for the community. I appreciate their big vision and hard work. ", "q0r": 5, "q1": "From their past experience and profile background which could be found on their website or Linkedin, I think this is a very qualified team for executing this project successfully. They have worked together for quite a long time with good team work of effectively  finishing the first version of DYOR Tool. Also, in the next months after being funded, they gives three main focus and clear timeline for the project and detailed budget for each cost which is appropriate at this stage of the project. It is very important at this latter stage to get huge support from the users and community to get to know about their tool. I hope they do well and get funded soon. ", "q1r": 5, "q2": "I think the proposer gives very clear explanation of their project, so it is absolute clear for the community to follow their progress of the project and check it on different social media platform such as website, youtube channel or Discord or Github for more information, updates about improvements of version 1 or the contests or the completion of the NFT version.  By doing this we could check whether the team is active and how engagement of the community to their project. The proposer shows they are willing to receive any feedback or suggestions or ideas related to their project. I think, this is very promising and practical project. ", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "A community-curated tool that teaches people how to research a token or NFT, utilizing a consistent set of criteria.", "experience": "This is a product of Smart Contract Audit Token (SCATDAO). We were funded in Catalyst R5 as well as R6.\n\n\n\nThe full team along with links to our LinkedIn to review our full work experience can be found using the below link:\n\n\n\nhttps://www.scatdao.com/team"}