{"id": 397974, "author": "raz", "title": "Codesign blockchain4good Principles", "url": "https://cardano.ideascale.com/a/dtd/397974-48088", "category": 26449, "amount": 2500, "description": "Lack of ‘blockchain4good’ guiding principles to guide a global movement + Cardano in achieving positive social and environmental impact.", "funded": 0, "upvotes": 27411673, "downvotes": 8178129, "votes_result": 19233544, "votes_cast": 106, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 982, "q0": "The proposal notes that \"blockchain for good is sometimes hard to define,\" and therein, I think lies the difficulty when it comes to assessing the potential impact of this kind of proposal. Principles are ultimately political, no matter how much we might wish otherwise. The proposal does lay out a map for developing a guiding set of principles, but the questions I come away with are \"how will these be used, and by whom?\" Google's famous \"don't be evil\" guidelines were insufficient, which is why Web3 is trying to take the approach of \"can't be evil.\" \n\nWith that in mind, to make a good case for the utility of such a project, the impact statement may want to discuss how the proposers plan to get their statements of principle worked into systems and code. While the implementation itself may be outside of the scope of this phase, it could go a long way towards making the project look like more than a navel-gazing exercise.", "q0r": 3, "q1": "The proposer's team, with academic backgrounds in economics and sustainability, should have little trouble delivering a statement of principles within the timeline mapped out. The involvement of the community in creating the guidelines should help the proposers take the temperature of the Cardano community. The sign-up form for the survey is already available.\n\nSome elaboration on what the workshops will consist of could help put the budget in context, as well as clarify the roles of team members in this project. ", "q1r": 4, "q2": "The proposal outlines a quick project with deliverables made publicly available through a Google folder. Transparency could probably be improved by disclosing the methodology the team plans to use when it comes to evaluating the results of the survey. As mentioned in the Feasibility portion of my assessment, I would also like to see more information about what the workshops will look like, as this can help auditors evaluate them when they are made available. ", "q2r": 4, "assessor": "z_assessor_1251", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Impact comment:\n\nThe comment indeed addresses the enforcement of principles rather than the design of Principles. Our proposal focuses on the design, but we believe it will have inherent enforcement power too:\n\nSetting Principles is indeed a first step to drive communities in the \"good\" direction. Like in any web3 project, or with DAOs, communities are guided and rewarded based on actions in line with cultural manifesto, expressions of values and beliefs, guidelines and principles which set proper directions and best practices when designing and implementing projects. Setting the Principles represents this first step. \n\nPrinciples can be translated into concrete systems and code when they are designed and adopted by credible organizations, ideally not done in fragmented and silo approaches. This is why we see great benefits in teaming up with different communities within and outside the Cardano ecosystem to create these Principles.\n\nWe believe that having organizations such as the Cardano Foundation, Cardano4Climate, SustainableADA adhere to common well-thought Principles will directly or indirectly translate into building the system of values which will be embedded in the code of future projects. \n\nMore concretely speaking, we would like to drive co-designers and endorsers of the Principles to do themselves the enforcement of the Principles. Like it is done when projects need to sign Charts or Codes of Conduct when receiving funds, signing engagements and joining programs. We will integrate the comment in our project approach to highlight the \"enforcement\" role of co-designers and endorsers of the principles."}, {"id": 2484, "q0": "There is a clear problem statement, focusing on the increasing use of, and interest in, blockchain for social and environmental impact, without any clear guiding principles in this area. This fits into the challenge as it allows for standards that can be applied and contributed to by the community, but as it is blockchain agnostic, even though not a technical solution, allows for use by communities across all chains, but as it is pointed out, being a Cardano initiated project with further increase the visibility of Cardano in the impact space. \n\nThe proposal will also be a value add as it looks to build on, support and extend the work of existing Cardano impact communities, but with a focus on pooling resources to create a more comprehensive set of guiding principles that can be used by all. \n\nThere is a clear breakdown of the tasks (consultations and so on), which are logical in terms of how they will allow for a set of principles to be developed, and these are aligned with the proposal and challenge. \n\nScalability would also be possible, by following a similar process and increased engagement. \n", "q0r": 5, "q1": "The proposer and team are already involved in related communities and seem embedded in the blockchain for impact space, so seem well placed to work on this project. Whilst the roadmap is not broken down into specifics, the general breakdown highlights the key activities. There isn't specific programming language and architecture stated, but this is due to the project not being a blockchain development project, but more of a research and administration project. The funding requested seems very reasonable for the objectives intended. ", "q1r": 4, "q2": "There activities listed on the roadmap are quite general in nature, but will allow for accountability and auditability. There are no specifics given in terms of numbers of participants and organizations to be engaged, and including this would allow for better measurements of success, and strengthen the proposal. ", "q2r": 4, "assessor": "z_assessor_1511", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10233, "q0": "First of all i really like the idea and the background of this proposal as i have been following the work of Sustainable ADA and Cardano4Climate on twitter and it is always nice to see new projects merging. However, i would like some clarifications when it comes to your solution to the problem. How are the Cardano stakeholders going to be involved in this whole process practically? You describe the whole mission right down on the impact session but I would like it to be clearer from the start of the proposal as it is the first thing a voter sees and then proceeds to open the proposal and see the whole description of it. As previous projects had a very positive impact on the ecosystem, I have no reason to believe otherwise for this project as well. ", "q0r": 4, "q1": "From a feasibility point of view, this is an excellent proposal.  A strength of this proposal is the transparency provided behind the background and relevant skills of the proposals - the proposal team is stacked with a deep pool of experienced members. Further, they have show-cased their ability to understand and build within this ecosystem through many projects active in this space. Α quite detailed plan (clear enough to understand each phase) and the budget are there. No budget breakdown is needed because the fund considers only the work of the contributors. The only thing i would like to be added is in the risk section. I can't think of another risk besides the low engagement but does that engagement refer to the contributors or the members of the community (or even both)? Making that clear enough I don't think you are missing anything else important for this proposal to be implemented successfully. ", "q1r": 5, "q2": "There is a clear roadmap with its milestones in it and that's very useful for the voters to have and there is also a way to track the progress of this proposal, a tool that in most cases is missing and it is a Google folder where all the relevant documentation is going to be kept. However, the KPIs briefly mentioned considering the workshops and iterations that will be open by July 2022, need to be quantified. That could also apply to other metrics not mentioned in the proposal. For example, how many contributors would you need to consider this idea a success? ", "q2r": 4, "assessor": "z_assessor_861", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Auditability comment: We plan to have at least 30 members participating to the workshops, and 50 answers to the survey. We indicate that we will be share this information through the Google folder, and the Gitbook for the principles discovered. "}], "solution": "Cardano stakeholders involved as core co-designers of an unprecedented open access, blockchain agnostic, Blockchain for Good Principles", "experience": "200+ active Cardano community members inc. Sustainable ADA, Positiveblockchain, Cardano4Climate who all already are working in the blockchain for good ecosystem, setting up and facilitating the gathering and codesign of the Blockchain for Good Principles."}