{"id": 399132, "author": "sofi.heessen", "title": "Open Standards & Design Patterns", "url": "https://cardano.ideascale.com/a/dtd/399132-48088", "category": 26449, "amount": 20000, "description": "The ecosystem has many projects that require interconnectivity but without proper coordination these integration are difficult to achieve", "f6_no_assessments": 4, "f6_rating": 4.5, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=20300"], "media": [], "f6_assessments": [{"id": 6411, "q0": "The problem is no interconnectivity between many projects in the cardano ecosystem and without proper coordination these integration will be difficult to achieve. The proposer is trying to solve this by working with existing projects to find solutions to increase interoperability. The proposal does understand the challenge of no coordination between projects and is trying to come up with a possible solution improve interoperability thus the proposal address the challenge that needs to be resolved. By improving coordination between the projects will increase the efficiency and in turn help the growth of cardano ecosystem. The given goal and metrics do align with the challenge. This proposal can be improvised to find further solution to increase the coordination hence can be scaled to meet future challenges. If the proposer is able to find a solutions to promote interoperability that would immensely help the project to grow and operate efficiently.  The proposal does address the problem effectively", "q0r": 5, "q1": "As per the proposal the proposer has experience working on interconnectivity in the education and health sector. This experience will be very helpful for this proposal. they also have all required technical skill to make this proposal a reality. Based on all these it can be said the proposer has required skill and relevant experience to successfully implement this proposal. The proposer has added a complete budget breakdown which will be very helpful to understand if the funds demand is justified. At looking at the fund breakdown the fund demanded looks practical. The timeline provided also looks reasonable also the solutions to promote interconnectivity also depends on the projects as well. The proposer has considered all necessary resources needed to execute the proposal. They have also considered possible risks and challenges and also provided explanation on how they will tackle it. The proposer have also mentioned where all these interoperability can be promote and this shows their understanding and effort put in to research about this. Based on all these above it is possible the proposal will be implemented successfully", "q1r": 5, "q2": "The proposer have said that they will be providing a monthly updates about the project. They will be providing various deliverables which will give a general overview about the ongoing developments. The proposal also consists a way to measure the success of the proposal which will be very helpful for the auditors. They have also given complete information regrading previously funded proposal in fund6 and fund7. These funded proposal have no dependency on this proposal. the auditors will be able to track the development about the proposal through monthly progress updates. This proposal doesn't have a timeline because it depends on external factors but the proposer have given a clear plan and time they will be putting into this. The success of the proposal can be identified at the end of the proposal and hence the proposer has done a great job at previously funded proposal's it can be assumed that they will do the same here. The proposal do consist of a clear explanation that address the problem and the proposer has give a list of places where this proposal can be implemented.\nThe provided info should be enough to track the development and success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2109, "q0": "The proposer wishes to engage over a period of 6 months in activities on the topic of improved interoperability within the ecosystem. The work includes research, documenting, collaborating with other projects, coordinating efforts to define standards and sharing the results with the community. There are a few possible directions being offered, for instance Cardano based Authentication & Authorization, interoperability with Catalyst, data infrastructure, tokenomics. \n\nI have an overall positive view on how this proposal connects with the challenge, but I believe that in order to be an excellent fit the scope should be definitely narrowed down and better explained in order to be understood more easily by the broader Cardano community. ", "q0r": 4, "q1": "I have mixed feelings about the feasibility of this project. On the positive side, I have seen a comment praising the proposer’s past research into Tokenomics, but I confess not finding that paper. If it was indeed available in the proposal I apologize for not paying closer attention. Another positive is the fact that there is a very extensive Miro link to a documentation of the proposer’s past efforts, with an interesting flow but unfortunately not very user-friendly with first time users of the platform. \n\nOn the negative side, behind the proposal stands a single proposer, which is indeed a risk in terms of delivering on the promises made. Perhaps future iterations can try to bring on-board added colleagues for a much higher confidence when looking at the overall project. \n\nThe budget predominantly goes towards the proposer with monthly payments of 3k USD at a 62 USD/hour rate, over 6 months. ", "q1r": 3, "q2": "The proposer states that the work will be tracked using a Miro board. Each iteration of work (1 month) would end with a public deliverable and a public presentation. Participants invited include challenge team members (not sure they have been identified though), circle representatives and contributors of open source projects. Overall the project has fairly good prospects to be visible and transparent towards the community. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7266, "q0": "This proposal matches the philosophy and several criteria of the challenge brief. For instance, \"How can we increase the degree of collaboration across different projects?\"  is a guiding question that this proposal directly addresses.  \n\n\nFunding this proposal will result in 288 hours of work, 6 relevant and community chosen workshops, research documentation, and public / open access.  I strongly agree that this will make a desirable impact. ", "q0r": 5, "q1": "This is a solo proposer, SofiH / Sosha. He is an established community member who is known for open-source, research, interoperability. I have attended several of his workshops and meetings.  See the testimonial by James from Gimbalabs.\n\n\nThe budget and plan are unique and remarkable.  The typical plan focuses on 'What' (ie start a new project), but this proposal focuses on 'How'. It defines a process of work that I feel is well suited to this community.  \n\nThe plan is to work on 6 monthly themes within the topic of 'improving interoperability'.  Essentially, this is funding SofiH to act as an interdependent researcher and collaborator for and in between various projects. \n \n\nI am confident of successful implementation because SofiH has done this type of work before (a similar project was funded in fund7).  And, This style of project fits the interoperability problem.  SofiH will literally 'go between' and establish connections between projects.\n\n \n\nThe proposer has outlined several real risks and solutions that add value. For instance, after each monthly iteration of work, a public session will be held to explain the research and choose the direction of the research. \n\n \n\nIf funded, there is a high probability of success and value to the community.", "q1r": 5, "q2": "The public sessions and other documents are an auditable deliverable of the proposal. The KPI of the challenge (i.e. increase in open-source contribution and joining) aligns very well with the proposal. However, these are not explicitly stated. Perhaps this is because of the nature of independent research. In that case, I suggest providing provisional/possible KPIs which are subject to change.  By way of advice, I suggest providing more detail in this area, especially for an innovative project like this as voters/community members may want more visibility and assurance that metrics are improving due to the funded work. ", "q2r": 4, "assessor": "z_assessor_56", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9735, "q0": "The Open Standarads & Design Patterns proposal looks to research and analyse solutions that are being created in the community in an attempt to help with coordination and interconnectivity within the ecosystem by more projects being able to determine which existing functionality and tools they can use to achieve the goals of their project or community. At present there is no incentivised process to ensure that open source tools are analysed and shared within the community. This proposal aligns with the challenge brief and could save other projects time, resources and development effort by helping them find where solutions already exist that me be beneficial. The lower speed of execution must also be noted as an effective way to allow the proposer to stay up to date with what is happening in the ecosystem and update the information accordingly helping to increase the overall value of this proposal and the potential impact.", "q0r": 5, "q1": "The work will be tracked in a Miro board that which has been shared and is openly accessible. It would have been good to see the usage of an open source tool such as Gitbook for some of the documentation which can then be forked and copied by the community as an addition to the Miro board for more visual topics or mind maps. The project roadmap is broken down into months and a 12 hours of work in each working week. The budget is derived from an hourly rate and the number of hours worked. The proposer adds detail about themself in the proposal but adds no source for their professional background such as a LinkedIn profile. The budget is small but reasonable and fair for the task at hand. The recommendations from other community members were good to provide, some more sources of background of the proposer and also the references would have been useful to better determine whether this proposer can feasibly execute the proposal and provide more confidence.", "q1r": 4, "q2": "The Miro board will be used for showing the developments of the proposal which is open and free to view. A large part of the success of this proposal will be collaborating with projects to help give them information on the work that is done on this proposal comparing and analysing solution options. The openness of the possible directions make it more difficult to determine the exact projects that me be part of this process and as such what will give them most value in terms of analysis. To give a higher confidence in ability for the community to audit the impact of this proposal some more specificity on the KPIs would have been welcomed.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Work with existing projects on defining problem spaces and different components that make up solutions to promote interoperability", "experience": "Working on interoperability in the education and health sector, implementing Open Standards like IMS LIS, FHIR, xAPI. Working with Semantic Web, Knowledge Graphs, data infrastructure and API/SaaS solutions.\n\n1 year active Catalyst participation, advising, researching, tinkering"}