{"id": 399945, "author": "benderthehuman", "title": "NFT as an event ticket", "url": "https://cardano.ideascale.com/a/dtd/399945-48088", "category": 26449, "amount": 175000, "description": "NFT's into mainstream ticketing so people can feel like it's an actual identity.", "f6_no_assessments": 6, "f6_rating": 1.6666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 5213, "q0": "The arguments presented for the level of impact that would be made as a result of this proposal are far too vague for a $175k proposal. For a proposal of this size, I need to be seeing market research on what level of interest exists for this kind of thing, how many digital tickets are being distributed currently, and maybe appeal for event organizers to adopt such a thing (cost, ease of use, verifiability, etc.). The impacts need to be more tangible as an evidence-backed argument that clearly paints the picture of what a post-proposal world looks like. There also needs to be an explanation of the logistical practicality of such a project. There needs to be information on how this project will work and DEFINITELY what uniqueness this project brings to the table. Why is this project innovative (the core tenet of Catalyst). Why can't event organizers go to NFTmaker.io or some other NFT minting service, so that Catalyst doesn't have to lose $175k of funding for other (potentially more efficient) projects? Especially with the lacking of these details, I am not convinced that this project deserves 35% of the entire fund with impact statements like \"possibly mainstream adoption.\"  I might have voted this project up a star if I could see some specific reference to what entertainment professionals are being talked with. References to reputable names can help add a lot of credibility to the proposal. ", "q0r": 1, "q1": "I almost bump this proposal up a star because of the reference to specific event organizers with links. However, the language used to describe the relationship seems loose and not reliable. I don't end up giving any weight to it because the proposal is far too expensive. The roadmap is not much of a roadmap without specific information about timelines/dates, actions, technical steps, marketing strategies, and not in the hypothetical fashion that it is presented here. The roadmap is a necessary stock issue that has to be much cleaner, with more detail and concrete planning. There is also no resume provided for the proposer. The reference to cardanogoat.io is not a comprehensive view of the professional experience that is brought to the table, which is absolutely essential for a proposal of this cost. I need a LinkedIn profile. I have no idea of the technical capability for the proposer to produce a high-level professional product that appeals to entertainment professionals. I have no clue if the proposer has any experience in the entertainment industry that qualifies the successful negotiation with event organizers. A lot of professionals won't work with anyone that doesn't know the business, which casts serious doubts on any hope of potential mass adoption. Lastly, the budget gives no detail. The budget doesn't actually add up to $175k concretely. The budget can go as high as $189,400, for developers working a full 5 months OR it can go as low as $147,800 (leaving $27,200 unaccounted for). It also doesn't make sense to me that $75k is allocated to on-site event staffing when that is entirely the responsibility of the vent organizers to pay for. As you can already tell, the budget is not very specific at all. It only gives 2 broad categories of where money is going to and it gives no information on why it would cost that much. There's no breakdown of hourly rates for labor, what type of labor, hardware costs, electricity, server maintenance, marketing, or anything. This is necessary information to determine if money is being spent efficiently and appropriately, for which this proposal has much more pressure to prove. If I had to sum it up with one bit of advice for improvement, it would be that this proposal needs so much more detail. ", "q1r": 1, "q2": "These are not auditabilty goals or measures of success. These are points for things that the proposal wants to get done. There's a big difference. Measures of success need to be quantified with specific metrics that display the true impact of the product. Such as how many event ticket NFTs were distributed or how many clients have been obtained for this platform. I tend to look for specific target numbers that the project is aiming for that demonstrate a true concrete goal that the project is aiming for. It tells me that the proposer has an acute sense of the tangible impact that could be made as a result of proposal approval. For a proposal of this cost, I want to be seeing milestone-based metrics, specific social media targets, a specific number of events solicited on the platform, and a target number of clients that are organizing these events. The offer of Github updates is good but there's nothing to hold the proposer to if there aren't metrics to measure success by. I also think there need to be more avenues of accountability to ensure success. More detail needed. ", "q2r": 1, "assessor": "z_assessor_1896", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 989, "q0": "Using NFTs for event ticket authentication could be a compelling use case that pushes the technology beyond the oversaturated collectibles markets. I'm not 100% convinced but would like to be persuaded by a later iteration of this impact statement. \n\nA reusable, open-source package could have wide application across many dApps should event tickets prove to be a good candidate for NFTs. The proposer could probably go a bit farther in laying out the value proposition for the project, however. What are currently the major pain points for event ticketing, and how does this solve them? What kind of demand has the proposer encountered for event ticketing NFTs in speaking with contacts in the entertainment and event industries?\n\n", "q0r": 4, "q1": "The proposer presents a completed project of similar scope as a demonstration of technical ability and is adequately convincing in that regard. The project is, additionally, dependent on relationship-building with individuals in the event-planning industry, which presents some possible points of failure. The proposer is in talks with some individuals in the industry, but I don't have a sense of how much experience they have in forging successful relationships of this type. \n\nAdditionally, the proposer could be a lot clearer about how the requested $175,000 will be spent. As it stands, the majority will be going to an uncertain number of developers, and possibly just to the proposer. $75,000 is flagged for event-related expenses, which needs a lot of elaboration.", "q1r": 3, "q2": "Despite my aforementioned concerns under Feasibility, I think the proposer lays out a solid roadmap for accountability and transparency for this project.  As this project is ultimately intended to be an open-source resource, however, I'd like to see some milestones addressing how and when the proposer plans to make the tool available to other developers, and how the proposer plans to go about raising the tool's visibility to the Cardano developer community. ", "q2r": 4, "assessor": "z_assessor_1251", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1224, "q0": "The proposal aims to create NFTs that can be used as tickets for real life events. This is entirely unrelated to the challenge. The challenge aims to improve open standards and increase synergy between projects. The proposal makes no attempt to bridge the gap between the project and the challenge. It would be best suited under a different challenge. DApps and Integrations or Business Solutions both seem a better fit.", "q0r": 1, "q1": "The budget for this proposal is massive at 175K USD. 75K USD is reserved for events: paying employees and buying promotion materials. The plan is to find actual events to integrate the NFT system into but if not this will fund example events. 75K USD is a lot of money. Requiring it just in case events to integrate into are not found is not acceptable in my opinion. \n\nThe rest of the budget is 100K USD but there is an issue there as well. 5,200 USD is reserved as a weekly wage for 2 developers for 14 weeks. That is a monthly wage of 10K USD+ per developer. That price will buy a lot of expertise but that expertise is not justified at all within the proposal. \n\nAlso, 27,200 USD in the budget is unaccounted for. \n", "q1r": 1, "q2": "Beyond a general idea of generating NFTs that are event tickets and verifying these NFTs at events, there's not a lot that is clear about this proposal. An application containing verification functionality is mentioned but any specifics are not there. \n\nSome things resembling deliverables (eg. security whitepaper) are mentioned but there is no timeline or plan of delivery on anything. There are also some baffling items: Under how you will measure progress it states: \"Phone Ticketing Transaction Application\". Is this the same as the verification application I'm not sure. There are no attempts to make anything clear.\n\nThere is an attachment highlighting some of the technical work necessary and it looks detailed. Sadly it is mostly unreadable with low image quality and needs explanation which this proposal doesn't attempt to give.", "q2r": 1, "assessor": "z_assessor_1323", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6225, "q0": "This proposal is about creating an app for event ticketing by using NFT technology on the Cardano blockchain. While the proposal clearly does not fit within this challenge which is to create an open standards on how to document, set-up, and contribute-to projects, I will assess the proposal for future submission if the proposer wish to attempt to resubmit in the next fund. But all of the ratings will be given strongly disagree to not misguide the voters. I advice you to submit the proposal in a suitable challenge such as miscellaneous challenge etc so that the funds can be distributed to the proposals that actually addresses the campaign. ", "q0r": 1, "q1": "The proposer shared a link to his website of NFT minting, in my opinion is not convincing enough to show that he has the ability and experience on creating an event ticketing app.  The information provided regarding the required manpower and resources are also vaguely presented. On your next attempt on submitting a proposal, try to include with details of what type of employee that you need in order to successfully implement the project such as UI/UX designer, marketing, event coordinator etc. Furthermore, the budget requested are not clearly broken down. Include detailed budget breakdown of the requested funds on what are the cost of each of the individual items that you required and also the cost of hiring staff per monthly or hourly basis. Moreover, there is no timeline given for every phase of the plan. On your next proposal, provide a timeline for each execution of your plan. For example, how long will it takes for you to setup the policy, is it 1 month? 2 months? What about the phone ticketing app, what is the timeframe to deliver the app? In addition, the plan presented on how you would implement the project are also unclear. Explain how a normal person who never had an experience of cryptocurrency pay for the ticket? Is there a payment processor that has already created by you? Also what is the method of authentication? If the authentication is simply by scanning the image of the ticket, it will raise a concern of forgery. The proposer identifies the risks and challenges that he might face during the implementation. There is another point to note on the risks which is ticket forgery. Some users usually post their ticket online as they are excited to attend the event. If someone would copy the image and use it for himself, how do you mitigate this? In conclusion, with the information provided, it is unlikely that the proposal will be implemented successfully.\n ", "q1r": 1, "q2": "As mentioned before in the implementation section, the proposer fails to provide a clear timeframe of its achievement. Furthermore, the KPI and success metrics are vaguely defined. Try to include how many successful authentication that your app can process in a single event as an example. Give a quantifiable figure so that it is easier for your proposal to be audited. The proposer provided a link to his NFT website for the community to keep track of his work progress. In conclusion, the information provided is not sufficient to be audited.", "q2r": 1, "assessor": "z_assessor_357", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8160, "q0": "The proposal addresses the issue of making the NFT a mainstream form of ticketing so that people can feel it's a real identity. The solution given is to authenticate the NFT event through a connection without tx. At first glance, this issue proposal and statement seem a bit lackluster in its information. The main idea of ​​the proposal is good but unfortunately, it is not clear and lacks many details on how the goals will be met. So if it doesn't get funded this time, I hope the proponent doesn't give up but develops a little more and tries again. Besides, the proposal introduces risky challenges but how to solve them is still an open question, we need to have more certain measures to be able to see the possibility of solving the difficulties (if any) of the proposed group.", "q0r": 2, "q1": "The best part of this proposal is the available platform CardanoGoat.io (https://cardanogoat.io/) to build it into what the author suggested. This proves that this is not just an idea, it is already working. The proposal also provides plans, but unfortunately, it's not detailed enough to be able to track its progress. The proposal does not include information about the roadmap, milestones, or timescales for achieving the desired results. I'd also like to see a deeper level of budget allocation included in the output. Currently, the information only includes a total of $175,000 for the reason \"~$5,200 Weekly Development Fund expecting 2 devs for 14 weeks or 5 months of dev funding. ~40+ a week.\n$75,000 would be used in accordance with the events. From paying employees that we need to. Buying promotion materials for Cardano to display.\" This is a bit unclear, I have a hard time believing that the entire required budget will be allocated for that. If the proposal can be analyzed for each item as small as $75,000 what events is it used for, how many events, how many employees will be paid, how much are their working hours...?\nAs for who is involved in the project, there is also a big question mark in this proposal. You say the project needs 2-3 developers but if you can afford it you will do it automatically. I have no doubts about the author's ability, however, if the author has to work alone, will this project take the time and the amount required by the budget is appropriate? In addition, the author states that he is \"talking to David, owner of https://pearlentertainmentinc.com/\" what topics his talk covers, Mr. David must be a Member of the project. this project or not, what role does he play in this project? ... Although this proposal is quite good in my opinion, with the experience and plan presented, I do not think this proposal will be successfully implemented.", "q1r": 2, "q2": "Finally, regarding clarity and audit, or effectiveness, the ability to audit progress and success has some good and some not so good. The proponent provided well-defined KPIs however, as shown, the suitability of the proposal is low, as it does not show a roadmap with a development plan, detailed explanation of the step by step, milestone, and part delivery. I would like to see the team develop key performance indicators (KPIs) for the project and connect the KPIs to the milestones on the project roadmap. That will make it easier for the community to track the progress and success of the proposal.", "q2r": 3, "assessor": "z_assessor_654", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10614, "q0": "This proposal lacks clarity. It identifies an opportunity in using NFTs as ticketing but the solution is confusing. How does a no connection tx work? The proposal offers little explanation on how things would work. The proposer seems to have the network for the eventing side of things but offers no information on the technical side.", "q0r": 1, "q1": "The proposal lacks a clear and comprehensive roadmap for delivering the product. It sounds more like an idea starting to take form instead of a complete plan. The website for CardanoGoat also offers no explanation of what's happening. Minting the NFT requires signing in with third parties or phone number -- an unusual practice for nft mints. In short, the website does not add confidence in the ability to deliver on what's promised in the proposal. The majority of the budget is devoted to events instead of the technical aspects which is a little concerning. This proposal would benefit from including more information on the ticketing aspects. How will entry for nft-ticketholders be done, by eye or by technology? How will it be automated so that an event organizer can carry out ticketing for all of their events? ", "q1r": 1, "q2": "The proposal offers github commits and entertainment company meetings as ways to track progress. But the latter seems like something that the community can't join in. There is mention of phone ticketing transaction application. What is it? This proposal would benefit from using quantifiable, trackable, and understandable metrics. ", "q2r": 1, "assessor": "z_assessor_948", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "NFT Event Authentication through a no connection tx. People prefer familiar. We also like events. Let's bring NFTs into mainstream ticketing", "experience": "I'm a developer and I am building https://cardanogoat.io and https://www.npmjs.com/package/cardano-lsd where I plan to make reusable components for others to use."}