{"id": 400022, "author": "yeepeekoo", "title": "Sign-in with Cardano", "url": "https://cardano.ideascale.com/a/dtd/400022-48088", "category": 26449, "amount": 49500, "description": "Secure authentication into apps provided by social login put user's data at risk. Why can't we authenticate safely and privately via web3?", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal wishes to standardize the sign-in workflow and improve interoperability across existing services of the Cardano ecosystem. The solution would be useful for app developers who can integrate such sign-in ability into their app and later on of course Cardano wallet users who will be able to sign-in via this method instead of the classical methods (facebook, google, 2FA, email, etc).\n\nI think that this proposal is very well suited within this challenge and has the advantage of an extremely high scalability potential if successfully built and adopted by the app developers. ", "q0r": 5, "q1": "The team behind the proposal is already functioning under the umbrella of an existing web-site and also diverse paid solutions to customers, including apps available on Android / IoS. There are also good descriptions of the team members, but somehow I have mixed feelings regarding how big the team is and how well they fit with the project. The leader is definitely visible but searching for the next layer of competencies … things just don’t look right: not enough company presence on social media, not enough visible employees, and a few other red(ish) flags For the development they would also use external contractors, so definitely lacking internal resources. Another worrisome point is that their existing apps advertised are barely even downloaded on Android (counter sits at 10+), but I did not check IoS. \n\nIn terms of budget there are 5 phases of the project, with budget broken down at phase level but not much else. I suggest that future iterations put more effort into a detailed budget. Timewise the project would be delivered during   32 weeks, with independent milestones.", "q1r": 2, "q2": "The team proposes daily github commits for stages 1 and 3, weekly beta releases on iOS TestFlight for stage 2, third-party assessment in stage 4 and proof of social activity and proof of integration by wallet providers in stage 5 (mostly communication + marketing). Overall this approach ensures a high degree of auditability of the project, and I don’t see any major issues with the value proposition in terms of how transparent the project would unfold, if voted for. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Feasibility: Wanted to clarify that apart from the stage of final security review, we are not using subcontractors. The Authenly app and cloud backend were both developped entirely by Eric and Tiffany. We are fully autonomous and do not need a large team of devs. The project has been planned for a 6 months development, enough to be done by the current team, which shipped the full Authenly solution in the same time."}, {"q0": "Good idea, however, it is worth thinking about the potential downside where others could attempt to also create a Cardano log-in just to hack people. Due to the increasing number of crypto-natives and education regarding Web3 safety, it may be that people are less inclined to login with Cardano associated with their ada and more so just log in with something less risky. Hence, I may argue that logging in with social media may be a more frequently chosen option. Needless to say, signing in with Cardano may be the future however, it will take a lot of education and behavioural change to encourage others to be vigilant as to where they are entering their 'web3 details'. Hence, it may be that a portion of the budget is spent on blogs, more videos, social media efforts to fully educate those who are especially new to the blockchain space. I did see that the proposal mentioned \"A small marketing budget is sought to make the crypto community at large aware of the project once delivered.\" but it may have to be more than anticipated, hence requiring some reallocation of funds. ", "q0r": 3, "q1": "The timeline is thorough and well explained. I would recommend the security assessment to be longer as this is key. Right now, 4 weeks has been allocated for the security assessment of the entire open source stack by a third party reputable contractor and/or public body of similar reputation - it may need to be longer to really understand weak points. Furthermore, the team look to outsource this aspect of the proposal but I would suggest they have someone in-house that they hire to be part of the team. Additionally, stage 1 and stage 5 mention a discord account, would these be different for testing and implementation or is it the same discord being referred to? \n\nThe team is very strong, Eric having 20+ years in software and was previously the CEO/CTO of a $30m software business. Eric also has experience in cyber as well as crypto via building Authenly's passwordless authentication solution from the ground up. Tiffany, is a Dphil candidate at Oxford University studying quatum computing. Both parties compliment each other well and are looking to hire someone in marketing potentially (subcontracted).", "q1r": 4, "q2": "Following on from the feasibility section, I believe the budget could be broken down further in order to further illustrate how they would go about their activities. Additionally, some of the tasks they hope to outsource may have not been budgeted accurately yet so I suggest they get some quotes so they have a rough indication of how much it would cost them. This would help with the plan so they'd know how to go about their alternative options and when. To that end, daily github commits sound great as well as weekly beta releases on iOS. It would be great for them to mention/consider who they have in mind to review and give them feedback, they mentioned a discord group but who are they targeting initially as their first testers. Perhaps this would come under their marketing plan. Consequently, for proof of integration by wallet providers they'll need to start reaching out and building networks for potential partnerships.", "q2r": 3, "assessor": "z_assessor_1586", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "impact : this project is to put in place a standard for Signing with Cardano. The idea is to let the user choose which credentials she wishes to share with the integrated app, whereas with a social login, the choice is absent.\n"}, {"q0": "This project is aiming to solve an ongoing problem with cardano users making sight in so much easier and simplifying the process. It does take a while for the user to set up his profile but overall it saves time in the future and makes sign in so much easier and accessible with maintaining the same level of safety. I see that this project will be able to improve the overall user experience while dealing with cardano", "q0r": 5, "q1": "This project is already being programmed and is similar to an already existing program for etherium so we know that the module works. The break down of the project stages and funding make sense and are reasonable for a proposal like this one. The time frame gives the proposers enough time to work on the programming and marketing of the project.", "q1r": 5, "q2": "Because the project is open source the auditing process should be simple. Getting contracts with cardano wallet providers can also be an indication of the project success. Having clear set goals gives the auditeurs a base to look at when working on the audits.", "q2r": 5, "assessor": "z_assessor_1660", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposer addresses some of the areas of criteria for the challenge, namely how the project can add value to Cardano and can scale.  However I question if a new secure sign-in solution is a major area of need.  I would have liked the proposer to outline examples of sign-in issues especially with real-world examples.  The proposer does benefit from having an existing solution (Authenly App) which would need to be development for Cardano.  Another approach the proposer could take is to partner with an existing Dapp or wallet for the POC.", "q0r": 3, "q1": "The proposer has provided a solid roadmap with detailed milestones over a 32 week period.  The budget does not provide enough detail and it would have been helpful to have an hourly budget and allocation of funds for each of the phases.  It appears a majority of the work is being performed by 1-2 team members and there is not enough background information to provide confidence.  Considering the background of the proposer I would want to see a more detailed scope along with additional team, outside experts or more information on the proposer’s capabilities to successfully complete the project.  ", "q1r": 3, "q2": "The proposer provides milestones with measures of success for each phase.  However the proposal does not provide enough specific KPIs which can be tracked nor does the proposer provide a method in which the community would be able to continuously track progress.  This project seems open to having multiple KPIs (number of wallet users, number of sign-ins, etc.) and establishing a method of communication would be helpful. ", "q2r": 3, "assessor": "z_assessor_1807", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Impact : examples of sign-in issues (as mentionned) are more around GDPR and compliance (users are not in control of their data) than  of security. \nFeasibility : yes, the majority of the work will be done by a team of 2."}, {"q0": "Marvelous proposal and the premise of extra authentication to lock assets, personal data and other user information. This could be a seamless way to integrate all Cardano services across the whole ecosystem even medical data on some of the medical applications open out there. So it says passwordless, more clarity as to how the did is read if its integrated on the mobile app and computer app as an extension or is it biometrically read and transcribed in codes to validate it? More clarity from end user side would be a great addition.", "q0r": 4, "q1": "Great abundance to development experience perhaps a project management/marketing role could assist in this proposal to provide intake and onboarding of partnerships. But from the development side and the startup for solution the experience is great!", "q1r": 5, "q2": "The information provided is sufficient in regards of stage by stage approach, timeline is quite transparent and the funds are well scaled for the sprints.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "Impact: In very short, the DID will contain some user profile data, and the user will be able to choose which data to share, which not to share. Also, the idea is to implement (later) a solution to revoke data sharing, which Social Logins do not offer."}], "solution": "The full spec and implementation of a Sign-in with Cardano (front-end and back-end), just like there is already a Sign-in with Ethereum.", "experience": "I have designed and developed a unique passwordless login solution (Back-End, JS, App) via QRcode scan using open standard auth protocols. See here : https://authenly.com/passwordless-authentication ; Since early 2021, I have worked on DIDs (Ceramic) and web3 integration."}