{"id": 400026, "author": "heinz.gassner", "title": "DLT360: Technology RADAR Team", "url": "https://cardano.ideascale.com/a/dtd/400026-48088", "category": 26449, "amount": 25000, "description": "The DLT360 Risk & Opportunity RADAR provides a clear view on technology topics and interoperability. This needs to be periodically updated", "f6_no_assessments": 3, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 958, "q0": "Business intelligence metrics are a valuable resource for the more experienced founders and leaders used to guide products and solutions. By business intelligence here I mean the risk assessment data used to guide business decisions in a technology perspective. These Business intelligence metrics (RADAR tool) that identify risks and opportunities can be a valuable resource for those who know how to use it and could greatly encourage the formation of accepted business practice within the Cardano community and for web3 applications in general. This proposal if funded could provide a substantial amount of value for companies in the web3 community that are looking to grow beyond early-stage phase.", "q0r": 5, "q1": "This proposer is known within the Catalyst community, has had successful proposals that were previously funded and delivered upon, and has provided a detailed break down of what the project entails and how it will be implemented. There is a high probability of successful implementation  based on the information available in the proposal.", "q1r": 5, "q2": "The internal auditability metrics provided are detailed and well structured. The completion of previous funded proposals also gives a lot of surety to the ability of the team. The auditability metrics provided plus the history of solid delivery gives more than enough surety that the necessary auditing mechanism are in place, functioning properly and has a proven track record.", "q2r": 5, "assessor": "z_assessor_1248", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2969, "q0": "Technology is growing at a fast pace and it might be overwhelming for most of us to stay updated with the latest inventions. The community needs to be always ahead of itself in making sure the applications and projects on the chain adhere to the latest protocols and make sure they accommodate the newest of the features. But this might end up being a redundant process, with all doing their own due diligence. Hence, the proposed provides a wonderful solution to overcome this issue. The proposer is putting a team together that does all this work for the rest of us and keeps us invested in them. All major aspects starting from scalability to interoperability are monitored closely by this and reported to their partners to make necessary changes in their businesses accordingly. The DLT360 team has come up with brilliant ideas this time, and they sure seem to be capable of crossing any obstacles in their way and making sure this proposal does the impact they hope for.", "q0r": 5, "q1": "This proposal being one of the 4 fronts the proposer is trying to progress on, there is plenty of evidence to prove its worth implementation. The team has provided an elucidated plan with transparent milestones both from the entire DLT360 RADAR project perspective as well as the expectable deliverables from this proposal alone which targets the 'T' technology part. The proposer definitely makes an elaborate introduction of the team and the members are no doubt competent to do something of this sort. The entire DLT360 team standing behind these members to assist them throughout adds a sense of confidence. The requested fund has been carefully calculated and the same can be seen in their budget breakdown which shows that no point is overemphasized and all figures are apt and justified. Therefore, I feel the proposal not being a standalone but a part of something bigger the team has already put together makes it all the more reliable and the chances of successful implementation are very high.", "q1r": 5, "q2": "The key measurable metrics are all very apt to the challenge's expectations and are very lucid by definition. The  5 KPIs provided by the proposer help the auditors evaluate the proposal from all aspects be it from the job done by the team, the extent of the reach of their work, and also the acceptability of their work by the community. The success metrics are enriched versions of these key measures along with a benchmark figure against each of them that the proposer wants the community to evaluate their work and success. The figures look promising and very strong. All the above points make this proposal nothing but a near-perfect one in this challenge and the team having submitted proposals across other challenges will surely provide all required reports and tracking mechanisms for the community to audit them in a hassle-free and time-saving manner. All in all, the proposal has covered all the gaps and looks solid in every way possible making it one of the best in this campaign.", "q2r": 5, "assessor": "z_assessor_1594", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6748, "q0": "Evolving industries like Crypto need to have organised research into possible risk and opportunity scanning to exploit fleeting settings and to prevent catastrophic situations. The proposal aims to finally mature into a subscription-based service with a focus on Cardano. In order to have the motivation and reduce the risk for bootstrapping the fund has been proposed. I feel the proposal is overall in alignment with the challenge.", "q0r": 5, "q1": "The proposing team has a good mixture of experienced and young researchers still in academia. The professional profiles and combined experience is impressive and as a community, it is always a product to attract and retain academia to retain the correct path. ", "q1r": 5, "q2": "The deliverables list internal meetings and review of work. These activities are challenging to be considered as deliverables. This phase preferable could have committed to producing some amount of objective research output. In this respect, the audit of project concerning deliverables is complex. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "We will add latest research regarding technology, investigate open standards and interoperability perspective, summarise & report quarterly", "experience": "The DLT360 Domain Expert Team and the contributing network with\nSenior leadership experience in Fortune 500 companiesUniversity experts, assistants and studentsIndustry partnersDLT360 supporting team\n\nDetailed information & links provided in 'Feasibility' section below"}