{"id": 400403, "author": "proofspace.nick", "title": "PRISM VC Schema/Cred Definition", "url": "https://cardano.ideascale.com/a/dtd/400403-48088", "category": 26449, "amount": 27685, "description": "PRISM verifiable credential (VCs) is a plain unstructured JSON - unstandardised and hard to use for building trust networks", "f6_no_assessments": 6, "f6_rating": 4.388888888888888, "videos": [], "media": [], "f6_assessments": [{"id": 701, "q0": "If the most important element of any DID or SSI platform is its trust registry, then one must understand that the governance framework for that trust makes several assumptions.  These assumptions relate to the roles, process and requirements of the framework, and each of these things must be defined clearly.  In a good governance framework, no part contradicts the whole, and so you can see that these definitions are pretty important:  if they are sloppy, if they are not carefully thought out, then they run the risk of breaking the framework protocols, which in turn breaks the trust registry, which leads to a collapse of confidence in the authenticity of the DID.  And since the whole point of DIDs is the ability to verify authenticity, well...  Where this proposal comes in is to get the digital manifestation of one of those cohorts, \"roles\" usually, into a standardized JSON format.  This means that a defined role can be consistent (non-contradictory) across and between frameworks, which starts opening up the whole SSI landscape for everyone. Because the scripts will be opensource, it means further and further templates can be created, and that the they can be kept up to date in the quickly iterating world of SSI.", "q0r": 5, "q1": "The team is a very active group within the Cardano SSI development space with many tools already built, and more true SSI tools under consideration in Fund8 as well.  They have done a good job here of costing by deliverable items in the roadmap, making it easy to see how the worth and difficulty of each stage has been gauged.  The 4 month timeline has a pretty good indication of how they are approaching this, but the thing I really like is that they have been in contact with the IOG Atala team to target the most critical areas that area not already being addressed, which means that between collaboration and independent work, they should avoid the waste of duplicated effort in an opensource project.  Hidden in the timeline is the mapping of this API to the Hyperledger and W3C models, which will be a nice bit of cross-pollination for Cardano that they don't mention anywhere else.  It is great to see this kind of ecosystem integration, as a general rule, and it is the kind of thing we need to see happen early and often, in every corner of Cardano, to realize the Linux-like vision of decentralized governance and self-sovereign identity. ", "q1r": 5, "q2": "The team highlights their familiarity with existing reporting protocols, and their inclusion of KPIs that correlate to the beats of the monthly auditing rhythm is an indicator of that familiarity.  They also point out that their collaboration with Atala adds another layer of accountability.  As the results and documentation are opensource, there should be no difficulty for the community to keep up with the project, and to assess whether it has successfully delivered on its ROI.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2142, "q0": "This is a highly technical proposal. I shall try to offer my insight into the general quality of it, and I urge voters to read more technical reviews in order to form a better opinion on the merits of this proposal. My understanding is that the team proposes to build a set of dictionary verifiable credentials that can be later used in other applications, something that is closely connected so far with the Atala Prism project. The team promises to work in close contact with IOG in order to avoid any duplication of work. \n\nKnowing that credentials / verification are paramount for the future development of blockchain technology, I offer 4 stars in terms of impact. Had I been a technical person and thoroughly understood the tech behind, perhaps 5 stars would have been also on the table. ", "q0r": 4, "q1": "From the bios presented, the team behind the proposal looks rock solid, with many years under their belt of building complex applications. Following a quick Linkedin verification, a significant portion of the team seems to be sadly connected geographically to the tragic events currently developing in the eastern parts of Europe. As a personal note I can only hope that they are out of harm’s way!\n\nThe budget is very schematically presented, and perhaps a bit more effort into offering a more granular approach would have been useful. But overall amounts seem reasonable and given the medium budget asked for a slight leniency can be applied. \n\nMilestones are clearly presented, with the project starting in June and ending in September. The proposers point out the importance of working closely with the IOG PRISM core team to mitigate the risk of duplicated effort, and this is a very strong point emphasizing their attention to details and desire to collaborate with other teams involved in the matter in order to be as efficient as possible. ", "q1r": 4, "q2": "The collaboration with IOG of course acts as well as an additional layer of accountability in progression tracking, and the team promises to present progress at townhall and other community meetings on an ad hoc basis. What would have been really useful perhaps was for the team to on-board some technical competencies and try to find a way to communicate the usefulness, efforts and the ongoing work of their project to the general non-technical Cardano community, which is currently lacking and it is very difficult to understand the jargon unless you’re an insider of the particular topic. ", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3442, "q0": "Proposer has provided  all the information requested by Impact. First, Proposer introduced the solution specifically. The features of the solution such as the need to authenticate personal information or the impact of the solution on Cardano and users are specified. In addition, the proposer also introduced how the solution works, the risks of implementing the project as well as providing solutions to mitigate this risk.", "q0r": 5, "q1": "The roadmap is quite detailed when the jobs are divided by month and the jobs are also indicated quite specifically. However, the information section of the 'detailed budget breakdown' is not very specific, the proposer can add more information about each sub-section of the items being announced, for example providing a cost calculation for the 'DSL' for Schema Definition. Prototype DSL-Language'. The information of the members of the group is provided fully, making it easy for voters to confirm and receive information.", "q1r": 5, "q2": "The Auditability section has a lot of useful information. Proposer will declare project progress monthly and also indicate project progress and development goals. However, the proposer can provide additional KPIs/Key metrics that the team wants to achieve in the future or related to the project, so voters will have a better understanding of the project's goals.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 4406, "q0": "I appreciate the core idea of ​​this project, the main aim of the project is to create a standard representation of PRISM VC schema with open-source tools to verify standard & define how to store one in blockchain. The way the proposer presents the problem and the proposed solution is of a high reference value, although the product has not yet been released, but the proposal outlines the directions for implementation of the impending work. The necessary information, technical terms explained, and illustrated examples are mentioned to help us get a rough picture of the product, its core features and how it works, and its positive impact of the project on the Cardano ecosystem. I can see they put a lot of effort into analyzing the similarity between the proposal and the Challenge's KPIs and it really worked. The risks and mitigations are also fully described.", "q0r": 5, "q1": "They developed a project development plan divided into sections: milestones, key tasks/events, and assigned work. The plan is to allocate reasonably for 3 months – a rather short period of time, but since they have previously introduced themselves as an Engineering team with 80+ yrs full-stack dev and distributed systems research, I believe they can totally affordable to complete the mentioned tasks according to the schedule. Regarding personnel, they provide us with brief biographies of key team members including information: occupations, skills, work experience, seniority, previously implemented product/project. I realize that the members all have deep knowledge of Blockchain, capacity, and work skills that can ensure the success of this project. However, I would like them to provide Linkedin profiles of members or something that can prove the authenticity of the personnel information they provide. In terms of budget allocation, they allocate budgets based on the cost of products/software/devices for project development. I think the allocated budget is quite reasonable and for the right purpose.", "q1r": 4, "q2": "I have yet to see information about KPIs in this section. What they offer is more like the tasks they will complete than a KPI that can measure the development and success of the project. For their project, KPIs can be the number of documents available or the number of users expected to reach after the project is successful. The plus point is that they have an extremely detailed project progress report plan and how the community can access information about the development of the project. Overall, I think this proposal has clearly laid out its goals and intended roadmap for the community to understand and easily follow.", "q2r": 4, "assessor": "z_assessor_1724", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10467, "q0": "This proposal wants to create open standards for PRISM credential schemas and therefore directly alignes with the challenge goals. These schemas will be open source and will greatly benefit many projects building on PRISM in the development of their own schemas, as credential schemas are a critical point for development of DID-solutions and to enable greater interoperability in similar verticals. Even if Atala releases their own open source standards, the project communicates with the core team to focus on best outcomes, and it raises diversity of options either way. As a PRISM pioneer, I can say that the necessary infrastructure for developing on PRISM was not in place for most components and needed a great deal of further improvement. It is also an important effort to start general open source schema identifications for various projects and combined efforts of these to raise project synergies and reputability.", "q0r": 5, "q1": "The team is highly skilled in their domains and has 4 years experience with their no-code SSI-platform ProofSpace, so they know what they are talking about and are familiar with the always-changing SSI space. Being a PRISM pioneer, I also think that their plan makes sense and is feasible, although I am not a highly experienced developer myself. The budget and its breakdown seems appropriate for such a task.", "q1r": 5, "q2": "The given information is sufficient to audit the progress. Their milestones resolve greatly around publishing open documentations for their schemas which need to be checked individually. They do not provide numeric metrics, but milestones might also be the better choice for this kind of project.\nThe only caviat is that the team did NOT include links to identify their team, not even their website. On searching the web you find \"https://www.zaka.io/about-us\", which seems to be the some old version for ProofSpace, but it is named Zaka and not ProofSpace. This is very confusing and should have been included in the proposal from the start. As the team is somewhat known through various PRISM meetings, this does not weigh as heavily as it would have for unknown proposers, but should be kept in mind for future proposals.", "q2r": 3, "assessor": "z_assessor_924", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10549, "q0": "Defining a standard for verifiable credentials is a great fit for the challenge. The proposal also includes the development of basic verification tools. Impact will be conditioned on wide adoption, and there are two main obstacles for that:\n1) Credentials issues imposing their own VC format. Realistically, there's not much the proposers could do to mitigate this risk, short of publishing an stellar standard and tools, that issuers WANT to use.\n2) Competing VC formats. In this case, I'd have expected the proposal to include some consideration to existing formats, as there are several projects already developing credential solutions in Cardano (see Fund7 DiD challenge grantees). They include an \"\"invitation for feedback\"\" in the auditability section, but I think they should be the ones reaching out, as they do not still have such central role in the community.", "q0r": 4, "q1": "As I mentioned in the alignment/impact note, the biggest risk to this project is not achieving \"standard status\". In this regard, I'd have expected to see some outside involvment in the drafting phase. Regarding actual execution, the team seems to have the necessary skills to complete the project, but they include an unsettling caveat in relation to budget: \"research may reveal different specifications to what we have estimated and may cause a change in the implementation budget\". There is no budget extensions for Catalyst proposals, so what is the team's plan if that happens. I think in a situation like this, it'd have been preferable to see a \"Buffer\" amount, that might be awarded, but never distributed. ", "q1r": 4, "q2": "Deliverables are the expected ones, documentation and tools. I'm surprised they plan to release draft documentation to gather feedback from the community, but no test/beta version of the software. \n", "q2r": 4, "assessor": "z_assessor_941", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Create standard representation of PRISM schema and VC definition w/ open-source tools to verify standard & define how to store in blockchain", "experience": "Senior engineering team with cumulative 80+ yrs full stack dev and distributed systems research."}