{"id": 400716, "author": "nicoarqueros", "title": "CIP Editor time Sebastien for 1year", "url": "https://cardano.ideascale.com/a/dtd/400716-48088", "category": 26449, "amount": 20000, "description": "Currently Sebastien (dcSpark CTO) acts as a Catalyst editor which requires a weekly time commitment. This proposal is to cover the time cost", "funded": 2, "upvotes": 129774237, "downvotes": 6614336, "votes_result": 123159901, "votes_cast": 244, "f6_no_assessments": 5, "f6_rating": 4.199999999999999, "videos": [], "media": [], "f6_assessments": [{"id": 4651, "q0": "The editors indeed deserve the remunerations for the effort they put-in in streamlining and standardizing the \"Cardano Improvement Proposals\" (CIP) process. Lack of such remunerations may result in lowering of the efficiency of the community to serve the purpose. The Fund should have separately allocated fund to distribute among the editors. Nevertheless good proposal.", "q0r": 5, "q1": "2 years of contribution to the community in increasing the efficiency and ease of the community operations. However could have lowered the asked funds, considering the contribution of 4 or 2 days(32 hours) a month. The improvements in the community operations even so, are considerable. Also the proposal could have included other CIP editors viz., Matthias Benkort, Duncan Coutts, Frederic Johnson and Robert Phair, and proposed a consolidated remunerations upon their consent.", "q1r": 4, "q2": "\"Sebastien continues reviewing proposals for 1 year\" a good success parameter, however the logging the hours spent on the CIPs could provide better engagement details to remunerate and justify the remuneration funds requested.", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6762, "q0": "Sebastien of DCsparks and ex Emurgo is an expert who has contributed substantial commitment and technical guidance to the Cardano ecosystem. Technically brilliant, he has been bringing out issues in advances that needs the attention of the specialised body of Cardano. The Cardano Improvement Proposal (CIP) handles the improvements required to be undertaken as a collective community to progress the chain and overcome standardisation problems. Sebastien is a competent person curating CIPs; the proposal to compensate him is more than justified. ", "q0r": 5, "q1": "Sebastien has proven credentials and has been endorsed by IOG and Charles himself therefore the proposal is in line and Sebastien will be able to deliver the mandate.", "q1r": 5, "q2": "20K USD for a 2-year commitment from Sebastien at less than 1K USD per month seems to be a very reasonable rate for his expertise. The progress is highly auditable.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 7240, "q0": "This is another proposal by the well known company dcSpark which has worked on multiple Cardano projects in the last few years. In this case, they are requesting funds for their CTO, Sebastien, to continue co-authoring and reviewing Catalyst Improvement Proposals (https://github.com/cardano-foundation/CIPs). \nThese proposals are one of the ways that standards are established in the Cardano ecosystem and Sebastien has been a collaborator for over 2 years for free. I think the benefit to Cardano is obvious: we want competent people to continue contributing and also to be rewarded for doing so, to incentivize them to continue and to improve.\nThe proposers don’t foresee any risks except for an accident affecting Sebastien, but then of course, that could apply to all proposals out there. The risk is irrelevant anyway, as Catalyst money is only distributed on a month to month basis, depending on whether proposers make progress or not.\nI fully agree this proposal effectively addresses the Open Standards & Interoperability challenge. Score: 5.", "q0r": 5, "q1": "There is no timeline provided, which is alright in my opinion, because this proposal requests funds to continue contributing to Project Catalyst and Cardano for 1 full year.\nThe requested budget is 20000 USD, which would mean around 1666 USD per month, which seems reasonable. The amount of time Sebastien spends on this varies from 2 to 8 hours per day and will likely increase the more activity Project Catalyst and Cardano as a whole sees.\nRegarding the team, as mentioned in the beginning, the people behind this proposal are a company called dcSpark which is well known in the Cardano ecosystem. As a recommendation, I think it would be useful to always share a link to your site (https://www.dcspark.io/) so that voters can easily see who you are and maybe to list a few of your achievements, just to make it more convincing.\nThe person handling this proposal will obviously be Sebastien and his credentials can be found on the project’s website. \nGiven what we already know about Sebastien’s activity, I think this proposal is highly likely to be implemented successfully. Score: 5.", "q1r": 5, "q2": "For Auditability, as in other dcSpark proposals we are only provided with general information on how progress and success can be tracked. We are given “Number of CIPs merged” and “Whether or not Sebastien is attending the meetings & reviewing proposals” as progress indicators. In this case, I believe that checking in from time to time to coordinators of the CIP meetings that Sebastien is attending will be sufficient in order to track progress.\nIf, by next year Sebastien is still active in this role, then the proposal will be a success. I agree this proposal is easily auditable by the community. Score: 5.", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8016, "q0": "CIP Editor Sebastien time in 1 year is the problem to solve in this challenge. The solution of this proposal is to cover the time cost of Sebastien acting as a CIP editor, including reviewing and writing the proposal. This is a great idea well drafted by the author I think it solves the challenge. The solution of the criteria is to need a place to be standardized and discussed and that is the purpose of the CIP process. Sebastien has a track record of helping draft CIPs to be accepted and also drafting standards on behalf of other groups. A smooth CIP process will ensure an increase in the adoption of open standards among Cardano projects. Risk perception is a very important issue. The author should list some more possible risks if any.", "q0r": 3, "q1": "The team's blueprint and timeline for opening biweekly CIP meetings is deliverable as the progress of drafting and reviewing standards for each meeting. The funding required is $20,000. I have not seen the author detailing what the budget should do for each item spent, only the author listing the hours increased. It's confusing how do they calculate their budget? I'm guessing that they base their budget on total hours worked. So I think the author should plan more clearly about the budget and work progress in each given milestone. About the team to get a good profile I think you should add the member's public information through the profile: GitHub, LinkedIn or related certificate. Or you can also announce on YouTube channel or website so that the community can comment, as well as check the project progress.", "q1r": 2, "q2": "Measuring the progress of the project's development by the number of CIPs merged, Sebastien attends meetings and reviews proposals. It is proposed to provide rather rudimentary metrics, and it is recommended to add more metrics. However, this is a good proposal to get funding, I think the author needs to have a clearer plan on the roadmap, the indicators to measure the success of the project. This project is a brand new project and is waiting to be funded.", "q2r": 2, "assessor": "z_assessor_649", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10589, "q0": "CIP is an important, organic process to evolve Cardano ecosystem and standardize the development so Cardano can be more organized and focused as whole community. If you check the CIP GitHub, you can see the existing works, both done and in the pipeline, that will enable more improvements and growth to our ecosystem. We can also discover there are currently five editors contributing to it, which I think is still quite a small team in great endeavor. I think to do a project on such scale requires considerable resource and capabilities and I agree with the fact that Sebastien has done this voluntarily so far for 2 years is a testament to his dedication and love for Cardano and its community. I believe that we as a community are grateful and appreciating the fact that we have talented and dedicated individuals building relentlessly on Cardano and we need to appreciate their resources, efforts, and dedication and retain them as our family member.", "q0r": 4, "q1": "Since the community has enjoyed Sebastien work in CIPs for about 2 years, one might say we already have the deliverables even before having this proposal approved for funding. I found Sebastien is cited as author in 3-4 currently active CIPs while I am familiarizing myself through the CIP GitHub. In addition to authoring these CIPs, Sebastien is also helping community members to draft CIPs while also editing them. I hope I am not too biased but above should an adequate receipt for community in the meantime. I also wish that I can have a better understanding of the overall mechanism and process of CIP so I can give deeper feedback towards this. While I might be personally advocating for a positive outcome of this proposal, the community will still be the ultimate decision maker through voting stage. Only from there, we can find out if the community is ready for this kind of proposal.", "q1r": 4, "q2": "All the work done in CIP is open-sourced and verifiable in its GitHub. Editor meetings are public, recorded, and summarized. Anyone can actively participate in the process and can easily tell if they feel Sebastien’s presence and support in CIP activities. I have gone through a few of the meeting summaries and am convinced that the work done is legit and advancing us one step at a time. From all the proposals I have been reviewing so far, this one will look like an open kitchen to anyone willing to learn more or in charge of monitoring the progression. Still, this proposal leads to various questions about the conditions of four other editors outside of Sebastien. Are they contributing voluntarily as well or is their contribution part of responsibility coming with their regular jobs, thus they have already been fairly compensated? Maybe they are in the payroll of one founding entities of Cardano including Cardano Foundation, IOG, or Emurgo? If the community compensates Sebastien through Project Catalyst fund, does community also need to compensate the rest of the four editors just to be fair (assuming all five of them share equal contributions and workload)? I hope this proposal can be a gateway towards more advanced discussion concerning this topic and how our governance can help to create a better system to address this matter in an effective, sustainable, and responsible manner.", "q2r": 5, "assessor": "z_assessor_943", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Financially cover the time cost of having Sebastien act as a CIP editor which involves both reviewing & writing proposals", "experience": "Sebastien was one of the initial CIP editors that setup to the CIP process and has acted as a CIP editor (unpaid) for about 2 years. During this time, he has reviewed proposals, attended meetings every 2 weeks and also authored / co-authored multiple proposals"}