{"id": 400827, "author": "rg.admin", "title": "Research Guild: Ecosystem Report", "url": "https://cardano.ideascale.com/a/dtd/400827-48088", "category": 26449, "amount": 61329, "description": "Cardano values academic rigor; however, the Catalyst community lacks coordinated research that investigates ‘open' ecosystem growth.", "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 1226, "q0": "The proposal aims to produce an ecosystem report detailing status of the Cardano ecosystem based on Growth, Opportunity and Synergy. Proposers will explore open ecosystems in the broader blockchain space as well as Cardano projects and Catalyst initiatives. The report will include a list of recommendations that will be made public. \n\nThe proposal not only promises to deliver an Ecosystem Report, but also the beginnings Research Guild, a collection of individuals with academic research skill. The guild will use those skills to generate tailored research projects for Catalyst campaigns and proposer collaborations. The proposers will start by contacting individuals in their researcher network but will also open the Guild to others to apply.  \n\nThe proposal is completely in line with the challenge. The research provided by this proposal will help everyone in the Cardano ecosystem. We will see pain points, areas of collaboration, needs and desires of users and developers. Solid research is fundamental in establishing open standards. We must know what is available, ready and being used in order to converge on standards. As a developer in the ecosystem, I see great value in such information and can't wait to read the report.\n\n", "q0r": 5, "q1": "The proposers have gone out of their way to provide the most detailed budget in Fund 8. They have selected 5 surveys from which to find an average hourly rate for researcher work. This results at an hourly rate of 32.74 USD for research assistants. If the proposal is any indication to the attention to detail and quality of work we are to expect in the report, this is a bargain. \n\nThey have also created a 80-20 split for each proposal under Research Guild. 80% of the budget for each proposal (including this one) is reserved for research. The rest is for Admin Fund for Research Guild. The details of what these mean are given in astounding detail. They have a solid grasp on what they need to do to build Research Guild, how they will spend that 20%. They also define Custom Guild Reports and set an expectation for future Research Guild proposals and this one. \n\nThe proposers are a group of three PhD Candidates with varying backgrounds. Collectively they form a strong foundation for Research Guild, bringing in skills related to software, technology, intellectual property, law, international relations, media, creative, health and community development. With a clear methodology to find more researchers with expert knowledge when necessary, I have full confidence the team will be able to produce a high quality report.", "q1r": 5, "q2": "The proposal is the most clear and auditable proposal I've seen in Fund 8. The proposal is divided in two: establishing Research Guild, covering its administration costs and creating the ecosystem report. There is ample detail on what each of these entails, what will be done to make them happen. There are multiple KPIs for each which can be used to gauge the success of the project at any time.\n\nThe process by which the report will be generated is provided in detail. There is a report time budget template, which highlights how research will be loosely based on. This details the steps of the research project and provides a general timeline for those steps. Also, the proposers have provided a frame for this research, which can easily be used as a checklist by auditors looking to see if the goals of the project has been accomplished. Overall, this proposal is very clear and auditable. If all proposals were like this we wouldn't need CAs :D", "q2r": 5, "assessor": "z_assessor_1323", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2150, "q0": "NOTE for VCAs and voters: The Research Guild is a network that has launched 6 proposals during this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider Research Guild framework. My assessment takes into account aspects common across all proposals (the network’s organizational aspects, competency, research approach, workload, or similar reporting mechanisms and budget logic). You shall therefore find common parts across these proposals and parts specific to each proposal.\n\nKey takeaway: good but not excellent problem identification, fair alignment with the challenge, some potential for added value for Cardano if the report is shared with the community and thoroughly digested by future proposers before designing open source solutions. \n\nThis proposal aims to deliver a report addressing issues inhibiting open ecosystems by conducting a feasibility study that investigates ecosystem challenges and solutions across blockchains, and within Cardano and Project Catalyst. From all the research proposals put forth by the Research Guild I find this one to be the most challenging in terms of identifying actionable items and delivering the message across a wide range of stakeholders, so I am slightly less optimistic regarding its impact and added value. ", "q0r": 4, "q1": "Key takeaway: A solid academic-oriented team behind the proposal, a clear plan and recruitment process for the actual researchers and a reasonable timeline for completion. Good value for money.\n\nThe plan. The core team consists of 3 PhD / PhD candidates from Auckland University, Renmin University respectively University of Osnabrück, all currently undergoing blockchain-oriented activities. They would NOT conduct the research themselves, but instead they would extend invitations to their networks of academic and professional colleagues to participate in the actual research. Perhaps the standout of the team is the wide-net that they can cast within their own respective networks when searching for viable research candidates. They would subsequently undergo a recruitment / selection process based on received resumes / review of academic work published / blockchain experience. The actual work itself would be undertaken by this collective of independent researchers onboarded as above. \n\nBudget talk. 20% of the budget would go towards building the research network (research identification, outreach, project management, support, designing reporting templates, etc.). 80% of the budget would go to creating tailored research projects following a loosely based pathway which makes sense considering the knowledge-building capacity of the project. Payment for individual researchers would follow a determined base hourly rate, based on the average of online surveys already undertaken. There are extensive figures offered in the proposal, but the key figure to remember is the overall base pay of USD 32/hour and US 60/hour for highly specialized work.\n\nThe team estimates that the report will take six months to complete: from May 2022 until November 2022. There is a detailed project roadmap outlined in the proposal, with great granularity down to weeks necessary for each intermediary step.", "q1r": 5, "q2": "Key takeaway: very clear roadmap and extensive KPI list, great verification potential and clear communication channels for work undertaken.\n\nThis work will be delivered in the form of a public report with key research insights and recommendations that can be implemented by the community immediately, or pursued through future Project Catalyst funding proposals.\n\nThe project team will approach auditability in three ways: (1) establishing a set of project indicators, (2) engaging in internal peer review processes for each deliverable and (3) engaging in Project Catalyst community advisor review processes. Success would be measured 20% through the success of establishing a research network and 80% on the report itself. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3551, "q0": "With the rising interest in cardano the number of newcomers is on the rise but unfortunately there’s so much information out there that lacks structure it becomes overwhelming for newcomers to learn more about the ecosystem. The proposers are working on a thesis that aims to organize this information filter out what is less important and make learning about the cardano ecosystem less intimidating to people who are just being introduced to the community and its components.", "q0r": 4, "q1": "Three PHD students who know very well how to conduct a proper research and study are working on this project some with experience relating to cardano and ecurrency makes the team more than qualified to conduct a search paper like this one. Giving the users of this research all the organized information without the hassle of going through tons of scattered information.", "q1r": 4, "q2": "With the presenters capabilities there shouldn’t be a problem implementing. There is more than enough information about the funding breakdown and time line. As useful as engaging in peer to peer reviews is internally. The availability of the catalyst community reviews makes it more open and clear for auditeurs", "q2r": 4, "assessor": "z_assessor_1660", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "The Research Guild will deliver a feasibility study to investigate strategies for growing an open and synergistic ecosystem on Cardano.", "experience": "Three PhD candidates studying blockchain applications in land management, intellectual property and peer production; a PhD in Law and International Relations; expertise in research, project management, community development, governance, teaching, license compliance and auditing."}