{"id": 403106, "author": "tienna", "title": "Open ISPO", "url": "https://cardano.ideascale.com/a/dtd/403106-48088", "category": 26449, "amount": 48700, "description": "ISPO or other forms of ISO should be renovated to support network decentralization and sustainability", "f6_no_assessments": 6, "f6_rating": 4.555555555555556, "videos": ["https://www.youtube.com/watch?v=t86e0M-262A&start=700"], "media": [], "f6_assessments": [{"id": 801, "q0": "The Cardano ecosystem is growing rapidly with a series of dApps being launched. ISPO is a great way to release project tokens to the community. However, there are some small problems that still exist such as the community will pile into a large number of Pools, this will make the small Pools affected a lot. OPEN ISPO is a great way to balance this. Ensuring small pools will operate more efficiently thereby increasing the sustainability of the Cardano network. In addition, the successful proposal also helps project owners a lot, they just need to focus on product development, the distribution of tokens will be distributed fairly to everyone through OPEN ISPO.", "q0r": 4, "q1": "The team are all members with a lot of experience and passion for the Cardano ecosystem. The community can also easily check the information of each group member through the links. This will help the community better understand each person's experience and skills. I believe the team will do well on this proposal.", "q1r": 4, "q2": "The roadmap for implementing the group's proposal from June to October is very clear and complete. The amount requested to be disbursed $48,700 is also presented by the team in a very clear and transparent way. I find that this amount of money used by the group is very reasonable. KPIs are also fully provided by the team and are easily measurable.", "q2r": 4, "assessor": "z_assessor_1213", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 2161, "q0": "Interesting idea! The value proposition of this proposal is a blend between (1) helping small pool operators adhere to open / best practices applicable to their pools (support, assistance with token distribution, reduce environmental footprint) and (2) providing insight on-chain data with meaningful information via live dashboards. I there is definitely a good fit here between the challenge and the proposal with a decent potential to enhance open standards adoption at the level of stake pool operators. ", "q0r": 5, "q1": "The team behind the proposal is doing an excellent job at presenting themselves and their background, even as far as sharing email addresses. Definitely a very strong point in terms of standing behind the project. Lots of technically-minded people, hence good prospects overall.\n\nTimewise, the project would start in June 2022 and would finalize in October 2022. We have a fair level of description of how the project would unfold. Labor cost estimation are rather unclear, with a list of 15 items not very easy to go through or understand quickly, so I definitely suggest that future updates take into account onboarding some budget-oriented colleagues to help out with these tasks, and possibly with organizing admin / financial tasks since there is definitely a lack of competence on this level.  \n\nOverall a good impression, with a few worries in terms of budget and internal organization.", "q1r": 4, "q2": "Proposers state that the project shall be trackable on github where they shall create a specific branch to document progress made and weekly meetings. Perhaps a very small point of improvement, only to play devil’s advocate here, is to ask the prospers to consider issuing a policy document targeted towards the Cardano community, something down the lines of: here is our proposal, and here are our guidelines for pool operators, who, in order to be granted a high score on our platform, have to put in practice points a,b,c, and need to have the minimum requirements x,y,z. This would definitely be helpful in terms of making your value proposition very clear quickly across the board. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5021, "q0": "This proposal is suitable for the challenge, it will foster the growth of small teams and allow projects to distribute their tokens in smart ways to support a decentralized and sustainable network, it increases synergy among Cardano projects and gives equal opportunity to all teams.", "q0r": 5, "q1": "The proposer team consists of 4 members, who are perfectly suited to the project based on their experience and relevant evidence. The proposal provides a reasonable roadmap for the implementation of the project with a timeline of 5 months to complete the work. The proposed budget for the project are $48700. Be detailed into 15 sub-items, the requested amount is detailed to the hour with each hour working with  $50 and includes the contingency cost for the risks that may be encountered. Thus, the reader can easily judge that it is reasonable.", "q1r": 5, "q2": "The proposal provided a roadmap with timelines and work goals to be achieved for each that was specific, easy, and metric to determine the success of a particular project publicly because it will be displayed on the web. If it can be measured with specific numbers, even better. I find it a bit difficult though.", "q2r": 5, "assessor": "z_assessor_1820", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6435, "q0": "I may be completely wrong on this but as I gather in the details of this proposal, the more I am inclined to think that this project runs in the complete opposite direction of openness which this Challenge is promoting. I understand the issues which have arisen over the last few months in terms of the impacts of ISPOs on small, or unknown, or single pools, which would have detrimental effects to Cardano's decentralisation, but to create a a grouping of small pools to be the main participants in a project's ISPO is in itself restrictive and antithesis to openness. Medium sized or large but single pools would likely feel left out and feel victimised by their own successes and hard work, and that outcome is just as damaging to our ecosystem as small pools missing out on ISPO participation. If I am indeed wrong and this is not at all what is presented, then I apologise. As a former assessor of tenders for a university, I have learnt to read between the lines and see past imperfect submissions and grasp the general ideas but in this instance, this was the primary assessment I have made. Should this be resubmitted in the future, I highly recommend for the proposer to take their time and writing the proposal in a very clear and simple way that would not confuse the audience. Assume the reader is not aware of ISPOs, SPOs etc, clearly describe the impacts of SPOs and how your problem/solution is a much needed project in Catalyst.", "q0r": 2, "q1": "Despite my assessment under 'Effectively Addresses the Challenge', I will proceed with this assessment as if I clearly understand the project so that I can assess Success based on presented details. From this perspective, this proposer and the team clearly have the credentials and the background needed to progress this project to success. The team members have not only provided their linkedin profiles but also added descriptions of qualifications & other personal details such as Facebook accounts, which does lead to trust. The qualifications of each team member shouts of experiences in the Cardano space and the fact two are SPOs adds to the confidence that they know what they are doing. These qualifications make it easy to believe that their June to Oct road map is realistic and highly achievable. The labour costimation is very detailed however, where this proposal could be improved is in stating in more granular detail how much each different role would cost. A blanket $50/hour is presented but surely, each of the four team members will not receive the same amount for different responsibilities and skillset? If this is the case, it may benefit the reader to know that this will be jointly built with essentially every member having the same responsibilities.", "q1r": 4, "q2": "There's quite a number of details in this proposal that's auditable. The month by month milestone could itself be tracked but the proposer has added KPIs which would determine the success of the Open ISPO when it starts running. There are personal githubs, telegram addresses and Facebook profiles added for team members. I highly recommend the team creates specific 'Open ISPO' channels as a way to generally communicate with the community. There's a site shared for any enquiries but this is in Vietnamese. The proposer would do well to either translate this in English or provide a way for English-speakers to post enquiries. ", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Response to the impact rating: We are grateful for CA's divergent perspective. However, the question we ask is \"What would happen without Open ISPO?\". Are small pools completely forgotten and hard to survive in this decentralized race? if so, is it totally worth it? Therefore, I think this rating will be at least 3 stars or more (because the CA is actually agreeing and disagreeing)  and if so, it means a rationale does not correspond with the score given"}, {"id": 6770, "q0": "The migration of stake from small pools to pools selected by ISO like Sundayswap generated uneasiness among Single pool operators who are the backbone for Cardano decentralisation. The proposal seems to address this issue.  There is still an issue with the validation of the pools. However, the model as brought out in the proposal seems to be an ideal solution. ", "q0r": 5, "q1": "The proposers are SPOs with the skin in the game and have the necessary expertise to operate a Cardnao pool. They have sufficient experience and have the necessary education for completing the proposal. The methodology and the timeframe seem to be achievable. There is technical risk in sharing a dashboard of pool performance however the manner in which the proposal is presented gives a belief that It has been considered and the system will be hard.", "q1r": 5, "q2": "The budget of $47,700 has reasonably justified in the proposal and the expenditures are valid. The work and spoke have been analysed in detail in the project. The payoffs from the project depend on the adoption of the system by ISOs. There is a large number of projects under development in Cardano and the is likely to be a recurrent requirement for the proposed system. However, a market analysis to include how many ISO is likely to use the developed system in its lifetime would have added value. The project aims to support 2 ISO programs.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7762, "q0": "Initial Stake Pool Offerings (ISPOs) are indeed an integral part of Cardano projects. This proposal are proposing an open standard for how to conduct this ISPO so it become seamless, interoperable, and helps decentralization. They’re able to explain the problem clearly; that the ISPO current model will threaten the decentralization nature of the network because of how delegators will move their ADA towards the project’s large stake pool, awhile leaving the smaller stake pool behind. This proposal also able to explain clearly how it solve it, by allowing smaller stake pool to take part in this ISPO instead of the project’s centralized pool. This idea is inspired by Minswap Fair ISPO last year and it becomes a success.  ", "q0r": 5, "q1": "This proposal have a team with relevant experience, and we can verify their identity and work through LinkedIn and Github. From the experience of the team, this proposal knows what are needed for this project to succeed; plutus developer, engineer, etc. The budget is reasonable and explained clearly in detail, from hour of work, role, budget allocation, etc. Although they’ve explained what their plans are, I’ve yet to see at least one example of such ISPO scheme or mechanism in this proposal. Having an initial idea of how the ISPO mechanism would work with the smaller Stake Pool will help the community to see “how will this standard could help projects and smaller Stake Pools”, other than the decentralization aspect of it, or the reduced labor or setting up cost for the projects to distribute their token. In some ISPO (Like Genius Yield) they have a pool margin of 99%, meaning that all the delegators reward will go towards the Stake Pool Operator. Now, if a project wanted to do something similar but with the help of smaller SPO (Stake Pool Operator), what will the margin rate be? Will it be 99% and all goes to the operator, then give it to the project owner? OR will there be a split margin mechanism, e.g 50% goes to the project, 5% the SPO fees, and 45% will go to delegators reward as normal. These early overview of implementation could at least indicate that the team have the idea on what they’ll work on. BUT, they actually did mention about this scheme model, and it will be called “ISPO as a Service”, described in another proposal. So this ISPO model only works for the “Open ISPO” model, which is an ISPO model without the project owner received any ADA in return, so it will be just free token distribution to the community, through smaller stake pool. All in all, this is a well written proposal that includes all the information needed for feasibility, and have a high chance of success.", "q1r": 5, "q2": "This proposal provide a clear roadmap, complete with metrics/KPIs, and goals for each month. They’ve also provide their Github link to track their development progress, and also a Telegram link for support. Overall, this is a transparent project that the community could easily track the progress.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Our Open ISPO is going to foster small pools growth and enable projects to distribute their tokens in the smart ways", "experience": "We are full-stack developers, funded proposers, SPOs, Eastern Townhall moderators, blockchain tech-savvies."}