{"id": 403530, "author": "jrepusseau", "title": "Open Certification and Traceability", "url": "https://cardano.ideascale.com/a/dtd/403530-48088", "category": 26449, "amount": 3000, "description": "Most of blockchain certification and traceability solutions are private, permissioned, there is a lack of research in common NFTs standards", "f6_no_assessments": 5, "f6_rating": 3.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2163, "q0": "The problem with which we start is that most blockchain certification and traceability solutions are private, permissioned and there is a lack of research in common NFTs standards. Leading with this, the proposal aims to create a minting NFT platform for real asset movement certification. I find a very poor fit between the challenge and the proposal, although the problem identification touches the right chords. Somehow the overall level of detail is simply not sufficient for me to deem this proposal worthy of consideration as a viable solution. A few words and a catch-phrase are not sufficient in this case, sadly. ", "q0r": 2, "q1": "I am afraid there is not much good news here. There is next to no information regarding the team, other than it comprises specialists in the supply chain and a website developer, possibly the same person. The project would take 6 months to deliver, and regarding the budget there are no figures, just word explanations that the budget will be broken down in three parts. Given the small amount it is rather understanding. \n\nAgain, a very poor feasibility assessment across the board. ", "q1r": 1, "q2": "The team proposes the following metrics: number of partnerships with developers, number of brands that want to work with the project, number of NFT transactions and active users. I find an overall lack of interest in detailing the project further, for instance how do you measure “wanting to work”? \n\nI urge the proposers to come back with a much more comprehensive proposal. ", "q2r": 2, "assessor": "z_assessor_1454", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5192, "q0": "The problem described in this proposal is aligned with the challenge intending to carter for the lack of research in common NFTs standards. The solution is structured with details and an easy visualization. \nThe idea of using the benefits of traceability to another industry sector is incredible and has a sense of collaboration that go beyond of Cardano’s ecosystem. It can be a revolutionary solution for small and medium companies. Choosing food industry and pharma supply prove mindfulness and commitment of the team with this project proposal.", "q0r": 5, "q1": "Despite of having no mention of the team members details, the plan has integrity giving the idea that the team has an array of experience and are looking for increasing power with partnerships.\nBesides that, the goal of improving supply chain sustainability gives the idea of an intangible project. So, to be reasonable I recommend exploring the goal’s explanation with small objectives or concrete results.\nThe budget breakdown describes 3 parts however it has no details on how the money will be spent. \nIn summary, the timeframe, budget and overall program were not so clearly detailed.", "q1r": 3, "q2": "The success description is well written and clear but not in a tangible way. The metrics were listed appearing to fit in the project context, but also with no objectives setting. All these gaps make the auditability very hard to be done during the monitoring phase.\nThe intangibility makes even more difficult for the team executing the project and achieving success. Also difficult to rely on for those who would invest and evaluate results.", "q2r": 2, "assessor": "z_assessor_1893", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7542, "q0": "Great proposal and the resources are interesting. It's  a great start for logistical purposes and assigning a mintable tracker to a products using the NFT frontier.", "q0r": 5, "q1": "The experience is relevant in regards of the development aspect, the marketing and product management side requires perhaps some experience to take this idea to mass adoption. The discord site is good start but perhaps expanding a role towards making this function more noticeable to other developers or community member looking for partnership could enhace its use case potential.", "q1r": 4, "q2": "The metrics are a bit limited in scope but the intention of growing into partnership is present. Perhaps the completion of the working website should be part of the metrics first sprint, the discord and interest growth of the channel can also serve as an indicator as well as meaningful leads in partnership as expressed in the auditability section.", "q2r": 4, "assessor": "z_assessor_594", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 7763, "q0": "The lack of openness and interoperability with common NFTs standard leads to the creation of this proposal. This proposal is creating a standard for how these certification and traceability should work, so it will become interoperable with other supply chain projects in Cardano. The solution will be open source and allow for the development of NFT standards and to provide a complete traceability solution in different sector, which will increase the adoption of using Cardano as supply chain traceability solution. ", "q0r": 5, "q1": "The impact that this could bring is great, however it doesn’t seems like the team have sufficient number of people needed for this project, at least yet. The team consists only of two people, and we can’t verify their profile as they don’t include their profile link. Including the team LinkedIn profile would help the community to verify their previous work and experience. They did include the working code (codepen.io link) and they have a simple working prototype for TeaOnChain, which is to track particular tea supply chain. However, a working product without proper marketing or business relation people would make this project under the radar. I would suggest to include people with business development experience, or a community manager to spread the words about this new idea. Judging from the budget requested, it is relatively small compared to other project. If the intention for creating this technology is to onboard other project to use this standard, then it needs additional people with project management experience. Hence, asking for more fund in this area could help a lot, considering this industry is growing fast and good technology or ideas could slip pass without anyone knowing. So my suggestion would be: bring more people into the team to handle the business or project, in order to spread the words and collaborate with other project. Secondly, I don’t see any roadmap or timeline, which is important for the community to expect when will this project finished. Finally, a $3000 is considered too small, but I can’t further judge this since I don’t know the time of deliveries (timeline). ", "q1r": 2, "q2": "The proposer include the metrics for said goal and objective. However, it doesn’t specify the exact number of expected metrics. It would be helpful if they can provide the target  for, example, the number of developer partnered in the first month would be at least 3 people, the number of brand would work with us would at least 1 brand in the first 3 month, etc. This proposal doesn’t include Github or any other public link for the community to track their progress, which will make it not transparent to audit.", "q2r": 2, "assessor": "z_assessor_640", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8023, "q0": "The stated issue clearly identifies most blockchain traceability and certification solutions as private, licensed, lack of research on common NFTs standards as the issue to be addressed here and it involves to this challenge. The main point of this proposal is to create a new NFT that provides the use of the blookchain to accelerate the adoption of ADA as a means of payment. The solution to this problem is open source that aims to attract developers and accelerate the adoption of blockchain in the supply chain for small and medium-sized companies, traceability can be suitable for all sectors. area. I think this is an interesting idea that the author's solutions can attract the community.", "q0r": 4, "q1": "The timeline given by the author is 6 months, but I have not seen the author clearly list what to do in those months. (For example, how many researchers need to work in January, what to do with developers in February, how many websites can be built and published in March, April ...) I think when listing more clearly the things to do in the month, the credibility for the group will be higher. The funding required for this project is $3000. The author divided into 3 expenditures, but here, the author does not list the most detailed expenses, only in general. There is also no contingency plan. The group consists of 2 members whose related experiences are listed by the author, but I did not see the author mention the number of years of experience, nor did I see the author refer to the profile of individual linkedin profiles to the group.", "q1r": 3, "q2": "Measurable indicators clearly stated by the author in the implementation plan are detailed, specific and easily measurable. Metrics that are easy to check through the author's tools. The success of this project has not been clearly listed by the author. This project is wider than when from the previous project. The previous project was funded in fund 7 with a score of 4.17 points with a vote of 170.", "q2r": 3, "assessor": "z_assessor_649", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Open source industrial NFTs standards and verification tools for track and trace and certification of real world assets such food and drugs", "experience": "Jules Repuseau: Blockchain researcher, Web developper, Emurgo student (Haskell associate)\nE.C : Web developer"}