{"id": 404785, "author": "dzhuliana", "title": "Mentorship Incentivization DAO", "url": "https://cardano.ideascale.com/a/dtd/404785-48088", "category": 26449, "amount": 8500, "description": "Forming trusted mentorship relationships is important for transferring knowledge, but creating them over a large network is challenging", "f6_no_assessments": 8, "f6_rating": 4.208333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2882, "q0": "This proposal in the remit of “mentorship” is an excellent idea as there are some incredible people in the Cardano community (and crypto space at large) offering their time and help on a frequent basis. The mentorship incentivization DAO idea is a great way to reward these mentors for all they do and in such a seamless way, by incentivizing mentors with native tokens and NFTs. One of the key objectives is to build value within a network through a Mentorship DAO. This would also encourage them to mentor more as it means they can justify the time spent even more. To that end, this proposal aligns well with the ‘Open Standards & Interoperability’ challenge in a way that empowers those who are fundamental to the ecosystem. Hence, enabling equal opportunities to all via the mentees, this notion is key to the challenge. It may even be the case that one day the mentees could become mentors and be rewarded in the same way, this growth would be great for the ecosystem. Notably, mentor-mentee matches will be presented as a block with its own NFTs and both, and stored on the blockchain.", "q0r": 4, "q1": "The team is very capable of delivering the stated outcomes of their proposal as the founders are experienced in an existing global mentorship program which uses an AI matchmaking engine to deliver predictions of the ‘perfect match’. Additionally, they have a blockchain architect and university researcher joining their team. One of their plans is to present a white paper so the team combination is fitting for this task. However, there are no details on the blockchain architect nor the university researcher yet in the proposal. Nonetheless, the 3 main team members all have experience working within the same start-up so this indicates that they work well in a team.\n \nThey have plans to utilise Cardano in many ways including their ​​Identity Solution using ATALA Prism implementation. Their technical lead and software engineer have strong skills and experiences, a lot of which would be beneficial to their project. They have also conducted previous research which has identified that over 90% of our users joined through a reference from a friend, and they also found that their platform aids in reducing the stress of selecting a mentor. Notably, their program design expert has relevant business-related skills which would be useful for market research and the two-sided nature of their idea (mentor and mentee). \n\nIf more detail on the university teacher and blockchain architect were provided, they would have ranked higher as these team members would provide specific skills which would be useful for the development of the white paper. ", "q1r": 3, "q2": "Their first stated step is to scope the viability of building a mentorship DAO on Cardano and subsequently writing a white paper. The team have already thought about a roadmap including future funding roads, this shows their long-term vision for the project, to continue the development of their decentralized mentorship platforms. They clearly outlined the stages at which each task would be carried out in correspondence to the relevant fund with fund 8 relating to ‘research and scoping of mentorship DAO’ and, for example, fund 9 relating to building the reimbursement infrastructure for the mentors-mentees. To that end, they have a great idea of their overall mission and long-term plans, however, I suggest that they thoroughly explain each stage and the individual steps needed to achieve their goals, even for the whitepaper in this instance. As of now, their plan is less detailed but it would be useful to break everything down. The costs could also be broken down even further too. Overall, a good idea for the ecosystem which rewards the most productive members of the community with increased ownership of the DAO, the proposal needs to be broken down further to individual steps and costs. ", "q2r": 3, "assessor": "z_assessor_1586", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3124, "q0": "I find it difficult to align the the proposals objective (research into a mentorship DAO) with the challenge requirements.  The challenge requirements focus on setting common standards to increase interoperability and collaboration between projects.  Whereas the proposal focuses on matching mentors with projects that need them.\n\nPerhaps this project meets the challenge’s “possible direction” of “Support a network of professional technology ambassadors”?  Mentors can potentially increase interoperability through concurrently working on several projects, applying the same standards to all projects.\nHowever, every mentor is different.  Project overseen by one mentor may not have standardization with another mentor’s projects.\n\nI think the project better aligns with the challenge DApps and Integrations.", "q0r": 3, "q1": "The proposal is the first stage of a proposed 4 stages of funding.  The first stage being research and a whitepaper.  \n\nThe proposal provides detail on 3 team members.  The team has experience in software development and building a website which matches mentors with women.  The website appears effective.  \nThe team do not mention any experience working on Cardano, or any blockchain.  However, the proposal is simply the research stage, so specialist development experience on Cardano is not yet required.\nThe proposal mentions they have made  contact with a blockchain architect from IOHK and a researcher who are happy to contribute.  This shows good planning for the necessary team expertise.\n\nA budget and timeline are provided.  The target time period of 3-6 months, and budget of $8,500, appears reasonable.\n\nIt appears the team has the necessary skills to complete the research whitepaper goal of this proposal.", "q1r": 5, "q2": "The proposal clearly defines the problem, matching mentors with projects in a sustainable way.\nThe proposal mentions that progress reporting on their research paper will be published on Gitbook, but does not provide reporting intervals.  \nNo target dates (months or quarter-year) for commencement or completion are provided, just the total expected months.\nThe proposal clearly defines the problem, matching mentors with projects in a sustainable way.\nOverall I agree the proposal provides sufficient information to assess its progress.", "q2r": 4, "assessor": "z_assessor_1614", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5678, "q0": "The proposal concept addresses the challenge question and is aligned with the challenge. The proposal is well written, however the problem statement (Forming trusted mentorship relationships is important for transferring knowledge, but creating them over a large network is challenging) and the summarized solution to this problem (Incentivizing mentors with native tokens and NFTs and gaining credibility for delivering extraordinary mentorship experience-Mentorship DAO.); are not directly referencing this proposal, but in fact refer to the yet to be completed project that is proposed in another challenge which has a $30,000 budget and is linked to at the very bottom of this proposal. (https://cardano.ideascale.com/c/idea/399243) This proposal would receive a higher rating if it was more clear to the voter through the problem statement and summarized solution that this proposal and funding budget is for a white paper only, and not the completed platform. The impact and value to the cardano community of this whitepaper alone is questionable if the entire project is not completed.  The proposal includes the entire project roadmap that spans 12 months, but does not provide what the entire project budget would be when completed. I have determined from the included linked proposal that it would be at least $38,500 with the two current proposals funded, however they also mentioned applying for more funding in future funding rounds, so it is not clear what the total cost may be to deliver this entire project. For voters to begin funding this project/process it would be helpful to know the entire budget, even if it is not part of this proposal, as the value of this proposal depends on the successful funding and completion of the entire project. ", "q0r": 4, "q1": "The proposing team has provided their extensive experience and qualifications, and they are well qualified for this task, having run a successful mentorship program, they have specific industry and domain knowledge. The budget of $8,500 for the whitepaper alone is reasonable. They have itemized specific tasks and the roadmap for the entire project. However the timeline for this white paper alone is 3-6 months, which in my opinion could include a more specific deadline, such as 6 months. That said, I believe this team is very capable of delivering this whitepaper, with this budget, within a 6 month timeframe. The feasibility of delivering a functioning mentorship DAO that is outside the scope of this proposal, which includes requiring additional funding, and collaboration with IOHK and Singularity Net, will however be a much larger challenge. ", "q1r": 5, "q2": "The whitepaper will be available to the public after 6 months, and it will be easy for the community to audit this proposal. \"A complete whitepaper document proving the concept of decentralized mentorship infrastructure with incentivizing the NFT business model.\" Therefore I have given this 5 stars. However, I would also note that the auditability section of this proposal includes the following:\n\n KPIs:\nGitBook - Project Progress Reporting\nAlign a whole community to a shared set of objectives\nIncentivize all community members to drive the progress of key results\n\nI find this section to add confusion to the proposal, as this is part of the larger DAO project, but not specific to this funding proposal. It is also unclear how \"aligning a whole community to a shared set of objectives\" will be a specific and quantifiable KPI. ", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7272, "q0": "This proposal will initiate research into interoperability between several major protocols in the Cardano infrastructure - Zero-Knowledge Proof-of-Identity, Identity Solution (ATALA Prism), AI Mentor matching (SingularityNET), Native tokens and NFTs (CNFT.IO).  \n\nThe problem statement is bold in describing a fundamental challenge network openness and interoperability.  Discoverability of possible mentor relationships between networks could be a true 'game changer' to the problem the challenge brief defines.  \n\nBy building their Mentorship DAO on Cardano with open standards, they will trailblaze a path for further adoption of these standards. ", "q0r": 5, "q1": "The team is described fully with LinkedIn profiles.  They are currently operating a professional and polished mentorship service.   The plan is to research, prepare and present a mentor-matching protocol in a white paper format.", "q1r": 5, "q2": "There is a basic roadmap that details the general subject and timeframe of the work.   I would like to see more alignment with the language of the Challenge Brief. That being said, this is a project that begins research on creating and integrating open standards to create another standard for mentorship activities.  This would increase open standard adoption by adding to the research and use of the standards mentioned above.  This proposal does align with the Challenge, but it's not as directly stated as I would like.", "q2r": 4, "assessor": "z_assessor_56", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7769, "q0": "The idea for this proposal is about creating an incentivizing protocol / mechanism for mentorship to address credibility and reputation. This would address the problem where trust is an integral part in any decentralized ecosystem. The great part about this proposal is that they would combine other project product or solution, such as CNFT.io for creating the NFT, ATALA Prism by IOG for credential, AI Mentor matching algorithm from SingularityNET, and recently popular technology Zero-Knowledge Proof-of-Identity for avoiding self-selection bias. This would increase the collaboration between project, and would actually grow the Cardano ecosystem with openness and interoperability. ", "q0r": 5, "q1": "OneUpOneDown is a project with great team composition, consisting of 20+ years of experience with software engineer, experienced program design expert, and technical lead. This proposal able to provide the LinkedIn profile link, with the description of their experience. This team composition further proves that the proposer knows what it needs for project like this. The project budget is provided, however it’s still too general and could be broken into more detail. Such as: work hours for each role with salary rate per hour, infrastructure cost for using CNFT, SingularityNET, and other services, etc. This proposal mentioned that this proposal is their Stage 1: Whitepaper, which revolves around researching the scope of Mentorship DAO itself. They planned to continue to Stage 2, Stage 3, and Stage 4 in future Fund 9, Fund 10, and Fund 11. Considering that aspect, the 12 months roadmap description could be justified since this is their first researching phase. Combine that with the fund requested being smaller compared to other proposal, it’s very reasonable. I’ve also noticed that the $8000 budget is for their 3-6 months scope, and for future funding they will propose another proposal in the next Fund 9 to Fund 11. Overall, a concise and well written proposal, however it could be a perfect 5 star review if they break down the budget further in identifiable manner. (Refer to this proposal for the budget breakdowns: https://cardano.ideascale.com/c/idea/403106)", "q1r": 4, "q2": "The roadmap is provided, also with the information that they will continue this project in future fund. The metrics and KPIs is explained. However, it’s still need to be detailed further. What does it mean to “Align a whole community to a shared set of objectives”? What would be the concrete parameters to assess those aspect? Furthermore, setting a goal and objectives for each first 3-6 months would be helpful, so the community expect the milestones, result, or progress for said timeframe. For example: The first 3 months would be releasing the whitepaper review, the 4th month would be releasing an initial design and requirements, etc. Refer to this proposal’s ‘Auditability’ section to further improve this project future proposals: https://cardano.ideascale.com/c/idea/403106. Other than that, they’ve included GitBook link which would make their progress transparent to the community and public.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9627, "q0": "This proposal sets out a clear problem and related to the needs of the challenge, as well as its solution which aims to Incentivizing mentors for delivering experience-Mentorship DAO. Its positive impact within the ecosystem is clearly explained by the team, which specifies the added value of this project, in particular with Mentoring relationships assist individuals within a network in building mutual learning relationships.\nNote: it is always good to specify the precise questions of the challenge that the team seeks to solve with their solution (this facilitates direct understanding for the readers). For example, the writing of the withe paper can be linked with the request to induce norms, mentorship encourages collaboration through relationships of trust, but also allows the creation of infrastructures and tools for collaboration. \nAnaway, KPIs are correlated with those of the challenge and also have an interesting qualitative dimension. \nIt´s clearly explain that this project aim to adress futur challenges, with a long term vision. \n", "q0r": 5, "q1": "All team members are clearly identifiable, links are provided. This team seems solid and their competence shows a coherence with the needs . The budget is clear and realistic, divided into different implementation phases. The technical details are approached in an understandable way, which is a plus. The fact that the team clarifies that they have been actively taking part in many Catalyst initiatives, as well as their collaboration with IOHK Blockchain architect, ATALA Prism, SingularityNET, CNFT.IO and Open Standards Advisor who has 25 years experience, shows that the team is well built and will be able to respond to demand. \nRisks are addressed with a proposed solution.\n\nNote: be careful that the solution provided does not call into question the bases announced by the team, perhaps by formulating it in another way: as the writing of the white paper will allow us to identify the risks even better and will ensure of the expertise and the quality of the collaborations so that the project reflects professionalism and conscience….something like that...  \n", "q1r": 5, "q2": "The roadmap is clear, very comprehensive, proposing different stages with a time horizon as well as an extended vision of the development of the project. KPIs make sense and make it possible to refer to both quantitative and qualitative success indices. The community will be able to attest to the progress of this project thanks to the whitepaper, the GitBook. As well as the team plans to Incentivize all community members to drive the progress of key results. (maybe specify how concretely). The attached document is very interesting https://eprint.iacr.org/2019/546.pdf . \nOverall, this proposal shows an effort of auditability both by the meaning of the proposal and by all the information provided. \n", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10039, "q0": "Cardano is an open source plutus code and many of the catalyst fund promotes open source collaboration. From that point many other talented coders can learn and utilize these newly build template and grow the comunity faster. \nThis group proposes to collaborate on ZK proofs and other high target improvement for cardano and incorporate them into their Mentorship program. \nWhere not only the build code will be open source but the network of highly experience users will share their knowledge with eager motivated gentlemen wanted to grow into cardano and build new ideas. ", "q0r": 5, "q1": "The project is split into multiple Fund phases. I recall about 3-4 Fund starting from Fund8. \nTherefore the overall success of this project will require a long term view on multiple Funding cycles in catalyst. \nI will focus only on the propsed Fund8 (current) fund for my assessment to validae the budgetary / roadmap / Success rate of this project. \n\nThe budget and milestones are very well presneted and discuss even the indirect participants the teammember will interact with (IOHK and others). I find the experience of the OneUpOneDown group (proposers) to be within the technical expertise to speak the same language and help solve and create new opensource standard for the topics listed (ZK proof and others). \nHowever I wonder their involvement with the outside groups if that has been already agreed upon or will seek to be confirmed. \n\nFinally the integration of mentorship program would be well received from the community and can be a great asset / success overall. ", "q1r": 4, "q2": "As disucssed the group of OneUpOneDown is looking to fnd their integration into the cardano mentorship space in the long term. \nThe goal for them is to help build certain of the standards that IOHK Atala Prysm etc... want to put in place. \nOverall the budgetary and commitments for this fund (8) are simple and straightforward. They commit to initiate the Research and setup of their integration and the funds and reporting will be put in place on a monthly basis. ", "q2r": 3, "assessor": "z_assessor_785", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10322, "q0": "The Cardano community is characterized by a spirit of open collaboration and willingness to help. Since the development of many disciplines within the network are in the early stages of development, I think the OneUpOneDown team is a great idea. \nI am familiar with the work they do helping women to mentor and be mentored, and I am sure that this same concept could be successfully transferred to the blockchain with the proposal to incentivize participation through tokens and NFT's, this would create a virtuous circle in which many could participate by contributing their knowledge either in Cardano or in other networks.\nThe planned infrastructure has been carefully designed to transfer the service that OneUpOneDown is already successfully providing, but now in the form of a DAO. \nI believe that this initiative would have a direct impact on the challenge of open standards and interoperability and in case it is funded, I am sure it will have many eyes on it ready to jump in.", "q0r": 5, "q1": "As the scope is ambitious, the proposal envisages giving special emphasis to the development of white paper and tokenomics, in close collaboration with IOHK and the flagship solution for digital identity, Atala Prism.\nThe requested budget is affordable and seems adequate for this first stage of development, taking into account that the proposal will be continued in the following Catalyst project funds. I consider it appropriate to dedicate time and resources to the careful planning of the DAO guidelines.\nThe team is experienced and has extensive knowledge of the model to be developed, so I have no doubt that they will be able to carry it out.\nThe only comment for the team is that the budget numbers do not match the breakdown as there is a difference of $1000 USD, it would be helpful for the transparency of the project to correct or better detail this section.As the scope is ambitious, the proposal envisages giving special emphasis to the development of white paper and tokenomics, in close collaboration with IOHK and the flagship solution for digital identity, Atala Prism.\nThe requested budget is affordable and seems adequate for this first stage of development, taking into account that the proposal will be continued in the following Catalyst project funds. I consider it appropriate to dedicate time and resources to the careful planning of the DAO guidelines.\nThe team is experienced and has extensive knowledge of the model to be developed, so I have no doubt that they will be able to carry it out.\nLastly i would ask the team to review the budget numbers since thet do not match the breakdown as there is a difference of $1000 USD that don´t add up. It would be helpful for the transparency of the project to correct or provide better and aditional detail for this section.", "q1r": 4, "q2": "While a sufficiently clear roadmap is provided, the team does not establish direct KPIs to monitor the success of the project or whether development is progressing according to plan.\nI think the activities described could be explained in more detail to understand what will be done and how.\nOn the other hand, it would be worthwhile to establish periodic checkpoints to report progress to the community, as well as the attendance to some forum such as the Townhalls so that we can understand what the progress of the talks and collaborations with the organizations mentioned above have been.\nIn summary, I believe that this proposal adds value to the ecosystem but I think that the auditability section should be reevaluated for the benefit of the initiative itself.\n  ", "q2r": 2, "assessor": "z_assessor_883", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Incentivizing mentors with native tokens and NFTs and gaining credibility for delivering extraordinary mentorship experience-Mentorship DAO.", "experience": "Founders of an existing global mentorship program with an AI matchmaking engine that is already delivering predictions of the \"perfect match\". In discussion with university researcher and blockchain architect to join the team."}