{"id": 404921, "author": "checkpoint", "title": "Community and Content Accessibilty", "url": "https://cardano.ideascale.com/a/dtd/404921-48088", "category": 26449, "amount": 45000, "description": "A lack of real content in multiverses and blockchain projects - a huge barrier to entry. No one knows how to distribute content. We do…", "f6_no_assessments": 5, "f6_rating": 2.7333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1232, "q0": "The proposers are a digital media company named Checkpoint. They produce content related to videogames and their influence on culture, society, education and politics. All their content is free. With this proposal, they will fund part of their transition to web3. They will \"pioneer content on Web 3.0 and utilise the multiverse and blockchain to increase its reach and influence\". There is not much detail to the solution beyond this statement.\n\nThe proposal mentions an \"engage to earn\" model in the problem solution. There aren't any explanations in the proposal. It's not even clear if implementing this model is the purpose of the proposal. But having read it several times along with their supporting document (orangepaper) I believe it is. They even published a detailed article on the model on medium. Sadly any detail there is missing from the proposal.\nhttps://medium.com/@checkpoint_99136/checkpoint-engage-to-earn-the-new-way-to-interact-with-content-e58e4a7b87b6\n\nThe proposal doesn't fit with the challenge at all. The challenge is about building an open ecosystem of Cardano projects, establishing standards and increasing interoperability. The proposal is about creating web3 content and smart contract infrastructure for a digital media company focusing on gaming. The proposal would fit better in several other challenges: Media Creatives, Dapps and Integrations, Business Solutions all are a better fit for the proposal. As it stands, this proposal has nothing to do with Open Standards and Interoperability.\n\n ", "q0r": 1, "q1": "It is very difficult to assess the feasibility of this proposal because it is difficult to understand what it is for. I explain why this is so in clarity/auditability. Either way, here is my interpretation of what the proposers will build and if I think that is feasible.\n\nThe proposers have extensive experience in media, VR metaverses and multiverses. Part of the proposal is on producing web3 content and making it available \"across all devices\". It's not clear whether that includes VR but even if it is, the team is capable of it. \n\nThe questions about feasibility lie mainly on the technical parts. The team has no relevant experience on Haskell and Plutus development. They will have to outsource these skills. They don't mention this as a challenge or as a consideration. This does raise a red flag for me as a developer trying to learn Haskell and Plutus. These are not common knowledge things. Developing smart contracts with Plutus is not a skill many people have. It is difficult. I'd expect the team to have pondered upon their ability if they are to implement their \"engage to earn\" model on Cardano. \n\n", "q1r": 2, "q2": "The proposal and the plan provided is confusing. The solution does not mention NFTs, smart contracts or governance tokens at all. The detailed plan does. The plan can be separated into two: Technical and Media Content. Technical work includes the release of NFT cards and the distribution of a governance token. NFTs are detailed yet the governance token is not explained at all. It's not clear if the smart contract work will be entirely on the governance token or any other functionality. \n\nMy educated guess as a developer is that the proposers will implement smart contracts for the \"engage to earn\" model as they have highlighted in their medim article. They don't mention this at all in relation to smart contracts in the proposal but since \"smart contract creation\" is the number 1 item on the budget, it is likely in my opinion. \n\nIt should be obvious that a reviewer shouldn't have to guess what the smart contracts are for. Having read the proposal it several times it is not clear to me what the aim of the proposal is. I've read through their orangepaper and medium article and there is a good project there. It's just not clear at all in the proposal. \n\nThere are some auditable aspects to the proposal although suffering from the same lack of clarity. On the roadmap are items like: \"Become more engaged with schools to...\" \"Announce major partnerships\". These aren't very specific. They don't have dates attached to them. A third party can't easily discern if these goals have been met. How many schools/kids is expected to participate? How many partnerships and with who? This information is not there.", "q2r": 2, "assessor": "z_assessor_1323", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1099, "q0": "This looks like a nice project that's trying to use Web3 innovations as a means for education and producing engaging content. Acknowledging this, I hope the proposers will forgive me if I can't help but observe that the proposal's relationship to this challenge is a bit tenuous. \n\nThis challenge is about building an open-standards ecosystem as a means to achieving broad interoperability. An NFT trading card system might be a clever idea for triggering engagement but I don't think the proposer has drawn a clear line between this goal and either the ethos of open standards or even interoperability between technologies. \n\nI suppose one could posit that NFTs and smart contracts are being pitched here as a way to promote a platform that exists via media technology, but as I said, this is a little tenuous for a category aiming to, say, incentivize cross-project collaboration or introduce new common standards.", "q0r": 2, "q1": "The NFT collectables plan is pretty interesting, though the budget introduces a few concerns. If the proposers wish to budget $5,000 for marketing, they should mention what kind of marketing they wish to do with that money. If they wish to have another $5,000 for contingencies, they should offer us an example of what kinds of unforeseen expenses they have encountered in the past that led to this need. \n\nThe team seems solid, though off-site links to say, LinkedIn pages or personal websites would help bolster the case here.", "q1r": 3, "q2": "The auditability section also needs to present some more detail. What kind of reports will Checkpoint produce for the community to show progress while the development of the project is under way, and after its release? Listing a few KPIs could help here too. \n\nI want to say, if this proposal isn't funded, I hope these proposers don't give up. There's promise for something interesting, potentially, here.", "q2r": 2, "assessor": "z_assessor_1275", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2057, "q0": "I personally don't see a huge demand for this in the Cardano space. Yes, I understand that gaming is a huge industry and will likely help projects to earn a lot from investors. However, there are lots of games and metaverses already building on cardano. It addresses what the proposal wants, however, I don't see a challenge here. ", "q0r": 3, "q1": "This could be implemented, however there are already so many gaming projects currently being built on Cardano that will likely have a similar effect to a project like this. It's a great idea, and I love building on Cardano blockchain, but there may be a better way to get funded. There may be better options that will be more innovative with the funds. ", "q1r": 2, "q2": "Once again, there is information that helps provide closure to this project and the effects that it could have on the community. I don't think there is too much of a need for something like this to be funded by IOHK. I do appreciate that there is already a community revolved around Checkpoint and I think that is something that could be the jumpstart that it needs. Fund wise. ", "q2r": 3, "assessor": "z_assessor_1448", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 2170, "q0": "The proposer leads with the statement that there is a lack of real content in multiverses and blockchain projects, this being a barrier to entry. They also state that they are capable of distributing content. The budget section however shows that most of the money would be spent on smart contract creation, NFT creation and marketplace implementation. I therefore perceive first of all a very unclear problem and solution definition, and I do not see at all any fit between the proposal and the challenge. ", "q0r": 2, "q1": "The only positive side to this proposal is the fact that there is an extensive presentation of the six member team, which at a quick glance have extensive experience in journalism, publishing, startups, development and technology. \n\nSadly there is little information about the timeline of the project - all that we know is that the project would take place in 2022. In terms of budget, as stated above, most of the funds would be channeled towards smart contract creation, NFT creation and marketplace implementation, without any additional breakdowns or explanations.", "q1r": 2, "q2": "The project would be measured  by the number of people engaging with the product IPs, which in my opinion is a very unusual item to be used in order to measure success in any field, without being complemented by other measures. Sadly again I am not able to offer constructive feedback because the solution definition is so vague that I would most likely offer out of scope advice anyway.  \n\nMy sincere recommendation for the team is to take a step back towards the drawing board and come back with another iteration that has a much more clear value proposition. ", "q2r": 2, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4606, "q0": "People of this generation have been showing interest towards video games by great margin , where video game players are continuously increasing day by day.\nWith provided contract the proposer has provided video games with the help of check point partnership where all the available games are free , free games are played by everyone , with these games the proposer wants to introduce NFT cards and maintain the rarity in cards , where gamers love to have rarest cards, and these cards can be used to exchange the ADA which definitely boosts the usage of ADA in the future. hence proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has great experience as Journalist and has watched video games community very closely, the proposer has even a great team to work with, where many are ceo and technologist , hence with provided team task can be completed smoothly without much difficulty.\nThe Check point games are already existing currently ,the proposer just needs to tie up with them and bring up his NFT cards into the games  which will complete most of his task ,so with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal contains all the details of the proposer and has mentioned all the people who are working on this project with their experience and expertise in their field.\nThe proposer has clearly mentioned about the importance of video gaming community in the current and future generation , and how to attract this community towards the projects of Block chain , The proposer has even mentioned about maintaining the rarity of NFT cards which will definitely interests the gamers to have the most unique cards, Proposer could have added time line in more detailed manner, but has provided great budget breaking idea, hence The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Reward users for engaging using a unique smart contract system \"engage to earn\" created by Checkpoint", "experience": "I've been a journalist for over 20 years and have come from a BBC and Guardian background - broadcast journalist (award winning) . My team are veterans in their relevant fields.\n\nI have been in the games industry for over 15 years and have an already established audience."}