{"id": 405044, "author": "cardano4climate", "title": "Community collaboration standards ", "url": "https://cardano.ideascale.com/a/dtd/405044-48088", "category": 26449, "amount": 35000, "description": "There are limited standards and tools for catalyst communities to operate and coordinate ", "funded": 2, "upvotes": 51769654, "downvotes": 14109687, "votes_result": 37659967, "votes_cast": 366, "f6_no_assessments": 4, "f6_rating": 4.916666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 307, "q0": "Although the proposal's composition quality is difficult to read beyond, careful evaluation reveals details that make this a very effective fit to the challenge brief.\n\nBecause the challenge brief describes outcomes surrounding open STANDARDS, and because the proposal does a poor job of focusing its plans around the proposed open standards, I have a strong intuition to DISAGREE with its effectiveness addressing the challenge.  However, poor proposal writing should not equate to wrong purpose.  Inspecting the proposal plan very carefully, we find buried within a bunch of general messaging, a couple of nuggets of gold: \"As you can see, there are many frameworks needed to be developed. For this proposal we will cover most areas ...\" and \"Over 10 processes, databases, recommendations and frameworks\".\n\nAlthough this latter item is a KPI mentioned in only one of the fields, and NOT mentioned in the \"auditability\" field of IdeaScale, it is nonetheless the key for me to this high rating assessment.\n\nOnce these details are acknowledged, the remainder of the proposal provides a rich, considered story of practical ongoing engagement with the community.   It leaves me with no question about the fitness of the proposal for this challenge.\n\nThe proposers are clearly having hearts in the right place and showing active, beneficial community involvement.  Their openness of spirit and dedication to collaborating openly for the benefit of all is unquestioned.  \n\nI would encourage proposers to be more succinct in directly addressing details of the challenge, with supporting material and story-telling in subordinate position in proposal text.  You're really making me work here!", "q0r": 5, "q1": "The proposal's Deliverables and KPIs are clearly phrased, specific, measurable and achievable.  \n\nThe proposers have consistently demonstrated commitment and openness, dedication to collaboration and cross-ecosystem connectivity.  The many details found in this proposal and its connected materials are supporting evidence in the direction of an expectation that the results are on-mission for the challenge category and impactful to community openness standards, and that we can expect to see the results that are promised.\n\nIt is not clear that the budget proposed is sufficiently supportive of these people to have security to do this good work, but I'm deducting points for this criticism. I hope that a in future funds, a better-drafted proposal will continue this financial support at a more deeply effective level for these people's activity, efforts and deliverable results.\n\n", "q1r": 5, "q2": "Given the large number and variety of community sessions proposed, and the KPIs mentioned in another part of the proposal, and the Github repo for open transparency of activities and results, it seems clear that this group's progress and practical results will be easy for everyone to see and evaluated.", "q2r": 5, "assessor": "z_assessor_1139", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2818, "q0": "proposer says there are very less standards and operating tools and coordination for catalyst community to work,\nThere must be A standard operating procedure (SOP) is a set of step-by-step instructions compiled by an organization to help workers carry out operations and ordinations,\nTo increase the purpose driven community to build and create SOPs , common standards, processes, and tools to increase synergies across projects. \nThe above  proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer experience as follows \nBeing working in Cardano4Climate is a community driven project, proactively participate in building the Cardano Ecosystem.\n\n...\nBy creating SOPs and common standards and processes that will incentivize project collaboration and sharing.\n..\nAs they are planning Coordination frameworks with other communities , Communication and info sharing , Build community tools is great start for future of Cardano,\n..\nWith minimal risk which can be solved by increasing staff so they can be available  for extended periods of time.  \nWith given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer has provided detailed roadmap,\nWith initial preparation 0-2 weeks selecting of team will be final,\nSurveying 2-6 weeks will be over,\n developing key frame work in  7-12 weeks,\nand deliverables after that which is impressive roadmap,\nBudget for initial 3 months is explained clearly,\nBudget plan for next 3 months also explained in detail,\nThey have great doable plan,\nFor Auditing \nthey will be providing weekly meet ups recorded video's, presence at Catalyst Townhalls recorded,\n Organize Monthly Event, Upload videos to YouTube and its analytic data,\nand many more extra activities recorded,\n The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1583", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"id": 9631, "q0": "This proposal sets out a clear problem and directly related to the needs of the challenge, as well as its solution which aims to build common standards, processes, and tools to increase synergies across projects. Its positive impact for the community is conscious and clearly articulated in a global way but also linked with the criteria of the challenge. The whole makes it easier to understand the added value of this project. As well as the KPIs which are voluntarily linked with those of the challenge which makes it easy to understand and an effort to consider. This proposal gives the necessary clues inducing its possibility to address future challenges. ", "q0r": 5, "q1": "Globaly this proposal is pleasantly complete. It is easy to identify the entire core team, more information is given on the functioning and philosophy of this community and all supported by evidence, multiple links, to attest to the commitment past and present of this group, as well as their multiple activities within the ecosystem. The budget is clear, it seems reasonable for the scope of the work to be done. The plan is well detailed and the different steps and tasks to be accomplished are well explained. The risks are addressed, with solutions to mitigate them. Really all of this information makes it possible to consider the success of the implementation of this project. ", "q1r": 5, "q2": "An effort of transparency is both claimed as an objective and ethic of the team but also proven by the detail of this proposal. The team use multiple way so that the community can attest to the evolution of this project and even to participate in it for those who wish. On Telegram, Discord, Twitter, YouTube, a public GitHub repository where all ongoing tasks and actions will be tracked regularly and provides for record weekly planning meetings and record issues and resolutions on it.\nThe roadmap is clear, the KPIs make sense and a long list of specific activities is stipulated by the team which allows everyone to be able to refer to it, both quantitatively and qualitatively with regard to the indices of success. \n", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10041, "q0": "Climate 4 change is an organisation that collaborates with cardano and other Catalys fund receivers. They wish to amalgamate the community and bring a better standard to help carious groups work together over the cardano space. \nAs more and more work and contribution is happening globally. A review of the existing processes and building better standards of work for collaboration / team building knowdge sharin and progress reporting is crutial. \nNot only the motivated members find it hard to fit it and receive information, but it is also difficult to track projects and follow the progress or learn from previous work. \n\nThe group wishes to run surverys self assessments and follow certain groups. And then help onboard other memebers to support iwhere ressources are lacking. \n\nIt is important to have a coordinator structure where all the multiple hands are working in sync and get the guidance that is needed. Many newcomers will feel the support and can then overcome a learning curve faster. ", "q0r": 4, "q1": "The organisation is a global community of 200+ members that will lead this project in 2 disctinct 3 month phases. \nEach phase will require 3 people that will follow 2 projects over that time with the support needed to coordinate the efforts and log the information needed. \n\nThe organization of this project and timeline are simply enough that any teamember can fulfill the needs for this project. ", "q1r": 5, "q2": "The assessments of the 2 seperate projects will be submitted from each group after 3 months. \nTherefore there should be a total of 4 assessment submitted in total after the closure of the project in 6 months. \nThe overall budget is mainly manhours related to the objective and direction during their coordinated effort in the project. I woudl expect there be some attendance and hour sheets to justify the time spent. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "A purpose driven community to build common standards, processes, and tools to increase synergies across projects. ", "experience": "Cardano4Climate is a community driven project which emerged itself through engagement in Project Catalyst. We proactively participate in building the Cardano Ecosystem and provide constant services to our Community. We are discovering best practices for community-building."}