{"id": 405158, "author": "matthiasksieber", "title": "Tenant Profile", "url": "https://cardano.ideascale.com/a/dtd/405158-48088", "category": 26449, "amount": 60000, "description": "Governments and nonprofits are not effectively solving the housing crisis. Tenants are more than their income.", "f6_no_assessments": 5, "f6_rating": 4.133333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer, which has previously had success on Catalyst for unrelated projects, has identified an intriguing underserved niche to tackle. Tenant matching isn't a glamorous solution to housing issues, but it addresses the reality of finding shelter for individuals living in poverty, particularly in areas with limited housing stock. With cities like San Francisco struggling to find homes for their homeless population, this could be a very timely project. \n\nOf course, the effectiveness of this solution will depend greatly on the quality of the information used to create the tenant profiles. Psychometrics is a slippery discipline. Loxe Inc.'s background in conflict mediation should go a long way in this regard, but if dating apps are any indication, the team may have their work cut out for them when it comes to effective matchmaking.", "q0r": 4, "q1": "I have little doubt that the experienced development team, three of whom have experience in a shared housing matchmaking project (AROYO), can deliver a tenant standard draft by September 2022. AROYO uses a 27-point questionnaire to build tenant profiles that can be used across agencies in the LA area. The survey queries applicants on subjects ranging from race, to mobility needs, to hobbies. This experience should transfer directly to this project. \n\nAs a minor gripe, I'd like to hear more about the bottlenecks the team encountered at AROYO, as I think this can provide voters a better sense of the project's potential impact. ", "q1r": 5, "q2": "The end deliverable, a specification of the tenant standard, should be easily audible upon completion. I believe the proposal's transparency could be improved, however, by presenting highlights from the June 2022 focus groups and general reactions from stakeholders in July 2022. We don't necessarily need to see every step of how the sausage is made, but community members may appreciate seeing the project's trajectory as it evolves.", "q2r": 4, "assessor": "z_assessor_1251", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Problem being Governments and nonprofits aren't able to resolve housing crisis efficiently and the rents are skyrocketing and tenants income aren't. The proposal is trying to solve it by having a standard that allows for compatibility matching between tenants and these tenants to housing units. Here the high rent issue is being resolved by sharing the rent between two or more tenants and housing crisis is being resolved by providing suitable housing units to rent. this tenant standard allows another related projects to be built on it which help add new project hence adding value to cardano ecosystem. The goals of the proposal somewhat align with the challenge not fully as there is need for another project to be built to resolve the issue and this tenant standard act as a base for others projects. The proposal can be scaled for future issues as this will help more projects to be built on it\nAfter the above observation this proposal does addresses the problem but not fully", "q0r": 4, "q1": "As per their proposal and after visiting their website provided in the proposal I was able to find that the proposer and their team are already working on wide range of projects which requires various skillset. Based on these observation the proposer and their team has required experience and skill to carry out this proposal. The proposal does contain a complete budget breakdown and the budget seems reasonable to achieve the set targets as there is requirement to hire Data Modeling Experts. The proposer has provided a clear timeline with goals to be reached which seems practical. The proposal does provide a sensible plan for implementation of the proposal. The proposer has taken in account of risks and challenges which is relevant to a successful implementation and have also suggested solution to address it. Considering above examination it is highly possible this proposal will be carried out successfully", "q1r": 5, "q2": "The proposal does consist of a step by step plan with a timeline this will be helpful to track the progress of the proposal. The timeline given is realistic and seems achievable. However the proposal doesn't consist of a key perform indicator which would have been helpful for auditing. The detailed budget breakdown would also be helpful to track the proposal development. The proposal does provide a clear understandable explanation to address the issue. with all these information it's safe to say the information given would be enough to track the progress of the proposal and also to measure the success of the proposal but if it had the required KPIs it would have made it easier for auditing", "q2r": 4, "assessor": "z_assessor_419", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is about creating an open standard of tenant profile. Their experience with large housing provider in Los Angeles, makes them able to explain why it is necessary to solve this problem. By creating an open standard for tenants profile, it would help with interoperability about tenants profile that can be used across related project. ", "q0r": 5, "q1": "The team behind this project is an already well established company with actual product and great team, Loxe Inc. The team profile is provided in detail with their experience information, and their LinkedIn profile are also included. This proposal able to provide a concise roadmap with deliverables or objective for each month. The budget breakdown, however, could be improved with providing detail for each role or category. For example, include the work hour with salary rate per hour, so it’s clear for the community to see how many hours is put into this project. Other than that, a concise and well written proposal.", "q1r": 4, "q2": "Roadmap is provided along with the goal and milestones. The KPIs description is also well provided. Overall, a simple, concise, and well written proposal regarding the auditability aspect. I thought the auditability section is rather too short, but it’s justifiable with what their project is about, that is creating a specification with open tenants profile standard.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This project presents a phenomenal idea that have a great potential to solve a real life problem and also enroll many people into the Cardano ecosystem. On the other hand, it seems that the project doesn't align with the challenge's goals. Note that the open standards according to this challenge are mainly for the Cardano projects or Crypto in general and have as a goal increasing collaboration and making a better picture to access projects. ", "q0r": 3, "q1": "The team is not alien to me and has worked on several projects before that I am familiar with. They have a good expertise in development and in the Cardano space specifically as well. The time frame seems to be not very specific but that is understandable due to the complexity of the solution. On the other hand, the budget seems to be on the high side, especially when seeing where the funds are directed towards. For instance, the budget for a data expert is 10k which is pretty high, but the team fails to showcase the importance of such an expert to the importance of the project and the possibility to reduce funds or maybe redirect them towards other ventures within the project.", "q1r": 4, "q2": "While the team claims to have some internal metrics and weekly development discussion. It would be hard for the community to access that, especially if no KPIs are presented. The dates as I said earlier are also lacking but that is understandable due to the complexity of the problem.", "q2r": 3, "assessor": "z_assessor_768", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The idea in this proposal is benefitting an important demography and in line with Cardano core values to deliver concrete impact to the real world. The concept is interesting and sound with final implementation that can be used widely and crossing different industry. Think if we can implement such profile specifications to credit score and deliver a novel perspective and advantage to the RealFi dimensions. I also appreciate the fact that proposer took time to explain the alignment of this proposal with the challenge it is trying to solve and I cannot agree more. Also, a plus point in the SDG aspect addressing sustainable cities and communities.", "q0r": 4, "q1": "Plan and timeline are detailed in appreciable clarity. The months are also mentioned in explicit way along with concise action plans that are reasonable, relevant, and key to the implementation of this proposal. The team of Loxe Inc. also bring excellent amount of experience and expertise that will prove valuable in the process of realizing the results in this proposal. No doubt with their knowledge and skill overall. It is also assuring that they had done related project called AROYO that spot the necessity and could use this kind of solution. The budget is also written efficiently although somehow I feel the cost is a bit more on the expensive side. Risks mentioned are also appreciated but the team has derived a way to address this issue so a bit more of conviction there.", "q1r": 4, "q2": "Due to Loxe Inc.  being a highly experienced member of Catalyst for few previous funds. I realized they are highly adept in professional way of doing works and developed a nice Agile/Scrum framework in terms of managing progression. The success is aligning well with the impact and challenge it is in. Metrics and KPIs could use a little bit of help such as mentioning how the specification standard can be used and how many interested parties are interested to utilize it. A big boost in confidence due to the result will be made open-source so anyone in community can actively participate building and verify the progress and result. Real-time updates can also be monitored in Loxe Inc. social media.", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "A standard that allows for compatibility matching between tenants, and tenant(s) to housing units.", "experience": "Loxe Inc. Experienced team with developers and designers that deployed a shared housing app in 2021."}