{"id": 396969, "author": "oliverross", "title": "Connect projects with developers", "url": "https://cardano.ideascale.com/a/dtd/396969-48088", "category": 26448, "amount": 39712, "description": "There is a perception its hard to find Cardano developers, this stops projects building on Cardano or migrating from EVM based chains.", "f6_no_assessments": 4, "f6_rating": 4.083333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 3542, "q0": "The number of projects being halted due to lack of knowledge in the programming aspect is large. It is very intimidating for non programmers to dive into the programming world not even figuring out which programmers will be able to do the job properly. \nThis proposition will allow projects that are on ethiruim to migrate into cardano platforms with programmers ready to help with the migration. For people with projects that are new it’s conceived that programming in cardano is though and this is where this project can come in handy providing contact with the programmers.  ", "q0r": 5, "q1": "The team working on the project is knowledgeable in the domain and the project proposed is very useful for people looking to migrate into the cardano platforms. Getting the correct programmers is essential for this projects success. Also the trust of people with existing etherium projects and people with new projects looking to program their projects with cardano is essential to the success of the project", "q1r": 4, "q2": "The auditing of this project is fairly simple the information provided is sufficient to be able to audit. The number of programmers and registered projects gives an indication about the success of the project.", "q2r": 5, "assessor": "z_assessor_1660", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6037, "q0": "While the proposer acknowledges a valid problem within our ecosystem and proposes an interesting solution that they are already developing, the proposal does not appear to be specifically geared towards addressing the challenges of \"The great migration (from Ethereum)\".\n \nThere is no doubt that his Professional Networking project can help, in general terms, to what this challenge proposes, but it is not an idea that specifically causes a migration of users from Ethereum to Cardano.\n", "q0r": 2, "q1": "The proposer attaches links and describes himself and his team as suitable to carry out this proposal (in fact, they are already doing it).\n \nIt shows that he has a clear idea of where he wants to go and how he wants to do it. To do this, he performs a well-balanced budget and a detailed timetable.\n \nThe proposer considers risks and responds to each of them in a good way.\n \nThis field is filled out in a professional and methodical way with all the requirements included, so no point should be subtracted in this category.\n", "q1r": 5, "q2": "Something similar happens in this field: the proposer describes his kpis and his milestones in a serious way. And they describe the problem and a solution\n(or a help) in a clear and understandable way. \n \nHowever, in this type of project, the promises should be about means and not about ends (since the number of Twitter followers and the number of people offering work on their platform do not depend exclusively on them, but on a multiplicity of factors) .\n \nWhat the proponents list works great for success metrics, but not for auditability metrics.\nBut since what is requested are parameters of success and not of auditability in this section, it would be unfair for me to lower them a point for this. So my score in this section is also the maximum.\n", "q2r": 5, "assessor": "z_assessor_32", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "thank you, re impact, I am of the belief that we do actually meet the criteria \"Projects who were either planning to or did launch on an EVM-based blockchain deploy in the Cardano ecosystem and can do so easily.\" \n\nIn terms of making it easier for these projects to launch or Cardano instead or to migrate across, at the moment its incredibly easy to get Eth devs but harder to find Cardano devs due to our ecosystem being relatively smaller.\n\nI feel like a 4/5 is more fair?"}, {"id": 9670, "q0": "The proposal focuses on a central forums for \"makers\" job posting for skilled individuals. I would agree that this proposal has alignment with the challenge in the respect that it allows skilled individuals to post skills, and their certification. It allows projects to head hunt individuals that may be wanting to build on Cardano. However, this is a double edged sword, individuals can also look for skilled people to build on other networks. So a migration from Ethereum to Cardano is not guaranteed by use of cardanomakers. The domain name definitely suggests exclusively to Cardano however. So hence i Agree with alignment overall.", "q0r": 4, "q1": "The team have already has experience with a version 1 and taken away from learnings. There is a reasonable amount of experience between the members, ranging from a Plutus dev to a a member in ICT and accountants. I can see a timeline posted with the amount of makers and employers by number each month. A little more detail about how to get these numbers would be nice. ", "q1r": 4, "q2": "The auditability is a little breif IMO, i think some more details in the way of website views, maker and employer profiles added in charts for the community to see would be of great help to see if the project (obtaining users) is going as planned.", "q2r": 3, "assessor": "z_assessor_750", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thanks! these are are some helpful points!"}, {"id": 9991, "q0": "Cardano Makers is proposing to offer a professional networking board that people, developpers, creative artists and investors can all connect together to match missing skillsets. \nThis will allow ETH Dapps and utility builders to bridge the differences in the cardano space. \nEthereum has a different programing language and many face difficulties to overcome this bridge despite the great benefits of building Dapps over the cardano space (less fees more secure etc..). \nCardano Makers aims to help raise awareness of growing talent pool in Cardano with NFT and skillset certification that will give confidence to any talent searchers to hire the right person for the job. \nI feel the impact of this project comes in two positive sides: \n1) The talent pool will grow and be motivated to publish their accomplishments and collaborate on multiple projects (sharing of experience over various teams). \n2) The Newcomers and creative minds can seek the missing talent or skill hurdles needed to get a first project up and running in a new space (cardano) rather than stick with the old methods and other blockchains. ", "q0r": 5, "q1": "The proposal has listed a few deliverables in terms of NFT and certification assigning to candidates. \nGrowing the candidate and job creator pools within their ecosystem\nHelping bridge any skillset gab by offereing the right person for a required job. \nThe website is up and running and this project is not startinf up from scratch. Therefore there is some momentum already in place. \nThe owners or tememebers of this idea are well versed and motivated to help the community deliver such services and want to suppor tthe developper cardano comunity. \n\nThe breakdown of the project timeline and budget is clear. With monthly targets of acquiring and growing the pool or jobs/candidates. \nHowever my rating involves the proposed plan milestones vs the budget allocation. \nMost of the budget allocation is going for programming hours and manhours for marketing and onboarding. \nHowever to better improve a website and succeed more time needs to be put for improving the UI / building more options / setting up skillset tests or certification. \n\nAlso As a final note the proposer is listed part of the budget the cost of running the website servers and hosting the website. As this is a completed segment there needs to be a business plan that can allow this segment of the budget to be funded from the activity and success of the project. Or else it will be a never ending stream of funding requests to keep this project alive. \n\nA solution needs to be in place to allow the project to stand on its own feet and succeed. Therefore I marked this proposal slightly lower for that reason. ", "q1r": 3, "q2": "Since this is a website that is public and has plans to publish NFT certifications for skillsets. I believe the first auditable point would be to observe the number of users and jobs posted. Then verify the process to obtain the NFT certification. \nAlso the team members citing that several public KPIs such as target job posting and candidate pools growth. \nFinally they have a twitter and other social media accounts to grow their comunity engagement. these are all points to audit and review. \nI would request a monthly report on the progress of the manhours spent for each category as this represents the majority of the budge , simply to show fiscal responsability. ", "q2r": 4, "assessor": "z_assessor_785", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Develop CardanoMakers to provide an easy to use Professional Network for projects to find and hire professionals from the Cardano ecosystem.", "experience": "My background is ICT managed services. Currently head of product at an MSP. I have experience in web design and made the Cardano Makers site. I have experience interviewing engineers / technical roles and the hurdles businesses face when trying to assess technical skillsets."}