{"id": 397805, "author": "murdocisgod", "title": "How did Sony take on Nintendo?!", "url": "https://cardano.ideascale.com/a/dtd/397805-48088", "category": 26448, "amount": 50000, "description": "Not being second fiddle to Eth. We need to learn from the the old videogame console wars from the past an make cardano the prime console.", "funded": 0, "upvotes": 17533687, "downvotes": 16170667, "votes_result": 1363020, "votes_cast": 131, "f6_no_assessments": 5, "f6_rating": 1.7333333333333332, "videos": [], "media": [], "f6_assessments": [{"id": 6209, "q0": "The elephant in the room in terms of Impact for this proposal is that the proposer has - unfortunately - not aligned the proposal with the correct challenge. The challenge [The Great Migration from Ethereum) specifically states that the problem statement to be addressed is \"How might we make it easy and fast for dApps and other projects to expand or completely move from Ethereum to Cardano?\" \nI think the proposer misunderstood the word migration as a synonym for attracting new users. The \"migration\" really means to bring over existing players from Ethereum and the proposed game has NOT been developed on Ethereum. \nThe proposer in this case is suggesting that he desires to build a high quality game on the blockchain to achieve mass adoption of Ada. This is a laudable intention, but the proposer does not have a dApp or other project that he wants to extend to Cardano (from Ethereum) or fully move from Ethereum to Cardano. \nSeveral commenters below the proposal on Ideascale have suggested that the Gamers Onchained challenge would be the best fit, alas the proposer did not move it. \nIn this case, the proposer views his game project as a catalyst for the great migration, stating that his proposed A list quality game \"would bring in more industry changing game development opportunities\". However, this is verbal semantics. \nBuilding one game directly on Cardano is likely to have a negligible impact on fostering The Great Migration from Ethereum. \nThe metrics for the challenge are: (i) Number of projects that migrate and (ii) Number of users of these smart contracts once migrated to the Cardano ecosystem. This proposal \"How did Sony take on Nintendo?!\" does not directly give answers to these metrics, instead it attempts to address them indirectly and with a very low likelihood of realization, in my assessment. My understanding is that the proposal - although a good fit for Gamers Onchained - does not fit well into this specific challenge category, hence the low score. \nI would advise the proposer to resubmit this proposal next Fund in a more appropriate category - Gamers Onchained, or if it is not present in Fund 9, then to the Miscellaneous challenge - depending on what Challenges are approved for Fund 9. The good thing is that the proposer does have a specific game concept and plan in mind. \n", "q0r": 2, "q1": "The proposer wants to build a  build an A list quality  3d fps/3rd person battle royale game on Cardano. THe proposal state that the intention is to  \"make an A list game on cardano on par with a big game development company\". This is a very high bar that has been set and the current funding that is requested is $50,000 that \" barely covers a year of development\"  in the words of the proposer. As far as can be seen, the project does not have the funding secured for the remaining two years - which is a definite risk, as the partially developed project will not achieve a Migration from Ethereum. I have not seen a realistic plan for securing the funding for the rest of the project - apart from seeking a continuation of a \"previously funded project in Catalyst.\" The budget for this first stage is outlined and broken down into identifiable items. The proposer could have improved his chances with voters by submitting proof of his relevant skills and experience - especially as the stated goal of making an A list game on Cardano on par with a big game development company - has never been done before, not even by a big game company.\n", "q1r": 2, "q2": "In a proposal for a game, I would have expected to find a detailed breakdown of the essence of the game and its uniqueness, but the proposal mostly includes a general categorization of the game \"a 3d fps/3rd persson battle royale\" with \"Blockchain gamefi features such as play to earn\". However, the devil is in the details. I mention this as there is not enough information provided to be able to audit the success of the proposal - in terms of expected game quality, game storyline, artistic ambitions, musical score. Apart from this, some hard coded milestones are required - but the proposal contains a spec of a schedule with the first deadline coming up in November of an unspecified year: Late November ‘20xx... THe proposer suggest that a more detailed roadmap in the vein of Cardano's technical and formal methodology would have to be established.... However, I view this as insufficient as the proposal should already contain a detailed roadmap with specific KPIs and milestones. Some components of the plan are very general: \" Announce that [NAME OF GAME] is under development\"  or \"Begin Cardano, Plutus, Marlowe/ basic research\" ...  \"Research trip or more research\" etc... The proposal as it currently stands looks more like a concept that could serve for creating an implementation proposal with hard dates and hard deliverables. I would advise the proposer to go back to the drawing board and try to develop a very air-tight plan, if the proposal is not accepted this time around. As it stands now, it is very hard to audit. The problem statement is not well expressed in my view (\"Not being second fiddle to Eth. We need to learn from the the old videogame console wars from the past an make cardano the prime console.\") the offered solution to the problem statement seems tangential (\"Sony rose to the top with good hardware and software. I want to build a high quality game on the blockchain to achieve mass adoption of Ada.\") Hence I would advise the proposer, if he does not get funded, to focus the problem and solution on the game and to try to improve the prospects of the project by preparing a detailed plan for funding the entire game, so that the entire vision is visible from the start. ", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1504, "q0": "This proposal is submitted in the \"The Great Migration (from Ethereum)\"-challenge, however it is not possible to see a clear connection between the campaign brief and this proposal. In other words, they don't align very well. A suggestion would be to re-submit this proposal in the next fund in the \"Gamers on-chained\" challenge, since it seems to align well with that Campaign's brief. The proposer has a good idea and it would be considered quiet impactful in the right challenge but this proposal has to be assessed from the ruleset in its given challenge. Unfortunately it does not align well and it will receive a low score in terms of impact. Score given: 1 star. ", "q0r": 1, "q1": "The budget outlined is detailed and but has a weird wording with the \"‘20xx\"-format. It is hard to understand the real timeline because of this and it should be clarified. The budget is reasonable given the scope. No score will be deducted because of this but the proposal could use a lot of reformatting in the feasibility section since it is hard to read and hard to get an overall picture in its current state. There seems be a lot of hiring to be done (no position is filled), this is a risk since there is a lot of job to be done and finding the right talent can be hard. No further evidence of the proposers experience can be verified, it would be credible if something could be included to further verify their experience. Overall, it seems like the proposer has to start a real game studio in order to make bring this project to completion. That is a great task that many have failed before, given the scope and current information available in the proposal it is hard to expect the proposal to be feasible. The resulting score will be 2 stars.", "q1r": 2, "q2": "The proposer should add relevant KPI's to the audit section. It is easy to find relevant KPI's for a game and they should look at other successful proposals for inspiration but to give an example it could be:\n x1 number of players after y1 months,  x2 number of players after y2 months etc.\nAlso, the proposal fails to answer how the community can audit the projects progress during development. And it also does not mention how progress will be measured. These things should be addressed before submitting the proposal in an upcoming fund. For now, the score given in terms of auditability is 1 star.", "q2r": 1, "assessor": "z_assessor_139", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6039, "q0": "The proposer does not identify a clear problem within the challenge, nor does he elaborate a satisfactory solution. Because this challenge is specifically designed to attract Ethereum users to Cardano, and the proposer does not refer to this but to the development of a game, something that would be better framed in the \"Gamers On-Chained\" challenge.\n \nIt is true that a good game could attract many users to our ecosystem (including some from Ethereum), but that is not the spirit of this challenge in which the proposals have to be directly focused on the migration of users from Ethereum to Cardano.\n", "q0r": 1, "q1": "The proposer does not describe himself as the ideal candidate to carry out a company of such magnitude, nor does he provide links that certify his knowledge.\n \nThe budget is outlined in detail, but it has a very important problem: The funds that the proposer requests would serve to cover only one month of work. And at no time does the proposer refer to where he would obtain the funds for the next eleven months necessary to continue the development of his project.\n \nHis timetable is not clearly or rigorously proportioned.\n \nThe most important problem of this project in this field is that the proposer never speaks or shows us what the game he wants to do is like. He only mentions a type of game, but not a specific game.\n \nWhat I like about this field of the proposal is that the proposer seems to know clearly about the team members needed to carry out his project.\n", "q1r": 2, "q2": "The proposer does not mention his kpis or the milestones of his project, which makes the auditability of this project unfeasible.\n\nThese two requirements are essential when creating any serious project, since without them, the community is unable to properly audit that the ada that is given is being used in productive ways for the ecosystem.\n", "q2r": 1, "assessor": "z_assessor_32", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6246, "q0": "I believe this would belong in the Gamers On-Chained category, and does not address users migrating from existing chains to Cardano.", "q0r": 2, "q1": "The screenshots attached, and text, for sure show a developer well on their way toward being a good game developer--but is still on that road and has not, perhaps, arrived yet. Given the lack of focus in the proposal: I am concerned about the lack of focus in deliverables. This could also be a documentary or film initiative, but not sure about the project in its current form.", "q1r": 3, "q2": "The proposal is a good framework for future expansion. It is a good skeleton to use once a project is more firm, more KPIs and metrics are set, and focus applied. The framework is indeed a good one, but is a framework needing some direction and content. If this is a research project: then what is the end result? A game, a game design document, etc. I know it says \"name of game announced,\" so am thinking ultimately this would be a game...so, why not in a better category for it? This would make a fairly good YouTube series I would think!", "q2r": 2, "assessor": "z_assessor_363", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8199, "q0": "\nProposer states that he will build 3d fps / 3rd person battle royal game on Cardano. This is a great idea but not intended for this challenge. Such ideas would be good to apply in Gamers on Chained. It is necessary to elaborate in more detail how this idea will add value to the Cardano ecosystem. KPIs are not presented, the proposal is not in align with challenge settings and it is not able to scale to address future challenges.\n", "q0r": 2, "q1": "\nThe community needs proof of the knowledge and experience necessary to realize an idea. It would be good to post links via LinkedIn or GitHub to have the information on who is behind this project. The budget is unrealistically presented. There is a lack of a clear plan for how this idea will turn into a project and within what time frames and how it will be realized. It would be good to have covered possible risks.\n", "q1r": 2, "q2": "Proposer in his idea does not have an elaborated roadmap with milestones and KPIs are completely omitted. It would be great if the people behind this idea joined the weekly Town Hall because at such gatherings they would surely get a lot of information that would help them in future stories.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Sony rose to the top with good hardware and software. I want to build a high quality game on the blockchain to achieve mass adoption of Ada.", "experience": "An avid Cardano and game enthusiast. With experience in production, design, and programming. A problem solver that thinks outside the box. In this specific case: user acquisition. Me securing funding would allow me to work on this full time."}