{"id": 398579, "author": "lennext", "title": "Bring Bored Apes* to Cardano", "url": "https://cardano.ideascale.com/a/dtd/398579-48088", "category": 26448, "amount": 75000, "description": "Die-hard Cardano investors have no access to high-value EVM NFTs such as CryptoPunks or BAYC unless using the Ethereum network.", "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "On first read, the described project does technically address the brief - bring Bored Apes*  (what does * mean??) to Cardano.    However, this challenge brief is looking for projects to be migrated to Cardano to escape gas-fee problems on Ethereum.  It's a tough call, but I'm downgrading by one star for this consideration.", "q0r": 4, "q1": "The size of the proposal text and many details do strongly suggest that the writers of the proposal have a plan that will be executable.\n\nBecause there are no explicit links to any references about the proposers, I'm not able to feel strongly in agreement with the success being \"highly likely\".", "q1r": 4, "q2": "The auditability of progress and success on this is less granular than I'd prefer, depending quite strongly on essential progress-reporting.  My sense of agreement here is more like a 3 than a 4.  I'd give it a 3.5 if I could.  ", "q2r": 4, "assessor": "z_assessor_1139", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is right on target as it relates to the challenge at hand, and presents a creative way to expand utility and collaboration among the cardano ecosystem while solving cross-chain limitations that exist in the booming NFT market.  To compare with existing platforms in the physical art world, Masterworks has already become a popular domain for fractionalized ownership of paintings.  And as the NFT industry expands, this proposal presents a modern solution that will add value by promoting liquidity to collectors through a distributed ownership model.", "q0r": 5, "q1": "The proposal appears to address most of the core elements that would be required for successful delivery. \n\nWhile I lack the technical capability to evaluate the development complexity of this kind of project, my experience hiring UI/UX teams helps me understand that the budget requested is a reasonable reflection of the timeline/manpower/workload presented, especially since project initiation was self-funded by the team, and it the team has also articulated a plan to continue later phases beyond the immediate scope of work (i.e. self-funding or externally funded).\n\nI believe one major hurdle for a successful implementation of this project will be designing a governance system that both supports the complex world of fractionalized ownership and is easy/fun to use.  The proposal may benefit from including more details about how such a governance system would operate, at least as a framework or with references to how other existing platforms have tackled this.", "q1r": 4, "q2": "With an organized roadmap, implementation of task scheduling tools, and a detailed vision for short/long-term success, the proposer has presented a clear basis for measuring achievements as they are relevant to this proposal.\n\nThe proposers have also detailed their history of involvement in Catalyst community contributions, long-term holding positions, and participation in a number of other proposals (both successful and unsuccessful).  I believe this history of active involvement positions the team as clear stakeholders in the cardano ecosystem, having long-term goals with clear benefit from successful delivery of this/other proposals.", "q2r": 5, "assessor": "z_assessor_1224", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Bring Bored Apes*to Cardano proposal addresses the Great Migration Challenge by providing Cardano investors with the access to high value EVM NFTs. The proposal states that they could invest in the high value \"investment grade\" by purchasing \"tradeable fractions\" of those desirable NFT. The investment grade classification has no factual evidence provided by the team. It is subjective to classify ones based solely on the market value (high tradeable value of NFTs doesn't make it investment grade). Although the team has mentioned the legal issue that there is no actual regulatory initiatives and it is the matter of speculation, they underestimate the importance of regulatory especially in the investment area. It could bring the entire operation that are deemed risky for investors into a halt. The project will improve more if they would reconsider if the fractional ownership is the way to go. The NFT market is often claimed to be overhyped and its value fluctuate widely based on market sentiment. By putting out products (fractional ownership that derives the value from underlying asset where the underlying asset (NFTs) is volatile could creates the high risk asset class that calls regulatory body's attention to put the control in the early stage of NFT market. The proposal also makes a strong assumption that their \"ShareHodler\" solution will be well received by the Cardano community who do not have capital available to purchase complete NFTs. There is no public survey or any concrete evidence to show that given the choices between the NFTs they could afford VS. the fractional ownership in these high value NFTs, they would prefer the latter. For the aboved reasons, I could not come to terms with the impact of this proposal that would satisfy the challenge brief of moving dapps or project from ETH to Cardano.", "q0r": 2, "q1": "The project's budget in phase 2 running 17 weeks with the burn rate of $3000 per week and phase 3 running 4 weeks with the burn rate of $6000 per week have no figures that would show how many hours they will put on this project provided the high burn rate $51000 and $24,000 for these 2 phases. \nFrom combining the total length of this project (Phase 2-4) the project will take at least 41 weeks (10 months) before completion with the high burn rate in phase 2 and phase 3 and consume $75000 in the space of 10 months. The team is not transparent in addressing the team members behind this project. The proposer team hasn't provided the name of team leads nor team members. There is no profile link or reference to back up their creditability in technical, tokenomics, business etc. Provided the questionable budget and team behind this project, it is quite unlikely that the project has the potential to progress until completion.", "q1r": 2, "q2": "They will report project progress via Growwheel.net and have attached the layout in this proposal. I am satisfied with the team having the concrete approach to report progress. However, I find one of their defined long term success questionable and raises doubt on their understanding about the NFT market. The team state that the success they see is the \"private art galleries will use their sharehodler platform\" and the \"expansion of CNFTs from digital arts to physical objects, even commodities.\" The private galleries are normally owned and run by the passionate group of artists. They themselves are the art curators. To imagine that the curators will be using the platform developed by another group of art curators making me questions whether the team or the individual proposer do really understand the art market. Also for the second statement it is unattainable and impossible that the CNFT (which is non-fungible token) as the value attached to it is unique can be made into commodities (which is fungible as each item is not unique and standardized.) For this reason, it is impossible to really audit the project as their definition of success are based on their own presumption but not on the fact/reality of how the art market and NFT market really work. ", "q2r": 3, "assessor": "z_assessor_1351", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1, "reply": "This CA states its IMPACT rating is based on three issues. 1. Its understanding of the definition of the term \"investment grade.\" 2. A presumption of the proposers understanding of regulatory risk. 3. The appropriateness of funding a proposal based on fractionalisation. 1. The CA rating focuses on (unimportant and unrelated) debate over the meaning of adjectives. Specifically its own inability to understand the term \"investment grade,\" while understanding high value. Actually high value is enough of a descriptor of the NFT's, easily understood.  A debate that has little to do with the IMPACT of the project.\n2. The CA acknowledges that the proposal addresses regulatory environment  (with respect to NFT's), as yet to be decided. Actually that is a risk to every cryptocurrency project related to NFT's -  a known, unknown risk for all projects.  It presumes to know what is in the propoinng team's minds about regulatory risk. Without anyway possible way of knowing what is in someone else's mind. 3. The CA expresses the opinion that fractionalized ownership is a technology unworthy of funding. We note that dcSpark has been funded for one project - specifically to create tech to fractionalize NFT's (Fracada), and requesting funds for other projects based on Fractionalizing NFTs. If the community voted that those projects were high enough impact to be funded, then the impact of this project (and many other proposals in fund 8) can not be downgraded because it/they involve fractionalised ownership of NFT's. AUDITABILITY - The CA justifies their rating on issues not related to the rating factor.  1.  They say: \"However, I find one of their defined long term success questionable and raises doubt on their understanding about the NFT market.\" They again presume to know the proposers thoughts, and express doubts about the NFT markets as reasons to downgrade a rating of this proposal. The CA also debates a potential use case with erroneous information, which does not relate to auditability. stating: 'The private galleries are normally owned and run by the passionate group of artists. They themselves are the art curators. To imagine that the curators will be using the platform developed by another group of art curators making me questions whether the team or the individual proposer do really understand the art market. \" That assertion - has nothing to do with auditability and is factually incorrect. Private art galleries are predominantly owned by Gallerists. Private businesses. Independent of artists. Those galleries owned by groups of artists (there are some, but not the dominant %) could just as well use a white label fractionalized MFT market place as privately owned galleries. nothing in the CA justification relates to auditability. FEASIBILITY - Bottom line the CA bases a low rating on \"burn rates\" ($3000 a week for initial period and $6,000 per week for auditing and development period), as being too low. And stating we have not given breakdowns into hours worked. That is one way of budgeting. But it is neither the only way of estimating costs. Nor is it a requirement of Cataylst funding to do so. The CA criticizes our budgets based on 41 weeks (combining the 21 week funded phases 1,2,3 with our description of a \"post funded\" Phase 4 - for which we offered funding by fund 9 or other sources. In fact we also did breakdown costs into deliverables. We estimated audit and testing to audit issues at a level comparable to that used by dcSpark in their estimate of costs predicted for auditing Fracada -another fractionalised NFT protocol. In fact we also expressed intention to use Fracada open source code if possible. Finally without justification (or defining what \"potential\" means) they make an unfounded statement: \" it is quite unlikely that the project has the potential to progress until completion.\" The CA gives no indication of having owned a business, managed and delivered a start-up project, or has any experience in IT development, having any experience in art or NFT markets. Raising serious doubts on the validity of their ratings -as a guide for voters were this assessment not excluded - based on opinions expressed."}, {"q0": "The proposal specifically addresses the challenge of wrapping ETH based NFT in a manner that enables integration with the Cardano blockchain. The NFT field is the most visible manifestation of blockchain outside of Bitcoin cryptocurrency. This project is a worthwhile endeavour and has value beyond the specific art use cases cited", "q0r": 5, "q1": "The team is an experienced proposing team with successful projects under its belt. The team has self funded the project and appears committed to completing the project with or without Catalyst funding. Success is likely given the history, plan, and determination.", "q1r": 5, "q2": "They are using a Danish Web based progress management system. In addition they have modularized the project in making three submissions in Catalyst Fund 8. Given the new Catalyst reporting requirements and the team's individual approach to project management and reporting, the auditability requirements are most certainly assured.", "q2r": 5, "assessor": "z_assessor_660", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The proposers detail out a plan to bring EVM NFT projects to the Cardano ecosystem and allow them to be fractionalized. As an example they mention bringing Bored Apes NFT community to the ecosystem. This functionality would provide a new use case within the Cardano ecosystem and as such could produce a large impact for certain NFT projects that migrate to the Cardano ecosystem. The proposal offers a new way to bring existing assets from EVM blockchains into the Cardano ecosystem which will increase the opportunity for those events to happen which helps highlight that the proposal is aligned with the challenge brief", "q0r": 5, "q1": "The proposal team have had a number of funded proposals in previous rounds and mention a desire to be part of the Milkomeda accelerator if they are accepted. A detailed plan is given for the different phases and steps to complete the proposal with some rough weekly date estimates for when it could be completed. Risks for the project are very well described and covered. The proposers did not provide any links to Github repositories or their professional profiles such as LinkedIn to give further confidence that they are able to execute the proposal. In future proposals it would be great to see more information just to verify the team is fully capable of executing the proposal - some indication has been given with the information provided and collaboration however more sources would provide better evidence for a high chance of feasibility", "q1r": 4, "q2": "A roadmap of phases with each deliverable is provided. In the attachments there is a breakdown of the hours and labour costs to justify the budget. The KPIs focus on the deliverables of the project and mention 'High value NFT' market using this proposals execution as a core focus point. It would have been good for the proposers to mention which projects fit into this category to understand what the addressable market would be and then the comparisons of what penetration of that market would make this a good return on investment for the community. The KPIs against the roadmap seem achievable and the proposal offers plenty of clarity behind their intentions and show a good understanding of the market.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "A multi-chain web3 platform giving ADA hodlers the scope to trade shares of investment-grade EVM NFT assets directly on the Cardano network.", "experience": "Team includes: Senior Information Security Systems Officer w/ Cyber Warfare Technology and techniques.\nActive traders - all currencies since 2015. MSc Blockchain. Active Catalyst member since 2019. 30 years small and medium business owner, previous 2 Catalyst funded projects."}