{"id": 398919, "author": "brerrabbit3", "title": "Scaling CNFTs, minus the ETH mess", "url": "https://cardano.ideascale.com/a/dtd/398919-48088", "category": 26448, "amount": 104500, "description": "Ethereum's NFT ecosystem is struggling from a lack of trust, but Cardano lacks a scalable way to earn the trust of NFT market participants.", "f6_no_assessments": 7, "f6_rating": 4.761904761904762, "videos": [], "media": [], "f6_assessments": [{"id": 1726, "q0": "Eth's NFT ecosystem is becoming increasingly chaotic, due to plagiarism fraud. The proposed team came up with the idea of building an AI/ML-based protocol to protect Cardano NFT from plagiarism. Provides the protocol and marketing for converting Eth artists to Cardano. The team will deploy VeraNFT to promote Eth artists to Cardano. In that, it will be beneficial when some highly skilled artists, they have a large number of small projects, and a large audience are watching them come to Cardano. Cardano NFT growth and development. The group has closely described and specific solutions, impacting the challenge. In addition, the team considered the risks and had solutions to minimize any possible risks when implementing the project.", "q0r": 5, "q1": "The proposal provides a clear plan, detailed roadmap for each work, in each important milestone, during the period from February to November of the entire project. The budget asked for $104,500 and was explained in depth, in detail in each period, the work to be done. Increase transparency and credibility for the project. In addition, the team provided sufficient information demonstrating that the experience and skills of the core team members are appropriate and necessary to perform the assigned work on the project.", "q1r": 5, "q2": "The proposal provides a project implementation plan with clear milestones and tasks. Good, specific performance metrics that easily measure project progress and success. The budget is presented in a coherent and reasonable manner with sufficient audit information. The proposal is completely new, however from the planning board it has been shown that the positive, to achieve the group's goals.", "q2r": 5, "assessor": "z_assessor_1409", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "A thorough, detailed, and (I think) very reasonable assessment. Thank you for not only taking the time to understand the solution we’re trying to provide and its potential benefits to the CNFT ecosystem, but for your careful reading and clear articulation of the key points of our proposal. "}, {"id": 4083, "q0": "This project aims to earn the trust of NFT market participants by building an AI/ML-driven protocol to protect Cardano NFTs from plagiarism, and offer it as part of a marketing campaign to migrate Eth artists.\nThe problem being stated here is real, and building trust in developers and users is a crucial thing for an ecosystem. The proposer has come up with a can not be clearer list of reasons why it is a problem and through that we can all see how important it is and why they are doing what they are doing in this proposal. Not only is it an idea, the team actually started building a foundation for this project, we can all see what they have done so far and I can say that it will have a huge impact on Cardano. By building the Challenge KPI, the team has shown that they have a clear solution for this challenge, they know exactly where they are hading with a specific target. All the challenge KPIs like  number of projects that migrate, number of users of these smart contracts once migrated to the Cardano ecosystem are the real checklist for the outcome of their work and they completely align with the objectives of this challenge. The risks are recognized and taken into consideration with a real respect. And they’re not only on the paper but the proposers have actually started to work on the solutions for that. I have no doubt when saying that this proposal completely aligns with our challenge. ", "q0r": 5, "q1": "The team has all the required skills in order to make this project a reality, they have provided Linkedin profiles as reference. The proposal is very clearly broken down into workable segments with what seems like appropriate timeframes for completion of each segment. The budget breakdown can show how the money will be spent and appears to be reasonable and realistic to accomplish the stated goal. Most importantly, the budget breakdown follow closely with the roadmap and it’s almost effortless to give the requested amount the fairest justification. ", "q1r": 5, "q2": "The team gives comprehensive details regarding auditability with all the key metrics and KPIs and they are all time-related. This proposal is completely “audit friendly” as they have laid out time lines for portion of each segment  of work from every possible aspect. This will allow the auditors to hold the team accountable for each process of the proposal.", "q2r": 5, "assessor": "z_assessor_1703", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "A thorough, detailed, and (I think) very reasonable assessment. Thank you for not only taking the time to understand the solution we’re trying to provide and its potential benefits to the CNFT ecosystem, but for your careful reading and articulating the specifics of our proposal. "}, {"id": 4114, "q0": "Plagiarism is causing a lack of trust in Ethereum's NFT ecosystem and making it difficult to attract more people to join the community. To solve this problem, the proposal team came up with the idea of creating a protocol to protect Cardano. I completely agree with the propositions of the proposers and support the project of the group.\nThe proposal elaborated on the issue under consideration. The problem is analyzed in detail with specific examples and found that the Cardano ecosystem needs to have areas for improvement. This provides insight into the negative impact of the issue on the community.\nThe functions that make up the product have been mentioned in the proposal. These features are described in detail, showing the impact that the project brings to the potential audience in particular and the Cardano ecosystem community in general. The Solution section that the proposal provides is very detailed and explains the technical aspects in-depth.\nThe KPIs proposed by the project is completely consistent with the Key metrics of the challenge. Each KPI stage is described in great detail and presented separately for easy tracking and grasping.\nThe team has researched and identified 3 main risks that are likely to occur during project implementation. For each risk problem, the proposers also offer appropriate solutions to minimize the impact of these risks on the project implementation process.", "q0r": 5, "q1": "The roadmap is divided by proposers by month in a reasonable way. The project has a realistic timeline for completing the given tasks in a logical manner. The community can rely on this roadmap to track project progress. However, if possible, talk in more detail about the technical and technological aspects required to carry out the project. The proposal must show a reasonable plan not only in terms of what they will accomplish but also how it needs to be. This information will help the proposal be more appreciated.\nThe total budget of $104,500 is divided among the items to be spent. This budget plan is generally quite reasonable with the proposed plan. Clearly broken and bulleted budgets are used for project implementation activities. The community can easily evaluate the project's goals.\nGiovanni and Anthony are two people on the project management and operation team. With the professional knowledge and practical experience that the proposal has provided, the project led by them promises to bring positive impacts and will be completed according to the given plan. The profiles of the two managers will also create community trust for the project.", "q1r": 4, "q2": "Quantitative indicators showing the success of the project are provided very specific and clear. These indicators clearly show the agreement with the key metrics set by the Challenge. This proves that the team has seriously set goals for the project. The community can regularly check, monitor and evaluate the success of the project based on these indicators. The criteria to evaluate the success of the project are shown very clearly in the proposal. That is the outcome of the project. The team has planned in detail and seriously pursued the goals that the project has set.", "q2r": 5, "assessor": "z_assessor_1709", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "A thorough, detailed, and (I think) very reasonable assessment. Thank you for not only taking the time to understand the solution we’re trying to provide and its potential benefits to the CNFT ecosystem, but for your careful reading and articulating the specifics of our proposal, as well as how it addresses the KPIs of this challenge category.\n\nWhile we do believe our successful completion of the project is very feasible, and something we're 100% committed to, we do wish we'd had our landing page and supporting team members already identified for the project prior to the assessment of proposals, so we understand a less-than-perfect rating on our Feasibility rating. "}, {"id": 6430, "q0": "I'm sure the person/team who proposed The Great Migration challenge were thinking about ETH tokens when submitting it and I'm glad they included 'Number of users of these smart contracts once migrated to the Cardano ecosystem' in their KPIs because from this point of view, this proposal clearly satisfies this requirement. What sets this proposal apart from others and thereby unique is the utilisation of key principles of Cardano in encouraging others to move over, not as token projects but as creative individuals & their followers who may want to seek a better ecosystem. This is a very novel way of looking at things and as the proposer described, was bourne out of a real-life necessity. The proposer intelligently locked on Cardano's key characteristics of security, low transaction fees and their promise of better authentication and validation which is critical to every artist. It reads very compellingly. Granted there are so many aspects that could occur in the industry that could dampen their solution's impact (competitor, etc) but the NFT space is large enough for a few solutions and it will grow larger still. I completely agree that despite not using a 'converter' this proposal effectively addresses the challenge. The only improvement I could suggest is the possible mention of their AI/ML solution being applicable to other NFTs besides visual art. We're now seeing a proliferation of vids, animation, music, real estate, etc but I'm sure if this version 1.0 proceeds to completion, it would be an area this team can focus on.", "q0r": 5, "q1": "The proposal and the solution are very clearly described and the team behind this project presents their aligned credentials and even provided links to their profiles. The fact they are active contributors to the Cardano ecosystem lends confidence in their commitment and dedication. Their month-by-month plan is clearly described and the fact their goals for Feb & March had been achieved already indicates the rest of their plan is realistic and are in line with their capabilities. As a former assessor of tenders for a university, these are highlights in a proposal that makes recommending a team easy. Achieving their work goals for the last two months also gives confidence that the budget described is on point. It is also an added bonus that they described the results of the proof of concept as it paints a picture of the chances for success which is high. I have no doubt this team will succeed in building the AI/ML to the desired standard and I can see the main challenge is the encouragement of artists to move across to Cardano and for that, I wish them luck. ", "q1r": 5, "q2": "There's a lot of details on this proposal that can act as audit points and its commendable they included internal politics as part of the risks/mitigation points as these are realistic aspects of any project that asks for more than USD$100k. The KPIs presented are in keeping with their goals and could be easily published to the community after each achievement. Where this proposal could have improved and gained a five-star rating is with the publication of social channels or code repo where readers can easily follow the project whilst reading it. I've read the proposal more than three times to make sure I didn't miss these details but sure enough, other than linkedin urls and news articles, there were no social channels included. It is recognised that the VeraNFT site is part of the build and would not be available until months later but at least securing this domain would have added to the bona fides of this proposal. As it is, readers are asked to trust the information as presented and whilst I strongly believe in this proposal and its goals and credentials,  providing channels to ensure the leap of faith the voter is asked to make is not too far, will always be an advantage. Should this proposal miss out in this funding round, I recommend to provide those channels so supporters can cheer on whilst the project is on-going. Good luck.", "q2r": 4, "assessor": "z_assessor_42", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "A thorough, detailed, and overall, very reasonable assessment. Thank you for not only taking the time to understand the solution we’re trying to provide and its potential benefits to the CNFT ecosystem, but for your careful reading and articulating the specifics of our proposal. \n\nWhile I do believe we've included a good amount of detail to support the auditability of the project, the point about social accounts is well-taken. As of yet, we're still working out details of the branding for the project, and until now have been pretty private about development progress, etc., because we wanted to be assured of the project's feasibility and our approach to it, so our Discord only has a few key members and we haven't yet created socials and will be publishing our landing page shortly. That said, as soon as we get things going on that front, I'll be posting all socials links, etc., in the comments section of our proposal."}, {"id": 7928, "q0": "As someone who has also participated in NFT trading, your idea is a big inspiration to me.\nI also noticed a lack of security due to the underlying structure of ETH. Most notably, hackers stole more than $4 million from collectors' wallets on the Opensea.io platform - ETH's leading NFT marketplace.\nOn cardano, although security is better, there is no tool to verify artwork is real or plagiarized. Therefore, it may not be convincing to many artists when they want to protect their copyright.\nSo a proposal to verify artwork using artificial intelligence (AI) and machine learning (ML) for image recognition and NFT metadata is now much needed for our cNFT market.", "q0r": 5, "q1": "The team's work plan and goals are detailed in 9 months convincingly. Moderate budget. The team of programmers has many years of experience and has carefully studied the pros and cons of both the ETH and Cardano platforms. These are the factors that convince me that this proposal is serious and worthy of funding.\nIn addition, you can add media channels or official website to update the project progress and receive more support from the community. It is also an effective way of reporting work.", "q1r": 5, "q2": "This is a small number of projects that give the target numbers to be achieved according to the project schedule. Goals such as: time to release the first beta of VeraNFT, website (B2C), target number of NFTs eliminated in the market, B2C NFT history, number of clients served, VeraNFT landing page visits...\nThis gives me a good visualization of the project progress and can check the team's progress.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the succinct but well-reasoned assessment, and for taking the time to understand the solution we’re trying to provide and its potential benefits to the CNFT ecosystem and bring more users to Cardano. "}, {"id": 9673, "q0": "This proposal suits the challenge by offering VeraNFT a AI/ML engine to check authenticity of NFTs across markets places. The idea is to migrate NFT collections and makers from Ethereum to Cardano using their service.", "q0r": 5, "q1": "The proposal outliens a timeline and it looks like work has already been started and completed to date. I cannot see a link to a github or some sort of website to verify that this work is being done however. The CTO Giovanni looks to have a decent amount of industry experience and is the foudner of Stake Labs. Anthony suggests a web3 business developemnt from his Linkedin profiles coming from a Realestate background, I would like to know a bit more about what experience he brings. But overall the structure of the timeline looks fairly well thought out. ", "q1r": 4, "q2": "The proposal outlines a metric in terms of leads acquired and a twitter following. They propose a \"Profolio Protection incentive program\" and approximately $4100 in onboarding and social media, which seems a littel low imo. So, i would guess that allot of the budget is going to building the product ($72K for backend engineer) from the ~$105 requested. I would like to see a little more forward facing (community accessible) metrics from the onboarding program.", "q2r": 3, "assessor": "z_assessor_750", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Thank you for the thoughtful assessment. My one point of contention is that I believe the metrics and budget we provided are quite specific and very auditable. I've managed social media campaigns before, and in this case I was able to identify a seemingly very competent social media coordinator who focuses on cryptocurrencies and emerging technologies, and charges $40/hr. This means that following a 1 - 2 hours of strategy implementation with a (more expensive) social media manager, we'll still have close to a full week of work (or rather 1/8 of a week of work, for eight weeks). I've also budgeted $5k for my project management efforts, and some of that time will be spent assisting the social media coordinator and the CNFT artist liaison. \n\nI do realize a lot of money is being asked for and allocated to back-end development of the project, but this is a highly technical solution our lead dev will be working on full-time for 9 months, with the help of an additional data scientist/back-end developer working on the project part-time. That said, based on the sheer amount of work needed by these devs to get this platform to be a high-assurance product artists and collectors can depend upon, we think the amount we've requested and the allocation of those funds are justified. "}, {"id": 10002, "q0": "The NFT market on all blockchains are a growth factor for utility and creativity in the space. The proposer are identifying that many NFT fake/duplicates are scamming the typical user by copying authentic artists and NFT projects. \nThey aim to deploy Machine Learning and Artificial Intelligence to scan the millions of NFT projects and filter/identify the duplicates copies from the orginal issuer. \nIn addition this will be run over the cNFT (Cardano) blockchain and will allow the true verified artists from other blockchain to migrate their work safely/securely/traceabilty to the cardano network. \nProviding a trustworthy source that can automate the scaning and varification of NFT in a quick manner is the only way to scale over hte multitude of daily projects and scams being thrown at the typical user. \nAlso the ETH and other NFT blcokchain ecosystem would like to find a secure way to cross-over to Cardano space without loosing their previously hard earned clout and public image to restart in a new blockchain. \nThe impact of such project to cardano ecosystem is it will raise the awareness of a ecosystem that has less hacks and or scams and render the overall experience of the typical NFT collector and user much more safe and enjoyable. ", "q0r": 5, "q1": "The team has already begun a great deal of the planning and work over the past 3 months. They are proposing a plan for the rest of the year. The funding requested will springboard them to work full time and provide a solid team of nearly 12 people working on the project. \nThe main proposal owners are the only ones listed by name and the rest of the team still remain uknown, which is a slight risk. However the completed objective showcase that the team is building and ongoing with their ambitions. \nSecondly the budget relays a tight plan of the expendidture / manhours related to each segment that is needed to build the platform. \nOverall the deliverables and KPIs were listed by month and can be easily acheived if they have the right team of coders/backend that they claim (would have been better to know the team as part of the proposal). \nEngagement in Twitter and other social media outlet is part of their plan which will start to trend when more project migrate from ETH to Cardano. \nTheir objective relies on the success of that social media push", "q1r": 5, "q2": "The team has listed clear objective on the expectations for the AI And ML Systems activity. They have commited to show progress reports and strain testing on the system during the building phase. In addition they will have a social media platform to raise awareness and engage the community across ETH and other networks. \nAuditing this project will be simply to relate the success of their KPI over the estimated time in their roadmap. \nFinally I would also request to test the functionality of the evaluating system to ensure it is not a manual filtration and that the AI / ML is actually the one making the automated detection of plagirism. This might be a slightly challenging task. However if the owners of this proposal are open to show transparency then it should be easier. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "A commendable and well-reasoned assessment. Thank you for not only taking the time to understand the solution we’re trying to provide and its potential benefits to the CNFT ecosystem, but for your careful reading and articulating the specifics of our proposal. Some of your description of our project in the Impact/Alignment section bests some of our description of the project, so again, thank you for taking the time to understand the issue at hand and the importance of the solution we're building."}], "solution": "Build an AI/ML-driven protocol to protect Cardano NFTs from plagiarism, and offer it as part of a marketing campaign to migrate Eth artists.", "experience": "Tech Lead - CTO with extensive experience in tech project management and artificial intelligence; 16 years experience in back-end web development.\n\nBusiness Development Lead - 7 years experience business development; 15 years experience project management, sales and marketing."}