{"id": 399497, "author": "ben.mesnik", "title": "Incentivized learning to move users", "url": "https://cardano.ideascale.com/a/dtd/399497-48088", "category": 26448, "amount": 69500, "description": "Switching to a new ecosystem is risky and daunting. Farming incentives encourage movement but attract mercenary farmers not actual users.", "f6_no_assessments": 5, "f6_rating": 4.133333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 303, "q0": "The proposal clearly addresses the acquisition of people from the Ethereum ecosystem.  While that is a worthy goal, the challenge brief is targeting projects first, with users being mentioned as a resulting metric.  That said, I believe that the proposal is effectively addressing the **spirit** of the brief, if not the letter.  I have to give it half a point (rounded to 1 point) for this.", "q0r": 4, "q1": "Well written proposal, clearly described, from a person who has already implemented a similar thing before.  The proposal would be improved by explaining more of the technical plan, but given there is already another similar application, it's hard to deduct any points for this.  I wish there was a clearer story about how the requested ~$70k will pay the creator, but it also seems that he must have a plan for that.  I like that most of the allocated rewards are going right into the protocol for incentivizing people to learn on Milkomeda + Cardano.", "q1r": 5, "q2": "Very clear objective ways of seeing results, on themes aligned with the spirit of the challenge category.  Great job.", "q2r": 5, "assessor": "z_assessor_1139", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 2029, "q0": "This proposal is extremely important to the community. Milkomeda is already helping bridge Ethereum and Cardano users. The tipbot would be super effective incentivizing Ethereum users to first bridge to milkomeda and then learn more about the Cardano ecosystem. I myself, would be interested in learning even more about the milkomeda blockchain and how it compares to Ethereum. If addressed effectively and there can be a big audience for this TipGenius, we could see huge amounts of Ethereum users migrate over and normalize bridging between ecosystems. ", "q0r": 5, "q1": "Given the experience of the team, there is a high chance that this will be able to come to fruition. The founder of TipGenius has created this proposal so that he can give these funds to the community. I like seeing this because lots of the fund that could be given to this proposal is going to be distributed to the community. This is what we like to see in the Cardano Ecosystem. We are welcoming others and rewarding them with their desires to learn more about the ecosystem and other Dapps building on Cardano. For this reason, I give this section a 4 out of 5 stars. ", "q1r": 4, "q2": "The team gives a great description of the roadmap. This roadmap includes what the tipbot will be doing for the first 6 months with this fund. It will help incentivize users to use the milkomeda blockchain. This will increase the TVL on Cardano because Milkomeda is a sidechain. I like reading through the fund breakdown because it shows where the potential funds are going to be used. As I explained earlier, it will be successful to audit because they will be giving the funds to the community members who are learning more about different projects built on Cardano and Milkomeda and ultimately to gain a greater audience. This could be a lot of Ethereum users, and others that like Cardano, but have never heard of Milkomeda. For this reason, I give this section a 5 out of 5 stars. ", "q2r": 5, "assessor": "z_assessor_1448", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3425, "q0": "The information that the proposer provides to the voters is quite necessary. Proposer presented the problem to better understand why this proposal was made, then the solution was also introduced in quite detail. Solution is a study promotion program that helps Milkomedia users better understand the Cardano ecosystem. Proposer has provided features of the solution and given examples to make it easier for people to visualize the project. In addition, the way this program works is as clear-cut as the way it impacts the Cardano ecosystem. The project risks section is also outlined quite well, however, the proposer needs to clarify the solutions for those risks.", "q0r": 5, "q1": "Proposer provided the voters with a roadmap to proceed with the project. However, the information of the roadmap is not detailed yet, the proposer should add more details such as the work to be done in releasing with 500 tips for protocols on Cardano. The more detailed the roadmap, the easier it is for voters to see the direction of the founding team's project. Likewise, the proposer should share more information related to the spending plan such as costs in the Hosting/Administrative costs section. In addition, the information of the project founder is also quite sketchy when not giving information such as work experience or achievements at work.", "q1r": 3, "q2": "The founder's goal was clearly shown through the provided metrics. This is a plus because the voters clearly see the destination of the project. Criteria to measure the progress and development of the project have been provided, however, the proposer has not yet provided the criteria to evaluate those criteria.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 7751, "q0": "This proposal create a browser extension called Tip Genius, that is a learning tool to show a relevant, bite-sized tips to help navigate users when using or interacting with dApps. Tip Genius will come in short video, along with a description for complementary details. This proposal is intended towards people who are used to Ethereum to try and learn about Cardano when interacting with Cardano’s dApp. This proposal is similar to Coinbase’s “Learn and Earn”, where users are paid to learn about certain protocols. This proposal will work mainly with Milkomedia protocol, that provides EVM compatibility into Cardano. This can be used to attract and grow a user that are familiar with Ethereum ecosystem, into Cardano. Tip Genius was also funded through Catalyst Fund 7, so they’ve already build the base application and create 500 tips for top protocols on Cardano.", "q0r": 5, "q1": "This proposal mentioned the person who will work on this project, however it is not a detailed profile with work experience, only a proof of Cohort Plutus Pioneer. Furthermore, looking at the budget details, it could explained in more detail about the work hours. It could be better if the proposer could explain how Tip audit costs can costs for $3000, breaking down in detail could give us an idea how the budget will be used. At a glance, $25 for one tip seems a lot, but actually fair considering that every bite-sized tip will consist of video and complimentary description about the tip. In terms of feasibility, one person with technical knowledge to handle creating these tips will be sufficient. This proposal could be a 4 to 5 star if they’ve broken down the budget allocation for the Ada incentives, e.g how much will the users get when learning a certain tip? This would also directly explain how the implementation would work, because overall it’s still a general idea (making a tip information) without actually goes into detail on how it works. Overall, I will give it a 3 star", "q1r": 3, "q2": "This proposal have a roadmap, and metrics to measure, such as the number of tips created, and number of users educated. Regarding the auditability, they didn’t provide link to where we can check Tip Genius extension for this Cardano, they’ve only include a link for Tip Genius for video game. A social media like Twitter or Telegram would be great so user can get updates on the progress for this project. Roadmap could be better if they provide a detailed milestone for each month, and not only a general timeline of 0-3 months and 3-6 months.", "q2r": 3, "assessor": "z_assessor_640", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9738, "q0": "The proposal covers the use of an existing platform called Tip Genius and applying it to the use case of protocols that are being migrated to Cardano such as through using Milkomeda. The idea behind the tips are to reward participation and education of people using the DApp protocols. The value of being able to provide information at the point of usage of DApps is clear and could present a good learning opportunity for those that are new to these applications. However, with the usage of tips in the learning process the proposer has introduced an incentive for people to create multiple accounts and abuse this system. Especially if this tip system rewards people for simple tasks. The proposer does not mention the identification methods or concerns of multiple fake accounts (sybil resistance) with bad intent. Considering the importance of the incentive system and how it is applied this makes it difficult to give confidence that this system will produce the right outcomes without further information and evidence. The concept itself of applying tips to the site as a tool that these applications can use makes a lot of sense - perhaps that being suggested to these applications to integrate is all that's needed. The user already has some incentives to understand the protocols they are trying to use if they are going to interact with a DeFi protocol that gives them value (either via swapping / farming etc). There is great opportunity with the concepts outlined in this proposal but the finer details, incentives and identity behind it require sufficient through and evidence to produce a high confidence on the impact it will have. The proposer does not mention the risks of identity and multiple accounts in the proposal risks section which is something else that can be addressed in future proposals.", "q0r": 3, "q1": "The proposer outlines a roadmap of the number of tips that will be added to the different projects. It would have been beneficial for the proposer to go into more detail for the 'Implementation of incentivized learning program infrastructure' as this is the most significant part of the proposal in terms of execution and likely complexity. The website and functionality for the service already exists for some previous products which helps provide evidence that the team is able to execute on a technical level. The proposer also states they were part of the Plutus pioneers program. The proposer would have benefited from sharing more professional background such as a LinkedIn profile and also any repositories that showcase their Plutus development skills.", "q1r": 4, "q2": "Number of tips created, total number of users educated and number of wallets that received incentives payouts that are still active after 6 months were provided as KPIs. These are all relevant to the proposal and the ability for the community to determine whether this proposal was effective. The proposer outlines targets 20,000 users through the incentivised program. It would be good to know how this number was derived to work out whether it is practical and fair. The proposer has not mentioned whether any of this work would be open source which would be beneficial as then other projects can learn from how they implement the incentive program.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Incentivized educational tips via browser extension popup. Shown as you use specific dApps. To move actual users and provide a welcoming UX.", "experience": "Founder of Tip Genius, a browser extension based crypto coach that provides relevant, easily-digestible, high-quality tips on how to use dApps, live while you interact with them. \n\nPlutus Pioneer, Developer, and Blockchain enthusiast"}