{"id": 399526, "author": "fractalfuzion", "title": "Eth Rehab - Recovery with Cardano", "url": "https://cardano.ideascale.com/a/dtd/399526-48088", "category": 26448, "amount": 20000, "description": "Ethereum users may not understand they need to be rehabilitated. Eth Rehab will serve as a info hub for a smooth transition to Cardano.", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "I would agree that this is a challenge that Cardano faces. There are a lot of people on Ethereum that refuse to look into other blockchains because they are familiar with it and it has worked for them. This also reminds me of those people that are still stuck in the current financial industry and \"stuck in their ways.\" This proposal will help identify the challenge through a learning process. I find this method to be one of the most effective ways to migrate from Ethereum. However, my only thing is I don't know if I'm a fan of the \"rehab\" definition of things. I don't think that it's necessarily a bad thing that they have been on Ethereum. It sounds like we are trying to completely change their way of thinking to only Cardano. Some ethereum-based ideas could actually be quite effective in the Cardano ecosystem as well. For this reason, I give this section a 3 out of 5 stars even though I find this idea to be extremely important for crypto in general. ", "q0r": 3, "q1": "If the \"Eth Rehab\" is just a name, with a different purpose. Forget what I said about the potential negative connotation that it may have. The team seems to have a good amount of experience in both ecosystems. Like I said, I find this to be important in creating a proposal because it will have 2 perspectives. That of Ethereum, and of Cardano. With both of these perspectives, the team can propose an idea that will likely give the most impactful idea. I think that this proposal will be implemented successfully if given the funds because of the passion they have to help Ethereum users migrate to Cardano and experiment with this blockchain. For this reason, I give this section of the proposal a 4 out of 5 stars. ", "q1r": 4, "q2": "Reading through the proposal was exciting to me as a Cardano user. I think that the roadmap was written nicely, and it has a great plan to follow-through with the ideas and goals the team has. The budget breakdown was also written well and it helps the community to understand exactly what is going to happen to the funds and how that will have a positive impact on furthering the growth on Cardano. I think that the amount of information listed above in the proposal is sufficient for getting the point across, and for this reason, I give this section of the proposal a 4 out of 5 stars. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The intentions of the proposal are valuable. They fit well with the requirements of the challenge, since it is proposed to devise a way to help users migrate from Ethereum to Cardano. Therefore, if successful, it would undoubtedly be a contribution and would add value to our community.\n \nThe proponent tries to carry out an educational and fun program to migrate users to our network, but makes a serious mistake: at no time does it state what those 12 steps are that would lead Ethereum users to identify the inefficient practices of Ethereum and how Cardano is a solution for those problems.\n \nThe latter is enough to deduct a point in Impact, although my general opinion is still favorable in this category.", "q0r": 4, "q1": "The proponent does not offer links that certify his role within our community. A link to his profile as a creator of NFTs, to his SPO, Linkedin or Twitter account would have been welcome.\n \nHowever, the proposer does seem to understand the steps to follow to carry out his idea. He has a very detailed and itemized budget. It is a reasonable budget for the objective that is proposed and its timeline is very well divided into three detailed stages. One of creation, one of concretion, and a last one of evaluation.\n \nThe proposer seems to know well how many people he needs to work on his project to carry it out and he seems to have the necessary contacts (I repeat, I say it seems because he does not certify it with links).\n \nThe proposer has considered risks, but has forgotten the most important risk. However this falls into the next category which is \"Auditability\". So my opinion in this section is favorable, but with one point less for not having provided the links.", "q1r": 4, "q2": "In this category I find the biggest problem for this project. How is it possible to audit that the people who take this 12-step program are indeed members of the Ethereum community and not members of the Cardano community who simply want to take advantage of the rewards of the program?\n \nThis problem seems to me of great importance for the project to be successful in what it is proposed to do: transform ethereum users into cardano users. Then it would be necessary to devise a mechanism to avoid that the requested funds are ultimately wasted on free-riders.\n \nThis is why I believe that this project does not satisfactorily meet the central requirement of this field: \"Clear understandable solution that addresses the problem.\"\n \nThe roadmap and the kpis are done correctly and clearly. If he solves the above problem for the future, this project has a good future in auditability.", "q2r": 3, "assessor": "z_assessor_32", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal does a good job at addressing the problem of improving Cardanos image and brand awareness which is not currently well represented. In my own personal experience in coming from ETH to Cardano I found it was almost lucky that I came across Cardano, but sure am glad I did. This has made me passionate about this migration. It seems that the younger generation involved in gaming and art/NFTs will play an important role in this great migration, so this proposals focus on making a fun and engaging process with creative content is great to see.\n\nStories are a great way to make a something resonate with a target audience, and as someone who has dealt with my own personal 12 step journey with recovery I found this theme SUPER appropriate for what is needed, and a bit funny!!!🙂 \n\nIn terms of key metrics, the proposal covers the challenges goals very well with the plan for of a variety of onboarding and educating tools for new projects and users. This  was shown in an objective and well laid out plan. This 12 step \"rehab\" process is also a good way to ensure scalability as Cardano grows and the processes only become more complex.", "q0r": 5, "q1": "The proposer has a clear and concise plan as well as a reasonable budget to achieve its goals. Breaking this into 3 phases that were realistic will help focus the efforts and keep momentum. The first month is set aside for a \"story board\", which is great to see as storys are a great way to sell an idea. \n\nAlso, the proposal includes high impact but low cost solutions for marketing (interviews, appearances) etc, which will help with overall feasibility within the budget and timelines.\n\nI gave this section a 4 instead of a 5 was it was a bit light on \"clearly explain the technical aspects\". While there is a good that idea of the necessary tools (Videos, logos, banners, 3d, AR, CNFT content.), more detail here would help get to a 5. It would also be good to see more awareness of the potential challenges that may come up and how they could be addressed.", "q1r": 4, "q2": "Great idea here to use a dedicated policy ID with a CNFT to track the progress and completion of this program!  As scalability is an important part of this challenge, it is good to see a resource like NFTs on the Cardano blockchain being leveraged as this can be used in future proposals and other use cases. \n\nIn the Charles Hoskinson video that is highlighted in this challenge, a key element in his mind to growing the success of Cardano is helping to build out our developer ecosystem enough to absorb the incoming tech resources, and this proposal does a great job at helping to address that. As we \"rehab\" ETH ecosystem users a butterfly effect will happen and these users can then teach their friends/colleagues, etc. \n\nWhile I dont personally know the proposal lead Fratcal Fusion, I am aware they are very active in the CNFT community and I own one of their NFTs!!! A good sign.\n\nThis feels like a fun project that will provide a easy to follow and engaging process!!  \n\nFractal Fuzion is available to the community for any questions or concerns.", "q2r": 5, "assessor": "z_assessor_503", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "As proposer says Ethereum users may not understand they need to be restore and vacate new building, None other than Cardano ecosyem, The gas fee of Eth sucks and many Eth should be taught and make them understand, how much loss and violate is there market and full of flaws , Creating Eth Rehab will be like creating awareness about all the flaws basically like rehabs, the name of the challenge addressed is magnificent,\nonce they are made understandable to there       situation and bringing them to Cardano community and helping them by giving solutions with Cardano Blockchain is remarkable great idea, Developing 12 step methods  that will identify inefficient crypto practices of Ethereum and provide solutions using the Cardano blockchain is applaudable,\nThis proposal effectively addresses the challenge without any flaws.", "q0r": 5, "q1": "The proposer only being recovering from Ethereum user and understand inside the mind of a ETH user. Ethereum users may not understand they have a problem,\nThe proposer idea of rescuing others like him who faced hardship is appreciated, Having too much gas fee and wasting on centralized miners making aware to everyone is great, Eth rehab will also shows way to current and recovering Ethereum users, developing 12 step methods which includes  eth users understand the inefficient crypto practices of Ethereum and provide solutions using the Cardano blockchain and ETH Rehab will make a very fun and engaging arguments why Ethereum users should migrate to Cardano is cool idea, \na proposer wants to bring changes through educational way its nice, as program divided into 3 phases, its more than enough to Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "As proposer wants to finish in 3phases ,\nand provided detailed cost breakdown which includes  marketing, paid promotion, distribution, story line and Website to create 12 steps method is great step, and \nNumber of ETH users taking part in program, \nnumber of ETH recovering members, providing them with CNFT to participants that complete the program,\nas they are ready to provide number of posts, likes, comments, video views, to track engagement and will make all data available to the public with full transparency.\nSo with all the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 11, "ne": 1, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "Develop a 12 step program that will identify inefficient crypto practices of Ethereum and provide solutions using the Cardano blockchain.", "experience": "I myself am a recovering Ethereum user and understand inside the mind of a ETH user. Ethereum users may not understand they have a problem. Ex. gas fee's wasted on centralized miners using antiquated tech. Eth and Cardano community member, NFT artist, SPO, Shill-a-mania Champion"}