{"id": 400697, "author": "nicoarqueros", "title": "Bridge liquidity for top protocols", "url": "https://cardano.ideascale.com/a/dtd/400697-48088", "category": 26448, "amount": 90000, "description": "Most Crypto dApps require liquidity to work correctly. Low liquidity implies jumps in prices, lack of tokens among other undesirable things.", "f6_no_assessments": 5, "f6_rating": 2.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Providing a solution for liquidity to projects deployed on other blockchains in order to incentivize them to migrate to the Cardano ecosystem is a great idea. This directly addresses the challenge setting \"The Great Migration (from Ethereum)\". The idea is impactful and aligns with the challenge setting, but this assessment assesses the proposal. The proposal is overall lacking fundamentals and the proposers are advised to look at other previous funded proposals in order to align their proposal with the successful ones. The core of the proposal is well aligned and impactful though so it will receive a generous rating of 4 stars in terms of impact. ", "q0r": 4, "q1": "It is not possible to assess the proposal in terms of feasibility given the simple nature of the current proposal. The proposers are once again advised to refine this section completely in order to achieve credibility. The only credible (and in turn feasible) thing that the proposal have, is the team behind it. As its the proposal that is assessed, it will receive 2 stars in terms of feasibility. (+1 for having a known team behind it, but that does not excuse a lazy proposal.)", "q1r": 2, "q2": "It is not stated anywhere in the auditability section *how* you measure progress during *development*. This should be addressed, in its current state, the community cannot audit the project if it were to be funded. Furthermore, some relevant KPI's should be included. Unfortunately this section has to be improved the most, as a result it will receive 1 star for now.", "q2r": 1, "assessor": "z_assessor_139", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "\nThis is a great idea! It would be good to join the Town Hall weekly meetings so that this idea might turn into a project. It would be nice to work out how the idea of Bridge liquidity for top protocols will add value to the Cardano ecosystem and what impact it will have on the Cardano ecosystem. I would also like to see some KPIs that would be in align with outlined challenge settings. This proposal is not able to scale to address future challenges.\n", "q0r": 2, "q1": "I hope to see you at one of the next Town Hall and to work together to develop this idea into a project. Here’s what it will take to make the community resonate with the project. It would be good to present the team transparently, have a reasonable budget and make a budget break down on items. It would be great to have a detailed work plan and a presented time frame within the set tasks will be done. What resources are needed to implement the project? And whether there are any risks or challenges during the performance itself.", "q1r": 1, "q2": "In order for the community to be inspired to vote for the project and for the Community Adviser to give a good rating, it is necessary to have an excellent roadmap with milestones and super KPIs through which community can monitor and folow the success of the project. ", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "This proposal focuses on providing liquidity to top protocols working between on on chain(s). I agree that there is alignment with the challenge.", "q0r": 5, "q1": "There has not been enough information here with respect to how the team is going to go about implementing a liquidity bridge. Im aware the milkomeda has allot of tools up their sleeve, so allot of information in house. However some information here would be great.", "q1r": 2, "q2": "The propsal mention 5 projects using the product. A budget of $90K was requested, but i cannot see how this funding would be broken down apart from assuming that its just spend in salaries for a dev team. Its a little hard to measure the progress of such a project other than looking at an existing Github (milkomeda) and/or whatever communications come out of the team. But nothing is mentioned here. ", "q2r": 2, "assessor": "z_assessor_750", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "dcSpark intend to support 9 different protocols with $10k worth of incentives to help bootstrap the liquidity needed for the DEX to function. The funding will not be owned by dcSpark and will stay in the protocol indefinitely. This proposal has the potential to help increase the TVL in under utilized protocols that are trying to get initial liquidity for them to function. As a result the execution of this proposal could help DApps that are migrating to Cardano from Ethereum have an extra boostrapping event to incentivise more people to use those protocols. The proposal could be effective at initiating the usage of top protocols based on EVM compatible chains to be used within Cardano. It would have been useful for the proposers to list out the example protocols that could be considered to give examples to the community for review and to enhance the understanding of potential options.", "q0r": 4, "q1": "The proposers dcSpark do not add their team or website information. However, you can find their information at https://www.dcspark.io/ which details the team information and the projects they are working on. The timeline for the project is low at two weeks plus work for attracting the projects to receive the funding incentive. It is clear the proposal team can execute against this proposal and have the existing network connections to both find and reach out to suitable contenders for those that could receive the $10k incentive. More information about the project team and dcSpark in general with a better break down of what's involved in the timeline could have been added to improve the confidence in the feasibility.", "q1r": 4, "q2": "The proposals mention that 'At least 5 projects should have launched recently and they benefit from this.'. It would have been useful to identity which projects they are referring to. It also would have been beneficial to consider how they will determine whether that $10k incentive made a different in terms of bootstrapping some of these protocols to get adoption in the Cardano ecosystem. As an example they could have suggested tracking some of the information before or after or between other protocols with different TVL amounts and reported on the impact of this proposal. Finally it would have also been good to see the proposers allocate some budget for either themselves or someone else to have capacity to better report the success of this proposal to the community so it can be more effectively audited. It will be time consuming and unlikely for the community to track when dcSpark initiate this work and the impact it has.", "q2r": 2, "assessor": "z_assessor_758", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the liquidity issue, which is an interesting way to migrate projects to Cardano as liquidity is a key point. The proposal fits well in this challenge as it aims to migrate different projects.", "q0r": 4, "q1": "The experience presented on the proposal shows fruitful projection toward's the proposal's successful implementation. However, it lacks details when it comes to presenting the plan. This is because the proposal fails to list major milestones and clear activities to achieve them. ", "q1r": 3, "q2": "Auditing the progress or success of this proposal is one possible if the metrics are going to be the number of the projects migrated. But all in all, this metric is only one aspect of the progress, and the proposal fails to address other aspects that need to be audited like time, budgeting, KPIs, and more. ", "q2r": 3, "assessor": "z_assessor_762", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}], "solution": "Bridge liquidity for top protocols. The liquidity will be permanent on those protocols so dcSpark won't be getting any direct commission.", "experience": "dcSpark is one of the top companies building in Cardano. Successfully completed multiple Catalyst proposals."}