{"id": 400714, "author": "nicoarqueros", "title": "Milkomeda accelerator batch #2", "url": "https://cardano.ideascale.com/a/dtd/400714-48088", "category": 26448, "amount": 75000, "description": "Organic adoption and development of dApps is too slow. Not only that but creating a startup is difficult and it is very likely to fail.", "f6_no_assessments": 8, "f6_rating": 2.291666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1080, "q0": "Migration from Ethereum receives no mention in this proposal. It is instead focused on a broad, scattershot concern about startups. While it's possible that these two things are related in an important way the proposal doesn't connect these dots at all and does not effectively address this challenge's requests for ideas to create avenues for projects to migrate.", "q0r": 1, "q1": "Especially for a request the size of $75,000, more detail should be provided for any future requests. No names, backgrounds, resumes, websites, budget lines or githubs were supplied in support of this project. I would suggest that the proposers put more effort into any future proposals, as well as be more transparent.", "q1r": 1, "q2": "It's certainly possible that, if this proposal succeeded, they could accept and graduate 5 startups as they suggest. But given the general lack of information provided by this proposer overall it is fair to lack confidence that these materials will be readily made available and forthcoming to auditors. ", "q2r": 2, "assessor": "z_assessor_1275", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 1225, "q0": "The proposal is to fund the second batch of an accelerator program for Milkomeda, a cross chain interoperability platform. There isn't much detail about Milkomeda, the current state of their work on Cardano interoperability or any other information that might be relevant. The proposal looks like a pre-first draft. Since this is the second batch, I would expect a lot more detail on the process and the results of the first batch. But there isn't even enough detail if this were proposal was for the first batch.\n\nThe funding is requested to teach startups Milkomeda environment but there is no information on how that would align with the challenge. From discussions within the community I've heard the team has been working on Cardano interoperability but they've been historically working on EVM based chains. On their website we see they have hit Cardano Limited Beta Mainnet and are about to do their Public Beta on Mainnet. \n\nSo the underlying product is very much in the space of Ethereum migration but the team has not made clear at all what type of outcomes can be expected, what benefits will projects experience, why/how Milkomeda makes migration from Etherum possible, why teams would prefer this setup etc. ", "q0r": 2, "q1": "It is difficult to assess the feasibility of this proposal. There isn't any detail on the personnel, the work, the time or the budget. All we have available is the company name dcSpark. A visit to their website reveals a capable team of 30+. A former Co-VP of Engineering at Emurgo is a Co-founder and CTO, CEO Nick is a past Emurgo CTO and they have other members with Emurgo and IOHK experience. It looks like a competent team. If they actually outlined the work, provided a detailed plan and outcomes, this would probably be quite feasible. As it stands, it is not.", "q1r": 1, "q2": "The proposers will measure progress by acceptance and graduation of 5 startups. That is all they will use to measure progress. They could hypothetically accept and graduate startups on the same day. This is obviously not enough to measure the success of anything. Acceptance of 5 startups isn't even progress. It is the very beginning of the project. Graduation of 5 startups could be a good tracker if it was supported by some information on what the qualities of graduating startups would be. Under what conditions would a startup graduate? Could they fail to graduate? These are all relevant and missing from the proposal. \n\nThere are no specific deliverables presented. The only thing resembling it is how the proposers have outlined success for the project: \"Startups finishing the program and having a prototype\". So an auditor could expect graduating startups to have a prototype working with Milkomeda. Little else is provided to help clarity and auditability.", "q2r": 1, "assessor": "z_assessor_1323", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 1343, "q0": "The project tries to create a startup accelerator program with hands-on programming, mentorship, and priority technical support from dcSpark and dlab. The proposer and dlab have a strong background and thus making the proposal a good project on the paper. However, the proposal does not provide much crucial information that made me doubt the implementation of the proposal. The team provides difficulty of finding good projects but does not elaborate how they will solve it.", "q0r": 3, "q1": "The proposal does not have a detailed plan or roadmap. It could get better if the startup activities are broken down for each week (or any other timeframe), such as, for the first 3 weeks the startups get hands-on programming (and what kind of programming language will the startups get?) and the next 3 weeks startups will be launched together with a mentor. The proposal does not provide any budget breakdown. The proposal only stated the budget will be divided within startups into two chunks, depending on the completion of their KPIs. However, it can be written more clearly, for example, for 5 startups each startup will get 7.5k$ upfront and get another 5k$ if they accomplish the KPIs. The proposal only gives information on roles needed without further information on who is responsible for the roles. The proposal also does not provide any personal information like background or past experience for any of the members. It would be much better if the proposal stated a concise relevant background and skills of any team member needed, and also gave a LinkedIn profile. A LinkedIn profile made the community easily verify they are giving fund to a legit person.", "q1r": 2, "q2": "Metrics for success are defined but not details enough. For example, what compromise is a prototype? are localhost sites considered as a prototype? Or must the product can be used by users? Also on what basis startups can graduate? Or what kind of criteria so the startup can get admitted in the first place? That crucial information is not provided clearly in the proposal.", "q2r": 2, "assessor": "z_assessor_1342", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 2144, "q0": "This proposal aims to launch a second batch of its accelerator program together with their partner SOSV where companies will be coached. Sadly we are not offered further details on how such an accelerator would work, or who exactly would the target companies be, other than there is a maximum of 5 onboarding spots. While overall the idea of an accelerator fits very well within the challenge, I cannot help but maintain a neutral position until more details about the project emerge - hopefully into a next iteration. ", "q0r": 3, "q1": "The team states that the project leader and the training partner company are behind one of the most successful accelerator programs in the crypto industry. Sadly for somebody unaware of their program there are no further details provided or links that can showcase the past project’s success.\n\nIn terms of budget I quote that “the total amount will be divided among the startups depending on the completion of their KPIs”. I think that treating a 75k USD budget in such broad terms is definitely showing a lack of professionalism and a very red flag in my opinion in terms of the project’s viability. \n\nA similar approach applies to the timeline, and we only know that a few weeks are needed to identify and filter startups, without any information on where there is a system behind this process. After identification of participants, 6 weeks would be necessary to deliver trainings, perform hands-on programming, mentorship, and technical support. Again, treating a 75k USD budget in such broad terms in terms of timeline is a red flag in terms of project’s viability.", "q1r": 2, "q2": "The only information we have is that the success of the project would measure in the 5 startups having a prototype at the end of the project. Again, a third red flag with no effort into explaining how the project wishes to communicate publicly with the Cardano community. \n\nAs a last remark, it is sad to see a team whose technical skills are probably head and shoulders above this proposal’s quality. ", "q2r": 2, "assessor": "z_assessor_1454", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5457, "q0": "This proposal clearly identifies the problem of bringing new start-ups to the ecosystem and addresses the challenge goals. An increase in the number of viable start-ups would help the number of dapps grow faster, and more launchpads are needed in our ecosystem to help facilitate this. \n\nProposal does not necessarily seek to onboard projects from Ethereum, but is still in-line with challenge goals of growing the ecosystem and increasing the number of dapps.  \n \n\n\n\n", "q0r": 4, "q1": "The team behind this project has a proven track record and good reputation in the community, which makes me confident that the proposal is viable. \n\nThe distribution of funds is clearly explained and budget makes sense given the scope of what proposal is hoping to achieve.\n\nHowever, the main challenges are cited as the potential inability to find quality projects, as well as their continued success after launch, which I find somewhat concerning. \n\nOverall, however, I feel that the goals of the proposal are well-communicated, achievable, and would have a positive impact on the growth of the ecosystem. ", "q1r": 4, "q2": "Key success metric is how many start-ups successfully finish the program and launch their product, with a goal of at least 5 launching, thus success of the proposal is quite easy to audit. The main risk is that if not enough start-ups can be found, or are able to finish the program, this becomes much more difficult to quantify.  \n\nHowever, given the teams proven track record in the community I feel confident that they will be able to meet the goals laid out in the plan.\n\n", "q2r": 4, "assessor": "z_assessor_1995", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7757, "q0": "This proposal didn’t explain in detail about their objective / solution regarding the problem that they’re trying to solve, which is the organic adoption and development of dApps is considered too slow. However, they do explain briefly about what their proposal is about; that is to do a hands-on programming, mentorship, and technical support from dcSpark and dlab for 6+ weeks. Although I know about dcSpark and Milkomedia track record (that they indeed do deliver and bringing EVM compatibility into Cardano), unfortunately the proposal isn’t very well written. They didn’t cover the reasoning behind why accelerator program is needed, other than they’ve mentioned “dApps adoption in Cardano is slow”. Compared to Ethereum, dApps launching 5-6 months after its smart-contract upgrade with the new novel eUTxO architecture is considered rather normal or fast. Ethereum launched back in 2014, first dApp is MakerDAO in 2015, then it got hacked in 2016 and creating a hard-fork Ethereum Classic because of the dispute. DeFi in Ethereum only becomes mature in 2020-2021, so it took years to actually develop not only working dApp, but also a safe dApp on Ethereum. While on Cardano, it took around 5-6 months after its smart-contract upgrade, and it is already equipped with formally verifiable security within the smart-contract code using Haskell and Plutus. Again, this proposal could be better if they include the reason or metrics that they use, as to why they think that development in Cardano is hard or slow. E.g “the toolset is still not widely available, hence dcSpark creating a mentorship with expertise from dcSpark team to accelerate Cardano developers”. Overall, unfortunately, I have to give it a 2 star because the lack of detail and reasoning.", "q0r": 2, "q1": "dcSpark have a great track record with delivering product into the market, one of them is Milkomedia that brings EVM compatibility into the Cardano ecosystem. However, this is a proposal in a Project Catalyst, meaning that this proposal is intended for public to read and understand what is the proposal about. There’s lack of detail explaining on what they do, their timeline, and the general plan for their implementation. The budget, being the most important part (because Catalyst is a program to request funding), is missing in this proposal. Overall, this proposal is, once again, not well written in terms of comprehensiveness and lack of detail. Suggestion would be: Include the team profile, timetable with a clear roadmap, budgeting breakdowns and detail, the implementation detail (technical and non-technical), and describe the resources necessary to implement the proposal. E.g how many mentors are there? What will the hands-on and mentorship program look like? These thing is important for the community to know if this team is serious or not. Unfortunately, I had to give it a 1 star because the lack of detail and information given in this proposal.", "q1r": 1, "q2": "Lack of detail regarding their metrics and goals. What does it mean for a startups considered to be accepted? What does it mean for a startup to graduate? These things should be explained in detail. Again, not really explained in detail, which will make the audit rather hard because we don’t know what to expect.", "q2r": 1, "assessor": "z_assessor_640", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8226, "q0": "\nUnfortunately, the whole proposal is not made in accordance with the standard of proposals that can be funded. It would be the best if you join one of the next Town Hall meetings to get more information on how to prepare a proposal that maybe could get funding. It is necessary to present the problem and offer a solution. It would be good for the proposal to explain in detail how it will add value to the Cardano ecosystem and what impact it will have on the Cardano ecosystem. It would be great to have KPIs missing in the proposal.\n", "q0r": 2, "q1": "The team needs to be transparently presented with all the necessary knowledge and experience to finish a project. The budget should be reasonable and divided into items so it would be clear what the money will be spent on. The community likes to see a detailed plan to know what you will do and how. It is good to have a time frame within all the work will be done. And it is quite important that the proposer is aware of the possible challenges and risks.", "q1r": 1, "q2": "To increase the chance that your project will be funded you need to create a roadmap with milestones. Without KPIs that are in align with challenge settings you will certainly not get a good grade from the CA and therefore the community will not vote for your project. So it’s good to have written KPIs through which the community will be able to track your project.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9746, "q0": "Milkomeda are suggesting a new round of funding for their accelerator that will help DApps build on the EVM compatible sidechain Milkomeda. The accelerator will give developers personal support and feedback for their projects and the opportunity to get non dilutive grants. The execution of this proposal could effectively and directly help DApp developers port existing EVM compatible applications onto the Cardano blockchain via the Milkomeda sidechain or create new prototypes.", "q0r": 5, "q1": "The proposers do not provide any links to the project or team members. However you can find the dcSpark website here - https://www.dcspark.io/. On their websites you can find all the team information and all information regarding milkomeda here - https://www.milkomeda.com/. The proposal timeline is short and is based upon initial work to find projects willing to do the accelerator. Considering the projects would receive non dilutive grant funding and the teams background this proposal appears to be feasible. The proposers in future should add a better timeline of deliverables of when they intend to run the accelerator or provide a better time range and also provide better links to their existing projects and anything specific that is useful for the community to consider. With this added information a better rating could have been given.", "q1r": 4, "q2": "The proposers look to accept 5 startups and will track the graduation of those startups. Success for this proposal is having 5 prototypes built because of the accelerator. The proposer adds minimal details to the KPIs however they are very relevant to the challenge and are very easy to track to determine whether the proposal is effective at addressing the challenge of supporting migration. Considering this is a continuation of the first accelerator it would have been good for the proposers to add information regarding this previous experience and what happened. Knowing this information would provide more confidence on whether the project effectively was executed and could be audited and that this same approach can be applied in the next iteration.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Milkomeda will be launching a second batch of its acceleration program together with SOSV (sosv.com) where companies will be coached.", "experience": "Nico and SOSV are behind dlab -- one of the most successful acceleration programs in the crypto industry. Some projects like API3 have come out from that program."}