{"id": 403638, "author": "shlomocohen", "title": "Caricature for Migration", "url": "https://cardano.ideascale.com/a/dtd/403638-48088", "category": 26448, "amount": 10500, "description": "We are missing some creative ways to reachout to the Ethereum community and onboard them to Cardano", "funded": 1, "upvotes": 34235128, "downvotes": 14368753, "votes_result": 19866375, "votes_cast": 139, "f6_no_assessments": 8, "f6_rating": 4.208333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1091, "q0": "This proposal presents an interesting approach to the challenge, but it doesn't quite fit. Since this proposal is about creating artwork to compel users to switch ecosystems, it's really about marketing and persuasion, more than it is about tooling for migration, which is what the challenge is requesting ideas for. Still, the idea is unique and clever and shouldn't be casually written off. ", "q0r": 2, "q1": "A review of Mr. Cohen's work demonstrates clearly that he has the talent and the skill he describes, and his experience is that of a capable professional. He could certainly create the quality caricatures for the community. His asking price is fair, if not modest. There is strong reason to believe this project would be implemented successfully, and he would deliver on precisely what he's offering. The net effect of his work as it relates to the challenge is where things get a little fuzzier, but this is a question more appropriate for the auditability section...", "q1r": 4, "q2": "The challenge is looking for KPIs in the form of number of projects and users who migrate from Ethereum to Cardano. The KPIs and goals described by this proposal are a number of cariactures produced, paired with posts on social media. This doesn't quite synch. It's possible that Mr. Cohen's work could compel people to leave Ethereum for Cardano, but there's no real way to measure this. So unfortunately I can't honestly say that this proposal is appropriately auditable. Mr. Cohen should pursue opportunities in the future to contribute to marketing-oriented challenges when they arise. Perhaps a big single proposal, with caricatures on a collection of different themes such as this one, might be more appropriate.", "q2r": 2, "assessor": "z_assessor_1275", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1748, "q0": "Proposal with the idea of creating a caricature showing the advantages and relevance of Cardano compared to Ethereum, reaching the Ethereum community. Proposing to create caricatures with a wide range of topics in a way that is creative, impactful and reaches a wide audience. EVM-based projects like Ethereum will be launched with ease. Suggest an easy to understand description and clear solution. The team considered the challenges in the project and tried with the team's experience to complete the project.", "q0r": 5, "q1": "Offer to provide a plan with a simple roadmap. But can understand what needs to be done in the project. The budget is properly allocated. However, it is beneficial if the budget is broken down in more detail. Example: Number of members participating in the project, working time and funds allocated to them. A coherent budget adds to the strength of the project. Make the project sustainable. The proposal provides enough evidence to demonstrate the experience and skills needed by the members to implement the project.", "q1r": 4, "q2": "Proposals provide several ways to check, progress, and success of a project. However, it would be nice to add a few specific KPIs in the milestones, which will be of profound value to the success of the proposal. The proposal has identified the successes that the proposal will achieve", "q2r": 4, "assessor": "z_assessor_1409", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 4591, "q0": "People always love any news in more funnier way, where they even tend to share those pictures/Arts/Jokes among them.\nThe  proposed idea definitely attracts those people , even children love cartoon drawings in the newspapers ,with creating interest in all age people, proposer has definitely idea of showing betterment of cardano over all other crypto, the proposed idea hence effectively addresses the challenge.", "q0r": 5, "q1": "The proposer has 40 years of experience making daily political cartoons for newspapers so the task wont be a difficult one for the  proposer.\nThe proposer has even excellent connection with other media sector where he can expand his cartoons among all people, the proposer even has clear idea how he wants to boost cardano over other crypto's hence this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer has clearly mentioned about his experience in cartoon field, and different media connection he has.\nThe proposer has even clear model how to make cartoons, so that can bring interest in people towards NFT , presented data is very clear on working roadmap, budget breaking in more creative manner. which definitely helps in growth of cardano in the future hence The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5830, "q0": "The award winning cartoonist/caricaturist Shlomo Cohen (https://www.shlomocohen.com/), known in these circles as the creator of HoskinToons, suggests taking a light-hearted approach and luring people in from Ethereum to Cardano. As long as it is done with good will and good taste—there is a danger that caricatures are misinterpreted as ill-will in the Ethereum community—this is a proposal that has the potential of creating viral sensations.\n\nOf course, the internet is unpredictable and virality is impossible to predict or pre-build. Even so, I would say the proposers are too modest saying, “number of viewers is difficult to estimate, but we foresee to pass a million impressions overall, 100s sharing on social networks”.  With a sheer $10,500 total budget, this is the simplest, inexpensive and potentially most influential media campaign I’ve ever come across.\n\n12 weeks and 12 NFTs. The proposers point out that each successfully sold NFT could allow the campaign to continue a little longer. If only one person can own the original while copies are being circulated all over the social media for a week by tens of thousands of Cardano fans… just imagine the spread and imagine the auction prices for those originals! These NFTs will become coveted collectibles, marking a moment in history. And that moment is called The Great Migration.", "q0r": 5, "q1": "I normally don’t care about art NFTs—I prefer the ones with real-world utility—but this one makes a lot of sense. Although Mr Cohen is the only one who could even conceptualize an approach like this, let alone draw it, I appreciate the fact that he is ready to tap into the wisdom of the crowds and develop the storyline and details together with the community. He understands and underlines the fact that the generated interest needs to be channeled correctly to be used as a force for good.\n\nPeople who come to Cardano as the result of seeing the caricatures/cartoons, need to be welcomed with open hearts and open minds in the right channels, at the right time. These channels will be in the social media messaging, on his website and in a brief outlined for the press. With all this understanding packed in a concise proposal, this is a very strong approach. Since Mr Cohen charges only $500 per drawing, the budget remains low and in fact already includes some money for the media and social media marketing required.\n\nThe only thing to improve would be to more clearly explain the role of Mr Assaf Liran. It is mentioned he is an online marketing specialist so I guess it’s safe to assume that he will be responsible for spreading the message.", "q1r": 5, "q2": "The plan is as clear and detailed as the proposers want it to be. It is intentional that they have left some room for community brainstorming. They are ready to listen to the community to finalize the plan, themes and storyline for the cartoons. Auditing the progress will be easy: one new image every week, measured by social media views and sharing. This, for sure, delivers value for money!", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6056, "q0": "This proposal identifies a fairly common problem within the challenge: how to help attract Ethereum users to our community through education. But the special thing about this proposal is the creative solution.\n \nUnfortunately, there is a certain negative disposition on part of the members of the different communities with respect to other communities. Therefore, humor can become a good bridge between these discrepancies.\n \nThese comics that the proposer intends to make, would also be a good tool for spreading the qualities of Cardano in an entertaining way. So it would bring good value to our community.\n \nFinally, the proposal is perfectly adapted to the requirements of the challenge.\n", "q0r": 5, "q1": "The proposer identifies himself as the ideal subject to carry out this task, and certifies it with different links to his extensive work inside and outside our community.\n \nThe budget is well outlined and completely reasonable.\n \nThe timetable is very realistic, and perhaps even unambitious. A cartoon per week seems little for the crypto time where everything is faster and more abundant.\n \nThis project, in my impression, has only one major lack: the lack of scripts for the planned comics.\n \nThe pictorial skills of the proposer are clear and well certified, but a cartoon is not just an illustration, but a scripted illustration. And in this case an idea that would lead Ethereum users to understand what they are missing by not using Cardano.\n \nThe proposer only lists some topics that he could cover in his comics and that he could receive help from the community. But for these instances of fund, it seems to me that at least a few scripts should be provided by this proposal.\n", "q1r": 3, "q2": "Auditability is not a problem for this type of proposal. Since it would require a simple check by the community that these comics are being made week by week and being shared by some great influencers in the community.\n \nThe kpis and the milestones are well described. As well as the clarity of the problem and its solution. So I see no reason to lower any point in this category to this project.\n", "q2r": 5, "assessor": "z_assessor_32", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6294, "q0": "The challenge of migrating from Ethereum is not directly addressed by this proposal, especially we observe the key metrics in this challenge. The proposal could have a better fit in the FAM challenge, for example. In the way that it is explained (and it is well explained), it has more to do with content creation.", "q0r": 2, "q1": "The proposal has realistic products and a clear map. The proposer have provided a link with his/her portfolio and has the technical skills to execute the proposal. However, the budget is arguably elevated to the current project.", "q1r": 4, "q2": "The proposal is definitely auditable, as it has outcomes that are tangible and accessible by the community. However, as the proposal fails to understand how the problem fits in the challenge, and the solution to it, it's hard to state that it will be successful in the challenge's mission. Therefore, a score of 3 is reasonable here. ", "q2r": 3, "assessor": "z_assessor_386", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7965, "q0": "I have to say \"wow\" when I see your website. (hoskintoons.com).\nYou are really creative with the CH NFTs. It will inspire a lot of people in our network.\nCreating NFT works of art on cardano is now not too strange. Moreover, buying and selling transactions are quite easy.\nBut the idea of ​​creating caricatures for the migration from ETH to Cardano really does not exist. And I like that idea. I have seen some of the pictures you have created. It's really impressive, and I think your project is getting one of my votes.", "q0r": 5, "q1": "Creating cartoons and cartoons will not be difficult for someone with more than 40 years of experience in the field like you.\nAnd the plan to have a weekly animated short episode is doable.\nIt is reasonable to cooperate with some of the individuals and communication channels you mentioned.\nAll of this makes me believe you can do the best on this project.\nThe cost for the project is very reasonable and moderate.", "q1r": 5, "q2": "Suggestion is easy to check by the number of animated videos and the number of NFTs released weekly.\nClear KPIs, NFT products with unique and innovative ideas, and previous products that prove it when I look at their website.\nIn addition, social interactions will be counted by them (twitter, impressions, website visits, interactions...)\nThey will create a weekly report as well as summarize the report and give it to the community.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9750, "q0": "Caricatures for migration details out a plan to create 12 caricatures on different topics concerning the benefits of using Cardano to an audience of Ethereum developers who may be interested in the Cardano infrastructure. The proposer identifies some high level areas that could be focus points for the caricatures. As some feedback it would have been good to flesh this out more thoroughly for the community to see exactly the areas that the proposer would like to cover any why. Which areas do they believe are the most important to get right? Are there any ideas already on how to visualise that? If the proposer is unable to pin point the most compelling reasons or doesn't find the a suitable way to visualise them then the impact of this proposal could be limited. The proposer mentions brainstorming with the community to ensure these are correct which is a good course of action to ensure a better outcome is made regarding the topics covered. This proposal does not directly help to migrate projects over to Cardano however, if effectively executed, could lead to being a reason that Ethereum deployed projects see more information regarding Cardano and consider a migration.", "q0r": 4, "q1": "The proposer provides a link to their work and also to a recent NFT project in Cardano that showcases their ability to create caricatures and graphic illustrations more generally. It is clear the proposer has the ability to execute against the proposal they have outlined. The budget is clear and reasonable at $500 per caricature for 12 plus budget for marketing efforts. It looks very likely that the proposer will be able to execute this proposal.", "q1r": 5, "q2": "The proposal indicates the that they will track the number of views on social media (eg twitter likes, RT, impressions, engagements, profile visits). This is a useful start for determining whether this proposal does in fact help reach people to highlight the topics covered. What the proposal doesn't cover as effectively is how they will target the relevant users in the right social channels and also how they will track whether they do in fact help result in any projects migrating to Cardano. This would be difficult to audit and as such makes it more difficult to know whether having a high view counts will actually lead to any actionable impact.\n\nOne thing the proposer could have done is to mention how they intend to use the work to direct these projects to certain events, 1 to 1 meetings, mentors or resources and which ones they could use and then look to try and track the conversion in those areas. \n\nOverall it is possible for the proposer to track and audit some of the impact of this execution of this proposal. Determining the number of DApps that migrate will be difficult however not impossible. The proposer will need to make more efforts to better determine the actual impact of their proposal beyond just the views it achieves, where possible the proposers should try to move closer towards what determining what projects end up migrating after targeted marketing efforts so that it can be more easily audited.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A weekly caricature showing the advantages & relevancy of Cardano over Ethereum, to reach out the Ethereum community in a fun & creative way", "experience": "40 years of experience making daily political cartoons for newspapers, in the largest/most read newspaper in Israel (Israel Hayom) , won multiple awards, NFT designer"}