{"id": 404492, "author": "b.ramesh", "title": "AIDA: Decentralized AI on Cardano", "url": "https://cardano.ideascale.com/a/dtd/404492-48088", "category": 26448, "amount": 50000, "description": "Existing works on ETH - Microsoft's DCAI and HP's Swarm Learning frameworks - lack scalability, model security & fair incentive mechanisms", "f6_no_assessments": 6, "f6_rating": 3.8333333333333326, "videos": [], "media": [], "f6_assessments": [{"id": 306, "q0": "Because the challenge brief allows for any other-chain apps to be brought to Cardano, the proposal's expressed purpose is a close fit for the essential requirements of the brief.", "q0r": 5, "q1": "I didn't find it completely clear from the brief whether blockchain will bring accountability and steering for AI-based results, but I have such a hope.  \n\nAs for the technical execution plan and budget, they seem sensible overall.  As an experienced software project contributor, the dollar-equivalent amounts seem small, but the timeframes are sensible... I'm counting this as \"it's cheaper to live in India\".\n\nIt might be noted that this is more likely to be the beginning of a journey for this project, and I'm interested to see where it may go next.  The budget is focused narrowly on the scope described - therefore, no deduction for scope/budget mismatch.\n\nThe technical description is a bit general, which is naturally difficult for a project such as this.  Because I haven't exactly understood the precise nature of the technical project, it is hard to give a 5-star \"Strong\" agreement.  Some review over their github shows some things that look sensible for a centralized command-and-control architecture, which is often a best-first-mechanism for applications having sophisticate functional needs.\n\nI'm looking forward to what this project makes both safe and possible on Cardano.", "q1r": 4, "q2": "The success measures mentioned do make sense, in qualitative terms, while the objective to be able to train on larger dataset of full ImageNet does sound sensible.  Note however that this is aspirational, and it would be unsurprising if the funding to allow for that result turns out to be needed in a later fund.  As I finish reading the response to the auditability question, I feel that it should be more specific, measurable and objective.  My first intuition would be to rate 2 or 3 stars based on that response; however, when taking into account the github repo (and assuming that commits will continue to be added there)... I might rate 3.5 stars on this if I could.\n\nIt would be more interesting if the project can report out on the number of nodes joining their network, as well as images trained/tested per hour.  Enabling a scalable processing capacity of this sort is interesting, and it reminds me of SETI.", "q2r": 4, "assessor": "z_assessor_1139", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "At the PoC stage, it is hard to comment on the number of nodes. As for the images training happens locally so the speed of training entirely depends on the computing power of the node and is not AIDA's hyperparameter. Hope that helps "}, {"id": 995, "q0": "Distributed AI always makes for an interesting proposition, as does the enthusiasm for migrating such a project onto Cardano from EVM. The proposer does a good job of breaking down how they intend to go about the migration but is, in my opinion, missing an opportunity to brag about the framework they've already developed on Ethereum. Tell us a little more about what it can do currently and why voters should be excited about it making the jump over to Cardano. Remember, too, that not every Catalyst voter will be familiar with machine learning, so make the Impact section accessible to a wide audience.", "q0r": 4, "q1": "Without knowing the state of the project as it currently exists on the Ethereum blockchain, it's not entirely clear how much work needs to be done to get it running on Cardano. How far along is the framework? The roadmap laid out here gives a general idea of what needs to be done, but is missing a sense of where you're starting from. Dr. Barath's credentials are impressive, but it's not entirely clear who is working on what when it comes to the labor expenditures. I would also like to see more risk assessment, and how the team might go about navigating unexpected issues that arise during the migration process.", "q1r": 3, "q2": "The proposal provides a goal of having the model able to train and test on the full ImageNet dataset. Here again, though, it would be helpful to have a better quantitative sense of what the current AI framework is able to do. What might the specific model learning goal mentioned here be? My sense, overall, is that the project should be fairly auditable, so long as the auditors understand what you're porting over. If the plan is for it to function better on Cardano, how much of an improvement should reasonably be expected? ", "q2r": 4, "assessor": "z_assessor_1251", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "We foresee mainly Plutus issues and conceptually there is nothing stopping us from porting to Cardano, so that explains why we never delved too much into the risk assessments and are somewhat confident already!"}, {"id": 3467, "q0": "Proposal mentions AIDA system information such as four main parts or benefits of AIDA modules. This is information to help voters understand the information as well as how the project works. At the same time, the proposer also mentioned the strengths of AIDA. However, the proposer can provide more information on how to use or how AIDA works. Proposer also thought that the project would face some risks in the process and has a way to minimize that risk.", "q0r": 4, "q1": "Proposer provided a detailed timeline and plan. Proposer should arrange the jobs to be completed by rig time, or divide the work into Q2, 3, and 4/2022 for easier tracking. In addition, the proposer should provide more information related to the tasks that need to be completed as smaller jobs are carried out in each part. The budget breakdown section is pretty well written, but the proposer could write it in more detail when publishing the subtotals in the User Incentives, for example. The information related to the group members is also shared quite well by the proposer.", "q1r": 3, "q2": "The information section of Auditability is provided quite fully when giving criteria to evaluate the success or progress of a project to maintain the accuracy of the Original AI model. However, the proposer can further clarify the success of the project by giving desired numbers that the project can achieve such as the number of users.", "q2r": 5, "assessor": "z_assessor_1652", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4131, "q0": "In order to improve scalability, model security, and equity incentive mechanism for learning frameworks, The proposal team came up with the idea to create AIDA to expand on the Cardano ecosystem and improve the features. of previous learning frameworks. I believe this idea after being implemented will bring great benefits to the Cardano ecosystem community.\nThe features that the project brings have been introduced very carefully in the proposal. The Solution section is extremely detailed and the proposers have also added in-depth technical explanations. But it is a bit difficult to assess the level of impact that the Solution part of the project gives because it has not been seen who the project targets and how the project affects the potential objects.\nThe proposal has not yet clearly shown the results that the project will bring. KPIs should also be displayed with clearer content so that the viewers can evaluate the synchronization with the key metrics of the challenge. In general, the proposal should provide an overview of the project's results and set KPIs based on the Key Metrics of the challenge. The presentation should also be more specific and detailed in each phase.\nIt would seem that the challenges involved in implementing this project were insignificant and rare. However, the team has also contemplated the worst-case scenario and come up with solutions to minimize the risk when the incident occurs.", "q0r": 4, "q1": "The roadmap that the proposal offers is still quite sketchy and does not have enough information for evaluation. In this part, the proposal must clearly show the roadmap, the milestones of the plan, and what the project will deliver at the time of that roadmap or at that time. Give a realistic timeline for properly completing the given work items and further detail the technical and technological aspects required to execute the plan. The proposal will be appreciated when they show a reasonable plan not only in terms of what they will complete but also how it needs to be. Please provide more detailed information so that the community can assess whether the plan the team has put forward is consistent with the expected results.\nThe budget plan of the project is also not enough information. The presentation is still pretty sketchy. Please specify each item to invest and allocate capital appropriately. Plan in detail the expenses for each item. In which, it is necessary to determine the required number of personnel and important positions when operating the project, thereby giving a part of the budget to use for personnel salaries.\nThe project is led and implemented by experts with many years of experience in the field and in-depth expertise. The community can trust the management team to bring the project to completion and grow as expected.", "q1r": 3, "q2": "The project should provide clearer and more specific quantitative indicators so that the community can monitor and evaluate the completion of the project based on those indicators. For example, the key metrics of the challenge should be stated as the number of users that the project will attract, or the amount of traffic brought to the Cardano ecosystem through this project...Imagine. How the success of the project is specifically measured and provide that information in the proposal.\nSuccess criteria have also been proposed by the proposal. This provides the community with a picture of the project's success so that it can be regularly evaluated as the project progresses.", "q2r": 4, "assessor": "z_assessor_1709", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Yes we agree the timeline is sketchy but as you noted this is more of a research endeavor than a relatively straightforward DEX implementation  "}, {"id": 7785, "q0": "The proposal addresses the challenge very effectively and delivers a thorough plan to develop a scalable distributed AI learning framework on Cardano, with key innovations compared to existing SOTA learning frameworks. The founder plan to leverage blockchain capability to distribute the AI training model to avoid sigle point failure, achieve model transparency, and prevent model corruption. The idea is to combine the blockchain with IPFS to achievethe decentralization and distributed storage system. The only concern is the use of centralized server to store training scripts instead of IPFS or other distributed storage which could derail the whole purpose of decentralization.", "q0r": 4, "q1": "Given the information presented, it is highly likely that the proposal will be implemented successfully because deliverables, timeframe, and goals of this project are very achievable. Furthermore, the people behind the project are expert with excellent credentials. Dr Bharath Ramesh is a Senior Lecturer at Western Sydney University with research focus on blockchain technology and AI. Sam is from plutus 1st cohort who has cofounded Fetachain.io and Rerety.io. Li Chao and Shen Qiuyu are Master of Science students at National University of Singapore who has their project on AI and Blockchains co-supervised by Dr. Bharath Ramesh and Assoc Prof. Xiang Cheng. The framework has live in Ethereum network adding the likelihood of its successful implementation.\n", "q1r": 5, "q2": "The success criteria provided the proposal is reasonable and achievable that make the project feasible and realistic. The team does not provide deliverables, detailed timeline, or milestone. Team does not mention where they will publish the progress of project execution making it difficult to monitor or audit the project. With the 50k USD funding requested, my suggestion for the team is to update the proposal with more information and details including deliverables, budget breakdown, and milestone. Even with all of the flaws in the proposal, this is sure to be a very potential project that need to be voted.", "q2r": 3, "assessor": "z_assessor_643", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thanks for acknowledging the proposal's merits!  "}, {"id": 9752, "q0": "The proposal outlines an AI learning framework that are looking to deploy on the Cardano blockchain. The proposers mention they are currently on the Ethereum blockchain and are looking to migrate. Upon inspection of the repository provided there are examples of using web3 storage packages however it was not easy to find solidity code or references. Potentially this project with deployments on Ethereum is elsewhere. The proposers also do not link to where the community can use the solution they are proposing that already exists on Ethereum. This makes it difficult to understand and give any confidence towards there being a high impact for executing this proposal. In the proposal they mention other AI solutions - Microsoft's DCAI and HP's Swarm Learning frameworks. It appears that AIDA is an evolution of these efforts and as such is not a migration. It would have been good to learn about what they are taking from these projects and the key differences. They mention their solution will help with - 'Avoid Single Point Failure, Achieve Model Transparency and Prevent Model Corruption using a user Incentive Mechanism'. These may or may not be the additions or just mean reaching parity with existing solutions but on Cardano. Without more exhaustive research from the assessors side it is hard to fully gage the impact of this proposal against the challenge brief. To achieve a better score the proposer would need to be more clear on what we can use that they have delivered on Ethereum and it's level of adoption to showcase why it is something that should be migrated. This proposal is very well suited to be in a DApps & Integrations challenge which the proposers could use in the future potentially as one suggestion if the Ethereum deployment for them was not completed yet / has low adoption and doesn't represent a higher value migration project and instead can be more simply considered as a new project on Cardano.", "q0r": 3, "q1": "The proposal team provide a Github repository and also a Google scholar link with publications from one of the proposal team members Dr Bharath Ramesh. The proposal being suggested is non trivial and requires a certain level of expertise in both AI and smart contracts. There is sufficient evidence on the side of AI from the research papers and low to moderate evidence of the smart contract knowledge from the Github repository. To give a higher confidence towards the feasibility it would have been useful for the proposal team to provide more sources to their professional background such as a LinkedIn profile or similar and other repositories where they have done smart contract development. A budget and timeline have been provided which offer sufficient insight into the planning and budgeting.", "q1r": 4, "q2": "The proposers mention KPIs focussed on the accuracy of the AI models that they implement. Some useful metrics and KPIs they proposers could have mentioned is how they're Ethereum deployment is being used, what the adoption and daily/weekly usage metrics are if any and then compare this to what they may be able to achieve in a certain time frame on Cardano. Another useful set of metrics would have been to highlight the adoption of these competing solutions they mention and the market they are addressing. With this information they proposer team could have created some practical numbers for their own solution based on what they will be able to deliver and the market size they are addressing. The proposal team have provided a link to an open source repository which is a good sign this proposal can be audited that they deliver the project. The area that needs more information is how we actually know whether this proposal was successful and why a certain threshold of adoption would mean creating a positive outcome.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 4, "ne": 2, "ng": 1, "nfo": 1, "vca_o": 1, "reply": "This would not be in the DApp as there is very little known about each node's computing power. This is not a deterministic implementation in that sense. Think crowd sourcing! The practicality of AIDA is the model accuracy as emphasized in multiple places"}], "solution": "We develop AIDA, a scalable distributed AI learning framework on Cardano, with key innovations compared to existing SOTA learning frameworks", "experience": "Dr Bharath Ramesh is a Senior Lecturer at Western Sydney University. His research aims to develop low-latency AI systems with solid grounding in vision and perception theory. His current interests are to combine the security of blockchain technology with the capabilities of AI. "}