{"id": 405010, "author": "cardano4climate", "title": "The Impact Migration", "url": "https://cardano.ideascale.com/a/dtd/405010-48088", "category": 26448, "amount": 24100, "description": "For projects that want to migrate, they need to have information, support and direction by the community for a more efficient onboarding", "f6_no_assessments": 9, "f6_rating": 3.814814814814815, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal does not address the Challenge [The Great Migration (from Ethereum)] well enough. It tries to address it in a more indirect way, by tackling a supposed general information vacuum surrounding Cardano/Catalyst.  \nThe real barrier for migration might be of a technical nature. \nEffectively, the proposers suggest that the Migration can be facilitated if the Ethereum projects \"have information, support and direction by the [Cardano] community for a more efficient onboarding\". While, I do not dispute that these three components are important, I think that this proposing team did not tackle the main gist of the Challenge sufficiently well. \nThe Challenge even specifies that the metrics can be improved by \"funding projects that directly deploy something, or projects that help build tooling to make it easier to deploy\". This is not part of this proposal. \nThe challenge has a metric: \"Number of projects that migrate\" and \"Number of users of these smart contracts once migrated to the Cardano ecosystem\"\nThis proposal does envisage helping an estimated 20 potential projects, but does not specify that these are projects \"that migrate\". It may seem a detail, but its a crucial detail for this challenge. \nHelping to overcome the technical difficulties of transfering from ETH to Cardano is not directly addressed. \nThe challenge itself specifies that many technical solutions are being deployed to accomplish this Migration such as KEVM, IELE, ERC20 Converter and Milkomeda to name a few. The team behind this proposal does not claim to have knowledge of these bridge solutions. \nThese projects - KEVM, IELE, ERC20 Converter and Milkomeda - are key for transfering technical projects from Ethereum  to Cardano and any team that proposes to \"provide information, support and direction\" - would benefit from in-depth familiarity with KEVM, IELE, ERC20 Converter and Milkomeda - IN ADDITION to being familiar with Cardano's general inbuilt advantages (PoS, energy efficiency, Catalyst etc.). \nWithout Solidity and Plutus experts and detailed familiarity with the technical transfer from an EVM-based blockchain, I see only limited benefit from general information, support and direction by the [Cardano] community. My assessment is that the impact will be limited, as the proposal currently stands. \nThe team does specify that it will guide newcomers through available solutions - however I didn't see the technical capacity inside this proposal and relying for this support on \"coordination with IOG tech teams\" seems a suboptimal solution, for a proposal in this challenge.  \n", "q0r": 2, "q1": "I think that this proposal as it currently stands - from afar appears to be feasible but this is partly due to its vagueness in some aspects, making it partly feasible through lack of specificity.  \nThe team has proven competencies regarding the types of general deliverables that it intends to provide. The general idea is to research and develop a model to onboard newcomers and evaluate what makes a a successful onboarding process. \nThe proposal has a realistic timetable and I think the budget breakdown is acceptable. I question the estimate of 20 potential projects listed in the budget: \"USD 19780 for estimated over 20 potential projects represent less than USD1000 per project\" \nWhere did this estimate come from and what is a \"potential project? \nThe proposal lists a lot of activities geared towards \"New members\". The proposal also states that it wants to \"use the Cardano4Climate community, network to the catalyst & Cardano ecosystem, and projects in order to build a model for onboarding new members through a catalyst active community.\"\nA weakness - in my eyes - is that \"New Members\" is effectively an undefined category that seems like an umbrella grouping that encompasses \"newcomers\". By addressing \"New Members\" I see a danger that the proposal's criteria for \"members\"/\"projects\"/\"newcomers\" are very loose. It seems this gives the proposer freedom to classify anyone in this category of \"New Member\". I am not suggesting that this is the intention of the proposer, but this vague language has left too much room for interpretation. \nWhat is a New Member? A project that has definitely decided to migrate to Cardano from Ethereum and is making the transfer? Or is it a project that explores the possibility of migrating? Or is it a single ETH developer interested in the Cardano ecosystem and a new member of Catalyst, but not building anything on Cardano? Many possibilities spring to mind. \nThe project has a goal is onboarding at least one project per month - however, many projects are being onboarded into Cardano at the moment. Does this mean a project from another blockchain? A project that is migrating or \"just visiting the onboarding sessions\"?\nIf the proposal is resubmitted in a future fund, I think the plan could be more ambitious and daring, by actively searching for EVM-based projects and addressing/targetting them directly, even before they consider a move. \nThis proposal starts from a new members (again - what is a new member?) survey - which supposedly means that it targets projects that have decided to make the leap or are toying with the idea... \"Understand how they got to Cardano, Catalyst and Cardano4Climate.\" Maybe a survey of Ethereum projects not wishing to migrate would be equally useful? \nIf this proposal is not voted in, I would suggest to the team to identify potential candidate projects in other blockchain ecosystems and to develop a pitch and to approach them directly. Also possibly publish criteria how would you approach and convince an EVM-based project to migrate, which might be a complementary approach to waiting for newcomers to arrive. \nThe proposing team has a lot of members with non-blockchain developer/technical capacity, but would probably benefit from having the technical know-how to support Ethereum Developers (account based blockchain model) in order to transfer to a eUXTO-based transaction model on Cardano. \n", "q1r": 3, "q2": "This project is on the surface seemingly easily auditable, but improvements could be suggested to make the auditability better and the result clearer - the clarity seems to be fuzzy. Usually imprecise language seemingly allows for a big picture auditability, but the end result may prove to be too blurry to benefit Cardano. \nThe team proposes to deliver a knowledge center with research, docs, ppt focus on the Great Migration. This seems to vague, in my opinion. I would like to know what will exactly be delivered in the Deliverables and KPis - for the funding. \"Research, docs, ppts\" - is simply listing words that have no specific weight. \nPromotional materials - is also something that I see as a very generic deliverable and seems to be lacking in auditability. Anything can be deemed a \"Promotional material\". \nThe 24 \"one on one meetings with projects\" would probably be better and easier to audit if we could know what classifies as a \"project\" for the purposes of this proposal. Why not publish the names of some projects that you see as candidates for this proposal, right now?\nIn general, I would advise a more coherent vision, a tighter ship and a better focus on ensuring Migration of specific projects. \nIf this proposal were to facilitate the definite Migration of five existing EVM projects to Cardano - that would be a success. \nI am not sure what does \"The goal is onboarding at least one project per month\" mean? What is onboarding specifically?  Is it a project that has definitely migrated to Cardano, or a project that was a newcomer to Cardano before this proposal and attends the sessions with the proposers? Or is it a project that has gone through the Meetups & session management (regardless of the end outcome/migration). \nThe problem statement starts from a point of view that addresses projects that want to migrate \"For projects that want to migrate, they need to have information, support and direction by the community for a more efficient onboarding\". However, projects that want to migrate have probably made the decision already. \nHence, I would advise the proposers to think about expanding the problem statement to additionally address those projects that haven't considered the move yet - in case the proposal is not funded in this Fund. Attracting \"non-newcomers\" to make the leap, might be an even greater prize. \nThe commitment to transparency is laudable and the availability of communication channels is excellent. The presence in Catalyst is exemplary and the recording of meetings and educational support seems commendable. \n", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "On one hand, this proposer is correct that projects and users migrating from Ethereum to Cardano will need \"information, support and direction\" from active community members. However this proposal is very generalist, and in my view doesn't focus sufficiently on the challenges specific to moving projects from Ethereum to Cardano. They do touch on this key element of this challenge somewhat in the \"risks\" section, however I would've liked to see a greater focus on the specific challenges of compelling projects from the EVM to demonstrate an understanding on what sets this mission apart from simply onboarding new users.", "q0r": 3, "q1": "There's reason for hope here. This proposal is organized by what are clearly highly engaged and dedicated community members with a track record of achievement in Catalyst and Cardano. Also, the requested funds is only about 4% of the total budget for this challenge, so the ask isn't enormous. \n\nAs noted elsewhere in this assessment, I worry some that sufficient attention might not be paid specifically to the challenges of compelling EVM-based projects to deploy instead on Cardano as this important, distinguishing factor is not mentioned anywhere in the listed budget or team description. As such, I'm awarding the four-star ranking here with hesitation. ", "q1r": 4, "q2": "Of the metrics that this proposal provides, I believe one has an importance above all else: \"Connecting with 10s of projects and onboarding at least one per month.\"\n\nIf this is accomplished, then I believe the project is a success, and the proposers (if funded) should make a point to record and highlight progress on this front, onboarding projects *from Ethereum*. I believe this is the only really, clearly, auditable metric, which means this proposal just barely earned a 4-star ranking. ", "q2r": 4, "assessor": "z_assessor_1275", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The Impact migration proposal focuses on supporting easy onboarding for newcomers (from ETH). They coordinate knowledge sharing events (media channels, info-sharing and meetups). The proposal has the direct impact towards Cardano ecosystem as the first step is always the hardest and they make the onboarding not so daunting for newcomers. They have considered various risk in migration and specify how they can mitigate those risks. It will improve the proposal if they could mention about the content that they plan to include in educational material.", "q0r": 4, "q1": "They have partnered with various communities within Cardano ie. Climate Neutral Cradano SPO group, DLT360, WADA, SWARM, Catalyst school, SustainableADA. They have hosted \"Catalyst Sustainability goal\" in the last 4 months. The deliverables are clear and impactful and they will provide one-on-one to members. The budget breakdown includes rate per hour and for the project period of 6 months which seems far more possible to realize the impact compared to other durations. The 6 core team members are well known in Catalyst community and should be able to deliver this project successfully. However, they should include online profile of team members for easy reference. It is good that they describe each team member in short context but in this challenge it might be suitable to convince people they have the technical ability to onboard newcomers.  ", "q1r": 4, "q2": "The problem, solution and the proposal are well aligned. The roadmap and the deliverables are combined which make auditing the proposal easier.  The deliverables will be communicated at their main social media channels (Telegram, Discord, GitHub, Twitter). They also will report in weekly townhall meetings. I agree with the Impact migration solution respond to the call in this migration challenge. The team has been very active within the community. Their proposal is a continuation of their ongoing work for the next 6 months. Their coordination has not gone unnoticed and will clearly have an impact to Catalyst community.", "q2r": 4, "assessor": "z_assessor_1358", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "All reviews for Impact and Auditability are positive so not clear why 4 stars and not 5."}, {"q0": "As climate challenge is a global phenomenon, having the c4c as an engagement framework to onboard people from web2 world an other crypto domains is a strong value proposition for cardano community. ", "q0r": 5, "q1": "Team experience - very strong, Costs - Very Fair (given the leverage gained from the c4c movement globally). Plan - very effective : As a telegram participant of c4c, I have experienced the engagement from core team members as I on-boarded a few weeks back, a very pleasant and also an empowering  experience. Team's weekly sessions are bringing the core needs as well as engaging new teams to present and share their stories, and to move forward to project catalyst ideation phase. Team enables like minded partnerships in plastics pollution or tree planting or greening cardano initiatives, and similar ideas. Monthly forums are also powerful and shared in the youtube channel.  ", "q1r": 5, "q2": "Team's meetings and forums are available online. Team members growth is being tracked along with number of projects onboarded. This is also empowered through various catalyst projects in littlefish foundation. Growing member base, views on c4c channel videos, onboarded members/projects are KPIs which are clearly available and hence auditable.", "q2r": 5, "assessor": "z_assessor_1461", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This proposal’s idea is using the Cardano4Climate community, network to the catalyst & Cardano ecosystem, and projects in order to build a model for onboarding new members through a catalyst active community and this community’s purpose is to welcome, connect, and support projects that wish to migrate or expend on Cardano. The idea has been described quite clearly and it has shown that it has its own value to benefit Cardano. The team has already start some part of the project on Telegram and Discord, and it shows that we have something to look out for a success of this project. We can see how this solution can address the challenge and understand why it’s important. The problem statement is easy to understand and if implemented successfully, is going to be a big help for a lot of newcomers who want to learn about Cardano and have a smooth move from Ethereum to Cardano if they wish to do so. This proposal, in my opinion will have a good potential to improve the Cardano network strength and also aligns with the goal of Cardano, that is to have an equal opportunities world going forward. Hence, I strongly agree that this project aligns with the challenge. ", "q0r": 5, "q1": "In term of feasibility, the team has shown that they have enough talents with a suitable set of skills and experiences to run this project. It’s an ongoing community and has so much room still to develop from there. With the good partnership the team has built with other Cardano community, I have no doubt about their abilities in this project. Besides that, a roadmap and some milestones have been provided. To be fair, it can be done a lot more detailed but overall, the plan follows very closely with the whole idea of the project. The budget breakdown is very clear, there’s almost no question i have about it if I’m being honest. It covers pretty much every step of the project and seems to be very reasonable. However, to make it better, I think there should be a separate idea for short term and long term plan, I want to see where this project is leading to after achieve those current tasks and the idea to keep this community keeps going strong after time. ", "q1r": 4, "q2": "For anyone who wishes to follow up with this project, the team has it all covered for you. You can easily follow and be a part of the community on all of the public media channel. However, there is not a clear key metrics here and it might be a problem when it comes to auditing the project and to make sure that it’s being effectively run. The team has not set any concrete number that they aim to reach after a certain amount of time and project to define the popularity and success of the project. Thus, I encourage the proposer to find some KPIs that can help the Cardano Community audit the project in the future and we can all see the long term engagement with Cardano of the project. ", "q2r": 3, "assessor": "z_assessor_1703", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal introduces the idea of using Cardano 4Climate connected with the Cardano ecosystem to build a model for onboarding new members through a catalyst active community. Through two groups of telegram and discord, they will prepare knowledge about Cardano for the community.\n\nBut the main job is to build models for newcomers\nThey take 3 months to gather information on newcomers to see how these people know about Cardano and about their area of interest and availability to dedicate to the ecosystem. Based on that information, they will take appropriate actions to develop a successful onboarding process\n\nThey will create an active community that provides all the necessary knowledge and dedicated guidance for newcomers. This will facilitate the interest and onboarding of new projects.\n\nThe team presents the risks that will be encountered as the outside community will be less aware of Cardano than other block chains; community development will be beyond capacity;...etc. But they all offered the most satisfactory solution.\n\n\n\nThis project they have been working on with meetings and they have hosted several Project Catalyst after town hall breakout rooms. They also have partnered with other Catalyst communities to collaborate.\n", "q0r": 5, "q1": "The lay out the work they have done in full detail to grow the number of members and create a platform for collaboration and interaction. They also have additional KPIs to measure project progress.\n\nAs for the cost, they give specific numbers along with the time and duration of the work in a clear and detailed manner.\n\nTheir team has people with team social skills suitable for building community projects. I have a small suggestion that if possible, the group provides a link to specific personal information such as LinkedIn or a website so that we can see how each person works on the community project.\n", "q1r": 4, "q2": "Currently, the team is developing the community on many platforms, so the ability to build projects is quite promising.\n\nThis project when successful will help build a better knowledge base for the community, and Ethereum based projects understand how the Cardano ecosystem helps them.", "q2r": 5, "assessor": "z_assessor_1784", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "At first reading I had a hard time understanding a) what does this have to do with Ethereum and b) why is Cardano4Climate proposing it. On second reading I realized what the added value in this proposal is.\n\nDeliverables are listed as “research, docs and ppt focus on the Great Migration, promotional materials, 24 sessions, 24 one on one meetings with projects with a goal of onboarding at least one project per month”. The team is essentially proposing a dedicated crew to welcome new impact-driven people and projects from Ethereum to Cardano, making sure they get the needed information, support and direction. I can see the value of onboarding new members but the bit that escapes me is why this wasn’t proposed in a challenge called “New Member Onboarding”.", "q0r": 3, "q1": "I personally like the individuals who are part of the team. They are all great people. What is common for all of them is a certain welcoming presence and warmth that is a good quality for anyone working with onboarding. However, if you are a developer coming from Ethereum to Cardano, you probably want to get a bunch of technical facts laid out for you. Not sure if these proposers are able to provide that level of understanding.\n\nThe team has included a list of prior events they have organized and some videos related to those. These just aren’t proper reference materials for an Ethereum-specific proposal. This could have been a great proposal if it was submitted in the correct challenge and if enough time and dedication was used to make it clearer.", "q1r": 3, "q2": "It feels like the proposal has been put together in haste and therefore the purpose and intent gets lost. There are a bunch of videos (one of them doesn’t work) that are only loosely related to the proposal. The budget ($19,780) doesn’t match with the sum that has been asked ($24,100). Milestones are vague, metrics are missing and the text overall could use some editing for the proposal to be more coherent.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal IMO would be better suited to \"Scale-UP Community Hubs\". The Cardano4climate team are fairly well established and have made a very good awareness in the Cardano community. But i cant see much meantioned in the proposal about migrating Ethereum users or projects to Cardano, and hence, think this proposal would be better suited to community awareness, onboarding or similar", "q0r": 1, "q1": "The team are well established, they have a good record for community interaction and have allot of experience. I dont doubt that they would continue to do good work. ", "q1r": 4, "q2": "The team have a large array of social media profiles, It would be fairly easy to gain metrics from these for new users etc. However (as stated in Addressing the challenge) I dont see this proposal focusing on migration as  much as attracting new users from the beginning directly into Cardano.", "q2r": 3, "assessor": "z_assessor_750", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "Cradano is helping everyone for betterment of tomorrow, there are multiple projects who have stopped due to lack of support and funds, Helping all the projects which are stuck and stopped due to lack of resources should be given another chance,\nAs we can see there are many programs already running to migrate ETH users and explaining them all the flaws and gas fee they are facing and bringing them to cardano community, Same way as proposer suggest there are many projects willing to migrate should be identified and listed , By providing required information to them, support , directions and funding  by cardano community will significantly increase the value of the community, and this process will create effective onboarding, \nBy using all the active members of catalyst to welcome and support all the migrants and supporting there projects who wish to migrate to cardano,\nBy developing and supporting all the projects which all are stuck with lack of resources and infrastructure will get new ideas to community, \nWith more significant new users the value of ADA community will expand vastly, \nI strongly agree  with proposer,\nWith new projects from migrants it will be very helpful for developing new technology making cardano ecosystem more sustainable Tech, Hence it will provide constant services to our Community,\nThis proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer has provided relevant work experience working in Cardano4Climate which community lead project, \nProposer also  participates in  building the Cardano Ecosystem and provide constant services to our Community, \nAs cardano became very essential blockchain to all users, as it is big chance to prove Cardano is the leading in philosophy, technology, and initiatives that support the growing number of government initiatives, investors sentiment, and company projects aiming to “make this world better for all”.\n\nThe proposal has many challenges within how they select and identify projects,\nwelcoming newcomers will create problems initially, \nBut proposer idea of solving by educational materials, C4C Education Collaboration in telegram, newcomers sessions and using social media which is smooth process,\nthe main challenges and risk which might raise are explained and even solutions are explained perfectly, By guiding newcomers through available solutions and coordinate with IOG tech teams and onboarding them will be best part of plan,\nWith all the given  experience and plan presented it is highly likely this proposal will be successfully implemented.", "q1r": 4, "q2": "the proposer has provided there total global team members which is around 200 which is impressive, which is grown just in 6 months and divided into 8 core teams which is very professional way of handling, \n200 members is more than enough to handle   \n YouTube channel & website, \nProposer ways are great by having Open discussions,\nConsistent growth in participants,\nInitiating ideation and collaboration,\nProposal improvement interactions,\nRelevant content for Project Catalyst,\nTransparent bottom-up design.\nThere last four months record is impressive on cardano and climate change,\nthey have provided detailed plan what they will doing from week to week\nproviding materials and sessions regularly ,\nTeam members provided have quality experience working in field, Having group of everyone is great,  \nThe proposer is providing recorded proof of weekly meetups, presence  at Catalyst Townhalls in recorded ,   \nthe requested funds of 24100$ is auditable,\nThey have laid out all the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Use an active catalyst community to welcome, connect, and support projects that wish to migrate or expend on Cardano", "experience": "Cardano4Climate is a community driven project which emerged itself through engagement in Project Catalyst. We proactively participate in building the Cardano Ecosystem and provide constant services to our Community"}