{"id": 382304, "author": "volibra", "title": "Shopify Plugin: Accept Ada in Store", "url": "https://cardano.ideascale.com/a/dtd/382304-48088", "category": 26256, "amount": 35160, "description": "Falta de loja em Cardano para que os comerciantes aceitem o pagamento Ada em sua loja", "funded": 2, "upvotes": 389857112, "downvotes": 6758503, "votes_result": 383098609, "votes_cast": 3813, "f6_no_assessments": 17, "f6_rating": 4.7254901960784315, "videos": [], "media": [], "f6_assessments": [{"q0": "O que quer que o divirta nas teias entrelaçadas, posso lhe garantir que há um anúncio de shopify que aparecerá bem no meio dele. Ao lado deste nível de exposição o número de comerciantes atuais corretamente citado nesta proposta, então você tem uma receita para um amplo público e potencial para adoção global. Com base nestes fatos, concordo que esta proposta trata efetivamente do desafio. A construção de um plug-in de pagamento baseado no COTI para comerciantes Shopify alinha-se com a missão tanto do COTI quanto da Cardano e a intenção da proposta de 'segmentar' os comerciantes segue um caminho de sucesso potencial. Teria melhorado a proposta se este aspecto do projeto fosse explicado com mais detalhes, ou seja, como o sistema de pagamento do COTI será comercializado e a quem será direcionado e porque este mercado alvo em particular é fundamental. Shopify já suporta uma série de plug-ins de pagamento diferentes, portanto, uma imagem mais clara sobre como este desenvolvimento vai alcançar o sucesso é um bônus.", "q0r": 5, "q1": "Há apresentações claras de cada um dos membros da equipe de boa fé e estas são apoiadas tanto por perfis interligados quanto por githubs. Há também o website volibra, que tomei como um resumo de trabalhos recentes. Em minha vida anterior como assessor de concursos para uma universidade, os elementos necessários para validar as capacidades dos membros da equipe e suas experiências estão bem representados. O valor solicitado também é aceitável para um desenvolvimento rápido como este. Entretanto, sendo \"rápido\" a palavra operacional, acredito que o tempo apresentado parece longo demais, especialmente para uma equipe com formação em Plutus, em dev e particularmente em projetos de processamento de pagamentos, daí a pontuação imperfeita. Se existem elementos de construção interna de Cardano/COTI que poderiam atrasar o desenvolvimento do plug in, por exemplo, a implantação do DJED, nenhum deles é mencionado. E, nesse sentido, esta proposta seria muito melhorada se fossem incluídos comentários com relação aos impactos de desenvolvimentos externos dos quais este plug-in pode estar dependente.", "q1r": 4, "q2": "Como mencionado, em meus anos de avaliação de propostas para uma universidade, esta proposta tem todos os elementos que me incentivarão a permitir que ela passe para a próxima etapa. Cada membro da equipe é apresentado com suas qualificações, as experiências recentes do dev estão de acordo com o que é proposto para ser construído, e os cronogramas do projeto divididos em meses com custos de recursos calculados em horas, tudo isso proporciona confiança para o sucesso potencial e boa auditabilidade ao longo do caminho. Apesar de meus comentários de que isto talvez pudesse ser completado na metade do cronograma apresentado, o valor em dólares solicitado está de acordo com o esforço necessário.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 19, "ne": 13, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This is a proposal that meets the intention of the challenge by expanding the paying capabilities of COTI to a payment system such as Shopify.  This proposal effectively scales out to all COTI users.", "q0r": 5, "q1": "This team has extensive experience performing various web DevOps supporting blockchain API development and is familiar with the Cardano ecosystem.  The number of team members and dedicated resources and time allotted for the project seems sufficient to meet the milestones defined by the team.  ", "q1r": 5, "q2": "This proposal has a really good view of what success looks like as well as a breakdown of milestones, proposal fund breakdown, and timeline of development.  They clearly have a basic roadmap and deliverables from which they can track.  Based on the information they have provided this proposal appears to have audibility and transparency in the development of the project.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 23, "ne": 2, "ng": 19, "nfo": 2, "vca_o": 1}, {"q0": "Relation to personal qualifications: Since I am actively observing the general crypto space since several years and also the projects in Project Catalyst, I have a certain understanding of what opportunities the sector has to offer and what applications could provide added value to the community. In addition to this I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal matches the challenge well and it is clear the proposer has properly read the challenge and knows their way around the topic. Their proposal will without a doubt add quite some value to the Cardano ecosystem. The key metrics and goals of the proposal perfectly align with the outlined challenge settings.\r\nFrom it's makeup, the proposal is potentially is able to scale to address future challenges.", "q0r": 5, "q1": "The proposers are very transparent about their background and seem competent and up to the task. They provide extensive documentation of their qualifications. It is highly likely they are up to the challenge The budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic and detailed schedule to complete the work.\r\nThe proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how.\r\nThe resources necessary to implement the proposal are described. The only critiques in my opinion are that no plan for risks in implementation or for lack of funding are presented, and that technical aspects are not gone into deeper. Feedback: Do a bit of risk assessments for potential problems in your implementation, and explain some of the technical background, and you'll have a perfect proposal.", "q1r": 4, "q2": " There is a detailed roadmap with many, comprehensible milestones and a time horizon for achievement.\r\nThe success Metrics that define the success of the proposal are clear and auditable.\r\nA Clear understandable description of the targeted problem is presented and a clearly defined, comprehnsible, fine-rained solution is presented to adress the problem. A perfect example for an auditable proposal. Well done!", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 10, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "Having the ability to pay in ADA via Shopify would not only be incredibly useful, but would also be a great step towards bringing Cardano into the mainstream. Creating this integration fits the challenge perfectly.", "q0r": 5, "q1": "This team of developers is greatly experienced. Additionally, the proposal has a project roadmap, budget breakdown and success measures. This shows the team is detail oriented and has carefully planned this project.", "q1r": 5, "q2": "The budget breakdown, success measures, and project roadmap are instrumental information for auditing the success and progress of this proposal. All of the necessary information to audit the success.", "q2r": 5, "assessor": "z_assessor_893", "no_vca": 16, "ne": 3, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal addresses the challenge as it pave the way for merchants using Shopify to accept ADA Payments with seamless integration by adding a plug-in into their site. ", "q0r": 5, "q1": "This proposal is well written and in-charge by a capable team. All the development plan, budget, team and timeline are listed. The only thing I concern in its feasibility is that the rate for team doing UX Research, UI Design, Development, Testing (all of them $70-$80/ hour) are way higher than the market - which makes the total amount of the proposal exceeds one third of this challenge budget. ", "q1r": 4, "q2": "The proposal provides quite enough information for me to assess its auditability. It would be better if key metrics to success can be more specific. ", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "The proposal addresses the challenge very effectively and delivers \r\na Shopify plugin with COTI Integration that allows merchants to accept ADA payment seamlessly and safely, so it fits the challenge's goals completely as well as is going to add value to the Cardano system clearly.\r\nThe key metrics are listed so clearly and quite align with the outlined challenge settings.\r\nAs the time when I clicked into 'volibra.com' I saw some hyperlinks which not yet completed (lead me to nowhere) (such as 'Regulations and compliance enabled offchain settlement' or 'Simple P2P Exchange for Cardano Currencies') but I think the team will definitely coomplete that so soon.", "q0r": 5, "q1": "The proposers provide the url and the website is up and running, as well as links of team members' profiles to state their relevant skills and experience needed to implement the proposal.\r\nThe budget is clearly and broken down into identifiable items. The budget is also reasonable to achieve the set goals. I recommend the proposers should consider challenge and risks relevant to the success of implementation.  I would like to see more details about how to do in the project plan. In summary, I rate feasibility with a score of 4.", "q1r": 4, "q2": "The proposal has metrics that define clearly its success as well as roadmap with milestones for achievement and clear understandable description of the targeted problem. I believe the progress and the success of the proposal is easy to be audited.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "An ADApay plugin for shopify certainly meets the requirments of the challenge. The connection to an African p2p trading platform seems to fit within the Cardano/Catalyst vision. ", "q0r": 5, "q1": "The listed experience of the team is relevant to the project at hand. I wish they could have provided a more technical discussion of the architecture of the plugin as some other proposers have provided. ", "q1r": 4, "q2": "The budget is broken down, and a detailed roadmap, with a definition of what success looks like is provided. These should help greatly when auditing the ROI of the project. ", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "The Shopify plugin address the COTI challenge by providing the plugin (Shopify integration) that will allow merchants to accept seamless and safely ADA payment. It fits into the challenge by focusing one platform but it is one of the top 5 so the technical aspect should be transferable to be applied to other platforms. ", "q0r": 5, "q1": "The team members possess strong technical skill in Plutus development, UI/UX design, web and mobile development, etc. and also work on innovative projects on Cardano. The budget is reasonable enough for the total amount that will be spent on the project. ", "q1r": 5, "q2": "The project provides the timeline and budget in detail. The information of which give voters absolute confidence and the ability to track fund flow with the project progress. It would get full score if it would mention on the risk and challenges for the successful implementation. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposers concentrated on one platform - Shopify which seems to be a good approach. \r\nThe project effectively addresses the given challenge as a result of its execution there will be a completely new ADA payment plugin, easy to integrate into Shopify enabling 1.7M users to enter a new payment channel.", "q0r": 5, "q1": "There is no doubt that the presented - each member of the team - experience, allows having the project done. \r\nWhat is more, the above plan shows the understanding of the production process and the possible challenges on the road.\r\nThe proposers - as shown in the comments section - are open to the opinions of the proposal readers and in future - users' requests, and very likely will quickly respond to them. \r\nI", "q1r": 5, "q2": "The introduced plan and especially its part concerning progress and the success auditing is very detailed and leaves no gaps.\r\nThe proposers responded to the community requests (in comments) and showed clear success metrics on each step and timeframe.\r\nSo, the evaluation of the progress and success in the future execution of the project seems to be strict and easy.\r\n", "q2r": 5, "assessor": "z_assessor_527", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This proposal fits perfectly with the challenge, the implementation of payments with cardan stablecoins is absolutely necessary.", "q0r": 5, "q1": "Both the proposal and the team are very detailed, I see a great working group with experience and knowledge behind, and a well developed plan where we are clear about the stages and the development of the plugin, so I think you will have no problem to implement this tool in Shopify.", "q1r": 5, "q2": "The plan presents concise audit metrics such as their KPIs and their vision of success, it should also be clarified that the development of a plugin and implementation, does not have to have a dynamic audit after its development, I think what they have presented is very well to audit the progress and subsequent implementation.", "q2r": 5, "assessor": "z_assessor_511", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "Proposal identifies the need for existing payment solutions like shopify integration and mentions the value it will ad to the Cardano ecosystem by onboarding shopify merchants. The metrics focused on shopify align with challenge and is able to scale to address future settings. ", "q0r": 5, "q1": "Relevant skills and team has been provided with github/LinkedIn pages. Budget is reasonable and broken down into identifiable items. Timetable seems realistic and shows what is being done, but it lacks details on how it is being done. Providing more details about the architecture and languages used to build this will give the reader a glimpse of your expertise and knowledge in the respective fields. Showing that you have considered risks/challenges and that you have a plan to address them will also reveal the level of commitment you have to this project.", "q1r": 3, "q2": "Clear roadmap with milestones and time horizon has been provided. KPIs have also been provided, although a few extra ones come to mind. They could also ad public testnet participation as KPI. The more KPIs you have the easier and clearer it is to measure your projects performance. The shopify integration problem they are trying to solve is clear and the solution they offer is a shopify app for merchants to install.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 23, "ne": 5, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "Adopting ADA payments on Shopify would allow hundreds of ecommerce merchants that use it to accept electronic payments. So I think working with COTI for this development is totally in line with what the challenge aims to achieve.", "q0r": 5, "q1": "The plan and development of the platform is simple, it is not complicated what they intend, they have a team with experience in the field and present a detailed development plan.", "q1r": 5, "q2": "The proposal has a good vision of what it wants to achieve, as well as a periodic development plan. I don't give it 5 stars because I always consider that metrics to measure success and impact on usage such as KPIs are critical to have more accurate and daily information.", "q2r": 4, "assessor": "z_assessor_498", "no_vca": 19, "ne": 1, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "It's in alignment with the challenge. The proposers are developing a payment system integrated into Shopify", "q0r": 5, "q1": "This proposal may be successful based on the information provided and the team behind it formed by experienced Tech people.\r\nThe budget, the plan and time frame are reasonable, but the only thing is that as a technical creation tool, it'll need a test period to make sure it's working as planned.", "q1r": 5, "q2": "I would like to read something about how will the community follow the progress before the release, and also the challenges to be faced by such a project.\r\nBut it's clear the way the proposal is presented.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely Lack of Cardano-based shopify extension for merchants to accept Ada payment in their store\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief to design A Shopify plugin with COTI Integration that allows merchants to accept payments in Ada seamlessly and safely\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating such a solution\r\n \r\n  Key metrics  would be  number of users, no of wallets, no of fiat transactions, no of ADA transactions.\r\n \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more businesses who use the same solution\r\n\r\nThis project will have a positive impact on Cardano system by enabling small businesses to get on board.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country including payment gateway containing sites. \r\n \r\n\r\n", "q0r": 5, "q1": "\r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  required skills. \r\n  \r\n The links are sufficient. \r\n \r\nI have visited these links  \r\n  \r\n \r\nThe proposers are well experienced and competent to do the project\r\n \r\n The type and number of team members required to implement the proposal is stated.\r\n \r\n \r\nThe team structure is listed and experienced.\r\n \r\n \r\n The budget has been given in detail. \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are described.   \r\n  \r\nThe proposal has technical aspects which have been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   \r\n", "q1r": 5, "q2": " \r\nThere is a roadmap with milestones  \r\n\r\n \r\n There are  Metrics such of number of users, no of wallets, no of transactions, time taken, amount of fees saved, amount of time saved on each transaction.\r\n   \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties.  \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 21, "ne": 6, "ng": 6, "nfo": 9, "vca_o": 1}, {"q0": "I strongly agree that this proposal fits in quite well with the challenge settings. The solution proposed by the proposer is in align with integration with atleast one large ecommerce providers and team here is targeting shopify.\r\n\r\nThe building of scalable, easy to use plugin is the most important requirement for this  plugin development. The team also mentions that they want to make use of Cardano based stable coins e.g. Djed for payments via this plugin.\r\n\r\nIn my opinion this is quite an interesting way and important because one of the biggest concerns that non crypto user/business owners will have is of the volatility on prices. Stable coins are meant to provide that confidence and i am pretty sure that an algorithmic backed stable coin like Djed will be ideal for such a plugin solution. \r\n", "q0r": 5, "q1": "I will cover this in two parts, first comes the experience.\r\n\r\nThe team for this proposal is very well experienced and has good share of GitHub Activity with lot of commit history and contributions to open source community. So as a developer myself, from technical stand point i have no concern on successful implementation of this proposal.\r\n\r\nSecondly, the plan presented here is split well into roadmap/milestones. This also is supported by the fact that the team here knows what they need to do in order to achieve those milestones.\r\n\r\n However, my concern is a little bit on the high budget asked for this. In my opinion, I feel that the Development efforts for such a plugin (if require 282 hours, then this should be supported by more detailed description with what challenges they think exist in order to support this development ??). The team is quite well experienced, and if coti API is gonna take all the load and deal with scalability issues, then what is left is precisely the business logic and UI implementation. The budget asked for is like 35% of the total challenge allocation, and the number of integrations possible is only 1 platform, which is shopify.  Therefore, i see some room for improvements with the proposal writeup hence taking away one point\r\n\r\n", "q1r": 4, "q2": "I agree that the information provided here is sufficient to audit the progress and success of this proposal.\r\n\r\nThe team has given the success criterion, based on the progress in 3-6-12 months. The milestones, therefore, can be tracked well by the community. The roadmap, in terms of what to expect by end of which month in 2022, gives a good confidence to community on expertise of the team. \r\n\r\nI can see some typos in write up perhaps, or may be i can not understand what \"Add Internalisation\" means.? Since i am a developer myself, i believe it means Internationalization (different language support ??). Additionally, i think overall would have been nice if team also presented ideas on QA (quality assurance)/user feedback as it is critical part of this challenge settings. After 12 months, it is written that 100k transaction is done (how success looks like) but what is not mentioned is the plan from the team to have good QA/user feedback on initial implementations. \r\n\r\nOverall, a well written proposal but with some room for improvements.", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The challenge fit chosen is to make provision for all small and medium enterprises currently using platform beingShopify to readily accept ADA Payments. and the solution as suggested from the challenge set being setting up a plugin for shopify for easy to adapt setup to accept ADA as payment correctly addressses the requirement. Also the plan for releasing a full fledged plugin with well designed and adaptable UI?UX boosts the same purpose.", "q0r": 5, "q1": "The team mentioned being \"Volibra\" has good numbers of experienced developers including well versed Lead and full stack developer who have exposure to plutus smart contract development and blockchain payment system. This team combined with experienced Product designer for both web and Mobile platforms adds to their requirement to deliver the project successfully as mentioned in the plan and timeline. ", "q1r": 5, "q2": "The proposal has requested for a decent amount of funding for successfully creating the plugin and they have mentioned well defined timeline. They have also mentioned the success parameters with respect to timeline. They have also provided detailed funcd request breakdown and individual phase details, so these parameter suffices to audit the progress and success of the delivery of the proposal", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 23, "ne": 6, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "Shopify is certainly one of the largest platforms for ecommerce for small enterprises. Their plugin system does allow for this exact style of operation, and as such, this is an excellent method for addressing the challenge presented.", "q0r": 5, "q1": "The team does appear to have the credentials necessary to meet this proposal's goals, and the work that they propose to do appears to be within the scope of their talents.", "q1r": 5, "q2": "I do believe that we will be able to successfully determine the progress with this team.", "q2r": 5, "assessor": "z_assessor_899", "no_vca": 19, "ne": 2, "ng": 8, "nfo": 9, "vca_o": 1}], "solution": "Um plugin Shopify com integração COTI que permite aos comerciantes aceitarem pagamentos em Ada de forma transparente e segura", "experience": "Uma equipe de desenvolvedores Plutus, UI/UX Design, Mobile e Web Software Developers trabalhando em novos projetos Cardano Inovações"}