{"id": 383498, "author": "johnathan.lopez.a", "title": "WebApp: NodeJs COTI:ADA PaymentApp", "url": "https://cardano.ideascale.com/a/dtd/383498-48088", "category": 26256, "amount": 45000, "description": "Desenvolvimento de um aplicativo que ajuda a integrar em tempo real com o COTI-ADA Pay API. Isto torna efetivo o ADA de envio/recepção de WebApps & API.", "funded": 1, "upvotes": 117747188, "downvotes": 9795771, "votes_result": 107951417, "votes_cast": 991, "f6_no_assessments": 13, "f6_rating": 4.0256410256410255, "videos": [], "media": [], "f6_assessments": [{"q0": "This project effectively addresses the challenges in this fund.  It aims to develop a web app that utilizes the ADA Pay API and create a REST API for integration with 3rd party commerce sites.  The scope of the proposal does extend slightly beyond the challenge requests by aiming to develop a stakepool to support further efforts, but this will help scalability of the project through SPO efforts.", "q0r": 4, "q1": "The team has the relevant experience to work on a project of this scope with firm background in programming, fintech experience and general Cardano ecosystem knowledge.  There is a breakdown of the spend for the funds requested and a rough timeline w/ milestones that are hoped to achieve.", "q1r": 5, "q2": "The auditability of the spend is visible, but the timeline and milestones are a little vague and could be a little more descriptive or definitive.  This would help give the project some more transparency in terms of the development schedule.", "q2r": 4, "assessor": "z_assessor_13", "no_vca": 20, "ne": 3, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "Proposal effectively addresses challenge by onboarding ecommerce applications and milestones align with Challenge setting. It identifies the need for payment integration and if implemented successfully it should scale well as it will be a NodeJs App and highly compatible with already built ecommerce sites.", "q0r": 5, "q1": "Evidence of relevant skills have been provided . Budget is broken down into identifiable items and seems reasonable to complete the project. The plan clearly explains how current payment systems work and how it will build and integrate into existing systems. They also mention the risk of not receiving support from WooCommerce when using their plugin. The timeframe to complete this project seems reasonable. They explain the necessary resources needed to build this with details like API integration. ", "q1r": 5, "q2": "A roadmap with milestones have been provided, but little to no KPIs. The 50+ successful transactions on testnet is a good KPI and some of the milestones can be considered KPIs, but it would be great to have more data to compare and measure performance of this project. They understand the problem of getting ADA payments on ecommerce and they know how to solve it. Good proposal overall.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 24, "ne": 5, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "This is a good proposal, with valuable ideas and intentions in it but that lacks a few important aspects. The objectives stated are aligned with the challenge settings and are addressed within the solution. However, not all explanations are complete enough to answer the most important questions. For example, how much user friendly the solution will be or how easy it will be to integrate with e-commerce platforms is not deeply discussed. Also, I felt that some key metrics were missing. The number of platforms that can be integrated, the ratio of transactions completed to total transactions and the total reach of the product are not mentioned and are very important to assess the impact of the project. There probably is some value to be added to the Cardano environment with this proposal but it is not that well-articulated in the document.", "q0r": 3, "q1": "Enough evidence was given to support the skills and experience the team have in order to implement this proposal. The budget is broken down into identifiable items and the estimated costs are reasonable (even though they seem to add up to a slightly different value in total to the amount requested). The roadmap of the project is reasonable even though clear dates were not given, only the durations of the stages. Also, what is being done in each phase of the workflow is lucidly described, which is quite positive. However, the plan lacks the consideration of challenges and potential risks to a successful implementation. Additionally, some thoughts on what could be done if additional funding is necessary would enrich the proposal.", "q1r": 4, "q2": "The information provided is sufficient to assess the progress of the project. The team has clearly stated what are the phases of the workflow and what is done in each of them. There is a clear understanding of what the problem is and what a successful solution would look like. Nonetheless more objective KPIs could have been constructed as they would help in auditing the advance of the project.", "q2r": 4, "assessor": "z_assessor_341", "no_vca": 21, "ne": 6, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "There is a clear problem breakdown and a solution provided. The proposal clearly articulates how it will add value to the cardano ecosystem in the plan overview section.", "q0r": 5, "q1": "The proposal introduces the team and provides their linkedin pages. They showcase several future usecases and in the section project workflow they provide a clear roadmap. They also explain in detail for which parts of the project they will use the funds.", "q1r": 5, "q2": "The proposal was perfect to assess it. It will be easy to check the progress of the proposal in the future since they provided all the necessary informations.", "q2r": 5, "assessor": "z_assessor_41", "no_vca": 22, "ne": 1, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "I agree that this proposal effectively addresses the challenge. The problem statement clearly describes the need for having an app that wraps up the integration with AdaPay and provides merchants on ecommerce platforms to simply use this app via typical integration mechanisms that are available on platforms such as shopfiy.\r\n\r\nHowever, for non technical voters/community members, it would have been better if the problem statement and solution is structured on a step by step basis, covering from a simplistic standpoint. e.g. a user of plugin does not really care if tech is node js or .net or java, what matters is if it works and easy to integrate. Similarly, for voters and community what matters is that they understand clearly why this solution is better than other proposed solutions to similar plugin development challenge ? \r\n\r\nNevertheless, As a senior developer myself i like the idea of using a backend application (which they propose to do in Nodejs) to keep up for the scalability issues that might arise as wide adoption happens in the future.\r\n\r\nAn overall well written proposal but because some improvements are possible, i think one point less from my side.  ", "q0r": 4, "q1": "I agree that the team behind this proposal has the right set of skill set to fulfil the plan they have presented here. The linked in links are available and both developers have the web development experience and their chosen techstack is also the same. As a developer myself, i am sure that since they have worked with enterprise based applications, the software engineering practices are not alien to them.\r\n\r\nThe plan presented for this proposal here is quite elaborative. The proposer has given good reasonings on why they chose NodeJs to build the backplane for the webapp. The shopify integration steps and future changes presented in the attachment document present a good case that the proposer has done very good research on what needs to be done in order to implement this proposal successfully\r\n\r\nIt would, however, be nice from the team to give more detailed description on when they need what funding. The amount mentioned here does not have timelines associated with them. I am pretty sure they could split the budget distribution as their asking budget is 45% of total challenge setting.\r\n", "q1r": 4, "q2": "I agree that information provided here is sufficient to audit the progress and success of this proposal.\r\n\r\nThe project workflow presented here is split clearly in multiple stages and each stage is provided with detailed explanation. \r\n\r\nThe community will not have any issues in tracking the progress of this proposal, as proposer has clear roadmap on when what will be done. \r\n\r\nThe most important point for me is scalability and proposer has given good details on how they want to have good user feedback and keep supporting the project as more adoption occurs.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\n\r\nThe problem needing to be solved has been identified and articulated namely There is no app that helps to integrate real time with COTI-ADA Pay API\r\n\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\nIt is clear that this proposal falls within the scope of the challenge brief building an app that helps to integrate real time with COTI-ADA Pay API\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating such a solution\r\n \r\n  Key metrics  would be  number of users, no of wallets, no of fiat transactions, no of ADA transactions.\r\n \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more businesses who use the same solution\r\n\r\nThis project will have a positive impact on Cardano system by enabling small businesses to get on board.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country including payment gateway containing sites. \r\n \r\n", "q0r": 5, "q1": "\r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  required skills. \r\n  \r\n The links are sufficient. \r\n \r\nI have visited these links  \r\n  \r\n \r\nThe proposers are well experienced and competent to do the project\r\n \r\n The type and number of team members required to implement the proposal is stated.\r\n \r\n \r\nThe team structure is listed and experienced.\r\n \r\n \r\n The budget has been given in detail. \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\n \r\nTheres a realistic timetable  to complete the work\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\n\r\nResources  necessary to implement the proposal are described.   \r\n  \r\nThe proposal has technical aspects which have been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   \r\n", "q1r": 5, "q2": " \r\nThere is a roadmap with milestones  \r\n\r\n \r\n There are  Metrics such of number of users, no of wallets, no of transactions, time taken, amount of fees saved, amount of time saved on each transaction.\r\n   \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties. \r\n \r\nAre there contingency plans in place for various outcomes?\r\n \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 21, "ne": 4, "ng": 7, "nfo": 10, "vca_o": 1}, {"q0": "Looking at the proposal I can see the team knows has the knowledge of what they are proposing. Great idea to start with a payment app that is not bound to a single e-comm. The proposal aligns with the outlined challenge settings.", "q0r": 4, "q1": "About the team, I have no suspicion that they are unqualified for this proposal. The experience they already have in banking apps secures any mistrust you should have. I really appreciate the R&D face in the project workflow, something that is usually missing in a lot of proposals. This is a key step for any project. One thing I have a concern about is the budget breakdown. The team asks for funding of 45.000 but in the breakdown, we come 5000 short. Where is the extra money needed for? One thing that could be the case is the contract with cloud servers since it is 5000/year but in the roadmap, you only talk about one year. Another could be the 6.6% of the budget that is being allocated to create a stake pool but that is not 5000.", "q1r": 3, "q2": "Workflow of the project gives the sufficient amount of information needed to assess the progress of this proposal. What could've made this proposal solid is including some KPI's, these are missing here and are a great asset towards auditability. Think about what KPI you guys want so that performance of the Payment app could be assessed.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 18, "ne": 1, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "The WebApp: NodeJS COTI: ADA PaymentApp proposal addresses the COTI challenge using NodeJS App and REST web configurations. ", "q0r": 5, "q1": "The proposer is experienced in Java and Javascript and TSYS payment. The proposal hasn't mentioned the background of another developer but mention about this developer #2 in the budget breakdown. The project staking pool development (around 6.6% of proposal budget) is deemed as a source for further funding in 2023 after the project launch date is August 2022. The proposal includes not only Shopify integration but also woocommerce integration and elaborate well plan of actions.", "q1r": 4, "q2": "Despite the proposal mentions about roadmap discreetly in the project workflow, it hasn't set the concrete KPIs which the community can use to track the progress and the delivery of project. The proposal also doesn't touch upon the challenges they might encounter during their implementation.", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The proposal as it pertains to the salesforce and woocommerce integration meets the challenge requirements. Im not sure if funding a stake pool as part of the proposal makes sense. Its great that the project wants to become sustainable in the future, but to become a successful stake pool with a pledge of 1500 USD is unrealistic without an accompanying marketing strategy. ", "q0r": 3, "q1": "The proposers do have experience with NodeJS and payment systems. The proposal could be better organized but demonstrates an understanding of the requirements for integration with said platforms. Their timeline seems more conservative than agressive. I feel that similar projects may execute at a faster pace, potentially diminishing impact. ", "q1r": 4, "q2": "there is a budget breakdown. The timeline and milestones seem fairly clear, but it is not clear if the WooCommerce integration is included in the timeline. I think the proposal would be easier to audit if focused on the Shopify integration or if it was simply better organized. ", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The proposer identifies the need for an app that connects to Coti's system and attempts to produce such an app. But they failed to illustrate the added value of this product to Coti or Cardano's ecosystem. ", "q0r": 3, "q1": "The proposer provided different links for the team members credentials which seem fair. On the other hand, a clear outline or map to the steps needed for such projects is not provided. Also the description of the solution lacks technicalities such as diagrams or lists of the technologies to be utilized. The proposer states clearly the language of development and gives a good reason for it.", "q1r": 3, "q2": "While many milestones were provided as part of the general roadmap of this project, it still lacks specific numbers that can help the community assess the development of the project. But, the proposer seems to have a clear vision about future added services in their solution and further branching into different e-commerce infrastructures.", "q2r": 3, "assessor": "z_assessor_768", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal has to the potential to provide the much needed solution that address address the challenge. Providing a framework that acts a vehicle to be able to in to integrate ada pay plug in to various form of e-commerce website is highly welcome", "q0r": 4, "q1": "The skill and experience profile is not well detailed and the proposal's team member can not be identified in the proposal.\r\n\r\nHowever, the milestone and/or roadmap is quite evident to show the level of capacity to achieve a successful implementation. \r\n\r\nConsidering the amount of funding requested, the budget is not well articulated and with the mention of using some of the fund for another different project entirely goes to show that the budget is not realistic.", "q1r": 3, "q2": "There is no information on how to measure the success of the project and considering the amount of funds required, lack of KPIs to assess the proposal is not encouraging.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "Dev touches on all aspects of the challenge presented. More detail about scaling needs/requirements needed.  .JS is widely used by AWS, Walmart, Microsoft, Paypal, etc. This is a +! Dev displays good knowledge of Shopify and WooCommerce. Any prior history working within the Cardano echo system would be welcome. Explanation of ease of use needed. The number of potential merchants that could be onboarded is not clearly defined.", "q0r": 3, "q1": "This would be a fairly large scope of work moving forward. integration with future Third-party Apps, maintenance, etc. More information about \"The Team\" could be very helpful in future evaluation. Maybe a little more about how you could work with Coti during this process. Have you already communicated with their team? ", "q1r": 3, "q2": "Timeline seems clear, but is it realistic with 1-2 Developers? Just need a little more clarity here. Proposers relevant experience a big +. The team that is built, transparency, and communication will go a long way. How would the community be able to follow the projects progress? A little more information about security and potential road blocks and how they would be handled would be helpful. Interest to hear about future collaboration within both Coti and Cardano communities. More detailed information would be needed to provide the most accurate assessment possible.", "q2r": 3, "assessor": "z_assessor_944", "no_vca": 17, "ne": 6, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is effectively addressing the COTI challenge with the development of a NodeJS webapp to access the ADApay API and develop integrations/plug-ins with ecommerce platforms. ", "q0r": 5, "q1": "The dev team behind this proposal has included a well thought out roadmap to implement and scale this solution, the team relevant experience section is also impressive although the team member's linked GitHub has few meaningful commits. The proposal has a fully fleshed out plan with sufficient detail in each section which is the guiding reason for this rank.", "q1r": 4, "q2": "Kudos to the team this information provided in this proposal is well articulated, flows nicely and is sufficient to audit the progress. ", "q2r": 5, "assessor": "z_assessor_945", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}], "solution": "A equipe desenvolverá um aplicativo NodeJS para se comunicar com o ADA Pay API através de uma configuração web REST. A integração do aplicativo com aplicativos de terceiros.", "experience": "Desenvolvedor Web com experiência em Java, JavaScript em aplicações bancárias. Analista de dados/Desenvolvedor com experiência em R, JavaScript e TSYS Pagamento."}