{"id": 383998, "author": "mamazoe", "title": "RAEDA", "url": "https://cardano.ideascale.com/a/dtd/383998-48088", "category": 26256, "amount": 40000, "description": "MOBILIDADE - uma das questões mais antigas e mais urgentes de um africano médio.", "funded": 1, "upvotes": 30096350, "downvotes": 23392600, "votes_result": 6703750, "votes_cast": 424, "f6_no_assessments": 9, "f6_rating": 1.7037037037037037, "videos": [], "media": [], "f6_assessments": [{"q0": "Discordo totalmente de que esta proposta responda efetivamente ao desafio. A idéia é nobre e tem um bom uso, creio eu. Mas claramente a idéia não pertence a esta categoria, e seria mais adequada ao desafio das dapps e integrações.\r\n\r\nSe, no entanto, esta idéia for adequada a este desafio, então teria sido bom se o proponente tivesse mencionado como a solução adaPay será integrada com a RAEDA. Estou totalmente ausente desta conexão na redação desta proposta. Isto aponta para duas coisas a seguir\r\n\r\n1) O proponente não tem uma boa clareza sobre como funciona a integração Cardano/Coti\r\n2) O proponente assumiu que o leitor pode inferir, a partir da redação dada, que haverá algum tipo de integração com a AdaPay.\r\n\r\nEm qualquer um dos casos, acho que esta não é uma proposta adequada para esta proposta. Para mim, portanto, vou sugerir ao proponente, que dê uma olhada em outros desafios e coloque esta proposta na próxima rodada lá. Tenho certeza de que você terá muito sucesso com uma grande chance de conseguir financiamento no futuro. Boa sorte.", "q0r": 1, "q1": "A proposta deu um anexo onde eles elaboraram sobre a equipe que consiste em uma boa parcela de indivíduos experientes.\r\n\r\n Além disso, a seção de métricas e metas de longo prazo dadas explica que a equipe tem uma boa visão em termos de como será o sucesso para eles.\r\n\r\nSe eu considerar esta proposta sozinho sem considerar o fato de que este talvez não seja o lugar certo (cenários de desafio) para esta proposta, eu ainda encontro muito espaço para melhorias. A implementação bem-sucedida da proposta em si mesma exigirá, imo, algumas outras parcerias, especialmente com dependências externas, como a infra-estrutura da Internet na África. Acredito que este é um jogo de longo prazo, e projetos como o token móvel mundial e o ritmo de promoção da cadeia de bloqueios seriam um grande fator para representar o sucesso desta proposta.\r\n\r\nPenso que o proponente também deveria encobrir a definição de sucesso no que diz respeito à infra-estrutura dentro da África. Para a comunidade Cardano esta é uma área muito importante de conhecimento, pois as pessoas/comunidades locais, como o proponente, têm um bom conhecimento e experiência sobre ela.\r\n\r\nPortanto, na minha opinião o proponente deve tentar cobrir o maior número possível de dimensões. Isto só aumentará a probabilidade de sua proposta ser financiada no futuro.\r\n\r\nFinalmente, considerando todos os pontos acima, não concordo nem discordo que esta proposta será implementada com sucesso (considerando apenas este ponto e não que esta proposta não é uma boa opção para este desafio).", "q1r": 3, "q2": "A proposta menciona que eles estão desenvolvendo algum tipo de sistema onde os usuários também podem acessar o serviço através de pagamentos criptográficos. Entretanto, não consegui encontrar nenhuma informação sobre o roteiro de desenvolvimento/programação/teste para esta solução digital.\r\n\r\nEmbora a proposta dê um bom esboço sobre a quebra do orçamento, mas se o RAEDA vai ser um produto digital, então acredito que alguém tem que fazer a codificação e a implementação para ele também. Os marcos são mencionados, mas a quebra do orçamento não menciona nada sobre as horas-homem do desenvolvedor.\r\n\r\nComo desenvolvedor sênior eu mesmo sinto que o sucesso desta proposta depende muito da qualidade dos desenvolvedores que irão implementar esta solução. Entretanto, as informações profundas sobre qual é o plano de desenvolvimento, que pilha de tecnologia estão usando, que tipo de funcionalidades/conjuntos de recursos estão trabalhando, quais são seus planos para a escalabilidade de sua solução, quem e como será feita a GQ (Garantia de Qualidade)? Faltam tais detalhes de implementação que são muito importantes para o sucesso desta proposta e a comunidade gostaria de ter um roteiro claro sobre isto.\r\n\r\nMinha sugestão ao proponente é dar uma olhada em projetos previamente financiados onde eles tenham dado todos esses detalhes. Isto lhe permitirá ter um bom entendimento sobre como você pode proporcionar à comunidade uma boa confiança sobre se uma proposta pode ser auditada adequadamente e, eventualmente, a probabilidade de sucesso desta proposta.\r\n\r\nPortanto, discordo que haja informações suficientes disponíveis aqui para auditar suficientemente o progresso e o sucesso desta proposta.", "q2r": 2, "assessor": "z_assessor_454", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "A proposta é certamente intrigante e claramente poderia fazer maravilhas especialmente em um continente como a África, onde a mobilidade é uma questão sempre existente, como o proponente menciona em sua declaração de problema. Entretanto, acredito firmemente que esta proposta não faz a justiça necessária ao desafio em questão. O resumo da campanha menciona a necessidade de um plug-in de pagamento ADA, mesmo que o proponente mencione estar trabalhando em uma plataforma de pagamento única, eles não fazem menção de como esta plataforma pode ser escalonada para outras plataformas. Sinto que esta proposta poderia se ajustar a outros desafios, tais como \"Dapps de construção da nação\" ou \"Dapps e integração\", pois a proposta se concentra em uma aplicação específica que poderia agregar valor à vida das pessoas e ao ecossistema, em vez de fornecer à comunidade um plug-in de pagamento que aumentará as transações e a adaptabilidade do Cardano como um meio de pagamento. Portanto, sinto que apesar de ser uma grande proposta, não está sendo apresentada sob o desafio certo, portanto, eu pontuo 2 de 5 para o impacto e como ela trata bem o desafio.", "q0r": 2, "q1": "O proponente menciona já ter feito uma quantidade razoável de trabalho na direção da proposta. Mas, não há narrativa a respeito do plano detalhado que pretendem seguir para que a idéia proposta seja alcançada. A proposta apresentada também não inclui nenhuma descrição a respeito dos membros da equipe e sua experiência, exceto por mencionar os papéis. Além disso, tendo solicitado um orçamento global de 40 mil dólares, o que representa cerca de 2/5 dos 100 mil alistados, não há nenhuma repartição do orçamento disponível para os leitores. Não há nenhum plano de ação ou documentação sobre os possíveis riscos e inconvenientes e seu plano de mitigação. Não há nenhum sabor fornecido sobre como seria o sucesso e quanto valor poderia acrescentar ao ecossistema Cardano e ao COTI em particular. No geral, com muitos detalhes faltando, a proposta parece muito incompleta e coloca muitas dúvidas na mente dos leitores. Portanto, discordo que, com as informações disponíveis, é muito difícil supor que esta proposta satisfaria as expectativas da campanha.", "q1r": 2, "q2": "O proponente não fornece aos leitores quais são as métricas possíveis que podem ser utilizadas para auxiliar a auditoria. Além disso, não há uma definição de sucesso por fases para acompanhar o progresso oportuno da proposta. O proponente não forneceu nenhum KPI que corresponda aos KPIs necessários mencionados no resumo da campanha. Sem marcos claros e horizonte de tempo definido, é muito difícil acompanhar a proposta e seu sucesso. Tendo analisado a proposta, sinto que mesmo com a implementação bem sucedida da proposta, não há evidências plausíveis para dizer que sua plataforma de pagamento pode ser alavancada por outros comerciantes e aplicações web para os procedimentos de pagamento. Não existem métricas visíveis na proposta para identificar o número de usuários que utilizam este método de pagamento e o quão suave ele é. Um pouco mais de informação delicada sobre a taxa de sucesso do pagamento, custo de qualidade, escalabilidade e experiência do usuário trará mais valor para a proposta no seu conjunto. Sugiro fortemente que o proponente trabalhe em um plano mais elucidado e volte a apresentar a proposta nas próximas rodadas. A proposta no momento não é suficiente para ganhar a confiança e atenção da comunidade e, portanto, tenho que pontuar 1 em 5 para a clareza/auditoria da proposta.", "q2r": 1, "assessor": "z_assessor_751", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal completely misses the objectives of the campaign. The main problem of the campaign, that is how to build a plug-in to integrate ADA Pay seamlessly so small merchants are able to accept ADA payments is never addressed. Because of that metrics and roadmap are not aligned with the challenge goals.", "q0r": 1, "q1": "The proposal cannot be considered feasible because the goals are distorted. Even if they succeed with the presented idea, it will not be possible to state that the proposal was successfully implemented because they will not achieve the goals of the challenge.", "q1r": 1, "q2": "Because there is not a clear understanding of the targeted problem it is not possible to affirm the proposal has a good auditability. The KPIs defined completely miss the direction in which the project must go to fulfill the objectives of the challenge. The proposed solution does not address the problem posed so auditing is virtually meaningless.", "q2r": 1, "assessor": "z_assessor_341", "no_vca": 25, "ne": 2, "ng": 19, "nfo": 4, "vca_o": 1}, {"q0": "The proposal states a problem and provides a solution to fix this. Unfortunately the key metrics and goals of the proposal do not align with the outlined challenge settings. I would recommend to re-submit the proposal on the next fund in another category.", "q0r": 3, "q1": "There could be more informations provided about the team and also on the technical aspect of the idea. It is hard to tell how far the project already is and how much work has to be done. Also a breakdown of the budget as well as a risk-assessment would help to further assess the proposal.", "q1r": 2, "q2": "The proposal lays down the general idea but to properly assess the proposal much more informations are needed. A more structured roadmap or a clear budget breakdown would help. In overall the proposal is hard to assess", "q2r": 2, "assessor": "z_assessor_41", "no_vca": 19, "ne": 0, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "This proposal has not identified a problem within this challenge. My advice to the proposer is to find a challenge where this proposal fits better, in order to increase its chances of being funded.", "q0r": 1, "q1": "This proposal is not in the right challenge. Furthermore, it doesn't contain enough information to be implemented successfully. I suggest to the proposer read the the brief challenge or find a better challenge for this proposal.", "q1r": 1, "q2": "This proposal doesn't contain enough information such as a roadmap or metrics that can allow the tracking of its progress. ", "q2r": 1, "assessor": "z_assessor_439", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "Great project and idea. By providing mobility that is fair and easy to use to the people of Africa you solve a big problem. Now my concern is where is the link with the challenge. We look for ways to integrate the ADA Pay plug-in. You talk about developing a system where users can also access services through crypto payments. but as it stands now the funding requested for this proposal does not include this service. You also don't define that this crypto payment would go with ADA Pay. It's one impeccable proposal and the document attached gives all the necessary info but we are missing the link with the challenge. ", "q0r": 2, "q1": "Regarding feasibility, this proposal is very well written and gives the necessary amount of information needed. Looking at the team we get a full fletched team that is qualified for this proposal. They each have their own unique qualities that are explained short but clear. One thing that would've finished this is if you provided a link to the survey that you guys had taken before this. Everything else is well explained and provides evidence of the hard work that you guys already put into this proposal, but what I'm missing is the model to support these affordable rides and drivers offers.", "q1r": 4, "q2": "As stated in the previous rationale everything is provided in this proposal. The timetable is presented and I would normally say one month is not enough to provide a demo version but I assume they already started working on the prototype. risk management is present and nourishes my brain to the point that I see you guys are putting everything in this. One concern I have is the budget. I don't doubt that you guys need the amount but since it's asking for half the challenge funds I hope you guys know you're taking a risk on this. What I would suggest is if this doesn't get funded breakdown your project into several categories and submit proposals for each category. ", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 18, "ne": 3, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This proposal conceptually presents an interesting idea, however it does not demonstrate a strong alignment to the challenge objectives.  This is highlighted by the strong focus on the idea rather than detailing how it plans to address core challenge criteria such as testing the plug-in, measuring key metrics, etc…  Furthermore, the proposal has not detailed out core metrics of success even for its own concept. The business model is conceptual and only provides anecdotal evidence for why it is a needed idea.  \r\n\r\nIn order to turn this from a strong proposal in the future, the project team should aim to submit their idea to relevant challenges as well providing more details around roadmaps and how it realistically aims to become the 'Uber for Africa.' For example what is the detailed pricing strategy for the subscription model? Why use a subscription model as opposed to a Pay-as-you-go model? ", "q0r": 1, "q1": "The team appears to have a diverse background and existing involvement African blockchain community.  Both of these are great starting blocks.  A clear strength of this proposal is the ability to come up with an interesting concept for integrating Cardano into the real world. \r\n\r\nMy recommendation for a future proposal is to add more detail in the budget breakdown and roadmap section.  The requested funds for $40,000 makes up 40% of the total funds allocated for this challenge. Given that amount, I would expect an appropriate level of depth when addressing how this budget is going to be spent. \r\n\r\nFinally, I am struggling to understand the implementation path that lies ahead.  It is still an idea at heart and there is a strong disconnect of how the challenge objectives will be met through this project (as well as how the business model will be sustainable or successful). Using an existing business model would be a stronger proposal for COTI funds. Once again, providing some detail and structure around the next steps / roadmap for this project would give more color and evidence that the project will be successful long term. \r\n", "q1r": 1, "q2": "A key strength of this proposal is the tangible nature of the problem they are trying to solve. In order to improve the proposal even further, I suggest outlining important information such as a roadmap, estimate of key activities to be delivered and details on budget allocation. \r\n\r\nFurther, having alignment with the challenge metrics would increase the change of a successful proposal. For example, the challenge identifies success as testing the ability to integrate ADA plug-in solutions. Forming a view of a roadmap against this metric would have been a great opportunity of showcasing the linkage to the challenge in an auditable way.  ", "q2r": 1, "assessor": "z_assessor_586", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "I disagree that this proposal addresses the challenge because it doesn't mention  payment with ADA plug-in but just mentions \"cryptocurrency\" in general.", "q0r": 2, "q1": "There is just detailed plan, I don't see the team, timeline, budget breakdown, resources, etc. I strongly disagree this proposal will be implemented successfully.", "q1r": 1, "q2": "There is no key metrics to success or KPIs, roadmap or time horizon. This proposal does not provide me enough information to assess its progress.", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 17, "ne": 0, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "The problem statement of this proposal seems not to align with the challenge. The proposal is just about providing solution to making transportation in Africa conveniently and easily accessible by users and creating a Dapps for this purpose. So in my opinion, the proposal does not have effective impact on achieving the set goals of this challenge category.", "q0r": 2, "q1": "There is no detailed skill and experience profile of the team. In addition, there is no information to assess the reasonableness of the budget and it's breakdown plus no roadmapand/or milestone to verify the capacity of the team to achieve the successful implementation of the proposal.. There is a lot of work to be done to fine tune the proposal.", "q1r": 2, "q2": "There is no information on any form of metrics and/ KPIs to assess the proposal if eventually funded.", "q2r": 1, "assessor": "z_assessor_9", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "Raeda é um produto móvel digital que integra um sistema fácil que permite que os usuários se inscrevam em passeios acessíveis dentro de um período de tempo", "experience": "Temos uma equipe composta por especialistas em estratégia de marca, consultor de RP, desenvolvedores, marqueteiros e especialistas em gestão."}