{"id": 383964, "author": "joey.chessher", "title": "Elevated Project Management Process", "url": "https://cardano.ideascale.com/a/dtd/383964-48088", "category": 26253, "amount": 12000, "description": "随着受资助项目数量的增加，使用现有程序审计其进展和监测其影响变得更加困难。", "funded": 0, "upvotes": 15067177, "downvotes": 20549664, "votes_result": 5482487, "votes_cast": 95, "f6_no_assessments": 5, "f6_rating": 2.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is great, does address the clhallenger but the scope of the proposal seems a little limited to the potential it has.\r\nAs I understood, the idea evualuate and start using na already commercial project management tool to audit the project (let's say, the most known ones, MS project online, Clarity, Primavera, Oracle).\r\nThese tools certainly can help to audit the projects but they can do much more from a project management standpoint. They can help project managers to create schedules (gantt charts, creating WBS, store and share key documents with the teams, comply with stage-gate, create dashboards, build risk analysis matrixes, manage and allocate resources, create scenarios, manage budget, and etc - all the knowledge areas in the PMBOK in project could be benefited from a PM tool) so I'd consider to broad the scope of this proposal to have a dedicated tool for all project management activities (not only for the audits). This would be ambious but great if fully implemented. And, of course, the right custmizable tools has to be chosen - the main challenge here would be cost, the licences for these tools are usually expesive! Some of examples of the tools/platform that are going to be analyzed could be mentioned in the proposal so voters can have a hint on its cost/benefit (given that the most known ones are indeed expensive) and how these licences were going to be paid after implemented (considering theres probably no free tool good enough)\r\nIf the idea is really just use this tool for audit purposes, then simpler solutions developed internally could be built (as in other proposals in F7) with probably a much lower cost. But, of course, a cost/time/benefit analysis need to be done here to validate this premisse. \r\n\r\nI liked it is propsing to start with a pilot, before moving to a large scale implementation.\r\nI also liked the idea of having supportive PMOs in the process. This helps to standarize processes, tools, createlear guidelines, suggest and improve governance, and offer project management consultancy/guidance, to funded proposers, if necessary. Going further, this PMO could offer consolidated views on the whole catalyst projects pipeline (evaluating portfolio metrics involving the milestones achivements, funded value, ROI, etc)  in catalyst meetings/townhalls and act as scrum master in Agile funded projcets. But again, it would be a larger scope.\r\n\r\nAll in one, the proposal is much better when considered a scope increase, both in the PM tool usage and in the PMO implementation - maybe it could be in other challenge (miscelaneous).  This scope increase could be done in stages, of courses. The way it is written, I see a cost benefit analysis comparing to a in-house solution as essential to really evualute the impact of this iniative.", "q0r": 3, "q1": "The experience of the team is vague. It says is has over 10 years of summed experience in project management - which is essential, especially if PMO actitivities are going to be carried out - but more details should be available, as more description on their experience and how many people are involved. Theres a PMP (certificate) number but I couldnt find the person register in the internet - links to linkedin or CVs would help here! \r\nTheres a good plan but there are no dates or time-frames to the activities/milestones listed.\r\nThe budget proposes id fair for a pilot, but could be mentioned how he got these values for the licences (was there any initial benchmark done?). A last comment would go to the economical feasibility of this proposal. I dont see major challenges fo the technical feasibility of this proposal (implementation of a tool itself) but more for the economical feasibility. An insight on the cost benefit compared to an in-house solution could be bought on the proposal as it conflitates with others (even funded proposals from last fund). Maybe some syniergies/lessons learned with these other proposals could be explored", "q1r": 3, "q2": "There are some milestones in the project plan but no metrics to track the tool implementation. It could be included here the number of PM tools assessed, the number of projects being audited in the pilot, the effectiveness of the tool, etc.", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "since it is a pilot proposal the impact and its efficiency are unknown. It is a good point that with an increased number of proposals we would find a use for the standardized process, yet, for funding, I believe more pre-work needs to be done and such a proposal should be more detailed, with more answers rather than questions. \r\n\r\nStill, I see its potential. Rating given 3.", "q0r": 3, "q1": "the experience provided seems reasonable and sufficient. Although the plan is rough, more detail is required.\r\n\r\nMore information about the team is required aswell, possibly some linked in links, or past work as an example to increase the credibility. \r\n\r\nRating given 3.", "q1r": 3, "q2": "the key metrics or tracking progress points are missing. Rating given 1.", "q2r": 1, "assessor": "z_assessor_54", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "I highly appreciate the group's goal. However, the group has not stated how you will cooperate with the volunteers. And I suggested to the group to consider more solutions. determine the future size of the group.", "q0r": 2, "q1": "The proposed team seems to have forgotten to give details of team members and substantiate your claims of experience. You are missing some important items such as implementation roadmap with actual timeline, as well as the resources needed to complete this project are not yet available. I hope the team will add these items next time.", "q1r": 1, "q2": "I believe that the information provided by the team is not enough to be able to implement the proposal, the way you presented in the summary does not provide enough consistent information about how you will solve the problem you are facing. proposed. the solution to the problem is not clear. I am really sorry to say that this proposal is not really transparent to the community because of the lack of information.", "q2r": 1, "assessor": "z_assessor_644", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This is a great idea! In the proposal we can clearly see what problem the proposer points out and what solution it offers. The proposal does not specify how this idea will affect and how it will give a certain value to the Cardano ecosystem. But we can conclude that if this idea was realized it would certainly contribute to the Cardano ecosystem. Because there are no KPIs, it's hard to compare KPIs with challenge setting and this proposal isn't able to scale and address future challenges.", "q0r": 3, "q1": "The project team of 3 is mentioned in the proposal, but we have absolutely no information about the team. It would be good to see an account of what experience and skill the team has. It would be great to know who is behind this idea and to be able to check whether there is a team through LinkedIn and what knowledge, skills and experience they have. The budget is reasonable and clearly presented and additional funding is not required. It would be good if the proposal elaborated a plan with details of actionable tasks and order of execution. The proposal does not mention the time frames through which the work will be finished. It would be good to work out details of actionable tasks and order of execution to get a clear insight into how this team will operate. The proposal mentions the necessary licenses to be paid but does not specify any technical aspects. It would be good to have information about possible risks and how to behave if risks arise.", "q1r": 1, "q2": "This proposal seeks money to license three people to be part of the Project Management Office, which is probably why the roadmap with milestones and a time horizon for achievement and KPIs are not listed. Due to the lack of data, the community cannot in any way monitor the success of this project", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 16, "ne": 4, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about evaluating and Piloting a Professional Project Management product that is fully mature to operate in parallel with the existing auditing process. This is a great and very meaningful idea, especially in the context that number of Catalyst's proposals increasing exponentially. The problem is clearly described, and explained in detail so that it addresses this challenge. The solution is clearly defined, with a convincing impact argument provided. I can see the potential impact on the Cardano ecosystem as a whole in long term with this product. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "This team has 20yrs + of Project Management/Staffing Experience, with PMP Number 1413330 – May 28, 2011 – May 27, 2023; this description shows suitable skills and experiences for implementing this work, but it would be better if each member's profile was provided with external links for verification of feasibility. Proof of feasibility from the team experience is still unclear. The budget is unclear, without explanation [why \"$6,000 - License for 10 - 25 Projects\" ?]. Risk is not defined [or there is no risk foreseen]. Therefore, based on the given information, I am neutral with this proposal's feasibility, I would rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of meaningful information. However, for better auditability, the following information should be added: (1) each member's profile with external links for verification; (2) budget explanation for each item; (3) risk management analysis.\r\nTherefore, based on the given information, I disagree with this proposal's auditability, I would rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1}], "solution": "评估和试行一个完全成熟的专业项目管理产品，以便与现有的审计程序平行运作。", "experience": "团队拥有20年以上的项目管理/人员配置经验。\nPMP(项目管理专家)\nPMP编号1413330 - 2011年5月28日 - 2023年5月27日"}