{"id": 380976, "author": "felixweber", "title": "Cardano Ambassadors Catalyst Guild", "url": "https://cardano.ideascale.com/a/dtd/380976-48088", "category": 26248, "amount": 10000, "description": "Manque de communication, de coordination et de collaboration entre la Fondation Cardano et la communauté/le système Catalyst.", "funded": 2, "upvotes": 70839788, "downvotes": 5384707, "votes_result": 65455081, "votes_cast": 144, "f6_no_assessments": 5, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "\r\nThe problem needing to be solved has been identified and articulated namely communication, coordination & collaboration between the Cardano Foundation and the Catalyst Community/Ecosystem is Lacking \r\n. \r\nIt is clear that this proposal falls within the scope of the challenge brief by Building an Community led Team of Catalyst Experts to explore and execute initiatives between the Cardano Foundation &The Catalyst Community\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating such a community\r\n \r\n  Key metrics  would be  number of participants,  number of breakout rooms, number of participants in each Challenge fest session, number of proposers and voters.\r\n \r\n\r\nThe key metrics and goals of the proposal may fall within the scope of the challenge but there seem to be other similar groups involving the same individuals fulfilling the same role.\r\n   \r\nProposal can be scaled up to address future challenges by adding more functionality of services\r\n\r\nThis project will have a positive impact on Cardano system by increasing the collaboration between community members in presentations and discussions.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 4 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.\r\n ", "q0r": 4, "q1": " \r\n \r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Town Hall and After Town Hall events as well as previous Ideafests. \r\n  \r\n The links are sufficient. \r\n \r\nI have visited these links and contacted the relevant people\r\n  \r\n \r\nThe proposers are well experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is stated.\r\n \r\n \r\nThe team structure is listed and experienced.\r\n \r\n \r\n The budget has not been given in detail. \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n\r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n \r\nTheres a realistic timetable  to complete the work \r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are described.   \r\n  \r\n\r\nThe proposal has technical aspects which have been addressed \r\n\r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is not highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 4 star rating.   \r\n", "q1r": 4, "q2": "\r\n \r\nThere is a roadmap with milestones  \r\n \r\n There are  Metrics such of number of participants a and number of presentations and discussion rooms. \r\n  \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties.\r\n \r\n \r\nAre there contingency plans in place for various outcomes?\r\n \r\n\r\n\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  4 star rating.\r\n ", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 20, "ne": 5, "ng": 6, "nfo": 9, "vca_o": 1}, {"q0": "This is something we absolutely need from a management standpoint. Project Catalyst is growing exponentially and we are losing a grip on things. By providing a dedicated group of people within the Ambassadors you create a workspace that can tackle urgent topics and keep a global oversight on Project Catalyst. ", "q0r": 5, "q1": "The team presenting this proposal needs no introduction. They have proven their worth in the last few funds by constantly improving and engaging the community to do better than the last Fund. Even though they have provided all the evidence of relevant experience towards this proposal. The team is more than qualified for the task. Concerning the proposal, we have an outstanding plan. Everything is explained in detail and sub-categories. The budget breakdown is straightforward with not a lot of details but this is not needed for what it represents. ", "q1r": 5, "q2": "An exquisite proposal when it comes to auditability. The clarity the proposers bring with this proposal is crystal clear. We get everything down to the finest details, Every step is explained what it does and how it contributes. At the bottom of the proposal, we get feedback from the proposers that they will provide monthly reports to Cardano Foundation and at the Town Hall meetings. Well done team!", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 22, "ne": 5, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": " Relation to personal qualifications: I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects    Also, I know the Cardano Ecosystem and ist actors pretty well by now so I am sure I can confidetly evaluate this proposal. The proposal provides a great idea that will be of great benefit Project Catalyst and to the ecosystem in general. It will help a lot scaling up the size of this project, most of all by facilitating project communication - both internal and external.", "q0r": 5, "q1": "The proposers are a really active and vital part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large part of the community as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a very detailed description of what is going to be done and how and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is without a doubt a perfect example of a good, feasible proposal.", "q1r": 5, "q2": " Well-defined, detailed metrics and KPIs are presented that define the success of the proposal. A clear, understandable problem description is supplemented by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 21, "ne": 4, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "I believe that the proposal must be refined, something similar can work within the Cardando circle, -and in fact I believe that it will be so-. We need an independent organization to accompany the foundation. Although the impact is clear, you must better explain how they are going to organize it. It is an idea, it lacks a lot of refinement. As a positive, you could say that your proposal responds to some extent to community demands.\r\nYou call it a union, but the unions are democratic, there must be a proposal, or a notion of how you are going to choose the members, a work plan or idea of how you are going to organize it, what organizational form you going to adopt, what continuity will the project over time.", "q0r": 3, "q1": "People's names are mentioned, but there are no links, not even their \"ideascale\" profiles.\r\n", "q1r": 3, "q2": "It is difficult to audit, neither the process nor its result since they do not clearly describe a work plan since their description is very abstract ... Use terms such as: mechanisms (which ones?)\r\nI tried to be objective in my feedback, I hope I am not too harsh. Greetings", "q2r": 3, "assessor": "z_assessor_743", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "Given the proposal does not fit in any other challenge it is aptly placed within this challenge. The proposal correctly identies and explains how it will bring value to the ecosystem by bridging the CF and Catalyst devide.", "q0r": 5, "q1": "The team presented has a deep knowledge of the ecosystem and is aptly suited to perform the given proposal. The budget is well broken down and fair given the timeframe.", "q1r": 5, "q2": "Monthly status reports are promised to be provided which will greatly aid in the audibility of the proposal however It would be great to hear specific targets in terms of what this proposal may bring to the ecosystem.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "Mettre en place une équipe d'experts Catalyst dirigée par la communauté pour explorer et exécuter les initiatives entre la Fondation Cardano et la communauté Catalyst.", "experience": "Ambassadeurs Cardano, conseillers de la communauté, mentors pour les propositions, OPS, proposants financés, membres de l'équipe Challenge, membres du cercle Catalyst."}