{"id": 381757, "author": "calixtorontocalix", "title": "Feature Film 👉Onboarding Hollywood", "url": "https://cardano.ideascale.com/a/dtd/381757-48088", "category": 26248, "amount": 60000, "description": "Comment intégrer les studios de divertissement grand public dans Cardano et devenir le meilleur écosystème de sa catégorie pour les projets de divertissement de grande valeur ?", "funded": 0, "upvotes": 26996002, "downvotes": 29699924, "votes_result": 2703922, "votes_cast": 111, "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": [], "media": [{"url": "https://m.youtube.com/channel/UC8agKf6grlLj5noFmUQnMhQ", "title": "Youtube Channel"}], "f6_assessments": [{"q0": "A full-length feature film to showcase Cardano can be a good PR exercise. The community works so far in Africa and Catalyst funding mechanism are unique stories. Most probably the impact will be based strongly on the quality of the story and the production. The Cardno360 has good production value, however, and alternate will also help in the long run. ", "q0r": 4, "q1": "The proposing team is strong and has proven expertise in this field. They seem to have passion for Cardano and seem to really believe in the potential of Cardano based on their persistence. Therefore it is likely that the proposal with the help of the Cardano360 team and IOG can really be molded into a nice package. ", "q1r": 5, "q2": "Flim production is a specialized area with a high degree of randomness in compensation.  This is also a very high trust-based setting Based on the budgets of mainstream production housed, USD 60K for phase 1 seems to be a reasonable amount. The difficulty is in audit and the ROI in this project. Very close physical monitoring is likely to be required to audit the progress. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1, "reply": "Would love to receive your feedback as we progress, should you be interested in giving it. Cheers."}, {"q0": "A positively audacious plan that from a CA perspective fits this Challenge setting. Simply put this Challenge seeks to find those misfits that have dreams to change the world. And this proposal has all of that in spades. Onboarding Hollywood though with that kind of budget and all the risk that comes from it, is perhaps a bridge too far. It's a beautiful idea that only needs refining. Rather than Hollywood go for Cannes, rather than tapping into pop culture focus on the social aspect of it. Cardano in a nutshell, will liberate individuals from being milked like cattle. Cardano seeks to bring the human back into the word humanity. That is why Cardano is focusing on Africa. Imagine making something like 'Before The Flood' with Leonardo DiCaprio in conjunction with NatGeo. Perhaps, 'Humanizing Tech' by the proposer in conjunction with NatGeo and UNDP. The passion in this proposer will most likely result in a better proposal. Recommend to also connect with the various community within Cardano; Catalyst School to learn more on proposal techniques and the Cardano Creatives by Catalyst Swarm. Collaborate and unite then you will most likely succeed in Cardano.", "q0r": 3, "q1": "In this proposal, the co-proposer is more clearly defined then the proposer, which in the ideal scenario should be the other way around. Other than what is stated in the 'Relevant Experience' section there is no further fleshing out of the credential of the proposer. Something that will be worked out if the proposer reaches out to the Catalyst School. Budget stated is also not broken down into actionable chunks. There is though an implementation plan that is quite detailed. Other than that it was quite a challenge to take in all the info and to continuously shuffle and reshuffle through all the information shared. This to an extent made it ineffective in communicating the proposals core plan. It is only a matter of integrating with the Cardano community to formulate the story that needs to heard, the passion is there, the solution will come. This proposal seeks to achieve too much too soon, reckon to continue working on the existing implementation plan and breaking that up into perhaps 3 (three) proposals. At this current state, this proposal will not be implemented successfully.", "q1r": 3, "q2": "Roadmap and implementation plans although are choppy, are indeed provided with basic milestones attached to it. Unfortunately though, there are no measurable KPI's making this proposal very hard to audit. Problem statement is confusing and is more of a suggestion, persuasion or marketing lingo. It does connect with the solution provided but due to that it has not clearly addressed a problem needed to be urgently solved or of high yet sensible impact, has resulted in a choppy proposal. Please do not be discourage, the ingredients are there, reckon it would be more manageable to bake some amazing chocolate cookies rather than a basic buffet.", "q2r": 2, "assessor": "z_assessor_635", "no_vca": 19, "ne": 4, "ng": 12, "nfo": 3, "vca_o": 1, "reply": "Tools, Infrastructure and expenses = $5.000"}, {"q0": "Seeing as how there are no challenges in this fund directly related to marketing, this proposal definitely is a good fit for the miscellaneous challenge. It's an ambitious idea that tries to connect Cardano marketing efforts to established film media networks.  ", "q0r": 5, "q1": "A film would be a major production and the proposer correctly notes that this would involve a lengthy process and an army of personnel. All that considered, the roadmap seems fair. But as for the larger goal of attracting positive attention to Cardano, I find myself hitting a logical roadblock, since the proposal is for an action/adventure film, which seems like an awkward fit for Cardano. I would have very much liked to see a little more on how Cardano and the action genre could mix. Marketing ventures like this can always be a little risky, because without the right vision to execute they could turn out to be more embarrassing than helpful. Also, is Cardano going to be in the film to any extent? Not that we would even really want to see Captain Cardano delivering a knockout punch to Dr. Fiat or anything like that, but the answer to this question is unclear to me, and I feel like it should be clear.  However, to the extent that the goal of the project is also to establish connections between Cardano and the film industry, the proposal makes sense.", "q1r": 3, "q2": "Bi-weekly updates seems like a fair way to approach being visible to the community. It's good that the Cardano Foundation is invited to review the story concept, since as someone with creative experience I know having the whole community directly involved in the creative process would result in a \"too many chefs\" sort of scenario that could turn the story into a mess. But, as a gesture of good faith, offering something like a forum or panel or AMA with the creative team might have been a good idea, since the purpose of this is largely to onboard with Hollywood and secure connections. In other words, the primary promise of the project is that it provides people in the community with an opportunity to learn how Hollywood works and the proposers should lean into that.", "q2r": 3, "assessor": "z_assessor_853", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1, "reply": "F Note: Thanks for articulating your thoughts on what you think the story might play out like.  I promise, no Captain Cardano in this film.  While we can't disclose the story concept, the action will be \"justified\" for the story itself.  No silly Avengers style action.  This is actually a story...it will resonate with those who believe in the mission of Cardano (like myself)....that's all I can say.  \n\nA note: Check out https://www.youtube.com/channel/UC8agKf6grlLj5noFmUQnMhQ\nWe have an \"Industry Partner Spotlight\" series which includes industry experts who will be working with us in some capacity.  As future proposals roll out and additional work is required, we plan to continue these spotlight videos as one added layer of info for the community."}], "solution": "Phase 1 : Création d'un long métrage à grande échelle pour présenter Cardano, Catalyst et finalement attirer des partenaires de studio dans Cardano Creatives.", "experience": "Proposants : 38 ans d'expérience dans l'industrie du divertissement.\nDes dizaines de partenaires de l'industrie cinématographique pour travailler avec l'équipe du PE."}