{"id": 383284, "author": "glaxas", "title": "Catalyst Circle Treasury Management", "url": "https://cardano.ideascale.com/a/dtd/383284-48088", "category": 26248, "amount": 11400, "description": "Catalyst Circle doit payer les frais de fonctionnement et les membres du cercle pour les tâches effectuées. Les transactions doivent être documentées et gérées.", "funded": 2, "upvotes": 70138850, "downvotes": 3679374, "votes_result": 66459476, "votes_cast": 142, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Étant donné que Fund7 n'a pas de défi spécifique à Catalyst, je suis d'accord pour dire que cette proposition répond à ce défi. Si je comprends bien la proposition, il ne s'agit pas d'élargir notre communauté, mais d'accroître la longévité et l'efficacité du projet Catalyst. Avec un accent particulier sur la gestion de l'aspect économique du cercle Catalyst. La proposition aborde un aspect/problème très important et fournit une solution potentielle à long terme en créant un système qui rendra la gestion du \"Trésor\" des cercles Cardano plus facile à gérer et plus transparente. Tant pour les générations actuelles du Catalyst Circle que pour les générations futures. La solution suggérée par la proposition est une solution à long terme, qui vise à comprendre la \"machinerie\" de Catalyst dans son ensemble et à optimiser l'efficacité pour toutes les personnes impliquées.", "q0r": 4, "q1": "La proposition présente l'équipe centrale qui semble avoir de l'expérience au sein de la communauté Cardano, même si l'équipe actuelle n'a aucune proposition financée derrière elle. Ils semblent être actifs dans la finalisation d'une proposition financée par Fund6, mais il serait utile d'avoir des liens ou d'autres \"preuves\" que l'équipe réelle sera impliquée. Actuellement, les profils LinkedIn sont fournis, mais l'un d'eux ne fonctionne pas et le reste ne parle pas de l'expérience en comptabilité et en opérations commerciales. Si la proposition les avait inclus, l'équipe serait présentée de manière beaucoup plus crédible et claire. Je ne suis en aucun cas un comptable, mais de par mon expérience dans la gestion d'organisations et de communautés, je connais l'importance d'avoir des experts travaillant sur le côté économique des choses. Les propositions de gestion de la trésorerie du cercle Cardano sont présentées de manière très claire, étape par étape. Puisque la proposition se concentre sur un délai plus court (3 mois), l'allocation budgétaire semble raisonnable, ne demandant qu'environ 5% du budget total du défi. L'allocation budgétaire comprend également une estimation des heures de travail et de la répartition des ressources, ce qui renforce la crédibilité de la proposition. Je conviens qu'il est très probable que cette proposition soit mise en œuvre avec succès.", "q1r": 4, "q2": "La feuille de route est très claire et s'étend sur une période de 3 mois, en gros jusqu'au prochain fonds(8). Afin de la rendre encore plus claire, j'aurais aimé voir des délais estimés pour tous les jalons, puisque le seul délai fourni est le premier (12 déc-2021). L'équipe promet de mettre le système créé en open source, ce qui est une merveilleuse façon d'accroître la transparence du projet. Comment la communauté pourra-t-elle suivre le développement, en dehors de GitHub ? Il est quelque peu complexe de trouver des mesures de succès plus \"ouvertes\" puisque le système est créé pour une partie très petite et spécialisée de la communauté, mais que diriez-vous de partager la progression des tests du système ou les mises à jour du développement via les canaux de médias sociaux ou TownHall, etc. Il convient également de mentionner que l'équipe chargée de cette proposition pourrait changer avec le prochain fonds, si j'ai bien compris la proposition. Cela signifie que la transparence est de la plus haute importance si l'équipe de développement est censée changer au cours des différentes étapes. J'ai peut-être mal interprété la proposition, mais peut-être que la proposition pourrait présenter les plans à long terme d'une manière plus claire ? Il faudrait peut-être inclure un plan de vision moins détaillé pour les fonds à venir (8-9) afin d'inviter la communauté à prendre part au plan à long terme. Enfin, j'aurais aimé voir une courte section dans laquelle l'équipe décrit quelques-uns des défis ou des risques qui pourraient apparaître au cours de la phase de développement, et comment ils prévoient d'y faire face. La perspective sera toujours importante dans n'importe quelle situation, et le chapeau m'amènerait, en tant que membre de la communauté, à avoir encore plus confiance dans la proposition. Je ne suis ni d'accord ni en désaccord avec le fait que cette proposition me fournisse suffisamment d'informations pour évaluer les progrès accomplis dans la réalisation de ses objectifs déclarés.", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This is a proposal related to supporting accounting, spending, compensation, salary... tools on the cardano platform. An essential support tool for any company or workgroup that wants financial transparency, financial organization in a more methodical, professional and automatic way.", "q0r": 4, "q1": "The proposal is practical and highly feasible, but it is necessary to specify more clearly how to deploy it to the market to serve the majority of the community, as well as the relevant experience of the working team.", "q1r": 4, "q2": "In the proposal, it was mentioned that the code is completely public on github, so the community can check the project progress as well as the implementation progress of this project.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The \"Catalyst Circle Treasury Management\" proposal addresses the objective of challenge which is to pay operating costs and circles for their performed duties. The Catalyst circle is important for the Cardano Ecosystem and that the team has contributed time and effort to make this possible. ", "q0r": 5, "q1": "The team is comprised of strong 3 team members from Catalyst Challenges. The budget is reasonable and broken down in detail. They also updated what the community can expect after Fund 7 and the handover for fund 8 treasurers. The proposal is reasonable and pave the way for future development.", "q1r": 5, "q2": "The roadmap with milestones/KPI are available so the community can keep track of their progress. The system that they plan to build along with the documentation in GitHub will be open source and  available for public usage.  ", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about building a system that makes CC operations frictionless and auditable when it comes to resource allocation. This is a great and meaningful idea. As we know, the Catalyst Circle plays an important role the Cardano's Governance as a whole. The problem convinces me, and is clearly described, and explained in detail. The solution is clearly defined showing a potential impact on the Cardano ecosystem in long term. Therefore, I strongly agree that this proposal effectively addresses the challenge, and can rate it with a score of 5", "q0r": 5, "q1": "Proof of feasibility from the team profile can be seen, with the external links for verification. The budget is provided with a clear items structure, and explanations of the calculation base. Risk is not defined. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of information with proof for verification. It would be better if risk/challenge (with mitigation) is added.\r\nBased on the given information, I agree with this proposal's auditability, I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal addresses the issue of  managing the Treasury fund's financial operations and obligations in a simple and clear manner. . They state that by developing and implementing a treasury management system they can help ensure that money provided by Catalyst is spent in a manner that is auditable and transparent. This seems to be something that will definitely support the Cardano/Catalyst ecosystem. This is very important, and therefore I rate this proposal 5 for impact.", "q0r": 5, "q1": "The team members are experienced in business and accounting and links are provided for their LinkedIn accounts. The budget is broken down and understandable. They have requested $400 to build the accounting system from scratch. I don't know if this will be enough, but they do mention that they might need additional funds in future. They have set out a plan with actionable tasks and a timeline and it seems realistic to me. The are already busy testing the solution and mentions that it is going well.", "q1r": 5, "q2": "The Proposer mentions that the \"system that is being built will be open source and available for the community to use elsewhere.  The onboarding documentation for future treasurers will be public as well as part of the CC github Playbook\". This ensures that the progress of the project can be followed and makes the project auditable. The KPI's given makes sense and will also provide the community a way to track how the project is going. Maybe provide a space where the community can already now start tracking progress.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Construisez un système qui rend les opérations de la CC sans friction et vérifiable lorsqu'il s'agit de l'allocation des ressources.", "experience": "Notre équipe est composée de conseillers communautaires et de membres de l'équipe Challenge ayant une expérience en comptabilité et en gestion d'entreprise."}