{"id": 383615, "author": "raz", "title": "SustainableADA Goals Token Research", "url": "https://cardano.ideascale.com/a/dtd/383615-48088", "category": 26248, "amount": 6000, "description": "Il n'existe pas de moyen convivial et transparent d'investir directement dans les objectifs de développement durable (ODD) qui vous tiennent à cœur.", "funded": 2, "upvotes": 69544577, "downvotes": 6581748, "votes_result": 62962829, "votes_cast": 168, "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is really good and if this DApp is developed, a lot of Cardano and non-Cardano projects can leverage extra funding in the long term. UN SDG would also, of course, be benefitted from this extra funding. The proposal is also well structured with clear problem statement and solutions.\r\n\r\nAs further suggestions, I'd include the initial launch date planned for the final version of platform (at least the year it is intended to be made available for broader public), not just the MVP. Its hard to know by the proposal when the final desired outcome will be ready and the impact to the community would be brought. It seems theres still a lot of work to do and start with a resaarch is great.\r\n\r\nIt's also not clear also how the plataform itselfwould be self sustainable in financial terms. Will it depend of funding or for a long  time ? will there be ads on it? or would it be charging small fees in the transactions? However, there's still a lot to go on until it's ready so theres time to think more critically about it.", "q0r": 5, "q1": "The idea seems really feasible. The is already orgnizing and working together and has the necessary competencies and expertise to develop a white and yellow paper. It is provided here ways to verify the credentials of the team and the indivuals in it.\r\n\r\nthere's a sensible plan and a fair budget breakdown. In addition, its not an expensive project by now, as it is just in research phase. In the fututre, it can get a bit expensive but if succesfully developed, it will bring a great impact.\r\n\r\nEven if it doesnt get to DApp phase, making the paper available can benefit the community as others can try to look for a similar solutions themselves and contribute to a the final goal.\r\n", "q1r": 5, "q2": "There good milestones (delivering the white and yellow paper) and fair metrics - they could have some target though.\r\nI'd try to add also some way to measure the quality/effectiveness of this papers developed, maybe by surveys, feedbacks from the community, NPS, number of (positive) mentions (possibly in ohter papers), etc.\r\n", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 20, "ne": 9, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is for funding a research project that will build a viable business model around Sustainable Development Goles (in line with UN).  Charity will not carry the world ahead, it can help to avoid disasters but there is a need to have a viable investment model to support and sustain long-term projects. This proposal aims to achieve this. ", "q0r": 5, "q1": "The proposers are young and had a UN internship interested in economics. The proposal is only for researching for three months to evolve a plan. Therefore it is highly likely that the proposer will be able to do it. The research may or may not result in beneficial ROI; however, there is a need to support such initiatives to promote the culture of curiosity. ", "q1r": 4, "q2": "The fund requested is 6000USD for three months of research by two persons. The output may be a business model that will support an SDG. Research has very high uncertainty and the caliber of proposers to complete can not be reliably estimated with the information provided. However, 6000USD is relatively a low amount when we estimate the positive impact the output may have. Therefore, I feel it will be prudent to support the research effort. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This proposal aims to put initiatives like https://aidhub.org/ on the Cradano blockchain and by this to accelerate the accomplishment of the SDGs via an accountable grass roots funding system where the donations can be tracked and verified that they go where the intent is. This is also aligned with putting initiatives such as KIVA on Blockchain. ", "q0r": 5, "q1": "The team is extremely committed however not with sufficient expertise nor man power to fulfill this enormous task. The ambition is extremely high but this will only be a first small step towards conquering this challenge.  ", "q1r": 5, "q2": "The deliverables being a white paper and a functional \"yellow\" paper - these are perfectly auditable.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "Recherche de la base de la création d'une plateforme + jeton pour l'investissement à impact, vous connectant directement aux projets des ODD qui vous passionnent.", "experience": "Économie, durabilité, sciences humaines, sciences sociales, ONG, entrepreneurs sociaux, rédacteurs, blogueurs, montage vidéo, Figma, Canva, AdobeCC."}