{"id": 383928, "author": "joey.chessher", "title": "Technical Resource Pool", "url": "https://cardano.ideascale.com/a/dtd/383928-48088", "category": 26248, "amount": 12000, "description": "Il n'existe pas de pool de ressources techniques où les non-programmeurs peuvent accéder au talent de programmation nécessaire pour que leurs propositions soient retenues.", "funded": 0, "upvotes": 19825500, "downvotes": 16127770, "votes_result": 3697730, "votes_cast": 87, "f6_no_assessments": 5, "f6_rating": 3.6, "videos": [], "media": [], "f6_assessments": [{"q0": "The IOG discord has been performing the role to connect developers to project proposers. A well known platform to enable Cardano specialized freelancing and resource committing will smother lot of rough edges current in the Cardano development ecosystem. ", "q0r": 4, "q1": "The proposer is a PMP certified and claims a 20 years of experience in project management. With these credentials it is very likely that the he will be capable of implementing this fairly simple proposal. However if the proposer had included details regarding what will be the system for collecting the details from developers and proposers. Because the budget looks to low to build a dedicated site.  ", "q1r": 4, "q2": "The proposal is simple and straingforward with very measurable KPIs. The proposed fund also looks reasonable. The critical deficiency in details is with respect to the means of collection of information.", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": " Relation to personal qualifications: I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. Also, I know the Cardano Ecosystem and ist actors pretty well by now so I am sure I can confidetly evaluate this proposal. The proposal provides a great idea that will be of great benefit Project Catalyst, by providing a pool of available programmers for non-technical proposers, which will broaden the possible backgrounds for proposers. It will help with scaling up the size of of Catalyst.", "q0r": 5, "q1": "The proposers at least provide a PMP number, but beyond that they don't disclose personal details. If their acclaimed qualifications are correct, they will be able to implement this project. The proposers have defined the team members they plan to utilize in their budget. \r\nThe budget is a bit brief, but it seems reasonable to achieve the set goals.\r\nThe proposal offers a description of what is going to be done and how and a rationable implementation plan. Risk assessments are not done however.", "q1r": 3, "q2": " A comprehensible problem and solution description are presented, and a roadmaps and some goals are defined. KPIs are not explicitly defined.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 19, "ne": 2, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "Creating a place to connect developers and programers with people who have proposals funded in Catalyst is a great idea to make Catalyst proposals more successful and beneficial for Cardano and society. I really like this idea because this proposal helps us to use resources efficiently.", "q0r": 4, "q1": "The team has experience about project management, organizing and recruiting for project teams, which is the right experience for the goal of the proposal. But I can't find any information about the members of the team such as: how many members are in the team, what is each person's specific experience, the team's website or each member's personal page. on Facebook, Twitter, Linkedin,.... So I'm not sure about the identity of the team and its members to make sure the proposal is feasible.", "q1r": 3, "q2": "\"Checking number of available developers and programers is a good and easy way to audit this proposal. But they should show us what platform they use like website or google sheet for more clear about this.\r\n\r\nBy the way, i don't see any specific plan of them to approach developer and proposer has funded proposal to connect all of them. Proposal also need to show the target number of developers and available hours of developers.\"", "q2r": 3, "assessor": "z_assessor_645", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The team wants to make a system for collecting the technical resource that helps to make the proposals succeed. This idea will help to optimize a lot of resources in the not-funded proposal, to help the funded proposals that are lacking resources. Therefore, it will affect the number of successful implementation proposals in Cardano ecosystem, also boost up their progress faster on deploying their solution. \r\nMy advice for this team is they should make some key metrics that they will aim to when developing this project, that will convince Catalyst community more. They're maybe metric of the resource being used, or proposal registers in the system... this also will help the team assess their implementation plan is good or not and where they should improve. ", "q0r": 4, "q1": "The team has shown the roadmap with detail in 13 weeks after funding, including technical and marketing activities. Hence it makes their budget breakdown is reasonable for that roadmap. \r\nThe proposal is a little bit short but this idea is simple, and the team also provides some case studies to help us figure out which activities and values that this service will give to their users so I think it can work. \r\nThe only thing I recommend to their proposal is that they should provide some relevant risk that will affect to their plan, and some referral link to team profile will help CA, vCA and voter trust more to their team. ", "q1r": 4, "q2": "The team has a clear roadmap for their work with an achievable timeline. But lacking some key metrics for this proposal makes this hard to audit. They're also mentioned the 300 additional women programmers will hopefully add to but that number is from the other proposal, and we can't address which one because they didn't attach the links. \r\nThe team has good awareness about the problem and context, so they make their solution that is very smart to solve it and being explained detail in case of users. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 16, "ne": 4, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is about collecting and making available Technical Resources that have hours available so that Non-Programmers & Programmers can staff projects as needed. This is an interesting idea. The problem is clear, suitable to the given challenge. This solution's impact is quite convincing. Therefore, based on the given information, I agree with this proposal's impact, I can rate it with a score of 4", "q0r": 4, "q1": "Team profile [has 20yrs + Project Mgmt / Staffing Experience; PMP (Project Management Professional) PMP Number 1413330 – May 28, 2011 – May 27, 2023] is described as a potential benefit for this proposal, however, there is no proof/links for verification. The roadmap is clear, however, the budget breakdown and risk are not provided.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This problem and solution's idea is quite convincing to me. However, the plan did not provide me enough information, especially the following: (1) Team's profile with reference/proof (documents/links,...) for verifying; (2) Budget explanation for each item; (3) KPIs/ Metrics. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2.", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "Recueillir et mettre à disposition les ressources techniques qui ont des heures disponibles afin que les non-programmeurs et les programmeurs puissent s'occuper des projets selon les besoins.", "experience": "L'équipe a plus de 20 ans d'expérience dans la gestion de projets et le recrutement de personnel.\nPMP (Professionnel en gestion de projet)\nNuméro PMP 1413330 - 28 mai 2011 - 27 mai 2023"}