{"id": 383969, "author": "dionyziz", "title": "Research DAO", "url": "https://cardano.ideascale.com/a/dtd/383969-48088", "category": 26248, "amount": 100000, "description": "La recherche dans le domaine de la science des blockchains reçoit souvent des financements de manière opaque, et la recherche fondamentale reste non financée.", "funded": 0, "upvotes": 21536729, "downvotes": 27534651, "votes_result": 5997922, "votes_cast": 126, "f6_no_assessments": 6, "f6_rating": 3.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Cette proposition est présentée de manière claire et compréhensible, tant au niveau de l'énoncé du problème (renforcer la recherche financée axée sur la blockchain) que de la solution (le DAO de recherche vise à financer des articles de recherche universitaire évalués par des pairs dans le domaine de la science de la blockchain). Après avoir lu attentivement les valeurs, les objectifs et les processus sur leur site Web, je dirais (d'après mon expérience de travail en tant que chercheur) que la DAO suit de bonnes normes et procédures universitaires. Cardano a déjà la réputation d'être minutieux dans sa recherche et son développement, et d'après ma compréhension et mon opinion, cette proposition/ce projet aide Cardano à être davantage ce qu'il est déjà et ce qu'il vise à être. Un plus grand nombre de recherches évaluées par des pairs permettra non seulement d'accroître les possibilités de collaboration avec les universités, mais aussi d'étendre et de développer la science de la blockchain dans son ensemble, tout en renforçant la crédibilité de ce qui a déjà fait l'objet de recherches. C'est un processus lent, mais un processus axé sur la survie et le développement à long terme. Le financement demandé est assez important, couvrant 50% du budget total du défi, mais dans une perspective à long terme, cela semble être un investissement rentable. Cela dépend bien sûr de l'intention du projet de solliciter des fonds futurs. Je dirais que cette proposition appartient plus au défi divers qu'au défi DAOs love Cardano, puisqu'elle se concentre sur une véritable DAO, et non sur un outil développé pour faciliter l'intégration des DAOs dans Cardano. Je suis tout à fait d'accord pour dire que cette proposition répond efficacement à ce défi.", "q0r": 5, "q1": "L'équipe centrale (composée de 9 membres) semble avoir une bonne compréhension de l'écosystème Cardano et du domaine universitaire. D'après mon expérience du monde universitaire, le fait d'avoir des membres de l'équipe de différents niveaux académiques (et des universités sur 3 continents, ce que l'équipe déclare avoir) est bénéfique pour couvrir différents niveaux de sensibilisation. Ce que j'aurais aimé voir, c'est une présentation détaillée de l'équipe centrale et peut-être quelques exemples de leurs universités partenaires. Peut-être que mon expérience limitée des organisations décentralisées crée des idées fausses (je me ferai corriger si c'est le cas), mais décentralisé n'est pas synonyme d'anonyme. Le fait que le projet soit déjà en cours d'exécution, avec des partenariats avec plusieurs autres blockchains (le réseau Harmony, pour n'en citer qu'un. Jeu de mots), est un bon indicateur du niveau de faisabilité de la proposition. Si le projet souffre de difficultés pendant son développement et sa mise à l'échelle, il ne dépend pas uniquement du financement potentiel qu'il recevrait de l'écosystème Cardano. J'aimerais également que la proposition contienne une description plus détaillée de l'allocation budgétaire. Actuellement, la seule information incluse est le total des fonds (100 000, 50 % du budget total du défi), et que l'équipe vise à utiliser ces fonds pour couvrir les frais de voyage et la participation à des conférences. Ce qui est très bien, mais j'ai du mal à croire que l'ensemble du budget demandé sera alloué à cela. Des inclusions possibles pourraient être : Quelle part des fonds demandés sera allouée à la participation à des conférences ? Quelle part sera consacrée au développement du site web ? Une partie des fonds ira-t-elle à l'équipe centrale ? Ou la majeure partie des fonds sera-t-elle allouée au financement de nouveaux articles de recherche sur le développement de la blockchain (ce dernier point est évoqué dans la proposition, mais pourrait être présenté plus clairement en incluant des chiffres estimatifs). Les objectifs, le plan, le développement et les processus sont très clairs après avoir lu leurs documents sur leur site Web. Dans l'ensemble, je suis d'accord (bien qu'à peine) qu'il est très probable que cette proposition sera mise en œuvre avec succès (puisqu'il s'agit déjà d'un projet en cours visant à faire plus que ce qu'il fait déjà).", "q1r": 4, "q2": "Les résultats attendus sont clairs et raisonnables, il s'agit principalement de donner aux étudiants en doctorat la possibilité de présenter leurs travaux lors de nombreuses conférences (en mettant l'accent sur les universités et les institutions sous-financées) et de créer des bourses de recherche pour les chercheurs souhaitant faire des recherches sur les domaines liés à la blockchain/cryptographiques (spécifié sur le site Web clairement). Les étapes du projet sont essentiellement décrites comme l'augmentation de l'échelle de ces concepts, ce que je crois (en tant que chercheur et conseiller communautaire) est bon dans sa simplicité. La proposition aurait été renforcée si elle avait inclus quelques détails sur les mesures du succès (combien d'étudiants aux conférences, combien d'universités partenaires dans quel délai, combien d'articles ou de projets financés, etc.) Puisque la recherche sera évaluée par des pairs et que les audits sont une pratique courante dans tout milieu universitaire, il sera possible pour quiconque (même en dehors de la communauté) de suivre la progression et le développement des \"fruits du travail\" issus de ce projet. Le site web contient de très bonnes informations sur la transparence/les audits qui semblent légitimes et crédibles. Enfin, une discussion sur les risques et défis potentiels du développement de ce projet augmenterait à la fois la crédibilité de l'équipe (la perspective est bénéfique dans tout projet) et minimiserait le risque d'écueils potentiels pendant le développement. En conclusion, je conviens que la proposition me fournit suffisamment d'informations pour évaluer les progrès accomplis dans l'atteinte des objectifs fixés.", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 17, "ne": 12, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "J'aime beaucoup l'idée et la proposition de Research DAO. Je suis impliqué dans Catalyst depuis le début du fonds 2 en tant que CA, puis en tant que vCA et proposant. Je suis dans l'orbite de Cardano depuis 2017 et j'ai suivi de relativement près l'évolution de la recherche dans l'espace et le nom de Dionysis Zindros a été évoqué à de nombreuses reprises par les acteurs de l'écosystème Cardano lorsqu'ils citent la recherche fondamentale qui a conduit à des percées scientifiques dans cet espace. L'idée principale de Cardano est de tout décentraliser - afin de garantir que le système reste capable d'évoluer même si un acteur majeur est \"éliminé\". Nous savons tous que le nom de Cardano est synonyme de recherche et de fondamentaux solides. Je me suis personnellement interrogé sur la manière de décentraliser la recherche fondamentale afin de garantir une voie d'avenir qui ne dépende pas à 100 % du financement de la recherche par IOG - et cette proposition est un signe dans la bonne direction. Cette proposition a une signification et une importance profondes pour l'écosystème Cardano et est capable d'évoluer si elle s'avère être un succès. Il ne s'agit pas seulement de recherche - il s'agit aussi d'attirer les meilleurs jeunes esprits vers la meilleure plateforme blockchain scientifique. Un mariage du meilleur avec le meilleur. Excellente idée de proposer cette DAO de recherche - comme une voie pour le financement de la recherche universitaire ouverte et évaluée par les pairs dans le domaine de la science de la blockchain. Pourquoi cela concerne-t-il Cardano ? Comme l'indique le proposant : \"le DAO de recherche peut être utilisé pour améliorer Cardano, car il sera open source et sans brevet.\" Cardano est une recherche fondamentale... intégrée au code et à la communauté. Nous sommes la recherche en mouvement.", "q0r": 5, "q1": "Ce genre de proposition aurait pu venir de n'importe qui, mais ce n'est pas le cas. Elle est venue d'anciens chercheurs de haut niveau affiliés à IOG et à Emurgo et de chercheurs universitaires en blockchain et en cryptographie, en données et en sécurité. Les gouverneurs actuels de la DAO de recherche sont : Zeta Avarikioti (IST Autriche), Foteini Baldimtsi (George Mason University), Joseph Bonneau (University of Melbourne), Sebastien Guillemot (dcSpark), Angel Leon (FrostWire), Andrew Miller (UIUC), Dionysis Zindros (Stanford University).les noms des autres gouverneurs seront bientôt divulgués. Il s'agit d'une brochette de jeunes et brillants esprits issus des domaines de la blockchain, de la cryptographie, de la sécurité et de la confidentialité des données que tout système de blockchain souhaiterait attirer. Pour garantir l'indépendance, les membres de la Research DAO sont issus de diverses universités du monde entier. Ils proposent une nouvelle façon de décentraliser la recherche fondamentale et sont prêts à l'essayer par le biais du système Project Catalyst. Avec l'expérience et le plan présentés, il est certain que la proposition sera mise en œuvre avec succès - car toutes les personnes impliquées apprendront de ce projet. L'échec et le succès sont des succès dans ce domaine en évolution, car nous avons besoin de données, de modèles, de projets et de tentatives pratiques pour décentraliser la recherche. Le budget alloué correspond aux étapes prévues du DAO : (a) des bourses de voyage pour les étudiants de premier, deuxième et troisième cycle, puis (b) des subventions plus importantes pour soutenir le développement de nouvelles recherches. Pour le succès à long terme, le DAO prévoit d'établir un flux continu de subventions de la part des partenaires financiers et des membres afin d'assurer la continuité des opérations.", "q1r": 5, "q2": "Comme l'a précisé l'équipe, l'intégralité du financement sera rendue transparente par le biais d'une publication en ligne sur le site dédié https://researchdao.io/. En outre, l'ensemble des travaux de recherche financés par la DAO seront publiés sous une licence ouverte, tant pour les articles que pour le code, ce qui les rendra réutilisables pour l'écosystème au sens large. Étant donné que la phase initiale consistera à financer des bourses de voyage à des étudiants de premier, deuxième et troisième cycles et à des doctorants qui ont été acceptés pour présenter leurs articles de recherche dans des conférences évaluées par des pairs dans le domaine (initialement Financial Cryptography 2022), je m'attends à ce que les vérificateurs potentiels aient du mal à vérifier les détails, car les personnes impliquées sont des chercheurs éminents dans le domaine. J'aurais aimé voir de meilleures informations sur la part du budget allouée à chaque composante, mais il est peut-être encore trop tôt pour le dire.", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 16, "ne": 12, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "I think F7: Open Source Developer Ecosystem would have been a better fit, but it certainly is a MISC proposal. Just about anything fits. I do question the amount of money needed for this proposal. ", "q0r": 4, "q1": "Website was informative, but I had trouble finding the nine team members talked about in the proposal or the website. I would have liked more information, or information more easily found, about the experience of these nine team members.", "q1r": 3, "q2": "Information provided about the idea itself seems complete enough. Just troubling that I had issues finding who the nine team members are, and the amount of money requested (being 50% of the entire campaign) is troubling to me.", "q2r": 3, "assessor": "z_assessor_363", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "\"Supporting peer-review research transparently is a great job for the blockchain field in general and Cardano in particular. Because when blockchain platforms are researched and peer-reviewed, there will be no unfortunate financial problems in the future and better community trust in Blockchain.\r\n\r\nBut I think the DAO challenge will suit the proposal better\"", "q0r": 4, "q1": "\"I see the proposer has brought out a lot of relevant experience of the team in the academic community and industry, including PhDs, post-docs and professors at large universities worldwide. But I don't see the proposer giving any names or specific information about the people on the team via Linkedin, Facebook, Twitter, etc. So I'm quite skeptical about the claims about the experience of this team.\r\n\r\nIn addition, the proposal does not set out specific goals and tasks according to the roadmap and who will have the right experience to do that work.\r\n\r\nIn addition, the proposal has not shown which universities or organizations the proposal intends to approach for funding\"", "q1r": 2, "q2": "I only saw a proposal to get a fund of 100,000 USD (accounting for half of the amount of this challenge) but did not see them stating how to use this money for specific jobs. This makes this proposal nearly impossible to audit.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "The whitepaper for this proposal is solid. It presents the problem that they are addressing with quality solutions in the Cardano ecosystem. Contributing excellent research with such transparency and open source are what differentiates cryptocurrency from traditional finance. This proposal highly supports Cardano and aligns with its purpose - technology realized through evidence-based science. Moreover, this proposal gives the opportunity for students to take part and have meaningful impact for the future, and Cardano.", "q0r": 5, "q1": "The proposer has given a verifiable plan and a practical timeline for implementing grants and funding for conferences. Though roadmap is not stated, the key objectives are.", "q1r": 4, "q2": "Partnered with Harmony for funding, and stated that it will be publicized on their website are evident for auditability. In addition, the roadmap are well detailed with clear vision of how it will be valuable to the Cardano ecosystem. ", "q2r": 5, "assessor": "z_assessor_669", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The proposal seeks to launch a program of research into blockchain education in theory and practice.  Reading through the proposal, it will well fit into the Community events challenge.", "q0r": 3, "q1": "The team is made up of 9 members of academic community and industry including PhDs, post docs and professors at large universities worldwide, and they can implement the proposal successfully. The plan outlined is well understood.", "q1r": 3, "q2": "The road map shows 3 to 6 months project work with a budget of $100.000 which is not broken down into details. Auditing might raise a number of questions on how much is spent on what?", "q2r": 3, "assessor": "z_assessor_688", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}], "solution": "La DAO de recherche finance des recherches universitaires ouvertes et transparentes, évaluées par des pairs, dans le domaine de la science des blockchains, tant sur le plan théorique que pratique.", "experience": "Nos gouverneurs sont 9 membres de la communauté académique et de l'industrie, dont des docteurs, des post-docs et des professeurs de grandes universités du monde entier."}