{"id": 384163, "author": "benjamin.xo", "title": "Art at the Edge of The Universe", "url": "https://cardano.ideascale.com/a/dtd/384163-48088", "category": 26248, "amount": 130000, "description": "La plupart des projets NFT n'utilisent pas tout le potentiel créatif des contrats intelligents pour créer de nouveaux types d'œuvres d'art numériques.", "funded": 0, "upvotes": 15266504, "downvotes": 23692269, "votes_result": 8425765, "votes_cast": 96, "f6_no_assessments": 4, "f6_rating": 2.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "\"A redefining of what clothing can mean in a digital future and a restructuring of the relationship between dress, wearer and audience.\" Right... so... wearables? Like some pieces of modern art, the proposal leaves you guessing what is being proposed.", "q0r": 2, "q1": "The team can surely handle the art part... However, the roadmap and budget refers to a \"Cardano specialist\" ($75K) which makes me think such individual/team is not yet hired. Would have been good to know who is actually going to make this happen, technically speaking.\r\n\r\nThis almost feels like an ad for the project more than a proposal. Hopefully this helps you get the team together.", "q1r": 2, "q2": "The commentators were trying to help the proposer to bring more meat around the bones but no detailed budget / KPIs / deliverable have been added. Impossible to measure progress and audit.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 25, "ne": 1, "ng": 15, "nfo": 9, "vca_o": 1}, {"q0": "The proposal is for creating a \"Living\" NFT which will produce art by interrogating it. The idea is unique and has the support of established names in the art world. Since it is an NFT project with good potential, it is best financed by NFT sales and contributions by the community at this preliminary stage without seeing the output seems unreasonable. ", "q0r": 3, "q1": "The idea of living NFT is good and such innovations will be helpful to the community. However, clarity on the specifications is not explicit in the proposal.  The details of people who will do the development in Cardano is also not explicit in the proposal. ", "q1r": 3, "q2": "The proposal has requested for  $75,000 to support Specialist Cardano's development. Details on how this money is spent would have added value. In addition to this 15, K USD studio overheads are not clear. With these points, it is difficult to audit the proposal. Overall the budget rationale does not seem to be justified. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": " Relation to personal qualifications: I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. Also, I know the Cardano Ecosystem and ist actors pretty well by now so I am sure I can confidetly evaluate this proposal. The proposal provides a bit of a loose idea of an evolving artpiece as an NFT, the definition of which however is explained very confusingly. Thus, it can not really be assessed how beneficial this will be to the challenge or the Cardano ecosystem or how scalable it will be.", "q0r": 2, "q1": "Apart from a link to their website, which is not very extensive, the proposers have provided no evidence of relevant skills.  The proposer does not indicate the number of team members they want to use to implement the proposal.\r\nThe budget is outlined and broken down coarse-grained items, could however be more defined, e.G. by working hours regarding specific topics, thus it is difficult to assess whether the budget is reasonable.No risk assessment or plan regarding the case that additional funding is needed is defined.There is however a timetable with some milestones presented, and some of the resources used are described. Not a lot of the technical background is explained", "q1r": 3, "q2": " A roadmap with milestones and a time horizon for achievement is presented and some success metrics are shown. The problem and solution description are however a bit vague and incomprehensible.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 18, "ne": 2, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "I think the problem identified can be solved with the proposal that aims to put together the art and technology for the appreciation of the audience.", "q0r": 4, "q1": "I see the excitement of the proposer that spurs a workable plans to achieve his goals.  I also think that the experience and the professionalism of the proposers are the factors for the successful implementation.", "q1r": 5, "q2": "The qualitative measures of success  are not the normal quantitative measurement. Therefore I cannot agree nor disagree.", "q2r": 3, "assessor": "z_assessor_968", "no_vca": 26, "ne": 2, "ng": 12, "nfo": 12, "vca_o": 1}], "solution": "Une solution entièrement intégrée à la chaîne, qui produit des données accessibles à tous - une œuvre d'art vivante au sein d'un NFT qui nous permet de regarder vers l'intérieur.", "experience": "XO sont des artistes technologiques reconnus mondialement\nNO GHOST sont des technologues créatifs primés"}