{"id": 385045, "author": "dr.christian.unger", "title": "The Cardano Carbon Footprint", "url": "https://cardano.ideascale.com/a/dtd/385045-48088", "category": 26248, "amount": 28000, "description": "Nous voulons rendre Cardano neutre en carbone et positif pour le climat. Si nous connaissons l'empreinte carbone de Cardano, nous pouvons passer à un bilan positif.", "funded": 2, "upvotes": 110392950, "downvotes": 6341007, "votes_result": 104051943, "votes_cast": 448, "f6_no_assessments": 3, "f6_rating": 5.0, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=23000"], "media": [], "f6_assessments": [{"q0": "This subject is very important to me, especially when I see how other financial processes are very polluting to the environment. The solution to the problem is very clearly and extensively described. The creators are aware of the possible dangers and can therefore anticipate. The project is very transparent and will attract many people to be part of the community. The project is very well substantiated with calculations done by specialized people.", "q0r": 5, "q1": "The creators have a reliable background as climate scientists, environmental and computer engineers. They have the expertise needed for this project. They are currently actively working on this project. The proposal has enough evidence to support their project. The timeline is very positive but has been deliberately chosen because of all the expertise and ongoing projects. Setbacks or obstacles are taken into account. The budget has also been drawn up transparently and estimated realistically based on their experience.", "q1r": 5, "q2": "It is clear that the project wants to communicate transparently with the community. Even now, the project is thoroughly and clearly presented in the first goal event. This indicates that the project has been properly prepared and thus increases the chance of success. Results will be measurable, making success clearly visible.", "q2r": 5, "assessor": "z_assessor_667", "no_vca": 16, "ne": 3, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "With its mission to develop \"a solid methodology of carbon accounting across the Cardano ecosystem\" this ambitious proposal boldly tackles the climate challenge and has the potential to result in an instrument much needed in the world today, which I anticipate that (if successful) will further be embraced and adapted by the UN, by Governments and Governmental organizations (e.g. those involved in the Paris Accord) to evaluate status quo in various circumstances. If successful this proposal has the potential to place Cardano at the lead of the climate fight in the world. Moreover this project is absolutely aligned with the Cardano 2025 Mission and could significantly contribute to its accomplishment.", "q0r": 5, "q1": "The task undertaken is definitely a big challenge in itself, and so far major consortia have tackled similar challenges and discovered that the magnitude of the undertaking is difficult to conquer. From the proposal description it is clear that the proponents are aware of the difficulty and risks of the task at hand. However, given their perfect expertise and qualifications, and especially the very small budget they are requesting as of now to begin this crucial work,  I would wholeheartedly entrust them with my confidence for this high risk high reward undertaking. One thing which can mitigate the risk would be to find other external experts / dedicated groups / organizations who can evaluate the resulted methodology and eventually contribute to its further improvement. In my opinion this work is absolutely necessary, but it is only a beginning and it will take several iterations to make it into a useful tool that I anticipate will evolve along years to come. ", "q1r": 5, "q2": "I am quite familiar with the challenge of evaluating the success of such enormous (yet crucial) undertakings - given my mission to align Cardano 2025 goals with similar criteria. The proponents did their very best to provide KPIs and suggest evaluation metrics that are reasonable for this stage of the project, with a view of how these metrics can be used in the long run. Given the incipient stage of the project the KPIs proposed suffice even if it most probably will not be possible to evaluate all of them completely at the end of this stage.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "By Using Cardano's carbon footprint, we can make the shift to positive. They want to make Cardano carbon neutral and climate positive.\r\nproposal effectively addresses the challenge", "q0r": 5, "q1": "They proposer says Cardano greenhouse gas accounting standard verified by independent specialists, the Cardano Foundation, SPOs and delegators.\r\nBy given relevant experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has experienceworking on project climate scientists, environmental and computer engineers who run several stake pools and help organise CarbonNeutralCardano.org,\r\nHas given details on funds usage,\r\nThe above  information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 33, "ne": 4, "ng": 14, "nfo": 15, "vca_o": 1}], "solution": "Une norme Cardano de comptabilisation des gaz à effet de serre vérifiée par des spécialistes indépendants, la Fondation Cardano, les OPS et les délégataires.", "experience": "Nous sommes des climatologues, des ingénieurs en environnement et des informaticiens qui gèrent plusieurs groupes de joueurs et participent à l'organisation de CarbonNeutralCardano.org."}