{"id": 385048, "author": "amolagg", "title": "AI in geological analysis", "url": "https://cardano.ideascale.com/a/dtd/385048-48088", "category": 26248, "amount": 8000, "description": "Les techniques actuelles d'analyse géologique sont invasives par nature et très coûteuses.", "funded": 0, "upvotes": 16938466, "downvotes": 22524386, "votes_result": 5585920, "votes_cast": 95, "f6_no_assessments": 5, "f6_rating": 1.2, "videos": [], "media": [], "f6_assessments": [{"q0": "Ce problème est en effet difficile à classer dans un autre défi que le défi divers, en raison de sa nature spécifique (jeu de mots). L'idée principale est d'utiliser des algorithmes d'apprentissage profond pour élargir les possibilités d'analyse géographique non invasive. Il serait très bénéfique pour la proposition d'inclure quelques informations sur la façon dont cela serait pertinent pour l'écosystème Cardano directement, et comment la proposition vise à intégrer dans / utiliser Cardano. La proposition est très brièvement expliquée et nécessiterait plus d'informations sur le produit et le processus réels afin d'être comprise et évaluée. Les deux points clés mentionnés permettraient d'accroître la compréhensibilité du projet et de renforcer l'énoncé du problème. D'après mon expérience en tant que conseiller communautaire pour plusieurs fonds, avoir un lien clair avec Cardano ainsi qu'un énoncé clair du problème suivi d'une solution compréhensible et détaillée est essentiel lors de la rédaction des propositions. Pour l'instant, en raison du manque d'informations, il est difficile de comprendre l'étendue du projet (délais, étapes, coûts, etc.), mais nous y reviendrons plus tard. Sur la base des aspects mentionnés ci-dessus, je ne suis pas du tout d'accord pour dire que cette proposition relève efficacement le défi.", "q0r": 1, "q1": "La proposition pourrait contenir beaucoup plus d'informations sur le processus de développement, ainsi qu'une description de la manière dont les techniques d'analyse géologique seront développées et utilisées, et de leur impact par rapport aux techniques actuellement utilisées. Je ne suis en aucun cas géologue, mais j'ai une certaine expérience du travail de recherche, et je suggérerais d'ajouter plus de détails dans la proposition afin de la rendre plus compréhensible et tangible. Je suggérerais d'ajouter plus de détails dans la proposition afin de la rendre plus compréhensible et plus tangible. Il serait également bénéfique d'avoir une présentation de l'équipe principale/des auteurs de la proposition qui travailleront sur le projet. Combien d'années d'expérience en géologie l'équipe a-t-elle, est-elle composée de plusieurs membres, le prototype d'analyse géologique (mentionné dans la rubrique \"expérience pertinente\") est-il utilisé aujourd'hui ? Où peut-on en apprendre davantage à son sujet ? Le produit est-il destiné à être utilisé par des universitaires ? Plus important encore, après avoir répondu à toutes ces questions, je suggérerais de fournir une source vérifiable qui peut renforcer la compétence et l'expérience des membres de l'équipe. Peut-être par le biais de profils LinkedIn, d'universités partenaires, etc. Enfin, j'aurais aimé qu'un plan budgétaire plus détaillé soit inclus. Combien d'argent sera utilisé pour le développement, le matériel, etc. Et combien d'heures de travail sont estimées du début à la fin (peut-être par semaine) ? Dans l'ensemble, en raison du manque d'informations nécessaires, je ne suis pas du tout d'accord avec l'idée que cette proposition puisse être mise en œuvre avec succès.", "q1r": 1, "q2": "Comme mentionné précédemment, cette proposition bénéficierait grandement de l'inclusion d'une feuille de route avec des jalons sur un calendrier estimé. De cette façon, elle pourrait être auditée de manière transparente, et la communauté serait en mesure de suivre l'évolution du développement (de préférence par le biais des médias ou du site web du projet). Quelques suggestions de questions clés auxquelles répondre : Combien de mois/années faudra-t-il pour développer le prototype initial ? Comment sera-t-il testé et par qui ? Quelle sera la durée de la phase de test et comment le succès sera-t-il mesuré (indicateurs clés de performance) ? Par ailleurs, que se passe-t-il si un problème inattendu survient au cours du développement ? Comment l'équipe entend-elle lutter contre les difficultés potentielles au cours du processus ? L'inclusion dans la proposition d'un court texte de réflexion de l'équipe sur ces questions renforcera la crédibilité et la perspective de l'équipe, et si ces réflexions sont partagées avec la communauté, cela renforcera la confiance globale et la transparence de l'ensemble du projet. Pour les raisons qui viennent d'être décrites, je ne suis pas du tout d'accord pour dire que cette proposition me fournit suffisamment d'informations pour évaluer les progrès accomplis dans la réalisation de ses objectifs déclarés.", "q2r": 1, "assessor": "z_assessor_349", "no_vca": 21, "ne": 14, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "The proposal is to sponsor research for a noninvasive Geological survey using AI. The proposal will contribute to Geology however its benefit for Cardano looks remote and may not address the challenge except to create goodwill in the Scientist community. ", "q0r": 2, "q1": "The proposer has one year of experience as a Deep Learning Engineer and had been an Interned at Google. This may not be sufficient for the proposed Research. High-end reserch will require academic guidance from a Univercity. ", "q1r": 1, "q2": "The proposal is to fund Research project for an AI-based Geological survey. There is no major plan presented and who will validate the research. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 21, "ne": 0, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been voting since Fund 4 and have experience analyzing business requirements from 7 years of delivering software as a QA engineer.\r\nThough the problem statement is clear, it does not seem to me like it pertains to Cardano. The solution, while it does address the problem statement, is too vague in my opinion and again it is unclear what the role of Cardano, or blockchain for that matter, would play here. A good proposal should always outline this, in order for non-technical voters to understand why it would be valuable to fund it. Due to this and the lack of any type of KPI or concrete goal, I have to strongly disagree that this proposal effectively addresses the challenge.", "q0r": 1, "q1": "The proposer claims to have 1 year of experience as a Deep Learning Enginner and to have interned at Google, but no references are provided to prove this. Please keep in mind that it is pretty much expected of all proposals now to provide at least a Linkedin profile, or something similar, where the community can see your relevant experience and background.\r\nI strongly disagree that this proposal can be implemented successfully, due to the lack of information on the team who would work on this, no details on how the budget would be used, no risk analysis and no plan outlining the technical approach and the usage of resources concretely. Please keep in mind that these are all vital parts of a proposal.", "q1r": 1, "q2": "Unfortunately, no roadmap is provided, there are no KPI's and it is basically unclear what this proposal aims to do to better the Cardano ecosystem, so I strongly disagree that this proposal is auditable.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 22, "ne": 4, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is about building a Non-Invasive Geological analysis system, highly efficient and accurate through Deep Learning Algorithms. It seems that this proposal is incomplete. The problem statement [current Geological Analysis techniques are invasive in nature and very expansion] is clear but not explained in detail. Conceptually, I think the proposed solution has a certain fit for the challenge. The solution is oriented towards building such a platform having satisfactory and has potential impact if completed. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1.", "q0r": 1, "q1": "It's not easy to evaluate a proposal that is incomplete [limited information of experience, doesn't have any roadmap or KPIs, and of course the risk is not defined]. Therefore, definitely, there are no grounds to agree on the feasibility of this proposal, however, if I had to give one piece of advice, I think: in case it is necessary to complete this proposal in the next Catalysts in the future, the proposer should pay attention to ensure that the following components are fully met: (i) Goals & target; (2) road map/timeline (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge. Based on the given information, I strongly disagree with this proposal's feasible, and would give it a score of 1.", "q1r": 1, "q2": "For an incomplete proposal like this one, transparency can't be guaranteed. Therefore, I don't have much advice. Based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 17, "ne": 4, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "Thank you for your interest in natural matters. besides i would like to know the real problem you bring up is that we are going to have explicit concrete method in Geology. Do you want a method to protect nature or a clear method to exploit more effectively? When the problem is clear I think we can understand the effective method that AI will bring", "q0r": 2, "q1": "In terms of feasibility, I hope you can elaborate more on your personal profile as well as your team such as whether there is someone responsible for the financial or blockchain aspect. Also I hope you can show us the short and long term project roadmap. And the criteria you need to achieve in the future, I think it is necessary for your project. The nature of this project requires state permission as well as a high level of expertise in geology. Currently, many countries can already use AI for jobs ranging from geological measurement and analysis to real estate. This project will be more feasible if you have specific plans and clear roadmap. From there we can build from high community demand.", "q1r": 2, "q2": "In the roadmap I hope you can describe what value you want here, \r\nvì số tiền bạn chi cho AI là rất tốn kém. you require an investment of up to 8000$ which is quite a large amount.You should explain how you will use this money? For how long and how can people see you using it?", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Grâce aux algorithmes d'apprentissage profond, nous pouvons construire un système d'analyse géologique non invasif, hautement efficace et précis.", "experience": "A été financé pour le développement du prototype d'un système géologique.\nIngénieur en apprentissage profond - 1 an\nStagiaire chez Google."}