{"id": 385108, "author": "lennon.m", "title": "Africans acquiring ADA through USSD", "url": "https://cardano.ideascale.com/a/dtd/385108-48088", "category": 26248, "amount": 180000, "description": "Plus de 50 % des Africains utilisent encore des téléphones non intelligents. Or, la plupart des bourses de crypto-monnaies en Afrique ne sont accessibles que par des appareils intelligents.", "funded": 0, "upvotes": 17261589, "downvotes": 24862827, "votes_result": 7601238, "votes_cast": 100, "f6_no_assessments": 6, "f6_rating": 1.9444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal lists ADA In, Binusu Exchange Platform, USSD Wallet, and  Binusu Merchant. The proposal also includes Community Training and development. These are good ideas, but the proposal's aim is not explicit except to promote a particular exchange. ", "q0r": 3, "q1": "The proposer is requesting 60K ADA for trading liquidity. Iam not able to understand why this is included. the proposer also has not included any past references.", "q1r": 2, "q2": "There are no KPIs, means to achieve them. The breakdown is vague and not justified with rational. its difficult to audit.", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 18, "ne": 0, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seems interesting but the few descriptions doesn't help us to understand many part of the project as for instance:\r\n•\tIt seems that you don't need budget not to develop the project but to run it\r\n•\tYou don't explain how your project can work without requested funds\r\n•\tYou don't explain what you are going to develop with the requested funds\r\n", "q0r": 2, "q1": "You did not describe your team and their experience. The video of your project seems working well but you did not show all the different function (especially how you deal with transferring ADA with USSD to another person. \r\nYou did not present a planning of developpement but just a business model to operate the product just with the fund requested\r\nYou don't show how you will market your project (advertisement etc…)\r\n", "q1r": 2, "q2": "You have to show a planning of developpement and KPI ", "q2r": 1, "assessor": "z_assessor_602", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "\"USSD is a communication protocol that uses codes generated by characters available on the phone. USSD messages can contain up to 182 characters and create concurrent conversations between the phone and another device, usually a network or server.\r\n\r\nUSSD has applications related to the banking sector. It's fast, light, and ideal for things like checking balances and transferring funds. Sending messages via USSD is much faster than mobile banking apps, especially since it can work without mobile data.\r\n\r\nI'm really excited about the idea of using USSD to help people who don't have smart phones or internet access to blockchain features. \r\n\r\nBut there is a big problem here is how to connect USSD with blockchain? That is almost impossible. I suspect that you are trying to take other people's money through a bank account using the USSD protocol, and then give the user a number that represents the number of ADA they have, but it is really just a number that you sent to the user. In essence, the user does not own any ADA coins. In my opinion, this could be some kind of scam project if you don't specify what your solution is. I really need a more detailed product description\"", "q0r": 1, "q1": "\"The team of developed proposal two enterprise scale blockchain-based solutions that are currently deployed at National level identity solving challenges. With this experience, the team is fully capable of implementing this proposal. But I don't see any information about these 2 members in the proposal, so I have some doubts about the team of the proposal.\r\n\r\nAs I mentioned in the impact of this proposal. The detailed description of the product and solution of the proposal is extremely important so that everyone can see how you do it. Otherwise, to my knowledge you are trying to take other people's money and give them a number to say they have some amount of ADA\"", "q1r": 1, "q2": "\"Proposal showed us how they use their money. But they don't state what the goal of the proposal is. How many people will this protocol reach? How many transactions help generate with ADA? How many people will use this product?\r\nBesides, it seems unreasonable to propose a request fund up to $180,000 with an unspecified plan and a lot of goals and milestones.\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 7, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about providing one of the first USSD-based crypto platforms that enables Africans to buy, sell, send, invest, and borrow in crypto/ADA. This is an interesting and useful idea. However, the problem is abstract [why/what proof of \" over 50% of Africans still use non-smartphones\" ?], this should be described more in detail because part of the community does not understand the financial context in Africa.  However, the solution is clear, fit to the challenge, but does not clearly impact the Cardano ecosystem, the proposer should analyze in detail. Therefore, based on the given information, I am neutral with this proposal's impact, I can rate it with a score of 3", "q0r": 3, "q1": "Team profile is provided but still remains very abstract without any reference/proof (documents / links,...) for varifying. No information of demo/pilot is provided. The budget is clear with structure and explanation of calculation base. However, the risk is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "For better understanding, the team profile should be described more in detail with reference/proof (documents/links,...) for verifying; and risk (and mitigation) should be provided. Based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "According to the proposal, the proposer has built one of the first USSD crypto platforms that enables Africans to trade in crypto/ADA. Not much details in the proposal.", "q0r": 3, "q1": "The team is made up of 2 experts who have already developed 2 enterprise scale blockchain based solutions , even being used at National level to solve identity challenges. The plan mentions that they will list ADA on other crypto platforms ; create local Cardano Community and make ADA payment popular; Train the Community , all to make implementation successful.", "q1r": 3, "q2": "The road map is in months but the particular names of the month not mentioned. The budget breakdown is clear but the total budget is more than half of the amount for the whole challenge, hence my 2 star rating.", "q2r": 2, "assessor": "z_assessor_688", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "the idea is good. however, we must look into the core of the problem. why Africans doesn't use smartphone. is it because of economical issue or coverage issue or etc..second is about security layer of what smart device offer is promising, they have email notifications, google authenticator, or 2fa..how do they register or even communicate with the service which mostly via email.", "q0r": 1, "q1": "the plan needs to be more specific in term of time line, security layer, maybe there is operator that double confirm the transaction with the user. and how the community receive updates in current news in the market. ", "q1r": 1, "q2": "idea and application is outstanding, very friendly user but to implement to the real community the proposer need to prove that the idea or application is hack proof and protected during every transaction.", "q2r": 2, "assessor": "z_assessor_957", "no_vca": 21, "ne": 0, "ng": 13, "nfo": 8, "vca_o": 1}], "solution": "Nous avons construit l'une des premières plateformes cryptographiques basées sur l'USSD qui permet aux Africains d'acheter, de vendre, d'envoyer, d'investir et d'emprunter en crypto/ADA.", "experience": "Nous avons développé deux solutions basées sur la blockchain à l'échelle de l'entreprise, qui sont actuellement déployées au niveau national pour relever les défis liés à l'identité."}