{"id": 385152, "author": "gufmar", "title": "Native Tokenomics Template", "url": "https://cardano.ideascale.com/a/dtd/385152-48088", "category": 26248, "amount": 10000, "description": "Les projets industriels et commerciaux ne comprennent souvent pas comment les caractéristiques et les fonctions de Cardano Blockchain peuvent être utilisées efficacement.", "funded": 0, "upvotes": 16975383, "downvotes": 21960801, "votes_result": 4985418, "votes_cast": 85, "f6_no_assessments": 5, "f6_rating": 1.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "the proposal does not state one clear problem. No informations or examples are added where companies are struggling with tokenomics and how exaclty a template would help against this problem.", "q0r": 2, "q1": "From the Github It looks like the proposer does operate a Stakepool. On the other hand there is no proof of his experience. It would help if the linkedin would be added so a CA can verify the experience. Also there is no roadmap, budget or any metrics to measure the succes of the proposal.", "q1r": 1, "q2": "This proposal only contains to sentences and is almost impossible to assess properly.  One can get the idea but more is difficult. I would recommend to re-submit a more detailed proposal. THink of it like a business plan.", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 23, "ne": 2, "ng": 18, "nfo": 3, "vca_o": 1}, {"q0": " Relation to personal qualifications: I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. These qualifications however are difficult to bring in in a project where nothing is defined, except for the fact, that as an project engineer I know that projects without dedicated planning are prone to fail.This proposal identifies a problem which needs to be solved, however it does not properly articulate a solution. Just writing a concept paper without a clear research scope defined will not neccessarily benefit the Cardano ecosystem and makes it impossible to tell how well problems like scalability or the general challenge will be adressed.", "q0r": 1, "q1": "According to his Github, the proposer seems to have some skills, however they fail to specify their skills for the proposal, or to define any requirements, be it team members, resources, technical background or the budget. In general, none of these points is explained and the overall implementation plan, regarding a timeline and details of the implementation are not explained at all. Feedback: Please make a proper plan of what you want to achieve and how you want to do that. Tokenomics can be a quite wide field, maybe concretize the question you want to research.", "q1r": 2, "q2": "The problem description is clear, however the solution is not described in detail. No milestones, metrics and KPIs are presented to give the proposal an auditable scope.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 22, "ne": 6, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Even if the idea seems interesting you need too explain more how this will contribute to develop cardano and also how you will deal with it", "q0r": 2, "q1": "You need to describe a lot more the project ( planning, budget, team ) etc… in order for the community to know more about your project", "q1r": 1, "q2": "No KPI and milestones for your projet. You need to develop it more ", "q2r": 1, "assessor": "z_assessor_602", "no_vca": 20, "ne": 0, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "I still don't really understand what the specific solution and product of this proposal is. Although the problem of Industry and business projects often do not understand how Cardano Blockchain features and functions can be used efficiently is a real problem. But we need a solution and a concrete plan rather than an idea", "q0r": 1, "q1": "Proposer is a regular contributor on github. I appreciate this. But the lack of a specific solution and plan makes this proposal very difficult to come true. When I read the proposer's comment, he/she wanted to plan more specifically at fund 8. I hope to see a great solution of the proposal at fund 8.", "q1r": 1, "q2": "\"No timeline or clear deliverables have been mentioned thus making it hard to audit. The proposer has not defined what success would be\r\nHope to see you in fund 8\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 20, "ne": 2, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "There is no roadmap, KPIs/metrics, and budget breakdown,..., the solution is still very abstract, not a clear impact on the Cardano ecosystem as a whole. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "The proposer's experience is briefly described as 20yrs Internet Service Provider\r\n4yrs Cardano enthusiast, SPO, Ambassador, however, there is no proof/external link for verification. Besides, a detailed plan is not provided, therefore, there is no proof of feasibility. Based on the given information, I disagree that it is highly likely that this proposal will be implemented successfully, and would give it a score of 2.", "q1r": 2, "q2": "There is no roadmap, KPIs/metrics, and budget breakdown,... so auditability/transparency can not be guaranteed. Therefore, based on the given information, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Un concept général de tokenomics, bien décrit et assorti d'exemples pratiques, devrait servir de modèle aux parties intéressées", "experience": "20 ans fournisseur d'accès Internet\n4 ans, enthousiaste de Cardano, SPO, Ambassadeur"}