{"id": 367000, "author": "", "title": "Japanese SPO community management", "url": "https://cardano.ideascale.com/a/dtd/367000-48088", "category": 26111, "amount": 16830, "description": "\\-Few English-speakers in Japan\n\n\\-Most of technical documents are in English\n\n\\-Difficulty in expanding Japanese community", "f6_no_assessments": 3, "f6_rating": 4.5555555555555545, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great project to support the Japanese community by continuing to provide technical documentation and Japanese language support on Stake Pool Operation.", "q0r": 5, "q1": "The proposers run a Stake Pool and are already providing this support. They have a clear plan and costing on continuation of this support.", "q1r": 5, "q2": "This plan will be simple to audit the provision of  documentation and support in Japanese on Stake Pool Operation. They have given some historical numbers on the increase in SPO's since their current support, it would be nice to have some goals going forward against which success can be monitored. Is there a number of stake pools in the future where the market is saturated and no new ones are required of funding for this information could come from the Japanese stake pool community themselves?", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is well defined and fits perfectly with the development of multilingual content, in this case focused on the Japanese community.", "q0r": 5, "q1": "The proposal seems to have a huge support from the community and are SPOs of great traction and development in the Cardano ecosystem.", "q1r": 5, "q2": "They are very clear about the vision of the proposal, however there are no KPIs or other metrics to measure the effectiveness of the proposal.", "q2r": 3, "assessor": "z_assessor_372", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "The challenge is that there are few English-speakers in Japan, that most of the technical documents are in English, and that there is difficulty in expanding Japanese community. This proposal aims to manage the Japanese SPO community and create/continuously update a technical support website about operating a stake pool. This proposal productively addresses the challenge.", "q0r": 5, "q1": "The team is experienced and has developed a Japanese GitHub repository currently launched, and has a plan to manage their proposal. This project is likely to succeed.", "q1r": 4, "q2": "Based on the proposal, there are a decent amount of milestones this team aims to accomplish within the first few months, which would make it auditable for the progress and success of this proposal.", "q2r": 4, "assessor": "z_assessor_431", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Managing Japanese SPO community to support stakepool operators\n\nCreating and updating technical support website about operating a stake pool", "experience": "Server engineering  6years \n\nWEB system development 18years\n\nStake pool operator\n\nUpdating Stakepool building instruction JP manual"}