{"id": 367091, "author": "", "title": "Content translation for Chinese", "url": "https://cardano.ideascale.com/a/dtd/367091-48088", "category": 26111, "amount": 12000, "description": "\\- Chinese version of the Cardano related content is needed.\n\n\\- Project Catalyst mainly in English, barrier to Chinese speakers.", "f6_no_assessments": 5, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The bulk of this proposal is to provide translations of 5 catalyst projects per month for 12 months into Chinese on 4 platforms frequented by Chinese users, along with 1 15 minute video per month. This could be useful to pull more Chinese users into Catalyst. Given Catalysts quarterly timeframe for new proposal rounds, it is not clear that providing monthly translations fits well with that cycle.", "q0r": 4, "q1": "The proposers are already involved in running a Cardano chat board on the Teiba platform and are proficient translators. It would be nice to know how many members are in the current Teiba Cardano group. The budget is worked out as a multiplier of the number of documents to be translated x the number of platforms. Once a document is translated, surely the cost is lowered for each additional platform it is posted too?", "q1r": 4, "q2": "The deliverables under this proposal are relatively simple to audit. No metrics for success have been proposed. Possible interesting metrics around Catalyst participation such as could be proposals submitted or reviewed by members of their groups? Do they expect this proposal to increase their membership numbers? It would be good to have some goals around these metrics to measure success against.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Building an info hub will be a good way to address the language barrier. Opening catalyst proposals, developer guides in Chinese will create a good impact in growing cardano community", "q0r": 4, "q1": "Experience as a developer and fluent English speaker is a great addition to the relevant experience, I would suggest adding some links to support this, which will make the proposal more reliable. The project plan looks achievable", "q1r": 3, "q2": "As the proposal says to deliver it on different platforms, the success of the proposal can be measured through that also the fund's breakdown is per platform and time order, so that would be sufficient.", "q2r": 4, "assessor": "z_assessor_208", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "China is the most populous country in the world. Considering this, the potencial impact of translating Cardano and Project Catalyst content to Chinese is huge. The question is: how the amount of content proposed in this proposal can generate a impact that justifies the requested funds? \r\n", "q0r": 4, "q1": "At the Project Catalyst part, who would make the peer review of the ideas and proposal translations? The requested funds could be better explained. How can the proposer garantee he is going to be enough to make all the things said on the proposal during this first year?\r\n", "q1r": 3, "q2": "The proposal can be audited by the metrics of the platforms that will be used (that show numbers of views, likes, visits, etc). \r\n", "q2r": 5, "assessor": "z_assessor_409", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The proposal meets the objectives of the challenge well, as it promises to translate the relevant contents of the Cardano ecosystem into the Chinese language. However, I have identified some problems here. The author does not explain what are some words he cites, such as: \"Baidu / Tieba / Bilibili\", which are probably sites or tools (or even cities?) Known in China, but not so popular around the world . It would be interesting if he made such terms more searchable for readers of the proposal. Another issue is that, despite suffering some issue in relation to the project, as I will comment on the issue of auditability, the author does not explain how the bridge between the project itself and the public is exposed. Sure, he intends to post a portion of the translated content on the community forum, but in relation to other hosting sites, how would members of the Cardano ecosystem become aware of such posts? It would be very positive if these other issues clarified. Therefore, I found the proposal impressive, but lacking in detail.", "q0r": 3, "q1": "In relation to this item, unfortunately I found that there was a lack of detail. I think this because it is an activity that requires the work of a whole team, not just one person. The author claims to work as a software developer, which is an extremely relevant role for the development of several proposals for the Catalyst project, but it does not directly relate to the activities of that proposal. He also says that he has already done translation work for companies, which is really positive if these works are attached, in order to exemplify what kind of translation he has done, exactly. As well as his participation in the forum: it would be important for him to provide links to some of his posts as well. In addition, as I said at the beginning of the comment, I would like to rank other professionals in carrying out the activities of the proposal, in addition to the translators themselves, people responsible for filming and editing the videos that are mentioned here, people focused on an editorial organization of the posts in the forums and on other platforms... Unfortunately, in my opinion the author leaves something to be desired when it comes to preparing for a project execution.", "q1r": 2, "q2": "Despite the author of the proposal telling us what are the target contents of the translation, as well as some places where it would be posted and the frequency at which the series will be published, I still found the details of the proposal too short. For example, as I mentioned in the item \"impact\", it would be interesting if he attaches links from the places where they will be available. It would also be good if he details a little more regarding the translated content itself. If there are 5 translated proposals per month, how many would go to each platform, or how would 5 be posted on all of them? Another question, it would be interesting to know the nature of these \"really good\" contents, or more relevant to be translated into video, and also who would present them, whether it would be the author or a professional focused on a communication area. I didn't quite understand the calculation he made at the end of the proposal to justify the amount requested in the financing. And if the author says he will work on the project only on weekends, it is not very clear what would be the amount / hour of work that is combined here. For these reasons, I believe that, despite providing us with basic information about the auditability of the proposal, the whole is still considerably confused.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposer has a clear plan and great idea! They have a reasonable budget and good ideas! Maybe something they could improve on next time would be to add a timeline or set of goals to their plan. They want to deliver the same things Cardano supplies to English speakers to Chinese speakers as well.", "q0r": 4, "q1": "They have a specific plan that states what they want to do and how they will do it, they have been a software developer for 2 years and have translated many documents already and have good experience in this area.", "q1r": 5, "q2": "It is a good plan but it would be helpful if there was a timeline of when and how they would complete things to make it easier to audit their success and progress.", "q2r": 3, "assessor": "z_assessor_585", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "Build a info hub in Baidu Tieba and Bilibili, make videos about our technology and translate proposals from project Catalyst.", "experience": "Software Developer 2 years.\n\nTranslated documents for companies.\n\nCET 6 English Capability.\n\nCardano Tieba Forum manager."}