{"id": 367619, "author": "", "title": "Multilingual NFT artist Giveaway", "url": "https://cardano.ideascale.com/a/dtd/367619-48088", "category": 26111, "amount": 29000, "description": "How to increase ADA exposure to our Stake SPO delegation and Rewards system?\n\nIn a multilingual, worldwide stage.", "f6_no_assessments": 6, "f6_rating": 1.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "This is more an idea asking for significant funding than a proposal. Please provide details on exactly what would be produced and when, how they will be given away and marketed, and what impact you expect this to have on the community. ", "q0r": 3, "q1": "The proposer asks for 29,000 to fund staff for 2 years to create NFTs in 19+ languages (17+ of which not specified) to giveaway to promote stake pools and Stake pool operators.\r\nEvidence stated is that the proposer has been funded before and they have done a trial. References to these would be good to see. \r\nPlease provide a plan with timelines and deliverables including a discussion of how you would market this. How are you reaching people outside the current Cardano ecosystem which would be required to increase exposure to ADA and SPO's?", "q1r": 1, "q2": "As there is no real plan, deliverables or timeline, it will be impossible to audit the progress of the proposal. It would be good to see how the proposers would define success? Is it the number of people who receive the NFT's, or who register to receive them? Is it the value of the NFT's in the secondary market or media exposure to their existence? If they just go to people already in the Cardano ecosystem does this achieve the aim of the project of increasing exposure to ADA and SPO's? ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 13, "ne": 5, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This is a further fund request from subsequent funding (Fund 5) but it would have been great to highlight the current stage of the project and milestones accomplished before requesting for further funds.\r\n The proposal should have included a link to the initial funding request for reference.\r\n\r\nI neither agree nor disagree.", "q0r": 3, "q1": "The proposal did not provide verifiable link of given experience and an implementation plan was not provided.\r\nThe proposal did not provide current milestone achieved in Fund 5 and requesting for more funds.\r\nI disagree", "q1r": 2, "q2": "The proposal did not provide sufficient information to audit the progress and success of the proposal solution.\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "Draft proposal. There is no clarity in the problem description and suggested solution. There is no clear relationship between the idea and the challenge.\r\nThere is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. I recommend including a detailed plan, without it there is no way to establish a context between the team's experience and feasibility.\r\nI would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "While this proposal states that the NFT giveaway will be done \"in a multilingual / worldwide stage\" and that a Japanese/English version is in development, there is very little else about it that addresses the challenge. The proposal seems to be focused on the NFT giveaway, not the multilingual element. If this proposal is primarily about the Japanese version (which is the linkage to the challenge), there should be significantly more explanation about the need for a Japanese version, how it would be developed, and how it would be promoted in Japan. Therefore, I disagree that this proposal effectively addresses the challenge.", "q0r": 2, "q1": "The proposer seems to articulate sufficient resources to deploy a Japanese version, including a sufficient team, previous Catalyst funding, and a budget that seems more than adequate (indeed rather high for translation). However, it would be helpful to have an explanation of how the translation / localization will be performed, and with what resources. Therefore, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.", "q1r": 3, "q2": "My evaluation of auditability is based on the assumption that what is being delivered is a Japanese translation / localization of the NFT giveaway. With that assumption, it should be possible to audit whether a translation has actually been completed. However, beyond that there is insufficient information on KPIs, expected progress in 3/6/12 months, how the translation will be performed, or what the specific NFT giveaway will be that will be translated. Therefore, I disagree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 2, "assessor": "z_assessor_495", "no_vca": 7, "ne": 4, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "From the title and the small bit of info given, it sounds like it might be an interesting concept if it was written up, but it looks like the proposer forgot to complete it.  It doesn't say in any detail what it is proposing, and the only indication that the idea might address this challenge is a mention of \"Japanse/English version\". It seems to rely on the reader knowing about the proposer's previous work, and just says \"same concept\" – but no links are given to this previous work. As the proposal stands, it doesn't address the challenge.", "q0r": 2, "q1": "It would be helpful to have some information about the proposer's background and skills. No timeplan is given, or milestones. There is a budget total, but no itemisation; and it would be helpful if the proposal could be clear on whether the funds will be used to take on one additional staff member or two. It would also be useful if the proposal could describe some of the risks and say how they will mitigate them. Based on this info it is highly unlikely the proposal would be implemented.", "q1r": 1, "q2": "The proposer needs to explain what their idea of \"success\" would be, ideally trying to align that with the aims of the challenge; suggest some things that can be gathered and measured to show whether this success has been achieved; and say hoiw they will gather that information. As the proposal stands, there is no info on which to audit the project.", "q2r": 1, "assessor": "z_assessor_540", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal didn't have a plan or way to give information, they didn't have a timeline or explained their expensive budget. It is a great idea and has amazing potential, but the proposal needs some more work.", "q0r": 3, "q1": "Since there was no plan it is hard to decide whether this proposal will be implemented successfully. It lacks in detail that is much needed. Including a way to explain their $29 000 USD  fund would be a good thing to include for next time.", "q1r": 3, "q2": "There is no timeline or way to see their specific goals or end success because of the lack of detail and planning.\r\nNext time something good to work on would be to make a more detailed plan and set of timelines, milestones and budget usages.", "q2r": 2, "assessor": "z_assessor_585", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Already created 999,999 NFT giveaway\n\nDone as an experiment\n\nNow doing Japanese/English version.\n\nSame concept\n\nMore 17+ languages coming", "experience": "Funded During Fund 5\n\nPortable Raspberry pi\n\nCryptocurrency devices (4)\n\nUbuntu / Samsung / Pi-4 / Cardano\n\nCleveland Ohio USA / Philippines"}