{"id": 368876, "author": "", "title": "Coding Pods", "url": "https://cardano.ideascale.com/a/dtd/368876-48088", "category": 26111, "amount": 10000, "description": "We are at a disadvantage if we are unable to communicate technological innovations because of language barriors.", "f6_no_assessments": 6, "f6_rating": 1.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This could be a nice idea however its not clear how this would work. Can the two language groups communicate across the language barrier? What is the benefit over learning in your on language? There is little detail on how the funding would be used, how many pods would be created of which language groups targeted. ", "q0r": 1, "q1": "This proposal has no plan, deliverables or timelines and no relevant experience has been given. Please provide a plan of how you would start this, who the target market is, what would be delivered over what format, what the budget would be used for and which language groups and locations you would target.", "q1r": 1, "q2": "The proposal needs more information for progress and success to be measured. in addition to a plan a deliverables against which progress could be measured, what are the goals of this project. I.e, how many language pairs and people do you expect learn to code and over what timeframe?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 11, "ne": 5, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal to create online coding pods where groups from two different languages work together to get up to speed that supposed to solve the challenge of language barriers wasn't effectively addressed. ", "q0r": 1, "q1": "Proposer lacks credentials and plans to properly implement this proposal.", "q1r": 1, "q2": "The proposal has little to nothing information. The key performance indicators (KPIs), timeline, milestone wasn't included. The ability to audit this proposal needs clearer metrics that can be easily viewed to determine if the proposal is successful. ", "q2r": 1, "assessor": "z_assessor_340", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "The idea is good but the explanation was poor to have a conclusion about what's the impact amplitude that it would create in Cardano Ecosystem. It's dificult to know how organize and scale the continuation of this proposal considering that the explanation of the proposal itself is not clear.\r\n", "q0r": 1, "q1": "It's not clear the proposal roadmap with the step to step explanation of what's going to be done and how much would cost each part of it. The proposal doesn't describe the plan to guide the execution, the resources needed, the timeline to the project happen, the platform necessary and some other factors that assessers need to know to have a forecast about the project feasibility. The proposer is asking for USD 10000 for a proposal that he doesn't explain well how would happen. \r\n", "q1r": 1, "q2": "The proposal doesn't show a clear way to audit it. To audit something, it's necessary having numbers of the goals in each item in order to compare to the realized number. This proposal doesn't show metrics neighter milestones to follow. Considering this, how can we audit the proposal success? \r\n", "q2r": 1, "assessor": "z_assessor_409", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Draft proposal. The problem description is vague. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I am an active member of the Cardano community and I have 7 years of experience delivering software projects as a QA. \r\nWhile the problem statement fits in this challenge and I agree with it, the solution and details about the implementation are too vague in my opinion.\r\n\"Create online coding pods where groups from two different languages work together to get up to speed.\" How would groups from two different languages work together? Get up to speed on what?\r\n\"After a measurable group competency the pods split creating new pods with some of the best spearheading new pods with new participants.\" What is measurable group competency referring to? Who will initially organize the pods? What would the coding challenges consist of? What method would be used to help breach the language gaps and allow non-English speakers to contribute to the ecosystem?\r\nDue to the vagueness of the information provided as mentioned above and the fact that I can see no metrics for success mentioned anywhere, I strongly disagree this proposal effectively addresses the challenge.\r\nFor the proposal to receive a higher score, concrete details on how these coding pods would work and who would organize them need to be added.", "q0r": 1, "q1": "I do not think this proposal has any chance of being implemented successfully. Here is my assessment:\r\n- The proposer has not provided any details about himself whatsoever and I cannot count \"Business\" as relevant experience here\r\n- The proposer has been a member of Project Catalyst only since the 22nd of August, 2021\r\n- I cannot find any previous contributions of the proposer to the Cardano ecosystem\r\n- There are no details in the proposal about who will do what, when and how\r\n- The budget is very large and there is no justification on how it is intended to be used\r\n- Between 22 and 25 August, the proposer has created 7 separate proposals, all suffering from the same issues as this one. This leads me to suspect that the proposals were created en masse in the hopes of gaming the system and obtaining some funds. I apologize if I am wrong.\r\nTo make this proposal feasible, the proposer needs to provide more information about himself, about the people who will help him and as mentioned earlier, to clarify the detailed approach that will be used in order to help non-English speakers contribute to the Cardano ecosystem.", "q1r": 1, "q2": "I cannot find any information at all that explains how the progress and success of the proposal would be tracked, if it were to be funded.\r\nAs such, I completely disagree that the proposal is auditable.\r\nIn order for this to be fixed, the proposer needs to provide a clear roadmap describing what will be done when and how, with specific milestones and a time-horizon for the implementation. Along with this, key progress indicators also have to be mentioned.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposer has not included a plan of how to reach the goal of creating Coding pods, they have not included a timeline, or and explanation for the budget uses. These would be some nice things to include for next time.", "q0r": 1, "q1": "There is no plan or timeline. There are no facts or reasons and no sets of goals or explanations for the budget. As well as this when it came to the experience section they just put business. What type of business, for how long? Do you have teammates? This would be some information to provide for next time.", "q1r": 1, "q2": "There isn't much information and there isn't much planning either. Without these it makes it hard to audit the success and progress towards their goal of getting Coding pods.", "q2r": 1, "assessor": "z_assessor_585", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Create online coding pods where groups from two different languages work together to get up to speed.", "experience": "Business"}