{"id": 368922, "author": "", "title": "ALDEA Wiki - Phase 2 - Portuguese", "url": "https://cardano.ideascale.com/a/dtd/368922-48088", "category": 26111, "amount": 5620, "description": "There is no place where to find all the documentation and information being produced by an ever growing Cardano community.", "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This looks like a good proposal to continue to fund a community driven Portuguese hub for Cardano knowledge. It is small and well targeted, with new proposals each fund to reduce risk to the community in funding it.", "q0r": 5, "q1": "The proposers already have a community driven product and are seeking  small amount of funding to move through the next 2 month phase. They have a provided a detailed plan of what they will produce and there is no reason to think they will not achieve it.", "q1r": 5, "q2": "The progress on the proposal will be easy to audit given the detailed list of work provided. A good list of KPI's for success measurement have been listed. One improvement that would be great to see is some goals for these KPI's. How many active users do you have in each language, and what growth are you aiming for?", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 12, "ne": 3, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Proposal effectively addresses the challenge to have a wealth of information that already exists within the Hispanic Community of Cardano. Writers, promoters and early adopters are actively creating this content. Bringing them together in a standardized way and leveraged the information and expertise in order to create the initial set of articles for the wiki, in Spanish. They would like to continue with the development of the Portuguese side of their Wiki; so they can onboard Brazil, a key player in the Latin American ecosystem.", "q0r": 4, "q1": "The proposers are the ones behind the Falcon Cardano Stakepool & ALDEA Core Team that implemented the Wiki. With 70+ years of combined IT experience in software development and digital transformation across a variety of industries, our core team of 6 people includes Technical Leads, Business Analysts, Product Wizards, UX Designers, Entrepreneurs, Business Owners, and Foreing Trade and Banking Analysts.", "q1r": 4, "q2": "The key performance indicators (KPIs), timeline, milestone were clear. Budget is very reasonable. But, the ability to audit this proposal needs clearer metrics that can be easily viewed to determine if the proposal is successful.\r\n\r\nA phased approach is only natural, when the most important metric to measure growth is the number of active members, driven by the up-to-date, relevant articles and documents.", "q2r": 4, "assessor": "z_assessor_340", "no_vca": 11, "ne": 3, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "ALDEA Wiki is already a multilingual platform, in this phase they are adding portuguese so it addresses the challenge perfectly", "q0r": 5, "q1": "Already funded previously, competent team and already running a pool on cardano. They are inside the cardano ecosystem already so of course they will try to implement the proposal succesfuly. Also well detailed plan.", "q1r": 5, "q2": "They provide a way to check the success explaining what it would be after 3, 6 and 12 months. Also KPIs are provided", "q2r": 5, "assessor": "z_assessor_498", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "Adding languages to Cardano is always a good new. Helping portuguese people to understand this technology addressess the challenge", "q0r": 5, "q1": "Huge amount of experience and solid team. Already funded and doing a good job. They also have a pool so they are focused on cardano. Indicators of a successful implementation", "q1r": 5, "q2": "There are performance indicators but i would apreciate more information about how to fllow the success of the proposal", "q2r": 4, "assessor": "z_assessor_547", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "ALDEA Wiki is the go-to place to both find and share knowledge and information about all things Cardano in a multi-language platform.", "experience": "Falcon Cardano Stakepool & ALDEA Core Team | https://www.aldea-dao.org/about-eng"}