{"id": 369141, "author": "", "title": "French Intro to Cardano in Burkina", "url": "https://cardano.ideascale.com/a/dtd/369141-48088", "category": 26111, "amount": 18000, "description": "There are just a few educational resources available for African French Speakers", "f6_no_assessments": 5, "f6_rating": 3.8666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "Creating a course to teach Cardano in French is Africa is a great idea. However at nearly 1/4 of the challenge budget, I think the proposal could o more to explain the impact is will have on Cardano as a whole. How many people will they teach, and thus how many new people will this bring to Cardano. In essence, given a limited challenge budget, why should voters prioritize this proposal over others.", "q0r": 4, "q1": "The proposers have the skills to create the content and deliver on this plan. What's missing however is information about what exactly will be taught, to how many people it will impact. It would also be good to see a breakdown of why the course creation is costing $6500, and what the incentive scheme and marketing budgets are going to be spent on and how many teachers and classrooms the budget is going to fund. This way voters can see the value they are getting if they fund this proposal.", "q1r": 3, "q2": "The proposal is relatively clear on the concepts it wants to deliver, it is lacking in some key details that will allow progress and success to be measured. How many teachers and classrooms, then then importantly students will this reach and over what time frames. Could they also measure how many of those students went on to become actively involved with Cardano?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposal was able to identify the problem of few resources available for african french speakers. He also presented as a solution the creation of a cardano french introductory course to educate Young and Woman population in Africa french speaking countries. The objective of the proposal is in line with the challenge. The project did not have any revenue planning beyond Catalyst so it is not possible to assess whether it will be financially sustainable in the future. The proposer gives a plan for the follow-up of the work but does not set any deadline", "q0r": 4, "q1": "The proposer provides references of relevant skills and experience so its likely the proposal will be successfully implemented. The proposal offers a realistic timetable to complete the work. The budget is detailed and reasonable. The proposal presents a detailed driving plan with milestones The proposal does not pose major risks to prevent its implementation\r\n", "q1r": 5, "q2": "The proposer presentes a roadmap with milestones and a time horizon for achievement but lacks key metrics to assess the success of the proposal. It would be interesting to present the number of materials created and na explanation detailed about the incentives", "q2r": 4, "assessor": "z_assessor_429", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Addresses the problem directly by translating into a language widely used in underrepped countries, and where there are not many available materials.  An engaging approach - rather than simply translating material and leaving people to get on with it, the proposers aim to foster ongoing discussion and engagement in the community, which will help ensure the proposal has a real and lasting impact. Particularly impactful to focus on training women and young people, thus addressing their underrepresentation (this is not actually in the challenge, but is an added bonus).", "q0r": 5, "q1": "The team has translating expertise, community links, knowledge of Cardano, and experience of developing and delivering community-based training, so they have the skills to be able to deliver the project. The budget is reasonable, and is itemised clearly enough. The basic roadmap is there, and looks feasible; though it would have been nice to see more detail on timings, and a clearer  breakdown of the tasks, as at the moment it's a bit broad and vague. There's also no clear assessment of risks and how they will be mitigated. However, looking at the proposers' prior experience, my impression is that the shortcomings of the proposal are mainly because the proposers are not experienced in proposal-writing, rather than that they don't know how to run a  community project. I feel it is actually likely that the proposal would be implemented successfully.", "q1r": 4, "q2": "There are not many specific metrics or KPIs given in the proposal as such; but again this looks like a problem with not knowing how to write a proposal rather than a problem with the proposal itself. Delivery of the course and numbers of participants (with a goal of 100 people) are obviously auditable, and so is whether the participants are in the target groups of young people and women. As for the more qualitative issues - the quality of the training, whether participants find it useful, and whether it leads to positive outcomes and engagement - we can audit whether participants go on to participate in the \"Social Economic Cardano discussions\", and in further courses or events, to assess levels of ongoing engagement being produced. So despite the proposal being a little poorly-written on auditability, the needed info is there and will be auditable.", "q2r": 4, "assessor": "z_assessor_540", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposal fully meets the objectives of the challenge, because it intends to create an introductory course on Cardano in the French language, having as an argument the fact that several French-speaking countries in Africa are lagging behind in relation to new technologies due to the language barrier. I found this proposal especially interesting because it has a well-defined target audience, which are young women from the African continent, especially from the country Burkina Faso. This is brilliant, because in fact there is still a lot of prejudice against women in technology, and giving them this priority is a very important act to equalize the rights and access of this part of the population to the Cardano ecosystem. I would put together two facts: the one I just explained and also the fact that there are few opportunities like this so far, will change in the near future due to the investments that Catalyst has made in its funds regarding Africa, but so far it is a sad one statistic. I believe that this proposal is also directly related to the Grow Africa challenge, Grow Cardano, and it is extremely positive both for the continent and for our community.", "q0r": 5, "q1": "In relation to the team that proposes to carry out the project, we are given some assurance, but there could still be more details. We even know from reading the proposal that they have real knowledge and a broad understanding of the situation of French-speakers on the continent, and how their relationship is with the technologies of the Cardano ecosystem, in addition a Facebook profile is attached where we can see the International Language Consult (ILC) activities. We are given a brief description of who the authors of the proposal are, a translator and an investor in Cardano, but these descriptions could be a little deeper in my opinion; examples of previous work that the pair developed, even if separately, could have been cited. Regarding the roadmap, we have here a sketch of how things would happen, both in terms of phases and financial expenses, which gives us a rather satisfactory view of the project's next actions, but just as I had the impression in relation to those involved, this part could have been more detailed.", "q1r": 4, "q2": "We know that educational content about the Cardano universe will be produced, at an introductory level. What came to mind here was: what would that content look like, exactly? Would it be in written format, or videos...? And where would it be taught? How many people do they intend to cover with this initial course? Afterwards, the authors detail more about other stages that make up the project, such as participating in events and developing a more advanced course. We are also given information about how the currency split would take place. However, it lacks detail. For example, in the part citing \"recruitment, encouragement and collaborative coordination of the quarterly French-speaking African population\", what exactly would that look like? We could better understand what this incentive would be like... would students receive a scholarship, would they have job opportunities after completing the course? Regarding the marketing and design campaign, it would be important to understand how this marketing content would be done (through the creation of a visual identity, promotional posts on social networks, etc), and how the bridge to the target audience would be drawn. Regarding the hiring of teachers, it would be positive if they clarify how many education professionals they intend to hire and whether they would be Africans or not. Because this is important: perhaps a local teacher would have more credibility in dialoguing with his students, understand them and be able to transmit the contents in a more efficient way than, for example, a European or North American teacher who was not part of the African context. For these reasons, I believe that the auditability is good, but there are some details to improve and that would certainly bring more credibility to the proposal.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 11, "ne": 11, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "The proposal address the challenge very well and present a clear problem and solution. I also like that there is a focus on providing education to young women as the solution will have a double impact. \r\n\r\nAs a person that worked and lived in many countries including developing countries such as Indonesia, I can appreciate the importance of language and localization to improve reach, engagement, and results. Living in France, I can ppariciate even more such as a solution as many people do not speak English including friends coming from African speaking countries. \r\n", "q0r": 5, "q1": "The team has very good and relevant experience and already started to run similar programs. It would have been helpful to have more information about the team (i.e. Linkedin profile) the company ILC (is it a registered company? where) and links to activities mentioned - i.e. to similar courses/programs done before.  \r\n\r\nOne team member is based in the U, does the second one is based in Burkina Faso? This will be important info. \r\n\r\nThe plan vs. the idea makes good sense including starting in one location and scaling later on to other African french speaking countries. \r\n\r\nThe budget mentions some key important items but it is important to mention more details about how did you get to the amount. For example $6500 for the creation of the content - what will be the cost per hour of work and how many hours? Or what will be the cost per section of content and how many sections it will include? \r\n\r\nOr for the section classrooms and teachers, how did you calculate $4,500? I am sure you have a good breakdown of the cost and you should have it included for more clarity. \r\n", "q1r": 3, "q2": "The timeline in the proposal is not very clear. What will happen for example after 3 months? When is the French course be ready? The deliverable has good information but is quite general. \r\n\r\nFor example point 1 what does it mean as a milestone \"and learn how to grow their local community and the whole Cardano communities in Africa.\"? I would suggest something more specific for pint 1 such as: Creating a basic training course for Cardano in French the will include 1,2,3… and time frame will be 2 months\r\n \r\nOr in point 2 \"Create a place for community interaction  (physical meetings and distance learning, media and more)\". You want multiple platforms for community interaction but which first and what timeframe is required. You could have the title as \"community interaction\" and detailed the various deliverables and timeframe for each. \r\n\r\nI have some good experience working with startups (i.e. mentoring on seedstars.com or Givingway.com) and having clear milestones and timeframe is highly important to be able to plan, prioritise and measure progress. \r\n\r\nThe main KPI is 100 people trained per quarter. Which is good but would be good to add how many women will be trained and other KPIs such as will it all be from one location or multiple locations? When the first 100 will be trained? \r\n\r\nMissing a section about challenges and risks which could help to see that you considered them in your proposal\r\n\r\nI would also like to recommend focusing on the key areas you think are important. You started with a clear problem and solution but then in the deliverable, you included many different activities and described them in general terms. Maybe for this first phase focus on the course creation and what will be the most simple platform to get people/women to be trained and join the community. Later on, you can add more services such as the ones suggested in point 3 of the proposal \r\n", "q2r": 2, "assessor": "z_assessor_636", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "Create Cardano French Introductory Course Curriculum to educate young and women population in African French Speaking countries(eg. Burkina)", "experience": "expert in English/French translation; strong connections in several African French Speaking countries; Contents Creation skills."}