{"id": 369326, "author": "", "title": "Translation into Amharic", "url": "https://cardano.ideascale.com/a/dtd/369326-48088", "category": 26111, "amount": 3800, "description": "There are no Cardano content in any of the local languages in Ethiopia", "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great project to get students involved in translating Cardano documents in Amharic. This both gets the translated documents produced whilst simultaneously teaching the student about Cardano. The funding request seems relatively modest to achieve this.", "q0r": 5, "q1": "The proposer is already involved in doing this and similar hackathon projects, as such it is highly likely to succeed in continuation. It would be nice to have a little more information on the number of students that would be involved to get an idea of scale of impact.", "q1r": 5, "q2": "The plan is relatively simple, with deliverables and timeline broken down. It would be good to have some estimates of the number of students expected to be involved so success can be measured. This is obviously a much more successful project if it involves 100 students across multiple instructions and hackathon events than if it attracts 10 students to a single hackathon at on university.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The problem of not having content on Cardano in Ethiopian languages was raised. Translating materials into Amharic with the help of the Student Ambassadors program was presented as a solution. It is not explained what the Student Ambassadors program is. This information would be important for a better understanding and evaluation of the proposal. The goal is in line with the challenge. A financial plan for maintaining the project's financial sustainability in addition to Catalyst was presented. No metrics were presented to assess the project's success so it is difficult to assess what its impact will be. ", "q0r": 3, "q1": "The proposer did not present evidence of his experience. He said that he will do the project with the help of the Student Amassadors program, but he did not explain what this program is. The budget has been detailed and is reasonable. The deadline set is realistic with the work to be done. The proposal does not pose major risks that prevent its implementation. The proposal does not present metrics for evaluating the project's success and impact.", "q1r": 3, "q2": "The proposal has no milestones or metrics or KPIs. This information is necessary for evaluating the success of the proposal.", "q2r": 2, "assessor": "z_assessor_429", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The proposal goes accordingly, but it really only proposes the translation of very little content.", "q0r": 3, "q1": "The project is very simple, however there is no information from the proponent to know if he has the necessary conditions, we do not even know if he speaks Amharic.", "q1r": 3, "q2": "There is simply a timeline provided, but no metrics to measure the success and reach of the proposal, even if they seem obvious, demonstrate the proponent's interest.", "q2r": 2, "assessor": "z_assessor_511", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "This addresses the challenge by finding a direct roadblock to non-english speaking users trying to learn more about cardano and participate in the ecosystem.  Giving them material in their own language will bring motivation.", "q0r": 5, "q1": "I do believe they have set out with a workable plan, and considering they are a student ambassador with prior funding I believe they will be committed to successful implementation. Like mentioned in a comment, I would like to see some sort of compensation and incentives for students participating as well as those doing the translating and creation of marketing materials.", "q1r": 4, "q2": "They do provide sufficient timelines to audit the progress of the proposal, but they do not provide measurable for success.", "q2r": 3, "assessor": "z_assessor_612", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Translation of Information material into Amharic with the help of the Student Ambassadors program started with the Fund 5 Catalyst Projects.", "experience": "Currently running the Student Ambassadors program which was selected in F5 and I have organized several hackathons with students before."}