{"id": 369586, "author": "", "title": "Cardano Center Poland - web and SM", "url": "https://cardano.ideascale.com/a/dtd/369586-48088", "category": 26111, "amount": 7000, "description": "More than 1 out of 10 Polish people heard about cryptocurrencies. How do we enable and encourage them to get to know the Cardano ecosystem?", "f6_no_assessments": 5, "f6_rating": 4.7333333333333325, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is to set up a Polish hub for Cardano information to leverage off the telegram and twitter communities already existing. This clearly meets the challenge of motivating an d bringing more non-English speakers to Cardano.", "q0r": 5, "q1": "The proposer has relevant experience and connections in the area. A clear plan is set out for delivery. The one question I would have is that the funding calculations cover 6 months, though the plan goes out to 12 months and 1yr+.  Is it expected this project will become self funding after 6 months or will the proposer  be coming back asking for more funds?", "q1r": 5, "q2": "The proposal is clearly sets out with timelines and deliverables as well as success metrics to measure. They have clearly defined what they expect under those goals to be considered a success. A well set out and defined proposal.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposer has clearly identified a need that fits squarely within the target of multilingual resources by providing translation of current information into Polish as well as creating new content in Polish, as well as the foresight to budget for marketing/advertising/SEO so their work won't go unnoticed.", "q0r": 5, "q1": "All of the experience listed is aptly relevant, the plan is well organized... I would consider the likelihood of success to be very high. \r\n\r\n", "q1r": 5, "q2": "The plan is clearly outlined and well defined. There is a detailed budget and easily identifiable goals, as well as solid KPIs to make sure everything is being implemented as stated and remains on track.", "q2r": 5, "assessor": "z_assessor_207", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "I think the proposal properly addresses the challenge. As it is pointed, there is also market for it and area for potential growth and expansion. ", "q0r": 4, "q1": "Based on the proposal it can be seen that there is a good background and experience that it can be executed with good confidence level. It is also positive that there are already active social platform which gives a good basis to build onto.", "q1r": 5, "q2": "The proposal contains very good breakdown of the budget spending. From KPI point of view maybe it would be preferable to track page visits and somehow to make tracking of an active members, not just based on amount of people joined. E.g. doing some voice chats or community gatherings and similar approaches. ", "q2r": 4, "assessor": "z_assessor_33", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This proposal well and truly falls into this category. And the statistics on Polish speakers and their interactions with blockchain only lends strong support. Many other proposals in the Multilingual Challenge failed to define demographics and statistics which could help highlight the importance of a project. It raises the level of criticality and urgency for such a resource to be built. It is also commendable that the baseline number of Polish-speaking Cardano enthusiasts is presented as it gives confidence that the spread of such a resource will be pushed along by many rather than just the members of the proposal team. Well done.", "q0r": 5, "q1": "The team behind this proposal seems to possess the right ingredients to drive the project to success. The SPO team members + dev could look after the technical side whilst the main proposer seems to already work in the media space with podcasts & text-based media experience. Skills in translation (presumably from English to Polish) also means there won't be a need to on-board a translator as the core team can accomplish the build all on their own.\r\nThe itemised list of KPIs and measures for success also seem achievable in the timeframes described. And as mentioned, access to Polish-speaking Cardano enthusiasts will surely play a part in achieving the levels of successes they are aiming at. What would have been the cherry-on-the-top is an explanation of how the Polish resources will be funded operationally after the build. ", "q1r": 5, "q2": "There's an assumption that the 'build' of the resources will be absorbed by the proposing team as the very elaborate expenditure of the $7000 focusses on the production of the Polish resources. Commonly, a dev pathway is what I look for in a proposal but I am going on a limb with my assumptions hence the 5-star rating. The level of audibility of this proposal is one of the best I've seen and to me reflects the team's desire to have the Cardano Center Poland resource up and running. Good luck.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The problem of how to encourage polish people to get to know Cardano was identified. The solution was the creation of a center cardan polish. No financial plan for the future has been addressed so it is not possible to assess whether this project will be financially sustainable in the future. The proposal presented indicators to assess the project's success.", "q0r": 4, "q1": "The purpose of the proposal is aligned with the challenge. The budget was very detailed and appears to be reasonable for the proposed work. The proposed deadline is realistic for the implementation of the work. A plan was presented for how the project will be implemented. Appears to have relevant experience for project implementation but has not presented any evidence.", "q1r": 4, "q2": "The proposer presented/displayed a roadmap and milestones. It also presented key metrics to enable auditability. It provided enough information to assess the proposal. The proposal has the potential to have a positive impact on the community by attracting polish people to Cardano", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We are trying to build a Polish Cardano Center where people find valuable data, learn about Cardano's possibilities and exchange their ideas", "experience": "4 yrs experienced blockchain translator, podcaster, entrepreneur, editor in top local crypto media outlet with support of 2 SPOs & developer"}