{"id": 369590, "author": "", "title": "Lovelace translation Portuguese", "url": "https://cardano.ideascale.com/a/dtd/369590-48088", "category": 26111, "amount": 4000, "description": "The language barrier should be lowered with solutions that bring content in many languages.", "f6_no_assessments": 3, "f6_rating": 3.666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a relatively simple plan to translate 50 lovelace academy videos in Portuguese. Providing the well known content in other languages will help expand the reach of Cardano. ", "q0r": 4, "q1": "This is a relatively simple proposal which the proposer has the skills to implement. A key component missing is a clear plan on how to get the content consumed. Currently it appears that the plan is just to put it on YouTube. Does the proposer have connections to communities that would use this content, what about an SEO marketing plan?", "q1r": 4, "q2": "Progress on this proposal will be relatively simple to audit. It would be improved if there where clear metrics for success and goals for these against which success could be measured. Perhaps looking at number of views and channel subscribers would be a good start?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "I would argue the correct problem definition is \"The language barrier prevents Portuguese to learn about Cardano Plutus and Marlowe programming languages\". If we accept that to be the case then the  solution is right to the point - we translate 50 videos with the right content to Portuguese.\r\nSince the problem needs to be corrected though I will assess it as 4 stars.", "q0r": 4, "q1": "The proposer is a translator in Cardano Ambassador Program and an Educator - clearly enough for the task of translating 50 videos.", "q1r": 5, "q2": "Not much is said about the KPIs here but more or less it can be said they are self explanatory. The required funds is USD 4000 for 50 videos which means USD 80 per video. The proposal clearly can be executed in 50 separate stages with the funding allocated to each stage/video. None of this is explicitly stated in the information but can be derived from it. So I give it 4 stars here.", "q2r": 4, "assessor": "z_assessor_408", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The problem of the language barrier for accessing Cardano's contents was identified. The solution was given to translate the Lovelace Academy Channel episodes, but it was not explained what this channel is. I think it would be important to clarify this information in order to have a better understanding of the proposal since not everyone can know what it is about. No metrics were presented to assess the impact of the proposal. No financial plan has been presented for the continuation of the project beyond Catalyst so it is not possible to assess whether it will be sustainable in the long term.", "q0r": 3, "q1": "The purpose of the proposal is in line with the challenge. The proposer presented a plan of how the work will be carried out, but he did not make it clear who will do it. The budget has not been detailed so it is not possible to assess whether it is a reasonable budget. I think the project management plan could be better explained, with more information for evaluation.", "q1r": 3, "q2": "No roadmap or milestones were presented. Key metrics to enable auditability was also not presented. The problem was presented clearly and the solution was also presented, but it was still missing to inform more about the lovelace channel.", "q2r": 2, "assessor": "z_assessor_429", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "We would like to translate 50 episodes from Lovelace Academy Channel.\n\n25 about programming languages and 25 about general subjects.", "experience": "I started my journey on Cardano as a translator in Cardano Ambassador Program I am also an Educator"}