{"id": 369895, "author": "", "title": "SPOCRA: Expand Geographic Reach", "url": "https://cardano.ideascale.com/a/dtd/369895-48088", "category": 26111, "amount": 11340, "description": "A communication barrier exists between non-English speaking SPO communities and SPOCRA preventing voices to be heard and content accessible.", "f6_no_assessments": 6, "f6_rating": 4.166666666666667, "videos": ["https://youtu.be/dIwx6LaUgM0", "https://www.youtube.com/watch?v=AftfAbJMxQE&start=3615"], "media": [], "f6_assessments": [{"q0": "This sounds like a good effort to translate an important resource on Stake Pool Operation into 9 languages. Key questions would be around what languages are being translated into (it is not mentioned), and cost. This project budgets $0.18 per word. other proposals have much lower costs( such as \"Cardano Project in Spanish\" and Cardano Centre Poland at $0.02 / word). Could this be done more effectively by reaching out to SPO's already operating in countries with languages other than English. ", "q0r": 4, "q1": "The plan is relatively simple, however the proposers don't have the translation capabilities. The translation costs seem high relative to other proposals on a per word basis. A more detailed plan that included the actual languages to be translated into would be good. The quote translation costs are almost an order of magnitude above some other proposals which makes me question if they have done enough research into the translation side of the proposal. ", "q1r": 3, "q2": "The proposal has some clear deliverables which will be simple to audit, though the specific languages should be detailed.. This proposal lack some number and metrics for success. How many users of the English documentation do they have? How many more do they expect this to grow to in each of the chosen languages? How many SPO's do they expect to be started over what time frames from this initiative?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 11, "ne": 6, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "This proposal directly addresses adding multilingual resources by translating materials that will be relevant to Stake Pool operators. This will help bring more stake pool operators into the ecosystem in non-english speaking countries, which will help with the level of decentralization of the blockchain.", "q0r": 5, "q1": "The proposal is being made by trusted members of the SPO community and will be utilizing native speakers in different languages to do the translation. The breakdown by word translated is fairly standard in the industry, and the amount of funding requested should allow for a decent level of professional translation (not relying on volunteer best-efforts).", "q1r": 5, "q2": "The proposal outlines a method of publishing the results of the translation in public channels such as the SPOCRA site and Youtube channel, which is a highly verifiable mechanism. However, it is unclear if the *quality* of the translations will be verified to be of sufficient quality or completeness to be of equal utility to the english source materials. It would have been really nice to see how the results of the translations would be validated and approved.", "q2r": 4, "assessor": "z_assessor_285", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "As a non native English speaker and having participated in multilingual efforts to make knowledge available for everyone I think this proposal addresses the challenge goal to increase adoption of non-English speaking people, specially at the main net support and decentralization grow which is much needed as a foundation for Cardano's growth. The solution is well presented and detailed information is provided to strongly support the way it will solve the problem addressed.", "q0r": 5, "q1": "Proposers are part of the SPOCRA community which deals regularly with this sort of challenges and understands first hand the difficulties and needs to expand Cardano's reach.\r\nThe plan is clear and produced SMART goals for its initial phases. The cost amount per word translated I thin is fair, considering other endeavors I've been part of, and the requested budget to translate the 7000 words guide/course to 9 major languages it is solid.\r\nAn addition that I would suggest it is to add/explain the mechanism for translators selection, which validations/tests will be done to guarantee an adequate and non biased translation of the materials. And to make it even more professional I would've added a QA phase with some score/feedback from native speakers to understand the quality and readability of the translated materials.", "q1r": 5, "q2": "With the provided information and having into account the community behind the project, I do belive the project will be auditable and progress would be very transparent.\r\nI don't see though a clear commitment and metric to be tracked for each milestone (3, 6, 12 months) so things can get fuzzy and if deviations happens more funds could be needed to achieve the desired outcomes, with potential unfinished work if no extra funds are secured.\r\nI would work on providing those milestones while adding a QA phase on each content/language that can provide proper insights on how to advance with better translations that drive understanding and adoption.", "q2r": 4, "assessor": "z_assessor_288", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to expand awareness and availability of their stakcepool network by translating guides, educational content and updates to various dominant languages not as widely represented within the Cardano Community. This might (as the proposal suggest) indeed make the language gap less big, and increase availability and the rate of adoption. Especially considering the SPOCRA community is a strong and well trusted community in the Cardano Ecosystem. I'm questioning if the proposal is more focused on expanding its own community rather than focusing on a more widespread availability firsthand, but since SPOCRA is part of the Cardano Ecosystem it would be a beneficial strategy to limit the spread locally from the community at first, and let it spread further through time. I agree that the proposal effectively addresses the challenge.", "q0r": 4, "q1": "The SPOCRA community is well known within the Cardano ecosystem, and are known to have regular communication with its members on a consistent basis. There's information about the team members (although it is unclear which team members are active in this particular project) on their well structured website, but I would've liked to see exactly who is working on this project and what their relevant expertise may bring to the project. LinkedIn profiles, etc. The supposed translators does not seem to be hired yet, but will be internally recruited within the community so a little information about that would be nice to have in the proposal. In my opinion, the proposal is further strengthened by the fact that they will recruit internally, since every person working on the project will have ample experience, understanding and connections within the Cardano community. The idea is clearly presented with the aim of expanding and contacting a wide range of geographical areas that are not as linguistically supported. The plan includes a list on what languages are being focused on, within an expected timeframe. The budget is clearly calculated and seems reasonable. It seems the team has taken into consideration the estimated amount of labour hours, average cost and expected amount of work. Solid.", "q1r": 4, "q2": "The proposal is providing a list within an expected timeframe, with checkpoints included for 3, 6 and 12 months of time. The team aims to share the translated guides with the SPOCRA network, and share the fruits of their labour with the community via their Youtube Channel. This is a really good idea, since it can spread to be useful for communities outside of the SPOCRA community, and educational concepts about how the ecosystem works (stakepools etc) will always be relevant. Especially useful since these channels are meant to be a dialogue between content creators and community members, and not a monologue. If they also choose to include voting and polls (as they are doing in the SPOCRA community), it bodes well for the project. If they keep a similar level of transparency as they have done before, it will be easy for the community members to both audit and be part of the process. What I'm missing is a more detailed description of metrics and KPIs in the proposal. Currently these topics are only described broadly in the proposal. How massive will the outreach to these communities be, and how many onboarders from each geographical region could we expect in order to measure a level of success? In order for this proposal to be even more credible, I would liked to have a section where the proposers discuss some challenges and risks. How will we be reaching out to these geographical regions, and what happens if we cannot onboard them? Where do we focus to share our updates, and what will we do to ensure that they are not lost in all updates in the stakepool-ocean? Overall, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. ", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The problem and solution presented make sense and are within the scope of the challenge.\r\n\r\nOne of Cardano's pillars is the decentralization of SPOs. Blockchain security depends on the decentralization, resiliency and qualification of SPOs. SPOCRA has documentation to assist new people interested in creating pools, and the translation/blending of educational material lowers the barrier to entry for non-English speakers. The increase in support material in other languages is a step towards decentralization for Cardano.\r\n\r\nObjective targets were presented, indicating impact on the challenge, but the absence of metrics and KPIs makes the impact assessment less objective and uncertain. I would recommend including indicators that capture the frequency of use of the translated/dubbed material and indicators that can indicate the success of the proposal.", "q0r": 4, "q1": "SPOCRA has great importance and representation in the Cardano community due to contributions with documentation and coordination of the SPO community. One of the SPOCRA members participates as a representative of the SPOs on the Catalyst Circle. I would recommend indicating in the proposal the SPOCRA members charged with developing the proposal and including details about them, such as experience, qualifications and sources.\r\n\r\nThere is no clarity on the goals presented in the roadmap, I would recommend refining the roadmap with the inclusion of deliverables/milestones related to the materials to be translated/dubbed.\r\n\r\nThe budget is compatible with the indicated translation/dubbing activities and the reported cost per word values are within expectations.", "q1r": 4, "q2": "There is clarity in the problem, solution and alignment with this challenge.\r\n\r\nThe roadmap needs refinement as it is not clear which deliverables will be delivered in the 3, 6 and 12 month periods.\r\n\r\nRelevant targets were set on the amount of material to be translated/dubbed into 9 different languages. Translated guides will be published on the SPOCRA website and dubbed/subtitled videos will be included on SPOCRA's YouTube channel, which facilitates auditing.\r\n\r\nMetrics and KPIs that allow evaluating the use of the translated/dubbed material by people who are not fluent in English were not included.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "SPOs are among the most crucial components of the Cardano ecosystem. Making it easier for SPOs (as well as potential SPOs and those interested in the SPO process) speaking other languages to obtain accurate information strongly promotes the strength and stability of the Cardano ecosystem. Clearly this is something that should be done. I strongly agree that this proposal addresses the challenge. ", "q0r": 5, "q1": "The proposal is clear on setting a measurable goal of translating 9000 words into 9 languages. Translation services are widely available, so this should be achievable. However, the proposal does not contain much information on how the translation will be implemented or the team that will be working on it. So I agree that it is highly likely that this proposal will be implemented successfully, but without that additional information I cannot strongly agree.", "q1r": 4, "q2": "There are very clear metrics -- translate 9000 words into 9 languages. It should be fairly straightforward to assess whether the translations have been completed. However, there is no indication of process for quality assessment of the translations, which can be a significant issue for translations (based upon my background as a director of global language testing company PeopleCert/LanguageCert and as a speaker of 9 languages). Therefore, I agree but do not strongly agree that the information provided is sufficient to audit the delivery of the proposal.", "q2r": 4, "assessor": "z_assessor_495", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}], "solution": "Translate content for non-English speaking SPO communities for communication flow between communities ensuring voices are heard & channeled.", "experience": "The SPOCRA body consists of highly experienced stake pool operators possessing a broad range and depth of skillsets."}