{"id": 368819, "author": "", "title": "Distributed Income Share Agreements", "url": "https://cardano.ideascale.com/a/dtd/368819-48088", "category": 26112, "amount": 40000, "description": "様々な経済的要因により債権者の信頼を失っている低所得国では、高等教育への融資が不足している", "f6_no_assessments": 4, "f6_rating": 3.0833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "This is an interesting idea, however its hard to see how 40,000 is good value to produce a feasibility white paper. A number of key issues to be considered in this concept. 1) Exchange rate risk. What currency should this be denominated in? We do not want students borrowing Ada to pay for their education and then finding ADA has appreciated 10-100x over the next 5-10 years when they have to pay it off. Should it be relative to a stable coin? if so locked against which currency? 2) Where is the information coming from on income to ensure the creditors get paid? How is this verified? How do the funds get into the smart contract to pay the creditors back?", "q0r": 3, "q1": "Its not clear the proposers have the experience to deliver a white paper on this project. The budget includes payments to 4 contributors, however only 2 are mentioned. In addition to lack of experience delivering these types of projects, this is to be based in Ethiopia however the proposers don't appear to have any connections there. ", "q1r": 3, "q2": "Whilst it will be possible to audit delivery of a white paper, what does success mean here? More detail on what this white paper will contain should be provided to voters, along with a definition of what would constitute a successful white paper.", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The Proposal clearly outlines the problem it wants to  solve and also clearly detail its potential Solution but i would have liked if the following line \"Yet, we anticipate the country's growing adoption of Atala Prism's identity solution to catalyze a new era of trustless governance, enabling higher flows of cross-border DeFi transactions\" was expanded upon with more details and what will be the fate of the project if this adoption by the government doesn't take place.\r\nThis proposal clearly address the challenge.\r\n", "q0r": 4, "q1": "Though the proposal listed given experience, it failed to provide a link for verification.\r\nNotwithstanding, the execution of the plan shows a good level of experience in the field alongside the provided medium links.\r\nThe proposal did a good job of specifying various stages of the solution and subsequent funding request.\r\nThat being said, i have a problem with the request amount of $40000 which is 44.44% of the total funding pot of $90000.I cannot find a justification for such requested amount, considering that this is only the initial request for the project.I would suggest you cut down the implementation into more smaller chunks in future funding ,to enable a better chance of the project getting funded. \r\nConsidering the above , i disagree  that the plan can be implemented leaning more towards the Cost implications to other potential projects needing funds.", "q1r": 2, "q2": "The proposal did a great job of providing some information to be audited but considering the amount of funds requested, there seem to be a more generalist manner to the breakdown of the cost especially in the aspect of the whitepaper,more details would have been provided to justify such huge cost.\r\nConsidering the above concerns, i can neither Agree or disagree that the proposal has provided sufficient information to be audited.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal meets the objectives of the challenge very well, because it considers the historical and cultural factors of a specific demographic area (Sub-Saharan Africa) and tries to combine them with the activities of our Cardano ecosystem. It is a fact that this part of the continent is very poor, the low income of most families makes financial loans for educational purposes difficult, as the author explains. In this way, using DEFI technology, it would be possible to establish a bridge between the financial universe of cryptocurrencies and the tangible needs of this population. Through the application, it uses Distributed Income Share Agreements (DISAs), the authors manage to meet in a certain way what this challenge seeks: increasing investment in education, and on top of giving an idea of ​​the blockshain universe to those involved, it will be possible to train future professionals who will certainly benefit their communities. It is also positive that the target audience here is well established, with Ethiopia being the country chosen for the implementation of this technology, for several reasons that the authors explain and it would be redundant for me to rewrite here, but in general, it is a young and adequate economy for that kind of activity.", "q0r": 5, "q1": "The proposal authors have attached short texts detailing who they are, where they were formed, previous work and even personal facts, which gives us a solid idea of ​​who we are dealing with. I believe they are technically very well qualified to execute this proposal. However, as it is a very broad idea, other professionals would also be involved, such as the legal advisor, the developer, other contributors to the white paper... a lot of very necessary people. In this case, we don't have any information about who they are, what their previous experiences are, and so on. I believe the authors were concerned to provide a good explanation about themselves and probably did not consider introducing the rest of the team, or even have not yet defined who the other contributors will be. In this way, unfortunately, we only have a concrete notion of a part of the team, leaving us with a little doubt about what it would be like with the others. We have an overview of how the project will proceed, but not in enough detail.", "q1r": 2, "q2": "We are provided with a series of information about the project phases. The project is very extensive, so from what I understand the funding money requested here would only be for phase 1. As there are several phases and the work is complex, I believe it would be safer if the authors proposed a more cautious input to the the proposal, that is, perhaps if more detailed and short-term goals were established, at a lower financial cost, the confidence in everything would be more intense. I am not saying that the planning is not well executed, but rather that it is multiple phases, with many people involved, and many steps, which could have been even more detailed in my opinion. We lacked a temporal notion here, I did not see at any point in the proposal a notion of how long each phase would take, for example. And because it's such a big thing, it wasn't very clear to me how the community was going to follow the project's progress. From what I understand, what is explained to us is how things would be created, how technology would start to be born, we still don't have a notion of how Ethiopia's population would have contact with this application in practice. For these reasons, I believe the proposal is well cut, but not enough.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is a great idea and demonstrates the teams strong attempt to identify a problem within the scope of this Challenge. The problem they are trying to solve on education financing [if successful] is a clear value add and positive impact to the Cardano ecosystem.  Furthermore, not only have they aligned their key metrics and goals against the Challenge criteria, the problem they are solving fits with the broader vision that IOHK and the community are working towards in Africa. This is made abundantly clear throughout the proposal with references to the existing projects such as Atala Prism DID.  \r\n\r\nHaving spent time working with pioneering income contingent loans for higher education economists Professor Bruce Chapman and Professor Bob Gregory [who introduced this world's first ever style of education funding in Australia and other countries] I can confidently say that a hybrid solution such as the DISA or ISA style funding is a scalable and beneficial solution when done right.  For future proposals, in order turn this from a good to an excellent proposal, I suggest providing some context behind the current state of African education financing. I know from my work with Professor Bruce Chapman that Ethiopia already considered a cost-sharing scheme for students attending public universities. To me it is unclear how your pilot study will attempt to either integrate with or replace the current systems in place. Making this distinction would provide a more compelling pitch in the future. ", "q0r": 4, "q1": "A strength of this proposal is the transparency provided behind the background and relevant skills of the proposals. Going forward, I suggest collaborating with an advisor and subject matter expert in this field that can support you and pre-emptively work around problems that you are likely to face in the future. This will be crucial given the proposers suggested that they plan to collaborate with institutions such as the Ethiopian Ministry of Education. \r\n\r\nAnother strength of this proposal is the visibility around the work plan and budget. Given the ask of $40,000 makes up a large proportion of the total funds available for this challenge ($90,000) an appropriate level of depth when addressing the budget was expected. This was mostly provided.  One area that I would have liked more visibility and breakdown on was the timelines. Drawing from my experience in consulting and project management, the timeline of 3 month seems tight and perhaps not the most realistic considering the huge scope of the problem statement that is being solved and the sheer number of stakeholders that would need to be included as part of the whitepaper outputs.  Providing more clarity on what exactly is required and why the research/consultation will only take 3 months would have provided a compelling narrative to win the funds. ", "q1r": 3, "q2": "A key strength of this proposal is the detail oriented approach when outlining important information such as the roadmap, estimate of key activities to be delivered and details on budget allocation.  Further alignment against the challenge metrics [notably around the understanding of the African practices and norms] would show a stronger maturity towards the proposal. Providing this context upfront around current state [i.e. what financing solutions already exist and why isn't it sufficient] would allow you to frame the problem statement in a far more tangible and auditable way as there is a clear gap between the current vs target state you are working towards.   The final thing that is missing in the proposal is the  acknowledgement of future challenges that lie ahead and how they intend to deal with them.  Whether that is regulatory, integration to existing practices, funding, time, etc…  I recommend incorporating this into future proposals to provide a clear view around the feasibility and auditability around the activities that lie ahead. \r\n", "q2r": 3, "assessor": "z_assessor_586", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "DISA（Distributed Income Share Agreements）を利用して教育資金を調達するDeFiレンディングアプリケーションを提案します。", "experience": "下記参照"}