{"id": 380974, "author": "felixweber", "title": "LATAM Town Hall by Catalyst Swarm", "url": "https://cardano.ideascale.com/a/dtd/380974-48088", "category": 26242, "amount": 19488, "description": "ラテンアメリカには、カルダノコミュニティやカタリストコミュニティへの適切で摩擦のないエントリーポイントがありません。", "funded": 2, "upvotes": 121516925, "downvotes": 4002087, "votes_result": 117514838, "votes_cast": 483, "f6_no_assessments": 10, "f6_rating": 4.766666666666667, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=7815"], "media": [], "f6_assessments": [{"q0": "The aim mentioned in the proposal is to create a platform to on board new people in a fast and safe way. They also aim to remove language and cultural barriers in the process of on boarding new members. This makes the challenge addressed effectively.", "q0r": 5, "q1": "The plan is well detailed in the proposal and I will mention a few as organizing and hosting sessions, weekly zoom meetings and social media virtual events. The proposers are Co-Founders of Catalyst Swarm, Eastern Town Hall and Catalyst School. They will be able to implement the proposal effectively.", "q1r": 5, "q2": "The time period is very clear starting from January 2022 for 6 months duration after receiving funding. This will help auditing to be easier.", "q2r": 5, "assessor": "z_assessor_292", "no_vca": 23, "ne": 2, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "Simple and impactful initiative. A townhall dedicated to Cardano community in LATAM, both in portuguese and spanish, might help to build a stronger community, address local challenges and engage new comers.\r\nThe proposal itself is well written with enough details and a solid plan.\r\n\r\nAs further suggestions, I'd detail more the communication plan, which for this project is essential, in order to attract existing and new members in Cardano. More information on which channels it will be cumminicated and what strategy to bring new member and convice them to participate actively would be welcomed.", "q0r": 5, "q1": "Committed and experienced team with good background in Catalyst townhalls. Theres a linkedin link for one person, I'd add for all the team.\r\n\r\nThe plan is sensible and, as said in impact comment, I'd just add more details on the communication.\r\n\r\nTheres also a clear budget breakdown. I'd just add the aproximate cost for each of this activities listed in the budget part", "q1r": 5, "q2": "There are very good metrics but with no time related target. I understand in the beggining is hard to set some targets on it but it would be good to add at least some growing percentage desired to implement corrective actions in case this is not being achieved. If possible, it would also be nice to add as metrics the number of recurrent people attending the meeting and the number of new members to see how both are behaving: Its both good to have coming back and attending more sessions (which may translate in quality) as it is to have new members on board (which means communication is being effective and community is growing).\r\n\r\nTheres no milestone set but this kind of project doesnt seem one that milestones are so essential (metrics should be enough). Maybe it could have some during implementation phase, before start the townhalls.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 22, "ne": 8, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "This proposal fit perfectly well in this category ,\r\nThe town hall idea by Catalyst swam  is a great idea to promote cardano  blockchain in that region \r\nThe proposal  aims to provide a meeting point where people can express themselves in their own languages and cultures, which is commendable \r\n\r\nThe proposal clearly articulates how it will create Impact and add value  to the Cardano ecosystem \r\n", "q0r": 5, "q1": "Yes. In his proposal, the  team  demonstrates the experience, competence, and interest to manage the town hall session well .\r\nThe track record of the Team in community building clearly denotes their passion, alignment and willingness to make this  a success.\r\nproof of prior work  in similar communities like Catalyst Swarm and Eastern Town Hall points towards a high probability that this project would be successful.\r\n\r\nBudget breakdown and resource allocation are also well defined and fair.\r\n\r\nIt is highly likely that the project will be implemented as stated.\r\n", "q1r": 4, "q2": "\r\nThe team has a clear picture of when   the town hall session will take place , 24 sessions in 6 months ,\r\nBut this proposal  requires more auditability information like what success will look like in 3 and 6 months.\r\n\r\nWill the number of participants double in each session? What are the ways to reach more people to be part of the session?\r\n\r\nHow much of the funding is allocated to each  session is clearly stated , though each session budget is not specifically allocated to the listed activities , to help us know how much each activity will cost and how the session budget sum up to total.\r\n\r\nIn all, the past auditable works of the team  should be considered, it's an easy fix\r\n", "q2r": 4, "assessor": "z_assessor_430", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": " Relation to personal qualifications: Since I don't have any direct personal connection to any Latin American country, I can only assess the non Latin America specific parts of this proposal.  I however have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal clearly identifies a problem within the challenge which needs to be solved and presents a solution that will add value to the Cardano ecosystem and also specifically to Project Catalyst.\r\nThe key metrics and goals of the proposal align with the outlined challenge settings very well, and have a lot of potential for self-empowerment and organisation.\r\nTaking a look at the makeup of the proposal and the good work the catalyst swarm has done so far, I am positive the proposal is able to scale to address future challenges. Also, it", "q0r": 5, "q1": "Felix is a very competent and experienced members of the catalyst community that has already done a lot of successful projects, so I have no doubt he will succesfully implement support the other proposers implementing this project. I don't personally know the other proposers, but judging from the quality of the plan, I trust they are competent as well. The type and number of team members in the proposal seem well-reflected and up to the requirements of the proposal. The budget is outlined clearly is reasonable to achieve the set goals.\r\nWhile a timetable is not provided, this is okay in this case as the events are planned to be continuous. A very detailed, sensible and conductible plan for implementation is provided that shows not only what is being done but also how.\r\nThe plan describes the resources necessary to implement the proposal by listing all the requirements. The promise of financial transparency is also really convincing in regards to the credibility of this proposal. Overall, the proposal is very feasible.", "q1r": 5, "q2": "The overall problem and solution descriptions, as well as the detailed plan on the proceedings and contents, together with the comprehensible and quantifiable metrics make it very clear that this is a very auditable proposal. Well done. No negative feedback is neccessary, good job.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 6, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "As a Latin american I can say this is an amazing proposition. In the future every region should have their respective representative town hall which information and cultural experience can be canvassed under the umbrella of an international representative. This could be the beginning of a new region aspect of that future.", "q0r": 5, "q1": "The experience is extensive and relevant as co founders of SWARM sessions they have been exposed and vetted to understand the structures and themes behind deploying their solution effectively.", "q1r": 5, "q2": "I believe this has the potential of growing catalyst and the ecosystem as a whole as well as onboard new members in the ranks and more hrowth in the long term.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "LATAMTown Hall is a continuation of the proven template of the Global Town Hall initiated by Project Catalyst. This template was carried on and added on by various member of the communities. Town Hall has proven from time-to-time as great hub for individuals to initiate connection or to start their journey into Cardano. The initiation of LATAM Town Hall through this proposal will definitely address onboarding new members onto Cardano as such it's sister entity, the Eastern Town Hall. And such as it's sister entity, numerous domino effects will be felt by the whole of the LATAM Cardano community, such as the increase of proposals quality, increase of the quantity of proposals, increase of the variety of proposals etc. Who knows? The next dApps might just be around the corner. All these improvements are clearly aligned with the goals of this Challenge setting.", "q0r": 5, "q1": "Guided by a high performing serial community entity founder with a strong LATAM team consisting of a healthy blend of seasoned Cardano community members who are part of various credible Cardano community entities, CA's, Fund winners, Catalyst School contributors, Atala PRISM participants and traditional/real world applied science in business administration etc. individuals, there is absolutely no doubt this proposal will be implemented successfully. Budget although lump sum is clearly provided and broken down into smaller sums that represent adjoining action plans. Though the budget is far too small in comparison to the number of teams and duration of work is a cause of concern. Implementation plan is very detailed, almost leaving no space for guesstimates. It is step-by-step process that takes you on a mental journey where you can mentally visualize the end goals. Unfortunately, the risk and challenge they might face is not considered.", "q1r": 4, "q2": "Only a very helicopter overview of the roadmap is provided. There is even no 0-3 months, 3-6 months standard format. There are also no milestones provided making this proposal very hard to audit. Add to that the structure of the KPI's are also very in general and limited. Such a shame, not much effort was put into this. As much as I support these proposers I have to be objective and adhere to the standards. Fortunately though between the problem statement and solution are highly interconnected and thought through. Which can only mean, lapse of judgement not knowledge to the various shortcomings of this proposal.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 18, "ne": 9, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "\r\nThe proposal stated that LATAM Townhall setup will give local communities an opportunity to connect in their own local languages and provide an exciting onboarding experience. To grow Cardano in Latin America, the LATAM Townhall can serve as the largest entry point where all Cardano Communities of Latin America meet together to share experiences and connect each other; where language and cultural barriers are removed, no more prejudices and equal opportunities for everyone. The challenge has been addressed effectively.", "q0r": 5, "q1": "The team is made up of 6highly respected and experienced people who are Catalyst members, Co-Founders of Catalyst Swarm sessions, Eastern Townhall and Catalyst School, who are capable of successfully implementing the proposal. The detailed plan highlighted in the proposal are very comprehensive with a few mentioned here as organization and hosting of recurring sessions in their own languages (Spanish and Portuguese); weekly moderated zoom events; Telegram communication channel; You tube sessions, Social media and website. All these facts, among others, will make implementation successful.", "q1r": 5, "q2": "KPIs such as number of participants that join weekly sessions, number of  visits, etc. to make auditing effective. The road map is showing 24 LATAM sessions in 6 weeks , weekly sessions broken down. The budget is broken down and understandable for effective auditing.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is a great implementation that could improve both the quantity and the quality of participants and proposals on the Cardano ecosystem, because talented and passionate people from Latin American community will have their own place to connect, express ideas, discussion, share experience for the growth of the community as well as the Cardano system without language and cultural barriers.\r\nThe proposal clearly articulates how it will add value to the Cardano ecosystem (in section 'Impact'of the proposal). \r\nIn my opinion, the proposal reach completely the challenge given. So I rate Impact with a score of 5.\r\n", "q0r": 5, "q1": "The project team is already committed with fulfilling relevent skills and experience needed to implement the proposal with a clear understandable, sensible and conductible plan and the reasonable budget ($812 per week x24 weeks) so its feasibility shouldn't be a big deal. However, the budget has not yet broken down into identifiable items which listed as activities in the budget section of the proposal. I would recommend the proposal should consider challenges and risks relevant to the success of the implementation.", "q1r": 4, "q2": "The team has provided metrics that define the success of the proposal so clearly (easy to see and easy to audit); decribed the targeted problem and solution is understandable. Additionally, it gives full auditability because the team will document and keep track of all activities and expenses in a github/gitbook repository in a commitment.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "This proposal addresses a clearly defined problem and the solution is coherent and meets the criteria of the challenge in many ways. Its impact is clearly expressed and conscious both for the Catalyst Latam ecosystem and for the community at large. By enabling the integration of new people beyond the language barrier and giving the Latam community a centre of gravity within Catalyst, increasing its impact in the ecosystem. And placing Cardano as one of the best choices for the Latin American audience. This is also reflected in the KPIs focused on increasing participation in the process. Moreover, this project has the potential to address future challenges in its adoption of an evolutionary vision.", "q0r": 5, "q1": "All participants are clearly identifiable, and their descriptions are detailed, as are the partners and related projects. With links to some of the members and also links to related projects. The budget is accurate and well explained and seems realistic and coherent in relation to the plan and suitable for the timetable.Risks are not addressed, but the accuracy of their support of Catalyst Swarm and Eastern Town Hall, provides additional confidence value. ", "q1r": 5, "q2": "The notion of communication with the community seems to be an integral part of this project. This is evident in their willingness that \"all activities will be documented and tracked to build trust and transparency\".This notion seems fundamental and clearly stated. It will also be possible to see the evolution of this project because it is stipulated that all activities and expenses will be in a github/gitbook repository. The given KPIs make sense and use quantifiable values for the will to success. ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "I see a high alignment with the challenge of growing cardano's Community in Latam, specially by enabling the local community to grow in it's own language and culture, key to boost diversity and therefore innovation. Exponential impact of this proposal is evident when articulated with other 3 proposals by the collaborating teams, I believe this to be a must have exercise to accelerate growth of Cardano in Latam.", "q0r": 5, "q1": "There is a dream team behind this proposal. They are all active a credible members of the community and bring a combination of capabilities and experiences that ensure successful implementation. Also they bring knowledge of similar initiatives in other regions that reduce the learning curve and reduce the chance of repeating previous mishaps.\r\nThe plan is well structured with detailed timeline deliverables and KPIs, I'd suggest having specific goals for the metrics proposed so the communitiy can have a clerarer picture of how success looks like. Also in future iterations I believe the bar could be set higher in the sense of having results KPIs (e.g. measuring # of projects produced by newly onboarded community members, #local SPOs, # of local developers, Voting participation by Latinamerican wallets, etc) instead of the current tasks indicadors proposed.", "q1r": 5, "q2": "The proposal is clear and easily auditable since success is rated by publicly verifiable delivery of all items. Also there is a community trusted team behind the proposal and a commitment to transparency and reporting as the implementation advances.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}], "solution": "LATAM Townhallは、地域のコミュニティがそれぞれの言語で出会い、つながる場を提供し、迅速で安全なオンボーディングを実現します。", "experience": "Catalyst Swarm、Eastern Townhall、Catalyst Schoolの共同設立者。Catalyst Latam Communityの一員として、私たちは様々な役割と現実を担っています。"}