{"id": 383449, "author": "dcspark", "title": "Milkomeda Latam Hackathon", "url": "https://cardano.ideascale.com/a/dtd/383449-48088", "category": 26242, "amount": 50000, "description": "多くのEthereum開発者は、Milkomedaを通じてCardanoにコントラクトをデプロイできることを知りません。", "funded": 1, "upvotes": 53600053, "downvotes": 17633287, "votes_result": 35966766, "votes_cast": 249, "f6_no_assessments": 4, "f6_rating": 3.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer points out that solidity developers are unaware that they can deploy their smart contracts on Cardano by using the Milkomeda protocol, this is is relevant because active development will always be critical for Cardano or any other Blockchain. The project proposes to solve this issue by conducting a Hackathon for individuals and companies in Latin America to gain knowledge of Ethereum and Cardano through the Milkomeda Protocol. There is not information available regarding the impact metrics of the proposal. Although the project clearly benefits the community, I would be interested in knowing how many developers the team plans to reach through the hackathon.\r\n", "q0r": 5, "q1": "Milkomeda and dcSpark make a solid team and this can be easily verified. Almost exclusively, the requested budget will be used for the prizes to be awarded at the hackathon. As a result, I am not concerned about providing a detailed breakdown of the budget. It is stated that the hackathon is scheduled to take place in the first half of 2022, however, it would have been interesting for them to describe in more detail the steps involved in executing the hackathon.\r\n", "q1r": 4, "q2": "Based on the characteristics of this project, the only way this proposal can be audited would be through the running of the Hackathon and awarding of the prizes. It is my belief that the team could have done a better job describing Impact metrics such as the number of developers who signed up to participate in the hackathon, the quality of the winning projects, number of proposals added to catalyst as a result of the hackathon implementation, etc.\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 23, "ne": 5, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "A great way to bring developers from other blockchains to learn about the possibility of developing their contracts on Cardano easily, without any code, is through a Hackathon that offers prizes.\r\nThis is a smaller project, that could offer great results.", "q0r": 5, "q1": "There are skilled individuals part of this team, who are already building and innovating in the Cardano ecosystem. Their project's gitbook is the main source of details regarding the Milkomeda protocol. I don't see any reason for them to have any problems in organising a hackathon to attract developers from Latin America. The proposal's plan is short, but offers most of the necessary details.", "q1r": 4, "q2": "The budget will be mainly used for the prizes, though it would have probably been better to announce beforehand how many prizes and what amount of money will be awarded and what for.\r\nIt is a one-time event, as such there wasn't necessarily a need for a detailed timeline, or roadmap, but some KPIs would have helped in assessing the project's succes and see if there's enough potential in this direction.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The given problem statement is defined and involves most aspects of the challenge. The point of the proposed proposal is to deploy its contract on Cardano through Milkomeda\r\nThere is a problem/solution description that matches the challenge, the idea of ​​the proposal is reasonable, but the absence of a blueprint affects the testability of the proposal", "q0r": 4, "q1": "This proposal is more of an idea than a concrete proposal. Although the proposed idea is good, it does not have enough content for us to evaluate feasibility. I recommend coming back to the fund later with a fuller hint so we can more easily test the recommendations of the proposal.\r\nIt also does not show how many people were involved in the implementation of the proposal. As far as the team is concerned, that is unfortunately the weak point of the recommendation when it comes to details. Please provide additional information and evidence regarding your experience. The more people know about the mind behind the project, the easier it is to trust you.\r\nThe proposal does not take risks into account.", "q1r": 1, "q2": "More budgetary insights are needed to conduct an effective audit. The proposal asks for the amount of $50,000 without any explanation.\r\nIt would be difficult to track the progress and success of this project without a launch date or roadmap with milestones.\r\nLooking at the proposal, no KPIs were included. As no details were provided on what will be delivered when, the proposed provision could not be tested.", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 17, "ne": 3, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "The proposer suggests hosting a funded hackathon in Latin america to help drive the adoption of the EVM sidechain they have created Milkomeda. Hosting an incentivised event that helps to bring awareness to their new solution could present a high impact opportunity for education, awareness and solutions around the EVM sidechain. If any of the solutions from the hackathon are successful they could become areas of adoption within the community. It would have been nice to see more details on how they would host the event, any specific topics that would be included or that could be the sole focus so it is easier for the advisor to fully gage how the event may pan out.", "q0r": 4, "q1": "The company dcSpark has created the proposal which is a well known company within the community that has delivered a number of open source projects to the ecosystem. dcSpark have all the knowledge required to host this type of event and a key benefit is any attendees would be able to benefit from free education from the dcSpark team who created the sidechain that could lead to rapidly improving some of the solutions that attendees come up with.", "q1r": 5, "q2": "A basic timeline stating the first half of 2022 is provided. There are no success objectives provided nor KPIs. It would have been good to see information on any previous hackathons the company has run and some metrics from there to gage how that went. It would also be useful for this event to have some metric targets based on some similar comparisons - how many attendees would an event like this usually get? What's the range of likely participants if it was a bad to good attendance? Is there any targets for the number of projects that dcSpark will try to interact with and support with projects during or after the hackathon?", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "ラテンアメリカの個人・企業を対象とした仮想ハッカソンを開催し、カルダノとイーサリアムに関する知識を共有します。", "experience": "私たちのチームは、過去数年間にわたってカルダノのエコシステムを構築してきた、よく知られた元Emurgoや元IOHKの社員で構成されています"}