{"id": 384421, "author": "chrobilliard", "title": "Endorsing the marginalized", "url": "https://cardano.ideascale.com/a/dtd/384421-48088", "category": 26242, "amount": 37000, "description": "現在の金融システムは、十分なサービスを受けていない人々をどのように信頼すればよいかわかりません。デフォルト率が高く、レガシーな機関への信頼もない。", "funded": 1, "upvotes": 53195351, "downvotes": 9045041, "votes_result": 44150310, "votes_cast": 170, "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "ラテンアメリカの人口の大部分が、仕事の性質上、伝統的な金融サービスから排除されているという問題を解決しようとしているこの提案に、ラテンアメリカ人として私は全面的に賛成します。これだけでもカルダノの精神に完全に合致しています。ナノ・マイクロクレジットのソリューションは、すでに伝統的な方法で実施されています。デット資金の確保や融資能力の向上の過程で、ISPO導入のメリットを活用していく予定だ。ADAホルダーは、自国のTOKENをカルダノで提供することで、彼らのビジネスモデルに魅力を感じるようになるだろう。12ヶ月後には、2000人のADAホルダーが集まり、ステークプールには1億ADA以上のステークがあると予想しています。そのターゲットは、社会・人口統計学的特性により、従来の金融システムの恩恵を受けることが困難な人々である。しかし、地方分権の観点からは、提案の特徴を改善することを提案します。例えば、プロジェクトの第2/第3フェーズにおいて、提案されたソリューション全体を運用するために、チームがスマートコントラクトの導入を検討していることを記述します。そうすれば、CatalystやCardanoのエコシステムが求めているものとの整合性が高まります。\r\n", "q0r": 5, "q1": "このビジネスモデルは、すでに8ヶ月間市場に出回っており、優れた結果を示していることから、チームの能力をある程度把握することができます。また、MELD、VENT、ADABLUEといった優れたパートナーを加えることで、カルダノの機能を利用してビジネスモデルを改善することができるでしょう。スキルと経験については、チームは簡潔で適切な説明と、プロフィールへの参照リンクの両方を提供しています。シンプルな予算が提示されており、ほとんどが開発に費やされています。しかし、開発時間のコスト、求めているプロフィール、どこで採用するかについても提示されていれば理想的です（開発時間のコストは、採用される状況によって大きく異なることを考慮して）。また、記載されているパートナーの人物や連絡先への言及がないのも改善の余地があります。\r\n", "q1r": 4, "q2": "チームは、実装のマイルストーンを提示するのではなく、成果物の説明を提示することにしました。最初のものは1ヶ月後、2番目のものは6ヶ月後に提示しました。監査可能性の観点からすると、チームは実装中のステップやアクティビティをコミュニティに説明するために、もっと努力すべきだったと思います。とはいえ、プロジェクトの成功を測る指標については優れた記述がなされているので、評価しなければなりません。合計8つの評価基準が提示されており、4つの期間に分けられています。最初の評価基準は月の初めに行われ、最後の評価基準は12ヶ月後に行われます。", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 21, "ne": 12, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "This proposal is spot on aligned with the challenge. It does not only help grow the Cardano ecosystem in Latin America but even helps relieve human suffering. Every individual that doesn't have to go to greedy loan sharks is a success story. Perhaps the next step is to turn the loan sharks in to ADAentrepreneurs. :)\r\n\r\nAlready Grameen Bank proved that unbanked and underbanked communities are trustworthy and now this type of modern \"Collaborative Credit Scoring\" mechanisms help popularize that fact.\r\n\r\nI like the team's ready-for-collaboration thinking: \"We can even facilitate our credit scoring to other Cardano dApps who can benefit from our credit scores.\"", "q0r": 5, "q1": "A solid team with 10 members publicly listed in LinkedIn, a reasonable expansion roadmap and already existing product. What more can you ask? Well, you can ask partnerships. They have even those. A word or two from Ken Olling (MELD) would have helped legitimize the said partnership but I guess we'll just take your word for it. \r\n\r\nThe only open question remaining is this: What can the ISO/ISPO participants do with the native tokens? In the comments section the answer is \"Our token will be used by our users to get endorsed to get the loans in stablecoins / fiat\" but what will I do with the token if I'm nowhere near in Latam region? If you can answer that convincingly, I might just become one of those ISO/ISPO participants.\r\n\r\nLater the plan is to move the off-chain microloans on-chain but the team needs to come up with a sidechain or state channel solution to make sure the fees are kept to the minimum. They reveal in the comments an interesting detail: \"we are lending even bus tickets\".\r\n\r\nRegardless of these possible caveats, I am confident in the team to implement this initial plan and to find answers in the open questions.", "q1r": 4, "q2": "Although there's not much detail about the deliverables and KPIs, it's a fairly straightforward plan: employ one developer to set up the stakepools and another one to take care of the native token minting and distribution. The team hasn't budgeted anything for themselves. This tells me the company is already well-funded and functioning (running on 5% profit margin). Auditability comes from the fact that results speak for themselves. It is indeed the Cardano community who literally votes with their wallets whether or not to participate in Kashin's early steps.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 19, "ne": 6, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This would, if carried out properly, align perfectly with the goals of both this challenge and Cardano as a whole.  By providing opportunities for persons with need for small loans an opportunity to build credit where no useful/dependable/fair credit system exists, Cardano will be entering into a market in which it may very easily become a critical financial system while simultaneously improving the lives of members of the society.  Additionally the setup and operation of stake pools connected to this endeavor will increase decentralization of Cardano into Latin America.", "q0r": 5, "q1": "Based on the information provided by the proposers team, it appears that not only do they have considerable experience in financial management and app building but they are planning to integrate Cardano into an already-existing successful lending infrastructure, including an existing app already utilized by persons in multiple countries.  Based on information presented it appears highly likely that this will be a successful proposal.", "q1r": 5, "q2": "Progress and success are suggested to be audited by growth of connected pools and distribution of native tokens.  The numbers they intend to have on two stake pools within a year are respectable and if achieved should represent a considerable foothold in Latin America.  It seems that this would be easily verifiable and represents good potential for Cardano expansion.", "q2r": 5, "assessor": "z_assessor_708", "no_vca": 15, "ne": 4, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The problem raised by this proposal is clear and also related to the needs of the challenge, in the sense that its solution works to solve problems that would bring concrete solutions on a local scale and progressively on a wider scale in South America. Although the positive impacts for the Latin community are clearly stated, those concerning the Catalyst community are a little less explained, but it is possible to understand this implicitly, especially since the KPIs provide clear evidence of the overall contribution of this project. ", "q0r": 4, "q1": "The explanation at the beginning is an advantage and a confidence booster. The team members are clearly identifiable and supported by links on their linkedin profiles, as well as the accuracy of their mentors and partners. The budget is clear and combined with timing indicators, it seems reasonable. The timetable also seems realistic and clear. What is appreciable is that the technical aspects are addressed in an understandable way. The risks are not discussed, which could have been a benefit. ", "q1r": 5, "q2": "All the information given is clear. It is interesting to propose the KPIs in this way: \"Our project will be successful if\", which gives concrete indications so that the community can attest the success of the proposal. The website is provided and allows for more explanation. This project could benefit from offering more ways for the Catalyst community to follow its progress, which could perhaps help them in their desire to launch their project in Cardano.", "q2r": 4, "assessor": "z_assessor_739", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "インフォーマル経済にも融資を行っていますが、共同のクレジットスコアはリスク評価に優れており、デフォルト率は2倍低くなっています。", "experience": "当社のリーダーシップチームは、ラテンアメリカ市場でグローバル企業を率いた経験があり、金融業界とモビリティ業界で強い経験を持っています。"}