{"id": 381022, "author": "joshf", "title": "Scale-UP Cardano's Community Hubs", "url": "https://cardano.ideascale.com/a/dtd/381022-48088", "category": 26257, "amount": 500000, "description": "How do we encourage Local Community Hubs to drive adoption and awareness of Cardano in 2022?", "funded": 2, "upvotes": 137765348, "downvotes": 9100144, "votes_result": 128665204, "votes_cast": 692, "f6_no_assessments": 4, "f6_rating": 4.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "As humans, we socialize within our community spaces as part of our socialization process. In order to create meaningful connections among people, building communities is a crucial process that fosters these connections and creates the infrastructure for those connections to occur. This challenge makes a compelling case that the growth of the Cardano community will depend on users from outside of the blockchain community and from local communities.\r\n", "q0r": 5, "q1": "The last two funds have demonstrated that the community has the capacity to address this problem. In Fund 6, with only $100,000 available, 32 proposals were submitted, of which only 11 were allocated funds. For Fund 7, with a budget of $35,000,000, 66 proposals were submitted seeking funding, representing an increase of more than 100%.\r\n", "q1r": 5, "q2": "Both the criteria and the success metrics suggested are relevant to this challenge's mission, and I believe that the definition of the KPIs will enable effective measurement. To measure progress in addressing the challenge, I strongly believe that the success criteria and suggested metrics are set correctly.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 24, "ne": 3, "ng": 20, "nfo": 1, "vca_o": 1}, {"q0": "The challenge aligns with Fund 8 Strategic Goal of prepare a group of people willing and able to make contributions to the ecosystem. To improve challenge: better articulate how the challenge aligns with more than 1 of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The challenge does an excellent job articulating the case for its budget, demonstrating demand, interest and historical success trend. ", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "Without a doubt, the role of the local [grassroots] communities is extremely important in the sustainable development of the Cardano community. Without this [local community hub], Cardano's mission can not achieve.\r\nTherefore, I strongly agree with this proposal's alignment", "q0r": 5, "q1": "This challenge has been voted and approved by the community [F6, F7] with many proposals submitted. The challenge team can be ready at any time. Therefore, without a doubt, I completely agree with the feasibility", "q1r": 5, "q2": "This proposal provides clear, logical, and measurable metrics that are precisely set to measure progress in addressing the challenge. As a result, I strongly agree with this proposal's verifiability.", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "Providing and funding projects that help grassroot activity is great. This project is trying to provide public knowledge of cardano at a very basic level. ", "q0r": 5, "q1": "This group has laid out exactly the basic needs to start simple hubs and track the growth. I feel the desciption they put forwad shows serious thought and ambition. \r\nThe groups that are listed participating to this proposal are also well established", "q1r": 5, "q2": "Although the timeline is rather short and ambitious. I feel that the tracking of progress for each micro hub they plan to install is very intuitive. Therefore by throwing a wide net of multiple hubs and closely tracking their traction they will certainly have a large sucess. \r\nThe metrics used to track and audit the progress is put forwrad in great detail", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "importance": "Without users on the ground level, we are building niche products serving mostly technical people with blockchain expertise.", "success": "Local Community Hubs across the world where the average person can take part in their own language and with their own cultural understanding"}