{"id": 381924, "author": "alkebulan.alliance", "title": "Banking the \"Unbanked\"", "url": "https://cardano.ideascale.com/a/dtd/381924-48088", "category": 26257, "amount": 300000, "description": "Creating the opportunity for home grown solutions for the 4 billion \"unbanked\" in the developing world.", "funded": 1, "upvotes": 25974278, "downvotes": 21149606, "votes_result": 4824672, "votes_cast": 221, "f6_no_assessments": 6, "f6_rating": 2.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe proposer raises a valid point that there are many people without access to financial infrastructure, which is inline with the Cardano's mission of providing a social and financial operating system for the world.\r\n\r\nAt the same time, the  proposal does not explicitly support the strategic goals of Fund 8: grow the number contributors, make Caradano an open-source project, and grow the app and dev ecosystem.\r\n\r\nIn addition, the proposal does not provide an analysis of the current causes of the problem and recent success stories that can estimate the potential impact of the funds requested.\r\n\r\nMy suggestions are:\r\n1) split the problem into specific use to identify the ones where only a software-based solution is necessary to make impact.\r\n2) reformulate the initiative into proposal for an app/service in the Dapps & Integrations challenge or a similar one.\r\n\r\nI have made the following deductions:\r\n- 2 points because this initiative does not support any of the strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of the problem, proving that a noticeable progress can be made with the available resources.\r\nMy score is 2.\r\n", "q0r": 2, "q1": "The Catalyst community and Cardano ecosystem is well positioned to solve the problems of financial infrastructure.\r\n\r\nAt the same time, access to banking services is not only a technological but also a regulatory problem: in many countries financial services is heavily regulated industry.\r\n\r\nThis proposal would be much stronger if it provided:\r\n1) an overview of regulatory challenges for adoption of blockchain to provide offician banking services.\r\n2) success stories where blockchain-based solutions were officially welcomed/approved by local governments.\r\n3) an overview of the most demanded financial services and the technological/regulatory blockers preventing their introduction.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of overview of most needed use cases and the repspective regulatory readiness.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\n- 1 point for the challenge team of one proposer, reducing the capability to provide advice and experience-based insights to participants.\r\nMy score is 2.\r\n", "q1r": 2, "q2": "The suggested metrics are very ambiguos (how to measure the collaboration between countries or creativity and innovation?), making it impossible to accurately track progress towards the set goal.\r\n\r\nThe proposal would be stronger if it considered metrics tracking the progress towards the defined problem:\r\n1) the % of the world's population who got access to financial services through the projects in this proposal.\r\n2) the % of Cardano users onboarded through projects in this proposal.\r\n3) the satisfaction of the users with the services in comparison vs alternatives.\r\n\r\nI have made the following deductions:\r\n- 1 point for the ambiguity in the defined metrics.\r\n- 1 point for the lack of metrics evaluating the relative impact.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 2.", "q2r": 2, "assessor": "z_assessor_1011", "no_vca": 25, "ne": 7, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "Banking the unbanked aligns with Cardano's mission. The challenge brief should be more than just a quote from Charles Hoskinson. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The budget is moderate compared to the total budget and there are several regional challenges that overlap with this one. The community has the capacity to address the challenge however probably not all of the overlapping challenges simultaneously.", "q1r": 5, "q2": "Key metrics are not measurable to verify measured progress towards addressing the challenge. To improve challenge: better articulate how the success criteria address the challenge and how the metrics can measure progress towards the success criteria.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This project aims to adress the challenge of mass adoption into the Cardano ecosystem by tapping into accessabilty of those who dont have access to it finances and other ecosystems as such. This project aims to reach underdeveloped countries those without resources and basic banking. This will allow for the growth of the ecosystem in a diverse way. Allowing people of less fortunate circumstances the opportunity to be included in the DeFinance system, basic voting and giving them the opportunity to aquire funds securely without third party interferance. It will recolutionize the crypto space as a whole. The team has not clearly stated the capacity the Cardano ecosystem will impact and assist in the accomplishment of this challenge. This projects proposal may very well be to highscale for its current proposal. ", "q0r": 3, "q1": "Its not clear as to if community has the capacity to address this challenge or not. This challenge is a very difficult one to approach. To accomplish this challenge the project and proposing team needs to have a clear path in terms of what regulation will cause roadblocks and how they will meet requirements to get arround them before this challange can be fully accomplished. Underdeveloped countries have a depetion of resourses and backing. A clear plan as to how the project will deploy and execute such protocol is critical in deciding the capacity of this projects success. ", "q1r": 2, "q2": "There is no success criteria within this projects plan of action. The project team has listed key metrics to measure but has not explained how  those metric measure to the success of the project. The team has not stated any previous experience to back the projects roadmap and or continued success. If the key metrics are met there can be success but there needs to be a clear road as to how the project team will attempt to accomplish the tasks. ", "q2r": 1, "assessor": "z_assessor_400", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This challenge is critical to achieving Charles Hoskinson's vision of \"Banking the UnBank\", in particular, and Cardano's mission [\"Making The World Work Better For All\"]. In detail, as we know, Cardano is a blockchain platform for changemakers, creating the possibility for the many, as well as the few, and bringing about positive global change [source: https://cardano.org/]\r\nTherefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal with a score of 5.", "q0r": 5, "q1": "I am convinced that the Catalyst community has the capacity to address this challenge. establishing a challenge team for this challenge is not a problem for considering.\r\nTherefore, based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal with a score of 5.", "q1r": 5, "q2": "Although suggested metrics are set correctly to measure progress in addressing the challenge, but it is not quite measurable [ex: how to measure \"Creativity and innovation\" ?].\r\nTherefore, based on the given information, I am neutral with this proposal's verifiability, I can rate the verifiability of this proposal with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "I think this is a really cool idea, we all know third countries don't have access to the financial sectors properly. We all understand this is a very important issue. However, in this project I have not seen your specific solutions, how you approach or build a community. From that community, we can completely launch specific events to target the unbanked unlucky people. As your community grows I think we can completely grow and spread internationally", "q0r": 2, "q1": "Regarding feasibility, you should tell us more about your profile Linked, Instagram, website,... What you have accomplished and leadership for this project. With this project, you should draw a specific, short-term and long-term roadmap. So that everyone can imagine how you will start the project, connect and commit to it. To build a roadmap, you can build a community and a team with a good foundation. Strong understanding of finance, blockchain, AI,...", "q1r": 1, "q2": "The amount of 300000$ is a very large amount. To raise this amount, you must have specific KPIs for the project such as 10000$ for the community, 5000$ for marketing, 20000$ for the build platform. And let people know when you use the right amount for your project. Good luck", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "This challenge can help to achieve Cardano's mission: contributing to the positive advancement of blockchain as a world-changing technology. Crypto currencies is more and more common because they show the potential to reduce and eliminate the dependency on country governances. Cardano can contribute to develop a more free market with more opportunities for the poor - the \"unbanked\". ", "q0r": 4, "q1": "The Catalyst community is familiar with projects related to finance, organising events, and multi-culture. These factors are keys to bring the success to this challenge.", "q1r": 4, "q2": "Key metrics are still too general and not details enough. For example, how can we measure the \"Creativity and innovation\" of proposals joining the challenge? Or how can we measure the Focusness on Maslow's hierarchy of needs?", "q2r": 2, "assessor": "z_assessor_809", "no_vca": 16, "ne": 0, "ng": 13, "nfo": 3, "vca_o": 1}], "importance": "External solutions are unlikely to solve problems. The \"unbanked\" know what their problems are and have solutions of their own.", "success": "Practical solutions to create knowledge, build confidence, break down barriers to opportunity and take charge of the future."}