{"id": 382660, "author": "cautiousfox", "title": "Business Solutions (B2B & B2C)", "url": "https://cardano.ideascale.com/a/dtd/382660-48088", "category": 26257, "amount": 1000000, "description": "How can Cardano-based solutions help meet real business needs and what would be their impact?", "funded": 2, "upvotes": 98324517, "downvotes": 6034504, "votes_result": 92290013, "votes_cast": 316, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "I agree that this challenge is one of the most critical areas to tap into in order to make Cardano a world financial operating system.\r\n\r\nThe challenge  focus is on existing real businesses and both B2B and B2C businesses will belong to this challenge. Myself being worked in multiple enterprises (both big and startups) I have seen that most of the companies are interested about Blockchain space, but really, even if they see the power of it, are not putting much effort into it because not enough budget/time/knowledge exist. \r\n\r\nTherefore, when we have such a challenge we are making sure that we are tapping into those consumers that will indirectly onboard to Cardano's eco system via enterprise solutions.\r\n\r\n", "q0r": 5, "q1": "The challenge settings mentions the areas that we expect as part of the future proposals that will be made under this category. \r\n\r\nIn my opinion, all the points such as MVP on Cardano, moving an existing business ready product to Cardano, A prototype solution etc are all points that Cardano community already has good experience with. Most of these points are and have been covered in different other challenges such as dapps categories.\r\n\r\n I have also noticed that many times, some companies tried to propose their proposals in dapps category where they want to enter the blockchain space, but they face very tough competitions with other proposals such as defi/Nft etc. Therefore, it is nice to have such a challenge, that specifically addresses businesses.\r\n", "q1r": 5, "q2": "The success criteria is clearly defined. Clearly we expect innovative end products and services, showing that we need something concrete to measure the success of this challenge. Additionally, not only the success of the implemented solutions are important, but also did these services make the solution attractive enough by proving that they increase efficiency, transparency, and stakeholder engagement, hence providing end value to the businesses (either B2B or B2C model).\r\n\r\nThe key metrics are clearly outlined, and one of the points i really like, is about additional funding from other sources for the funded proposals. This would be really great as usually B2B solutions tend to get quite expensive. Therefore, having additional funding sources is an important point to have. \r\n\r\nHence, i fully agree with the verifiability of this proposal.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe objective of finding new business use cases supports the Fund 8 objective of growing the number of apps in the ecosystem.\r\n\r\nAlso, while it's valuable to be aware of the business needs, to grow the cardano ecosystem at the maximum pace, looking across all app areas (business, consumer, government, etc.) can help generate the maximum ROI for the community. So, to make this proposal stronger I'd suggest adding a clear rationale why focusing only on business solutions can bring the higher ROI. Without an explanation, I beleive that business apps could be developed as part of a broader Dapps and Integrations challenge or another similar one instead of keeping it by itself.\r\n\r\nI made the following deductions:\r\n- 1 point for directly influencing only one of 3 Fund 8 strategic goals.\r\n- 1 point for constraining the challenge area without explaning the ROI of that.\r\nSo, I give it a score of 3.", "q0r": 3, "q1": "Given the proposed budget size, and the diverse Catalyst community with skills in buisiness and business development present, it's possible to create new solutions targeting business needs.\r\n\r\nIn my opinion (based on experience of working in and building B2B businesses), scaling B2B apps can require a dedicated sales organization/outreach team, limiting the potential impact. Moreover, the enterprise doamin often has longer sales cycles (6+ months) especially with larger enterprises, reducing the pace of iterative improvement through feedback. These factors, make the proposal risky. The proposal would be stronger if it included a clear rationale how the focus on business needs can allow for a quicker growth of the ecosystem.\r\n\r\nI made the following deductions:\r\n- 1 point for potentially missing skills / resources - complex sales organizations for B2B usecases.\r\n- 1 point for longer feedback cycles - potentially limiting the pace of development.\r\nSo, I give it a score of 3.", "q1r": 3, "q2": "The proposal defines metrics that can measure the impact on the cardano ecosystem directly (the number of dapps, the growth in the mainnet activity, etc.).\r\n\r\nHowever, the proposal would be stronger if it considered additional metrics tracking the impact on the ecosystem and competitiveness of the solutions:\r\n- the % developers onboarded into cardano ecosystem through this challenge.\r\n- the % of users brought by apps/solutions developed for businesseses.\r\n- the satisfaction of the end users with the  solutions vs the altenatives.\r\n- the market share of the apps/solutions vs the competitors.\r\n\r\nI made the following deductions:\r\n- 1 point for parital tracking of impact on the community.\r\n- 1 point for not considering user satisfaction and competitiveness of solutions.\r\nSo, I assign a score of 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 21, "ne": 5, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "Bringing together businesses and getting more businesses to use Cardano aligns with the Cardano mission and one strategic goal. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The request is for 8% of the total budget which seems a little high for a challenge that partially overlaps other challenges, has some deliverable examples that seem light given the potential funds, and targets a small percentage of the overall community. I would strongly agree on the community capacity at half the budget amount however based upon the budget requested I simply agree on the feasibility. ", "q1r": 4, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}], "importance": "Companies are finally discovering the power of blockchain technologies and Cardano is ready to onboard exciting B2B and B2C solutions.", "success": "Innovative products and services that increase efficiency, transparency, and stakeholder engagement as well as expand business to new areas."}