{"id": 381181, "author": "ecomchaco", "title": "FulBit - NFT Football Game", "url": "https://cardano.ideascale.com/a/dtd/381181-48088", "category": 26241, "amount": 15000, "description": "Há uma demanda crescente por NFTs com temática esportiva, mas falta ao setor um bom mercado para eles.", "funded": 1, "upvotes": 29957073, "downvotes": 12550726, "votes_result": 17406347, "votes_cast": 169, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "A idéia fala bem com os objetivos do desafio, especialmente com as metas específicas de criar novos ativos digitais (NFT) na cadeia de bloqueio e atrair novos atores para o ecossistema. Penso isto porque, como o jogo seria, em suma, criar cartões (NFT) que representem jogadores da Liga Argentina de Futebol, talvez as pessoas que não estão sequer interessadas em jogos e moedas criptográficas decidam explorar estes universos em nome de um gosto pelo esporte, já que o país tem muita tradição no jogo. Achei especialmente interessante quando os autores dizem que os jogadores serão acompanhados por pontuações, que estão diretamente relacionadas com os resultados do mundo real de cada jogador. Acho que isso traria um viés muito dinâmico ao jogo criado e poderia valorizar e desvalorizar certos jogadores e incentivar o comércio, talvez. Também é muito interessante quando eles se comprometem a reembolsar o dinheiro solicitado no fundo se o jogo for comercialmente bem-sucedido (isto poderia ser oficializado de alguma forma, para que esta promessa não seja esquecida). Além disso, é positivo que os autores citam vários objetivos que pretendem atingir a curto, médio e longo prazo no jogo, eles nos dão uma compreensão do que seriam os componentes básicos e também alguns complementares para o funcionamento do projeto. Eles anexam um livro branco, onde se pode ver com mais detalhes sobre as partes técnicas e a motivação do projeto. Uma coisa que eu gostaria de observar, entretanto, é que em minha opinião poderia ter ficado mais claro na descrição da proposta se houvesse algum tutorial no jogo ensinando as pessoas a lidar com o NFT. Algumas pessoas já estão familiarizadas com esta tecnologia, mas a maioria não está, portanto poderia haver, por exemplo, um guia sobre como jogar isto na prática, o jogo me parece uma boa porta de entrada para novos membros do ecossistema e tem chances de causar muito movimento na cadeia de bloqueio, além de também se relacionar com o desafio da América Latina. E, finalmente, gostaria de enfatizar como os autores atribuem numerosos sites que argumentam a importância e validade de seu projeto, tornando o investimento algo mais plausível aos olhos daqueles que não são da Argentina e não sabem como está indo a relação entre seus habitantes e o mundo criptográfico.", "q0r": 5, "q1": "Os autores dividem o desenvolvimento do projeto em cinco partes, e cada uma delas tem um pequeno texto que explica o que será feito. Tais descrições nos fazem ter uma compreensão sólida em relação às atividades que serão desenvolvidas, e através da planilha nos documentos sabemos, por exemplo, quem faria cada coisa e por quanto tempo cada uma destas 5 etapas. Sobre a apresentação da equipe: é bom, mas poderia haver mais detalhes sobre cada pessoa envolvida. Conhecemos seus nomes, principais funções e há também links para a maioria dos linkedin, portanto temos a possibilidade de conhecê-los com mais detalhes. Apesar disso, seria interessante se um pouco sobre suas trajetórias fossem descritas na própria proposta (não precisaria ser algo tão longo, em torno de 3 linhas já teríamos informações suficientes). O que é ótimo aqui é que é uma equipe grande e diversificada, de desenvolvedores a especialistas legais, mas houve uma falta de pessoal de projeto na equipe, apesar de sua ênfase na importância de investir na UI/UX. Eles têm uma parceria com uma empresa (ECOM) que já tem algum envolvimento com a Cardano, o que é um fator que transmite segurança. E por último, eles estabeleceram um detalhamento financeiro muito detalhado, na verdade, esta é a melhor organização orçamentária que vi até agora em minhas revisões da f7. É um documento nos documentos com uma divisão feita em etapas, semanas, atividades e quem estaria cobrando por cada etapa. Acho que gostaria apenas de um pouco mais de detalhes sobre os membros da equipe na própria proposta, mas além disso, tudo é ótimo.", "q1r": 5, "q2": "Logo na introdução da proposta, os autores falam de vários objetivos, o que nos dá conteúdo para sermos auditados ao longo de todo o desenvolvimento do projeto. É possível monitorar se os requisitos básicos foram cumpridos, e depois os complementares. Isto poderia ser feito por qualquer membro da comunidade que seja argentino e que, de preferência, tenha interesse no mundo do futebol. Além disso, temos também outros dados, as métricas de sucesso, através das quais podemos ter uma noção além do que é esperado com a conclusão do projeto. A equipe também poderia contatar a comunidade posteriormente para apresentar alguns destes dados, o que poderia ser feito mensalmente através da elaboração de planilhas nos documentos (eles já provaram ser bons nisto). Em resumo, acredito que a equipe estava preocupada em estabelecer uma auditabilidade sólida para seu projeto, fornecendo muitas informações.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 21, "ne": 15, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal effectively addresses the challenge by providing a NFT based (tradable) football game that will be tightly coupled with NFTs on Cardano eco system. \r\n\r\nThe idea is noble and in sync with what community wants to achieve by having larger presence of Cardano in gaming eco system.\r\n\r\nThe idea goes on to  give essential complementary and planned features and functionalities for this proposal.  Argentina is one of the few countries where football is most popular sports and I think combined with Cardano tech we can onboard a lot more people to Cardano ecosystem.\r\n\r\nThe attached google docs is very detailed ones and in my opinion can be reduced a little, as i think in general whoever is here will not need an introduction to Bitcoin, Ethereum etc. Nevertheless, good intentions behind it.\r\n\r\nMoreover, i think more clear distinction could have been made, so that community can understand that it is going to be an NFT gaming platform, not a game itself ? Therefore, i see some room for improvements in writing of the proposal\r\n\r\nOverall i find this proposal to fit effectively within the confound of this challenge settings.", "q0r": 4, "q1": "The experience of the team is good, especially for the funding that they have asked for. They do have resources for Front end and back end development and the links are posted to have a look at their skill sets.\r\n\r\nIt is also nice to see that they have some Emurgo students in there, which means they are already active in plutus programming and gaining some experience in there.\r\n\r\nThe plan presented is quite detailed, with a separate link google docs, where different stages are split into tasks and subtasks. Each subtask is well outlined with potential duration and this gives a better understanding of why certain funds are requested. Nevertheless, it would have been better, if the numbers $15000 was also split in the same way as in the tasks and subtasks are split. e.g. What is the rate of developers per hour etc .\r\n\r\nTherefore, i think with addition of such points i had given it full ratings. Nevertheless, good luck to the team.\r\n", "q1r": 4, "q2": "The information provided here is sufficient as the roadmap is given with respect to 6 months. Also the detailed plan outlined is easy to audit by the community as it gives good detailed outlook on what implementation is expected when.\r\n\r\nHowever, the potential risks could have been mentioned so that community is aware of what potential blockers might exist. As this helps community to upfront be aware of problematic situations. Given the fact that your team has also people from Tax and Law domain, i expect may be you see something that is worth mentioning on the risk front :)\r\n\r\nSince the team is publicly available, in general i agree that the information provided is sufficient to audit the progress and the success of this proposal", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The team has very detailed documentation about their project including detailed tasks for each phase, and their goals in the proposal can help us well understand how their idea can solve the problem well and further development. For better, they should provide a more detailed explanation or case study for their goals, it will help everyone easy to understand how the project gives value to the football industry.  \r\nAnother better thing is that their key metric aligns with the challenge setting and with the idea of supporting the sports industry, I think it will scale fast in the future when their idea is formed. But they should provide more info to show how the project will impact to Cardano ecosystem instead of only the commitment of reimbursing the requested funds and supporting non-profit organizations endorsed by Cardano Foundation.", "q0r": 4, "q1": "The team gives us a file that provides detail of their task, timeline, and budget. Moreover, I think with their team members with skills, the project can be successful. But I think they should provide some more info about how they will implement their idea into the world, and also some detailed technical explanation. \r\nMoreover, the budget they ask is for the first phase with the purpose to make ECOM believe their project's future, but what if it's not enough for that and which plan they will do if the risk that ECOM still not believe them after the first phase when the budget is out. ", "q1r": 4, "q2": "They have a detailed timeline that is broken down into weeks and their goals, key metrics are very clear and align with the challenge setting. But they lack detailed explanations of the problem and solutions to solve it. My advice is that they should provide some case study about how their idea can help end-users. But we can check their whitepaper on their site, it can help a lot to audit their idea in the future. ", "q2r": 4, "assessor": "z_assessor_651", "no_vca": 17, "ne": 4, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The problem is in the challenge, but It's a little bit hard to figure out how it can help to solve the problem and impact the Cardano ecosystem with its brief info. My advice is that team should provide some case studies to help people better understand your idea, for ex: how your project can Integrate players' scores to their NFTs, how users can use those NFTs in case studies that benefit them... \r\nThe team has key metrics success that can align with the challenge setting but as again, lacking idea information makes me confused about how this key metric means to your projects, for ex: what is the roles of artist here in the project, what is player and what activities they will do in this project... \r\n", "q0r": 3, "q1": "The project has great team members with great goals and we can check their detailed timeline activities in the file that they attached. The budget they ask for this proposal is also reasonable but they should provide some more detail because the detailed activities in their file are only launching their channels - it's nonsense for that amount of money. \r\nOverall the project, I think they can do it with the detailed timeline in the file they give us. But they should provide detail explanation about their project to help us assess their task better. ", "q1r": 4, "q2": "The project has a detailed timeline in their file that they can easily achieve by their team. But they lack detailed explanation about their idea that how they can solve their problem. I think they want to say about that by your goals, but they should detail more to help people easier understand how it works. Also, it can help us assess better about feasibility of the project by their tasks - is it suit with your solution. ", "q2r": 3, "assessor": "z_assessor_671", "no_vca": 16, "ne": 4, "ng": 6, "nfo": 6, "vca_o": 1}], "solution": "Crescer o mercado NFT da Cardano para competir com as principais plataformas em outras cadeias de blocos, fornecendo um tema popular para colecionadores: o futebol.", "experience": "Nossa equipe é formada por profissionais de diversas áreas (direito, contabilidade, marketing, programação), todos eles especialistas em cadeias de bloqueio."}