{"id": 384261, "author": "lineage.jon", "title": "Gliese 16c - Asian NFT game", "url": "https://cardano.ideascale.com/a/dtd/384261-48088", "category": 26241, "amount": 33300, "description": "Os jogos criptográficos atuais são muito centrados no Ocidente. É imperativo envolver o envolvimento do Leste Asiático na obtenção de uma adoção mais ampla.", "funded": 1, "upvotes": 35527632, "downvotes": 14908355, "votes_result": 20619277, "votes_cast": 149, "f6_no_assessments": 4, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "the problem has been precisely defined. the experience described matches the quality of the explanation. the impact is forcused on the asian market and addresses the challenge. global scaling is possible. the proposal has added value to the cardano ecosystem.", "q0r": 4, "q1": "budget and schedule are reasonably structured. a link to the twitter page shows 6 followers. the roadmap shows the use of the budget for the next year. further funding is not mentioned. the experience of the applicant is not controllable. a link to a linked.in portal or similar is missing. the implementation of the roadmap is likely, but it remains unclear how the project will get the $200,000 to complete the project. ", "q1r": 3, "q2": "the roadmap is sensibly structured and the delivery dates clearly defined. the community could check the progress of the project via its own twitter page, provided the applicant sends regular updates. unfortunately, there is no info on this. possible risks are not described and should be mentioned. also possible solutions for them.", "q2r": 3, "assessor": "z_assessor_260", "no_vca": 20, "ne": 1, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "The problem statement of this proposal makes the target audience clear, not that it could not be extended to non asian market, but being a gamer and asian myself I totally agree with the notion \"game that fits the East Asian appetite\". \r\n\r\nIn gaming industry, culture plays a huge role in attracting specific games built for specific communities. The solution proposed therefore, in my opinion is spot on and i fully agree that given the size of community and number of people in east Asia there is a huge opportunity via such games, if implemented, to popularize gaming based applications on Cardano eco system.", "q0r": 5, "q1": "The plan presented is quite elaborative, it is well explained that Quarterly what milestones are to be fulfilled and expected.\r\n\r\nThe total cost of the game is about $ 200k , however, the initial kickoff funding is around $34k which is quite feasible for the given milestones. The budget distribution is well explained, based on the 2022 Q1\r\n\r\nHowever, the team experience and who is basically behind it is missing. There is a twitter account but thats all we have. I would suggest the proposer to atleast have given some details, such as github, linked in profiles of the people who are actually involved with this project. \r\n\r\nThis will be a great help to the community to see the experience of the people who are actually proposing this proposal. I understand that success criteria is that you will assemble a full team in 6 months, however, atleast the proposer should make him/her public so that we can know the credentials of the proposer atleast. \r\n\r\nSadly, even though i like the idea, therefore i can not give high ratings for this section, as lack of team details puts some question marks on likelihood for this proposal to be implemented successfully.", "q1r": 3, "q2": "I would have agreed that the information provided is sufficient to audit the progress and success of this proposal.\r\n\r\nI think, however, that since we do not even have the information on the team (may be there is no team for now) or the proposer itself, it is hard to say who will we ask for the progress of the proposal. e.g. How many people are there for this proposal ? who will be the contact person for it. ? are there more than 1 people for this proposal ? \r\n\r\nEven though the plan is presented as per quarterly milestones, it can also be improved by providing details on how weekly basis progress is tracked. Are you guys planning to use Agile for your project ? Which tools will you make available where community can track the progress ? \r\n\r\nFor me there are further improvements needed for this proposal writeup, hence i can not agree but since the writeup other than that is good, i do not disagree, hence 3 stars.", "q2r": 3, "assessor": "z_assessor_454", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "It's true that current crypto games are very Western centric therefore it will be great to enter the East Asian market. Plus, the content of the game is really interesting and I personally think it's the East Asian taste.", "q0r": 5, "q1": "The proposal, although brief and concise, is very detailed with the realistic plan. It includes Roadmap and phases. They even already started and really clear about what is their product vision. ", "q1r": 4, "q2": "The KPIs and roadmap is on point. They have sufficient quantity for each KPI and clear about what success look like in each step.", "q2r": 4, "assessor": "z_assessor_809", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This proposal targets a large market, which is Southeast Asia. This will certainly attract a large number of gamers. Not only do they not waste time and money in vain, but they can also reap long-term profits from playing the game.", "q0r": 5, "q1": "The working team consists of many members with high professional qualifications. Besides, you are Asian, I am sure you can grasp Asian preferences and build games easily.\r\nThe roadmap is very detailed. I hope it will be successful in the future.", "q1r": 5, "q2": "In general, the information described is relatively complete, but it is necessary to add a few more contents:\r\nMore description of the game is required. For example: plot, characters, in-game features,...\r\nShould be more clear on the Play To Earn aspect.", "q2r": 4, "assessor": "z_assessor_862", "no_vca": 19, "ne": 2, "ng": 10, "nfo": 7, "vca_o": 1}], "solution": "Desenhe um jogo que se adapte ao apetite do Leste Asiático, empurrando-o para fora em plataformas móveis e de PC, pois são as plataformas mais populares.", "experience": "4 anos em Gerenciamento de Projetos, vasta conexão de recursos em TI. Como sudeste asiático, e um entusiasta de jogos, eu conheço os apetites dos jogos asiáticos."}