{"id": 381294, "author": "carnivilla", "title": "Onboarding Untapped Communities", "url": "https://cardano.ideascale.com/a/dtd/381294-48088", "category": 26241, "amount": 50000, "description": "Gamers in Metaverse-like communities lack functionality and ownership with their digital property and their environment's assets.", "funded": 1, "upvotes": 29243871, "downvotes": 20588156, "votes_result": 8655715, "votes_cast": 151, "f6_no_assessments": 6, "f6_rating": 3.888888888888889, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=18987"], "media": [], "f6_assessments": [{"q0": "This proposal is very interesting because it does not promise to create a game itself, but a virtual environment in which players from different games can interact and learn how to use the technologies that the blockchain promotes in a more efficient and practical way, such as NFT, for example, which according to the authors of the proposal will be seen as something basic for the player to manage. I believe it is a very relevant idea because despite the blockchain universe already being a reality, this technology is much better known in some points than in others, and it is difficult for one person to learn alone what blockchain, cryptocurrencies, NFT, etc. . Even if the person is from the gaming world, depending on the context in which he is inserted, that is, if it is a country/city in which little is said and known about the world of cryptography, most likely this person will have some difficulty in enter it. If all goes well, that is, if our blockchain becomes more and more popular and the use of NFT in games becomes a widespread practice, people who do not have proper guidance on how to handle them will certainly be harmed. I believe that this idea is well related to Cardano's more general objective as well, to build a more egalitarian world, even if only in this specific part of the games. I liked it, I think if it's successfully funded and executed, it can bring new members to the Cardano ecosystem, who will likely bring other people to the blockchain as well, and so on, a network can start to be created bit by bit, and way to one day attract a lot of people to Cardano. I believe it is a very interesting proposal and one that has high chances of bringing very positive results.", "q0r": 5, "q1": "The team is concerned with providing a short description of each member, in which we know their names and their roles, as well as (in some cases) how long the person has experience in a given area of ​​expertise. Despite that, it would be even more interesting if they provided a social networking page for each one, linkedin is always, in my opinion, the best option, because we can see there past experiences and connections of each member, so you can get to know them. them more intimately. However, here we have some serious flaws. Something that worries me is that, despite appearing capable of the project, none of the team claims to have direct involvement with our blockchain. This would be important to ensure that Cardano would benefit directly, there are other places where players can mint their digital natives, there are several possibilities to interact with blockchain; it is necessary for us to be sure how ours will be used here, because otherwise, it is not interesting to finance the learning of users who do not know for sure whether they will use Cardano's technologies. By the way, it is not clear if they would be able to teach what they propose, which team member has solid knowledge about blockchain, NFT, etc? This is not explicit in the description that is shown to us, unfortunately we need to know if they are prepared for the project itself, beyond their experiences outside the cryptographic universe. On the financial split, the team provides us with information on how the total amount would be split, giving us explanations for each topic. This gives us a good understanding of how this part of the project would develop. The script is satisfactory in terms of detail, it would be 6 months, divided into two big blocks, which we know what activities would happen in each part, so that we have a more solid vision of what is to come. However, due to the issues surrounding the qualification of the team to deal with issues in the Cardano ecosystem, I would say that this topic needs to be reformulated, so that it conveys more confidence and security in the team.", "q1r": 3, "q2": "The team gives us direct data regarding auditability, there are expected success definitions according to the passage of time. There are two topics, specifying how the project would be successful. In this way, we can directly monitor the possible results. It would also be possible to follow the development of the project itself, through the activities that were described in the phases. I think the audibility could be done like this: we chose one or two community members to follow this project, get in touch with the team and collect the data. Monitoring, which can be brought to the community through reports. It would be extremely important that the team itself also gave us satisfaction with the process, not just the results, so that we can understand how the final product is being built beyond what is obtained at the end of the process. Therefore, I believe so, the team provides important information to monitor the project, but I would like to establish direct and constant contact between the team and the rest of the Cardano community, in order to transmit more security in general.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is aimed at an untapped community that would be able to interact with the cardano blockchain seamlessly to bring wide adoption. It would target gamers who are active in marketplaces and provide them with value and a reason to adopt cardano.", "q0r": 5, "q1": "This team has exprience in events, digital creation, and gaming, but it is not clear who will be doing the blockchain/NFT development and what their experience is with such. They have the two partner companies with relevant product experience, but their blockchain development is not clear. This proposal would benefit from providing more details on if that will be outsourced with the budget and who will be doing it.", "q1r": 4, "q2": "This proposal would benefit from breaking down their ideas of success down futher to judge the development vs the initial launch progress. The budget breaks down what the funds are spent on, but could be more comprehensive to improve auditability.", "q2r": 4, "assessor": "z_assessor_612", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Even the problem can be within the challenge, because at my point, their idea with VR can make something special to Cardano communities and it can make our ecosystem become diverse but I'm not sure it is the direction of the current proposal or not? They should have more words to explain to us how their model will impact this challenge. Or providing some key metrics, goals that they plan to get can also help us know about that. \r\nBecause of lacking a lot of these thing I rate them 1 our of 5, hope that they will have a better proposal in next fund. ", "q0r": 1, "q1": "Seem that the team has great experience to finish their proposal easily. In addition, they also divide their phase into small pieces in their roadmap and explain how their people will solve it in the funding allocation. So, I believe that within this proposal scope, its feasibility is 4 out of 5. \r\nAnother thing they should provide is the risk of their proposal and how they will solve it. The fact is with the info inside this proposal, I cannot estimate which risk they will get because of their experience & they're doing well everything for their project and this proposal is just a small step of their development. ", "q1r": 4, "q2": "But they should give us some key metrics, this will help us clarify what they want to get and how it can help our communities. Technically, I rate the feasibility high because of their ability and project situation but they're lack something for us to audit their work. Providing key metrics, detailed explanations about the solution will help people in our communities assess their purpose better. Even we can track their work on their channels that are shown on their website but better be clear here in the proposal. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 17, "ne": 2, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "I'm not sure what detailed solution and how they will solve their problem in detail. Indeed, that their problem is lying in the scope of this challenge but the info in the proposal is not enough to explain how it will and can't help us on assessing the level of impaction to the challenge. \r\nMoreover, even this project is running but this proposal will have its own goals and the proposer should prove some key metrics that they will track when running in the scope of 10 weeks that they're already mentioned in their funding allocation. ", "q0r": 2, "q1": "As a developer, I can understand a bit with the info they shared in the funding allocation but they should have a more detailed explanation about these technologies, also be better if they have more info on the solution explanation - it will help us assess their step of development better. \r\nBut I think that this team can solve this proposal because their project is running in real life and the team info can show their professional skill that suits their job. \r\n", "q1r": 5, "q2": "Again, lacking detailed explanations about their solution can't help us clarify their goal within the scope of the proposal. \r\nEven they have a detailed roadmap and explain what they will do and use their fund, but I think the proposer should provide some goals, key metrics - it will help communities measure it. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This on-chain game also brings in a virtual reality component which will only continue to be more popular in the future. Using this challenge's funding in this manner is a good way to ensure Cardano is on the cutting edge.", "q0r": 5, "q1": "Yes, the team's experience will lend to its success. Additionally, you can tell from the KPIs, project roadmap, and budget breakdown that the team has approached the planning process thoroughly.", "q1r": 5, "q2": "Yes, the detailed KPIs, roadmap, and budget breakdown are sufficient for auditing the project's progress and success.", "q2r": 5, "assessor": "z_assessor_788", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "VR NFT based game proposal is effectively addressing the gamers on-chained challenge.", "q0r": 5, "q1": "The team has experience building VR apps for events and has presented a complete plan to build out there metaverse platform to create gamified learning and community spaces for Cardano community members. ", "q1r": 5, "q2": "The information in the roadmap, defined success, team and budget sections are very useful audit items.", "q2r": 5, "assessor": "z_assessor_805", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "Onboarding VR communities to basic blockchain interaction within immersive gamified environments.", "experience": "Team has performed two events where participants were taught how to access and interact with the blockchain in a real world NFT environment."}