{"id": 381523, "author": "bmoore", "title": "ReWILD! : Bison Ranching in AR", "url": "https://cardano.ideascale.com/a/dtd/381523-48088", "category": 26241, "amount": 65000, "description": "Computer gaming can be a sedentary activity with potentially negative physiological and psychological consequences.", "funded": 1, "upvotes": 27322727, "downvotes": 22558097, "votes_result": 4764630, "votes_cast": 146, "f6_no_assessments": 6, "f6_rating": 3.7222222222222228, "videos": [], "media": [], "f6_assessments": [{"q0": "The game is very interesting, I believe it is the first proposal that I evaluate in this challenge that seeks a way to play outdoors, a kind of pokemon go (this game was a fever where I live) of buffaloes, whose objective is to capture these animals (which will be NFT) and raise them. The game's relationship with our blockchain is precisely that these buffaloes are in token format, and everything that involves them being a transaction coined in the Cardano blockchain, for example: their maturity, geographic location and their characteristics, such as temperature, weight, etc. It's a very original idea, in my view, and it can work very well, I think it's very attractive for those interested in this type of game, being a mixture of games where we can manage environments (for example, farm games, but in this case totally focused on buffaloes) and also hunting characters such as the pokemon go. I see potential in this initiative, and I believe that having all of your information minted in our blockchain would greatly benefit the Cardano ecosystem. I just wanted to get a better understanding of how this augmented reality question would work: players would download the app on their cell phones, but how would the game relate to the environment? And what would it be like for someone with augmented reality glasses? As it is a very out-of-the-box and somewhat complex idea, it would be positive if the authors included a short video in the proposal explaining precisely how the game works in practice, in a simple way, so that people who are not from the technology area can also fully understand how this project would take place. Other than that, I believe it is an idea with a lot of potential and that it dialogues directly with what the challenge asks for. Not to mention the fact that it could still be beneficial to the physiological and psychological health of the players, as the authors argue, proving these lines through the links attached at the end of the proposal, as it would take them out of their usual rooms or places. ", "q0r": 4, "q1": "The team appears to be very capable, as they: 1) explain the technical characteristics of the game in a very deep way 2) briefly mention their areas of knowledge during the course of the proposal, as well as their experience levels 3) attach their profiles from the linkedin at the end of the proposal, where we can get to know them better and see some of their past experiences. Regarding the script, unfortunately this part of the proposal is practically non-existent. The authors provide us with an extended explanation of what the game would be, what technologies it would involve, what the general idea is, but they don't clearly explain what steps would be needed to build it all. It was important for us to have a definition of phases to be followed to result in the final product. The authors say that the full development of the game could take years, which is worrying, we don't know exactly how the grantee's money would take care of the first stages. In other words, what % of this project would the $65k cover? It is necessary for us to have a solid vision of the whole, investing in something uncertain is a little distressing, I would very much like the authors to have thought about the total trajectory and exposed it here to see how far the money from this financing round could help to get things done. I really liked the idea of ​​the game and I don't like to point out these flaws, but it is necessary that we understand the whole thing before investing. About the money, more specifically, the total amount is divided into some parts, but each one of them could have been more detailed, in my perception. How would this 3d modeling be? How is this kind of thing built? And how would 10k be used for this? That said, I think the team's biggest flaw was actually the script issue, which if resolved, will go a long way towards making the proposal more amenable to funding.", "q1r": 3, "q2": "This team is different from the moment it suggests preparing monthly reports and providing them to the group that manages this game challenge. In this way, the auditability will be done in a clear and direct way, so I believe that there is not much to be commented on in this part of the proposal. Auditability is ready once the team commits to bringing this feedback to the community, so this topic of analysis is being fully addressed.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "This proposal aims to deliver a mobile game for Android/IOS devices. \r\nThe game is centered around real bisons which identity and main trait is recorded live into the blockchain. The users will be able to interact with the 3D model of the bison via a VR device and/or with their smartphone.  \r\nThe game aims to reduce the sedentary aspect of gaming, via introducing necessary movements of the user to enjoy the gaming experience. ", "q0r": 5, "q1": "The team is well experienced and the realization of the NFTs seems totally doable. However some key details are missing to evaluate the real success of the proposal implementation (see section below)", "q1r": 4, "q2": "The information given are complete in terms of budget breakdown, however a detail roadmap is missing, as well as key metrics to be measured along the project development.\r\nMoreover, the tokenomics of the token NCKL is not explained, as well as the utility of the token within the game: only a comparison to already existing games is made (e.g. Axie Infinity).", "q2r": 2, "assessor": "z_assessor_530", "no_vca": 16, "ne": 0, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This is a big and fantastic way to develop and spread the NFT games. AR is developing and with this idea, I think it will go widely in the future. Moreover, as the team explains inside the proposal, their product will show how powerful Cardano blockchain be and will inspire other developers. ", "q0r": 5, "q1": "Their required budget is reasonable for what they explain that need to do for the idea. But I think they should provide a more detailed roadmap and some key metrics to help us assess the feasibility. \r\nBut their team and goals, especially their demonstration about their AR product that they put in the proposal I think they know what they are doing. ", "q1r": 4, "q2": "The team has a clear vision for what they want to do and clarifies their work in detail, which is close enough for everyone in Catalyst community to audit their progress. Their explaination about how the game work and technology can help us easily understand how they solve the problem. One more time, they should give us some key metrics to help communities more clearly for what they will aim to. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The problem is within the challenge, and proposal's detail solution can help to solve that problem. \r\nAnd the idea of using AR to connect vitual life and real life can attract and drive a lot of user to the game/ and Cardano communities. .\r\nBut the proposal lack of some below that I think they should provide\r\n- Info to show that it will impact to the Cardano ecosystem \r\n- Key metrics of the project to help community assess that is its direction align with the challenge setting or not and how much it will impact ", "q0r": 3, "q1": "The team have skill and knowledge that need for the development of the project. They're also have clip of their AR product but in other character, it can help us clarify about their ability. \r\nBut lack of roadmap, goal, KPI and key metric in the proposal is making us hard to assess its feasibility and I think that's the basic thing that they should provide for the better assessment. \r\nMoreover, this project is a bit complex and harder than others in technology, marketing activities... so I think that they should provide some risk and how they can control it. ", "q1r": 2, "q2": "Lack of roadmap, milestone and key metrics will make it hard to audit, they should provide these detail. It's also help the communities assess the feasibility the project better. \r\nOne better thing they have is that it have very detail explanation about how the game will work to solve the problem in the proposal. ", "q2r": 2, "assessor": "z_assessor_670", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "One of the famous and attractive projects that mix virtual and physical activities that I know is Pokemon Go. They have had a big community for years and that still developing now. I think the idea of ReWILD, will have better results for not only the game but also the development of Cardano communities. \r\nI just only recommend that proposer should give us some key metrics that would help us to know and track how much this project impact Cardanor ecosystem. ", "q0r": 4, "q1": "I think this project will be successfully deployed by their professional and experienced team. They even have a prototype in the clip that they attach to the proposal, so we can believe that they can make these AR ideas come true. \r\nThey are also clear about which field their budget will use for, or some ways to get rid of their capital risk. \r\nBut I think they should have a detailed roadmap for helping the assessment be more realistic. ", "q1r": 4, "q2": "This proposal has a very detailed explanation about how they help to solve the problem, and the detail is, including in gameplay, in-game materials, and technology. This can help clarifier about their targets. \r\nBut better be more detailed about the roadmap and their key metric that they will focus on as I said before will help everyone to audit the project better. ", "q2r": 3, "assessor": "z_assessor_671", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is a cool spin on the classic NFT game as it makes large use of Augmented Reality to encourage users to play outdoors (similar to Pokemon Go). The team has experience developing mobile apps with AR technologies.", "q0r": 5, "q1": "The team includes sufficient documentation covering their relevant experience (LinkedIn for entire team) and the Light paper covers their plans to implement ReWild! in great detail. ", "q1r": 5, "q2": "The documentation provided is sufficient and the team's experience is verifiable but there is only a budget and roadmap with no KPIs or metrics included. The inclusion of the light paper is my reasoning for 4 stars. ", "q2r": 4, "assessor": "z_assessor_837", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "Encourage more active out-of-doors computer gameplay through on-chain tokenization of augmented reality game objects.", "experience": "Team members have commercial experience in augmented reality game development and marketing for several AAA minor league baseball teams."}