{"id": 382617, "author": "newmindflow", "title": "Trybbles Blockchain-Enabled AR Pets", "url": "https://cardano.ideascale.com/a/dtd/382617-48088", "category": 26241, "amount": 159100, "description": "Gaming will catapult Cardano to next levels of adoption, yet a large part of the gaming community is actively opposed to blockchain & NFTs.", "funded": 1, "upvotes": 37968960, "downvotes": 21490563, "votes_result": 16478397, "votes_cast": 202, "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "It's a new genre of NFT game that I believe will be popular in the future and will disrupt the current NFT game industry soon. Instead of boring gameplay, the team makes it in a new type that is trendy in the traditional team industry now. This project is huge and must be developed in a long way, but I think with 4-5 years as the team mention in the proposal, it will succeed and make a big impact on the development of the NFT game. Currently, in the period of this proposal aim on, It's also affects strongly the Cardano ecosystem throughout their activities. Look at their goals, KPIs, and definitions of success we can get it immediately. ", "q0r": 5, "q1": "This game was prepared for years since 2009 but gets shelved due to financial constraints then come back in April 2021. The team shows a lot of referrals link about their done works and future to-go plan. It's not just about vision, goals only but they're carefully explaining the technology strategy and their game world for helping everyone understand their big vision and support it. \r\nHence, their budget is detailed and reasonable for the development of the game in 8 weeks and expenses that will use for 5 months. \r\nProducing a game is huge and complex with a lot of risks, they know that and made their plan very carefully and clarified every potential info. ", "q1r": 5, "q2": "The info that the team provides is completely easy to audit this project. Their roadmap is explained clearly and the KPIs also.\r\nThey also take years to prepare this game, that's the reason why their content about the game is fulfilled enough to answer all of our questions and easily understand what they want to get. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is well written and has identified a suitable problem that has the potential to add value to the Cardano ecosystem via smart contracts and NFT's. There is enough detail in the proposal to suggest that scaling the project in the future is achievable. A great way to improve the interaction of the community and adopt new users. ", "q0r": 5, "q1": "I completely believe that given the experience and plan presented here that it is highly likely this proposal will be implemented successfully. The level of detail and thought throughout this proposal exemplifies the preparedness and background of the proposers. The roadmap as presented is clear with each stage building on the next. The milestones and deployment plan are clear and easy to follow. The budget seems reasonable and there is a good breakdown on the risks that they are assessing.", "q1r": 5, "q2": "The information provided is certainly sufficient to audit the progress and the success of a proposal. I really appreciate the timeline as laid out by the proposer. The clear milestones and deliverables at each point make it easy for voters to know what to expect, and how to tick off milestones once achieved. This can also provide valuable correspondence for the proposer to update the community on progress. ", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "A great proposal and inline with the challenge setting. Very detailed problem and solution as well detailed scope of proposal. A lot of resources and links are provided as well. I evaluated many assessments in Fund 6 and 7 and this is definitely one of the most detailed ones. The key challenge I have, is if this proposal fits the Catalyst incubation phase or maybe should be part of the acceleration phase. The amount request is very significant and over 60% of the challenge overall budget which I believe is not inline with the challenge objectives. I would recommend to either have lower budget/milestones or aim to raise money in different ways.  ", "q0r": 3, "q1": "Based on all the information provided and track record there is no dout the team is capable and have relevant experience. The amount of information provided makes it very time consuming to evaluate in details the proposal (especially in the flash review process) - overall, I would suggest to have a ppt deck presenting the key information and have available more resources as readers wish to expend. I have some good experience mentoring startups and presenting all your project in a more synthesis way will add value in my opinion. One key issue I have is the budget size in relevant to the challenge, and providing revenue projections or other & fund resources plan would have been important to see the longterm viability. Recruitment of good talent is also needed and it is a risk for the proposal.", "q1r": 4, "q2": "Success factor are mentioned, but somewhat difficult to audit the quality of the results in this section (although based on past track record quality will probably be very good). There is not measurable KPIs in terms of numbers of users for example and usage trends which will make the auditing complex.If you made the timeline going forward (what success will look like) as detailed as the the timeline of past activities it would have been very helpful and easier to audit. ", "q2r": 3, "assessor": "z_assessor_636", "no_vca": 22, "ne": 4, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "The idea from the proposal is to release 2 fictional world games - traditional adventure game and a blockchain -enabled NFT-based experience. The idea is clear and well addressed. ", "q0r": 4, "q1": "The team has 30 years of combined experience in film, TV, apps and games production; creators of 2 successful CNFT projects-Trybbles and Icons. Therefore they are capable of implementing successfully. The plan is outlined in detail in the proposal mentioning that they will create a story-based game for PC/console to introduce and establish the world; also create a virtual pet AR experience that will be the main blockchain event and the primary way of interacting with the NFTs. The proposal can be successfully implemented.", "q1r": 4, "q2": "The budget breakdown is good with the road not too clearly stated with actual dates but stated in weeks and months. KPIs are also not too clear. ", "q2r": 3, "assessor": "z_assessor_688", "no_vca": 23, "ne": 1, "ng": 13, "nfo": 9, "vca_o": 1}], "solution": "A fictional world w/ 2 initial releases: a traditional adventure game & a blockchain-enabled NFT-based experience, bridging the communities.", "experience": "New Mindflow: 30 years of combined experience in film, TV, apps & games production. Creators of 2 successful CNFT projects: Trybbles & Icons"}