{"id": 383935, "author": "jt.aussiegingersnap", "title": "Game Token Design [Revelar + Duo]", "url": "https://cardano.ideascale.com/a/dtd/383935-48088", "category": 26241, "amount": 12000, "description": "Stable & successful NFT gaming rewards and token models are largely unknown and often only reward a few players.", "funded": 1, "upvotes": 59858139, "downvotes": 9503279, "votes_result": 50354860, "votes_cast": 271, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "This team presents an idea about developing a set of foundational math models that are freely available and that can be used to design tokens for new games using CNFTs, that can help to solve their problem within the challenge. \r\nThe team provides 3 specific deliverable successes that will be used for game creators to develop their own game systems. All of them align with the challenge givens and I think that if this project success in that way, they will help to develop the gaming in Cardano ecosystem better. \r\nMy advice for the team is that they should show some impacts that this project will make on Cardano community development. This will more convince to CA and also help them better align with this challenge settings. ", "q0r": 4, "q1": "The team has shown the detailed implementation plan for their idea, including the amount of time for each part of development, roadmap in weeks with milestones to develop the idea, and detail about how it works. These all can help we where their outlined budget addresses to and all reasonable. \r\nThey also provide info on 2 key people in their team. \r\nBut I wish that the team can provide some relevant risks that they can meet. This will help them make some plans for preventing the disruption on the implementation. ", "q1r": 4, "q2": "This proposal is completely enough basic elements for auditing, including a detailed roadmap with an achievable timeline, clear measurable goals. \r\nLastly, their content about the problem and their solution is close enough to explain what they want to do. I hope that this idea will be successfully launched to help gaming industry moves faster. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about doing research and delivering a use case model about game token. Problems related to the development of game token rewards are clearly stated. This proposal has the potential to facilitate the integration of blockchain into new games by providing game developers with a better understanding of game token essential design criteria and a simulation tool. I strongly agree that this proposal addresses the challenge.", "q0r": 5, "q1": "The two team members are identified by their LinkedIN profile. They gather the relevant skills in research and computer science to give confidence in their ability to achieve proposal goals.\r\nThe detailed plan shows that the major directions of research are identified and understood. The roadmap/timeline shows that the team has a solid and constructive step by step approach. Considering that the job to be done and the proposal are crystal clear, and that the team shows evidence of the experience needed to complete the job, I strongly agree that this proposal is likely to be successful.\r\n", "q1r": 5, "q2": "Project deliverables are open-source publication about game token models and a simulation mechanism that will be made available on a public Github repository. A detailed timeline is given, from literature review to the final document publication. The budget breakdown is made from the forecast hours to be spend at each step of the project and a determined -reasonable- hourly rate.\r\nFor all these reasons, I consider that the community will be able to monitor accurately the progress of the project.\r\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 17, "ne": 4, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is intended to produce a set of mathematical models to be used by the gaming community to design in-game tokens using CNFT.\nThe team provides 3 specific results that will be used by game creators to develop their own systems.\nIt's all in line with the given challenge and will help ( if successful ) the Cardano ecosystem.", "q0r": 5, "q1": "The proposer provides the linkedin, twitter and discord of the team and the skills they have .\nIt's all very clear and the funding request is explained properly but they don't expose some risks they might encounter. ", "q1r": 4, "q2": "This proposal has enough elements for auditing. It includes a roadmap and measurable goals.\nThey are clear on what they need to do and lay it out thoroughly.", "q2r": 5, "assessor": "z_assessor_361", "no_vca": 24, "ne": 1, "ng": 20, "nfo": 3, "vca_o": 1}, {"q0": "A great proposal well aligned with the challenge objectives both in terms of what is success (Cardano becomes the go to blockchain to develop gaming applications due to its quality tooling and wide gamer centric user base.) as well as some key challenge KPIs. However, the proposal could include some more info the direct impact on the KPIs. In addition including marketing and interaction/pilot with other projects to validate the solution and the need for it could be important.  ", "q0r": 4, "q1": "Proposers have a great and relevant experience and they shared enough information to validate it. Both proposers seems to have great technical skills which are needed to perform this proposal. Duo and Revelar, are both very relevant for the proposal and show the experience the proposers has in the area. The roadmap and timeline are detailed and seems reasonable. Budget as well is reasonable with Duo and Revelar to take some of the additional costs. It would have been helpful to have an estimation of the full cost and what budget amount will be financed by Duo and Revelar. Risk and challenges are also mentioned. It could have also good to add some of the Literature that is going to be reviewed. Deliverables are clear. Could have been good to add KPIs relevant for the challenge for example how many games it is going to support and some marketing efforts how the solution will be available for game designers.", "q1r": 5, "q2": "The prosper well defined the deliverables and mentioned specific auditable items. The information will be open source and available for the community. Funding timeline: did you already start the research? otherwise the timeline might not be aligned. For example you might not finalise the math modeling by end of Q1(6-12 Weeks : Development of the math modelling framework (End of Q1- 2022)) - could have been to be more clear on that. ", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 24, "ne": 6, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": " \nThe problem needing to be solved has been identified and articulated namely Stable & successful NFT gaming rewards and token models are largely unknown and often only reward a few players.\n  \nThis proposal falls within the scope of the challenge brief beause it would do the development of a set of foundational math models that are freely available and that can be used to design tokens for new games using CNFTs\n\nThis proposal shows clearly how it will add value to the Cardano System by enabling gamers to create , exchange NFTs and govern the community of the specific game with ability to withdraw over time for real rewards.\n\nKey metrics and goals of the proposal havent been stated clearly but implied metrics would be\n  1. Number of unique projects who use the system and tokens\n\n2. Number of assets created through our generator as NFTs\n\n3. Mint day value (ADA) of CNFT's that contain assets created by our generator.\n\n4 How many users are using these assets\n\n5. How many exchanges happen daily\n\n6 No Of users for each game in the community\n\n7 what is the real value of the rewards.\n \nKey metrics and goals of the proposal fall within the scope of the challenge. \n\nThe proposal can be scaled to address future challenges  by bringing ne functionality.\n\nThis project will have a positive impact on Cardano system\n\n", "q0r": 5, "q1": "\nThe proposer has not provided evidence of relevant skills and experience needed to complete the project. No Linkedinprofiles or FB profiles are given. The company website is given. \nThese links are sufficient \n\n  \nI have visited these links and contacted the relevant people\n \nI have been able to assess their level of competence as good. \n \n He has indicated the main person and a team of developers in the company Revelar. Also other core team members. \n \n \nHe has rationally and logically laid out his team structure and breakdown.\n \n \nBudget has been outlined clearly and broken down into identifiable items\n \n Budget is reasonable to achieve the set goals\n \n \nThe proposer has not provided a verifiable plan if additional funding is required to implement the proposal\n  \n Proposal offers a realistic timetable to complete the work\n \n\nProposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how\n \n  \nThe proposal clearly explains  technical aspects like architecture, language and technologies if they are crucial for implementation. As one example he goes into detail about an option to include a metadata element in the JSON exported prior to minting. We will also provide our own data to anonymously share metrics on projects who opt out of using this metadata stamp. \n\nThe proposer hasnt considered challenges and risks relevant to a successful implementation", "q1r": 4, "q2": "\nThere is a clearly laid out a roadmap with milestones and a time horizon for achievement.\n \nThere are clearly defined Metrics/KPIs that define the success of the proposal such as\n  \n120 Hours: Literature and state-of-the-art review. (Completion -> Deliverable 1)\n\n160 Hours : Development of the math modelling framework\n\n80 Hours : Creation of a long-run simulation mechanism\n\n40 Hours : Testing of the model and simulation framework using a use-case (Completion -> Deliverable 2)\n\n80 Hours : Compiling the complete model and results into a document for open-source publication (Completion -> Deliverable 3)\n\n\n \n \nThere is a clear understandable description of the targeted problem\n \nThere is a clear understandable solution that addresses the problem\n \nThe proposer hasnt identified possible hurdles, challenges and difficulties\n\n \n \nThe proposer has no plan to deal with these difficulties\n \nThere are no contingency plans in place for various outcomes\n\n", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 21, "ne": 6, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "Development of a set of foundational math models that are freely available and that can be used to design tokens for new games using CNFTs", "experience": "Benjamin Beer - Lead researcher with a focus on mathematical modeling, game theory and the blockchain."}