{"id": 384285, "author": "ralphcnft", "title": "A Moon Based Metaverse on Cardano", "url": "https://cardano.ideascale.com/a/dtd/384285-48088", "category": 26241, "amount": 35000, "description": "Space tourism is a luxury reserved for the richest 0.1% of society and there isn't a way for everyone else to experience it right now", "funded": 1, "upvotes": 41080288, "downvotes": 11139891, "votes_result": 29940397, "votes_cast": 250, "f6_no_assessments": 3, "f6_rating": 4.222222222222221, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal problem statement and solution are aligned with the challenge which is to create a moon based metaverse. This proposal also clearly state on how will it provide value on Cardano. The proposer also clearly stated on how many users that they are aiming to bring onboard. However, the proposer did not mention on the ability of this project to scale for future market demands. Can the game handle growing interest of millions of people and also the demand of the market to expand the world beyond moon? Will there be any server overload and lag problems just like star citizen?", "q0r": 4, "q1": "The proposer provided verifiable links to the relevant skills and experience needed to implement the proposal. The proposer also knows the required manpower to successfully complete the project. Moreover, the budget breakdown were outlined clearly into identifiable terms. The budget required is also reasonable to achieve the goals. Furthermore, this proposal also offers realistic timeframe to complete the work. However the proposer did not mention the technical expects of the game. What engine will the metaverse be built on? What technology will be used on creating the metaverse? Please elaborate. In addition, there were no mention of risks and challenges that they might face in completing the project.", "q1r": 4, "q2": "This proposal provided a clear roadmap with milestones and time horizon for achievement. Moreover, the proposer stated their social media account for the voters to keep track of the progress and also engage with the team. Furthermore the key metrics and KPI given clearly defines their definition of success.", "q2r": 5, "assessor": "z_assessor_357", "no_vca": 21, "ne": 3, "ng": 8, "nfo": 10, "vca_o": 1}, {"q0": "This is an inspired idea for people who love space by virtually experiencing space travel and everyday lunar life. The team didn't provide some important parts to show us how it impact the Cardano ecosystem. But their success indicators showed how this game will impact the development of gaming communities by numbers, and all of them - with KPIs - is stick with the challenge settings.\r\nHope that they can make it come true ", "q0r": 5, "q1": "The team provides a detailed roadmap and the budget breakdown is reasonable with it. But they should have more info about the implementation plan because making this type of game is complex. \r\nI hope that they can provide more info about every basic thing in their game if available, including lands, characters, activities, environment... and mechanic, economic... that all make me curious when reading this idea but can't find. They also add their website link of the game, but every info is so basic. \r\nMoreover, with the experiences of this team as I read their attached profiles. I think they can list out some risks that will face off when implementing this game. ", "q1r": 3, "q2": "This proposal has enough things to audit their game, and all of these things is a detail that can help the auditing process easier: a detailed roadmap, clear key metrics, promising KPIs. \r\nBut the team should provide some more detail about their solution, it needs to be more clear and can show that it can address the problem that their game is solving. The info in the proposal is just a brief of so much thing in the game that can help it. ", "q2r": 4, "assessor": "z_assessor_651", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This project has the potential to be a very entertaining experience for Cardano users and to adopt new people coming into the ecosystem. It would be a better experience when it is stated \"space travel\" would include more than just a moon metaverse but rather the universe experience! ", "q0r": 4, "q1": "The key metrics and goals of the proposal align with the outlined challenge settings, and the budget seems reasonable to rocket this project forward in terms of production. It would be great if the project adds about marketing (ie; collaboration, partnerships and scalable solutions) and the type of games created in the virtual world within the Q3 2022 timeframe. This way, it will be easier to have users visualize more on the evolution of investing in the metaverse.", "q1r": 4, "q2": "The proposer provides a very detailed plan for the implementation with milestones and a defined time horizon; the proposer also adds some information about whom to hire and their respective timeframe for developing the projects. The proposer hasn't considered challenges and risks relevant to a successful implementation. I think that the budget is not estimated correctly but it's difficult to precisely at this time a correct spending budget, because there are several parameters on the \"game\" (eg. hours of code development, complexity of the business rules for the algorithms, …).", "q2r": 5, "assessor": "z_assessor_669", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Building a moon based metaverse will allow users to virtually experience space travel and everyday lunar life", "experience": "Founder - Operations and Product experience in crypto exchanges\nAdvisor - Plutus Pioneer Program Cohort 2 Graduate"}