{"id": 381841, "author": "lennext", "title": "Universal Tourism Payment System", "url": "https://cardano.ideascale.com/a/dtd/381841-48088", "category": 26249, "amount": 78000, "description": "Las naciones pequeñas que dependen del turismo se ven perjudicadas por los pagos en el extranjero. Los intentos de utilizar el IVA para hacer un seguimiento del gasto requieren elevados costes administrativos.", "funded": 2, "upvotes": 112411536, "downvotes": 3507156, "votes_result": 108904380, "votes_cast": 344, "f6_no_assessments": 4, "f6_rating": 4.5, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=28203"], "media": [], "f6_assessments": [{"q0": "La propuesta está bien planteada y aborda claramente el planteamiento del problema. La propuesta entra en el sector del turismo, del que muchas de las pequeñas naciones dependen completamente para su supervivencia, y también donde se encuentran la mayoría de las lagunas que los gobiernos encuentran difíciles de abordar. El impacto que podría tener la propuesta es enorme. Sin embargo, la parte que me cuesta entender es el éxito de la propuesta, siempre que no sea la primera de este tipo, y la eficacia con la que podría llenar el vacío que las anteriores han dejado en el sistema. Por ello, califico el impacto del proyecto con una puntuación de 4.", "q0r": 4, "q1": "La experiencia que los miembros del equipo aportan a la comunidad es enorme. Los miembros del equipo han estado trabajando junto a los sectores que desempeñan un enorme papel en el proyecto propuesto, a saber, las pequeñas empresas, el turismo, el blockchain y muchos más. El equipo presentará a los nuevos miembros de Catalyst a través de reuniones con organizaciones turísticas y organismos gubernamentales. Aparentemente, el éxito de la implementación de la propuesta depende completamente de la aceptación de estos fragmentos del sistema. Un plan de juego detallado sobre cómo el equipo planea superar este obstáculo ayudaría a la comunidad a conseguir el éxito de la propuesta.", "q1r": 4, "q2": "El equipo parece conocer bien el problema en cuestión y ha expuesto los posibles indicadores de rendimiento que la comunidad puede utilizar para seguir su progreso. El equipo también parece abordar las posibles dificultades y riesgos que conlleva. Creo que el equipo es muy capaz de superar estos inconvenientes. El equipo tiene previsto presentar una prueba de concepto utilizando el gobierno de Palau como métrica mayoritaria a efectos de auditoría. No obstante, sería muy de agradecer que aportaran otras métricas, como el coste de la calidad y el índice de satisfacción del cliente, para ayudar a comprender el impacto que el proyecto está aportando al sector propuesto y la acogida que está teniendo entre los clientes.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of tax avoidance by offshore tourism payments by a prepaid ADA-based payment dApp with automatic tax collection which aligns with the challenge goal of foundational Revenue Service.\r\nThe proposal is an excellent example of articulating the value to Cardano ecosystem and articulating how the solution scales to address future challenges.\r\nThe proposal does a good job of providing key metrics and goals that align with the challenge.", "q0r": 5, "q1": "The proposal is an excellent example of evidence of experience, team composition, challenges and risks.\r\nThe proposal articulates the feasibility aspects of budget is broken down and reasonable, realistic timetable and plan, resources required, detailed technical explanation of the solution\r\nThe proposal's feasibility could be improved by an additional funding plan.", "q1r": 5, "q2": "The proposal is an excellent example of a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem.\r\nThe proposal includes a roadmap, milestones, time horizon, metrics/KPIs to measure proposal success.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 25, "ne": 2, "ng": 19, "nfo": 4, "vca_o": 1}, {"q0": "This is a proposal of decentralized tax administration in the tourism sector and the use of cryptocurrencies to pay tourism sector expenses. Regarding the intention of the proposal, write in detail, have a clear plan as well as state the actual adverse cases and solutions to deal with when implementing in practice. Experienced team.", "q0r": 4, "q1": "This is the time to push further blockchain applications into practice, especially a good platform like cardano. Although the proposal does not indicate the most detailed strategies, especially legal ones, when working with each locality, the project is quite serious in terms of the proposed ideas. Have a clear plan as well as team information. This is also a highly practical idea, hopefully in the near future more state agencies will be more serious about deploying this application.", "q1r": 4, "q2": "Re-verification of applications in practice is easy on the online platform, but to verify the information provided by the projects requires the participation of many reputable government departments, and government agencies. papers are authorized to be deployed in the localities. Moreover, changing tax habits of companies and tourism services is quite difficult without accompanying synchronous technology devices.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This proposal meets and exceeds the Brief stated goal of using blockchain in a foundational governmental activity to promote sustainable prosperity. Accurately assessing and collecting tax is just the right sort of action.", "q0r": 5, "q1": "This team is competent and well prepared. This is a very complex project,and the team has an appropriate portfolio of skills.\r\nThe plan is set out stepwise in a logically prudent manner.", "q1r": 5, "q2": "the stepwise presentation is auditable, time-fenced, specific and measurable. The project's information is sufficient to audit the progress and success for the community. ", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "Dapp de pago basada en ADA - Traer-Mantener-Seguir el gasto de los turistas en el país. Concede visados de visita sin necesidad de utilizar el sistema de pago del IVA sin efectivo del Gobierno.", "experience": "Equipo visionario de alto nivel - 20 años como ejecutivo de Fortune 500 en el sector de los pagos, 15 años como ejecutivo en la industria hotelera, toda una vida en las islas, el sudeste asiático, el este de Asia"}