{"id": 382500, "author": "pia.c.andrews", "title": "Regulation/legislation as code repo", "url": "https://cardano.ideascale.com/a/dtd/382500-48088", "category": 26249, "amount": 90000, "description": "El acceso abierto a las normas no es actualmente universal. Creemos que esto impide la construcción democrática de la nación, la transparencia gubernamental y el acceso a la justicia.", "funded": 1, "upvotes": 55815538, "downvotes": 25435893, "votes_result": 30379645, "votes_cast": 164, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "El enunciado de la solución es sensato a la luz del enunciado del problema y ambos están claramente redactados. El reto busca acelerar el desarrollo de dApps que \"cubran soluciones fundacionales de Registro\", con énfasis en el almacenamiento/recuperación de registros vitales en la blockchain. La aplicación de código abierto propuesta no es una aplicación descentralizada en sí misma, pero está diseñada para extraer datos legales y reglamentarios de una blockchain (es decir, \"legislación como código\") y determinar el cumplimiento de la normativa o la elegibilidad del usuario. Como economista especializado en desarrollo, estoy de acuerdo en que existe una necesidad muy real a nivel mundial de este tipo de sistemas, ya que agilizarían el acceso a servicios críticos y atenuarían el impacto de la corrupción (especialmente en los países en desarrollo). Estos sistemas también pueden utilizarse para aprovechar el valor de los registros de la propiedad, ya que las normas de zonificación y construcción podrían aplicarse a parcelas específicas almacenadas en una cadena de bloques. Mi principal preocupación es el tamaño del presupuesto de la propuesta en relación con la asignación total de fondos para este desafío (90.000 dólares de los 600.000 disponibles). Dicho esto, dividir el proyecto en dos fases distintas (desarrollo del MVP y pruebas posteriores) puede no ser factible. En general, estoy totalmente de acuerdo en que esta propuesta aborda eficazmente el reto.", "q0r": 5, "q1": "El equipo es bastante numeroso y sus miembros poseen una amplia experiencia en los ámbitos del derecho, la normativa, los estándares de gobierno abierto y el desarrollo de software. El plan proporcionado por el equipo es muy detallado y claro, y dada mi experiencia trabajando con varias startups, el presupuesto (aunque grande) parece razonable dado el tiempo y otros recursos necesarios para completar con éxito este proyecto. Habría estado bien que el equipo hubiera proporcionado una estimación del total de horas necesarias para completar las dos fases del proyecto (junto con la tarifa por hora implícita), pero dado el alcance del trabajo involucrado, eso sería comprensiblemente difícil de estimar con precisión. En general, es muy probable que este equipo desarrolle con éxito los resultados del proyecto propuesto.", "q1r": 5, "q2": "Los resultados propuestos son muy claros, al igual que los indicadores clave de rendimiento proporcionados por el equipo. El equipo no aborda el riesgo potencial de desventaja, pero dada la construcción previa de la base de datos jurídicos de Nueva Zelanda y la experiencia del equipo trabajando con dichos datos y el proyecto BetterRules, es poco probable que no se entregue un producto que funcione. Dicho esto, existe una mayor incertidumbre en cuanto a la consecución de los indicadores clave de rendimiento, para los que no se abordan los riesgos de desventaja. En general, estoy de acuerdo en que esta propuesta proporciona suficiente información para evaluar su progreso.", "q2r": 4, "assessor": "z_assessor_914", "no_vca": 21, "ne": 14, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of lack of open access to government regulations and legislation by coding government rules into an open platform which partially aligns with the challenge goals but is not a foundational registry solution listed in the challenge.   \r\nThe proposal does a good job of articulating the value to Cardano ecosystem, and articulating how the solution scales to address future challenges.\r\nThe proposal could be improved by providing key metrics and goals that closely align with the challenge, and either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.\r\n", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of team composition, budget is broken down and reasonable (more detail would improve), realistic timetable and plan, and detailed technical explanation of the solution.\r\n\r\nThe proposal's feasibility could be improved by evidence of experience (twitter accounts and proposal blurbs are insufficient), and a challenges and risks section.\r\n", "q1r": 4, "q2": "The proposal includes a roadmap, milestones, time horizon (very rough), a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem.\r\nTo improve the proposal include metrics/KPIs to measure proposal success.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is precisely the kind of thing we need, not just on Cardano but in this whole space. The more public goods, the better. Making regulation and legislation clear to those that wish to integrate their Dapps into the world and making the rules clear and open for all is a must-have to take advantage of our existing legal systems. ", "q0r": 5, "q1": "The team has in-depth experience and understanding of the problem and current systems we have in place; with that in mind, I have high confidence that we will see this implemented successfully.", "q1r": 5, "q2": "There is a clear description of the problem and solution here with identifiable measures of success based on the milestones. Key performance indicator's and what needs to be done is laid out clearly and on understandable grounds.", "q2r": 5, "assessor": "z_assessor_903", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}], "solution": "Una plataforma de código abierto gestionada por la comunidad para las piernas/regulación como código para que cualquiera pueda contribuir y construir sobre él + una herramienta de elegibilidad legal para ayudar a las personas.", "experience": "Un equipo de 8 personas con más de 5 años de experiencia en reglas como el código, el diseño, el desarrollo, las plataformas gubernamentales, las leyes y las prácticas interculturales."}