{"id": 383626, "author": "didnkallaehawe", "title": "Lost |&| Found", "url": "https://cardano.ideascale.com/a/dtd/383626-48088", "category": 26249, "amount": 24000, "description": "No existe ningún sistema que facilite la recuperación de objetos perdidos/encontrados, concretamente documentos importantes como el DNI, etc.", "funded": 2, "upvotes": 71246301, "downvotes": 8022405, "votes_result": 63223896, "votes_cast": 183, "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal seeks to solve the problem of owners recovering lost items by a decentralized lost and found dApp which partially aligns with the challenge goal but is not a foundational registry solution listed in the challenge. The proposal tries to make the case that the solution is a Nation building dApp but the logic is stretched.   \r\nThe proposal does a good job of articulating the value to Cardano ecosystem, articulating how the solution scales to address future challenges and providing key metrics and goals that more closely align with the challenge \r\nThe proposal could be improved by either selecting another challenge (dApps & Integrations) or more closely aligning with this challenge's goals.\r\n", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of evidence of experience (previous WADA projects but should have external links), team composition, budget is broken down and reasonable, realistic timetable and plan, resources required, detailed technical explanation of the solution, \r\n\r\nThe proposal's feasibility could be improved by adding a challenges and risks section (the outlook and future challenges section does not actually describe and challenges or risks).", "q1r": 4, "q2": "The proposal includes a roadmap, milestones, time horizon, a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem.\r\nThe proposal is a very good example of defining metrics/KPIs to measure proposal success.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This proposal will help connect people that have lost items to people that find those items. The proposal fits well into the challenge. The  goals and metrics of this proposal are aligned with the challenge. The proposer has done a good job by including all the information necessary for a good understanding of the product they are trying to build. ", "q0r": 5, "q1": "The proposer has provided enough information, for me to have confidence in the successful implementation of the project. Wada is a trusted and well known organization in the community. I think that the fact that they are in the proposal is a good sign and can serve as evidence skills and experiences. The budget has also been broken down into identifiable items , and the prices seems reasonable based on my intuition. Altogether, the proposer has included all the details necessary for a successful implementation.", "q1r": 5, "q2": "The proposer has included the details necessary to track its progress. These information include a roadmap with milestones, and, metrics and KPIs. The proposer has also provided an understandable description of the problem being solved. The description of the solution is good as well.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 18, "ne": 1, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "Relation to personal qualifications: Due to both my past political engagement and having lived in different countries with different approaches to administration on a governmental level, I have experienced, discussed and thought about this topic a lot. In addition to this, I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal identifies and adresses a really good usecase that utilizes DID and gives it a tangible, real-world application. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 21, "ne": 4, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The proposal aims to create a platform hat facilitates the recovery of lost/found items, such as ID cards etc. They will expad the solution to include missing/kidnapped dear ones as well as stolen cars etc. This solution will be great for law enforcement and local communities. I see this having a positive effect on the Catalyst Ecosystem. It could potentially solve a lot of problems. Especially when it comes to ownership of goods that were stolen.", "q0r": 4, "q1": "The Team and their experience is set out. They seem to have the right experience, but no links are provided as proof. There is a implementation plan and road map that describes in detail how they see this roll out. The budget is set out very basic. Some Risk is discussed in the road map, but there is no section specifically for this.", "q1r": 3, "q2": "The Key metrics and auditability are discussed, but no way is given how the community or voters can track this project. It is a good idea but I think the proposal still needs a little bit of work.", "q2r": 3, "assessor": "z_assessor_795", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Construir un sistema descentralizado que conecte los objetos perdidos con sus propietarios, integrando DID y un monedero digital como partes del subsistema de apoyo.", "experience": "Centro de Wada Camerún: 3 Ingenieros y Arquitectos de Software Senior con experiencia/relación previa con el Gobierno construyendo software en CMR"}