{"id": 384301, "author": "njsteele", "title": "Corruption discovery + remediation", "url": "https://cardano.ideascale.com/a/dtd/384301-48088", "category": 26249, "amount": 62046, "description": "La corrupción es la fuerza más destructiva del gobierno. Puede romper gobiernos nuevos y en desarrollo a pesar de todos los demás esfuerzos.", "funded": 1, "upvotes": 59968851, "downvotes": 4928753, "votes_result": 55040098, "votes_cast": 152, "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"q0": "La propuesta presentada está dirigida a erradicar uno de los mayores problemas que obstaculizan la prosperidad de cualquier país: la corrupción. La solución propuesta de desarrollar una plataforma descentralizada para la denuncia anónima de la corrupción es única. Además, el equipo propone involucrar a muchas entidades locales y voluntarios a través de campañas y eventos, lo que sin duda hará que Cardano sea popular entre la multitud y también aumentará la resistencia del ecosistema. Sin embargo, el manifiesto no menciona los grupos demográficos a los que planea dirigirse ni cómo el equipo propone mitigar la corrupción en el marcado exitoso por parte de los usuarios. Dado que el plan incluye el hecho de hacer la aplicación independiente de las autoridades gubernamentales, la credibilidad de la aplicación aumenta entre la gente. Por lo tanto, puntuaría el impacto con un 4 de 5, ya que faltan algunos detalles más finos sobre la eficacia de la aplicación y cómo el equipo planea aprovechar la cadena Cardano.", "q0r": 4, "q1": "El equipo ya ha realizado una buena cantidad de trabajo en la dirección de la solución propuesta y también proporciona a la comunidad su desglose presupuestario detallado y también su definición de éxito. Sin embargo, la propuesta carece de información en otras secciones. La propuesta no proporciona el perfil del equipo que trabajaría en esto y la experiencia que aportarían. A pesar de mencionar que se desarrollará la aplicación, la propuesta no incluye detalles técnicos sobre la misma. Aunque los hitos parecen ser de naturaleza práctica, el proponente no ha mencionado los retos que se encuentran en su camino y cómo planean mitigarlos.\r\nAparte de la definición de éxito trimestral, no hay ningún otro plan de juego detallado paso a paso disponible para los lectores. Con todos estos hechos, creo que se requiere una cantidad moderada de detalles para ganar la confianza de la comunidad para financiar su empresa.", "q1r": 3, "q2": "Creo que no hay suficiente información disponible para que los auditores hagan derivaciones concluyentes sobre el éxito de la propuesta. El proponente planea inicialmente desarrollar la aplicación sin aprovechar la cadena Cardano y tiene planes de pasar al ecosistema sólo después de 6 meses. La falta de detalles sobre el público objetivo y las métricas hacen que la propuesta sea aún más incompleta. Aunque el proponente tiene una amplia experiencia en la idea que propone, la falta de detalles del equipo hace que la propuesta sea menos creíble. No se dispone de ningún KPI distinto para que los auditores puedan hacer un seguimiento de cuántos usuarios se registran en la Dapp y de los volúmenes de transacciones, así como de la eficacia con la que se recibe y utiliza la aplicación, que es uno de los criterios principales de la campaña. Aunque es bastante comprensible que la idea esté todavía en sus etapas preliminares, un poco más de especificaciones sobre la aplicación propuesta y las cifras para rastrear su uso y éxito ayudarán a la auditoría fácilmente y también ayudarán a la comunidad a rastrear su efectividad.", "q2r": 3, "assessor": "z_assessor_751", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of discovering corruption in organizations and governments by an application facilitating anonymous crowd-source organized campaigns which partially aligns with the challenge goal but is not a foundational registry solution listed in the challenge.\r\nThe proposal does a good job of articulating the value to Cardano and articulating how the solution scales to address future challenges.\r\nThe proposal could be improved by providing key metrics and goals that more closely align with the challenge and either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of experience (linkedin profile in the comments section), team composition, budget is broken down and reasonable, additional funding plan, realistic timetable and plan, resources required, \r\nThe proposal's feasibility could be improved by a more detailed technical explanation of the solution and including a challenges and risks section. The $9K budget to have grant writers submit a grant request seems like it might be a potentially questionable use of Cardano funds for some community voters.", "q1r": 4, "q2": "The proposal includes a roadmap, milestones, time horizon,, clear understandable description of the targeted problem, and a clear understandable solution that addresses the problem.\r\nTo improve the proposal include metrics/KPIs to measure proposal success.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "The proposal does not effectively address the challenge, while coordinating anti-corruption activities are laudable and important, they are not the stated goal and intent of the Brief: \"Dapp proposals should cover foundational Registry solutions, namely:\r\n\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"", "q0r": 2, "q1": "The proposer is competent and has a good handle on the material. The proposer is affiliated with a top US university. Go Owls!", "q1r": 4, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, auditable, and time fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 16, "ne": 0, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "Great idea and detailed proposal. I did love to see that the proposal commences from a specific region. I think this is great and addresses the challenge. This would generate more community engagement and the name and shame component would tackle corruption.", "q0r": 5, "q1": "Excellent to experience. I like the commitment of the team lead. This Dapp is practical and the NGOs set up to secure funding would help the longevity of the idea. ", "q1r": 5, "q2": "Detailed but breakdown. The proposal has shown commitment to transparency and openness. The Dapp and its campaigns are people-driven. This is great.", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "735 / 5000\r\nResultados de traducción\r\nThis proposal impacts the center of the challenge, working on the most complex problem that exists in the construction of nations. The thing that destroys them: Corruption. One of the clearest reasons to explain the problem of poverty. In this way it raises a problem that clearly must be solved. It is also clearly observed how this proposal would add value to the Cardano ecosystem, since it is an instrument in all aspects of the proposal. Work, smart contracts, identity secrecy, protection among other relevant aspects. I have the feeling that you could have given us more information. Perhaps more work needs to be done on the challenge metrics to ensure its total adequacy. ", "q0r": 4, "q1": "The proposal is interesting and important, however the most difficult thing is its implementation. I am Latin American and I know first-hand the problems of corruption. In this regard, I consider that the proponent did not provide sufficient evidence of his abilities to implement the proposal, apart from being a very relevant academic project at a prestigious university. Iguylamente is not clear the team that will develop the proposal, because there are some external payments that are not clear in its development. Although there are identifiable elements in the budget, this aspect could be improved. The budget is reasonable to complete the work, however it would be good to have the best-developed profiles that allow them to be supported. The timetable is a bit optimistic, however it is achievable if properly incorporated into the university's programs. By the way, it is not clear what role university students will play. I think the proponent could have shown more about the project and maybe reserved. The technical processes must be explained more thoroughly, especially because of their cost.", "q1r": 3, "q2": "This is a roadmap for achievement, but for a technical process it is necessary to strengthen it. The metrics could have been strengthened to more clearly define the success of the proposal. On the other hand, if there is a clear and understandable description of the objective problem and it is adequately addressed, perhaps we expect more information given the academic origin of the proposal.", "q2r": 3, "assessor": "z_assessor_778", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Permitir el señalamiento, la elección, la organización y la dirección anónimas de campañas para erradicar la corrupción mediante tareas organizadas por la multitud.", "experience": "Director de tecnología en el Ctr. de Temple U para la investigación de la salud pública y el derecho, que trabaja con la ONU y otras universidades en materia de política y corrupción."}