{"id": 384773, "author": "dcspark", "title": "Nation-ready scalability research", "url": "https://cardano.ideascale.com/a/dtd/384773-48088", "category": 26249, "amount": 75000, "description": "Para que los países adopten la cadena de bloques, es necesario lograr la escalabilidad a escala nacional", "funded": 2, "upvotes": 179605121, "downvotes": 15430995, "votes_result": 164174126, "votes_cast": 360, "f6_no_assessments": 6, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Estoy a favor de las soluciones oportunas a los grandes problemas. Catalyst ha tenido un montón de proyectos y soluciones pequeñas y fragmentarias, pero también necesitamos algunas soluciones de peso a largo plazo para los grandes problemas que se vislumbran en el horizonte. La cuestión de la escalabilidad es uno de los principales retos de la cadena de bloques y el equipo de dcSpark ha difundido el mensaje de forma coherente y clara sobre los retos que están a la vuelta de la esquina para la cadena de bloques Cardano en cuanto al número de transcripciones que puede procesar la cadena de bloques. Nos estamos acercando a los límites actuales (por supuesto, los ajustes de parámetros pueden mejorar esto temporalmente) - sin embargo, la adopción a nivel nacional significa que no hay posibilidad de poner naciones enteras en \"espera\" hasta que encontremos soluciones que aborden un número mucho mayor de transacciones. Veo esta propuesta totalmente alineada con el reto Nation-building Dapps ya que las soluciones Dapp no pueden funcionar sin una red que pueda soportarlas. Una red que pueda escalar a un número mucho mayor de trnasacciones permitirá automáticamente el desarrollo fluido y sin obstáculos de múltiples Dapps que llevarán a un aumento en el número de usuarios de Dapp, cuentas de registro, volúmenes de transacciones. Alguien podría mirar el Desafío y cuestionar si esta propuesta encaja. Yo no lo hago - ya que tenemos que ver el bosque por los árboles. No hay un mundo en el que podamos desarrollar 100 nuevas Dapps para las naciones, pero la blockchain subyacente no es capaz de procesar un poco esas transacciones. Como dicen los proponentes: Para que las naciones adopten blockchain, necesitamos lograr la escalabilidad a escala nacional. Esto es lo que esta propuesta quiere ofrecer a través de la solución de escalabilidad propuesta llamada \"rollups ingenuos\" o a veces llamada \"rollups perezosos\". A Hydra aún le queda algún tiempo y no podrá resolver por sí sola todo el problema de la escalabilidad. Además, una nueva solución de escalabilidad ayudará a la descentralización de la investigación fundamental necesaria para el ecosistema de Cardano. Veo esta propuesta como una solución en la que todos ganan para el sistema.\r\n", "q0r": 5, "q1": "Creo que el equipo de dcSpark podría beneficiarse de seguir más de cerca las instrucciones precisas para presentar propuestas en Ideascale. Puede que sea un dolor de cabeza, pero la atención a los detalles es el sello de un buen trabajo. Los retos requieren una definición de éxito a los 3, 6 y 12 meses, y no la veo en esta propuesta. Tal vez el equipo podría haber incluido como entregables una actualización mensual (entrada de blog, actualización de vídeo, etc... ) sobre cómo va la investigación. La idea es genial y me gusta que se hayan definido los entregables (1. Redacción de un análisis más riguroso de los rollups ingenuos y 2. Viabilidad de los rollups en cadenas basadas en UTXO (Cardano) y en cadenas de estilo contable (como la sidechain de Cardano llamada Milkomeda)). Sin embargo, me parece que se podría haber puesto un poco más de esfuerzo en hacer compromisos para mantener a la comunidad actualizada sobre la investigación y los hallazgos - a medida que la investigación avanza. Creo que toda la comunidad está entusiasmada con los avances en la escalabilidad y dcSpark - si es necesario - podría incluso aumentar el presupuesto para incluir una persona de marketing para los vídeos regulares planificados sobre los hallazgos ... a medida que la investigación avanza. Tal y como está ahora, el presupuesto no está claramente perfilado ni desglosado en partidas identificables (esas son las normas de Catalyst para las AC). De todos modos, la inclusión del vídeo de Youtube en la propuesta de Ideascale es sorprendente y las credenciales del equipo de dcSpark son estelares y sus contribuciones a Cardano - durante sus días de Emurgo y los días posteriores a Emurgo han sido claras y singulares. Creo que la viabilidad de la investigación es incuestionable gracias a las credenciales del equipo. El equipo declaró \"Creemos que los rollups también pueden formar parte de la estrategia de escalado de Cardano\". Preferiría que las afirmaciones que utilizan la palabra \"creemos\" estuvieran mejor fundamentadas con un mayor análisis del \"¿por qué?\". Mi pregunta es: ¿qué pasa si los resultados demuestran que no se pueden utilizar, tendremos una estrategia alternativa? En cualquier caso, teniendo en cuenta todo, especialmente la competencia del equipo, considero que es muy probable que la propuesta se aplique con éxito.", "q1r": 4, "q2": "Al tratarse de una propuesta basada en la investigación, sus resultados son claramente un producto completamente diferente al de la construcción de un sitio web. Los entregables precisos son siempre menos visibles antes de que comience el trabajo y el equipo ha declarado cuidadosamente que cree que los dos entregables serán una . redacción de un análisis más riguroso de los rollups ingenuos y la viabilidad de los rollups en cadenas basadas en UTXO (Cardano) y cadenas de estilo contable (como la sidechain de Cardano llamada Milkomeda).. Se trata de grandes contribuciones y no hay muchos equipos que se dediquen a este tipo de investigación en profundidad con consecuencias prácticas para Cardano. El equipo - en el video adjunto - y otros videos que se pueden ver en Youtube del equipo dcSpark - muestra que su comprensión de estas cuestiones es realmente profunda. Por lo tanto, creo que sería más fácil para dcSpark considerar incluir en su trabajo algo en la línea de las actualizaciones de la hoja de ruta de Cardano - para todas sus propuestas [https://roadmap.cardano.org/en/status-updates/] Si dcSpark ya está trabajando en contribuciones importantes, entonces los hitos que ayudarán a la auditabilidad podrían tomar la forma de actualizaciones regulares (mensuales) sobre lo que está pasando en cada rama del trabajo. Sin esto, la auditabilidad de una propuesta puede verse afectada y las personas ajenas a la empresa no pueden obtener ninguna información significativa sobre lo que está ocurriendo hasta que un día (¿seis meses después?) dcSpark reaparece de repente y nos cuenta lo que ha ocurrido. El proponente afirma que \"Creemos que podemos tener estos productos disponibles en la primera mitad de 2022\". Para Catalyst, esto es lo mínimo - así que intenta incorporar más actualizaciones/informes obligatorios a lo largo del camino que ayudarán a las puntuaciones de todas sus propuestas (si lo merecen, por supuesto). ¿Alguien quiere actualizaciones mensuales de la hoja de ruta de dcSpark? He visto propuestas de otros equipos líderes que también contribuyen al ecosistema de primera categoría, pero que incluyen pasos detallados, calendarios mensuales, un desglose de los requisitos presupuestarios que incluyen elementos como: \"Número mínimo estimado de días-persona\" \"Número máximo estimado de días-persona\", así como las tasas diarias y las variables que influyen en el presupuesto y en la distribución de la carga de trabajo, y por tanto en la capacidad de auditar el trabajo. Auditar el progreso tal y como está será relativamente difícil, aunque se trata de un tipo de proyecto diferente.  Aun así, se puede ser creativo incluso en este tipo de escenario con actualizaciones periódicas. Por favor, incluya más información sobre los hitos de su trabajo en el futuro, para facilitar el seguimiento.", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 17, "ne": 10, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "A great proposal worth investing for Cardano ecosystem as a whole! One key property that differentiates rollup from Hydra is that rollup does not require trust on the parties that runs it, while Hydra does. This is due to the fact that rollup will write data sufficient to verify computations happened in rollup back to L1, while Hydra does not. This trustless property of rollup brings more possibilities for large scale use cases. For the case of nation-wide applications, any third party can run L2 rollup without acquiring any trust from the nations. The trustlessness and scalability of rollup is going to be a strong reason for nations to adopt blockchain technology.", "q0r": 5, "q1": "DcSpark has demonstrated its experience and ability to deliver high quality product. Besides being the former employers of Emurgo and IOG, they recently launched Milkomeda testnet and Flint wallet which seamlessly connects the EVM side-chain with Cardano. I have no doubt in the team's ability to deliver fruitful research results for this proposal.", "q1r": 5, "q2": "As stated in the proposal, the deliverable is a writeup of analysis on rollup for Cardano in terms of feasibility. This should be fairly straightforward to audit, although I would argue that some quantitative measurements will make it more auditable. For example, providing what exactly will be presented in the analysis (e.g. list pros and cons of rollup, works need to be done). Regardless, research is ambiguous in its nature. Therefore, I don't think lack of quantitative measurements is a big issue overall.", "q2r": 4, "assessor": "z_assessor_315", "no_vca": 20, "ne": 6, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is for a scalability solution that does not fall within the scope of the challenge which explicitly calls for \"Dapp proposals should cover foundational Registry solutions, namely:\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"\r\n\r\nThe proposal adds value to the Cardano ecosystem, in the form of increased scalability.\r\n\r\nThe goals of the project are defined but do not align with the challenge. There are no key metrics defining success.\r\n\r\nHow scalability will be achieved is addressed in the proposal.\r\n\r\nTo improve the proposal: choose an appropriate Challenge (Miscellaneous), ensure goals align with the challenge, provide key metrics for success.", "q0r": 2, "q1": "The proposer relies on reputation to provide evidence of relevant skills and experience needed to implement the proposal, which is not ideal given new CAs and voters may not be aware of them.\r\nThe proposer does not identify the type and number of team members required to implement the proposal.\r\nThe budget is not clearly broken down into identifiable items. \r\nThe budget seems reasonable to achieve the set goals.\r\nThe proposal has no timetable to complete the work other than a nebulous \"first half of 2022\".\r\nThe proposal does explain technical aspects of the implementation.\r\nThe proposal does not include challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: provide specific evidence of experience instead of presumed name recognition, identify the team and skill sets required to implement the proposal, breakdown the budget into specific items, provide a timetable, include a challenges and risks section", "q1r": 3, "q2": "The proposal does not include a roadmap with milestones and a time horizon for achievement. \r\nThe proposal does not provide metrics/KPIs that define the success of the proposal. \r\nThe proposal provides a clear understandable description of the targeted problem.\r\nThe proposal provides a clear understandable solution that addresses the problem.\r\nTo improve the proposal: include a roadmap with milestones and a time horizon for achievement, provide metrics/KPIs that measure progress", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 18, "ne": 6, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "While it is not a direct and immediate attempt at building a dApp on a national level, the impact of research on scaling is undoubtable and dcSpark team is positioned very well to execute on that research.", "q0r": 4, "q1": "The team is highly experienced and well known in the community. However, no clear timeline and milestones are set in the proposal and budget is set as an arbitrary number not really explaining how it will be used. I am pretty sure that the team is capable of providing these basic information and I would love to give them 5 stars if these information was here. For example: by the end of Q1 we will publish X scientific papers, we will put X people full time on the job for that, pay them X amount of money. ", "q1r": 3, "q2": "Unfortunately, no budget breakdown or real metrics were proposed that can be used for auditing the proposal. Team is extremely professional and they have a wonderful track record in and around Cardano and I can not understand why this information was not provided.", "q2r": 2, "assessor": "z_assessor_65", "no_vca": 16, "ne": 0, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "I found the solution to be too general and not specifically focused on any particular problem. We all understand that in order to scale up blockchain, we have to make it applicable so that countries can see the benefits it brings. Your ideas are very good but nothing is expressed clearly. In addition, we should take specific actions to make Cardano's ecosystem highly influential", "q0r": 2, "q1": "I need to see your team's profile. Besides working at Emurgo, IOHK, what is your position? What have you experienced or done? I have not seen how long your rollups plan will last and what specific time period. What are detailed project KPIs? And how long will it take you to achieve the KPI?", "q1r": 1, "q2": "For the $75000 request, how would you guys allocate this money to the project? If it is only for research, it can be highly effective in a short period of time. Or you will use this money to build a large community. From there this community will be able to rollups. And how can the community know that you are using $75k effectively?", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The problem state of achieving scalability at a nation scale I believe is very relevant considering we are only weeks/months away from a massive spike in L1 usage on Cardano due to dapps being released. It fits the challenge of building \"nation dapps\" very well. By researching rollups in this case \"lazy rollups\" we are providing an alternate route besides \"hydra\"- the main scaling solution being built on Cardano today. Although Hydra is promising, it will not be relevant for all dapps and by diversifying research into multiple scaling solutions we are not putting all our eggs into one basket as to speak. I feel this research has the potential to bring great benefit to multiple aspects of the Cardano ecosystem.", "q0r": 5, "q1": "The team at dcSpark is well known in the community and is made up of ex Emurgo and IOHK employees. Taking this into account I believe that there is a high likelihood of a positive outcome when considering the impact this research on rollups could have on Cardano. Although there is no information currently on how this area of research will be conducted eg)- how many people will be researching and a breakdown of how the funds will be distributed. There is also a rough idea of when the research is expected to bear results, but a more detailed roadmap would be ideal in giving the community a more concrete idea of when to expect results.\r\nThe budget of 75k seems extremely reasonable considering \"Polygon\" a Ethereum sidechain solution just acquired a start-up company specializing in rollups for $400m.  ", "q1r": 3, "q2": "Currently there is no real detailed roadmap or KPI's to speak of, I feel that if this proposal had these it would be an excellent all-round proposal. With the above mentioned it is also very hard for the community to track/audit the progress other than the dcSpark social accounts. ", "q2r": 2, "assessor": "z_assessor_858", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Realizaremos una investigación novedosa sobre una solución de escalabilidad denominada \"rollups ingenuos\" o a veces llamada \"rollups perezosos\"", "experience": "Nuestro equipo está compuesto por conocidos ex empleados de Emurgo y ex empleados de IOHK que han estado construyendo el ecosistema de Cardano durante los últimos años"}