{"id": 382865, "author": "adagov.org", "title": "₳GOV: Timelines and Treasury Data", "url": "https://cardano.ideascale.com/a/dtd/382865-48088", "category": 26239, "amount": 25000, "description": "Data about Cardano treasury and funds are distributed between multiple sources in multiple formats.", "funded": 1, "upvotes": 65863177, "downvotes": 9485376, "votes_result": 56377801, "votes_cast": 345, "f6_no_assessments": 7, "f6_rating": 3.7619047619047623, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a nice angle to tackle the challenge in question. The proposing team suggests to increase the transparency of treasury data by using their AGOV platform to serve more Project Catalyst data. Specifically, the team proposes to integrate info about payouts, funds, voting statistics so that transactions from the treasury can be easily identified. The team has already created timeline presentations and campaign lists that closely follow Catalyst events - crucially they are already working on a timeline for Treasury Statistics. This is true to the spirit and crux of the challenge: providing truth about Cardano - especially to non-power users who wish to query and search with a couple of clicks. This community-managed website will be a nice tool and service for beginners who want to access Cardano Treasury financial information.Nice, hit the nail on the head. I especially like the fact that the all data will be open source and retrievable in flat-file formats. Cool. Are there possibilities for real-time stats during voting? Can IOG provide realtime stats on voting - similar to other blockchains that have that feature? Where else could you take this? Which payouts will be covered? Payouts to proposers, to CAs, to Challenge Teams, to vCAs? Other types of payouts? Influxes to the Treasury too? ", "q0r": 5, "q1": "It seems that the proposal can be implemented successfully. Adagov has already provided evidence that is is successfully creating a repository of information about Project Catalyst timelines, proposals, campaigns and funds. With online information on Timelines and Campaigns and Funds already created. The data will be extended with much needed information on treasury funds, number of wallets and voting. The team specified that it intends to extract further information \"from official documents and from the multitude of sources\". This last part seems to be too vague for a specific plan and may be a bit of a weakness in an otherwise very good proposal. I would have liked to see which specific information and what are these sources under consideration. What are the problems that could ocurr, will the data be available, who will be approached and when? On the other hand, the team stated that it has already begun this work (without funding) already - and provided a link [Treasury Statistics: https://airtable.com/shrFUpPLYSthyUnWD] as proof. Great! However, I'm surprised the team didn't include other identifying information about the proposers, apart from the Adagov (₳GOV) name and site. I spent 20 minutes searching for info online (didn't find much), while this could have been provided inside the proposal. If the proposal is not accepted, I would suggest to boost the team profile segment in the proposal to make its feasibility clearer. The team did include general profiles and the fact that they have been funded previously in F4, F5, F6. OK, fine - we can't keep all the info in our heads. How are those projects going. A short recap would be nice especially information on how they enchance this proposal. I've seen smaller proposals provide more team information. The budget is broken down - but into three lump sums. There must be some additional rationale for the division into $5,000 for data extraction and cleaning, $10,000 pipeline development (coding, automated services) and $10,000 integration support into other systems (API, service fees etc.). The sums seem to be \"too round\" to be precise. Precision inspires confidence. \r\n", "q1r": 4, "q2": "The timeline and milestones could have been more detailed. Writing up the timeline seems to have been done in a hurry. OK, \"extract and clean existing data\" sounds good - but what is \"existing data\" exactly and from which sources - so it can be audited? An auditor of the project needs to know. Is all of the data available or do you need permissioned access to some of the voting data on the side chain where the Catalyst voting occurs? What is fully accessible and what exactly will be presented? What kind of pipeline could be created in 3 months? Some more details would be welcome. The team mentions that the extraction could occur semi-automatically or automatically. Which one of these two options is Plan A? What are the limitations and costs involved with semi-automatic ... same questions for automatic? What are the challenges and risks there? The second part of the 6-month goal is not too clear or precise to me: \"A 15+ contributors to the data, backups and version control and a number of integrations.\" The team says it works under a continuous integration and development process, which is good. However, the deliverables could have been better defined. Thing is that imprecision breeds confusion and doubt and leaves too much space for differing interpretations. Also I would have liked to see more about the quality of navigation and ease of use features that are planned. Will it just be a data-heavy repository ... and if not, why will it be easy for non-power users to use? What is the vision there to make it user-friendly? Ultimately if the end user can easily use and navigate - that is success.\r\n", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies a problem within the challenge which needs to be solved that there are multiple sources of data and multiple formats. It would have been good to provide more information about it and more examples to make the problem more specific. The solution is explained well with some helpful links to work done which is great. But it will be helpful to explain what is the advantage in the way you put the info together. Just to give an example of the timeframe link you shared you could explain that you have the timeline of all catalyst funds in one place and that there is no other source providing it. https://airtable.com/shrpnN4ma5uDR82X8/tblhFoC2AJk5vRlEN?backgroundColor=yellow&viewControls=on you. \r\n\r\nThe proposal clearly articulates how it will add value to the Cardano ecosystem to whom and why it is important. \r\nThe key metrics of the proposal align with the outlined challenge settings.\r\n\r\nAs an active community member, I spend a great deal of time looking for information and having a centralized location will be very helpful. i.e. I was looking for a simple table of how many proposals were presented and funded in each Fund from 1-6, had to ask multiple people, and finally to do it myself. ", "q0r": 5, "q1": "The proposer provides evidence for their work with helpful links and already started to work on the proposal with no funding. This is a very positive sign and seems the team has the relevant skills and experience needed to implement the proposal. \r\nWhile the proposer mention in the \"relevant experience\" area the type and number of team members required to implement the proposal it would have been helpful to have more information about the team and their experience. The proposal mentions that he was funded F4, F5, F6 and it would have been helpful to have the links for the funded proposal to have more information about your work and some evaluation for the success of those proposals. It would have given more confidence about the feasibility especially with the experience you have within Catalyst. Your website https://www.adagov.org/ also provides only general information only about the network of changemakers involved in Catalyst. But who will be the team lead and dedicated team leaders for this proposal?\r\n \r\nI did look in a couple of other proposals from previous funds where you provide much more information and it could have been helpful to have it here as well. One example: https://cardano.ideascale.com/a/dtd/In-Wallet-Onboarding-for-ADAholders/367120-48088\r\n \r\nThe budget is outlined and broken down into identifiable items. However, it is not clear if the budget relates to what timeframe - is it for the full six months? or how the budget was calculated - for example, x developer for x months for x rate. This will be especially helpful as you stated in the proposal \"We operate under the continuous integration and development process. \" What will be the budget going forward is not clear. \r\n\r\nYou mentioned that there will be ongoing updates to the database. A launch date for the suggested add-ons (\"We propose extending this data to include treasury funds, number of wallets voting, and information extracted from official documents and from the multitude of sources\") could have been more specific. Otherwise, you could have presented the proposal as an ongoing update and present the budget accordingly with ongoing support/monthly/quarterly budget.\r\n\r\nWorking with multiple startups and developments projects through the years, I would recommend that you include more detailed information for this proposal as it seems from previous proposals the team did in the past. The concern is not about the team capabilities but on the dedicated focus on this specific proposal.  ", "q1r": 3, "q2": "You clearly define the Metrics that are related to the challenge. Could have been good to add some specific KPIs to see the real impact of the proposal i.e. how people search today such as how much time spent for the information and the new database will be more efficient. Another KPI could be an estimation of how many community members will use the solution. \r\n\r\nAll data will be available open-source and retrievable in flat-file formats and the proposal does provide relevant links to websites so it will possible to follow up on the progress. The problem is well understood as well as the solution but as mentioned before, a clearer launch date and more specific KPIs will make it easier to audit.  Overall, based on the above and the team experience with the community, I do believe the team will provide the clarity needed to evaluate the proposal's progress.  ", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 20, "ne": 12, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "This proposal addresses the challenge very well in that it would allow for extended transparency regarding the Catalyst treasury. This proposal also addresses the current gap and measure of success for this challenge that all transactions from the Catalyst treasury should be easy to identify. It would very much aid the objectives of this challenge and enhance transparency and trust by providing easy access to data.", "q0r": 5, "q1": "The proposing team is very active in the Catalyst community and has done prior funded as well as unfunded work in this area. This proposal provides proof of their prior work on this project, so it is very likely that with funding, the team will be able to finish this extension of providing additional data to promote transperency and trust among all members of the Cardano community. Roadmap is feasable, team is competent in the area, proof of actionable steps and skillset of team members is provided.", "q1r": 5, "q2": "Auditability is high, since this is all accessible in a repository for everybody and the goal for this proposal is to make it easier, to identify transactions of the Catalyst treasury and progress of work is visible and auditable for everybody on their website. Roadmap and budget breakdown is realistic.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 23, "ne": 4, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "The main idea of this proposal is to extend Project Catalyst data to include payouts, funds and voting statistics. The allegation is that by bringing this information to the public and by making it easily accessible to all truth about Cardano will be easier to see. However, I believe this only partially addresses the problems of the challenge. The ideal goal is to develop a way to protect the environment against disinformation attacks that could in turn pose a threat to the trust and value of the Cardano ecosystem. Having said that I do not believe the proposal solves the problem or the metrics are strongly aligned with the outlined challenge settings. It is true that it would be beneficial to have an easy way to retrieve those kinds of information but its contribution of value to the Cardano environment is somewhat limited.", "q0r": 3, "q1": "Very little evidence of relevant skills and experience needed to implement the proposal is given. It is not debated the type and number of team members that will be required. Additionally, the budget is overpriced and the rationale behind the estimates of each item in the budget is not explained. Also, there is no contingency plan in case additional funding is needed and the timetable provided is reckless and not very realistic. Finally, there is no discussion about the challenges and risks relevant to a successful implementation.", "q1r": 2, "q2": "The roadmap traced is lazy and does not provide sufficient information on how each task will be done. Moreover, the time horizon could have been more accurate. The proposal does not specify if the pipeline creation will take 3 months, if will be done 3 months after the project has begun or when are the expected dates of beginning and ending of each phase. The key metrics proposed are not very objective and do not help much in assessing the progress of the project. Finally, it is not clear that this solution will address the problem of cyber disinformation attacks eroding the trust and information being hard to classify into truth or fabrication.", "q2r": 2, "assessor": "z_assessor_341", "no_vca": 23, "ne": 6, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "\r\nCapturing the Voting statistic and treasury fund transaction into a single data source that can be easily accessed by anyone is a commendable idea and fits into this challenge. The work had begun before funding shows commitment on the team part to implement this project. The Impact of this project will help community members to access past Voting Statistics to make informed decisions. \r\n", "q0r": 5, "q1": "The experience of the Team at adagov.org seem great but there is no way to identify the individual information , I have accessed the website but no team members information is display. Given that the team is currently working on going project , and the timeline provided is good but no evidence of Team behind it is provided. I am neutral", "q1r": 3, "q2": "How much of the funding is allocated to each of the timeline is provided, I would expect the team to consider potential risks of this project.\r\nThe Definition of success after 3, 6 and 12 months is not provided to enhance auditability , The project is already launched which is good and the fund will extend the functionality . The processed  data  will be open source which increases the audit ability of the Job done.  \r\n", "q2r": 4, "assessor": "z_assessor_430", "no_vca": 19, "ne": 0, "ng": 16, "nfo": 3, "vca_o": 1, "reply": "2 Full time members x $5.000 x 3 months + $30.000"}, {"q0": "Great idea to expand the already existing data from Project Catalyst. By providing the extra information you create a place where everything is visible for the community.", "q0r": 4, "q1": "Regarding the information provided for feasibility, we get all the key features needed. Everything is explained but rather short. It would've been better if the proposer provided a bit more detail concerning the budget breakdown. We get categories and the funding required for them but not why, explain why you need 10.000 for pipeline development. How many developers do you need for this, how many hours of coding are we looking at. Providing more details into this we get a better picture of why the amount is needed. What we are missing is details about the team proposing this. Who is on the team proposing this and what relevant skills does the team have? Without knowing this we don't know they need to hire extra team members or not.", "q1r": 2, "q2": "The roadmap is provided which gives insight into what the proposers have planned after funding is secured. The key metrics are also in-line with what the proposers wish to accomplish. Looking at the ease of access is an important aspect of this challenge.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 19, "ne": 0, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about extending Project Catalyst data to include payouts, funds, voting statistics so that transactions from the treasury can be easily identified. This idea is great. The problem statement is clear but it is not explained in detail. For better understanding, the problem statement should be explained in detail in order that the existing background is clarified. The proposed solution is clearly defined, addresses the challenge, may contribute to increasing the usage performance of Cardano treasury and funds; as a result, clear impact on the whole ecosystem in long term.\r\nTherefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "The team profile is not described clearly, however, through the provided link [https://www.adagov.org/], I can see this team's works and achievements. However, for better understanding, the team profile, as well as the member's profile, should be explained more in detail with reference/proof (documents/links,...) for verifying. The team got a funded proposal in the prior fund. The budget is not provided much information [onlytotal budget and items structure but without explanations of calculation base]. The roadmap is provided and described enough for understanding, the metrics are provided, some of that is measurable, but not defined specifically in numbers.\r\nBesides, KPIs and risks are not provided.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of information. However, there is a lack of: (1)Team profile with reference/proof (documents/links,...) for verifying. This team's ability, skills are very suitable to implement this proposal with some completed great works; so it would be more auditable if team profile, as well as accomplishments, are provided more in detail; (2) Budget explanations of calculation base for each item; (3) Specific KPIs/ metrics, some of this proposal's metrics is hard to define/not likely metrics [ex: \"Ease of access to information about ....\", Historical transactions ...can be easily identified\", \"New sources and repositories of information are developed containing timelines for Cardano projects\"]; (4) Risk analysis.\r\nTherefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 15, "ne": 5, "ng": 5, "nfo": 5, "vca_o": 1}], "solution": "Extend Project Catalyst data to include payouts, funds, voting statistics so that transactions from the treasury can be easily identified.", "experience": "1 x Systems Engineering, 1 x Social Designer, 1 x Project Manager and Software Development Cooperative. Funded F4, F5, F6."}