{"id": 383133, "author": "mercya1", "title": "Reduce Disinformation With Facts", "url": "https://cardano.ideascale.com/a/dtd/383133-48088", "category": 26239, "amount": 15000, "description": "Lack of factual information dissemination make communities susceptible to disinformation attacks.", "funded": 1, "upvotes": 64349187, "downvotes": 9026611, "votes_result": 55322576, "votes_cast": 465, "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "\r\nThe proposal is within the challenge goal of this campaign, fact checking will help the ecosystem.\r\nI'm a bit concern that the solution is proposing to use Students and Volunteers to source fake information instead of WADA core Team. It an easy fix , nevertheless .  I would suggest the team collaborate with other teams working with similar solutions to avoid work duplication.\r\n", "q0r": 4, "q1": "The track record of WADA in  Cardano outreach clearly denotes their passion, alignment and willingness to promote Cardano blockchain.\r\nThe financial budget is very clearly allocated and reasonable to set up the actionable steps that are provided,  I am not so sure what the material cost is in the material.\r\nThe Amount of money requested seems fair. The incentives budget is not clear as well.\r\n", "q1r": 4, "q2": "There's enough information here to make this project auditable but the key metrics provided does not align with the problem statement and solution this proposal provided. \r\nFor example Number of participants who complete a learning program is not align with solving the problem of fake information in cardano.\r\n\r\nI would suggest the KPI should focus on the number of fake Information sourced and reported etc to increase auditability.\r\n", "q2r": 3, "assessor": "z_assessor_430", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1, "reply": "Tools, Infrastructure and expenses = $5.000"}, {"q0": "It's always nice seeing things return from previous funds. This proves that topics are still being supported. By providing solid information to WADA you create lasting support that does not fade away after a fund. Although the project focuses on WADA this fits within the challenge settings.", "q0r": 4, "q1": "Regarding the team for this proposal, we are getting the key points from the members. They are all members of WADA, the only thing that is missing is some reference to this. Some voters won't recognize the members of the team and by supplying reference links to the members you make facts from the information. The roadmap provided is solid and has nothing missing. We see all the steps in the proposal.", "q1r": 4, "q2": "Good to see the proposers thought about risk management. Although it was not completely needed for this, it shows they look at everything. Success metrics are in line with the proposal and give the consistency of the team to care for the project. this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 19, "ne": 1, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important it is to have access to accurate, comprhensible information to avoid the spreading of misinformation and distrust. In addition to this, I am part of the catalyst community since several funds and know where to find trustable source of information which is an important resource for evaluating proposals in this category. The proposal grasps the problems within the challenge well and presents a valid solution to this: tackling disinformation by disseminating correct information via important actors within the ecosystem. This will sure be beneficial to Cardano, as disinformation is a serious threat towards Cardano and the whole blockchain environment. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they and their project partners will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 22, "ne": 3, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The proposal identifies an important problem of the dissemination of \"lack of factual\" information, which is relevant for the challenge.  Through previous work, I have been following other educational programs called the center of social excellence  https://www.earthworm.org/our-work/programmes/cse and I can appreciate the importance of dedicating resources for proper education. The cost per student is high, but they can then become good ambassadors. It is important to provide the best tools and information for the local centers to disseminate the current information about Cardano, especially if there are ambitions to grow in these regions. I would recommend spending good efforts in the recruitment process, as quality students will be a key success factor. \r\nThe proposal might fit better to scaling Cardano community hub than to this challenge as the onboarding of quality ambassadors and knowledgeable team members at WADA has a general benefit and is not only related to this challenge.  However, there is alignment with several KPIs listed in the challenge. ", "q0r": 5, "q1": "The proposer is very active within the catalyst community and doing incredible work to promote Cardano/Catalyst in their region. As an active community member myself, I appreciate their hard work and dedication.   \r\nThe proposer well identifiable the type and number of team members required to implement the proposal.\r\nThe budget is outlined but more details will be helpful to better evaluate the use of funds. Each line could have some simple details to explain how the proposer reached the calculation. The budget is reasonable to achieve the set goals. \r\nThe proposal offers a realistic timetable to complete the work and provides a good plan for implementation. More detail about the 6 weeks course structure would be helpful. Is it full-time or part-time? what content will be covered each week? However, you mention that you have access to mentors and experts willing to support both the goals of WADA and Cardano. Would the experts be paid? Who will teach the six weeks course?  \r\nThe proposer considered some risk factors. ", "q1r": 4, "q2": "The roadmap is clear and will be easy to audit and follow up on the progress.  KPIs are also well defined, but I would recommend having some more specific targets mentioned in them. \r\nIt took me several reads through to understand the solution and I believe some more details would support your proposal even more. For example, providing more information about the course syllabus. You could also provide more information about the learning management system which is under development and it will be relevant already for this course. \r\nOverall, I am confident the community will receive the information required and will be able to audit the roadmap and progress of the proposal. \r\n", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 21, "ne": 8, "ng": 12, "nfo": 1, "vca_o": 1}], "solution": "Proactively resource Wada's students and volunteers to source & disseminate Cardano and blockchain facts online and in-person", "experience": "Human Relations, Community Engagement. Wada"}