{"id": 414008, "author": "ninhtran", "title": "ATALA Prism zKP + Hyperledger Aries", "url": "https://cardano.ideascale.com/a/dtd/414008-48088", "category": 26598, "amount": 82000, "description": "ATALA Prism and RootsID don't support zero-Knowledge Proofs and Predicates and are currently not interoperable with Hyperledger Aries or W3C OBv3. Prism is only on Testnet. Let's get ATALA on Mainnet.", "f6_no_assessments": 7, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 990, "q0": "Based on the proposed solution, Snapbrillia in collaboration together with RootsID team would like to bring on interoperability feature between Atala PRISM with Hyperledger Aries. This is in my opinion a well though proposal that will help more project use Atala PRISM for DID use case or simply bridge the Hyperledger with Cardano blockchain. The proposal itself answers the cross-chain collaboration challenge by implementing technical connection between Cardano to Hyperledger Aries (building bridges). Furthermore, the key metric is also aligned with the challenge key metrics. That is adding number of technical implementations connecting Cardano to other blockchains. After all, this project will be build by the Atala PRISM Pioneers and will be made available (open-source) for the whole Cardano community, giving greater impact for the next Atala PRISM developers/pioneers that want to build project in this field.", "q0r": 5, "q1": "When it comes to the experiences in Atala PRISM, I think Snapbrillia & RootsID team that are parts of Atala PRISM Pioneer Batch 1 & 2 are more than capable to achieve the targeted goals. Both of them have previously funded proposals in the earlier Catalyst Fund. In addition, in the proposal they explained the team consists of full-time web3 architects, web3 developers, data scientist and full-stack developers. Equally important is that they also explain the timeline including adding one month buffer to deploy the product in March 2023 (see risk mitigation). All the possible main risks are concisely answered with the solution to mitigate the risk. For example, established partnership with Atala PRISM and IOG team to deploy the Atala PRISM on the mainnet in August 2022. After all, the budget is broken down based on the manpower necessities with market-rate salary. Overall, I’m quite confident that both of Snapbrillia & RootsID team could bring the project into realization. Therefore, I give 5 stars for the feasibility. ", "q1r": 5, "q2": "It is often said that a successful project needs a good planning beforehand. I see that the Snapbrillia team give a good roadmap/product timeline to achieve want they want to deliver from this project. Equally important, the KPI/metrics is clear & measureable. And for the sake of transparence, they will host demo in the After Town Hall at least once to twice a month. Community could also check the development progress via their GitHub link https://github.com/snapbrillia/. Additionally, the team wrote clearly what they want to achieve starting from providing Atala PRISM & RootsID with z-KP functionalities until expanding Atala PRISM interoperability with Hyperledger. I give 5 stars for the auditability based on all information above.", "q2r": 5, "assessor": "z_assessor_2174", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 1832, "q0": "This proposal addresses the challenge of cross chain collaborations by building a zero-knowledge proofs (zKP) for decentralized identities (DIDs) on ATALA Prism. By having these tools, people from other chains and people not familiar with blockchain technologies will grow the Cardano ecosystem greatly. The team have already made many connections with teams from different blockchains and communities to build this zKP on ATALA Prism. They also are part of W3C Credentials Community Group Open Badge which is a cross chain solving for DIDs. The team have stated the risks for this project and majority of them have already been solved by having partnerships with ATALA Prism, IOG, Emurgo, Hyperledger, Plutus devs, etc. This project will be able to scale globally because they are solving DIDs with zKP which will bring more people to the blockchain space. The success of this project is high as many partnerships have been built.", "q0r": 5, "q1": "The team have the relevant experiences to build this zKP on ATALA Prism. They have developers who understands and write code languages in Haskell and Plutus for Cardano and Solidity for EVM developments. They have provided their LinkedIn profiles to prove their expertise in this area to build a great tool. As for the project timeline, the team have broken down in details their milestones. With the number of developers and skills that this team have, the project timeframe is practical and achievable. The budget break down is also in details and it is according to the market value. The budget requested is enough for the team to execute this project. Most of the budget is used for developing the tool for zKP on ATALA Prism. However, I believe there must be project management to ensure the milestones are hit timely manner according to schedule in their proposal. All in all, the team have the experience, expertise, right partnerships, and talented developers to complete this project. ", "q1r": 5, "q2": "Audibility on this proposal is quite easy. The team have prepared multiple ways to audit their progress of this project and they will publish publicly. They will also open-source codes for ATALA Prism ZKP and Hyperledger Aries in Github for anyone to audit. The team will be in Catalyst Town Halls regularly to update the community on their progress as well. They also have a discord channel for the community to get updates from the team. The team show a deep understanding of potential challenges by having building zKP for DIDs in the ecosystem. All in all, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_2274", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 3027, "q0": "I am not associated with these projects directly, but a project I am involved in would greatly benefit from this bridge. Hyperledger is used at many U.S. Universities in order to place education credentials onto the chain. Applications involving DIDs and SSI right now run into Hyperledger solutions before Cardano ones, so this bridge would target that weakness. Some projects just end up on Hyperledger due to the fact that they are the ones being accessed at these universities.", "q0r": 5, "q1": "I have had a few interactions with these team members and they are professional and knowledgeable, with passion, about Cardano and blockchain. They have given considerable links to materials that show showcase their experience.", "q1r": 5, "q2": "Many links to many materials as I mentioned on the 2nd prompt. They are active on Discord, and are answering questions. Twitter is active. Nothing stands out to me as info lacking. I found going through their materials inspiring, and more than just placeholder content. It is material worth browsing in and of itself.", "q2r": 5, "assessor": "z_assessor_2386", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 3081, "q0": "The problem described in this proposal is closely aligned  with the challenge, directly addressing the challenge.\nDecentralization is a central and very important pillar for any public blockchain, focusing on building interoperability between decentralized identity solutions built by businesses with blockchains. Cross-chain projects from more than 20 companies as listed in this proposal will greatly help the Cardano Ecosystem. At the same time, it is also aiming for full cross-chain interoperability when the W3C Obv3 Ecosystem is formed.\nThe proposal also clearly states the risks and measures to deal with those risks during project implementation, reducing risks for the project and bringing a higher probability of success.\n", "q0r": 5, "q1": "First of all, ATALA Prism zKp+Hyperledger Aries is a project in the process of complete development, and Fund8 has also obtained 2 proposals from Catalyst Fund. The project is measured by KPI to measure the completion and the project is also divided into several sub-phases making the project more feasible.\nThe proposal also provides a detailed plan including the key milestones of the project to be carried out from the Q3/2022 to the Q1/2023, which is measured by a KPI to measure the level of project completion. Thus increasing the probability of proposal success when the proposal is funded.\nThe team involved in the project has a lot of experience, has full details about each member of the project. Especially the members of the Dev Team are very large, giving a lot of confidence in the success of the project.\n", "q1r": 5, "q2": "The information provided is sufficient to assess the progress and success of the first 3-month phase of the proposal. In addition, the milestones provided are sufficient to assess the success of the project at 6 and 12 months. The KPIs have been carefully selected and I believe they are good indicators of success. Proposed Outputs are reported at least once to twice per month for community engagement and feedback on progress until the end, the proposal joins most Catalyst Town Hall and work closely with ATALA Prism, RootsID, Hyperledger Aries and other partner to provide updates to the community.\nI think this proposal should be funded to help fulfill Snapbrillia's mission, to help launch the Cardano dApps community into the Metamask world and strap Snapbrillia along for the wild ride to the moon and back.", "q2r": 5, "assessor": "z_assessor_2397", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 6203, "q0": "This proposal seeks funding for the development of  Zero-Knowledge Proof and Predicate integration layer for ATALA Prism on RootsID CLI-WAL wallet and make them interoperable with Hyperledger Aries and W3C OBv3.\nThe problem that this proposal wants to solve is clearly explained, ATALA Prism and RootsID don't support Zero-Knowledge Proofs and Predicates.\nThis project will be build on the work of  previously funded proposal “Hyperledger-Prism Interoperability” in F7. The project will be developed in collaboration with Rodolfo Miranda, Lance Byrd, Esteban García, Butch Clark, and the RootsID research team.\nThe proposal clearly addresses the challenge by building an interoperability solution.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer foresees mainly risks for the project from unforeseen technical blockers on the side of the technology they are working with. However the proposer suggests that establishing a technical partnership with the dev teams of the technology used will mitigate these risks.\nVery detailed plan with monthly deliverables is presented starting from Q3 2022 and finishing in the end of Q1 2023.\nThe proposal is explained in a clear technical language but made user friendly where possible.\nThe current team of the proposer at the moment has 56 devs with different expertise and the proposer needs to expand with 6 more to complete this proposal. \nThe budget for these positions is outlined and totals 72K and 10K for Cloud hosting and transaction fees.\nThe whole existing senior team is presented well and with linkedin profiles, also linkedin profiles for the extended team are present. No doubt that the team has sufficient experience to deliver on the promises of this proposal. \nThe proposer does not intend to return for further funding for this project.\nThe proposer has 4 proposals in fund 9 asking for the total of $685K and has been funded in fund 8 for two proposals totaling $202K.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer outlines KPIs to measure success but lacks the concrete numbers these KPIs have to reach until what date. However these are highly speculative projections that may make the live of the auditors easy but are very hard to predict and can needlessly tilt any project into the wrong direction.\nThe project being open source on github, will be easy to audit. The proposer makes an extra effort to move the management from ClickUp to Github in order to provide transperancy for the community.\nThe proposers measure progress daily!\nAlso the proposer hosts Snapbrillia Demo & Progress After Town Halls at least once to twice a month and provides a discord channel for communication. \nSuccess metrics are defined.\nThis proposal is impressively open and transparent and it looks that it will be very easy to audit.\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 7841, "q0": "The problem statement is short and to the point.\nThe problem defined is in the scope of the challenge. \n\nThe positive impact on Cardano ecosystem is in promoting the development and adoption of SSI, which is often named as a crucial component of widespread adoption of blockchain.\n\nThe value added to the ecosystem is creating an interoperability solution between several SSI/DID framewrorks.\n\nThe KPI's of the proposal align with the challenge KPI's\n\nTherefore I think the impact rating is 5", "q0r": 5, "q1": "The proposer identifies clearly the resources needed for the implementation, the team, the roadmap to implementation.\n\nThere is a process to get additional funding if it is required.\n\nThe proposal contains technical details on the implementation, as well as risk assessment.\n\nOverall I don't see anything that would make me doubt that the proposal would be implemented successfully.", "q1r": 5, "q2": "The information about auditing is abundant: there is roadmap with milestones, discord server.\n\nThe KPI's make sense and can be used to track the implementation of the proposal.\n\nThe proposal names several ways the community can track the progress of the implementation.", "q2r": 5, "assessor": "z_assessor_2928", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 9280, "q0": "The proposal directly addresses the challenge by creating integration between ATALA Prism and RootsID wallets, and making them interoperable with Hyperledger Aries and Indy. Hyperledger Indy is a popular SSI framework from The Linux Foundation, and is interoperable accross blockchains. Hyperledger Aries connects the SSI framework to Atala PRISM. The proposal is also impactful for bringing support to these for zero-knowledge proofs making them conform to the W3C Open Badge 3.0 standard. So the proposal extends capabilities and integrates projects.", "q0r": 5, "q1": "The company behind the proposal, Snapbrilla, has 9+ in-house developers. The Snapbrilla team also comprises of several industry leaders, including the CEO who has extensive experience in getting talent hired. The budget breakdown looks well-thought out, for hiring 4 Web2 developers and 3 Web3 developers at market rate from Vietnam for 4 months and accounting cloud hosting and transaction fees.\n\nThe work is broken up into milestones, with completion in March 2023. Q3 2022 milestones include deploying Aries and ATALA Prism on production and mainnet, with interoperability with Indy and Prism on development. These are milestones the company is working on regardless of funding. Q4 concerns implementing zero-knowledge proofs on dev and deploying interoperability to production and mainnet. Q1 `23 is about completing with zero-knowledge proofs. Given the team's credentials, they are well qualified to research and implement the proposed features.", "q1r": 5, "q2": "The project is very auditable. For one, the project will be open-source on Github (with both RootsID an Snapbillia repos) where everyone can measure its progress with the projected milestones. Snapbrillia also hosts monthly townhall meetings to provide updates to milestones. Also, there are several kpi's including thew number of DIDs, verified credentials, zero-knowledge proofs, and dApps and projects on mainnet built on ATALA Prism, and Hyperledger.", "q2r": 5, "assessor": "z_assessor_3045", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}], "solution": "Build zero-Knowledge Proof and Predicate integration layer for ATALA Prism on RootsID CLI-WAL wallet and make them interoperable with Hyperledger Aries and W3C OBv3.", "experience": "We are a diverse team of four self-taught founders with over 97 years of combined experience learning and implementing AI and Blockchain solutions in Healthcare Tech, FinTech, E-Commerce, Legal, Non-Profit, and HR Tech. We successfully ran $60 million funded AI and Web3 startups."}