{"id": 414170, "author": "brerrabbit3", "title": "Cardano/Ethereum NFT Ecosystems Map", "url": "https://cardano.ideascale.com/a/dtd/414170-48088", "category": 26598, "amount": 40900, "description": "We lack visual tools and research on the relationships between the Ethereum and Cardano NFT Ecosystems. What's similar between them? Which projects are most innovative? Where do we go from here?", "f6_no_assessments": 6, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 1737, "q0": "The problem statement is clear, then asks 3 helpful questions to further the statement by helping voters see what the team contemplated in coming up with their solution of a map of both the Cardano & Ethereum NFT ecosystems.\n\nThe problem statement aligns with the challenge in that building a map such as this opens up a new intention when thinking about these two, often very competitive, NFT markets. It sees them as part of a whole and allows users to imagine seeing both as valid and part of what is possible. It moves users away from minimalistic thinking. And what's more, is that their stated goal is to show possibilities for creative collaborations and cross-chain community building.\n\nThe strategic and focus-realigning vision of the outcome makes perfect sense that it will be a value-add in the Cardano community and positively impact not only Catalyst's native blockchain but Ethereum as well. \n\nVoters will be pleased to see that KPIs match that of the challenge as described, and the team plans to record the results of the work they achieve with this project. Later, they will come back to gather more funding, continue their work, and make sure the Map accurately represents this fuller vision of the NFT ecosystems to continue serving the aims of collaboration and inspiration between the chains.\n\nThe risks mentioned ask questions about the possible reach of the team's work and if they have a complete vision of what to include. Mitigation plans include a media and marketing team as well as a research team to thoroughly look into both ecosystems and map out what has happened thus far and how those various categories of projects might be able to collaborate in the future.", "q0r": 5, "q1": "The skillsets are explained in the introductions of the team members. The team clearly took the statement \"Relevant Experience\" very seriously. It's hard to imagine a more accurate way of executing that part of the proposal. Voters will find it easy to determine what skills are needed and if the team contains those qualifications. \n\nThe budget continues the exemplary methodology of following the brief, maintaining ease of reading with clarity and identifiability of each area. As a researcher myself, I can say the budget is reasonable for the work and, if anything, is on the low-end of the pay rate for each position, though not alarmingly so. This says the team is conscientious about the spending of community funds and is mindful of the needs of others. Bravo.\n\nThere is no contingency budget, though, for the work at hand, it doesn't appear necessary. Besides this, the team is so multi-faceted that it's easy to imagine that their collective strength is in their numbers and consultations when challenges arise.\n\nThe plan is rigorous. It displays all pertinent previous work up to this point, well-ordered actionable tasks for the beginning of this proposal's mission––Q3 2022, all the way to the release of version one in Q1 of 2023. While on the topic, the timetable is realistic given the details provided. Voters can expect a high likelihood of the team achieving the outcomes on time.", "q1r": 5, "q2": "The roadmap offered in the detailed plan is sufficient. Added to this section is a complete list of links that will allow the community to view the team's work at any time during the process (Gitlab, Dework, & Discord provided to this end), as well as a success statement that offers the full details of outcomes, in quantifiable terms.\n\nThe only note this assessor has to offer is that if the team were to rewrite, offering some less detailed version of the roadmap in this section could be nice to wrap it up. While not necessary, the visual would be impressive and summarizing.", "q2r": 5, "assessor": "z_assessor_2261", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1360, "q0": "Yes this proposal effectively addresses the challenge by building an ecosystem map of the Cardano and Ethereum NFT ecosystems. \n\nPerhaps because Charles came first from Ethereum before developing Cardano, there continues to be an unnecessary amount of drama between our two communities. The NFT space has not been spared from this drama and there is often a lot of mud slinging about who is better, more innovative, and important. What is often not discussed is that there is enough room for both, and others. \n\nWhat I like about this proposal is that it isn't forcing cross chain collaboration, instead its highlighting that we might actually have a lot in common we just don't see. By providing a visual and informative overview of the projects building across the two ecosystems, individuals, groups, and projects can identify, connect, and learn with each other. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is highly likely this proposal will be implemented successfully. \n\nFirst off, the team putting this proposal forward is composed of some heavy hitters within the Catalyst space, particularly Swarm, Aim, and ArgusNFT. Each of these groups individually have an amazing track record of success and providing real value to the community, together the are likely unstoppable. \n\nSecond, the development and integration work to be completed to get the map fully functional is well laid out. If I had one critique here is that I would have liked a better description of the reports. They do mention what the goal of the reports are but what they will entail, how they will be structured, and drafted, could be expanded upon. \n\nLastly, I find it unfortunate but none of the map links worked for me. I just kept getting taken to a blue screen. I even changed browsers and cleared my cache before trying again but to no avail. Given this important piece is missing I give 4/5. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. \n\nThe team has committed to making their project open source and posting their map on the gitlab. Voters can be confident that the team is open and willing to have others examine and test their code to ensure it reaches the highest standard possible. This also reduces the likelihood of bugs going unnoticed for an extremely long time and then found by a malicious actor. \n\nAnother exciting part about how the team will audit is that it builds on the already excellent work of the Swarm and its integrations with discord and dework. This type of community bounty approach seems to work really well in Cardano and capitalizes on the wisdom of a broad set of community members, not just a small team. \n\nI think the success measures could perhaps be a bit stronger rather than saying \"widely known by thousands of participants\". That's a fine success measure, but how many thousands, by when, and interacting in what capacity? These types of details are likely not enough to reduce marks given the clarity on auditing overall, but something to consider for future funds. ", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Overall, this is a very thoughtful and detailed proposal. It's unfortunate that the map PoC links did not work for the assessor. They worked for me multiple times prior to submitting the proposal, and have continued to work every time I've tried them since, including just after I read this assessment for the first time several days ago. That said, the detailed analysis and feedback in this assessment is appreciated."}, {"id": 10004, "q0": "The idea of building a map helps users and developers find creative projects, Dapps, NFT. The author has properly identified the current situation and developed a solution that fits the challenge presented, which is in line with the challenge installed for F9. Solving the challenge is creating the Open Source Map, the bridging interaction between Dapps in the Ethereum and Cardano ecosystems. The solution implemented will directly impact users and developers, we will not have difficulty choosing Dapp applications, and have the most suitable choice to build our own project. Ethereum this is suitable for the blockchain world, the proposal is highly scalable when there are structural changes and the number of Dapps increases in the future. It's great when we want to get to Catalyst Swarm, just go to the map and find what we need. The solution of the proposed proposal has a strong impact on the ecosystem of Cardano and Ethereum, developers have many opportunities in developing their projects, building Cardano and Ethereum to develop in parallel. The proposal identified the main risks as maps and reports that had no impact on the community, but this was mitigated by appropriate communication and marketing. We have an opinion: The author needs to develop the same manuals as electronic products on the market, which helps developers to be aware of the map and use the map in the most effective way. With our opinion it would be appropriate to minimize both of the risks that the proposal presents, developers can use maps easily and know information about the project, the most notable platforms and communities in the ecosystems. In addition, we agree with the studies and gather community opinions to get the best selection of projects, platforms, etc. in the map, which will help to make the implementation of the proposal successful.\nI rated: 5\n", "q0r": 5, "q1": "The proposal has been in place since Q2 2022 and has created the project structure on Gitlab, PoC Ecosystem Map and project management structure on Swarm Dework & Discord. The work that has been done has specific evidence through the link. The implementation plan is a process that continues from the third quarter of 2022, actively in research and analysis, outreach across the Cardano and Ethereum ecosystems. Identifying NFT categories and clusters in the Ethereum NFT ecosystem, the formation of map integration took place in Q4. We can see the rationality in the detailed planning process, the work to be done will be solved to bring to the final product is to create a map of the Cardano Ecosystem and Ethereum NFT. In the plan we have not seen the implementation of interface design using \"intense focus on Visualization and interaction\" as the author describes the solution section. We expect the author to plan to implement UI/UX to improve the quality of the user experience on the buttons created. In addition to the fact that communication and marketing are not yet in the plan, it takes time to specify for this. The proposal has introduced us to show that the implementation team is the members who have clear information, competence and ability to implement the proposal. Members have a clear assignment in the implementation plan, capable of completing the tasks well. The required amount is $40,900 for the implementation of the proposal, the Budget Analysis table gives details, the hours of paid labor are appropriate, there is capital spent on marketing and communication. Cloud storage on AuraDB Hosting is paid $1000 for 4 months. The proposed amount of $40,900 is enough to implement the proposal, we also easily notice the amount is spent on the right purpose and as planned.\nI rated: 4\n", "q1r": 4, "q2": "We can trackthe development of the fully open source Ecosystem Map, which is stored on SwarmLabs Gitlab. https://gitlab.com/swarmlab2. The roadmap is clearly given with a time to implement, auditedthrough Dework & Discord Integration on Catalyst Swarm Discord & Dework Server: https://app.dework.xyz/i/0m6XgGE7wrVTyzZcV2Q6oR. Transactions and payments are both tracked and recorded in full through the Treasury & Catalyst Swarm accounting system on Discord & Github. \nhttps://discord.gg/6jk8mVuYqA. The author is committed to making regular reports and giving evidence of the process of implementation that helps us identify the work that is being done as planned. The proposal has the right metrics/KPIs to determine the success of building the Ethereum/Cardano Ecosystem Map and determine how many people will use the map. The proposed audit work is entirely possible.\nI rated: 5\n", "q2r": 5, "assessor": "z_assessor_3144", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 15210, "q0": "The proposers aim to carry out research in both Cardano and Ethereum NFT ecosystems to create a visualization and a report that highlights the most innovative projects. In that sense, it does meet the challenge goals and it’s probably needed for tying up any future collabs. What the proposal fails to explain is a) what constitutes an innovative project and b) why is it important to map these in the first place? Most importantly, however, the proposal does not even mention why anyone should care about NFTs. They are not just pretty images but can be used for various useful purposes. In other words, they can have utility. But this doesn’t come through in the proposal.", "q0r": 4, "q1": "It says AIM and Handshake have joined the project but there is no mention of them in the feasibility section. For a cross-chain project like this, it would have been very beneficial to have people from Ethereum as co-proposers. Moreover, it would be nice to open some concepts in layman terms and explain why e.g. AuraDB Hosting a) costs $250 a month (the Professional edition at https://neo4j.com/pricing/ is $65 so this must be for Enterprise edition), and b) why is it only needed for four months (what happens after that)? All in all the plan is a bit vague. Would have been good to read about tactics chosen to actually carry out the research and reach out efforts instead of just saying ‘research will be done’. Still, the proposers are known to be competent and can be trusted to complete the work.", "q1r": 3, "q2": "Catalyst Swarm is known to handle their reporting duties in an open, proactive and transparent manner. Their efforts don’t stop at the completion of the project but they plan to track and follow the effectiveness of their social media strategies, with the aim to reach thousands of people in Cardano and Ethereum ecosystems.", "q2r": 5, "assessor": "z_assessor_2156", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15342, "q0": "The problem is the lack of visualization tools and research on the relationship between the Ethereum Ecosystem and Cardano NFT. To solve this problem, the solution is to develop a map of the NFT Ecosystem of both Cardano and Ethereum, facilitating and increasing the interaction and awareness of the NFT Ecosystem. The team has begun to finalize the first PoC of the map and provide the access link. This proposal is a collaboration between ArgusNFT, Catalyst Swarm, Fluid7, AIM & NFT Guild and combines the skills, experience, and resources available to the team. If this proposal is successful, it will help projects, people, and communities from both Ethereum and Cardano quickly navigate the landscape of important projects and innovative developments. The problem stated and the intended solution presented in the proposal fit the challenge in a clear and logical manner\nIn addition, the proponent recognizes two main risks. At the same time, along with those two risks, the proponent has established a positive solution to reduce risks when the project is implemented.", "q0r": 5, "q1": "The proponent provides information that the project has been underway since Q2 2022 and that the goals to be achieved have been completed. It also provides detailed links for easy access and insight into what the team has to offer. The roadmap of the proposal is to be implemented in the next 3 quarters. From Q3 2022 to Q1 2023 shows the vision of the proposed team. Specific jobs for each quarter are listed. But what activities will be developed and in what order? How long will each action take to develop, who will do what? It would be nice if the proponent has a roadmap that includes a detailed timeline along with the project's work to be done. This will make it easy to track and ensure the work is completed on schedule.\nThe budget requires $40,900. In my opinion, the required budget is reasonable. We know what the budget will be used for, how much money will be for each job, and for each job the hourly rate is also different. each other, which shows the fairness and transparency of this proposal. In other words, the proponent also provides a detailed and reasonable budget table allocated for each job.\nThe team has 7 members, and each member's identity and experience match the skill requirements needed to do the work on the project. However, it would be nice if you provide some more profiles, attachments, or personal social networking sites like Twitter, and Telegram… so that we can understand more about what was presented.\nOverall, the overall plan of the project is good and workable. However, a few details can be improved so that the project can be fully successful.", "q1r": 4, "q2": "The community can fully track the progress of this project because the development of the Ecosystem Map is completely open-source, hosted on SwarmLabs Gitlab. https://gitlab.com/swarmlab2. The good thing about this section is that the proponent has provided several ways for them and the community to track the progress of the project. However, the minus point is that the group has not provided KPIs. So I can't determine how we will audit this project about the development process. My suggestion is that the proponent builds a roadmap with well-defined activities, involving very precise time intervals so that we can figure out what is being done and measure to see if the right thing is being done at the promised time.\nThe project's success is mentioned when a well-established and well-developed open source Ethereum / Cardano NFT Ecosystem map is launched, and the respective research report is published and both available. accessible and widely known by thousands of market participants in both NFT ecosystems. I think the proponent has clearly defined success but I need a number that is a bit more quantifiable than \"thousands of market participants\", the author needs to provide short and long-term goals for this number so that the community can understand the vision of the project.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15348, "q0": "The proposal in question does not necessarily launch a cross-network project, but rather aims to foster a more favorable scenario for the development of future innovative projects that use Cardano's blockchain. This would be done through a broader and more correct understanding of how the situation of Cardano and Ethereum blockchains is, we know how these blockchains grow at a fast pace and it is often not possible to have a good understanding of what is happening, for example, in the NFT scenario. Therefore, it would be very useful to develop visual tools that promote a greater understanding of the relationship between these two ecosystems; this would promote an understanding that is a prerequisite for designing truly influential projects for Cardano. Proponents state how unnecessary tribalism and ignorance get in the way of community members getting ahead, and I agree, it's not one group against the other. There is enough market for everyone, as most of the world economy is still centralized, but the migration to cryptocurrencies is inevitable, and the better Cardano is positioned within this scenario, the more certain it is that the objectives of the challenge will be met. ", "q0r": 5, "q1": "A lot of information is passed in the script part, the level of detail is adequate, my only suggestion is that the proponents had made a temporal division based on months, not quarters. This would increase our degree of understanding of what would happen and when. Talking about the use of funding, some parts are better explained than others. For example “NFT Community Reach - $4,200” why would that part have to cost that amount? In “Cardano Outreach - 25 hours ($40 per hour) + Ethereum Outreach - 80 hours ($40 per hour)”, we have more information, as we were able to understand the hourly rate required by these professionals for such tasks. The team presented conveys a lot of confidence, we know a little about each one, and we have people here who are highly involved in our community (for example, Felix is ​​the leader of one of the most important projects for our community, currently, Catalyst Swarm). Thus, the feasibility is good, with only a few points to be improved.", "q1r": 4, "q2": "There is nothing to be criticized about the auditability of progress, in my view it is perfect. We know many ways we could monitor the project. For example: by discord, by open source hosted by gitlab “SwarmLabs”, by ecosystem map, project management via integrations and etc. As much as it is all technical information, it is understood that both the development process itself (tasks) and the partial results will be available to the community at any time. Success is considered when “a well-established and developed open source Ethereum/Cardano NFT ecosystem map is released and the corresponding research report is published, and both are accessible and widely known to thousands of market participants in both NFT ecosystems.” ”. Now, proponents could have chosen one of the aforementioned media outlets to report on how this scenario would be demonstrated to our community. How to understand the impacts of the research, which projects emerged with its help, etc.; in general, how the objectives of the challenge would be seen in practice.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "An open source, interactive, planetair-based map of key projects in the Ethereum and Cardano NFT Ecosystems, and corresponding research report on related and unique projects in both ecosystems. ", "experience": "This Proposal is a Collaboration between ArgusNFT, Catalyst Swarm, Fluid7, AIM & the NFT Guild which combine their skills, knowledge, resources and Capacities for this project"}