{"id": 414515, "author": "benzvibenjamin", "title": "Students for Blockchain", "url": "https://cardano.ideascale.com/a/dtd/414515-48088", "category": 26598, "amount": 14400, "description": "There is still not enough students aware and knowledgeable about blockchain technology", "f6_no_assessments": 15, "f6_rating": 4.177777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 1616, "q0": "idea is a good one and a thoughtful proposal with which this challenge can be done. I believe the objective is to promote a healthy exchange and main challenge in favor of blockchain between Cardano and others, as the following excerpt states: \"Blockchain is future and will be fully implemented in our society in a few years, the main actors of Blockchain so students The project here is to unite from different Blockchains to contest the different projects and learn from other Blockchains. Our goal is to create a Blockchain community of students and promote blockchain to more students and university professors.” Our entire ecosystem is part of of the 3rd generation of blockchain and it is important to establish relationships - advantageous as well - between the entire cryptographic universe. Here, we intend to create a group where meetings would take place. The group would be formed by students, mostly. the starting point for the project would be the student of the “Grenoble Ecole de Management” school. from different social networks, in which they would be sent through social networks, which would be sent to some types of symposium, you could say, in which each meeting would be a presentation on blockchain. Research will also be carried out that will have to carry out the best results found in the blockchains. In theory, this is perfect, it is the exchange of information and knowledge in practice. However, some uncertainties may occur during the proposal, the impact of reading. mainly: how can we really draw students' attention to these events? It is an example here that links will be shared via telegram/discord by, it is also here that the best possible marketing would be done about the project; It would be important for more details to be given in relation to this marketing campaign, as will encouraging massive target participation. Mainly due to the fact that blockchain technology is not so widespread, making place where we are talking. How to obtain that there would be a participation of several groups, coming from different blockchains? Another question would be the structure of the meetings: would they all be online? All in English (since the students who will originate the project will be from France)? How these moments recorded? What will be the roadmap to be followed, that is, how can we ensure that the time is used in the best possible way and that all presentations maintain a quality standard? How can we give visibility to different blockchains? Another point that I was confused was in relation to the improvement research. what are the parameters, who would carry out this research? Will a professional get here? If so, how could you support students? Therefore, everyone considers that the idea is good and even with the proposed challenge, it can be more detailed in all aspects.", "q0r": 4, "q1": "The first few months of the script are ideas, we know what will happen in a very detailed way. Some activities are proposed, and these are very well explained, through topics on what should be done, for example in: \"some example tasks will be the following: Prepare a post to send to the different Discord groups and a complete list of Discord groups +send the message to the groups + Create the students' Telegram group + Organize all the monthly meetings.” As time progresses, however, the explanations get less detailed, we don't know what would happen specifically in November and December, as these months are covered jointly. It would be important that the same degree of specificity was maintained throughout the roadmap and that all activities were detailed as stable as possible (the same degree of depth for each). What I'm talking about would be: how would the intro presentations be prepared for each call? This would take place between November and December, but how? ro is not bad, but not ideal either. It gives us a clear idea of ​​what would happen, but not exactly how and when. Talking now about the requested budget, a total of 14,400 dollars is divided into some parts. These could be better explained: preparing materials to reach students would cost a thousand dollars, but what materials would these be (“prepare materials and Reach out for students in the Telegram groups of the blockchains: $1000”)? Posters, videos, illustrations? How many would there be, and who would work on it, dedicating how much time to the actions? Because managing each meeting would cost $800, what activities exactly would constitute that? Why is $250 needed to keep the Cardano community up to date on the project, and who would be responsible for this role? (“preparing a presentation about Catalyst project and keeping updated information about Catalyst & Cardano: $250 X 8 months = $2000”). We noticed that, like the script, the information is passed on in a basic way, it is possible to understand how the money would be used, but it is not so simple to judge the need for such amounts as they are not well explained. Finally, analyzing the group that will be responsible for the execution of the project, finally, thinking about the team, we are introduced to the duo that would compose the team, being Benjamin Ben Zvi, firstly; it is not so clear how involved he is with Cardano, he claims to already have experience with our blockchain and to be working together with a funded proponent (Shlomo Cohen), but it is not clear how he acts on his projects - if it is as an intern , or official team member, what tasks he performs, etc. In other words, it would be necessary to understand how he fits into our community. As for Yassine Jamou, he provides some information about himself, including his linkedin profile (which is always important), but it is also unclear if he has any involvement with Cardano (probably not, otherwise he would have said in the detail of the proposal). Anyway, I believe that yes, the proposal is viable, but some improvements would be necessary.", "q1r": 4, "q2": "The proponent provides us with a lot of information regarding auditability, but I believe that some improvements are needed, both on the part of tracking progress and on the final success. Talking about partial results, first of all, we know that some KPIs would be considered, such as “surveys will be distributed after each call to get feedback + we will see how many participants we have in each meeting and we will decide to maybe put more effort into marketing + number of people who join”. join the Discord/Telegram student group + videos posted on YouTube + number of views/likes”. This is important information, but I think more emphasis should have been placed on qualitative analysis here. That is, how could we actually monitor the quality of these surveys, how would they be elaborated, the questions that would compose each, etc? How would the bidder's work be monitored, how would we know if he was carrying out the promised activities for each month in the right way? What would this final report look like, from what content would it be formed? These are all very important and interesting questions; we must be very careful with both the numbers and the processes behind them. Talking about the final results, once again we have an analysis more focused on quantities - for example, we know once again how many students are expected for each month of progress in the project; Regarding the other achievements, I found them to be a bit abstract, such as “Lots of learning content provided on calls and then posted on YouTube” and “Having good feedback from surveys provided and private messages sent by students”. How could the learning content be considered adequate and of good quality? How can we ascertain student feedback? More importantly: how could we see in practice that this initiative has contributed to Cardano having a better connection and exchange with other blockchains? How can we verify that some of the topics mentioned in the challenge have been met, such as \"awareness and understanding, organization and governance, culture, diversity and inclusion, innovation and decision-making, collaboration tools and platforms\" and etc? analyzed and get to know our community, in a simple and direct way. Which could be done in different ways, such as the participation of the duo that manages the proposal in Townhall, the elaboration of a final research that includes all the information that we need to know, whether it's done through written reports, videos, in a detailed post on our community's communication channels (discord, telegram, youtube channels, etc.) based on what was raised, may it be perfect.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 13, "ne": 8, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 1133, "q0": "The proposer looks to facilitate virtual meetings with university students. Benji proposes that getting together with people that may or may not know about blockchain will somehow lead to collaboration that would satisfy the goals of this challenge. However, this is not the (unfunded) Scale-Up Community Hubs challenge; the proposer fails to convincingly address how this proposal leads to cross-chain collaboration. At best, superficial knowledge transfer occurs with the allotted time for the meetings and collaboration beyond these events is not incentivized by the proposer.", "q0r": 2, "q1": "The proposer has only been involved in Catalyst since this fund but wants to be the spokesperson for Cardano and Catalyst. This is fine, but also speaks volumes in that no support person that is more knowledgeable has been sought out. Under the feasibility, the proposer stated: “The timing of the funding is perfect as we start the student year in September.“\nThis relates to the detailed plan and is laden with issues. Not all academic years around the world - or even the Western world - start in September. With possible delays, I would not count on the first batch of funding before the first week of October. Nonetheless, the plan to spam discord and telegram sounds simple enough. In my experience as a former internet marketer, this is also a recipe for disaster and low quality engagement, especially if you are not known in the spaces you create unwanted noise.\nThe breakdown of the budget leaves questions open. What is the rationale to pay $1k for material preparation and posting to Telegram? Why then is discord missing from the budget?\nThe information of the three people who are working on this proposal is badly formatted and missing context in how the presented information relates to accomplishing the goals of the proposal.\nThe proposer indicates that he may not be able to finish the proposal, but “many students can help” to get the work done. This is not aiding the voter’s confidence that the $14.4k are spent on something that will actually be implemented.\n", "q1r": 2, "q2": "The numbers of students joining discord/telegram are not important to the community, as per the proposer’s impact description, the proposal’s value will come from the meetings. The metric may be useful internally to see what the success of the funnel looks like in getting the students into the meetings. Surveys are a good idea (and students are used to fill them out), but we don’t know how “quality of work” will be measured. Is it presentation skills or is it outcomes (e.g. collaborations initiated)? The latter would be closer to the challenge goals. If the goal is for some student to receive an A+, then this is not of importance to the community as it relates to the challenge goals. YouTube views and likes are vanity metrics as well. No amount of views will tell you whether collaboration happens or not - not even if people actually watched and understood the information presented.\nWhile the vanity metrics are easy to track, they are not telling whether the proposal is a success in terms of the challenge setting or even the more limited proposal’s goals.\n", "q2r": 3, "assessor": "z_assessor_2209", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1361, "q0": "Yes, this proposal effectively addresses the challenge by creating a blockchain agnostic group of university students at the Grenoble School of Management in France. \n\nThe proposers commit to using social networks, such as telegram, to infiltrate and recruit other students who may be working across different chains. Their goal is that by creating this space and doing the outreach, a diverse group of individuals will come together and participate in co-learning events. Overall, the idea is good and could have an impact, however whether it will actually achieve this is unclear. \n\nThe impact of this proposal will therefore be dependent on whether or not these individuals will want to participate. This is not to say that there won't be people who participate but whether they are from another chain or whether they want to engage in collaboration rather than just promoting their chain/project is unclear. ", "q0r": 4, "q1": "Yes, given the experience and plan presented it is highly likely that this proposal will be implemented successfully. \n\nThere are several strong points with the plan presented, the first being the level of detail and forethought that has gone into developing each of the objectives, tasks, and activities. The proposers do an excellent job at articulating exactly what is supposed to happen and when. \n\nThe second strong point here is the team behind the proposal is fairly well involved in Cardano and has direct connection with the institution where they will operate out of. This implies that they will be able to identify and make the necessary connections to help make the project a success. \n\nFinally, as the proposal is set to last about 10 months, the budget is more than reasonable for what is being requested. The budget is very well aligned with the extremely detailed plan and takes the guesswork out how and on what the money will be spent. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nAs mentioned in feasibility, the plan and budget are nicely aligned with clear milestones and deliverables. The community can easily track whether the events were held, how many people attended, and the feedback received after the event has finished. This approach will allow the team, and the community, to iterate and optimize for delivery. \n\nWhile there are some very good indicators, such as number of telegram groups the project is shared in, and the number of students in the telegram group and number, they do not necessarily make it possible to audit the actual success of the events themselves and whether they are leading to any cross chain collaboration. \n\nTo get that extra star here, there should be more concrete success measures. For example, what does \"a lot of learning content provided in the calls then posted on youtube\" mean? Do you mean all of the materials? Some of it? What portion needs to be uploaded to be deemed successful? ", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1738, "q0": "The problem statement offered is deceptively simple, but in the quite thorough description of the solution, the author provides a well-conceived plan for implementation. The alignment with the challenge is quite evident in that they wish to \"unite students from different blockchains...\" in the first 5 words of their solution. Clearly a fit for cross-chain collaborations. Well done, proposer. Voters will have no problem understanding the answer from this section. \n\nThe positive impact comes from building bridges (in the form of collaborations and friendships). Opening opportunities to other students and faculty alike about the work that can be done on Catalyst is also a value add for them both and the Cardano ecosystem.\n\nThe KPIs of increasing interaction between individuals from various chains, the potential to solve issues together, and contribute to the ecosystem are all solid indicators in which voters can see the value.\n\nIt seems that this will be a plan that can scale both in this school and potentially to many others who might use this proposal as inspiration for their own in the future.\n\nThe first two risks offered seem well thought out. The proposer may want to add to the last as it is a bit unclear exactly what the risk is there.", "q0r": 5, "q1": "The skill sets for this proposal are evident in the work that makes up the solution and plan. The team does appear capable of the task, though experience that fits all facets of the answer is not explained. One team member has no specific knowledge of Cardano listed in the bio in Feasibility, while the others do. If the one does have any, please do mention it if rewriting.\n\nThe plan is precisely what most voters are looking for and is a successful example of a timeline, actionable tasks from September to May in the same school year––all in the order of execution. Bravo. We assessors often wish for this much detail in proposals. Though not specifically mentioned, it does seem quite a money-saving feature that the meetings are all by video conference. The voters would benefit from knowing more detail about this. Will they be hosted on Zoom? Google Meet?\n\nA specific item to rework is: \"convince people that the blockchain technology is the future\" Perhaps it is better stated as: \"educated, like-minded individuals who have yet to learn about blockchain technology.\" This is a more attainable goal than \"convincing\" and will likely be your marketing target audience. \n\nIn contrast to the detailed plan, the budget is sparse. Please add more detail to explain the individual work of the 3 people, with an $ per hour price for their work, as required by the new budget standards in Fund 9. As a person with event organizing experience, the allocations do seem reasonable for the industry. Lastly, a contingency budget of 5%-10% is typical for such projects. Consider adding if resubmitting.\n\nPlease work on adding greater detail and transparency to this area in future submissions. For the lacking budget area, this section receives 3 stars.", "q1r": 3, "q2": "The roadmap provided in the \"detailed plan\" section is outstanding. It not only gives almost an entire month-to-month breakdown of actionable items but offers voters a display of all milestones the team hopes to reach on a time horizon that is quite obvious (one full 9-month school year, September to May). Great addition.\n\nThe metrics offered to track the progress of virtually all actions. These will be an excellent basis to start from. Other metrics that may be helpful would be an \"expectations vs. reality\" sheet for facilitators to fill out at the beginning and end of each month.\n\nThe KPIs define success and will allow the team to see the potential of submitting a similar proposal for the following year as a potential next step.\n\nAll video calls will be recorded and uploaded monthly. Voters will be happy to see the community will have access to such a verifiable piece of evidence of progress.", "q2r": 5, "assessor": "z_assessor_2261", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3004, "q0": "I always get excited when reading about new ideas to bring people working/studying on the blockchain technology together. This proposal rolls out perfecctly all the necessary details needed to be known in order to vote for something like that. I think that it is very likely to find volunteers to support this project, as well as students, which you referred to as a risk. Nice to take that into consideration, even though it might not be a problem at all, as newbies as well as other people trying to get involved on different blockchains will be keen on taking part in that kind of a project. It seems like the biggest effort to bring together those students from all Funds that have passed by now. For these reasons, i believe that this proposal will have a very positive impact on the Cardano ecosystem and it clearly articulates how it will add up value to it. ", "q0r": 5, "q1": "There is a very detailed plan there and I also find it very useful that the details for each month for the first couple of months are all clearly described. The budget is described in a clear way and has been broken down into identifiable items and seems quite reasonable. However, there are some key points that I would like to ask about. You mentioned the marketing and advertising part of the project but it not clear who is going to be responsible for that mission. I only can imagine the involvement of that one student that is studying business. I can also understand that the other two parts of the proposal are going to be implemented from people not specialized in something relevant to those tasks, but that also needs to be clearer. All in all, there is no correspondence between the tasks and the team members responsible for each task. The skills of the team members are there, i would only like to see a linkedin account for the 3rd member of the team, but that is not something that is likely to cost on feasibility. Also, be a little more specific when talking about the further funding that you might need. I have to take into consideration that it is a student that has rolled down the whole proposal and i have to be quite lenient when rating. ", "q1r": 4, "q2": "A time horizon and a roadmap with milestones are all there and that is something that is encouraging to ensure the auditability of the project. There are some key metrics and for some of them the proposer has also given numbers e.g the number of students for each month needed to consider this as a success. It would be even more useful to provide numbers for the other KPIs as well, for example, how many views / likes on the youtube videos will be needed? Also, consider providing a report more than one time along the project making. Last but not least, how is the community going to track the progress of the proposal? There is no specific link there. I think that it needs a little bit more work on the auditability, but all in all this project is a nice idea and a well described one. ", "q2r": 3, "assessor": "z_assessor_2385", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3437, "q0": "It is a simple proposal that addresses the challenge quite efficiently. By looking for students interested in different blockchain and putting them together to give presentations, collaborate and grow blockchain community, proposer can tackle challenge kpis such as \"On-chain activity growth due to new cross-chain implementations\", \"Number of technical implementations connecting Cardano to other blockchains\", \"Number of events / workshops / sessions arranged with other communities\" and others. The 3 Risks are also well identified and with a proper mitigation plan in place. The one thing that could be clearer here is what universities would be in the scope of the proposal. I understand the Uni proposer is in is part of it but it seems to be intended to reach more. This, however, is not affecting my score anyhow.", "q0r": 5, "q1": "There's a sensible time-framed planed with acitivities with good level of details in a way that it looks like proposer knows what he's doing. Budget breakdown is well done and matches the plan. The only thing that would be nice to have here is amount of hours it is intended to be spent in each budget line to have more transparency. I liked that advertising is really well contemplated both in budget and plan.\nAs for the team, there are 2 people committed with background in business and experience in Cardano. They both also seem to have a good contact network in their uni as they are members of associations there. Links are provided as refrence.\nAll in one, this project is not very complicated, there's a clear plan and proposer seems to have the skills to execute it well, so it seems feasilble overall.", "q1r": 5, "q2": "the kpis proposed are good and all of them have target. I liked that, in one of them (# of students in the group), the target is growing every 2-3 months, which helps to track evolution. It's also nice that feedback surverys will be done and a report will be issued in the end, which helps to improve the process and make it more replicable/scablable for similar projects. ", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 7091, "q0": "The proposer plans to create a student blockchain community through monthly presentation meetings and social media platforms (Telegram and Discord). The idea is by grouping students from different blockchains, they would learn from each other and sparks exciting conversations between them. It does fit with the challenge goal, which is to provide room for discussions between different blockchains. However, I can’t entirely agree with the proposal's impact because I think it's tough to find students capable of advocating blockchain technology. Maybe it's better if the students act as the participants. Meanwhile, the speakers are people who are more involved with the technicalities and development of those different blockchains. I think the student's blockchain community won’t get a deep understanding of many blockchains simply because they are also new to the ecosystem.", "q0r": 2, "q1": "As presented, I don’t feel confident enough that the proposal could be approved. This is unfortunate because I truly believe students have the power to spread awareness about blockchains.\n\nFirst, the proposal relies too much on believing that students from different blockchains will volunteer. While the (very excessive) 800USD  speaker fees might be a good motivator for students to prepare their presentations, there are no criteria for how the proposer would pick who would present something. It's a must to set a list of who are allowed to speak, maybe based on the amount of experience they have.\n\nThe marketing items in a budget section might be a bit excessive; perhaps the proposer should clarify how it would take 1000USD because, as far as I know, sharing links in telegram groups is free?\n\nThis leads me to the second point. It’s tough to imagine how the results will be because the proposer is picking the speakers after the project is funded. I firmly believe for sharing sessions to be effective, the speakers must be prioritized first because they are the ones who facilitate the transfer of knowledge. Therefore, not having the speaker's name hurts the feasibility of this proposal. However, this could be easily improved and reiterated in future Catalyst funds.", "q1r": 2, "q2": "The proposer defined the right metrics for what they are trying to implement. The proposer targets 30 telegram groups and 300 students by the end of the project. I think the amount they set is reasonable, considering there aren’t many students involved with blockchains. Perhaps another interesting metric to add is how many different blockchains they have gathered? It would be interesting to see which blockchains students are engaged in. Overall, measuring success and keeping track of the proposal is straightforward.", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9123, "q0": "This method, in my opinion, adequately addresses the problem. This proposal aims to bring together students from various Blockchains to debate and share projects, as well as to promote them to other students. I liked the general concept, the project proposal, and the given objectives and milestones, which looked fair to me not just for the targeted investment value but also for the complete project proposal. Furthermore, the project's concept and design are well-thought-out. There are several potential applications for this notion that should be considered in a longer-term perspective. The challenge goals aim to enable community events to enhance engagement, enroll new members, and develop new teams, among other things, and this proposal fits exceptionally well with all of those goals, delivering relevant KPIs to illustrate as much. They did an excellent job in terms of budget description, as well as identifying future risks that could jeopardize a successful implementation.", "q0r": 5, "q1": "The proposal specifies what must be accomplished at each milestone, as well as the dates and deliverables for each stage. The deliverables are all relevant for the development of the solution. The budget is then divided into four unique components that are realistic in order to accomplish the set goals. Members of the team have amassed a highly broad collection of talents and expertise across a wide variety of fields. Referrals from LinkedIn were supplied, so experience may be validated from that angle. Because a significant percentage of the money is spent on advertising, groundwork, and research, determining whether the values are appropriate is challenging because they are significantly impacted by the local environment. There is a timeline that explains the activities that will be taken, which I believe is realistic.", "q1r": 5, "q2": "In terms of auditability, the team outperformed themselves. The major milestones have been clearly explained, with two milestones indicated with concise explanations, so that the community understands both what will happen and when it will happen. The success criteria are adequate and important for the next round of funding; but, the proposed metrics, in my opinion, are difficult to assess. To minimize misunderstanding among future proposers, I recommend examining the metrics prior to the launch, if feasible. I agree that the success criteria and metrics proposed are adequate for tracking progress in tackling the problem.", "q2r": 4, "assessor": "z_assessor_3022", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9299, "q0": "\"I find this proposal to have a very good marketing strategy to promote Cardano to everyone especially students. This is great because students are the group with the best physical strength, thinking and health, so they will quickly learn the beneficial knowledge that the blockchain platform brings from which this young generation will bring blockchain to life. more developed. Blockchain is the future and will be fully implemented in our society in a few years, the main actors of Blockchain then will be the students today. I see the Project here unites students from different Blockchains to discuss different projects and learn from other Blockchains. This is a very good opportunity to create a Blockchain community for students and promote blockchain to more students and teachers of universities. \nIn Vietnam, FPT University is also gradually learning about blockchain to teach students, helping students get acquainted with blockchain. So I really agree with your suggestion.\nYou guys use Discord and Telegram as support tools to connect students, I think it's very convenient and cost-effective. The group also left a link to an example of a telegram that the group already had.\nRegarding the risks that the group may face, should give specific numbers to know if there are not enough participants?\nIf this project is implemented, I think the team's proposal will be easy to implement.\n\"", "q0r": 5, "q1": "\"The team came up with a very detailed plan. The month of doing what the team does lists very specific tasks that need to be done. Your team has given the gold and September funding time to start, which makes a lot of sense for students. is also starting a new term.\nThe budget given by the team should be more detailed. Besides, the members of your team are also listed in full, all of them are experienced people, and I can also access the members' information you provide. But you should provide the member profile is the same instagram or the same link.\"", "q1r": 4, "q2": "\"I think that when you describe a project's progress measurement as\nIf you want to see how many people participate in each meeting, you should have a specific target number so that it's easier to decide where more efforts can be put in marketing.\nWhat will be the student Discord/Telegram group participation? How many videos are posted on YouTube over what time period? The success of the group project has given a specific number, besides, the group can give the number of views and likes. It also proves whether the project is successful or not. This is a new project with a good idea but needs to be supplemented to make it more complete and to perform the best in practice.\"", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12393, "q0": "The proposal brought up the problem of the lack of awareness and knowledge about the blockchain technology. The proposed solution to this is creating a Students Blockchain community that aims to promote and discuss about different blockchain technologies to university students and teachers (primarily targeted at Grenoble Ecole de Management, a french business school) via monthly meetings and organized social media platform (e.g. Discord and Telegram). While this proposed solution brings value in terms of growing awareness and potentially furthering the adoption of Cardano, it doesn’t align with the challenge setting primary objective which is to focus on giving avenue for different blockchain communities to collaborate and share knowledge on their respective blockchain system. Overall, I don’t think this proposal fits with the challenge setting it was posted in, which is Cross-Chain Collaboration. ", "q0r": 3, "q1": "The team members involved in this project has provided some links regarding their skills and experience, such as their past experience as a funded proposer in past Funds. However, there are no team members that have previous experience with other blockchain system. To me, this is a pretty important point that is missing because I think it is crucial for either the founding members to have experience with other blockchain(s) or they’ve already planned which community they’re going to collaborate with. Though this point was addressed in the roadmap which state this project will start on September where the main objective is to find key students from other blockchain communities to collaborate with, I am still in the opinion that the key students involved with other blockchain communities should have already been scouted from the start of the project to ensure that the people involved with other blockchains have the relevant knowledge and ability to share with the community. The budget has been broken down quite adequately into each respective point of implementation, such as marketing, event organizing, and preparation for Catalyst projects. However, I do think some of the budgeting lacks explanation. For example, the proposer allocated 1000 USD to reach out to students via Telegram groups which to me doesn’t sound reasonable and the proposer didn’t specify what goes into the marketing via Telegram to warrant that amount of money. Overall, I’m quite skeptical over the feasibility of this project because of the points mentioned above.", "q1r": 3, "q2": "The KPIs chosen to measure the success of the project includes metrics, such as survey responses from participants, number of meeting participants, number of people joining Discord/Telegram group, and YouTube engagement (views, likes, etc.). I find these metrics to be adequate as a measure on how popular the activities are and the quality of meetings (by using survey). However, the proposer didn’t mention on how these metrics are going to be reported (what platform, etc.). I also would have liked if the report was done in a more frequent occurrence instead of only at the end of the project so that it can be tracked during the project implementation. ", "q2r": 4, "assessor": "z_assessor_3408", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12874, "q0": "Your proposal is geared toward students, and its goals include bringing together students from various blockchains to discuss and share projects, as well as promoting them to other students. Given these goals, I believe it succeeds in meeting the requirements of the test. Both obstacles and opportunities for development for both Students can develop a sense of community, gain knowledge, and, most importantly, spread information about the Cardano ecosystem to the general public by connecting them in various blockchains through the project. Students, with their fresh perspectives, boundless energy, and eagerness to learn new things, will be of great assistance to those of you who do not have a strong grasp of Blockchain technology. The author has outlined a method for students to connect with one another on various blockchains through the use of social networking platforms, and he or she will hold monthly meetings to introduce Catalyst and Cardano.\n\nRegarding the potential dangers that the project could run into, you have identified three of the most significant threats, in addition to the countermeasures that can be taken against them. As a result, I give you guys a score of five points for this aspect of the impact you could have.", "q0r": 5, "q1": "You have provided a comprehensive outline of the project development plan as well as the steps necessary for its implementation by outlining it in terms of a nine-month road map beginning when the project can be funded and proceeding through four main stages. And after receiving funding from Fund 9, you will have a plan, a plan for the next fund, to connect students from various blockchains. In my opinion, you should expand the scale of your operation. You are very well known, not only in the place where you are living but perhaps in some other universities, in some other cities as well as in some other countries close to France, because in your capacity there are mentioning Benjamin Ben Zvi, who can speak four languages fluently and learn three others. I am very impressed with you. local, not only in the city where you live, but possibly in other universities, cities, and countries close to France\n\nYou also mentioned in your proposal that you would use resources from other students to be able to finish your project on Catalyst, which is a good idea for outreach, especially the students. In regard to the budget, I believe it to be reasonable in light of the typical income you receive. Additionally, each component of the expenditures is broken down in considerable detail, because determining how well you can build and finish projects within your capacity is a very important factor. I give this aspect of the feasibility a score of 5 points.", "q1r": 5, "q2": "The measurement of the progress made on the project is a relatively necessary issue that calls for transparency from the owner of the project. You could come up with content measuring progress, but according to my own personal contribution, you should come up with and create your own social media channels, because right now I can't actually find them. You could come up with content about measuring progress, or your communication methods, such as Telegram or YouTube. Next is the success of the project with the numbers you mentioned, which is considered feasible, with approximately 300 students after 8 months, and if you can still maintain the discussions and apply for funding in funds next year, I think this will be a channel for students to connect, not only in terms of Blockchain but also in humanity and society. Next is the success of the project with the numbers you mentioned, which is considered feasible. This auditability receives five points from me.", "q2r": 5, "assessor": "z_assessor_3497", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14449, "q0": "The proposal plans to gather students interested in different blockchains for a meetup to exchange ideas and promote blockchain technology. It is true that blockchain technology has the potential to become prevalent and integrated into many aspects of life, just as what the Internet used to be. Therefore, the proposer emphasizes the importance of students becoming the facilitator of this technology, thus planning to create a blockchain community, first within universities. The proposer also sees potential of the students in his international French business university - Grenoble Ecole de Management. The proposer manages to give background information about the school (with illustration) - with a large number of international students, these students will have relations with other students from other schools and back in their homeland, where the idea of blockchain technology will get more exposure. Identifying this advantage, the proposal opens Telegram groups for students to discuss blockchain-related topics. Students from these groups will also have regular presentations as well as promoting this project into their universities. The impact of this project will be widespread among these universities and publicly as the monthly meetings will be recorded and posted to Youtube. The most visible impact of this project will be raising awareness among students about blockchain technology. With students from different chains to discuss with each other, their knowledge will become more profound as they learn from the differences, pros and cons of those chains. This is also a good way to introduce Cardano and the Catalyst project to people who weren’t used to them before. This may also spark cross-chain collaboration, helping to create more innovation and proposals that will utilize the Catalyst project. Therefore, the proposer manages to create the project that will make a contribution to the Cardano ecosystem. The main risks presented are reasonable and sufficiently addressed. The proposer is able to mention the lack of participation and mitigated this through professional advertisement and appealing content during meetings. Lack of professionalism and overcapacity are also mentioned and mitigating measures are also given. Overall, the idea of the proposal is simple, straightforward but seems to be promising.", "q0r": 5, "q1": "The timeline is clear - the project will start from September to May. The tasks for each period of time are detailed, with clear instructions. Not only does the proposal list what will be done, but also how to do it. The specification is good - informative, instructive but not too lengthy. For instance, in September, the proposal lists a step-by-step set of activities and the tools to help with organization (excel calendar). The budget is also clear. However, for parts such as “preparing presentation and keeping updates” ($250 X 8 months = $2000), the proposer should account for what determines that specific budget. This could be explained as salary given to presenters, admin per hour or other reasons depending on the proposer’s plan. The team members (3) include students from the business school and an experienced proposer. Two of them have experience with Catalyst and the Cardano community and one will be in charge of professional presentations and editing. Furthermore, they are all enthusiastic with Cardano and blockchain technology in general, which is positive for feasibility. The proposer’s explanation for the question of further funding really shows his determination to realize this project and give assurance about how the next fund will be in the right hands.", "q1r": 4, "q2": "The proposer is also able to give good key metrics for progress assessment. Some key metrics are quantifiable (number of views/likes, number of users in Discord/Telegram). Feedback is also collected through surveys. This shows many perspectives that the proposer will gather data from. A report will be given at the end of the project. There will also be deliverables - which are the recordings of meeting and presentation. The vision of success is also easy to assess since the proposer gives specific numbers that act as milestones for success (ex: 50 students for month 2-3) together with positive feedback and messages.", "q2r": 5, "assessor": "z_assessor_4055", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14671, "q0": "I find it quite interesting how the team's target audience is chosen, which is students - potential subjects to meet the challenge that not everyone sees. The proposal also gave specific data evidence that the project is entirely suitable and can meet the requirements of the challenge. The solution given is also quite detailed and satisfactory. The writer has shown the positive effects and direct influence on the Cardano ecosystem, which can be seen as attracting more people interested in and participating in Cardano. Although promising successes have been set in the future, I think it will be more convincing if you can add key metrics & KPIs.", "q0r": 5, "q1": "The proposal has given a fairly specific timeline of the work to be done but has not shown how the work will be done, and who is in charge. The expenses are reasonable with the plan, there are no extra expenses to help save the budget. Team members have experience with Cardano and operate in the business field, which will be a great advantage when implementing the project because they already have a lot of experience in the market. so they will have good control over the process and understand what users need, and what they have to meet. In addition, some members are fluent in many languages ​​(4 languages ​​and still learning 3 more languages), thus increasing the opportunity to interact with international friends, especially international students. economy, helping the project spread more widely", "q1r": 5, "q2": "Because the project mainly depends on the number of participants and the nature of their work, the proposal also only says that the survey will be distributed after the project is implemented. I understand it is due to the nature of the project but I think it is still advisable to give more time to achieve the goal or key metrics, specific KPIs numbers, so it will gain high confidence in the eyes. investors. The proposal gave an approximate number of users for a certain period, but I wonder if that number is enough to meet the project's criteria.", "q2r": 4, "assessor": "z_assessor_4081", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14752, "q0": "According to the proposer, currently, not many students have knowledge about blockchain technology. The team realized that it was necessary to have a connection of students from different blockchains to share knowledge and widely promote blockchain technology. This is a good idea and I personally support this project. The project promises to expand the community when it is successfully implemented.\nThe proposer represents the future vision of blockchain development and the desire to popularize blockchain to students. The functions and components of the project have been stated very specifically in the proposal. The proposers also outline how the project will be implemented. The target audience of the project is also stated above. It is the students who have not had access to the knowledge of blockchain technology. Readers can clearly see the impact of this project on potential audiences through this proposal. The proposal also details the technical side by giving examples of case studies.\nThe results that the project will achieve are based on the goals of the Challenge. The project supports the promotion of Catalyst and assists several proponents from different blockchains to make proposals for the Catalyst project. This attracts even more people to the community and helps expand the Cardano community. These results completely match the Key metrics that Challenge sets.\nThe team also recognized the challenges of implementing the project. Too few or too many community participants will also hinder the implementation process. In addition, the lack of professionalism is also a difficulty that the team will face. However, with those challenges, the proposers have offered solutions to minimize the damage.", "q0r": 5, "q1": "The project implementation plan is divided into 4 phases starting from September and lasting until May next year. The roadmap has broken down each piece of work for each milestone. The proposal provides a perfect timeline for completing each work item. This is a carefully calculated and prepared plan to ensure the implementation of the project. The plan that the proposal proposes is reasonable not only in specifying the tasks but also in setting standards for those tasks. The details of technical aspects such as architecture, language, and technology required to implement the plan are also mentioned in the proposal. However, I think the proposal should define the number of people needed to carry out the project and identify the key positions of the project.\nSimilar to the budget plan, the proposal also detailed the items that need to be invested. The budget that the proposal offers is quite reasonable. Proposers also present the budget plan in a clear and easy-to-follow manner. The items are presented in a bulleted format and are transparent about the amount to be invested. Based on the project implementation plan and budget plan, the community can appreciate the potential and ability of the project to achieve the set goals.\nThe project was carried out by 2 students who stood out for their achievements. Their industry expertise can lead the project to success and benefit the Cardano community.", "q1r": 5, "q2": "The success of the project is described in detail in the proposal. Those are quantitative indicators that show the results of the project. These numbers correspond to each job requirement of each timeline. Based on these numbers, the community can see that the team has seriously pursued the goals proposed by the proposal as well as fulfilled the desire to expand the Cardano community. The interpretation of the project's success is clearly stated by the proposal. That is a picture of each part of the work after it is completed. Through the proposal, the community can visualize the benefits and potentials that the project brings to the community.", "q2r": 5, "assessor": "z_assessor_4099", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 14823, "q0": "Getting the next generation of students interested in blockchain is always a smart option, since in the future, blockchain will be the thing that thrives, and the people who can accomplish it are students - later hold the destiny of society. By connecting students who share a passion for blockchain, the proposal will hold monthly meetings where students from different blockchains will represent and talk about the topic related to it. In addition, the proposer will also promote Catalyst and support some proposers from different blockchains doing proposals for the Catalyst project. Furthermore, the entire conference will be videotaped and uploaded to YouTube, which is accessed by billions of people every day. This not only assures a rise in Cardano users but also allows participants to establish a good understanding of the ecosystem before becoming a part of it. The author also provides a subtle and suitable response to predicted dangers. However, instead of just organizing a meeting, the proposer should transform it into a rhetorical contest. The winner will get a prize relating to the opportunity of participating in Cardano for a set length of time. This is able to encourage more individuals to learn about blockchain, and also at the same time encourages them to strive for the greatest product.", "q0r": 4, "q1": "The project has a lineup of participants who have the necessary abilities and expertise. Despite the fact that there are just two members and that they are still college students, I believe they will perform well. But, try to find more collaborators or volunteers to assist, because the quantity of work that will be done in the project is not that few, in my opinion. We have a plan organized into four major milestones, with particular duties explicitly outlined by the author. Furthermore, I appreciate that the proposer specifies the major goal of each phase as well as the activities to be performed, which is something that seldom projects do. The project's budget is also offered in an easy-to-understand format. However, there is an item that says marketing and advertising, but there is no amount of money that needs to be spent. If the proposer wants to use the money for this, please recalculate the whole amount of capital raised, or if you tend to utilize the relationship or aid from the student union to identify like-minded people, please explain clearly to the voters.", "q1r": 4, "q2": "The author has prepared this part nicely and it is simple to grasp. Every month, we gather the number of participants or Telegram groups. As we can see, members of the team have established a target for themselves in order to inspire themselves to work hard and provide voters with an overview of the project's performance. However, we do not have a definite time frame for the project's development progress. This will make it difficult for investors to maintain track of the project's progress and appropriately judge whether or not it is completed on schedule.", "q2r": 4, "assessor": "z_assessor_4104", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Unite students from different Blockchains to discuss and to share projects and promote it to other students", "experience": "BA business student in Grenoble school of management\nPart of the Cardano community\nWorking with funded proposers : Shlomo Cohen\nCARICATOR ADA \nUnited Caricature\nCollaborating with Razali Samusudin and Cole Bartlett from the Catalyst school and\nwww.sustainableADA.com"}