{"id": 414712, "author": "argentinianminer", "title": "MAYZ: Cardano Cross-Chain Index", "url": "https://cardano.ideascale.com/a/dtd/414712-48088", "category": 26598, "amount": 65000, "description": "The vast majority of crypto users don't have direct exposure to Cardano. Managing a well-diversified portfolio in a different ecosystem can be both time consuming and risky.", "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 3261, "q0": "At root, the idea here is to allow a non-cardano based investor in other blockchain ecosystems (in particular EVM) to never leave the comfort of their homechain when adding to their portfolio a basket of Cardano native tokens and assets.  Handled entirely through smart-contracts that this proposal seeks to fund the development of, this has clear benefits to both Cardano (more exposure for CNTs) as well as this challenge setting specifically, in the creation and leveraging of x-chain bridges.\n\nThough the team describes the core mechanism as an \"index token\", investors may recognize more the qualities of an ETF in this proposal, and since liquidity plays such a big role in ETFs, it is worth mentioning here.  The whitepaper for Mayz (which is still in a development cycle that falls under the budget ask for this proposal) actually talks about liquidity quite a bit, which is a good sign, IMO, since most of the risk associated with this kind of an investment is expressed in the bid-ask spread, which is a function of the underlying liquidity, or market, for the held assets.  When the spread is wide, it means that an investor will have trouble getting in and out of the assets.  As it correlates to this project, the \"index token\" value will express that spread and I would have liked to have seen a little more detail regarding the minting and burning protocols beyond just a workflow description:  there is a whole layer of undescribed governance for this index token that would be useful to know, but is probably not critical to whether the impact can be realized or not.  They do indicate their early approach to dealing with this issue, and it is a kind of dependable, if brutish, method:  they will overcollateralize the underlying asset pool.  Essentially the AUM will take any early losses, which is a plan, but is probably more the concern of its eventual ISPO investors and early token holders.\n\nIt is worth mentioning that this platform has a built in interesting scaling opportunity that the team hasn't mentioned.  Typically for any kind of an index fund or ETF, one of the trade-offs for investors is the loss of control and granularity that comes with the broad purchase of a sector index.  The team's quality experience building not only DAOs (RATs and Aldea) but DAOs based around asset ownership and governance, is a natural fit for creating a swarm protocol for structuring the index, shifting sectors in real time, and setting collateral requirements.  I saw no mention of the creation of such a DAO structure, but the potential is certainly there, and it would increase x-chain collaboration even more, allowing those outside the ecosystem to experience the benefits of Cardano's community and governance layer, one of its strongest points.\n\nDespite missing a few pieces of information that would have helped me see deeper into their idea and protocol, I do believe that the team has effectively communicated the impact and alignment of the MVP they are seeking to fund, and so I give a full 5 stars for Impact.  (Quick note:  for those wondering about legal implications of anything resembling an ETF, that is only an issue if they were looking to onboard users of legal tender...crypto to crypto shouldn't be a problem.  Yet.)", "q0r": 5, "q1": "I mentioned above the team's experience setting up asset-backed DAOs, so this proposal really seems to fit into their wheelhouse.  In particular, despite the wideranging implications and potential described under impact, this is a very straightforward funding ask that seeks to fund tools for what they are already doing.  The smart contract development makes up the bulk of the tooling, but they also are looking to fund the completion of the web portal and documentation, as well as the bridging mechanism.\n\nAnd here is where things get interesting to me.  They note in their risks that they are dependent on third party bridging, and so will work to create their own bridge.  However I see no mention of the risk this entails.  These bridges are the number one attack vector for crypto, and all of the major hacks you have heard of were probably to bridges.  This 3rd party dependency is actually a benefit at this point, as these bridges have been audited, and have strong track records.  They certainly aren't a critical area to pivot away from without reasons beyond dependency.  To this end, has the team explored the idea of liquidity swap protocols, and avoid the bridge altogether?  The idea behind a \"white label\" swap is that a token project (such as this index token) can provide all the liquidity on one side of the ecosystem (which is what their overcollateralized asset pool is....a liquidity protocol).  I would have liked to see in the budget breakdown (which was clear and reasonable) more time for research and not just analysis of the 3rd party bridges.  Looking into things like Ferrum's multiswap protocol could be leveraging partnerships in the community and pivoting away from one of the biggest risk factors in the whole project.  \n\nBecause this bridging issue is such a core piece of the MVP structure, and of the funding ask, I'm unfortunately going to dock one star.  However, because the team seems ideally suited to take on this task, and because it is expected that this MVP will need to pivot and iterate in its development, I see no reason for any further markdowns.  4 Stars.", "q1r": 4, "q2": "There are a few issues in the auditability section, some related to clarity, some to misalignment and some to follow-on.  To begin with, AUM has been included as a way to gauge and measure the progress of this MVP, but the proposal hasn't made any context for this measure clear.  It would be nice to know if the numbers for tokens UM and $AUM and TVL (and the TVL mechanism really wasn't described well...is it a yield protocol of the Index token?) are large or small...just some included perspective.  \n\nAdditionally, like the TVL, the measurement for governance tokens kind of comes out of left-field...  there is clear need for governance of the utility token, but this is really the first mention we have of this function (I figured, in reading the proposal and whitepaper, that governance of the utility token would be set by the team within some hard limits and later a more robust protocol, possibly rooted in stakeholder governance, would take over.  But for the MVP, I didn't feel that this was on the roadmap).  Thus, there is no context here for understanding what is being measured by the 500.  \n\nThe mint and burn lead time numbers are indicators of the quality of the smart contracts, and make a decent KPI for measuring the impact of the contracts, but another metric to include would be how many executions the contracts do.  It also isn't clear if they measuring the bridge contracts here...it seems unlikely as the \"optimistic\" model of protocols like Nomad have built in time measures that are used to allow the system to respond if even one node identifies fraudulent activity.\n\nFinally, the Project Managment KPIs seem the most relevant (deliver smart contracts, deliver bridge integration), but it also inlcudes an audit, which is mentioned several times as not falling under the terms of this funding proposal.  \n\nBecause the team are well-known DAO founders with large communities, and have shown transparency and availability in that role, I believe they will be answerable to this community for this funding.  Unfortunately, I think the auditability section of this proposal has some weaknesses, and hasn't highlighted the intent or method for tracking development progress on the contracts and integration.  If your only datapoint is the delivery of the product, there will be difficulties encountered in updating the monthly reporting.  The lack of context for several metrics and the irrelevance of others leads to a sparse auditing profile, even though the team is likely to be up front and transparent through the process.  I'm rating this section 3 stars.", "q2r": 3, "assessor": "z_assessor_2436", "no_vca": 3, "ne": 3, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 3005, "q0": "I think that is a proposal that will have a rather great impact on the Cardano ecosystem as more people outside of Cardano blockchain can easily get familiar with the whole concept and can start investing without having to worry about selling and buying tokens constantly on different blockchains. Also non-investors will face no difficulty coping with all the different ecosystems. It is pretty clear that the proposed solution will address the Cross-chain challenge. One thing I would like to question the proposer is about the risk they referred to considering the Plutus devs. There are two cohorts that graduated successfully from the Plutus Pioneer Programme and not all of them have been exploited by now. You may consider getting in contact with them, or if you’ve already done this, you can refer to the Marlowe Pioneer Programme taking place at the time being, where the attendants are, in their majority Plutus devs. All in all, i think that this proposal will add value to the Cardano ecosytem indeed.", "q0r": 5, "q1": "The proposer has great knowledge of what this proposal needs in order to be implemented successfully. In my opinion, it would be better, would you be more clear about the last two months of the proposal, as it will be going on for about 4 months and the funds that you are asking for apply to all 4 months of the proposal. As shown, it should be clear enough where the fund requested is going to be exactly allocated for the voters to be sure about the success of it. The budget breakdown is absolutely clear on the spreadsheet provided, which I myself consider a great idea to describe it within the proposal template. I also find it useful, the fact that you state the future auditing of the smart contracts that will be written in the next couple of months. I don't think that the funds for this audit should be stated at this stage indeed, as it will be something to worry about probably on the next Fund or so. The Linkedin profiles of all the involved members are there, which is also very useful, making this proposal very likely to be implemented. All in all, i think that the proposer has done great work on describing all the necessary stuff. ", "q1r": 5, "q2": "The team involved in the proposal seems to have a sound understanding of their target audience through their continuous involvement in the Catalyst and Cardano community. Regarding the ways to measure the success of the project, we see that the team was very detailed and chose very precise ways to measure the engagement around the proposal.  The proposer communicates what success will look like with seemingly reasonable numbers about the liquidity, the number of token Under Management etc. Milestones in the roadmap and a time horizon are all there, so i do agree that this progress is auditable by the community. ", "q2r": 5, "assessor": "z_assessor_2385", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6097, "q0": "The proposed team found that the majority of crypto users do not have direct contact with Cardano. Managing a diversified portfolio in a different ecosystem can be both time consuming and risky. The team proposed the idea that the Cross Chain Index would represent the value of the Cardano ecosystem very accurately. and available in other blockchains for users to get it directly from their regular native wallet. The proposal is good and perfectly suited to the objective of the challenge, and is described in detail and richly. To achieve its vision, the Team will create a multi-chain decentralized protocol whose smart contracts will run on Cardano with one-click tokens, easy to connect to storage chains like Ethereum and Polygon. Cardano index tokens are managed by smart contracts on the Cardano blockchain. The team will build a smart contract that allows buying and selling of tokens and can receive $ETH in exchange. Besides, the author of the proposal also recognizes the possible risks. At the same time, there are solutions to minimize risks when the proposal is implemented. Increase confidence in the success of the project.", "q0r": 5, "q1": "The proposed team outlined a clear and detailed plan. Milestones are set for the quarters of 2022 and 2023. and in each quarter are detailed the work that needs to be done, to the success of the project. With the schedule sheet provided, we know all the work to be done and in what time period. And which jobs have been completed, and which are in progress. Next is the budget. The proposal asks for $65,000. In my opinion, the value requested is quite reasonable given the complexity and time of the project. The Proposal Team provided us with the total budget to be divided among the Smart Contracts; Bridges / Oracles; Marketing. Besides, the team also provides a very detailed budget table that is broken down, reasonable and transparent. expenditures are divided for each stage, task, time... Finally, about the team of proposed team members. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides a text presentation about each member, and attaches a link to let us know more about the history and experience of the members that the proposal has presented. In general, the plan of the proposal is very good, the budget is transparent and the members are skilled and experienced, increasing the feasibility of the proposal. Proposal is highly feasible.", "q1r": 5, "q2": "The proposal has a plan to successfully implement the project in a transparent manner. Detailed step-by-step roadmap and budget breakdown for easy audit and successful project progress. Although it is a completely new proposal, it has shown the experience and expertise of the team, increasing the sustainable strength of the project. The proposed team provided them with many ways to track and measure project progress. AUM (Assets under Management): Assets under management. Mint : the process of putting a data inside the Blockchain system, the data exists on the blockchain and is publicly viewed. That means we can track in many ways how the project will develop, and we know what value it will bring to the community. And the final product is what is expected, the success of this project. Since we are provided with a lot of information, I believe that information is complete and satisfactory has been established. The proposal has good auditability and transparency.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 7604, "q0": "This proposal does generally address the challenge that is described in this fund. This is a very interesting and ambitious idea. Not only are you attempting to introduce native Cardano investment indexes to the ecosystem for native users but you are also attempting to bridge this protocol to other blockchains to allow for users to use their native cryptocurrency in order to expose themselves to Cardano native assets. As an assessor I am interested in how you plan to integrate cross-bridge settlements into the described protocol. There really isn't any explanation of exactly how this will operate. With that being said, if you are able to execute this protocol successfully then this product could become an excellent means of exposing non Cardano users to the Cardano blockchain without their need to do all of the leg work (set up a wallet, purchase ADA, etc...). There is a lot of work on the users side for onboarding new users and that work becomes even harder when you are trying to get users from other chains to migrate. People become comfortable with their main blockchain's ecosystem and lose interest in exploring other blockchain financial opportunities and applications. \n\nJust so I am clear here, the way I read this proposal is that this product will be available to native Cardano users and users of other chains. This is not exclusive to users of other chains? If it is exclusive, then I would make that clear. \n\nTo address the risks that are outlined in this proposal, you state that for the issue of Oracles that a mitigation for this is to develop your own oracle. I would like to see more detail on this process and the confidence in this solution being developed. This is a large task and as an assessor I would like to see the detail of this development outlined. The same sentiment goes toward the process for creating your own bridge to other chains. \n\nOverall, I believe the aim of this project is attempting to achieve something unique and innovative that bridges Cardano to other blockchains.", "q0r": 4, "q1": "For a project as extensive and complex as this, the feasibility of completing it is important to consider. The timeline for this project is well detailed and shows that there is a plan in place in order to launch the protocol. A lot of these timeline milestones that are listed are somewhat irrelevant since they were executed in Q2 of this year. The important milestones to focus on are the ones that are relevant to the Catalyst proposal. These are the Q4 2022 and Q1 2023 milestones. \n\nWhen it comes to the budget I appreciate the link t the google spreadsheet that shows the breakdown of each section. This is well done in all honesty and shows that there has been a conscious effort to get an exact amount of funds requested and it also shows that these funds will go to exactly building this protocol. The only concern I have is that there isn't much detail on the individual team members. The LinkedIn profiles help but I'd personally like to see a longer description of some of these team members and how they are going to contribute to the product.", "q1r": 4, "q2": "While I think that the key metrics described in this section work for analyzing the health of the protocol, you will also need to monitor KPIs for the use and traffic that you will be receiving from your users. Website traffic, tokens minted, social media interactions, etc... are ways to monitor the level of interest in your protocol. These types of metrics should be listed out in this section. Additionally, will there be a test-net/beta phase of this application? If so, I think it is important to have your test-net users give feedback to you via some sort of form / survey. This can also be used to describe auditability of your protocol. \n\nYou describe success exclusively as bringing people from other blockchains to Cardano. I would also think success for this project would be the response from the Cardano community itself. I understand that the main goal is to bring people over and that is the point of this challenge but I also believe that the Cardano community and their response to this product should also be seen as metric of success.", "q2r": 3, "assessor": "z_assessor_2907", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 15153, "q0": "The MAYZ: Cardano cross-chain index proposal addresses the Cross-chain collaboration challenge by creating a multichain decentralized protocol. Smart contract with single click index token bridging to host chains such as Ethereum and Polygon. With MAYZ Index Tokens, it’ll be possible for token holders to buy a share of a basket of Cardano tokens.  This will allow Ethereum users to directly invest in the Cardano ecosystem without the need to setting up a wallet. The key solutions of this proposal is 1) a cross-chain index (represent value of cardano ecosystem that users in other blockchain can get it directly form their regular native wallet) and 2) the Cross-chain investment that will facilitate the purchase of tokens. The team has already working with Life Network on the branding and technical consultation. The team has identified project risk is to locate reliable oracle, dependency on third party bridges and hire Haskell/Plutus developers but also finds way to mitigate those risks.  As the goal of this cross-chain collaboration is to enhance the existing collaboration between chains, the MAYZ cross-chain index will bring exposure to non Cardano investors and provide a diversified portfolio of Cardano assets. One of the examples in this challenge is “Oracles and other tools to interpret and interact with cross-chain data” which partially explains what MAYZ is trying to achieve. The MAYZ: Cardano cross-chain index fits the challenge very well.   ", "q0r": 5, "q1": "The timeline of this project spans from Q4-2022 to Q1-2023 (mainly for development and marketing activities). The budget breakdown of $65000 is for 3 main parts: smart contract $30,600, bridges/oracles 23,400 and marketing 11,000 (excluding audit). Based on their roadmap, most of their main activities for Q2 should have already been completed. It is unclear if their ISPO launch for Q2 had already been completed and it would be helpful if the team could share the link location to show that the ISPO launch is still on track as I couldn't find the ISPO detail in https://mayz.io The team has attached the detailed budget breakdown in the embedded link. The team has also provided team member LinkedIn profiles. The fund will be for their MVP: the first Cardano Index on ERC-20 blockchain. The team has done a great work in the budget breakdown and it would have been a full mark if they would update their ISPO progress. ", "q1r": 4, "q2": "The team would view this project as a success when there are a healthy number of addresses actively transact in MAYZ index token, more non Cardano investors awareness in this index solutions and other users and investors from other blockchains are brought into Cardano. The team has a comprehensive set of key metrics to track progress in term of AUM, token under management, TVL, number of addresses, mint lead time, burn lead time and the completion of smart contract v1 deployment, bridge integration and external audit. The team has provided the web link of MAYZ as the dedicated site for project tracking. I would suggest the team to create social media profile e.g. twitter or telegram for the protocol as the awareness in index solutions is a core element to the success of this project. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15339, "q0": "The idea is very complex and fits perfectly with what is sought in the challenge. We need to promote exchange between users of Cardano and other blockchains, and a great way to do that is through technology solutions that meet the needs of users on other chains. It's really a problem that Cardano doesn't have good exposure to users from other ecosystems. So creating a cross-chain index, in which a decentralized protocol will be made for smart contracts to run on Cardano is very necessary. This would be done through hosts such as Ethereum, a most famous and used blockchain, can be a gateway for new users to become members of our community. Once these people know Cardano and its differentials, I believe the migration will be done organically, since our blockchain has several advantages (for example, better prices on transaction fees).", "q0r": 5, "q1": "Despite the proponents attaching some links to the script, I found the explanations too short. I would like you to tell us in more detail what would happen as each month goes by, and not just in a more superficial and quarterly way. As information is passed on, our understanding of the development process is only basic. The detailing of the budget is also very superficial, as we can see in the section “Smart Contracts (*): u$s 30,600 + Bridges/Oracles: u$s 23,400 + Commercialization: u$s 11,000”. Why does each of these parts cost that much? How much time would the respective professionals dedicate to these tasks? What is the price of working hours? The final part, the team presentation, is the best, despite not being long explanations, we have the basics to understand who the team members are and trust their abilities to execute the project. Feasibility is ok, but could still improve.", "q1r": 3, "q2": "Some metrics are suggested for tracking progress, such as “AUM = Asset under management: 2,000,000 + ADA Number of token under management: 20 TOKENS + Secondary Market Liquidity: 250,000 ADA (TVL) + Address number (holders) of governance token): 500”, etc. The problem here is that this is only about the partial results, not just about the proposal development process. What would the daily work of those involved be like, the duties behind these small successes? I think the best topic that can sum up auditability is “More accessibility to Cardano exposure increases adoption among users who wouldn't know about Cardano's interesting design without this attractive index solution”. However, how to make this scenario of success possible to be proven? We would need to know how all this would be demonstrated to our community. Ideally, the proponent would list some new Cardano users, and even cross-chair projects generated from this proposal.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "A Cross-Chain Index will represent the value of Cardano ecosystem in a very accurate way and be available in other blockchains for users to obtain it directly from their regular-native wallets.", "experience": "Founders of Rats DAO, Rats Lab and ALDEA.\nSPOs of 1MATE and FALCO.\nCreators of \"Bitcoin Para Todos\" Spanish Podcast."}