{"id": 415122, "author": "cryptoloops", "title": "Creating NFTs & Gaming Cross Chain!", "url": "https://cardano.ideascale.com/a/dtd/415122-48088", "category": 26598, "amount": 25000, "description": "The current problem is that there aren't any great methods or groups facilitating of interoperability of NFT ecosystems between the Cardano and other blockchains!", "f6_no_assessments": 6, "f6_rating": 3.8333333333333326, "videos": [], "media": [], "f6_assessments": [{"id": 1631, "q0": "This challenge aims to promote the exchange between Cardano and other blockchains, in order to expand and benefit our ecosystem, so that it becomes more widely adopted and consequently firm in the cryptographic market, as is present in the fundamentals of the challenge: “this is an open challenge that welcomes any proposal aimed at collaboration, co-innovation and interoperability between chains. These can be any community-led projects, initiatives, solutions, tools or services”). Fluxus is an alliance of NFT and Gaming, the proponent claims that this alliance will create “a more structured environment where they [other blockchains and projects] feel comfortable with the switch and have the help and resources they need (reason and method) to carry out this task [of migrating to Cardano or relating, at least]”. What would that environment look like, and what kind of structures are we talking about? How can we ensure that the parties involved are truly encouraged to turn their attention to Cardano, transferring their technologies to our blockchain? The proponent says that he will use coding and management resources from Fluxos to promote the migration to Cardano, but he also does not explain what these resources are, or even how they can be used for this purpose. A major obstacle to be faced in this project is, as the proponents themselves recognize, drawing the attention of other projects, motivating them to migrate to Cardano. Proponents say this interoperability will be facilitated as the team is ready, having the resources, to accomplish this task. Once again, it is not made explicit what these resources would be. How can we be sure that some of the various use cases will be developed, for example “new technical implementations connecting Cardano to other blockchains and vice versa (SDKs, APIs, bridges etc), governance ideas of other chains implemented as part of the roadmap Voltaire, already successful projects expanding from other networks to Cardano” and so on? That is, through the various examples cited, I believe that the proponent has a proposal that aligns very well with the objectives of the challenge, but it is not explained and argued how this work would be done in practice. In other words, we have the theory, but it's not clear how ideas would turn into actions. Because of this, I believe that the impact of the proposal is compromised; In order for this situation to be resolved, it is enough for the proponents to attach more details and explanations in the impact part, expound on how such concepts would be seen in practice in the daily work, in the development of the project itself. With that, I will give a neutral note to the impact, as much as the idea is aligned, without a solid notion of how everything would develop, the impact generated is greatly impaired.", "q0r": 3, "q1": "Talking about the development process itself, the timeline is divided in a way that in my opinion does not make room for so much specificity, that is, the temporal division could have been in smaller intervals, so that we had a more detailed knowledge about how each phase would progress. An example I can give is Q4 2022: “Q4 2022: Migrated at least 2 projects to Cardano and continued marketing and outreach to non-Cardano blockchain projects.” We know that the objective is that at least 2 projects have been migrated to Cardano, that the marketing is being well executed, so that the alliance is as well known as possible. But for example, at what point in the last 3 months of the year is this goal expected to be met, and how can we verify that advertising is being done with the planning and quality thought through? In reality, there is not much detail on what advertising would be like, in my opinion it is important that this is well defined, since it is the heart of the project; our main goal here would be to promote an advantageous exchange between Cardano and other blockchains, for this it is necessary to have several projects relating to the alliance. For that reason I think this part is super important for this project (it's always something relevant, but in this case even more), and deserved further explanation. When it comes to funding, $25,000 is requested, the amount being divided into 3 parts: coding, marketing and project management: “coding: $15,000 (~130 hours @ $75/h) + marketing/reach : $6,000 + Project Management: $4,000 (~80 hours @ $50/hr)”. Regarding coding and project management, explanations are more appropriate, as we know the hourly value of the professionals involved in the respective parts. As for marketing, $6,000 is reserved for a lot of arguments. How would this value be used in practice? Again, what would the advertising campaign and strategy look like here? Finally, analyzing the team, this part deserves to be highlighted, we know very well who they are involved, their names, linkedins and CVs. For example in the case of Alex, we have a wealth of information about who he is: “Game Design: Alex is the head of Game Design and Co-Founder of the CNFT Alliance. He has worked as a creative director at Ubisoft's campus and as a lead developer of Faith and Honor Barbarossa. He has considerable experience researching psychological and neurological sweet spots in game-based learning. With over 4 years of experience in game design, Alex is geared to bring the best gaming experience to Cardano”. We were able to understand what his trajectories were up to then, so there is a lot of confidence in them, in their ability to make this project happen successfully. This gives a lot of confidence in the team, mainly because they have attached links where we can see what is being said in practice and also because they are very active members of our community. That said, I think this topic is fine, just some improvements regarding temporality determination and more explanation about marketing would be very beneficial.", "q1r": 4, "q2": "Progress, according to the proponents, would be measured by the number of projects migrated to Cardano and also by the impact of these migrations, as is clear in the excerpt “The biggest measure of progress will be by the number of projects we have in the process of migration or migrated with success for Cardano. Furthermore, the impact of these migrations can be measured by the amount of assets (both FTs and NFTs) these projects bring or the value in ADA, ETH, USD or other blockchain assets. Overall, we will use highly quantifiable metrics to measure the level of project success.” This last indication could be perceived by the amount of active tokens or even fiat money brought with these projects. I believe that these are the most practical and direct ways of measuring success, in fact, but in my view it is not enough for this to be fully contemplated, for this auditability to be properly promoted. In my view, it is important that other aspects are also studied, such as: how did Cardano become more respected and credited in other blockchains, based on Fluxus actions? Could some user-focused research be done to collect these questions in a verifiable way? How can the work routines of those who are part of the project be monitored? I think there was a lack of a more complete view of the whole, an analysis beyond the numbers. I believe that it is necessary that these complements are made, and that all the material generated is directly informed to the Cardano community. Speaking of final results, once again the proponents focus mainly on numerical data, when they set a target of 2 to 8 migrated projects. But it is important to understand more deeply the impacts generated by this alliance, as I mentioned with the partial results. They also comment that it would be considered a success “to have a standardized and easy method developed to bring other projects to Cardano or create interoperability would contribute to the success of the previous point and would be indicative of future success of the project long after Project Catalyst Funding”. How could we know if such a method was really developed and if it is as effective as it is proposed? How can it be proved that the objectives of the challenge would have been safely achieved? My suggestion is that you do more extensive research and maintain direct contact with the community, through, for example, discord channels aimed at discussing funded proposals, or even participating in breakout rooms after Townhalls. Thus, this part of the proposal would be better contemplated. As it is presented to us, the data is important, but it does not correspond to everything that should be monitored, such as the development process and the final results of this project, so I consider this topic to be a principle of auditability to be monitored, but does not fully correspond to what must be done.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 9, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1048, "q0": "I find the team’s bigger vision of their proposal to be a very good starting point for the Cardano ecosystem. Helping other projects cross chain on Cardano to take advantage of all the blockchain's benefits is a needed implementation.\nI see that the team is highly skilled in the game dev sector and I assume that their intent is to help other teams move their NFT gaming projects on Cardano, although, I did not find that specified anywhere in the proposal. I understand the team will offer “coding and management”, but what does that concretely mean? Do they offer minting services? Will they help port NFTs from other blockchains to Cardano through burning, locking or any other solution? It would have been so much more helpful to give some concrete examples, beyond some generalised descriptions like “Fluxus will be the gateway” or “Fluxus’s goals are to not only provide value to the Cardano Ecosystem”. Let’s assume I’m a project creator wanting to move from ETH to Cardano, I would find this project’s website but I would be unclear about what exactly I would be paying for. These questions are very important to answer from the beginning, so that the project can become more personalised, in-depth and time-efficient. It would not only help just the Cardano Community vote for this proposal, but in the future, it will help the team attract potential clients faster.\nSince I’m not exactly sure what this project is about, I would suggest to the team that maybe if they’re not funded in this round, they should come together and make a list of the things they are willing and capable to help other projects with, and after that is cleared out, rewrite the proposal and resubmit it.\n", "q0r": 2, "q1": "As I mentioned above, the type of projects to be onboarded and the type of services that this team will be offering are not clearly specified, as such, especially in the feasibility section, I find it difficult to assess the project’s implementation and cannot correctly assess the plan, the budget or the team’s experience in correlation to their exact goals. For example, if I take the detailed budget and see that the proposers are asking for $15,000 for approximately 130 hours of coding, I cannot estimate if the hour amount is feasible, since I cannot estimate what kind of coding, for what exact purpose or in what language will be needed. And further on, the marketing budget is set at $6000 and does not offer any kind of additional information, as to what it might entail. These missing pieces of information are, first of all, vital not just for me, as a Proposal Assessor, but for the team working on this project, as it will help them structure all their steps and when something unforeseen comes along, they will stand prepared.\nThe team has offered ample details about their experience and skills, and I’d have to say that they seem to be highly capable individuals in their specific field. Unfortunately, I cannot judge their skills in relation to this project, as I cannot tie it all together as the type of work and scope of the project are not entirely clear.\nFurther on, the team members have answered “yes” to the question of whether they are working on other proposals in this fund, however, they have not provided any further details, not even a link to those other proposals, that would help me assess the interrelatedness, similarities and feasibility when in relation to time management of all projects.\nIn conclusion, based on the missing elements that I have pointed out in the assessment I find I cannot agree that at the moment, the proposal can be successfully implemented.", "q1r": 2, "q2": "I find the progress measurement to be well-aimed. The team will be measuring the number of projects, the number of tokens ported and the amount of value brought on the Cardano blockchain. All the metrics are objective and offer some form of insight into the project's advancement. Further on, in the success section, the team mentions a very important aspect that will help their project in its future, namely: “having a standardized and easy method developed to bring other projects onto Cardano”. I think this part differentiates itself and is very important, not just for the team, but for anyone looking at the transitions and analysing the workflow.\nSince I find myself agreeing with this, I want to encourage the team in their project and hope my previous remarks and suggestions will be of help in the future.", "q2r": 4, "assessor": "z_assessor_2192", "no_vca": 9, "ne": 3, "ng": 2, "nfo": 4, "vca_o": 1, "reply": "This assessment is very biased. We are working to build an NFT and Gaming Alliance that will provide the resources and time to migrate projects over from other platforms. Whether that is providing projects that have (already) reached out to us with the resources they need, or if it is getting Dirk to work with other programmers within the ecosystem to develop a bridge between one blockchain to another. There is a lot of work that we are able to produce, and this value can be seen in almost all the other reviews. \n\n\nSecondly, we are much more specific in another proposal about what we'd be offering, but as this category isn't as broad, we had to focus on Cross-Chain Collaborations and what our Alliance would and is doing.\n\nWe do however "}, {"id": 5474, "q0": "I agree with the team's problem statement which says that there aren't any viable methods available for the inter-operability between ecosystems on different chains. The proposers here are trying to mitigate this huge barrier by providing assistance to those projects existing on the other chains in implementing the features that can exist on the Cardano chain and also in the migration. The ramifications this could have on the chain are huge and it will surely bring in a lot of value to the Cardano chain all in all. The Fluxus team proposes to use its collective 50+ experience in providing specialized attention to those who wish to migrate to Cardano, however, the main risk is the unwillingness of several projects to migrate, and there are no clear indications as to how the team plans to overcome this. Also, I feel a little more descriptive plan on how far the team would support the migrating projects would have made the impact aspects complete.", "q0r": 4, "q1": "The manifesto is deficient in various aspects to determine the possibility of its successful implementation. The key milestones provided by the team have no supporting action plan to explain how the team intends to achieve these milestones. Despite the funds looking just and reasonable, there is no dependable budget breakdown to carefully scrutinize its effective usage. In spite of all the drawbacks mentioned above, the team put together is brilliant with respect to the various fields and streams the migrating projects might need assistance with. The proposers seem to have gathered all the required experts to get the job done. That is one aspect that looks complete from the feasibility standpoint. The team also makes a mentioning of returning to further rounds for more funds, which adds to the reliability and eminence of the team, showing their passion and determination. Taking into consideration of all the above points, I as a reader find it difficult to either agree or disagree with the feasibility of the proposal. ", "q1r": 3, "q2": "The progress metrics, in this case, would be the total number of projects migrating to the Cardano chain. Close watch on the same would be evident for the community to track the progress. The success metrics of total value brought into the chain and the number of non-Cardano assets both fungible and non-fungible would be the clear indicators of success. The team also in their proposal provides their measurable targets for the quarters which adds to the auditability metrics. The development of a standard method that can ease the migration process and eventually automate is another metric that could act as a success/ acceptance measure. All in all, the team has such great experience that could be assumed to assist the auditors to make the entire process smooth. The successful implementation of this could be leveraged by other projects especially, those working on \"The Great Migration\". Hence, I score a full mark for the auditability aspect of this proposal.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6393, "q0": "I believe Fluxus is among the most impactful proposals in this challenge I read so far. Guidance and assistance in migrating to Cardano would be a huge advantage for new projects onboarding the chain. It's also one of the few proposals in the cross-chain challenge that realistically addresses the willingness of other projects to migrate to Cardano. Perhaps, the team could further mitigate this risk by implementing an educational or inctive program that encourages developers to migrate.\nI'd recommend the author to take more time on the introduction, though, as a poorly written or weak opening can discourage people from reading further.", "q0r": 5, "q1": "The proposal does a great job at detailing the necessary team and professionals required. In turn, the same team seems experienced enough to carry out this proposal successfully. However, I do have some reservations.\nFirstly, the schedule detailed is too vague and not at all specific. There's only 3 activities per quarter and marketing is one in all of them, while another is an OKR metric (having migrated X projects) and not an action, task, or activity. I'd like to see a detailed schedule with specific actions: What will marketing consists of? How is the team planning to reach non-Cardano projects? There's no mention of a landing page, marketing campaign, or any platform development where porjects can register or learn more either, which is a major concern to me on the feasibility of this proposal.\nSecondly--and this is just a personal opinion which doesn't affect the score--the requested budget seems a little low for a team of 11 people, considering that a good part of it will be allocated to marketing and operative costs. In a context of global recession and rising inflation, added to the crypto bear market, I fear the funds may not be enough for this proposal to remain sustainable.\nTo summarize, the team seems extremely capable and experience, but I do think the project needs more planning--or, if there is an actual comprehensive schedule, the proposal needs more detailing. For this contrast, I have to give it a score of 3. If a detailed plan with concrete actions was included in the schedule, it would easily be a 5-star rating.", "q1r": 3, "q2": "The goals and metrics are clearly described in the proposal and they are also measurable and representative of what the team is aiming to achieve. The only thing I'm missing is the public platform or database where this information will be desplayed as the project moves forward. However, I believe this is a small issue and a simple thing to resolve, which is why I'm still giving the audaitability of this proposal a 5-star rating.", "q2r": 5, "assessor": "z_assessor_2815", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9316, "q0": "After reading the proposal I found the idea of the project good, but the solutions and solution descriptions about Pluxus were unclear and confusing. You need to describe more clearly how your proposed solution will address the challenge you submitted. Regarding the description of your proposed solution with a highly qualified team with over 50 years in coding and project management and related experience, I believe this project will be influential. good but needs to be more specific for people to understand.", "q0r": 4, "q1": "I would like to read a more detailed plan, more specifically your proposal. It's just the master plan, I don't see it really details. Regarding group members, on the contrary, you give very detailed information. But the most important thing is to still put in a detailed plan. The budget breakdown is also not detailed. The detailed budget sheet needs to break down the specific work clearly with the corresponding amount in the corresponding time. ", "q1r": 4, "q2": "I agree with your suggestions. The information provided to evaluate the success of the idea is quite complete and factual. Progress with goals has been given, more numbers are needed to be able to easily assess whether the work speed is satisfactory or not. I find that the proposed measures are enough to evaluate the effectiveness of the project, but more details are needed.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 12602, "q0": "The proposer has clearly laid out the relevance of their proposal to the fund challenge setting, a platform that allows connecting projects, NFTs between cardano and other blockchains is a great idea, especially considering the growing popularity of NFTs and the growth of Cardano. Creators can feel comfortable with the transition and have the help and resources they need  and will break down barriers due to platform differences, thereby creating a basis for development not only for cardano but also for other blockchains. I would like the proposer to give a more concrete example as to how an NFT is distributed across different blockchains, perhaps you should add the linked youtube videos that explain in more depth to better understand the intentions of the people offer. More details are needed on how it is built, the goals and especially how all of this will relate to our blockchain.", "q0r": 4, "q1": "The team has a lot of experience involved in the development of this project, and all background information of team members is provided very clearly and in detail so that voters can rest assured that the fund, if awarded, it will be given to qualified people. I think there is a problem that the whole project development process is explained superficially, it is essential that the proponents explain the details. detail what will need to be done to create each specific activity. The development of this project should be more specific, I believe it will take a long time to implement, but more detail will help CA, vCA and voters have a more solid view of the process. The budget is also explained very thin e.g. $6000 is required for marketing and outreach. What will the working day of the people involved in these jobs be like, how many hours a day will they work? What small tasks are added together that will lead to this development, how long it takes on average for this task.", "q1r": 4, "q2": "This shows that the working group is willing to make the work information public so that the community can easily check the results. You systematize this information on an official website with enough pictures and videos of activities like many projects have done. This helps the team work closely with the community and easily receive support. Metrics such as the total number of non-Cardano projects moving to the Cardano Blockchain or the amount of value moving into the Cardano Blockchain through Fluxus I think are reasonable and I have no further comment on this part of the proposal. , because I think the information provided is satisfactory. The project will be very clear and accessible as all can be tracked and audited as progress is made via the website.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "While Cardano has many features, such as low transaction costs, that can attract NFT developers/projects from other blockchains, there needs to be a group or Alliance that can provide these resources.", "experience": "Co-founder (CF)/Game Design: Alex\nCF/Marketing: Conward\nSr Programmer: Dirk\nProjects Coordinator: Sam\nAssistant PC: Jye\nNarrative Design: Chris\nGame Programmer: Simon\nArtist: Dilara\nIllustrator: Ann-Kathrin\nProducer: Christian\nSFX: Rudi\n(More Details Below)"}