{"id": 415658, "author": "nick.odio", "title": "MultiSwap (X-Chain Swaps by Ferrum)", "url": "https://cardano.ideascale.com/a/dtd/415658-48088", "category": 26598, "amount": 200000, "description": "Secure multi-chain aggregators, interoperability protocols, & cross-chain swapping platforms connecting L1 solutions to both eUTXO and EVM compatible networks are non-existent in todays landscape.", "f6_no_assessments": 8, "f6_rating": 4.125, "videos": [], "media": [], "f6_assessments": [{"id": 3264, "q0": "To understand where this proposal is coming from, you need to understand the general issues that face interoperability between tokens on different chains.  When the links between chains are created (usually as bridges) there are a limited number of ways for the value to cross the bridge.  Most of these ways involve parking or burning the token on its home-chain, and using some kind of validator to prove that the value in the tokens has been locked down or out, thus allowing that value to be represented on the new chain.  The description of a \"bridge\" leads many to think that the token has managed to \"cross\" over to the new ecosystem, but in almost every case, the tokens are actually held in a locked pool, with much less security than is present on the L1 protocol, while a doppleganger (and all too often this faux version of the token is stripped of valuable utility) roams around on the new chain.\n\nObviously, this lower security and pooling creates attractive targets for hacks, and of any recent hacks you can think of, chances are they were of this bridge vulnerability variety.\n\nMultiswap reimagines this vulnerability by eliminating the concept of the bridge, and instead tries to build liquidity protocols so that instead of transforming the token itself though a trust layer, the token is swapped for value on the other side of the divide.  The impact on the interoperability long game cannot be understated here, and Ferrum is as far ahead as anyone on this tightly competitive arc into the multi-chain future.\n\nSome of these liquidity protocols are of the \"white label\" variety (the token project itself provides excess value in the new ecosystem) while others lean into liquidity protocols of the dexes themselves.  When you start adding in the utility of the Ferrum native assets FRM and FRMx to generate investment and yield opportunity, as well as \"mini-impact\" from things like the tax-accounting viability of being able to keep a token's value intact through the swap, it is clear that this is a stable plan with wide ranging synergy with Cardano and its users.  I believe this proposal merits 5 stars for its alignment to both the cross-chain requirements of the challenge setting as well as the wider interoperability and scaling principles of Cardano.", "q0r": 5, "q1": "While the team is helpfully listed and linked in the proposal, following through any of their project links takes us into the depths they have already plumbed with this project, the multitude of partnerships and clients they have worked with, and I find this to be an extremely valid form of referential trust.  By checking out some interviews they gave I found their broad knowledge of the space between chains, and their specific knowledge of discrete chain protocols to be very reassuring.  They recognize the problems in the space, and also, importantly, the recognize that there are tradeoffs for any particular approach, including their swapping protocols.\n\nTheir timeline and milestones are extremely granular, listing out each milestone by number of days.  There were a couple of issues however.  One was an issue of clarity:  the team refers to several deliverables as being submitted to Catalyst for bug testing, signing off on shell apps and approving milestones.  This is likely a bit of confusion from applying this model, which has already been applied to many other projects, to the more decentralized Cardano.  In practice, none of these suggestions are issues, since there is a community to provide feedback and test, a robust technical community to analyze repos and of course, IOG with oversight of Coordinator for approving funding tranches.  If any issues arise, it will be due to funding tranches not lining up with expenses and misunderstandings that can arise from this lack of familiarity with Catalyst. It is highly recommended that the proposing team reach out to funded proposers to get a feel for how the funding is distributed.\n\nFurther, there is an issue around the lack of a budget breakdown.  The team clearly has an understanding of the resources required to integrate a new chain, but without providing any details, there is no way to assess whether the number they have presented is realistic, or whether it might be over- or undershooting their needs.  For what it is worth, for the scope of the work they are describing, this feels a bit under-budgeted, but it would be nice to have better numbers to reach that conclusion more firmly.  Along similar lines, and just as advice to the proposer, it would be handy to see the timeline summarized to include the total length of funding required for the project (as this number is used to divide the funding up into monthly tranches).\n\nDespite a strong team, a robust product that is available and working on other chains, a nuanced iterative approach and a deep knowledge of the space, I'm afraid I have to deduct a star for the lack of a clear budget and the uncertainty it creates in an otherwise solid proposal.  4 stars for Feasibility.", "q1r": 4, "q2": "This project is written up here as primarily a software delivery, and as such they have included the dependable Jira tools and agile methodology.  There is a note about being familiar with sprint burndowns for reporting progress as % complete which is always an excellent add.\n\nIt is worth noting that they have a large section included under feasibility which actually lends a whole lot of auditability trust to the project.  The section covers what looks like a grassroots marketing approach, but which will actually function as a great transparency/availability layer for community feedback and interaction.  On top of this they have included a vow(!) to present monthly resource reports on anything required, and in particular transparent expense reports.\n\nBecause the audit points they have included indicate that they are familiar with the tools they need to use, as well as their ability to address any shortcomings related to their presentation of the budget, I believe they have presented a proposal that can be effectively audited and monitored by the community, so I give a full 5 stars.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Hey there z_assessor_2436! Thank you so much for the incredibly detailed feedback. We’ve noticed that the lack of clarity around the budget breakdown was the most frequently given criticism amongst the assessors. We truly apologize for the lack of detail and we really hope that this document ( https://docs.google.com/spreadsheets/d/1ReGjvFr-yK_MNJPtn0U4Cx-RqhK6MJ2CaHUxOnDPlL0/edit?usp=sharing ) combined with the below Milestone Overview and Budget Breakdown helps clarify some of the questions you had around that component.\r\n\r\nOverview\r\nMilestone\tEst. Duration\tFunding\r\n\r\n[Number]\t[Days]\t\t[USD Amount]\r\n1\t\t             21\t\t45,625\r\n\r\n2\t\t             67\t\t39,625\r\n\r\n3\t\t             45\t\t39,625\r\n\r\n4\t\t             30\t\t39,625\r\n\r\n5\t\t             15\t\t35,500\r\n\r\n\r\nTotal Amount \t$200,000\r\n\r\nBreakdown\r\n\r\nBelow is a breakdown on how the grant will be utilized.\r\n\r\n75% of grant:\r\nDevelopment\r\nTesting\r\nDev-Ops\r\nAudit\r\n\r\n25% of grant:\r\nMarketing\r\nSales \r\nEducation \r\n\r\nAs it pertains to the lack of understanding around the funding and auditing process, you’re correct that it's due to a lack of familiarity with the process as a whole. We will be sure to reach out to other previously funded projects as we are in contact with some of these folks. Thanks for the heads up about this as we want to ensure that we are approaching the process as by the book as possible if in fact we are selected. If Ferrum is selected to Fund9, we will not let Project Catalyst and the Cardano ecosystem down!"}, {"id": 789, "q0": "The proposal aims to build a multichain swap with can being in following advantages. 1. 2-way bridge LP system which is more secure than mint/burn algorithms. 2. At the same time the protocol offers a reflection (RFI), dividend, or burn mechanism. 3. The proposed protocol will never have control over the token contract of any asset using the protocol. 4. This protocol will use uses the APIs from DEXs and tap into DEX liquidity to support the volume being transacted across the protocol. The protocol removes the wrapper function involved in mint/burn multichain protocols thereby the UX is greatly improved. On analysis of the advantages, number 3 alone has substantial merit to rate this proposal as one of the far-reaching proposals in Fund 9. There is a need for such a fundamental contribution and in this respect, the proposal is outstanding since it offers a unique way to move assets between chains at the same time the smart contract will be able to be used to exploit the assets movement since it is not controlling the assets in both the chains. Therefore the project is very much in alignment with the challenge. ", "q0r": 5, "q1": "The proposal is made by Team from Ferrum. The list of projects that have been executed by this entity and the endorsement it has received from the stakeholders is given in the proposal. The list is impressive. The Linkedin profiles of the proposing team is also found in the proposal. The milestones and the deliverables are feasible and are likely to be achievable in the time period. The plan and the technical explanation in the proposal are complete. With this information, it can be said that the proposal is complete in this respect. ", "q1r": 5, "q2": "The proposal asks for $200000 for funding allocation of engineering, project management, support and executive resources to integrate MultiSwap with Cardano over four months. The proposal is planned for delivery over five well-defined milestones. The proposal is not offering how they have arrived at 200K. The funding is for milestones spanning over 8 months it would have been great if this project is divided into phases over multiple catalyst rounds to improve the funding chance. However, the proposal is very clear on the deliverable including 8 bridges and a very secure protocol. With these in the background, the project is fairly auditable. ", "q2r": 4, "assessor": "z_assessor_2129", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "Hey there z_assessor_2129! We really appreciate the feedback. In response to your statement about wishing we had divided the proposal into phases: We had attempted to do that for Fund 8 but the main criticism we received was that we had too many proposals (3) and that they were too similar to one another. The 'General' and ‘'Impact' sections were the same throughout as the proposals were for the same product... the only difference was the ‘milestones’ section of ‘Feasibility’. For Fund9 we decided to lump it all together since our previous approach fell short. Furthermore, the last proposals totaled 300k between the 3 proposals as opposed to 200k for this one. After talking with the devs and the rest of the team, we agreed that we could build the product for 200k in an attempt to go for the entirety of the funding at once since our previous strategy of separating the proposal into phases failed. We figured that approaching this more leanly than we had originally intended and getting it done was more important than risking missing the opportunity to help grow the Cardano ecosystem. I hope this makes sense!\r\n\r\nAlso, while you didn’t give the following criticism yourself, many other assessors mentioned the fact that we didn’t clearly outline our budget. This seemed to be one of the most widely criticized aspects amongst the assessors. So while I know you didn’t ask for it, we really hope that this document ( https://docs.google.com/spreadsheets/d/1ReGjvFr-yK_MNJPtn0U4Cx-RqhK6MJ2CaHUxOnDPlL0/edit?usp=sharing ) combined with the below Milestone Overview and Budget Breakdown helps clarify some of the questions you may have had around that component.\r\n\r\nOverview\r\nMilestone\tEst. Duration\tFunding\r\n\r\n[Number]\t[Days]\t\t[USD Amount]\r\n1\t\t             21\t\t45,625\r\n\r\n2\t\t             67\t\t39,625\r\n\r\n3\t\t             45\t\t39,625\r\n\r\n4\t\t             30\t\t39,625\r\n\r\n5\t\t             15\t\t35,500\r\n\r\n\r\nTotal Amount \t$200,000\r\n\r\nBreakdown\r\n\r\nBelow is a breakdown on how the grant will be utilized.\r\n\r\n75% of grant:\r\nDevelopment\r\nTesting\r\nDev-Ops\r\nAudit\r\n\r\n25% of grant:\r\nMarketing\r\nSales \r\nEducation"}, {"id": 3783, "q0": "I think this proposal is trying to provide Cardano with its own Ethereum’s 1inch but with added benefits of multi-chain interoperability via novel two-way LP bridging system, instead of just aggregating liquidities domestically inside the native blockchain. This proposal will help us to gain access to the resources of EVM chains out there. Given the Basho era we are in now, I think the majority of the community is focusing much of their attention in scaling solutions and put interoperability solutions kind of in the sideline. Therefore, I think this proposal could be a good investment for Cardano community to prepare ourselves in addressing and delivering more accomplishment in interoperability area. The fact that this proposal is in the right challenge of Cross-Chain Collaboration adds further conviction to me.", "q0r": 4, "q1": "The company itself looks very solid and respectable. Track records and achievements can be easily verified via LinkedIn URLs provide for each team member. The team also looks sizeable with good sets of business and technical functions. Milestones, deliverables, and budgets are very well-written and well-detailed. From my basic calculation, the project is planned to be finished in 36 working weeks (180 working days) and assuming 40-hour work week I got hourly rate of this proposal service and delivery of around USD 140. I think this is a fairly reasonable rate since there will be business/project manager, marketing specialist, and most importantly multiple developers and security auditors working to implement and deliver this holistic solution. Technical rationale is detailed in place and satisfactory. The team also explained the security risk as common hindrance in inter-blockchain bridging solution. They addressed it through updating Node Signing Architecture and related Infrastructure to enable decentralized Node signing which resulting in extra security and reliability layers.", "q1r": 4, "q2": "Most of the project work will be executed in SCRUM tactics with two-week sprints which is standard in the software development industry. The Catalyst community as the gatekeeper of this project can use a provided open-sourced Jira board to monitor the progress further. The team will also commit monthly Progress Updates to Catalyst and IOG, including the deliverables being worked on and financial expenditure and utilization analysis. Success is defined strongly as complete deployment with substantial transaction volumes and values and number and diversity of assests listed in this MultiSwap as aggregator. I love the ambition from the proposer team to make the delivered product talk of the (Cardano) town on all media. Furthermore, they will also provide marketing and communication to Cardano community members and wider crypto audience outside Cardano through highly informative, quality articles, public relations and influencer campaigns, youtube podcasts & Series, social media & lead generation, e-mail blasts, AMA sessions, website promo, and in-house sales and product representatives. I believe these huge, multi-efforts will directly increase transparency and the visibility of this project. Lastly, I like how the the proposal is very well-written and detailed at a high standard. It speaks volume about their seriousness, dedication, professionalism of the proposer team to deliver a great thing to Cardano community and ecosystem.", "q2r": 5, "assessor": "z_assessor_2482", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thanks so much for the flattering feedback z_assessor_2482. I noticed that you only gave 4 stars on the Feasibility section. While you didn’t specify why, I have a feeling it may be related to the fact that we didn’t clearly outline our budget. This seemed to be one of the most widely criticized aspects amongst the assessors. So while I know you didn’t ask for it, we really hope that this document ( https://docs.google.com/spreadsheets/d/1ReGjvFr-yK_MNJPtn0U4Cx-RqhK6MJ2CaHUxOnDPlL0/edit?usp=sharing ) combined with the below Milestone Overview and Budget Breakdown helps clarify some of the questions you may have had around that component.\r\n\r\nOverview\r\nMilestone\tEst. Duration\tFunding\r\n\r\n[Number]\t[Days]\t\t[USD Amount]\r\n1\t\t             21\t\t45,625\r\n\r\n2\t\t             67\t\t39,625\r\n\r\n3\t\t             45\t\t39,625\r\n\r\n4\t\t             30\t\t39,625\r\n\r\n5\t\t             15\t\t35,500\r\n\r\n\r\nTotal Amount \t$200,000\r\n\r\nBreakdown\r\n\r\nBelow is a breakdown on how the grant will be utilized.\r\n\r\n75% of grant:\r\nDevelopment\r\nTesting\r\nDev-Ops\r\nAudit\r\n\r\n25% of grant:\r\nMarketing\r\nSales \r\nEducation \r\n\r\nIf Ferrum is selected for Fund9, we will not let Project Catalyst and the broader Cardano ecosystem down!"}, {"id": 6009, "q0": "The proposal presents the idea of building a swap protocol but not following the lock-mint-burn model like current bridge projects. Instead, it provides a new protocol that improves upon it. It is recommended to use APIs from DEX decentralized exchanges and exploit DEX liquidity to back the volume placed through the protocol. In general, this proposal will increase interaction on the Cardano blockchain, promote more on-chain activities on the chain, and also clearly state the shortcomings and difficulties in the construction process, and propose a solution to those difficulties.", "q0r": 5, "q1": "I appreciate the experience of each member of the proposed team. Their experience has been excellent through the projects that each member of the proposed team has worked on in the past. We have email here so that the community can directly communicate via mail.  \nHowever, it would be great if the proposed team could add here links to each member's personal information page like linkedIn to increase the level of recognition. This will help the proposed team gain credibility from the community.\nIn terms of budgets, there seems to be a lot of information missing here about how your proposal presents a spending plan. The community expects a blueprint to be able to provide the most accurate feedback on the allocation of funds for the most successful implementation of the proposal.\nThe schedule is also detailed here, providing an overview of the tasks to be done and details of the number of days to complete each task. I think that the proposed team of time allocation is reasonable.", "q1r": 4, "q2": "The project is constantly updating the progress for Catalyst but from the community side, we also need to publish the same information. I think the team suggested providing more information on the progress reported to Catalyst to which channel is updated to the community (could be Github, Telegram, or Discord)\nThe issues and goals of the proposal are presented quite specifically => so the community can grasp the information quickly.\n\n- Here I have one more suggestion that the team proposes additional measures for the success of the project. For example, this Protocol will have #number of wallet address generated. Or TLV reaches # dollars", "q2r": 4, "assessor": "z_assessor_2771", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1, "reply": "Hey there z_assessor_2771! Thank you so much for the invaluable feedback. I cannot believe we forgot to add the blueprint for the \"Milestone Breakdown\" and budget plan. This was the most widely given criticism amongst the assessors so we really hope that this document ( https://docs.google.com/spreadsheets/d/1ReGjvFr-yK_MNJPtn0U4Cx-RqhK6MJ2CaHUxOnDPlL0/edit?usp=sharing ) combined with the below Milestone Overview and Budget Breakdown helps clarify some of the questions you had around that component.\r\n\r\nOverview\r\nMilestone\tEst. Duration\tFunding\r\n\r\n[Number]\t[Days]\t\t[USD Amount]\r\n1\t\t             21\t\t45,625\r\n\r\n2\t\t             67\t\t39,625\r\n\r\n3\t\t             45\t\t39,625\r\n\r\n4\t\t             30\t\t39,625\r\n\r\n5\t\t             15\t\t35,500\r\n\r\n\r\nTotal Amount \t$200,000\r\n\r\nBreakdown\r\n\r\nBelow is a breakdown on how the grant will be utilized.\r\n\r\n75% of grant:\r\nDevelopment\r\nTesting\r\nDev-Ops\r\nAudit\r\n\r\n25% of grant:\r\nMarketing\r\nSales \r\nEducation \r\n\r\n\r\nIn regard to this part; 'it would be great if the proposed team could add here links to each member's personal information page like linkedIn to increase the level of recognition.': \r\n\r\nIf you check out the link over each one of our names, you'll see that it will direct you to our individual Linkedin pages. In hindsight, we should've made that more clear and put the links themselves beside the emails.\r\n\r\nThank you very much for the feedback. I hope this was able to answer some of your questions/concerns. If Ferrum is picked for Fund9, we will not let Project Catalyst and the broader Cardano ecosystem down!"}, {"id": 6320, "q0": "This proposal is about creating 'Multiswap,' a smart routing multi-chain aggregator and cross-chain swapping platform. It aims to provide Cardano multi-chain aggregator and swaps between Cardano and other chains such as Ethereum, BSC, Polygon, Avalanche, Harmony, etc. Therefore, it is aligned with the Challenge statement as it is trying to provide Cross Chain solutions.\n\nIt will add much value to the Ecosystem as it will be the first solution on Cardano to provide interoperability with more than one chain. We already have Milkomeda, which provides interoperability with Ethereum. If successful, this will increase on-chain activity from the users on other chains.\n\nThe proposer mentioned the risk would be security breaches which is the case for any protocol operating on the blockchain. He has measures planned to address such risk, along with the fact the protocol will undergo Smart Contracts Audit before launch. ", "q0r": 5, "q1": "The proposer provided brief details of the team along with their LinkedIn profiles. As it seems from the details in the proposal and on LinkedIn, they are skilled and qualified to execute the proposal. But the details of their roles in the proposal are not provided.\n\nThe detailed plan of the proposal is divided into five milestones. Each milestone is assigned with the tasks to be completed in those respective milestones. It is also provided with the duration required to complete those tasks, which is Milestone 1 -> three weeks (21 days), Milestone 2 -> 67 days, Milestone 3 -> 45 days, Milestone 4 -> 30 days, and Milestone 5 -> 15 days. Thus, the required duration adds up to 178 days, less than six months. Therefore, it is reasonable considering the volume of tasks to be completed.\n\nThe requested budget is $200,000, more than 22% of the Total Challenge amount. It is a big amount but can be justified based on the proposal as it attempts to provide a cross-chain solution between Cardano and more than seven other chains.\n\nBut the proposer did not provide the breakdown of this budget. The proposer should have broken it down into identifiable tasks of the proposal. It helps the readers in evaluating the proposal and also in tracking/auditing the progress of the proposal. ", "q1r": 4, "q2": "As stated by the proposer, they will post the proposal developmental updates on the Jira board to track the progress of each task. Also, they will submit progress reports and financial reports to Catalyst every month. All these can be utilized to track/audit the proposal's progress.\n\nThe proposer laid out the milestones with the duration required. As stated above, the proposer divided the proposal into five milestones, all of which will be completed within 178 days. Each milestone is assigned with a specific timeframe; this certainly helps the tracking.\n\nAs mentioned above, the proposer asked for $200,000 but did not provide the breakup of this amount. Hence it is unclear how he will spend the amount on which tasks. It also hampers tracking/auditing. \nAs stated by the proposer, success will be considered when the product is deployed, and the protocol will substantially increase the transaction volume contributed by the protocol.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Hey there z_assessor_2811! Thank you so much for the invaluable feedback. I cannot believe we forgot to add the blueprint for the \"Milestone Breakdown\" and budget plan. This was some of the most widely received criticism from the assessors and we really hope that this document ( https://docs.google.com/spreadsheets/d/1ReGjvFr-yK_MNJPtn0U4Cx-RqhK6MJ2CaHUxOnDPlL0/edit?usp=sharing ) combined with the below Milestone Overview and Budget Breakdown helps clarify some of the questions you had around that component.\r\n\r\nOverview\r\nMilestone\tEst. Duration\tFunding\r\n\r\n[Number]\t[Days]\t\t[USD Amount]\r\n1\t\t             21\t\t45,625\r\n\r\n2\t\t             67\t\t39,625\r\n\r\n3\t\t             45\t\t39,625\r\n\r\n4\t\t             30\t\t39,625\r\n\r\n5\t\t             15\t\t35,500\r\n\r\n\r\nTotal Amount \t$200,000\r\n\r\nBreakdown\r\n\r\nBelow is a breakdown on how the grant will be utilized.\r\n\r\n75% of grant:\r\nDevelopment\r\nTesting\r\nDev-Ops\r\nAudit\r\n\r\n25% of grant:\r\nMarketing\r\nSales \r\nEducation \r\n\r\n\r\nIn regard to the team and their specific roles in the integration. Apologies for being company specific as opposed to project specific. I can see how that would be a hangup. Let me clarify what the roles for each team member would be as it pertains to this proposal.\r\n\r\nNaiem Yeganeh: PHD - Founder, CEO and Lead Developer \r\nNaiem is the CEO and the lead engineer at Ferrum. He is the mastermind behind the products at Ferrum. His technical prowess has laid the foundation for Ferrum’s success. Naiem is the one who established the node infrastructure for MultiSwap and will be responsible for maintaining and managing the node infrastructure for the Cardano integration. Naiem will also be handling code reviews throughout the integration. \r\n\r\nIan Friend: Ian is not only the co-founder but the face of Ferrum. He will be handling much of the day to day educational materials alongside members of our marketing team. Podcasts, YouTube interviews, and community engagement are all areas in which Ian will provide his expertise.\r\n\r\nTaha Abbasi: Taha serves as the CSO at Ferrum and oversees the development of Ferrum's wide array of products. He is also the senior architect and will be designing and creating the architecture for the Cardano integration.\r\n\r\nSalman Haider: Salman Haider is our Senior Blockchain Architect at Ferrum Network with 7 years of hands-on experience of Architecting & Developing the secure Web 2.0 and Web 3.0 Complex Software Systems. Salman has expertise with Casper, Pocket & Algorand to name a few and has skillset in Solidity, RUST, COSMOS, PyTeal, and now Haskell,. Salman will be our Senior Engineer working on this integration and will be leading our engineering team. Salman will also be the lead engineer in developing the smart contracts. His expertise will be very handy to get the delivery over the line within the delivery time period.\r\n\r\nAbdul Ahad: Abdul Ahad is a full stack resource with a lot of Web3 and React experience. He will be the lead frontend engineer for Cardano integration. Ahad will also be responsible for building the UI and integrating it with smart contracts. \r\n\r\nFaizan Ali: Faizan is also our full stack front end engineer who will be assisting Ahad with UI throughout the integration period.\r\n\r\nMaiwand Sultan: Maiwand will be the project manager for the integration and will be your primary POC. Maiwand will be making sure the milestones are delivered on time and everything is followed as per the initial approved plan.\r\n\r\nHasnat Malik: Hasnat is the director of projects at Ferrum. Hasnat is responsible for making sure that the plan which is approved is also compatible with the other products at Ferrum. Any updates or upgrades happening for the products during the integration period are also implemented for Cardano integration to make sure all products are updated constantly.\r\n\r\nAmir Hassan: Amir will be the designated QA engineer for Cardano integration. He will be testing everything from end-to-end during the sprint cycles to make sure the quality is maintained.\r\n\r\nSheraz Riaz: Sheraz is the Dev-Ops engineer at Ferrum. He will be responsible for creating CI/CD pipelines for deployment.\r\n\r\nNichell Logue: Nichell is the EVP of Operations at Ferrum. She handles all of our HR related items as well. There's a good chance that we will seek to source additional engineers in an attempt to speed up the 178 day timeline we provided. Nichell we play a vital role in sourcing that talent. Her and Nick Odio will oversee any logistical elements to the process as it pertains to the relationship between Ferrum and Project Catalyst.\r\n\r\nNick Odio: Nick Odio is our EVP of Partnerships and Growth at Ferrum. He is responsible for drafting the proposal. He is also one of the main spokespersons for Ferrum Network alongside Ian Friend and will be doing a lot of the PR related items as it pertains to MultiSwap alongside members of the marketing team. He will also play a vital role in the adoption of MultiSwap from a business development perspective as he will find and encourage partner projects to leverage MultiSwap within the Cardano ecosystem and beyond. He and Nichell Logue will oversee any logistical elements to the process as it pertains to the relationship between Ferrum and Project Catalyst."}, {"id": 6663, "q0": "Ferrum is an online DeFi / staking solution that has already applied for funding in Fund 8, with four proposals, fairly similar in scope / presentation, and all of them having received mixed reviews from the community. None of them were funded, and the Ferrum team is back now in Fund 9 with a single proposal, a very positive sign that shows they have at least learned this lesson - that their strategy of splitting a project into multiple proposals proved to be confusing for the community. Let’s see how else they managed to improve their value proposition.  \n\nAs a refresher from F8 information we already know, Ferrum has been present in the crypto space since 2018, with services initially offering services for ETH, MATIC, BSC and AVAX. Now, at least judging by their website, their services are much more elaborate and fairly complex (staking lotteries, NFT products, web3 games, etcetera) and very wide in scope. \n\nWith this proposal they are asking for funding to provide a …multiswap integration, but since it’s not actually clear so I will quote them, maybe you understand better: “MultiSwap reimagines architectural & OpSec best practices, providing a complete solution on the market while encouraging TVL across Cardano native DeFi protocols”. So there you have it! \n\nJust as it was the case with their Fund 8 proposals, I am not convinced that there is a good fit with the challenge. Back then, Ferrum was unsure that there was a potential for their service to be integrated with Cardano. A few months have passed, and by reading the proposal we are not actually understanding if there is a good fit now. Have Ferrum taken a closer look at their services and development plans and did they come up with a viable avenue for integration? We are not being told, and the proposal does not mention this aspect. The proposal sadly maintains the same fuzzy logic and argumentation style that was confusing for the community in Fund 8 even now - since it’s not easy at all to understand their explanations. \n\nConsidering all of the above I can only offer two stars - since the Ferrum team does not bring before us a solution that is easy to understand and they bring no arguments why it will be beneficial for the Cardano community. ", "q0r": 2, "q1": "The team behind Ferrum seems very strong, and they have made an excellent effort into presenting themselves. Naiem is the founder, with previous experience working for Microsoft and Amazon. Ian, the COO, is a lawyer by formation and has joined Ferrum in 2018. These are just two examples, but more team members are presented within the proposal, and many more are available on their website - most of them with Linkedin profiles available, so definitely the team presentation is a strong point of the proposal. \n\n\nFrom a budgetary point of view, this proposal is very very similar to the ones they proposed in Fund 8. So my words are pretty much the same. The budget has used absolutely no figures whatsoever. The entire budget section is simply an argument as to why granting the funds is necessary in order for Ferrum “to be able to justify prioritizing this integration [...]  cognizant of their backlog”. Rephrasing the argument, for me it sounds more like “we are not entirely sure that there is a business case to be made here, but if you fund us we shall make an effort”. These are the exact words that again, confused the Catalyst assessors in the previous round and it is very sad to see that the Ferrum team had not learned from the feedback provided.   \n\nTimewise, they offer 5 milestones. During the first a scoping exercise would be completed (20 day).  The second would see a bridge shell app being built and deployed internally (75 days). The third would involve testing by Catalyst and audit submission (30 days). For this phase it is rather unclear who from Catalyst would test it (will it be in beta mode available for anyone?) and what kind of audit submission we are talking about. Is it a third party audit? Who is the auditor, do they have a budget set aside? The fours milestone would be a multi-chain aggregator deployment and testing (35 days). The last phase would take into account the feedback provided and would see the live launch (20 days). So a rather concrete plan with clear milestones - definitely a strong point of the proposal. \n\nNo matter how strong the team presentation is, no matter how well defined the milestones are, the fact that the budget contains NO figures whatsoever does not allow me to offer more than two stars in this category. I consider it a very poor practice to do this and to my mind this fact renders the project rather unfeasible to implement correctly, if funded.", "q1r": 2, "q2": "Their auditability section is very very close to the ones they had in Fund 8, hence my words are almost the same as well. The team uses SCRUM and runs 2 week sprints. They promise an open sourced Jira board to track the progress of each task and they also promise to to provide Progress reports and financial reports every month. \n\nMeasuring the project’s success is rather confusing when judging by what the proposers offer us. They use a negative sentence so I am quoting them by turning it into an affirmative one: “The project will be considered a success when the product is deployed to production and we are seeing substantial transaction volumes and assets listed on the aggregator”. Sadly they are not actually offering any anchors to base our expectations: what constitutes a substantial volume of transactions? Which exactly are the assets we are talking about? Is it only ADA, other Cardano tokens, or actually just pairs of ADA - to other cryptocurrencies that we will be measuring?\n\nThe team’s approach to openness is transparency is duly noted, as well as the slight improvement in the auditability section from the previous funding round. Most likely the Cardano community would most not have any issues in tracking this project, if funded, with the caveat that the weak value proposition of the project is trickling down to this level and it is difficult for the team to offer meaningful targets of success, hence only four stars in the auditability section. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 8, "ne": 4, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "Hi there Z_assessor_2824! Thanks so much for the detailed feedback. We’ll try to provide as much clarity as we possibly can here as it seems your assessment was the most critical amongst an otherwise well receptive group. That being said, you bring up some excellent points!\r\n\r\nLet’s start with your feedback on the ‘Impact / Alignment’ section. In regards to your praise for creating one proposal as opposed to 3 like we did the last time, we definitely heeded yours and other assessors’ advice there. Although, interestingly enough, a few of the assessors this time around explained that they thought this proposal should’ve been broken into multiple proposals. Either way, we really hope this is the best option here.  Furthermore, the last proposals totaled 300k between the 3 proposals as opposed to 200k for this one. After talking with the devs and the rest of the team, we agreed that we could build the product for 200k in an attempt to go for the entirety of the funding at once since our previous strategy of separating the proposal into phases failed. We figured that approaching this more leanly than we had originally intended and getting it done was more important than risking missing the opportunity to help grow the Cardano ecosystem. \r\n\r\nWe’re a bit unclear on what you mean when you say that Ferrum was “unsure that there was a potential for their service to be integrated with Cardano” and that “we are not actually understanding if there is a good fit now.” We are quite certain that MultiSwap is an incredible fit for the Cardano ecosystem. There are very few highly connected interoperability protocols in the Cardano ecosystem. MultiSwap IS highly connected; not only to a dozen or so EVM networks but also some non EVMs as well. Also, it will not only function as a bridge but it will function as a cross-chain swapping protocol as well. Meaning users can Swap ‘Asset A’ on the origin network for ‘Asset B’ on Cardano. Furthermore, with the frequency in which ‘bridges’ are exploited, we believe that a securely architected interoperability protocol is absolutely crucial for the Cardano ecosystem. Other reasons as to why we believe this product will be beneficial for the Cardano community include encouraging TVL and volume on DEXs such as Wingriders, MinSwap, SundaeSwap and MuesliSwap, making Cardano native assets more composable, and serving as a conduit to facilitate porting liquidity to Cardano. It also removes a barrier of entry for multi-chain projects who have an active investor and user base on other existing and established networks.\r\n\r\n\r\nWhen you say “Have Ferrum taken a closer look at their services and development plans and did they come up with a viable avenue for integration?” Yes! We absolutely did. This was one of the main reasons why we opted against submitting a proposal for our Staking as a Service solutions like we did for F8. We wanted a renewed and more narrow focus this time around and thought the best approach would be to start with the biggest hurdle; interoperability. Think of MultiSwap as Phase 1 of the relationship between Ferrum and the Cardano community. Phase 1 is integrating MultiSwap and our Bridge protocols along with the underlying node infrastructure with Cardano. Ultimately though, Ferrum’s success is intended to be aligned with the success of Cardano. We want to build here because Cardano is projected to shape the future of crypto and blockchain at large over the next few years. But after receiving the feedback from F8 we decided that in order to ensure the success of this relationship, we will first integrate MultiSwap, THEN integrate our staking solutions so we can offer them  to projects on Cardano in order to incentivize TVL to move to Cardano and give new projects a way to provide instant utility for their community as they build their core products out here.\r\n\r\nLet's move on to the ‘Feasibility’ section. I cannot believe we forgot to add the blueprint for the \"Milestone Breakdown\" and budget plan. This was the most widely given criticism amongst the assessors so we really hope that this document ( https://docs.google.com/spreadsheets/d/1ReGjvFr-yK_MNJPtn0U4Cx-RqhK6MJ2CaHUxOnDPlL0/edit?usp=sharing ) combined with the below Milestone Overview and Budget Breakdown helps clarify some of the questions you had around that component.\r\n\r\nOverview\r\nMilestone\tEst. Duration\tFunding\r\n\r\n[Number]\t[Days]\t\t[USD Amount]\r\n1\t\t             21\t\t45,625\r\n\r\n2\t\t             67\t\t39,625\r\n\r\n3\t\t             45\t\t39,625\r\n\r\n4\t\t             30\t\t39,625\r\n\r\n5\t\t             15\t\t35,500\r\n\r\n\r\nTotal Amount \t$200,000\r\n\r\nBreakdown\r\n\r\nBelow is a breakdown on how the grant will be utilized.\r\n\r\n75% of grant:\r\nDevelopment\r\nTesting\r\nDev-Ops\r\nAudit\r\n\r\n25% of grant:\r\nMarketing\r\nSales \r\nEducation \r\n \r\nWhen you ask “will it be in beta mode available for anyone?” Yes! That is a huge part of our iterative rollout strategy. There will also be an Alpha testing period that comes prior to Beta and will be available to any of the Assessors or Project Catalyst community.\r\n\r\nIn regards to ‘Auditability’, we truly hope that some of the answers provided above will not only change your mind about your ‘Impact/Alignment’ and ‘Feasibility’ scores but also mitigate some of the trickled down sentiment as it pertains to ‘Auditability’. Thanks again for your feedback! While it was definitely the most critical, it was absolutely invaluable. If Ferrum is selected to Fund9, we will not let Project Catalyst and the Cardano ecosystem down!"}, {"id": 10015, "q0": "Proposed to raise the issue of not having to connect L1 networks to Cardano's EUTXO and EVM compatible networks, MultiSwap is a faitious implementation of the connection. Bridges are becoming an important part of the DeFi ecosystem due to the growing blockchain list, connectivity issues that will affect the value that continues to spread across the Cardano ecosystem. The solution of the proposal is to improve security, efficiency, performance and experience for users. By eliminating the 'lock/write and mold' mechanism, reinventing the architecture behind connected content has solved infrastructure problems. MultiSwap is the solution for projects built on Cardano that will not lose the nuances embedded in the project's token contract such as reflection (RFI), dividend or write mechanism. This has a big impact on Cardano's developers, it will be easier to link defises. way between ecosystems, so that growth is not limited to a single chain and will be scaled up in the future. The proposal directly impacts users, projects and the construction of dApp, smart contracts across various sectors in the blockchain space, contributing to the Cardano ecosystem. OpSec to ensure the security of the protocol. We have further comments on the risks that may affect the implementation, the removal of the 'lock/write and casting' mechanism will affect the programmed Smart Contract, DEX-based liquidity is not implemented, at this time can affect the user's activity in moving digital assets. The author needs to consider this, there is an appropriate risk reduction method when the Generator and Validator buttons do not launch.\nI rated: 4\n", "q0r": 4, "q1": "The proposal was well prepared, as shown in the plan, the plan described the work done with timelines in line with the stated solutions. The 20-day period for studies determines the appropriate expansion of integration into Cardano to provide a specific documentation of implementation. The plan shows us the possibility of swapping between Cardano and other platforms such as Ethereum, BSC, Moonriver, Harmony, etc. Theproposal clearly explains the technical aspects such as architecture, language, and technology being implemented. Carrying out marketing and sales is an integral part of the plan, pr campaigns are launched, having intended to use YouTube and podcast series to engage users. The human resources performed have been identified 6 members who have full information about them. They are the main members of the Ferrum community, full of information about the capacity and ability to implement the proposal. The skills and experience of the members will be assigned in accordance with the work of the proposal given. The resources given are appropriate for the successful implementation of the predetermined plan. We don't see your detailed budget, the author commits \"The money from the grant is used to fund the allocation of technical resources, project management, support and operations to integrate MultiSwap with Cardano\". There are no details on the budget analysis we have not been able to determine how much the funding will be used for the right purposes. If funded in F9 I would expect the author to have detailed information for the use of the funded money.\nI rated: 3\n", "q1r": 3, "q2": "In order to measure the progress of the proposal, the Author is committed to providing Catalyst with an open source Jira table to track the progress of each task. The report is conducted monthly with reports on progress and financial reports. In order to perform the audit well, we would like to see more specific metrics such as: test results, has the application been connected to Ethereum, BSC or other networks? We hope this is reflected in your detailed report. We look forward to seeing that the author's financial statements are full of detailed information about how much funding has been spent? Figures on paid Maketing implementations to perform user engagement? The specific work completed has been paid for. Indicators/KPIs of trading volume and traded assets are given, the application is ready to operate, this can perform an audit that determines the success of the proposal. \nI rated: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thanks a lot for the feedback z_assessor_3144! Regarding your point under Impact / Alignment around DEX liquidity being an issue, between Wingriders, MinSwap, SundaeSwap and MuesliSwap, there seems to be enough liquidity to support the volume on MultiSwap. If however, there is a project that does not have sufficient liquidity on any of the aforementioned DEXs, they will be able to add their own liquidity to a “bridge pool” of their own that can be connected to MultiSwap. \r\n\r\nAs it pertains to the budget analysis, this was by far the most widely held criticism of the proposal amongst the assessors. We really hope that this document ( https://docs.google.com/spreadsheets/d/1ReGjvFr-yK_MNJPtn0U4Cx-RqhK6MJ2CaHUxOnDPlL0/edit?usp=sharing ) combined with the below Milestone Overview and Budget Breakdown helps clarify some of the questions you had around that component.\r\n\r\n\r\nOverview\r\nMilestone\tEst. Duration\tFunding\r\n\r\n[Number]\t[Days]\t\t[USD Amount]\r\n1\t\t             21\t\t45,625\r\n\r\n2\t\t             67\t\t39,625\r\n\r\n3\t\t             45\t\t39,625\r\n\r\n4\t\t             30\t\t39,625\r\n\r\n5\t\t             15\t\t35,500\r\n\r\n\r\nTotal Amount \t$200,000\r\n\r\nBreakdown\r\n\r\nBelow is a breakdown on how the grant will be utilized.\r\n\r\n75% of grant:\r\nDevelopment\r\nTesting\r\nDev-Ops\r\nAudit\r\n\r\n25% of grant:\r\nMarketing\r\nSales \r\nEducation \r\n\r\nAddressing your questions around Auditability, we will absolutely divulge test results and update the community on when the product has been connected to the mentioned networks. The reports will also detail how much and where funding has been spent."}, {"id": 14007, "q0": "According to the proposer, MultiSwap reimagines architectural and Ospsec are best practices that providing the not only fastest but also most secure solution for the market with a huge number of partners and clients. This proposal focuses on exploit the liquidity of DEX to support for the ordered volume by the protocol is offered by this proposal. In other words, this proposal will create the MultiSwap as a useful tool for solving problem of fragmented liquidity and how it works is explained in the answer below. I am quite surprised when this protocol does not utilize a “lock/burn and mint” protocol like the current tendency. Moreover, the benefits which are brought by MultiSwap also mentioned in detail. Thus, we can see how much effective it is and I do strongly believe in the successful proportion of this proposal. Moreover, we can not deny that if the proposal is successful, it will contribute greatly to the growth of our Cardano community by attracting more users to platform since the liquidity problem will be solved in the near future. ", "q0r": 5, "q1": "I am quite again surprised about how well-prepared the proposer is for the proposal’s timeline and key milestone. There would be 5 milestones in this proposal in which provides a very clear and overall, all the necessary work and how many days will be spent on conducting the process. The proposer also explained each part for example what the team would do in PR and Influencer Campaigns, or how they will publish their series “Crypto at the Ferrum Roundtable” on Youtube and Podcast Series,etc. Furthermore, the experience of each member in team is really tremendous. There are members who are Ph.D, Co-Founder, CEO, or Lead Developer in this field and they have man-year experience also. I am quite ensuring that all the members in team can try their all best to contribute to the proposal. However, I suggest that although there are email addresses here, it is essential to attach the profile’s link so that people who are paying attention to this idea can verify and confirm about the ability of each member in team. Moreover, it will assist us to identify who we are supporting for. A minus point here is that there is not any specific number for budgeted costs. I am wonder about $200,000 will be used for which activities and which purposes here? If the proposer can include the explanation in more detailed description, it would assist supporters to understand why we have the number up to $200,000. For example, the proposer can make a list like the cost of develop the protocol, or marketing costs, etc. Anyway, to be honest, I quite appreciate this section. ", "q1r": 4, "q2": "I have a compliment about the proposal target. It is delivered quite clear and in-depth for Cardano community to catch/update the information, notification quickly. But I just want to say if there is a specific target segment to measure how successful the project is. For example, the protocol whether have or not the 1,000+ of the created wallet addresses, maybe TLV achieved 1milion dolar.", "q2r": 4, "assessor": "z_assessor_3870", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you so much for your incredible feedback z_assessor_3870! I wanted to let you know that the LinkedIn profiles for each of the team members mentioned is available by clicking on their names within the proposal. \r\n\r\nAs it pertains to the budget analysis, this was by far the most widely held criticism of the proposal amongst the assessors. We really hope that this document ( https://docs.google.com/spreadsheets/d/1ReGjvFr-yK_MNJPtn0U4Cx-RqhK6MJ2CaHUxOnDPlL0/edit?usp=sharing ) combined with the below Milestone Overview and Budget Breakdown helps clarify some of the questions you had around that component.\r\n\r\n\r\nOverview\r\nMilestone\tEst. Duration\tFunding\r\n\r\n[Number]\t[Days]\t\t[USD Amount]\r\n1\t\t             21\t\t45,625\r\n\r\n2\t\t             67\t\t39,625\r\n\r\n3\t\t             45\t\t39,625\r\n\r\n4\t\t             30\t\t39,625\r\n\r\n5\t\t             15\t\t35,500\r\n\r\n\r\nTotal Amount \t$200,000\r\n\r\nBreakdown\r\n\r\nBelow is a breakdown on how the grant will be utilized.\r\n\r\n75% of grant:\r\nDevelopment\r\nTesting\r\nDev-Ops\r\nAudit\r\n\r\n25% of grant:\r\nMarketing\r\nSales \r\nEducation"}], "solution": "MultiSwap reimagines architectural & OpSec best practices, providing the fastest, most secure & feature complete solution on the market while encouraging TVL across Cardano native DeFi protocols.", "experience": "With over 100 partners & an additional 200 clients, Ferrum has proven to be one of the most trusted & reputable Blockchain as a Service companies in the space. We've built & deployed about a dozen products & are regarded as a reliable & timely tech provider by those we work with."}