{"id": 418798, "author": "christianspeckhardt", "title": "Cardano for Impact Investors", "url": "https://cardano.ideascale.com/a/dtd/418798-48088", "category": 26598, "amount": 51000, "description": "SDG relevant Blockchain projects are not yet connected with the Impact Investment industry. There is no access to impact finance yet, across chains, and the sector is missing trust and credibility.", "f6_no_assessments": 6, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 925, "q0": "Tavis Digital has posted two proposals in Fund9. Whereas the other one is about conference participation, this one focuses on mapping out the most promising “impact tokens” (such as WMT or EMP) on Cardano and possibly including some of them in their token-based impact investment portfolio. “The ultimate goal is to invest in some of Cardano’s SDG relevant projects and typically their utility tokens.” This is a unique proposal that can propel the selected projects to new heights and it may attract a lot of ESG-oriented investors into the sphere of blockchain.\n\nTavis Digital combines the old with the new and couples that with a mission-driven approach. This will be attractive to a growing niché of cautiously curious impact investors. In time to come, Cardano will stand out as one of the most important chains for real-world impact and these types of proposals support that journey.\n\nThe team has made it easy to assess the fit into the challenge: they have proven other parts of their business concept with other chains (e.g. Algorand & Cosmos) and are now offering Cardano a centerpiece in their impact investment portfolio of services.", "q0r": 5, "q1": "While the fact that Tavis Digital is such a young firm calls for certain caution, it doesn’t take long to notice that the proposers themselves are heavy-hitters in the industry. The team obviously knows what they are talking about. Mind you, their ‘mothership’ Tavis Capital has more than 1,000,000,000 CHF under management so that gives them a little extra credibility.\n\nThe suggested budget would cover costs related to research, due diligence and legal fees. I can’t help but think that a lot of that initial research could be crowdsourced, although the rest of the process needs to adhere to traditional project vetting standards. The proposed plan makes sense, leaves plenty of time for rigorous analysis, considers key risks and neatly outlines a step-by-step process to follow.\n\nThe only thing that was not considered is the fact that if Tavis Digital buys a certain utility token en masse, on behalf of the investors, they could also benefit from that utility and become active participants in the said networks.", "q1r": 5, "q2": "The team has successfully listed the key milestones and goals and clarified the envisioned outcomes. They say they will be reporting progress to the community on a continuous basis. How is it done? The proposal doesn’t explain that. I guess we just need to take their word for it. That’s probably the only small minus in the otherwise amazing proposal.", "q2r": 4, "assessor": "z_assessor_2156", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1138, "q0": "The proposer comes off strong with his statements that SDG relevant Blockchain projects are not yet connected with the Impact Investment industry. That is verifiably false. Even in the Catalyst Town Hall prior to closing out the Proposal Assessment stage, Seedstars with their impact investment focus had a ~25 minute segment. Many accelerators in Africa, and even Catalyst itself are part of the impact investment industry. One claim is right though that there is little trust. From the perspective of SDG relevant Blockchain projects it often appears that most people who label themselves as impact investors are primarily investing in their Twitter threads and building up their egos.\nThat this proposal lists not finding impact eligible tokens for investment within Cardano is hilarious. Essentially the proposer is attempting to get money for a Google search and do a little bit of copy and paste with some rewriting.\nThe proposer further acknowledges that this could be a difficult endeavor with bad market conditions. I don’t know about you, but the market has been terrible and we will not get out anytime soon. Of course, not financial advice.\nThere is no cross-chain collaboration element. They mentioned work for Algorand, but they can not provide evidence that their work was impactful. I presume John Woods’ arrival at Algorand may do more for collaboration between Cardano and Algorand. This, of course, is not taken into the score - and it doesn’t have to. It is clear that this proposal misses the mark.\nThe company’s attempt to raise money from Catalyst with this proposal is not “innovative” but foolish.\n", "q0r": 1, "q1": "With CEXes shutting down left and right, delisting coins (hello eToro), Tavis Digital makes itself vulnerable to third party craziness. While the team’s profiles look at a first glance very professional (and connected) I am not sure they can pull everything off as it relates to having CEXes purchase tokens. However, they acknowledge that it may not be necessary. Can that team do some research and produce a report? I’m sure they can. Will it be valuable? Probably not, but that’s what the impact rating is for. I have full confidence that the team could pull of the minimum work to make this proposal their definition of success.", "q1r": 5, "q2": "While the proposal outlines milestones and deliverables, it does not commit to communicating these to the community. “Tavis Digital intends to report on project progress and goals.” They don’t say how and when. An intent is not good enough. Furthermore, if they were to deviate from that intention (i.e. they changed their minds), they would only communicate that to the community.\nWhile the proposer uses the word “collaboration” ten times in the text, there is no indication how their proposal would lead to any type of collaboration between any two blockchains.\n", "q2r": 1, "assessor": "z_assessor_2209", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1377, "q0": "Yes, the proposal effectively addresses the challenge by seeking to increase investments in blockchain-based projects that provide real world utility aligned with the SDGS. The team has already succeeded in working with Algorand on that chain, and now plan to bring their impact investment strategy to Cardano. One could foresee blockchains that are working towards the same goal may team up to reach their mutual objectives, which again would benefit the entire blockchain space by reducing silos. \n\nWhile the impact for specific Cardano projects may be limited as only 2-3 will be selected for investment, this proposal could result in a better sentiment towards blockchain writ-large. Currently, crypto is framed as a very high risk investment and having reputable investment firms supporting crypto-based projects could help bring some stability. \n\nThis proposal also aligns very well with the broader objective of Cardano - to drive real world impact and become the financial operating system of the world. Showcasing the value that Cardano (blockchain) can solve and then delivering that value are necessary to gain mass adoption; this project intends to do that and therefore should resonate well with voters. ", "q0r": 5, "q1": "Yes, given experience and plan presented it is highly likely this proposal will be implemented successfully. Tavis Digital hosts a strong team of investors and managers, and this is supported by the websites and documentation provided. The information provided is encouraging and implies that this team is up to the task. \n\nThe plan laid out is very clear and articulates each step, including the sub-activities, required to complete the project from ideation to completion. Given that there are hundreds of proposals now funded through Catalyst and hundreds more underdevelopment but not necessarily funded, it could have been useful for the team to provide their method to select the tokens to invest in, although they do list the criteria by which they will be judged in their documentation. I am still left wondering if it would only be funded proposals or all projects they may seek to invest in. If all, how would they amass that information? \n\nThe budget looks good, the only thing I wish the team had of done would be to assume the legal costs for investigating the onboarding of tokens. As it stands it appears as though there is very little downside for Tavis Digital and instead all the risk is born by the Catalyst community. Personally, I think the team could have taken on these costs to carry some of the risk, however it's only my personal opinion and doesn't necessarily reflect badly on the proposal itself. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. The team has done a good job at breaking down each component, what is required, and the deliverable to be shared. This inspires confidence that the community can at least know when these milestones have been hit. \n\nThe reason I am marking it down a point is because it is still a private business and may be hard for the community to have transparency on how, why, and when decisions are made until after they have been made. I would have liked to see the proposers provide a better explanation of community participation in identifying and selecting the tokens for investment, and then to receive regular updates on each of the tokens selected. Given that there may be conflicts between the community's desire and that of the shareholders/board of directors in the company, these details could become very important. \n\nAll in all, excellent proposal with likely a significant impact for the community. ", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4388, "q0": "The problem the team poses here is that SDG's related selling Blockchain projects are not connected to the impact investment industry, have not accessed impact finance, and have not been trusted. Thus, the team has identified the problem to be solved, related to the Challenge's set goal of \"Cross-chain collaboration\". I affirm this impact adds value to the Cardano ecosystem because the team's company wants to further develop the blockchain impact investment field, the chosen partner is the Cardano blockchain - specifically screening eligible projects. This is extremely advantageous for projects that have long been intended to develop in the Cardano ecosystem in terms of quality assurance and long-term development commitment. It is also very important that the image has a strong impact on the SDGs of countries around the world, which makes the proposal fully scalable and solves future challenges. We all know the importance of the 17 Sustainable Development Goals of the United Nations. The idea of ​​this proposal has a lot to do with that, that it has a huge impact in the long term if implemented well now, and especially affects those countries that are not yet facing the crisis. poverty and backwardness. I completely agree with the impact of this proposal.", "q0r": 5, "q1": "The team has experienced members in business administration, information technology, banking, etc... I find these experiences very suitable for implementing projects related to SDG. This proposal states that the team's cooperation with the Cardano blockchain, and having a team member with information technology knowledge is a huge advantage. I especially like how members prove their identity and profile by giving links to social networks (mainly Linkedin). Thus, the team has disclosed the identities of 7 members in quite a detail. It helps to gradually reveal the feasibility of the proposal and increase the community's trust in the team.\nThe budget of the proposal is broken down into sections and is reasonable to the goal, however, I would like the team to clarify what the costs associated with preparing the report include, which is expected to cost around 2500 USD? I have a question to clarify the feasibility of the budget proposal: If at Fund 9, the team has not been funded by Catalyst, does the team have other sources of funds to implement this proposal? (funds come from grants from other organizations)\nAbout the plan, and how to implement it: The team stated very clearly and in detail to demonstrate to the community the feasibility of the proposal. I see this as the professionalism of a company that has been well-known in the market for a long time. I very much agree with the team's plan and execution.\nRegarding the resources needed to implement, I have full confidence in the 7 members of the team that can implement this proposal. With the advice of experts that the team intends to hire, the probability of successful implementation of this proposal is quite high. I am very pleased with the option of hiring more experts, because through which the team can come into contact with the best people in the world in their expertise. Team members can learn a lot from the existing knowledge and work of experts. Even so, I found that some team members made other proposals in parallel with this one at Fund 9. Do you think this affects the quality of work? I suggest the team should demonstrate more clearly about the personnel to ensure good implementation of the proposed work. A resource that is 100% centralized, not distracted by other elements related to the other proposal. To further strengthen the trust of the community.\nI find that the technical aspect of proposing is completely related to the engineering of blockchain, cryptocurrency, digital securities, etc... This requires some personnel with technical qualifications. high technology when implementing the project. With the current team, I have no doubts about the feasibility from a technical and technological perspective.\nI agree on 3 risks - challenges related to the implementation of the proposal listed by the team. I just want to add more details about the risks: Unfavorable market conditions in cryptocurrencies and the risk of retardation, the team has started this quite satisfactorily. In addition, the team needs to think about how Ada's price slippage affects the team's budget when implementing the proposal? To avoid this risk of Ada slippage, my advice to the team is to consider and calculate well before requesting a budget from Catalyst. If the team needs additional funding, a specific, verifiable plan should be developed for further presentation.\nJust now, my questions and advice are positive contributions, to the team can refer to. I agree with the feasibility of the proposal. I vote 4 stars.", "q1r": 4, "q2": "I love how the team presents the roadmap and the milestones (the team attaches specific months of the year to the goals to be accomplished). As a Catalyst PA, I don't see many suggestions that do this. This presentation greatly facilitates the community to define transparency and auditability. The work lists are arranged in the correct order so that the construction can be done step-by-step - from building the foundation to the higher-level work steps. The team that did this was professional. Unfortunately, when I couldn't see the KPIs and key metrics. We all know the importance of these two metrics in an audit. My advice is for the team to quickly add these two metrics to further improve the transparency and auditability of the proposal. As for how to define success, the team did a great job defining success through four criteria: (1) Cross-chain collaboration, (2) Potential investment in Cardano projects; (3) Co-innovation and promotion; (4) Validate and participation in centralized governance. I completely agree with the definition of success. It somewhat improves the transparency and auditability of the proposal to the community. Throughout the proposal, the team clearly and easily described the problems and offered satisfactory solutions. I find that the team should add numbers to be able to identify the audit calculation, to compensate for the lack of KPIs and key metrics (2 important factors). I both agree and disagree with the auditability of this proposal. I vote 3 stars.", "q2r": 3, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12557, "q0": "Tavis Digital's impact investment offering Sphere is investing in impact/SDG relevant blockchain projects and their tokens. With this proposal, they plan to expand their investment activities to Cardano-based projects. With this approach, impact-driven companies and projects in Cardano can access additional funding channels. From this point of view, a positive impact for our ecosystem can be expected by a successful financing of the project.  Therefore, this proposal is perfectly aligned with the Challenge. This proposal will have a tangible impact as it will engage companies from all over the world and help establish new values in the corporate world.\n", "q0r": 5, "q1": "The company and the team seem to be broad and professional to execute and implement the proposal: Tavis Digital is a young and innovative Swiss based digital asset management company and has developed institutional investor targeted investment products in the crypto space so far. The budget is fairly sized and covers the cost of research and some sort of due diligence for potential supported projects. The timeframe is set to about 6 months. I think that is optimistic, but still doable. Given the experience and plan presented, it is highly likely that this proposal will be successfully implemented.\n", "q1r": 5, "q2": "The information provided is sufficient to review the progress and success of the proposal. Each step of the proposal can be tracked. Thus, we have clear targets and clear metrics. The budget is also tied to each stage of the proposal, which is clearly defined. This makes it easier for the auditor to verify the execution and disbursement of funds. The stage objectives are clearly defined in the proposal and how long it will take to achieve them. As stated in the proposal, the project will be completed between early 2023. Overall, this is a well done proposal and I see it as one of the best ways to bring Impactful businesses to Cardano. \n", "q2r": 5, "assessor": "z_assessor_3435", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14026, "q0": "Tavis Digital, a Institutional Asset Management for Digital Assets, is willing to spread the idea of Impact Investing into Cardano Ecosystem. Impact investing has the intention to generate positive, measurable social and environmental impact alongside a financial return. This is an idea with great potential to bring people from traditional investment side into crypto, more specifically into Cardano blockchain.\nThe team has detailed in a clear and detailed way the benefits of having such type of investments on Cardano ecosystem, and certainly the idea fits with the challenge once they have applied similar approach with Algorand, being now time to expand such collaboration approach to Cardano.\nAs for the risk mapping, the team elected some interesting points related to the risk of not finding impact eligible tokens for their investments, and also the possible difficult to make such operation possible (necessity to have a DEX/CEX with high liquidity of the elected token to be able to perform the operations). All important risks that should be monitored closely.\nSomething important the team could have mentioned that could give a better idea on the impact of this proposal is the magnitude of the possible investments to reach Cardano blockchain. From my point of view this piece of information is a must!\n", "q0r": 5, "q1": "On the feasibility side, the team has showed a detailed plan, including a timeline for the phases of the project and also key milestones. On this matter, I would suggest to provide a more detailed information in regards to the timeline, listing the time needed to fulfill each of the inner tasks they have listed, so we could have a better idea of the work to be done in more detail.\nOn the budget breakdown, the team has provided the necessary budget for each phase of the project. On this regard they missed the opportunity to match the budget with the specific tasks they elected on their timeline. Furthermore, on the timeline they listed 7 months of project, but if we sum the number of days they are asking to be paid we perceive they counted on 18 days (that will be spaced, ok… but will they only work 18 days on the project? And about the tasks listed on their plan?). Confusing.\nIn regards to the team background it is clear they are professional investors and chances are they know what they are doing.\n", "q1r": 4, "q2": "On the auditability side, the team is committed to report the project progress and goals based on the deliverables they have settled on previous sections. I missed the presence of some indicators to help measure the success of the project like a target amount to be invested on Cardano tokens in a timely manner, number of DEX/CEX able to perform their operations, size of their fund (monthly), percentage of fund to be allocated into crypto impact investment, and so on. They could definitely have been more transparent on this matter.", "q2r": 3, "assessor": "z_assessor_3872", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We represent a pioneer Blockchain Impact Investment fund, targeting SDG relevant projects and utility tokens. We are building cross chain investment methodology and propose to include Cardano.", "experience": "Tavis Digital combines in-depth and traditional impact investment and asset management knowhow with Blockchain expertise. Our innovative company is led by highly experienced experts with a successful track record. Tavis Digital is a spin-off of a Swiss regulated asset manager."}