{"id": 419671, "author": "silvia.ecclesia", "title": "United Nations Blockchain4Impact", "url": "https://cardano.ideascale.com/a/dtd/419671-48088", "category": 26598, "amount": 70000, "description": "The United Nations lack understanding on how blockchain can be used for achieving the SDGs and how to build partnerships with blockchain communities and startups.", "f6_no_assessments": 9, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 926, "q0": "This is a very unique proposal aiming to help demystify blockchain among the United Nations and related organizations in Geneva, Switzerland.\n\nIt doesn’t emphasize Cardano at all—which at first felt odd but which, after some careful deliberation, sounds like the right blockchain-agnostic approach. This is a subtle way of showing how Project Catalyst can have true cross-chain impact and impact in society. Through this initiative, the importance of tracking the Social Development Goals in all Catalyst-funded projects becomes more pronounced and the relevance of Cardano blockchain is increased. Therefore, this advances all the Fund9 strategic goals.\n\nThree events and (minimum of) 60 participants doesn’t sound like much of an impact. However, when you consider the networks these participants have, the ripple effects this might cause are immense. The outcome, “synthesis of findings”, may well get noticed outside of the crypto economy as well.", "q0r": 5, "q1": "The team of high caliber proposers are already in collaboration with UN agencies and related organizations. They have an understanding of global social and environmental issues and existing entrepreneurial solutions. Moreover, they have set a realistic seven-month timeline with a sufficient $70K budget. In conclusion, successful delivery of the envisioned plan is more than likely.", "q1r": 5, "q2": "The team has listed a good set of lagging indicators (outcomes) but not too many leading indicators that would measure progress. There could have been more explanation of how the progress will be communicated over the seven-month period, how the Catalyst community is kept informed and whether there are any opportunities for community participation online—before, during or after the events.", "q2r": 4, "assessor": "z_assessor_2156", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 980, "q0": "# GENERAL\nThe place from which the proposers come is most likely an honest an open minded one. However in it's current form it lacks clearly described impact.\n \n(-) Problem statement implies a top down approach to achieve SDG 's , this is contrary to the bottom up approach we see in ledger technology and their communities.\n\n(?) If UN has issues understanding shouldn't there at least be talks about co-funding R&D on achieving SDGs with DLT?\n\n(o) Proposer is a corporate entity with a (working / business model\noffering workshops , training and events around accelerating SDGs, prices for non public events/services not displayed on website. Why then the large price tag, 20-30 participants doesn't sound like a public event.\n\n(+-) Free public events offered as well in the past, not specified if the proposed ones will contain any\n\n(-) UN has a bad reputation from latest human trafficking abuse scandal .\n\n(+) Impact Hub Geneva , a brick & mortar impact collaboration space with a wide network of global players and SDG drivers.\n\n\n# IMPACT\nIt is stated that many influential stakeholder driving the SDG 2030 Agenda are located in Geneva, making the hub (potentially!) extra impact-full in regards to SDG and collaboration. However the way the proposal is described in detail, makes the overall impact for Cardano cross chain collaboration seem very limited (or not properly communicated).  \n\n(?) Why not invite some of the numerous SDG focused Catalyst proposals to Geneva, leverage synergies with impact hub network and interoperability ledger tech such as Cosmos. This would apply funds more cost effectively, as costs could be spread across all proactively engaged parties.\nAnother more sensible approach would be to start with a smaller scope (and budget), to demonstrate impact to the Catalyst community since this is the first time proposing. \n\n(!) Suggestion: Contact ( Melanie ) from Cardano 4 Climate; Idea : have preliminary\nonline presentations (alternatively sit through 2 minute pitch videos),\ntake a vote on which to invite and then have workshops and panels for a fraction of the price!\n\n(!) All tangible goals described in the proposal would be accomplished;\nPanel: Lotus Link for food SCM ; Origin Thread for clothing SCM\nWorkshops : Veritree ( Cardano Forest ) + open invite to impact focused DLT community\n\n(+-) Interesting to see if private impact sector and central institutions will engage with permissionless DLT and if yes to what extent.\nFrom personal past experience (KPMG + Maltese government) central entities always show incredible interest in the use cases, however always end up forcing a permission layer on top the tech stack, in almost all cases a migration to a more flexible, contemporary (central) DB infrastructure makes more sense.\n\n(+) Splendid idea to mix impact investors and startups with ledger tech communities and focus on driving SDG. Plus points for offering this capacity.\n\n(--) \"[...] organisation of future sessions more targeted to the UN and IOs (International Organisations).\" That's a deep orange flag, the needs of the ecosystems and biospheres we're still destroying should be primarily targeted.\nIt sounds as if Catalyst would pay for UN R&D, that seems a bit obscene , especially given the latest scandals around human trafficking.\n\n(?) What about the many grassroots initiatives and projects (especially in Cardano and Catalyst) in need of exposure, why not focus on their needs? Veritree, Earth Natives, Origin Threads, Lotus Link, The Alexandria Project, almost all projects related to Cardano4Climate,...) \n\nThe mindset for true impact has to change here. It's not \"How can we help the environment\", but \"how can we help ourselves not to try and help the environment, but actually helping her by letting her do her thing and live sustainably in symbiosis\". \n\n(-) Not \"[...] lack of awareness and understanding blockchains\", but inability to discern appropriate use case and/or apply to zero-sum game mechanics, is what's challenging to current central institutions.\n\n(+-) Risk of low participation level is well articulated and mitigated for, however what about if Covid measures will tighten, will events take place online?\n\n#FEASIBILITY\nCatalyst should pay (quite a lot!) for UN research into blockchain SDG use cases, this sounds a bit unfair. Why not scout viable use cases in catalyst and then co-propose a panel and workshop series to reach out to other ledger tech communities and specific members of the UN (when engaging with mindful communities its better to have a responsible person not an institution), with an action items agenda or rough road map of some sort.\n\n(-) Budget breakdown not detailed enough for level of funding\n\n(+) Timeline provided in sufficient detail\n\n(+) Based on the relevant experience and skills of the proposer team it seems very likely that the events will be executed and the research completed.\n\n(-) Proposers state they'll return for funding in later rounds to host more and larger sessions, \"based on insights, targeted towards\nUN and international organizations needs\"\n\n(-) No previous catalyst activity has been displayed, which makes the budget size and scope a hard pill to swallow.", "q0r": 3, "q1": "Catalyst should pay (quite a lot!) for UN research into blockchain SDG use cases, this sounds a bit unfair. Why not scout viable use cases in catalyst and then co-propose a panel and workshop series to reach out to other ledger tech communities and specific members of the UN (when engaging with mindful communities its better to have a responsible person not an institution), with an action items agenda or rough road map of some sort.\n\n(-) Budget breakdown not detailed enough for level of funding\n\n(+) Timeline provided in sufficient detail\n\n(+) Based on the relevant experience and skills of the proposer team it seems very likely that the events will be executed and the research completed.\n\n(-) Proposers state they'll return for funding in later rounds to host more and larger sessions, \"based on insights, targeted towards\nUN and international organizations needs\"\n\n(-) No previous catalyst activity has been displayed, which makes the budget size and scope a hard pill to swallow, the score is at the lowest edge of 4.", "q1r": 4, "q2": "The auditablility of this proposal will be difficult and not really visible until the events start or have finished. It's also a bit unclear how much of the events will be accessible to the Catalyst community. \n\n(-) Some more information on how the progress until the events start is tracked and measured, would be necessary to achieve a higher auditability score.\n\n(+) Leading and lagging KPI's are well defined, specific and measurable \n\n(+-) Success metrics are broadly defined, could go into more detail in regards to actionable or measurable cross chain collaboration primed by workshop, insights, panels? How many connections formed, and from those how many successful collaborations? ", "q2r": 3, "assessor": "z_assessor_2170", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for your assessment! \nTo answer some of your questions, the events will be free and tentatively in-person. However, Impact Hub Geneva is equipped to host online or hybrid events and we will definitely consider it. Thank you for all the suggestions of Cardano proposals we could present as use cases, we are already in contact with some (e.g. Cardano4Climate) and will definitely consider them. Please note that the purpose of the workshops would be that of raising awareness about the use of Cardano for supporting operations within the UN and UN agencies (all agencies in Geneva such as WHO, UNHCR, WMO, ITU, not just main bodies) and increase the visibility of already existing impact proposals within Cardano and Catalyst. Lastly, the amount of budget requestes for research is not for UN research on blockchain but for the Geneva Innovation Movement (non-UN organization) to conduct research on use cases and analyse survey and interview data during and after the events. "}, {"id": 1385, "q0": "Yes, this proposal addresses the challenge by aiming to provide an interactive educational series about the positive potential impacts of blockchain to the UN and its member organizations. The proposers plan to bridge different chains under the banner of \"blockchain\" rather than just a crypto. This approach may likely appeal to other chains in the space trying to deliver real world utility, and help deliver the project's broad objectives. \n\nUnfortunately, I can't give full marks here because it is not clear how the proposers would get the right chains to participate, nor do they give an indication of any commitments to participate to date. Given that the challenge specifically focuses on cross chain collaboration, the proposers could have spent more time explaining their plan to attract these other chains. \n\nThe focus on the UN is exciting but it's unclear whether the existing obstacle is the lack of information/videos. With all the content that has been developed on the potential use cases for blockchain, how would your workshop succeed where others have failed? Is it truly an information issue or are there broader obstacles that have hindered its adoption? \n\nTo get higher points I would have liked to see an indication that the proposers have considered these questions and/or concerns. ", "q0r": 4, "q1": "Given experience and plan presented it is unclear whether this proposal will be implemented successfully. \n\nFirst off, thank you to the proposers for providing their background, credentials, and links to their websites. This makes it easy for assessors such as myself to check and confirm whether the team could deliver. \n\nSecond, the team is committing themselves to host one kick off event and two blockchain-focused workshops with UN-affiliated organizations. The team's location in Geneva is likely a benefit given their proximity to the UN and that Geneva hosts many meetings per year with these UN-affiliated organizations. What is unclear here is the team's experience in the blockchain space. From what is provided it does not appear as though any of the proposers have blockchain training, which makes me questions their appropriateness to develop and deliver this proposal. Where would you get the information to be presented, what level of \"expert\" would you trust/empower to create the information? How will you ensure it remains up to date? Moreover, when you break down the plan into the events, it would have been helpful to understand the content that will be required for developing each of the workshops. \n\nFinally, the budget leaves something to be desired. While it's all there, it's too high level with general activities included but no real understanding of what amounts will be used for each activity. If they return for funding I'd encourage the proposers to include a better breakdown of the workshops, expected costs, and then itemize them in the budget along the same breakdown. ", "q1r": 4, "q2": "The information provided is sufficient to audit the progress and the success of the proposal. You can tell the team is passionate and has a big vision. \n\nFrom the plan that is laid out the community will be able to follow that the three events were in fact delivered, however, there could have been a better description of success and ways to measure it. The proposers plan to track # of people reached, # of experts from different chains, # of participants, etc... however it would have been good to include thresholds you wished to reach. Would 1 or 2 be enough to claim success?\n\nWhat is missing here are the details about what materials will be developed to support the events, and by whom. As mentioned in the feasibility section, if none of the team have blockchain training and that either must be learned or commissioned, these activities are not well outlined. The pre-event research from the University of Geneva definitely inspires some confidence but what type of vetting or confirmation of fact will it undergo? How will the experts be chosen? \n\nOverall a strong proposal with a few tweaks needed to get top marks. \n", "q2r": 3, "assessor": "z_assessor_2233", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1747, "q0": "The problem statement is clear and offers a connection between blockchain communities and the community of the United Nations members who will benefit from the knowledge of blockchain to solve significant global problems. While at the same time being a value-add to many different blockchain communities, not the least of which is the Cardano ecosystem.\n\nIt is clear that the Impact section certainly helps voters to see the connection between the work in this proposal and that of expanding the number of workshops that will help to educate others about the blockchain---in this case, perhaps \"blockchains\" more generally though? It is not sure from this section if this is the case.\n\nAs someone who's had logistics/marketing experience for significant events, I believe voters can be assured that the team does seem to have covered all the necessary areas to succeed. There is only one risk offered: the potential for a low turnout for the event. This is mitigated with clever targeted and widespread marketing encouraging participants to spend some of their small allotment of \"continuing-ed\" hours on this particular event. \n\nThe only concern in the proposal is that the only time Cardano or Catalyst is mentioned in specific (two of the stated communities in the Challenge brief) is in reference to further funding. Voters, proposers, and assessors will like to see the connection of Cardano/Catalyst in this more blockchain-broad education to UN members and staffers. It does seem implied, though \"seeming\" isn't proof. Please explain further if rewriting in a future round. Due to this issue, the team is given 4 stars for the Impact section.", "q0r": 4, "q1": "Voters can be sure that the team is adequate, given the stated bios, and that they seem to have the skills necessary for the team to succeed.\n\nThe budget offered is rich with detail in words (and seems reasonable, all things considered), though it is lacking when it comes to a detailed cost breakdown. One new element for Fund 9 proposers is the community's request to provide a $ per hour breakdown of labor. Beyond this, please offer more detail than you think you may need. Oftentimes, In Catalyst, transparency is rewarded with votes.\n\nThe plan is highly detailed, a model section for any proposer to be sure, with clearly defined areas that cover all main areas (research/curriculum dev, project management, marketing, & facilitation), and in a way that explains the 7-month timeline/roadmap in an easy-to-read way that will benefit voters in trying to understand this large plan in a concise map. Bravo, team.", "q1r": 4, "q2": "The roadmap offered in the team's detailed plan is relatively straightforward. They offer all milestones (month to month of the 7-month agenda) and individual goals to accomplish for each. They are giving themselves 3 months to commence research and preparation. This seems a reasonable goal for the work needed (research/curriculum for the first event, logistics, and marketing). The time horizon, if rewritten, would begin in the actual first funded month instead of prior (currently August 2022, when funding arrives in September)\n\nThe metrics are undeniably thorough and helpful. They offer (at least) the blockchain community at large a greater connection to those thinking about global solutions which would benefit directly and indirectly from learning more about the possibilities blockchain can provide to managing world systems. Voters will likely see the team is thinking long-term and are quality-first minded. \n\nThe team plans to provide the community with participant feedback after interviews/surveys are conducted after the events. Currently, the group offers no way for the community to track progress before this report. If rewriting, the team may want to consider offering a 2-minute weekly or bi-weekly video to offer updates or even open a Gitbook to report the team's progress for curious community members. It is with this rationale that the team receives 4 stars for Auditability.", "q2r": 4, "assessor": "z_assessor_2261", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4394, "q0": "This proposal is closely related to the United Nations, specifically the UN's use of blockchain to achieve the SDGs and how to build partnerships with blockchain communities and startups. Thus, the proposal to solve the goal set out in the Challenge is \"Cross-chain Collaboration\". The proposal also identifies a problem that needs to be solved, a problem at a macro level that concerns all continents and countries in the world in many different aspects (17 of the United Nations Sustainable Development Goals). United Nations). Cardano's use of blockchain has directly added value to the Cardano ecosystem. I consider this to be very beneficial for Cardano in particular and the cryptocurrency blockchain system in the world in general. The first step is to share knowledge within the UN ecosystem about using blockchain to solve challenges and create relationships with partners. It promises a lot of opportunities to be able to scale and solve future challenges. Because the development potential of cryptocurrencies and Cardano is extremely large, as well as in the world many existing problems need to be solved by all countries and the United Nations. I affirm the impact of this proposal - the image impact is of great world value.", "q0r": 5, "q1": "The team (Impact Hub Geneva) has many years of experience working with the United Nations and IOs. This is a valuable experience that you have accumulated. It makes the community believe in the feasibility of the proposal. Moreover, the members of the team clearly state their identities, personal images, and related information through the Linkedin social network, I am very convinced by this, I think this will help the community. more confidence in the prestige of the team. We all understand that publicity is very important for a proposal, or project - needs to demonstrate feasibility and transparency. The number of members in the group is also clearly stated, including highly educated people: masters, doctorates, directors, etc... I find this to be a desirable team if compared with the proposals. these are in Fund 9. The list is broken down into the 4 major categories of task heads. The team has carefully calculated to come up with a fee and salary basis. This is very reasonable. Through this, I see the professionalism of the team, and the feasibility of the proposal is gradually revealed more clearly. I have a question about the budget, if the team has not been funded by Catalyst in this Fund 9, will the proposal continue? Or will the team wait for the next Funds?\nProfessionalism is also shown especially in the planning and implementation of the project, through the launching events, seminars and research. What I see here is a methodical way of working like scientists. It's a way of working that's grounded in research, even with academic implementation. I strongly agree with this because it is important in demonstrating the feasibility of the proposal. Regarding the resources needed to implement, I know that the team has members working on other proposals at Fund 9, so I wonder if implementing multiple proposals in parallel will make a difference. affect the quality of this proposal? Because I understand the number of core members implementing the proposal is limited. Or the team can demonstrate that there is an abundant pool of people to implement the proposals, perhaps from the team or UN collaborators around the world. But I think there should be more publicity about the resources needed to do it anyway. This gives the community more peace of mind about its feasibility.\nThe technical aspect has shown that the team applies the Cardano blockchain very thoroughly when implementing the proposal. If there are plans to issue NFTs in the future, the team can further analyze the impact of NFTs on the project and the benefits of current and long-term NFT holders for everyone in the community. understanding community (this is my enduring advice). Because I know that my NFT is an indispensable tool when working on the Cardano blockchain. About the risk that the team has foreseen is the limitation of human resources for training and making plans to overcome. I would like to add another risk ADA's slippage, my opinion here is that the team should calculate more carefully if this slippage occurs to ask for a satisfactory amount of funding. enough to implement the proposal. In summary, I completely agree with the feasibility. I hope the team can take a closer look at my opinions on human resources and ADA's price slippage to qualify for the best implementation of the proposal. I agree with the feasibility of the proposal. I vote 4 stars.", "q1r": 4, "q2": "The great thing I found in the roadmap when I read the proposal was that the team presented milestones that were tied to specific times (specific months in a year). This creates very favorable conditions for the community to easily evaluate the transparency and auditability of the proposal. I see a roadmap extending from August 2022 until March 2023 with key output delivery product standards (number of sessions held, blockchain startups, minimum number of people) survey responses, etc...). These are roadmaps associated with criteria so that the community can evaluate the ability to implement and complete the proposal as planned. I appreciate writing the team's roadmap. However, it's a pity that I can't see KPIs and key metrics that measure performance. We all know how important KPIs and key metrics are in evaluating transparency and auditability. My advice is that the team should add KPIs and key metrics as soon as possible to give the community more trust and more basis to evaluate the proposal. For the rest, I agree with the definition that the team gave when answering the question of what project success looks like. The basis of the organization of the 3 trainees linked the level of interest, the survey results to the interview related to the United Nations, etc... is a satisfactory answer to this question. In summary, this proposal has the superiority and professionalism that has been demonstrated through a clear, easy-to-understand problem description accompanied by a satisfactory solution. I highly encourage the team to do this in any subsequent proposals (if any). I agree with the transparency and auditability of the proposal. Hope the team considers my opinion on adding KPIs and key metrics. I agree with the transparency and auditability of the proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6231, "q0": "This proposal seeks funding for the development of a knowledge sharing series with the UN ecosystem on the subject of using blockchain to solve the Grand Challenges.\nThe problem is well outlined, the United Nations lack understanding on how blockchain can be used for achieving the SDs.\nThis proposal will seek adoption and collaboration with the whole blockchain ecosystem rather than with a specific blockchain, this brings it in line with the challenge goals. Precisely the proposal addresses the awareness and understanding common challenges outlined in the campaign brief.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The idea of the proposal is clearly explained in an understandable language. \nThe proposer outlines a specific for the project risk and provides a mitigation strategy to reduce this risk.\nThe time plan of the proposal shows that the project will be finalized at the end of March 2023. The plan is reasonably detailed.\nThe budget of the proposal is outlined by departments/sectors, rather than broken down to position/hours/hourly wage. The proposer is basing all costs and wages on the average costs and wages in Geneva, Switzerland.\nThe team is presented very well and the presentation is supported by linkedin profiles for support and further research.\nThe proposer will return for funding to Catalyst for the further development of the project with more in-depth, longer, or a higher number of sessions.\nThis proposer has 4 proposals in fund 9 for a total ask of $128500.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer presents a list of KPIs that will help in the auditing of the project’s progress. The main deliverables from the plan could be used as milestones for concrete numbers against which to compare the real progress. \nThe proposer fails to present a channel that the community could use in order to find the presented information.\nThe proposer outlines success metrics that are not easy to measure and are not supported by hard numbers. However we could take the deliverables from the plan and use them instead.\nDear proposer, keep in mind, that the auditability of any project has to present concrete numbers and dates against which the community to compare the real progress of the project in order to audit the project.\nI agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 4, "assessor": "z_assessor_2795", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9037, "q0": "The goal of this proposal is to put on three blockchain events in Geneva targeting UN and international organizations.  These events will be designed to teach blockchain and to develop collaborations between multiple chains and actor's and staff within the UN and related organizations. The goal would be to teach how blockchain can be a contributing factor in solving sustainable development goals. There is a substantially high possibility of impact regarding this proposal. If successful, these training events could onboard many new large organizations to the cardano ecosystem. In collaborating with other blockchains the benefits of cardano could be made clear to future developers. The potential of creating a solution to help solve sdg issues within the United Nations built on cardano will only increase with the success of this proposal. I think the impact of this idea is huge and therefore I'm giving it a score of 5.", "q0r": 5, "q1": "The team's qualifications are a huge benefit to this proposal. They have the skills and connections necessary to make these events feasible and successful. The budget seems a little high, especially for the fact they only hope to attract 20 to 30 participants. Based upon the detail in the plan, it would seem like these events should be attempting to reach more people. Part of that may be my own ignorance of the way things work in Geneva and regarding the United Nations. However, putting on events in collaboration with other blockchains in a city with so many connected and networked people, it would seem that 20 to 30 is a low attendance goal for three events with a budget of $70,000. So while I believe it is feasible for them to reach their goals, I feel the budget is a little high for such a low number of impacted individuals. That is why I'm giving this a score of 4.", "q1r": 4, "q2": "Based upon the metrics, the clarity of the goal, and the transparency evident in this proposal, I believe that this project deserves a fool 5 point auditability score. They plan to measure the number of participants, the progress towards planning the three events, the impact of their outreach and marketing, and they plan to survey participants in order to determine the effectiveness of the events. Ideally, this team will submit monthly reports to catalyst, and be available for conversations and follow-up. They have listed their LinkedIn profiles and are available to be reached via social media. This proposal would have a huge impact on furthering the usefulness of the cardano ecosystem and potentially bring in large scale projects from clients such as the United Nations.", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12138, "q0": "Strongly agree for UN to colaborate with Blockchain ecosystem,especially Cardano. IO can have benefit from knowledge on technology based blockchain and educate more people while Cardano will get the exposure and showing the true color of their vision and mission, together along with the passionate and healthy environment that would represent the community's heart. Very tactical yet practical also when it comes to open discussion on supply chain ( since indonesian universities also have its attention on supply chain of Blockchain funnels ), the direct impact to change the infrastructure or adding more option on fundraising through blockchain will surely gives a direct increase of use cased of token. The efficiency of system offered by blockchain will cause the distribution of food across the globe very fair. While the people who gives and donate the fund will see clearly and more transparent on how the NGO works and perform. UN involvement on blockchain policy making toward other network and stakeholders also will gives additional perspective of how international law are applied and affect Cardano in the future. Rest assure, the high actor level that speak out for Cardano as an influencer will benefit the content which will be delivered.This risk should be handle considerable by the proposer also. ", "q0r": 4, "q1": "This proposal project's roadmap clearly gives a time to digest from each month they initiate the event. They will take step carefully to build the infrastructure of blockchain with UN action plan. The target people on this proposal also choosing the best side of it since the key actors to speak out through many aspect such as politics, environment, social, governance are very essential to shape the people's mind concept and way of thinking furthermore.Sadly, the budget breakdown seems bring this NGO and IO things that is very charity and based on DAO similarity cost too much, with that amount of money, it can create from scracth to build new NGO and new management with the equipment of blockchain support. But surely they will have an obstacle as a new movement to reach certain key actors and levels in various industries, also promoting the event and awareness through many form of contextual matter. However, i still believe from their cost of research and academic expertise will gives Cardano multiplication and big impact of continous action and resolution, since NGO such as UN always end up on giving the best resolution for people.", "q1r": 5, "q2": "Clearly described, the measurement will based on awareness and reached number of people with beginner level of participant. With the statement of \"this series will spark further connection and collaboration between UN,IOs and chains,private sectors and startups\" , truly this proposal will have continuation and by get this funded, it will make the first leap of faith from blockchain ( cardano ) to deep dive the projects of UN for the world. People are being encourage to know more about Cardano since it will help Sustainable Goal Development like ending poverty, hunger , and many issues around the globe. You can find almost 17 SDG focus from this proposal. Interesting and very satisfied to read. A charming colaboration and innovative movement. Bravo !", "q2r": 5, "assessor": "z_assessor_3362", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 14767, "q0": "The proposers found that the understanding of blockchain including how it works to achieve the SDGs is quite limited for The United Nations. The way to build partnerships with blockchain communities and startups has not really taken off. To overcome this situation, the team came up with the idea to build a knowledge-sharing chain in the UN ecosystem by using blockchain to solve major challenges and create partnerships. tangible transdisciplinary. I personally support this idea and believe that the project will bring great benefits to the community when it is successfully implemented.\nThe team chose Geneva to host the event because they have carefully researched the conditions to help the project develop and realized that it is possible to mobilize capacity, skills, experience, and ideas to build the project. . The functions and features of the project have been clarified by the proposers. The main components and main activities of the project are also described in detail in the proposal. Furthermore, the proposal team identified the target audience of the project as The Geneva Innovation Movement and the University of Geneva. The influence of this project is also seen through the content presented in the proposal.\nThis project promises to solve common challenges for all blockchain communities lacking awareness and understanding. By connecting international stakeholders with different chains and introducing them to the blockchain community, a wider audience will be attracted to the Cardano ecosystem. This shows that the project ensures the correct implementation of the key metrics set out by the Challenge. The outcomes that the project aims to achieve are clearly mentioned. Through the proposal, the community can see the impact that the project creates.\nThe difficulty that may be encountered when implementing the project that was foreseen by the team is ensuring the number of participants in the workshop. With their experience, these difficulties are all planned to be satisfactorily resolved and ensure the project implementation progress according to plan.", "q0r": 5, "q1": "The project implementation plan proposed by the team lasts from August to October. The plan is specific and very clear about the tasks to be performed. The plan identifies the milestones. Each milestone specifies the results to be achieved. The proposal has a realistic timeline for completing the given tasks in a logical manner. Proposal has shown a reasonable plan not only in terms of what they will complete, but also how it needs to be. The details of the technical and technological aspects required to implement the plan are also included in the proposal. Proposers also clearly define the positions and number of people needed to carry out the proposed project. Based on this detailed plan, the community can see the potential of the project and the ability to achieve the set goals is quite high.\nOverall, the budget given by the team is reasonable. Expenditure items are clearly stated. The team also shows the details of each activity and assets to spend in each category. These costs are all public and transparent.\nThe founding team gathers members with full experience and knowledge to implement the project. They are talented and dedicated people. With the leadership of the founding team, the project is expected to achieve outstanding success.", "q1r": 5, "q2": "The proposal team provided the criteria to measure the success of the project. That is the outcome of the project. These results are considered to be in line with the detailed plan set out by the information about the results of the milestones in the plan once clearly confirmed. However, to make it easier for the community to track project progress and evaluate success, the team should provide clear quantitative indicators. Criteria such as who is approached through access to information, experts from different chains are represented, the number of participants in each knowledge-sharing event, etc. need to be given specific numbers...\nThe successful image of the project is clearly built by the team. This content has defined the success that the project will achieve. Those are parts of the finished project.", "q2r": 5, "assessor": "z_assessor_4099", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "A knowledge sharing series within the UN ecosystem on using blockchain to solve the Grand Challenges and creating tangible cross-sector partnerships", "experience": "Impact Hub Geneva is a lab for social innovation and entrepreneurship, with years of experience working with the UN. Geneva Innovation Movement is a cross-sector research and training platform, providing training in innovation and digital transformation for the UN and IOs. "}