{"id": 419745, "author": "latinstakepools", "title": "Onboard New Hispanic Ethereum Users", "url": "https://cardano.ideascale.com/a/dtd/419745-48088", "category": 26598, "amount": 4440, "description": "Misinformation and disinformation regarding Cardano in Ethereum communities, as well as lack of quality educational material in Spanish, creates barriers of entry to new Hispanic users and developers.", "f6_no_assessments": 5, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 635, "q0": "The goal of this proposal is to create a series of videos in Spanish explaining the misconceptions and disinformation about Cardano inside the Ethereum community. This way, the proposer claims that Ethereum users will better understand Cardano and tend to migrate to use this blockchains instead of Ethereum. The idea is quite straightforward, and it is simple to understand. The proposer mentions that a survey has been made inside the Ethereum community and this resulted in the 6 different topics that they want to cover on this video series. They all make sense, and as high-level information, might be very useful and informative. I understand that the proposer comes from the Latin community and that’s why the videos are going to be published in Spanish. Although it decreases the reach of the proposal in comparison to English, it’s interesting because there is already a lot of content in English. Even if developers don’t migrate to Cardano because of this proposal, their perspective about Cardano might change for the better. This proposal is aligned with the challenge since some developers might be influenced by it to at least test developing on Cardano. Even though it’s difficult to measure exactly how many developers migrated to Cardano because of this proposal, some KPIs mentioned in the auditability section will give a hint of the reach of the produced videos. If successful, the same initiative could be made for other languages, in partnerships with translators and narrators, using the same content as basis. Overall, especially for the cost/benefit ratio, I believe this proposal might have a very good impact for Cardano.", "q0r": 5, "q1": "The presented roadmap is very detailed, with action items for every week, from week 1 to week 9. Since it’s one per week, it might be a bit challenging to deliver everything without any kind of delays, but also since the proposer has experience in producing these kinds of videos, I believe they might have the necessary knowledge to make a feasible plan. Also, on this topic, the proposer has shared a link to his YouTube channel with over one hundred videos already published, and even though their reach is not big yet (I’ve only seen one video with over 1k views), I believe the videos will be produced with good quality. The budget is well broken down and explained per kind of task (research, scripting, producing, graphic design and editing). Although, considering the number of views on their current YouTube channel, I’d consider adding some marketing budget as well, because it’s necessary to make people aware of what’s being produced, and not only produce it. The proposer presents the team members and links to their profiles, which can be verified bringing more confidence to the proposal, but for graphic designer and editor they are still to be defined, which is not ideal for the project’s feasibility. I believe this proposal has a very low risk of being unsuccessful, and as mentioned in the proposal itself, besides team members getting sick, I don’t see other ways of how this could failure, besides the already mentioned aspect of having low visibility due to lack of marketing.", "q1r": 4, "q2": "The way that the community has to keep track of the progress of this proposal is to check the uploaded videos on their YouTube channel, according to the planning presented in the proposal itself. Besides that, there’s not much more that we could ask for, especially since the schedule of this proposal is very tight, every month we would have 2-3 videos uploaded that can be checked. The metrics of numbers of views and average view time, based on YouTube analytics, will give us a good understanding of how effective these videos are for the Hispanic community. The definition of success of this project is a bit abstract, since it mentions “Success for this project is to open the minds of members of the Ethereum community to the possibilities and technology of the Cardano ecosystem”. This is indeed a good goal, but it is not possible to really measure it, unless there is some kind of survey for the audience of these videos. It would be better to have goals that would define the success of the videos, for example, minimum number of views per video and their average view time. Overall, the auditability of this proposal is very good.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1139, "q0": "This proposal was also posted in the “The Great Migration (from Ethereum)” challenge where, in my opinion, it would have been a better fit - or so I thought. Martin answered the question why he did not keep his proposal in said challenge and archived it instead. He mentioned that the Ethereum-focused challenge has no reference to education material.\nBy producing information about Cardano in the form of videos in Spanish, the proposer is looking to bring spanish-speaking Ethereum developers into the Cardano ecosystem. Martin Ungar shows great understanding in the selection of videos to produce. While the fully converted may want to spread the Haskell/Plutus gospel, topics like EVM sidechains are more suitable as entry points.\nVideos are a preferred (additional) format to gather knowledge by many developers.\nDue to its scope and outlined goals, I still agree that the proposal effectively addresses the challenge.", "q0r": 5, "q1": "The average hours per video production is set at 48 hours. Hourly wages are set at $15 with the exception of graphic design which is higher at $20. The Latin Stake Pools Youtube channel with over 1200 subscribers has shown that they can and do produce the type of content that is proposed here. The timeline is broken down into manageable chunks. Therefore, it is highly likely that the proposal will be implemented successfully.", "q1r": 5, "q2": "The outlined information is enough to track the progress of the implementation of the proposal. However, the proposal’s goal is to onboard new spanish-speaking Ethereum users and it does not have information on how it measures the progress or success of the goal. Youtube analytics does not provide that data nor can it be inferred.", "q2r": 3, "assessor": "z_assessor_2209", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6128, "q0": "Misinformation about Cardano in the Ethereum community, as well as the lack of quality educational material in Spanish, creates barriers for new Hispanic users and developers. Spain has a population of more than 47 million (in 2020). A large population is a condition for the Cardano ecosystem to develop quickly and widely. The team proposed the idea of ​​​​creating a series of educational videos in Spanish addressing the main misinformation arguments that exist within the Ethereum community regarding the Cardano ecosystem. The proposed impact on the challenge posed and described is rich and detailed. The authors suggest creating videos for production with multiple goals in mind: explaining how Project Catalyst works; remove misconceptions about the Cardano blockchain... Producing these educational videos in Spanish will help reduce barriers and build bridges of understanding. In addition, the author finds that the only risk is: illness or death of project participants. This is the risk of human resources having influence in the project. However, that cannot be prevented by natural, everyday things. But in my opinion, it is possible to establish a process that is sure, transparent and full of experienced professionals to replace and quickly resume the work that needs to be done. Ensure continuous and successful progress. Ensure project sustainability.", "q0r": 4, "q1": "The proposed team outlined a clear and detailed plan. The proposal will be implemented once funding is received. Information provided to us about the route will be done in 9 weeks. The tasks that need to be done in 9 weeks are clearly analyzed. With the plan sheet provided, we know all that will be done and in what time period. Next is the budget. proposed budget request $4,440. This is a fairly low budget and is explained in detail transparently. Expenses are broken down by hourly rates and reasonably explained. Finally, about the members who will participate in the implementation of the work in the project. The group has 2 members: Martin Ungar and Lautaro Falcone. We know about each member's identity, role and skills. All in all, the roadmap, budget and team are all presented in a transparent and consistent manner here.", "q1r": 5, "q2": "The proposal has provided us with many metrics so that we can easily check the progress of the project. Are: upload videos by the number of weeks described in the blueprint; the number of views the video received (compared to previous uploads); video engagement (Source: Youtube analytics). That means we can track in many ways how the project's phases will develop, and we know what value it will bring to the community. And the final product is what is expected, the success of this project. Since we are provided with a lot of information, I believe that information is complete and satisfactory has been established. Detailed plan and transparent budget, increasing the auditability of the project.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6402, "q0": "The intentions of this proposal are noble and there is no doubt that it would provide enormous value to those willing to learn more about Cardano. Nevertheless, the key word here is \"willing.\"\n\nThat said, I have my doubts about whether the Ethreum community will ever watch these videos without an active diffusion or incentive campaign. The first video, titled \"Project Catalyst community funding for Ethereum developers\" is the only one I can see getting some traction within the Ethereum community, precisely because it implies some benefit for its developers in its title.\n\nIn other words, I'm concerned that this proposal lacks a penetration plan for its target audience besides the production of the mentioned videos. For that reason, I can neither agree nor disagree that it will have real impact on this challenge.", "q0r": 3, "q1": "The schedule and budget in this proposal are highly detailed, and the previous work from the team, which can be found in their YouTube channel, is more-than-enough proof that this team is unquestionably capable of succesfully implementing this proposal without any major inconvenients.\n\nOn the other hand, I don't the author of this proposal hasn't analyzed the risks thoroughly. \"Illness or death\" are extreme cases and pretty much implied on every proposal. I'd like to see the author further explore the real threats to the success of this proposal, such as backlash from biased, maximalist Ethereum community members, low visibility and interaction with the videos, platform censorship or inaccessibility, etc.; and provide real strategies to mitigate these.", "q1r": 4, "q2": "The metrics provided are clear to the progress and results of the proposal, and seem easy enough to measure and verify. Therefore, I believe this proposal is fully auditable. I'd recommend adding a fourth metric consisting of a click count on a trackable link pointing to an educational content library about Cardano and its ecosystem. That would give clearer insights on how many viewers took further interest on the Cardano network.\n\nJust one final comment: First, writing the metrics with bullet points instead of paragraphs helps readibility and facilitates finding the information for the PA. Please consider that format in the future!", "q2r": 5, "assessor": "z_assessor_2815", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 15331, "q0": "The proposal is very accurate and masterfully meets the objectives of the challenge. Here we are looking for projects that can generate a partnership between Cardano and other blockchains, giving rise to cross-chair projects in the future, for example, and promoting greater popularization and adoption of our network. The idea of this one is to combat misinformation about our ecosystem within the Hispanic Ethereum community. It is said how this public has already adopted the network before because of the instability and inflation of the economy of their home countries. It says exactly what would be done (“Create a series of educational videos in Spanish addressing the main arguments of misinformation and misinformation that exist in the Ethereum community in relation to the Cardano ecosystem”), and in addition, the subjects that would be addressed are also specified. .", "q0r": 5, "q1": "Undoubtedly, it is a very viable proposal. We know in great detail what the roadmap, the task schedule would be like. It is reported to us based on weeks, and the amount of information given per week is quite satisfactory. In this way our understanding of the process is quite solid. The bidders are presented in a very satisfying way too, it gives us a good summary of who they are and their linkedin profiles. With that, a good trust is passed on in them, I also think it's positive how they have the text in English and Spanish, to make it easier for the target audience to understand the proposal. Finally, the financing is explained in a very detailed way as well. Not only is the whole divided into some parts, but they are also detailed in themselves, as we can see from the example: “Graphic design: Average 12 hours per video, $20 per hour, $20*12*6=$1200”.", "q1r": 5, "q2": "3 metrics are suggested to track progress, such as “upload videos in the number of weeks described in the plan detailed above”. My doubts are: how could we follow the video development process, its creation, what would be behind the partial results? What means of communication will the proposers use to keep in touch with our community? And about the final success, lastly, although the proponents have summarized what we should expect, this part could still be more complete. They could have suggested qualitative and quantitative data that demonstrated the final results, and that were easily organized into some demonstrative presentation; How did Hispanics using the ethereum network adopt Cardano after the videos were released?", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a series of educational videos in Spanish addressing the main misinformation and disinformation arguments that exist within the Ethereum community regarding the Cardano ecosystem.", "experience": "Latin Stake Pools is a Youtube channel for the Hispanic community to learn about Cardano and Blockchain technology. With over a year of activity, 146 videos published so far and +1200 subscribers."}