{"id": 419813, "author": "zoeselina", "title": "Catalyst Ticker on Twitter", "url": "https://cardano.ideascale.com/a/dtd/419813-48088", "category": 26598, "amount": 850, "description": "There are many resources for Catalyst, but not a simple Ticker that provides the most important information. Communication is important, and it needs to be enhanced for better overviews and less FOMO.", "f6_no_assessments": 10, "f6_rating": 3.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 1297, "q0": "The proposal aims to provide a “ticker” which is basically a twitter account that is announcing and sharing the information that are important or crucial. These information are accessible without any restrictions or rules e.g. attendance to IOG TH or joining the telegram, thus it makes a good open source for those who would like to stay up to date. The purpose of this ticker is to focus on timeline regarding to the Catalyst, and provides updates about phases – proposal submission, assessing, voting etc.  I agree that it will serve as an easy entry point for anyone interested. The only suggestion I am having is to always keep relevant hasthtags in posts e.g. Cardano/blockchain/cryptocurrency – just to attract even those who are not already knowing what project catalyst is (based on inspection of one tweet provided as an example, where only “projectcatalyst” was added). This could potentially increase the desired impact for crosschain collaboration, serve also for onboarding, and increase the audience in general. I am taking one star down, because the impact will be primarily on newcomers (veterans=more than 2 funds, are already used for TH + telegram announcements) therefore the target group will be narrowed a bit. Overall I like the idea, I am just not convinced that it will be causing as much impact on Cardano, and that somehow many cross chain collaborations will emerge. I think its primary goal would be to keep newcomers up to date + onboard those who are wandering twitter hashtags with interest in cryptocurrencies. ", "q0r": 4, "q1": "To make a twitter account is definitely feasible – which proposer already done – and also to reproduce the original announcement to tweets – also feasible. There is no hard skill or experience required so from this perspective there is nothing to be worried about. The proposer outlined topics that will be tweeted, and these follow the fund phases + some updates or relevant tricks will be posted as needed e.g. save all three assessments one by one (useful advice for newcomers, for sure). The requested budget is 850 USD, for 4 months, with hourly rate of 25/USD. Right now, I find it reasonable and justified enough, for the future, it would be nice to track the number of followers or interactions to actually assess whether this service is needed and is growing on popularity. – I am reacting for the possibility to ask funding for another fund. So, if you decide to apply, it would be the best to support it with the increase in numbers by time. The proposer – Zoe – I am familiar with, she is an active member in the community, and I have trust that she can deliver the proposals goal to the finish line. ", "q1r": 5, "q2": "The problem solution is quite clear. As a problem, the proposer perceives communication noise + too many information, and wants to solve it with a simple ticker by posting only the relevant information for overview. To track the progress – we can monitor the posts, that are ongoingly posted. Regarding the success we can track the overall number of followers, likes, shares, posts, tweets = engagement on the community in general. For success metrics, the proposer state that “successfully onboarded many new members to Catalyst” will be measured – but it is not disclosed how. There are another metrics stated by the proposer, but I do not find them reliable such as “had fun reaching/watching”, or “ticker became an easy entry-point”…I could not come up with a way how to actually measure it. I think for assessing the success, we need to see some engagement level + to be able to track that it onboarded someone + that it actually formed some cross-chain collaboration. ", "q2r": 4, "assessor": "z_assessor_2222", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for your thoughtful assessment! Appreciate it, and super good point about the hashtags. Noted."}, {"id": 11252, "q0": "The proposal highlights a need for an easily accessible means to gather information regarding Catalyst. The suggestion is a currently existing Twitter account \"Catalyst Ticker\". Upon reviewing the Twitter account, it is shown that regular updates have been made since its creation and the updates are clear and concise. This is much needed in the community as there aren't many quick and concise guides in regard to the Catalyst. However, does it help with cross-chain collaboration, that would be another question. What the Twitter page does is mainly guide the current Cardano community. ", "q0r": 3, "q1": "The individual that sent this proposal has a Twitter account since the May of 2022 and it has been constantly updating it with useful information in regards to Project Catalyst. The information is detailed and helpful, especially to newcomers. The plan given in the proposal gives a decent explanation of what to expect and some of the updates have already been made as we are some ways in Fund 9 already. The amount of funds being requested is extremely reasonable and said amount should facilitate the plan highlighted in the proposal. As for the team, there is only one, Zoé. Although she has shown decent updates since June this year, however, there is no track record of her previous experiences. This might cause a bit of a concern. Overall, as the task for Zoé at hand is simple I believe it is likely that her proposal will be implemented successfully. ", "q1r": 4, "q2": "The means provided to track the progess of the proposal is very straightforward and practical. There are 2 numerically measurable;  growing number of followers and the engagement with the posts (likes, retweets and comments). These should be more than sufficient to see the progress of the proposal. \n\nAs for auditing the success, in said proposal, it states there are several ways to assess it. However, among them only the following can somewhat assess the success of the proposal. Such as the Ticker becoming an easy entry-point to the Catalys, which can be seen along with its growth and the other aspect is by informing and updating regarding the Catalyst to the general public. ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 15025, "q0": "The proposer asks funding to create a twitter account to update users on the timeline and deadlines for Catalyst and Cardano milestones, without realizing that actually there is an already exising twitter account for this(https://twitter.com/CardanoDates). The proposal does not addresses the challenge at all, as there is no cross chain collaboration possible after the completion of the above mentioned proposal. I think the proposer did not get completely the meaning of cross chain collaboration. \nMoreover, the proposer states that there will be a decreasing of the FOMO related to following the official channel. The statement is not clear and in my opinion, the promotion of this new twitter channel will simply duplicate the news already available on the official channels.\nThere is no plan that shows the frequency of the posts published to keep up the engagement. To enrich the channel I would suggest the proposer to stream live AMA spaces.", "q0r": 1, "q1": "\nDespite the proposal should not be implemented due to the reason mentioned above, I will comment the feasibility for the sake of completeness. \nThere are some points that show lack of preparation. For example, in the risk section I read that one of the risks is \"I get unexpectedly sick when I should be preparing and posting a tweet/thread\", so the solution is the proposer hires someone who \"would prepare the tweet for me, send it to me, and I then just post it\", with no indication of who is the backup chosen.\nThe budget asked is 800 dollars per fund, and the proposer would come back for more funds to continue her activity. \nThe proposal remains very feasible because it requires only to post content on Twitter. ", "q1r": 2, "q2": "\nThe information provided are enough to demonstrate that this proposal will not help to accelerate Cardano in the cross chain collaboration. I let the voters decide in the following post is worth 50 dollars (according to the budget required and hourly rating asked from the proposer): https://twitter.com/CatalystTicker/status/1535360858456473600\nKPIs make sense to me as they include the number for new followers, and their engagement with the posts.", "q2r": 3, "assessor": "z_assessor_2215", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15047, "q0": "I like this idea of a Ticker on Twitter. The idea is to provide go to information or latest news on Cardano to the community and other people who want to scout around for information on Blockchain. It aligns with the setting of this challenge because it creates a platform for people in other communities to get to know about this ecosystem and to share their ideas to make this community better. I however gave a rating of 4 because I believe the telegram groups and other social media platforms provide similar service as proposed. Perhaps proposers intend to add certain innovations which are not mentioned in the proposal. \nI also believe this can scale to fill future information gap in the ecosystem. ", "q0r": 4, "q1": "The proposer gives milestones and timeline that spans the fund cycles of Project Catalyst. This means that the proposer will be giving updates throughout the funding cycle to avoid the fear of missing out on critical information. The plan involves risks and mitigation plans. I followed the twitter link and I realize the proposer has already started working actively. The budget given is within reasonable limits and covers the working hours of the proposer and the personnel she will employ. The proposer provides links to her bio and links to some threads she has made. If funded I think this proposal will be implemented successfully. ", "q1r": 5, "q2": "I think the milestones and timelines given according to fund cycles can be used to track the progress of this project. The proposers have also presented success metrics such as number of following, retweets, ", "q2r": 5, "assessor": "z_assessor_2679", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15063, "q0": "Although this proposal we can categorize as a start of something (product/service) that potentially will lead into a further development of the initial idea. The initial idea/product itself has very limited impact towards creating cross-chain collaborations. With the reasoning as following ; (1) it currently largely only shares info on Project Catalyst based activities, this I categorize as not effective, for to be involved in Project Catalyst one would need a series of onboarding learning through direct involvement or a series of documentations. Which IOG/CF (pardon my lapse in memory on whom) has already provided. It is a detailed onboarding document, which perhaps is more effective. Hence, the proposer would benefit if the Tweets had some relevance with this onboarding document. (2) approaching other chains, based on my experience is best done when there are similarities between one-chain or another. Not specifically to be technical but conceptually would also do. For instance ; the content of the Tweet can compare the process of how different chains validate their nodes, where Harmony does X and Cardano does Y. These similarities can then start bridging questions. These questions would most likely lead to asking more about Cardano. As is, the Tweets takes time for non-Cardano people to understand and is a bit redundant in terms of does it provide any unique and interesting news/updates on Cardano to the Cardano community itself.", "q0r": 3, "q1": "Based on amount itself, I would gladly take a blind eye. It is only 800 ADA. But I do have to be fair and there are some suggestions that I would like to share, as following ; (1) please do take this a tad bit more seriously, I do understand you are asking for a small amount but nonetheless we should approach as per a proper proposal submission guideline, that would only be fair to everyone. (2) $50/2 (two) hours/week to study and compile data to become Tweets is an acceptable amount. But since the deliverables is a Twitter account, as a social media manager, which you are partially attempting to do, you need to provide the number of tweets you will submit. If $200 only gets us 1 (one) tweet that would not be cost-effective for the Cardano community. I could go even deeper but the most crucial element that needed to be address is what specifically are the number of tweets you plan to do. This comment continues into the Auditability section", "q1r": 4, "q2": "When it comes to creating a Twitter account and managing it, the most key deliverables will be as following (1) quantity of tweets and (2) quality of those tweets. Quantity is simple, it involves the number of tweets per day. While quality is a bit harder to judge for it involves the following ; (1) copywriting, (2) use of visual media, (3) time of tweet, (4) use of hashtag, (5) use of metadata and etc. All of these are usually provided in a social media calendar, which you unfortunately did not provide. I absolutely have no issue with someone attempting to become a social media manager but it would have been beneficial if you were to first look up things such as ; (a) How to become an influencer?, (b) How to create an impactful Twitter account? and etc. You did though provide timelines but it is very simplistic, social media calendar is a daily base project. Each day you either prepare the content for the next day or for the next week. The next day perhaps you prepare the graphics. The next day you inform the time you will tweet, the topic and etc. It is to be honest, super extensive. You might want to counter by, I am only just starting. Which I do notice and acknowledge, but you should also start properly therefore you can scale easier.", "q2r": 3, "assessor": "z_assessor_2088", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15066, "q0": "Proposer's initiative really can create a simple product called Catalyst Ticker! Really love her initiative for this one! This product called Catalyst Ticker, which is literally a Twitter account who (already) regularly tweeting Catalyst Update. This are a helpful product for Catalyst Members who needed quick and concise guides in regard to the Catalyst.\nAlthough this is a good proposal, I believe it doesn't align with the campaign brief. Catalyst Ticker doesn't make any new collaboration or connection with blockchain communities listed in Campaign Brief. It just purely for Cardano community, specifically Catalyst community. Proposer aware of that, and proposer already have an explanation in Comments section. Since Catalyst Ticker is a product, this proposal should be in \"F9: Dapps, Products & Integrations challenge.\"", "q0r": 3, "q1": "Feasibility section is great! All of checklist such as Budget breakdown, Timetable, and relevant experiences are well-written by Proposer.\n- Proposer also have a statement and explanation about her $25 hourly rate for this proposal.\n- Updating in Twitter doesn't require any hard skill or experience, Proposer also stated that she will investing her 2 hours time to tweet about Catalyst update.\n- Next thing I love with Proposer's awesome ideas are: She already prepare future way to attract Catalyst members to follow Catalyst Ticker with creating a Twitter Spaces, Discord, Webpage and expand to others Social Media.\n\nMaybe, if Proposer could find relations with other Chain Twitter account, Proposer could host a Twitter Space then invite and engage their community to join Catalyst it would be great and will align with this Cross-Chain Collaboration challenge. But I understand, for now Catalyst Ticker still focus to provide quick and concise guides for Cardano Catalyst Community only.", "q1r": 5, "q2": "This proposal only have two numerically measurable metrics such as: growing follower number & account's engagement (likes, comments & retweets). This would be great if Proposer could make a monthly digest in a blog or something (Google Spreadsheet would be the easiest way), so community can publicly audit the Catalyst Ticker's engagement. For reference, Proposer also can use Twitter Analytics' platform to get her account's monthly data such as: Traffic summary, Tweets impressions, etc. Those are data who will complete your auditable document for community.", "q2r": 5, "assessor": "z_assessor_2553", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15183, "q0": "This is a pretty cool idea. The proposer will update information related to Catalyst regularly and quickly on a Twitter account called Catalyst Ticket. This is intended to help Catalyst have an additional community outreach channel that provides important information to the community in a timely manner, and will also help the community to communicate and follow news conveniently. The difference between Catalyst Ticket compared to other media sites is that the information will be summarized in a concise, easy-to-understand, beautifully presented way. A channel to update information and Catalyst news is a place where communication for the community with Catalyst is very necessary, but it is not a cross-chain, bridge technology product to connect other blockchains with Cardano Blockchain. However, since this is a channel of communication and sharing of Catalyst information and news, it will contribute to the realization of the ultimate goal of this Challenge which is “ Let’s create an enriching, open and safe environment, where people from different communities can find common ground and share knowledge, resources, skills, ideas, and visions with one another\". Therefore, it can be said that this idea is relatively consistent with the overall goal of the Challenge. In terms of impact, Catalyst Ticket's current followers are only about 196 people. If Catalyst Ticket becomes an official communication channel of Catalyst and is widely promoted to the community, the number of followers will increase, thereby increasing communication efficiency about Catalyst to the community. Therefore, it can be said that this idea has a large impact on the development of the Catalyst community if supported by Catalyst.", "q0r": 4, "q1": "Regarding the implementation plan, the Proposer listed the tasks to be done clearly. The job is quite simple, mainly following, updating news regularly, and actively interacting with the community to promote Catalyst and attract new people. The Proposer has created a Catalyst Ticket account since May 2022 and regularly posts short and easy-to-understand Catalyst articles. The proposal team also attached some links to sample articles posted on Twitter. It is quite strange about the implementation plan includes the preparation steps for the submission of the proposal in Fund 9 and Fund 10. It can be understood that this proposal will continue to be submitted in fund 10. The budget is clearly listed according to work in the plan. Since the work is quite simple and the person who does it is the Proposer, the cost is affordable.\nThus, in terms of feasibility, the project is completely achievable.", "q1r": 5, "q2": "Regarding the roadmap, the Proposer has listed the implementation plan quite clearly. The Proposer also provides metrics to measure and track project progress. It is the number of followers and the number of interactions with the posts. Quantitative KPIs but no specific numbers. The community and Catalyst can track the progress of the project directly on Catalyst Ticket and through progress reports. If this project is successful, it will help introduce more new members to Catalyst, in addition, it will also become a communication channel for Catalyst to carry out marketing programs in the future.\nOverall, although the idea was quite simple and it didn't cost much, the Proposer presented a very clear and thorough proposal. There are no concerns about the transparency of the project. This is a very worthy project to receive the support of the community and Catalyst.", "q2r": 5, "assessor": "z_assessor_2578", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15256, "q0": "The proposal aims to provide a \"markup\" that is essentially a Twitter account that announces and shares important information. Make cross-chain collaboration easy and get all Blockchain enthusiasts involved in Catalyst on Twitter. An account is a connecting node for any community and other members of the chain ecosystem. It becomes open source for anyone who wants to update. I agree it should serve as an easy entry point for anyone interested. Propose impact on cross-chain collaboration challenge, while introducing and increasing community. The proponent recognized the risks, but they were not significant. It is only a small obstacle in the progress of the proposal. However, the proponent also has solutions to reduce risks when the project is implemented. Ensure the progress and success of the project.", "q0r": 5, "q1": "The proponent provided the account information already exists @CatalystTicker on Twitter and fund 9 is done. Fund Roadmap 10 provided by the proponent. However, it would be nice if the proponent provides a detailed road map with specific timelines and parallel tasks. The detailed roadmap will easily track the development progress of the project.\nThe requested budget is $850. This is a very low range of requirements, but has been reasonably analyzed by the proponent.\nZoé Selina is the only member of the team and also the proposal writer. She has 3 proposals from November 2021 to present. In addition, we found no information about her past and present experiences and activities. In addition, a short text introduces her, but what the introduction does not relate to the skills and experience required to carry out the project. The skill and experience of the proponent is one of the important conditions to ensure the progress and success of the project. However I am not confident for this", "q1r": 3, "q2": "The proposal offers two things to track, measure project progress based on the number of followers and engagement on posts, and show the reach of the Ticker Account on Twitter. However, the project roadmap is just a list of tasks to be done, lacks specific timelines and parallels. It is difficult to measure progress accurately. In addition, proponents can add specific KPIs. For example, what is the number of followers and interactions in the first month, second month, third month, and last month. Specific metrics will make it easy to track your progress and goals. The project's success means it has become an easy and reliable resource for people both in Catalyst and outside.", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15319, "q0": "I confess that at first I did not find this proposal very aligned with the challenge. It is about creating materials on twitter about Cardano, the justification for doing this in this space is that it would make the information accessible: people would not need to “first on the email list nor having read all the emails does not require that no one has joined a Telegram group or Discord server, nor keeps up to date on them”, etc. The proponent argues very well why twitter would be a strategic space here. Despite the proponent explaining a little about what would be addressed (timeline, updates, etc.), she believes that we still have little information about the topics that would be addressed. It would be very interesting if we knew more about these topics. The justification for the proposal to be in this challenge is that it can attract new people to the community and promote an exchange between blockchains, which really can happen – although the focus is not actually promoting cross-network projects.", "q0r": 4, "q1": "Although the work has already started, the proponent could have explained better about the process of creating content from the funding. All we know is that she would “continuously prepare and post timeline updates whenever needed. I will also naturally engage with the community and spread the word about Catalyst through this helpful account.” But how would the preparation be done? How would she “naturally” engage with our community? The requested budget is very low compared to other Catalyst proposals. They order $850, $50 a week. The bidder claims to take about 2 hours a week to stay updated on the posts and then the payment would come. I don't think there's much more to be said, financially the proposal is quite simple. About Zoe, I would like to understand a little more about her professional area and how she gets involved with our community. The confidence imparted by the bidder's preparation is compromised as she does not explain as much about herself.", "q1r": 3, "q2": "Although the work has already started, the proponent could have explained better about the process of creating content from the funding. All we know is that she would “continuously prepare and post timeline updates whenever needed. I will also naturally engage with the community and spread the word about Catalyst through this helpful account.” But how would the preparation be done? How would she “naturally” engage with our community? The requested budget is very low compared to other Catalyst proposals. They order $850, $50 a week. The bidder claims to take about 2 hours a week to stay updated on the posts and then the payment would come. I don't think there's much more to be said, financially the proposal is quite simple. About Zoe, I would like to understand a little more about her professional area and how she gets involved with our community. The confidence imparted by the bidder's preparation is compromised as she does not explain as much about herself.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15395, "q0": "The mentioned problem is reasonable, I've seen several community members miss deadlines, including myself, so the solution can contribute positively to Catalyst updates and due to the fact that updates will be made on Twitter, which is probably the social network with the most engagement of the crypto community, there will also be exposure to communities of other blockchains, therefore an indirect impact on this challenge, however despite the compelling arguments to justify aligning this proposal with the challenge, I have not seen such a clear alignment.\n\nThe proposer cited \"awareness & understanding\" to support the legitimacy of the proposal in this challenge but failed to mention that this definition is under \"You could buddy up with someone from outside Cardano ecosystem and address one or more of these common challenges:\"Clearly the proposer is not teaming up with someone from another blockchain for this proposal.\n\nI will not be so restrictive in the evaluation of this criterion, as the challenge brief leaves some gaps in the \"end goal\" and proposals of this type end up partially fitting into the challenge.\n\nAlthough the metrics included are relevant, KPIs with targets that allow measuring the impact in terms of views were not established. The proposer could have established a minimum number of followers or impressions on Twitter to serve as a KPI in order to make the impact more tangible.\n\nDespite the absence of KPIs, the deliverable of the proposal (updates) alone are an indicator of significant impact.", "q0r": 3, "q1": "The project is already underway, I am already a follower of the profile on Twitter and the service provided is really useful. The proposer is an active member of the Catalyst community and due to the simplicity of the proposal, the information included is already sufficient to indicate full capacity to continue to develop.\n\nThere is a budget breakdown and the budget is appropriate for the tasks mentioned. Keeping up with the processes in Catalyst can be a full day job depending on how deep one wants to be in the ecosystem. In this case, the definition of 2 hours per week seems adequate for the proposer to keep up to date and not miss deadlines.\n\nThe plan is simple, objective and contains the necessary information to understand what will be done and how it will be done.\n\nThe identified risks are minimal and adequate solutions have been proposed.", "q1r": 5, "q2": "The suggested metrics are good indicators to understand the popularity of the profile on Twitter, suveys will also be made to understand the outcome of the proposal in terms of quality and for feedback as a whole.\n\nThe definition of success can be verified through the suggested metrics.\n\nThe roadmap contains necessary milestones to audit the proposal.\n\nAs the information is published on Twitter, this proposal can be easily verified.", "q2r": 5, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "A Twitter-Account that posts the timeline, timeline-reminders, updates on the timeline, and gives Catalyst resources where needed. And it's already alive and growing! Both as an account AND an idea.", "experience": "I am in Catalyst since F7 and am a highly engaged community member. I always stay up-to-date with the timeline anyway, so I can share that knowledge meaningfully. I am good in making posts beautiful - proper information distribution and communication is sth absolutely dear to me."}