{"id": 421771, "author": "max.zab", "title": "Decentralized cross-chain OTC", "url": "https://cardano.ideascale.com/a/dtd/421771-48088", "category": 26598, "amount": 10000, "description": "DAOs and token projects experience issues with attracting liquidity from other chains + often they need a channel to sell their token to a specific buyer in a agreed volume in BTC or stablecoins.", "f6_no_assessments": 9, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 365, "q0": "The proposal effectively addresses the challenge. It is enabling an OTC based DEX that would enable trading of ADA and native assets with other chains assets.", "q0r": 5, "q1": "The links and video provided gives me a good sense of the current iteration of the product. Having something that is live and functional is very encouraging for the perspective of a succesful proposal. The one question I have is around the implemntation of the Cardano blockchain. It is currently not possible to trade ADA through the WhaleHaven OTC DEX and all interactions are through EVM based single and multi-sig wallets. Integration of Cardano with smart contracts seems as though it may be more work then the $10k this proposal is seeking. \n\nOverall the WhaleHaven product does seem like it would provide a lot of value to Cardano if it successfully implements ADA. This would mean the Cardano community has a OTC DEX that can effectively transact between a variety of blockchains. \n\nThe risk section of this proposal doesn't really dive into any issues this proposal may face. It details the advanced tech the project uses in marketing speak but doesn't describe potential risks such as buggy smart contracts and lack of usage. The risk section does bring up that this proposal will be harder to implement if an alternative proposal is declined. This makes me a bit concerned and with a lack of documentation on how this risk could be mitigated I can't be confident that this proposal will be successful as a stand alone. \n\nThe team seems to be competent and capable of completing the projects deliverables. They have completed a working product and have years of experience to back it up.\n", "q1r": 3, "q2": "The proposed solution portion of this proposal is a bit lacking. It describes the current iteration of WhaleHaven but doesn't describe the user journey coming from the Cardano side of things. The sentence \"Funds always stay on the chain\" is also a bit confusing as its impossible for a crypto asset like Bitcoin or ADA to no longer be on a blockchain. \n\nThe detailed budget section could use a bit more information. The detailed plan suggests a 3.5 month timeline but the budget is perscribed for 1 month of work for 3 developers. It is possible each developer is working for ~1 month but this is not described in the proposal and therefore should not be considered. \n\nOverall the proposal seems compelling and I would love to see WhaleHaven implement Cardano but there is too little detail to feel confident.", "q2r": 2, "assessor": "z_assessor_2070", "no_vca": 20, "ne": 2, "ng": 13, "nfo": 5, "vca_o": 1}, {"id": 514, "q0": "While this proposal will not do much for tribalism or maximalism, it is attempting to provide the community with a way to swap large holdings from other network to Cardano at low costs. The proposal answers the challenge ask for interoperability well. Would have love to see more details about other impact concerns such as marketing, scaling and maintenance, and explicit call and response to the challenge asks. \n\nHow will the communities know about the bridge? How will you address changes to Cardano, wallet apis, and HFC events?", "q0r": 5, "q1": "The success of this proposal is somewhat coupled to another proposal which is a real sticky wicket. The first two pre-requisite milestones assumes the coupled wallet proposal also passes. It would be helpful to outline for the community what the milestone looks like if the other proposal is not funded.\n\nWould have love to see further breakdown of the budget, or at-least estimated dev hours to gauge feasibility. 75% of a 10k budget is low for engineers skilled in \"modern cryptography mechanisms\" unless you've already been quoted some number of hours of work. As an engineer myself, I wouldn't take on this project for this budget... perhaps you will be supplementing the pay, or perhaps the other proposals help with this? Without details in this proposal, the community doesn't have a clear picture to gauge feasibility. ", "q1r": 4, "q2": "The proposal does a great job detailing how they will measure adoption, and how the cardano community can follow along. Would have love to see similar level of details for the development work. How will you track your work eternally? How you will know of roadblocks and how will you communicate these to the community. Do you plan to \"provide weekly summary\" or will you wait to be asked? Where will these summaries live? Your website? public gitbook? ", "q2r": 4, "assessor": "z_assessor_2098", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 984, "q0": "The non custodial swap options for Cardano are indeed almost non existent. However the setup proposed is not really non-custodial as the \"bridges\", smart contracts and for bitcoin case the multisig wallet will be setup and maintained by Whales Heaven, auditing or verifying the security of a swap is nearly impossible for the end user.\n\nThe real impact would be a GUI around a series of multisig wallets on different ledgers. The user still has to trust Whales Heaven on auditing and maintaining the multisig infrastructure\n\n- \"It will be much harder for us to implement this proposal if our our wallet proposal is declined and this one is accepted.\" it is not further specified what this means.\nIf they are that heavily dependent on each other why not combine them in one proposal?\n\n- Currently there are only a few offers on the whale heaven marketplace, the proposal mentions nothing about how to drive traffic to the service \n", "q0r": 2, "q1": "The swap app already running, although with very low traffic, so it's somewhat likely that the team will succeed.\nThe budget seems arbitrary, as it is rounded and not broken down properly or gives any insight into how the 10k total amount come about.\nAdditionally nowhere was it taken into account that ADAO has done most of the work with Roundtable on the Cardano side already\n- No additional (social) links for the team members provided, or to be found on the website, this always leaves a bitter taste\n- (--) detailed plan is almost the same as in the in the \"Multichain multisig wallet\" (another proposal in this fund) and not very detailed", "q1r": 3, "q2": "From my perspective and since this is software that potentially holds a large amount of funds, there are two different audit aspects present.\n\n1) Audit of the (successful) execution of project\n- This is quite straight forward, but only two quite bold KPI (1k trades and 1M volume in ADA) were chosen\n- additional KPI around social media (specifically twitter) were only vaguely hinted at\n2) Audit of underlying code base (multisig wallets on different ledgers, adaptors, smart contracts [for ETH tokens])  \n- This is not so straight forward; the proposer is asking the Cardano community to help with financing the audit outside the proposal. This seems strange as the audit is the most important part for fintech tools. \nThat being said if only the Cardano adaptor and wallet get audited, that leaves risks and attack vectors open in adaptors, smart contracts and wallets that have not been audited properly.\n\nBoth aspects have not were not covered sufficiently to receive a good rating.", "q2r": 3, "assessor": "z_assessor_2170", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1758, "q0": "The spirit of the Challenge has to do with collaboration and reducing maximalism, but also ensuring interoperability. It seems the proposer has tapped into that second area of the Challenge, which fits well. The problem statement is apparent for large sellers looking to buy and sell cross-chain.\n\nA point for voters to note is that there is no benefit to the Cardano ecosystem until the final steps of the plan. Along those lines, KPIs do match, as the team wishes to create a better mechanism for large cross-chain transactions and add ADA to the DEX after all the initial work has been performed to set it up.\n\nThe first risk offered is written oddly. They may have meant to say that their mitigation depends on an audit. If that is true, please reword that if you are rewriting.\n\nOn the second risk, it turns out the proposers have a contingent proposal that, if not voted through, will suffer the success of this current one. Due to such a significant risk, this section can only be given 1 star. If rewriting, perhaps combine the proposals if they must depend on each other so much.\n", "q0r": 1, "q1": "Again, in this section, the contingent wallet proposal is brought up once again. There is no way to believe this plan can move forward as the team has made clear that funding for only one of them means the failure of both.\n\nAside from that factor, the proposer should know they have done well to present a thorough plan for voters to understand the steps of the project. If rewriting, consider a date for each section of steps or which quarter it falls in, such as: \"Q4 2022: X work will be done Q1 2023: Y work will be done...\"\n\nThere are two budgetary notes and no actual budget. If rewriting, please put your budgetary notes and put the numbers in their place. Voters want to see essential line items, dollar signs '$' all broken down into dollars per hour, per project, etc, and all totaled up in the end to reflect the total amount asked above.\n\nThe same skill sets aren't mentioned, though if rewriting, please add these so voters know you have given attention to that vital information. The team is only known by first names, except for Max Zab, who is the only participant attached to the proposal on IdeaScale. If rewriting, please include the full relevant bios and names of co-proposers for a greater chance of success, as voters often reward this transparency.\n\nThe resource needed outside the funds for this proposal is the passing and total budget for the contingent wallet proposal mentioned in the detailed plan. This section will score 1 star for issues with a contingent proposal and the lack of a budget.", "q1r": 1, "q2": "There is no roadmap, and the proposal would benefit from one.\n\nThe metrics are split into implementation and adoption. This makes good sense and would likely help voters understand the complexity of outcomes and that the team is concerned with breaking these outcomes up so we can see to what extent the proposal succeeds.\n\nThe KPIs do define success as they are tracking actual ADA trades as the outcome suggests.\n\nThey mention weekly progress updates, but it isn't clear where this will take place. If rewriting, please include this information. These rationales determine the 2 star score for this section.", "q2r": 2, "assessor": "z_assessor_2261", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9537, "q0": "For a wildly inexpensive proposal to integrate Cardano with an existing cross-chain dapp, I rank this section a 4. In this section, I’m usually looking for impacts that are quantifiable to give voters a sense of tangiblity for the impacts of approving the proposal. This proposal does not provide tangibility but I will gladly do the work for them for providing such a low-cost/risk proposal. The only information I could find is the 8.3k Twitter followers on their social media page, which may not seem substantial but it’s certainly enough to be considered well-established. Since it’s all decentralized and anonymous, there’s no way of knowing how many of these followers are whales but OTC cross-chain services is definitely something that would appeal most to whales. The way I see it, this proposal creates another access point for interoperable exchange. As someone that works with many DeFi developers in the Cardano ecosystem, I’ve learned about some widespread difficulties that the Cardano ecosystem has encountered in the process of building interoperable protocols. This is not to say that progress is not well underway but rather to show the value of a preestablished infrastructure that facilitates interoperable trade between the biggest chains in the ecosystem. Additionally, a potential secondary impact that might not be considered here is the networking opportunities that presents itself through this proposal. In my work of communicating with different projects from other ecosystems (more on the networking/partnership side of things), I’ve found that these interoperable partnerships are HUGE Catalysts to fostering new connections with other projects from separate chains. With the indicated intent to integrate more Cardano Native Tokens in the future, I expect the impacts of this proposal to extend beyond just another access point. This scores some major points for Fund 9 in particular, that aims to focus on interoperability and cross-chain integration. For a much lower than average asking price, I think this access point is worth it. ", "q0r": 4, "q1": "For a functionally simple roadmap, presumable spending efficiency, and demonstrable capability, I rank this section a 4. I give a lot of “benefit of the doubt” assumptions on this section, that voters may not be as generous to do. However, there is clear demonstrability in the capability of this team, given that they already have a fully functioning cross-chain DEX and a relatively substantial awareness of it. However, I think voters would appreciate the addition of LinkedIn profiles to verify experience and secure a more confidently positive reaction. As far as the roadmap goes, I think there’s a perfectly acceptable step-by-step plan here that shows voters how long it would take to complete this integration and the timeline appears both reasonable and fast. The budget, however, doesn’t really provide a whole lot of substance to demonstrate efficiency in spending. But in the end, the requested funds is so extraordinarily cheap that the cost of labor couldn’t possibly be inefficient in the amount of time it will take to build this integration out. So, there’s a lot of details that are omitted from this section of the proposal but they’re all reasonably assumed for the positive side, so my reaction is confidently positive. ", "q1r": 4, "q2": "For a measurability framework that measures both completion and usage, I rank this section a 5. The identification of product completion is always a simple one, so I appreciate that this proposal adds a little substance to it with some expectations for communications, social media engagement, awareness, and performance as it benefits the Cardano ecosystem. Where this section really wins some points from me is the commitment to quantified target metrics for the performance of these integrations, which is what links directly to the potential impacts of the proposal. The targets are also relatively substantial both in terms of targeting $1 million volume and the amount of transactions reaching 1000 per week. I would’ve assumed something noticeably lower, so I gain a lot of optimism about this proposal that they set the expectations that high. The only criticism I could offer is the addition of progressively increasing projections on those target metrics to show a more acute sense of performance over a given period of time. Overall, great substance. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11323, "q0": "This proposal was submitted in the Cross-Chain Collaboration challenge.\nThe problem or issue they are wanting to resolve is swapping/transferring crypto currencies across chains without a third party, or custodial holdings of the funds being transferred between or across chains.\n\nThe proposer has provided a solution to this problem in creating a platform that enables a user to select multiple currencies, set buying limits, and offer it to public or set it to sell in a single trade and send a private link to buyer on a Dex that is non custodial that is an OTC exchange and is cross-chain peer-to-peer and operates at much lower fees then you will find elsewhere. This would let people swap crypto-to-crypto without any intermediary. No registration. No custody, and the funds always stay on the chain.\n\nThis would allow for the movement of tokens/coins across various chains and bring value to Cardano as people will be able to change assets they have on other chains over to ADA, but would also allow Cardano members to change their ADA over to other FT on other chains where they may wanting to mint and NFT, invest, or do any other thing. The ramifications of this are enormous, and the value it can bring to Cardano is something that would be profound in the long run of things.\n\nThis proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has looked at the risks involved, and has determined what they are and ways to get around those risks including the use of audits. The timeline lays out a detailed plan of action, with timeframes for each part, and is laid out step by step to the completion of the project. The timeline is feasible, and should easily bring success.\n\nThe budget is on the other hand is very plain, but does cover the needed information to determine if the funding would be adequate for the proposals success. I would like to see a bit more details in the budget section of this proposal. What are the devs going to be doing for this approximately 1 months worth of work. We do get an idea based on the timeline/plan, but would be nice to see a breakdown in the budget section in any future proposals. Nevertheless the budget is sufficient to successfully implement the proposal.\n\nThe team consists of three people, each listed, their skills listed, and their experience is also listed. These three team members have the qualifications needed to implement the plan successfully. The only downside in the team section of this proposal is that there are no links to research the experience, education, and skills of each of the team members. This would be something to add to any future proposals, but the team already has a work Dex and have already proven themselves with other chains. This dex can be found here:\nhttps://www.whalesheaven.com/# \n\nBecause of the nature of the whalesheaven platform (the proposers platform) they may need to return to project catalysts in the future, and have worked out what they will do in the case of this need.\n\nI agree that given experience and plan presented it is highly likely this proposal will be implemented successfully, but would like to see more details in any future proposal.", "q1r": 4, "q2": "The proposer has identified what metrics they will be watching to determine the progress and success of the project. They also have this to say:\n\n\"We can provide a weekly summary of our progress.\"\n\nIt would be better in any future proposal to not say we can, but to actually provide a weekly summary as well as list where the community can go to get that weekly summary.\n\nThe metrics they will measure will work, but it would be nice to see metrics that show the actual progress of the work being done such as screen shots of the wallet being built, or a short video of the progress of the wallet, or any number of other things that allow a clear idea of how far along the work has come.\n\nThe proposer has also listed what success for the project will look like and this is satisfactory. \n\nI do agree that the information provided is sufficient to audit the progress and the success of the proposal, but I think the proposer needs to spend more time in this area of the proposal on any future proposals. ", "q2r": 4, "assessor": "z_assessor_3237", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 11991, "q0": "The problem addressed is the lack of a channel to attract liquidity in other chains.   The solution proposed is WhalesHeaven a non-custotial cross-chain peer-to-peer swap where a seller can select multiple currencies, set buying limits, and offer it to public or set it to sell in a single trade and send a private link to buyer.  The KPIs of the project agree with the KPIs of the challenge.  ", "q0r": 5, "q1": "The team are 2 developers and a designer, all with extensive experience.  They provided links to their work and videos of Whale Heaven. A timeline is provided and a cumulative budget.  It would be more helpful to brake down the budget for more transparency and connect it to the timeline tasks.  The budget is realistic though.  Technical information have been explained as well as how this project will help users to exchange crypto or tokens.  A risk identified is security which can be mitigated by security audits from an external company.  The proposers submitted another proposal which is connected to this one which if not funded then there is a risk that this one will run the risk of not been implemented.  ", "q1r": 5, "q2": "In regards to auditability, the proposers will provide weekly summary reports of the progress, will have the Cardano adapter working and generate new wallets.  They expect the number of Cardano token or ADA trades to exceed 1000 in a week, and Cardano token or ADA trade volume to exceed $1 000 000 in a week.  This will help Cardano ecosystem grow and attract more attention from outside of ecosystem.  Therefore, the KPIs quantify success of the project.  The proposers are confident of the project's success and Whale Heaven is a useful project, but in my opinion they should have thought more wisely of the budget of the two proposals submitted  and keep it as one.  Dividing the proposals is obvious that it does not guarantee funding for both.  ", "q2r": 4, "assessor": "z_assessor_3325", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 12045, "q0": "Having a decentralized cross-chain OTC does address the challenge in the sense that it involves tokens from different chains. The proposal is simple enough (in a good way) and follows the spirit of the challenge statement. ", "q0r": 4, "q1": "What is missing in the proposal are a few things. Firstly, more details about the proposer and his/her team, e.g., LinkedIn or Github would be nice. Secondly, there is no information on what's happening on the platform right now, i.e. number of transactions and how much are being transacted. It's important to have some activity to begin with because of the mechanism this platform is running on, i.e. no custodial features and real-time transfers.\n\nHowever, based on the description of the credentials as is, I think it's something that the team can definitely pull off. On top of that, the site is already up and running.", "q1r": 3, "q2": "I checked the website - there is no open statistics that can be seen so as to assess the progress of the platform. \n\nCurrently, there is only a landing page which also means that the founders will have to report the numbers themselves. Another concern I have is that the team's Twitter is missing and not in the proposal, but it is part of the project's success metric. ", "q2r": 2, "assessor": "z_assessor_3337", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 12979, "q0": "The proposal is about DEX which is non-custodial crypto OTC exchange where seller can set to sell in single trade and send a buyer a private link to sell or set it to sell in many currencies with buying limitations . Earlier their used to be a limitation where the ability to attract the liquidity from other network was a problem for both DAO's and the Token initiatives they had to require the some channel to sell their token to a specific buyer in a agreed volume in BTC or stable coins. WhalesHeaven is a cross-chain peer-to-peer swap that is not custodial. The WhalesHeaven enables cross-chain cryptocurrency asset exchanges without the need for a reliable middleman. Currently the supported networks are : Bitcoin, Litecoin, Ethereum, Binance Smart Chain, Dogecoin, Bitcoin Cash, Polygon and Avalanche.\nThe proposal outlines an issue that needs to be solved.The proposal clearly adds value to the cardano eco system.Upon reviewing the proposal The key metrices and goals of the proposal align with the outlined challenge settings.", "q0r": 5, "q1": "The plan for implementing the idea has indeed been presented in full by the proposer, including a timetable and important checkpoints. The timescale offered by the proposal appears to be quite realistic, and the proposal's budget breakdown is described in great detail. The proposer has also supplied information about the team who will be implementing the proposal as well as the expertise required to do so. The proposal has taken into account both the risks and obstacles to the project's successful implementation. After reviewing the proposal, I fully agree that it is likely to be implemented successfully.", "q1r": 5, "q2": "The progress of the proposal can be measured By tracking the volume and quantity of trades in ADA/Cardano tokens and comparing these figures week to week, This will demonstrate how the Cardano ecosystem is becoming more aware of us and how our presence there is growing .The challenge has been presented by the proposer in a way that is both obvious and understandable, and the strategy for its effective implementation is also described.", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Our DEX is non-custodial crypto OTC exchange. Seller can select multiple currencies, set buying limits, and offer it to public or set it to sell in a single trade and send a private link to buyer.", "experience": "We have a team of 3 senior developers and 1 designer. Expertise that we hold covers various stacks, both frontend and backend. We have a team member who holds comprehensive knowledge of various blockchain protocols and a good understanding of various cryptography algorithms."}