{"id": 422075, "author": "neielv", "title": "Scrutiny System in blockchain", "url": "https://cardano.ideascale.com/a/dtd/422075-48088", "category": 26598, "amount": 101682, "description": "In several Latin American countries, the computer systems for counting votes are highly manipulable, not very auditable, not very transparent, not very reliable and do not allow citizens to be audited", "f6_no_assessments": 8, "f6_rating": 3.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 1398, "q0": "No, this proposal does not effectively address the challenge. \n\nI'd like to start by stating my support for the idea and believe that this type of solution could have a major impact in many jurisdictions around the world. However, I do not believe that this is the challenge for what is presented. \n\nThe challenge here is cross-chain collaboration, while the proposal focuses on using Cardano (they say blockchain but only mention Cardano) to improve voting in LATAM countries. Unfortunately there is no discussion about how this project would lead to any sort of cross chain collaboration. Even the description of how it fits into the challenge doesn't really align with the brief or what is being sought after. \n\nStrong idea, but likely in the wrong spot. ", "q0r": 2, "q1": "Given the experience and plan presented, it is unclear whether this proposal will be implemented successfully. \n\nThe goal of the project is to develop a new voting system for LATAM countries to run elections. While the team provides details on how they would create it, including the activities and deliverables at each step, it is unclear whether or not the system they propose to build is robust and safe enough for countries to adopt. \n\nThe team's credentials infer that they are up to the task and have experience in working on such solutions in different capacities. What appears to be missing from the plan are linkages to officials who have the capacity to explore the testing and integration of such a system in their region. \n\nTo this end, I think the plan could also provide additional detail on how the team plans to get their solution actually implemented and being used by countries. As of right now it is a bit of an \"if you build it they will come\" approach, but this is not really sufficient to know whether what they propose is actually feasible to be implemented. ", "q1r": 3, "q2": "Yes, the information provided is sufficient to audit the progress and success of the the proposal. \n\nWhen it comes to building the proposed election system, the team has done an excellent job at outlining each of the indicators and success measures. Essentially, they are aiming for 100% success in testing/approvals, functionality, and documentation, which will be measured through bi-weekly reports and quantitative and qualitative testing. \n\nTo my concerns in the previous sections, it would also be beneficial to have some sort of indicators and measures for what success looks like once built. How will you know that the system is successful if not tested on a broad scale outside of simulations? Even having a measure of one pilot/use case that tests the system would strengthen this section as well. ", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1762, "q0": "The problem statement is quite clear. There is low trust in voting currently, and the proposer seeks to use Cardano to begin remedying the issue. Does it align with the proposal? The answer to this assessor lies in what \"communities\" means. It is explicit in the Challenge that this is meant to be an open place to explore what these things mean, and for this assessor, a local voting \"community\" interacting face-to-face with the Cardano blockchain \"community\" through its blockchain to provide trust...I think that's a perfect fit, even if unexpected as well. It seems it was a bold decision to pick this Challenge and truly understand the spirit of its intent. Bravo, proposer!\n\nThe positive impact on the Cardano ecosystem is undeniable as this blockchain used for local or national voting would be worldwide news and add credence to the already noteworthy blockchain. This value-add would likely create millions of new wallets over time––hard to quantify but highly likely.\n\nThe KPIs, as explained, do match for opening up the community to an entirely new one. We will see how voters respond, but there seems to be a high likelihood of popularity to this clearly-written solution to local and national voting on the Cardano blockchain.\n\nIn terms of scaling, the plan is perfect for scaling. If successful, even at a local level with little funding, it could quickly win support and trust if everything goes well and could be utilized much more broadly.\n\nThe RISK section is extremely comprehensive and a big plus for many voters. There is no improvement necessary, though future proposers should see this as a lesson in the task of writing risks and mitigations. Voters will know that the team has considered many areas where risks are possible.", "q0r": 5, "q1": "The plan is as detailed as one could hope for. The author leaves nothing to question. It is all full of descriptive, actionable tasks to implement the voting system, and the timetable for implementation is within reason, even if a bit ambitious. \n\nMuch like the risk section in Impact, the budget is necessarily extensive, an example of a \"clear budget, broken down into identifiable items,\" which is what voters and assessors are looking for; nothing is left to question. Added to this, it seems the hourly rates are in line with standards. What's more, they are categorized into Workforce, Infrastructure costs (the only area that could use a bit more explanation, if rewriting, so voters know what this refers to), and the audit mentioned.\n\nThe skill sets are fully explained for the project, and the individuals identified meet (and at times exceed) requirements. The team is comprised of more than adequate souls who make up the individuals referred to in the budget. The number of members needed (5) meets the needs of the solution, and all qualifications are as required. As assessors, we strive to add helpful suggestions when we find appropriate times––there are so few in this proposal.\n\nThere seem to be no resources beyond the well-selected team's budget and technical knowledge.", "q1r": 5, "q2": "The roadmap and milestones are broken into \"macro tasks\" and \"tasks.\" Further, they are well organized in chronological order. Additionally, the KPIs offered are the only accurate indicators for success that can be offered, simple: \"100% of the tasks are approved\" and so on, in language as explicit as this. Clearly, the proposer knows the end they are looking for already, and because of it, the proposal is specific for voters to read and determine that this team's work is entirely doable.\n\nThe one area that the team might want to add to Auditability is a way for community members to look at the work being accomplished. A Gitbook would be one such suggestion.\n\nNote: This proposal belongs as a part of Catalyst education to show the depths a project can genuinely go to offer all of what is being asked for and maintain such high levels of accuracy and purpose in your writing. Bravo, proposer, or team!", "q2r": 5, "assessor": "z_assessor_2261", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1805, "q0": "This proposal aims at bringing confindence in vote counting systems thanks to blockchain technology, and mentions Latin American country as a specific area where this would be needed.\nThis proposal does not align with the challenge which primiraly aims at developing interoperability between cardano and other blockchains, and collaboration/coordination between chains. \nThis proposal does not include any collaboration with an other blockchain nor does is mention any other blockchain. \nAs Latin America is mentionned in the challenge brief and in the impact section (impact on users in Ecuador, Colombie and Peru is mentionned), I understand that the choice of the challenge is a mistake and that it was intended to be submitted in a LatAm Challenge (there is no such challenge in Fund 9). I recommend resubmitting this proposal in appropriate challenge.", "q0r": 1, "q1": "The solution is detailed in the proposal by a user story, and a schematic to explain how votes are counted. The development plan, risk analysis and budget breakdown are well detailed, giving a good level of confidence.\nThe risk analysis is transparent, but considering the risks and mitigation plan it contributes to lower a lot the feasibility score : items \"lacks of cardano smart contracts ressources\" and \"developers of Cardano\" suggest that the proposer has no experience in developing a blockchain-based project and does not have yet in the team the appropriate skills to realize the project. \nIn front of the risk \"developers of smart contracts in cardano\", the solution is \"find developers out of plutus pioneer program\". I see a contradiction with the team members section where the proposal states that 3 full stack developers with knowledge of blockchain and Cardano and a contributor that followed the plutus program. In a further application I recommend to clarify the skill risk, is it secured with the current team or is it really a risk ?\n", "q1r": 3, "q2": "A general plan over 9 months is detailed and the budget is broken down into items (with hours and hourly rate) that can be reasonably followed by the community.\n To enable a monitoring of the progress by the community, the team plans to offer be-weekly reports about progress and contingencies. Source code will be made available in a github repository. \nWhat I am missing is a more elaborate definition of success (currently 3 lines, one of them being \"100% of the tasks approved\"). I recommend to relate the success of the proposal to the actual use of the system --> how many users to consider it is a success ?", "q2r": 4, "assessor": "z_assessor_2264", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4488, "q0": "The proposal is both highly ambitious and impactful, attempting to solve issues of irregularities in democratic voting in various countries in Middle and South America. This fits very well with Cardano's mission and the fund's objectives. As the Cross-Chain Collaboration challenge has been chosen for this project, I am missing some relevance for interoperability and outreach to the communities of other Layer 1 blockchain communities or integration with Layer 2 protocols. \nThis proposal has the potential to increase the respectability of web3 solutions in the pen-and-paper world of many electoral processes, and wants to improve on error-prone and outdated vote counting processes. No mention is made of any other blockchain technology except Cardano. This challenge setting has a relatively limited budget and tries to overcome tribalism between blockchain communities, so it is a pity that this excellent project has been submitted here instead of the many other categories it may have been a better fit for. \nBecause of this dilemma, I neither agree nor disagree that this is impactful in the light of the challenge brief.", "q0r": 3, "q1": "The proposer team is highly skilled with Emurgo Academy intructors and consultants and experienced blockchain developers, a scrum master and control system specialist teaming up to tackle this ambitious challenge. The budget is broken down into a lot of meticulous detail, and the timeline, roadmap and backgrounds of the proposers are well documented. \nThe project scope is extremely ambitious and we are only likely to see a working prototype and proof-of-concept after this project, but the team and business plan are highly likely to deliver some important progress on the journey to make voting fairer and more transparent - hopefully using Cardano in nation states in the Americas. \nIt would have been nice to learn more about the open source aspect of the development and get some external links, like a project website, Github etc.", "q1r": 5, "q2": "The auditability section of this proposal is presented as binary goals: 100% of tests have to be passed, 100% documentation is required etc. without elaborating the metrics this could be broken down into, to judge whether the project would be 20% or 80% successful in case there are some unforeseen issues or blockers. I would have preferred to see a more gradual reporting and maybe the use of open source versioning shared with the community or Catalyst auditors. Thanks to the depth of detail of the timeline, roadmap and budget breakdown, this should not be a major issue, but might help not only the auditors but also the voters and community to follow and understand the project scope, risks and partial deliverables better.", "q2r": 4, "assessor": "z_assessor_2554", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6147, "q0": "In some Latin American countries, computer systems for counting votes are highly manipulated, untraceable, not transparent, unreliable, and do not allow citizens to be audited. Latin America belongs to the Americas region. Has a population of 660 million people (in 2019). The author of the proposal wishes to bring confidence and security to the voting system through Blockchain. Proposal impacts the challenge and is described in detail. The author studied the Latin American context where the adoption/implementation of e-voting or tele-voting is still not feasible, mainly due to the low level of confidence in Electoral Organizations and the implementation of socio-political economy of the region. During the voting process the vote tally will be switched, which processes the tally of votes in a computer system. This project proposes the incorporation of blockchain in a monitoring system (described in detail and with a map: Schedule of the proposed solution). Solutions to make each stage of the counting process transparent, public by traceability... The implementation of Cardano will contribute to strengthening the democracies of countries, as it improves process and create trust. In addition, the Proposal has specified many risks in the project: Development risks: Cardano resources; Smart Contract developer in Cardano; Decentralized storage etc. Risk of: mining. and risks about: Commercialization. At the same time, along with those risks, the author has solutions to minimize risks when the project is implemented.", "q0r": 5, "q1": "The proposal team outlined a plan for this proposal very clearly and in detail. Milestones are set quarterly for each activity. From what I understand, the project roadmap presented by the team is from Q4 / 2022 to Q2 / 2023. The proposal team provided us with information about 3 quarters, divided into 4 phases. (Q2 of 2023: is 2 phase 3 and phase 4). And analyzed in detail. Quarter 4: Phase 1 (2022): Project formulation. Quarter 1 (2023): Developing and completing the project. Quarter 2: Phase 3 (2023): Development of project components. Quarter 2: Phase 4 (2023): Integration and stability. This is the first step we need to understand how the development of this project will go. The team provided detailed information on the work to be done in each phase. This way we clearly understand all that will be done, and have a better view of the development of the project. The route is completely doable. Next is the budget. The team recommends a budget of $101,682. In my opinion, the required value is quite reasonable given the complexity and time nature of the project. The author has provided a very detailed budget table. The budget is broken down and allocated for each very specific job, estimated by hour, by job, by phase. The budget is very well presented and completely transparent. Finally about the team members. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides a textual presentation of each member, and attaches a link to tell us more about the history and experience of the members to which the proposal presents. Overall, the plan of the proposal is very good, the budget is transparent and the members are all skilled and experienced, which increases the feasibility of the proposal. Proposal is highly feasible.", "q1r": 5, "q2": "The proposal is new, but from the plan board has shown the expertise, and the active efforts of the proposed team. Detailed roadmap in each milestone, can help developers easily audit the successful progress of the project. In addition, the strong team, and detailed budget, transparency in the proposal, strengthen the confidence in the success of the project. The proponent took great care of this part of the project, providing us with a wealth of information so that we could safely track and measure the project's progress. Supervision in software development; Quantitative indicators for the development process; Criteria for acceptance of tasks... all listed and properly explained. We can track in many ways how the project's phases will develop, and we know what value it will bring to the community. And the final product is what is expected, the success of this project. Since we are provided with a lot of information, I believe that information is complete and satisfactory has been established. The proposal has good auditability and transparency.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7432, "q0": "The proposal refers to the issue of electoral votes, which has been a controversial issue for many years in many countries around the world, but there is still no really optimal solution. But it seems that the proposal submitted to the Challenge section is not appropriate, this is the “Cross Chain Collaboration” Challenge for proposals to help Cardano and other blockchain communities increase collaboration and connectivity. Unfortunately at this F9, there is no Challenge for the Latin America region. To be honest, I'm also very confused as to whether F9 Challenge will include this proposal, even though the proposal is presented very well.\nTo apply blockchain to voting, the proposal is to choose the direction of scanning votes from paper to an image file, then converting them to a hash function and storing it on the blockchain. This is a viable idea that can be implemented at the present time. How to recommend presenting decentralized hosted images? I think it's possible to store the image ID only after the image is uploaded to some centralized server, treat that ID as a private key to generate the hash, and keep it on the blockchain.\nThe proposal lists many possible risks and methods to overcome them. I think in order to convince the community it is better to first find a way to deal with most of these risks, and write in the presentation as one of the steps of the project. Thus the project will be appreciated and more convincing.\nOn this part, I can only rate 2 points, even though you submitted the wrong topic Challenging (only 1 point) but you were very specific\n", "q0r": 2, "q1": "Milestones are clearly listed, step by step in detail, lasting for 3 periods, 9 months. However, I don't see the step of testing the project, evaluating the results, and tweaking (if any) clearly. I think this is an important step before being put into practice, hope you can guide me.\nThe team has voting software experts and Robert Cerrud was introduced currently teaching Haskell and Plutus Cohorts in Emurgo Academy, I appreciate that the team's competence is suitable for the project and development of the Cardano Ecosystem\nAs for the budget, the project lists each item in detail, broken down into reasonable amounts. The total budget is ~11.3% of the entire Challenge. Which audit unit will you hire? Do they know about blockchain? And especially, I am very worried about the legal issue in Latin American countries, this is a project that directly affects the government and the entire population, blockchain currently does not have a clear legal framework to get into practice. For the above reasons, I give this section a score of 3\n", "q1r": 3, "q2": "There are 11 criteria listed by you, these indicators are easy to quantify and test. You should provide a link to a social channel or platform for you to update those metrics, making it easy for the community to monitor and check. The success of the project will be a big turning point in voting and blockchain application in practice. 4 points in this section are the right number", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 12777, "q0": "This proposal wants to create a more secure and transparent voting system for Latin America. The idea is described in detail and seems to bring value to the people. \nBut this doesn’t match the Challenge. This proposal is ion the Challenge “Cross-Chain Collaboration” and doesn´t fulfill the challenge goals. A better matching challenge would be “Dapps, Products & Integrations because you would create a new Product which brings new users to Cardano. ", "q0r": 1, "q1": "The team has provided their LinkedIn accounts. I analyzed their CVs and they have much experience. They should be able to implement the proposal. \nThe budget is broken down in a table. It´s easy to understand and the hourly cost/ pay is fair and comparably low.\nThe project plan is split up into four phases. Each phase is a quarter Year. The tasks are explained in detail and it is overall reasonable. \nOverall the informations are very detailed and reasonable. ", "q1r": 5, "q2": "The monitoring of the development is described in detail, and they make bi-weekly reports. \nThey have set KPIs for the testing of the developments. They are easy to measure \nThe set acceptance criteria are reasonable. \nThey have set budget for a third party audit therefore the code is looked through and should be valid. \nThe overall goal is clear from the context of the proposal but you could have written a bit more in “What does success for this project look like” you probably don´t just want to program this, you want that it´s used in Latin America. But this is just a little comment overall I think it´s easy to audit. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 13917, "q0": "Strunity  system in blockchain effectively addresses the challenge thus Computer system Latin American countries use which are highly manipulated, are not very audible, not transparent nor reliable and so therefore, the solution of bringing confidence and security to votes through blockchain is highly possible and will make voting procedure more trustworthy to avoid incidents of corruption. This would very much helps reduce Latin American countries to run their elections with more ease , transparency intend reduces conflict that may arise during periods of elections. The proposal clearly articulates the value added but did not capture the key metrics, goals, sustainability in their presentation therefore making the plan incomplete. If only these were presented, this project would have be well understood and a very good project to undertake. This project also falls under the challenge settings since it intends providing an easy way for counting of votes instead of the manual tough way which is done with  so much uncertainties. ", "q0r": 5, "q1": "The experience and plan presented makes it  highly possible for this proposal to succeed because for a blockchain creation, Plautus engineer, development expertise, business and marketing advisors, electoral software development are vital and here is the case that they have all experiences, the number of team members are not clearly stated though. In terms of the plan, the budget which is $101682 which is realistic and it’s further broken down as to  how it would be used from workforce, infrastructure to auditing. They also made mention of the risks involved when implementing this project which they included how they intend to solve it and for that makes their work excellent. The plan also describes all resources necessary to implement the project which is very good. The proposal offers a realistic timetable to complete the task in a much effective and time bounded  manner hence, making it highly likely for it to be implemented successfully.", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and success of the project because they not only provided timelines for the project’s implementation but also is in details. The timelines are however kept in 4 phases( project planning, development of project components, development of project components and integration and stabilization). Regarding how to monitor the progress of the project, 4 ways has been mentioned; 100% of the tasks are approved, 100% of the functionalities foreseen in the planning and development and lastly 100% of the project is documented which I believe is sufficient enough to do a proper progress check. Apart from  the roadmaps with milestones and key metrics which was not stated in the project but would have been of great importance. However, the problems and outcomes, how accessible public channel  for delivery regular updates for auditing progress was well stated and elaborated. So therefore, since this project is in to solve a very important challenge most countries are facing and looking at their plan, it will go a long way in helping a lot of countries.", "q2r": 5, "assessor": "z_assessor_3847", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Bring confidence and security to vote counting systems through Blockchain.", "experience": "Plutus Pioneer, 20+years experience in software engineering,\n15+years DEVOPS expertise, counselled by business and marketing advisors.\n6+ years of experience in electoral software development."}