{"id": 422081, "author": "muesliswap", "title": "Bridgeless atomic cross chain swaps", "url": "https://cardano.ideascale.com/a/dtd/422081-48088", "category": 26598, "amount": 25000, "description": "In order to transfer assets between Cardano and other blockchains, one needs a lot of steps involving an intermediary, which limits the accessibility of the Cardano ecosystem by the general public.", "f6_no_assessments": 9, "f6_rating": 4.518518518518518, "videos": [], "media": [], "f6_assessments": [{"id": 366, "q0": "The proposal effectively addresses the challenge. Very easy interaction between blockchains, without a bridge and the associated loss of UX, absolutetly fits the cross-chain collaboration challenge. \n", "q0r": 5, "q1": "The team behind the proposal has seen a lot of success in the Cardano space by launching the first DEX. The team has consistently produced quality products for the ecosystem so it can be assumed they will do the same here. \n\nThe budget section does a good job of articulating where costs are going and how many hours it will take. It would have been great to see a set of metrics that enables the reader to understand how success is being measured.\n", "q1r": 5, "q2": "The proposed solution section provides a good overview of the proposal. The section dives into complexity first but ends with a new user flow that can make it easy for the reader to understand the product produced and how it functions. The risks section is a bit lacking. It poses the risk of needing to find a best practice for the solution and mitigates it by starting small and building from there. Unfortunately this dev risk doesn't have a very detailed mitigation path and there aren't any risks associated with usage. How can we prevent a lack of usage of a cross-chain, bridgeless DEX?\n\nThe people working on the project aren't included. The reader knows how many developers there are and some general experience but it would have been good to know the exact individuals involved. It is possible the team wants to maintain a level privacy. If this is the case it would be smart to state this along with the reason why. ", "q2r": 4, "assessor": "z_assessor_2070", "no_vca": 19, "ne": 1, "ng": 12, "nfo": 6, "vca_o": 1}, {"id": 900, "q0": "Currently bridges between blockchains have come under scrutiny, as many large scale hacks have happened. Muesliswap team are proposing atomic style swaps which in theory should provide much more security when tokens are swapped \"inter-chain\". In my opinion this proposal does have the potential to add great value, as Cardano has always had inter-operability at its core, and this is just another tool in the toolbox for that. It very much aligns with the challenge setting and the team have indicated they will undertake scalability testing.\n", "q0r": 5, "q1": "The project is being undertook by the Muesliswap team, which has proven to be innovative and reliable in the past and very much has the ability to pull off the proposed objective. Risks have been evaluated and the theory seems to have been researched, implementation will be the most risky although the team have stated they will cover any excess costs if further funds are needed to finish the proposal. The budget and timeline has been broken down although providing dates would be helpful to go along with quoted hours for the job.", "q1r": 4, "q2": "They proposers have stated that they will publicly share the deliverables with the community via (social media) and all code would be made available on the relevant Github repositories. The roadmap, KPI's and milestones are all listed to a satisfactory standard. \n", "q2r": 4, "assessor": "z_assessor_2148", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 932, "q0": "Moving value from one chain to another is always a pain in the neck. Bridges exist but they can be cumbersome to use and many of them have been proven unsecure. The MuesliSwap team proposes a small research and development effort into the possibility of using atomic swaps for cross-chain value transfer.\n\nThe reason this was not submitted to the Great Migration challenge is probably the fact that the same logic can be then applied to any chain. Mind you, even the Plutus and EVM implementation should be usable outside of Ethereum in EVM-supported chains like Avalanche, Moonbeam or Acala, for instance.\n\nConsequently, I fully agree that this proposal can have a significant impact in making Cardano interoperable with other chains. It goes above and beyond what is expected in the challenge and contributes to the Fund9 goals of open-sourcing Cardano and improving the Developer ecosystem.", "q0r": 5, "q1": "The MuesliSwap team (https://www.openswap.tech/) took everyone by surprise, being the first DEX on Cardano and appearing only with their first names in the beginning. They were doubted and criticized but, once people tried their service, the naysayers soon disappeared. After that they have come to public with their full names and faces, and they have proven what they are capable of. Hence, what they are proposing here is most likely to be another success. They have an amazing capacity of explaining somewhat technical solutions in layman terms.\n\nIt is possible, however, that their proposed solution doesn't work. Right now their understanding of atomic cross-chain swaps between Plutus and EVM-supported chains is based on existing research but no one has tried this in practice. It could fail. That’s why they are only aiming for a proof of concept with a small budget of $25,000. It’s a small price to pay for this experiment because the potential upside is immense. If nothing else, the Cardano developers’ community will learn the limitations of this approach. They can then iterate and innovate around it. If it does work, the MuesliSwap team will cover the development costs of the actual product.", "q1r": 5, "q2": "The team’s solution matches the given problem statement very well. Deliverables are: 1) formal description of cross-chain trading protocol (paper), 2) security analysis, and 3) reference implementation deployed on testnet.\n\nThey will measure the completion of said deliverables and report to the community. Code produced will be open source and made available to anyone in a GitHub repository.", "q2r": 5, "assessor": "z_assessor_2156", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 1314, "q0": "The proposal aims to provide a bridgeless atomic swaps – swaps that will allow transferring assets between Cardano blockchain and another blockchains without having intermediary, and thus reducing the complexity of such transfer. This solution would make wrapped tokens redundant and would make swapping assets way easier. The solution itself will be a combination of signatures and timelocks – what does it mean? It means that if someone would like to trade e.g. ETH for ADA, and such order is placed on each of chains (e.g. ETH sell for ADA on ETH chain). Once such order is created, the creator will become market maker – thus, the order will be there unless someone matches the offer exactly. Once that happens, assets are locked on each trading side, then confirmation of this lock will happen inside the protocol and traders will be asked for signing. Once signed – both assets are swapped, or the trade is completely reversed. I think that such protocol could eventually speed up cross chain collaboration and eventually make the whole transaction process easier. It is important to state, that this proposal is actually proof of concept of the solution, between plutus and EVM, thus much is not clear yet. But overall, the idea is very good. ´", "q0r": 5, "q1": "The budget asked is 25 000 USD in total, and the roadmap is not set. I have checked the planned activities and the total hours planned is set to 300 hours, which is 37,5 Full time for one dev. To improve the feasibility section, the roadmap (or estimated time frame – e.g. 3 months) could have been provided, as well as how many people will actually be developing the protocol. The budget is calculated based on expected hours, but hourly wages vary in respect to the task planned. Example – 180 hours for R&D, for 12 k USD = 66 USD/hour, comparing to Reference implementation 120 hours for 6 k USD = 50 USD. Another information that I am missing is with respect to the team – I am quite familiar with MuesliSwap, but it would be beneficial for those who are not (not all voters can be familiar with MuesliSwap) and some representative should be introduced, if not the whole team (if it is already settled). ", "q1r": 4, "q2": "The problem (to complex cross chain assets trade) and the solution (protocol that will make it easier) is clear, and the deliverable will be to create such protocol. The protocol itself will be open-sourced, so we are able to track the progress. Also, the team stated that it will be possible to track the progress with the respect to deliverables which are mentioned in the feasibility section, but without the clear roadmap, I think it will be quite hard. I believe that success of the proposal will be once all deliverables are finished, but I think that team should have added metrics that would actually provide a picture, whether the protocol is being used or no, e.g. number of trades performed using this protocol. At the same time, there is no reference for any public channel, so just a note for proposer – make sure you keep the track of the progress on discord/telegaram or twitter, so the community is able to audit the progress, or the success eventually. ", "q2r": 4, "assessor": "z_assessor_2222", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1486, "q0": "Atomic swaps represent the pinnacle of efficiency in the performance of crypto currency asset trading. This elegant solution eliminates the needs for cross chain bridges and complicated transactions. Additional benefits include developing a more user friendly experience and eliminating multiple potential points of failure. The impact of successful implementation aligns perfectly with the challenge setting and strategic goals of fund 9. Cross chain collaboration, tool creation, interoperability, driving adoption, innovation, and real world solutions are among the many targets this project aligns with.", "q0r": 5, "q1": "OpenSwap Technologies is the team behind MuesliSwap and they have already demonstrated the ability to deliver highly impactful projects to the Cardano ecosystem. Although it would be preferable to have listed and doxed their team members, this in no way effects the ability of this group to execute and deliver highly impactful products. The proposal offers that 9 developers comprise their team and their cumulative experience is more than sufficient to achieve the task at hand. Software development, Plutus/Haskell programming skills, smart contract development, machine learning and theoretical computer science are some of the many talents listed by the proposers. Based on past deliverable alone, this project is exceedingly feasible.", "q1r": 5, "q2": "As it is a singular function, an exhaustive list of KPIs is not required. Perhaps the most measurable and important metric is the sharing of code in a Github repository. Five bullet points from the budget provide measurable points of progress and include scalable design, publishing of findings, testing and verification. The addition of security analysis, written documentation and testnet implementation round out an ample set of metrics from which this project can be successfully audited.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9073, "q0": "The goal of this proposal is to create a bridgeless am cross chain swap between ethereum and cardano.  What this means and practicality is the ability to transfer tokens from different blockchains between individuals who want to swap them,  like a Marketplace for exchanging tokens from different blockchains between individuals directly without an intermediary. This team has developed and researched this concept to an extent and will continue to do so once funded.  If successful, this proposal would be highly impactful at enabling cross chain collaboration. The goals of this challenge would be met upon success.We could see people exchanging  their coinsdirectly in a secure and completely decentralised manner.  This kind of project could enable tremendous growth for cardano. I believe that the impact of this proposal would be very high and that is why I'm giving it a score of 5. \n", "q0r": 5, "q1": "I believe this proposal to be feasible. The budget and time frame section has a really solid breakdown of how the budget will be spent and what the team will be tasking themselves with. The team is experienced and skilled. They have given a sufficient amount of information about themselves and how they plan to go about this project. The team has provided a breakdown of how the budget will be spent and the tasks to be accomplished. It is not the most detailed. I would have preferred additional information Especially as it regards key milestones for this team to accomplish. I would have liked to see time frames (how many hours per week, etc)  to accomplish these different tasks. For example they could have given information regarding what exactly they mean by a literature review. They could have laid out their design process for creating a scalable cross chain swap. They could have also detailed how they plan on publishing their findings. This additional detail would have really helped in the assessment. However there is enough information to assume that this will be feasible and give this a score of 4.\n", "q1r": 4, "q2": "I believe this proposal is clear. The goal is to develop across change swap without using an exchange. I believe this is a very solid clear proposal to accomplish that. The time frame makes sense. What they are setting out to accomplish is reasonable. The team is experienced and qualified. The auditability metrics are there in present though they could have been more detailed. Their only plan is to measure the completion of the deliverables as described. But these deliverables were not highly detailed. They plan on updating code in a GitHub repository. This is a fantastic auditability measure and shows transparency among the team. The main goal here is to develop a paper based on research of cross chain methodology. I believe this is feasible. I believe this team is transparent. I believe this is auditable. With more information I would have given this a score of 5. But as it is I believe this is worth a score of 4.\n", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11490, "q0": "Yes, the proposal directly connects with what the challenge asks, i.e. the creation of new blockchain community connections and the strengthening of existing ones. I believe this is the path that the author of this project seeks to implement; a connection starting between the Ethereum ecosystem and Cardano's ecosystem. In the proposal, the problem of third party entities that eliminate the ways of decentralized systems and infiltrate cross-chain trades, was identified. A solution-based approach that limits the need for intermediaries is presented in the proposal, aligning with the need to approach interoperability amongst chains, and create safe-secure ecosystems as well. In terms of the futuristic look of cross-chain trade, the proposal hints on the creation of a scalable protocol entity that cuts bridges and improves the security for effective cross-chain atomic swaps. The idea, regardless of team experience, is stated to be a generic protocol that needs research and testing. I think voters should take into account the potential behind the project and vote it into a successful implementation. The proposal has addressed the mechanics of a successful project, as far as including an exemplary illustration on what trading can look like and I strongly think it can be successful. Equally providing the communities involved with a tool that is new, secure and resourceful. I score it a 5 out of 5.", "q0r": 5, "q1": "Expenses for the project were clearly provided in the proposal, likewise the timeframes and activities pending implementation. For the quantity of work needed, the expressed figure seems fair considering that the team will bear some of the costs needed to run the project. As a newly born idea, it is imperative that detailed research goes into the foundational phase, as promised in the proposal. This project is run by active members in the cardano community, spearheading diverse projects funded under the catalyst. The team looks very experienced, considering its success in creating dApps like MuesliSwap. The involvement of the MuesliSwap development team, alongside other qualified external contributors should generate the project from ideation to product. A move such as this greatly realizes what the challenge seeks to achieve in its cross-chain collaborations, innovations and openness to create life-changing technology. The team is also skilled in software engineering, building Plutus smart contracts, machine learning etc. beneficial to the success of the project. I strongly believe, the combined experiences and collaborations behind this project, will ensure its success when duly supported. Project feasibility is a 5", "q1r": 5, "q2": "The problem indicated in the proposal mitigates the impactful nature of cross-chain collaborations and safe blockchain experiences. For a project that is seeking to enhance these relationships, currently attempting to use scalable protocols between Ethereum and cardano, is a team for innovation building. I agree that the proposal has highlighted the necessary milestones it will achieve post funding, to test out this idea. Community members are welcomed to scrutinize the progress of the project on the team's public Github repository. Deliverables expected at the end of the project have been included by the author, as well as the idea of what its success would look like. There is no basis of failure for the team since the idea is new and yet to be improved, thus any or all information provided is directed to the feasibility of a project like that, and the team has promised to deliver on that knowledge. I strongly agree that the proposal can be audited as it is simple, clear and straightforward. \n", "q2r": 5, "assessor": "z_assessor_3252", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11727, "q0": "As a person who exchanges value across different blockchains I have a lot of experience with bridges, wormholes, centralized, and decentralized exchanges. I find that the approach of this proposal is quite simple yet very effective so long as it actually produces the desired outcome. The example between Alice and Bob exchanging ETH for ADA is very clear and concise. ", "q0r": 5, "q1": "While the budget as described above in detail is a little vague, I do understand that there is a lot of research to be done and a paper to be written regarding the proposal. Because the muesli swap team is central, who is highly experienced in creating swaps within the Cardano ecosystem and the proposal seems right in their wheelhouse, I believe the goal of this project is definitely feasible. ", "q1r": 4, "q2": "Auditability seems clear, research then paper, then security analysis, then coding on GitHub repository for all to see and check. If this EVM to Plutus atomic swap is successful it would be a game-changer for those seeking a quick and secure swap that's better than any available option for blockchain interoperability.", "q2r": 5, "assessor": "z_assessor_3271", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 12506, "q0": "A concise issue provided in the Problem Statement description, dealing with other blockchains outside of the Cardano system is a challenge that needs to be addressed. It is clear that solving this problem makes it easier to connect transactions between the Cardano blockchain and other Blockchains. Thereby increasing the value of the Cardano ecosystem, so the proposal could positively impact Cardano. Thanks to that, there will be more transactions done, increasing liquidity, and increasing the participation of many cryptocurrencies in the Cardano ecosystem, leading to an increase in the value of ADA. The project has the potential to grow and scale because the transaction demand is always present and increases with the development of blockchain projects.", "q0r": 5, "q1": "The necessary experience and skills to implement the proposal have been provided by the writer. The proponent has provided the proof of experience required to proceed with the proposal, for information like this (OpenSwap Technologies - the team behind MuesliSwap, one of the largest dApps on Cardano), they should provide Links to profiles of main members. The proposal did not provide a plan that included a realistic timetable for completing the tasks to achieve the success of the project, which is a pity. In addition, although the budget provided in the proposal is clear, there is an error in the calculation. Specifically, when calculating the total amount for the items is $28000 ( $12000 +$6000+$1000) which is larger than the $25000 they calculated. This may affect the cash flow during the implementation of the proposal. They should use tools like Excel to track expenses and accurately calculate budgets.", "q1r": 3, "q2": "As mentioned, this proposal does not yet provide a plan that includes a roadmap along with milestones with timelines. At the same time, indicators/KPIs for project evaluation have not been provided. Therefore I cannot judge the relevance of the indicators they intend to use. Finally, the community does not yet have a way to track the progress of the proposal, which reduces the transparency of the project. In order for the proposal to be completed properly, the writer needs to add the above information.", "q2r": 2, "assessor": "z_assessor_3425", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "We aim to create a scalable protocol that can be used to trade assets between Cardano and other blockchains, not based on a bridge. This can be realized in multiple variants of so-called atomic swaps.", "experience": "We are OpenSwap Technologies - the team behind MuesliSwap, one of the biggest dApps on Cardano. As developers of DeFi infrastructure, we have experience with all relevant aspects of off-chain & on-chain code, haskell programming, and security of smart contracts."}