{"id": 422297, "author": "adamrusch", "title": "IRI: Cross-Chain Happy Hours", "url": "https://cardano.ideascale.com/a/dtd/422297-48088", "category": 26598, "amount": 3000, "description": "We need more activities that allow Cardano Community members and general Crypto users to network and learn about the Cardano platform so they can better work together.", "f6_no_assessments": 6, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 367, "q0": "The proposal effectiviely adresses the challenge. It works to bring multiple blockchain communities into one enviornment. That being said the how proposal addresses challenge section could of been expanded further. The reader has an understanding of the mission behind the team but not exactly how they are effecting the key metrics and suggestions of the challenge.\n", "q0r": 4, "q1": "The team behind the proposal seems to be very well qualified for event hosting at the University. Adam has history of doing so and is a TA Professor there. Adam also has experience in the Cardano community with ADAO. This provides a sense of confidence in his ability to meet deliverables.\n\nAs for the proposal it seems to have a fair budget for the impact it will create. $3,000 for 10 months of events in a university enviornment seems like a great usage of Catalyst. \n\nThe Project Catalyst monthly reports will give readers a good sense of the event and how successful the proposal is.\n", "q1r": 5, "q2": "The proposed solution section does a good job of providing an overview of the project, this is aided by the detailed plan section that provides a bit more specifics about the events. One suggestion would be explaining a bit more about what the experience at the venues will be like. Sharing things on how catering, entertainment, and entry (ticket vs no ticket) will be handled would help build up the proposal.\n\nThe risk section of the proposal dives into the most prominent issue this proposal could experience, but stops there. Including more information on risks involving event managment would have been good to see. \n\nThe detailed budget section is well written and provides a nice overview of how money will be spent. Additionally the creation of 100 new Cardano users through the ADA giveaway seems like a built in deliverable for onboarding. ", "q2r": 4, "assessor": "z_assessor_2070", "no_vca": 15, "ne": 3, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 1144, "q0": "This proposal would be a good fit in the Scale-Up Cardano Community Hub challenges of previous funds. As a local event series in Illinois targeting the scene of higher education, the impact is limited. It also appears that the proposal targets primarily newcomers to blockchain and insofar will not be very useful in fostering cross-chain collaboration.\nAt the same time, local events have the potential to impact individuals and smaller groups that cause a ripple effect in the larger community. The likelihood for this to happen, however, is at least on a shorter time horizon miniscule and not a given.\nThe implied goal that the proposer is committing to is to onboard 100 new users over the period of 10 months, which puts the cost of the acquisition of a new Cardano/Blockchain user at $30.\nThus, the impact for this challenge setting is in the middle.\n", "q0r": 3, "q1": "Adam is presumably already doing meetups ( see his funded proposal https://cardano.ideascale.com/c/idea/404815 ), and the budget is realistic. The $1k set aside for budget and marketing should be broken down more neatly. It would create higher levels of confidence if indeed it is clearly stated what the money will be spent on. How much will be spent on social media ads, guerilla marketing campaigns, local ads, or put in the proposer’s pocket for administrative costs? The ratio makes all the difference in terms of possible reach and therefore success of the proposal. With just 10 new attendees per event over 10 months, however, it is highly likely that the proposal will be implemented successfully - regardless of the allocation in terms of marketing.", "q1r": 5, "q2": "Having milestones and success metrics is important, but they are useless in terms of auditability if the community has no way of measuring or verifying these. Unless the Happy Hour Meetups were recorded, attendees would give testimonials or some sort of report, the community just would have to take the proposers word for it. The commitment to at least announce to the community ahead of time when and where the event would be held would go a long way. Photos, meetup notes, slides that would be publicly shared would be a low hanging fruit as well. But none of this has been listed. Since this can be added as an addendum and “proof” for continued funding needs to be submitted now in the monthly reports, I will bump the score slightly, assuming that these suggestions are going to be implemented throughout the project implementation.", "q2r": 3, "assessor": "z_assessor_2209", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "Impact: Assessor underestimates the fact that this isn't just a local event where local people will learn about Cardano. As the home of a Research-1 University, the Urbana-Champaign Community hosts scholars from all over the world who relay the knowledge they gain both on and off campus.\n\nAuditability: Assessor misses the fact that we have provided a link to our RSVP site. Members of the Meetup website will be able to see how many people RSVPed for our events. While this may not capture all who show up as those who sign up can bring guests, it does help give a general sense of attendance. "}, {"id": 1315, "q0": "The aim of the proposal is to organize a happy-hours near the University of Illinois Urbana-Champaign, with the invitation to all crypto-enthusiast, whilst they aim to feature Cardano. Organizing these happy hours, and putting crypto people together can eventually foster the collaborations over the chains, possibly to cause some migration and generally propagate the blockchain in general.  The proposer believes that since the University is having more than 50 000 students, it is a good place to organize such meetings, because the outreach will be high. Although, a supporting information or evidence – why do proposer thinks that these meetings can benefit to cross chain collaboration is missing, thus, I am not really sure that this goal can be achieved. Are there some projects from this university? Are there people working on different chains projects, that could actually result in some collaboration? ", "q0r": 4, "q1": "The plan for the proposal is to organize 10 meetups from August till May, and these meetings will have some agenda such as how to set up Cardano wallet. Overall, a relaxed atmosphere is expected. The budget requested is 3 000 usd, where 1k goes to soft drinks (100 USD/meeting), another 1k goes to 100 wallets per 10 ada for newcomers /to increase the traction), and another 1k is for miscellaneous (marketing, administration). In this case, given the budget is very small, I do not have the need to require more details, and  for 10 months plan it appears reasonable. The proposer aims to organize these meetings himself, and for that there is no special skills or experience required, nevertheless, he provided linked in profile and stated, that he already organized such meetups. From this perspective, I believe this proposal is fully feasible. ", "q1r": 5, "q2": "The proposer aims to provide a monthly report, which will contain the following information - When and where the happy Hour Meetup was held, how many people attended the Happy Hour Meetup, how many new members were provided with pre-funded Cardano Wallets, and how he plans to make the next event even better. Since there is a task to make it better, maybe a report containing “what went wrong” can be disclosed. Another interesting metric (proof in this case) that could be provided would be some pictures or even live streams if there would be some public channel such as Instagram or telegram for crypto-enthusiasts – e.g. greetings from our monthly meet-up. Regarding the success, I am not really sure if we can measure the “comfort” of “more” people, so, I would rephrase it - if cross-chain collaboration is the goal, then the result should be some cross-chain partnerships, or projects, as the outcome of these meetups. Otherwise, I would not consider it a success. ", "q2r": 4, "assessor": "z_assessor_2222", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1400, "q0": "Yes, this proposal effectively addresses the challenge by hosting in-person meet ups at the University of Illinois - Urbana Champaign campus. \n\nThe proposer will host a series of 10 events over a 10 month period where new, prospective, and seasoned blockchain-interested individuals will attend and learn about blockchain overall but with an additional focus on Cardano. I like this idea as the in-person education about Cardano can be very impactful where questions are answered in real time and individuals can be directed to the resources they need. \n\nThe reason why I am giving this 4/5 is due to the relatively limited reach this proposal is likely to have. While it is great for the individuals near the Urbana-Champaign campus, it is unlikely to provide a substantive impact back to the community. However, I still score the proposal highly because on a localized level, this project may have a great impact. ", "q0r": 4, "q1": "Yes, given the experience and plan presented, it is highly likely that this proposal will be implemented successfully. \n\nThe beauty about this proposal is its simplicity. Host 10 events, help 10 newbies sign up for Cardano wallets with $10 in ADA at the event. This feels very easy to implement and is likely to be done successfully because of that. The team also lays out a clear vision here, it's just to raise awareness and education of blockchain in their specific area. \n\nGiven that the proposer is from that campus themself, they appear well positioned to deliver these events. Moreover, since the events will be held through the proposer's newly developed \"The Immutable Research Institute\" they will likely be able to use their existing channels to promote the events and drive attendance. \n\nFinally, for such a small budget there is little to no risk for the community in funding this proposal with the potential for local impact.", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nAs noted above, given that this project is very straightforward and has a very small budget, it is very simple for the community to audit the proposal. \n\nOne thing I would have liked to see here though is a better linkage between what you are measuring and what you hope to achieve. For example, if success looks like \"a vibrant monthly Happy Hour Meetup for students and professionals interested in Cardano and blockchain technologies\" and \"At the end of the academic year more people will be comfortable working with Cardano as a platform\", there has to be a way to measure these. How will you determine if it was \"vibrant\"? How many guests would need to attend?\n\nIf at the end of the year you want more people working with Cardano as a platform, do you intend to follow up with the people who attend? Will you send out satisfaction surveys? What about the individuals who get the $10 in ADA? Will you continue to engage them? \n\nOverall, good work and I look forward to your success. ", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1442, "q0": "The proposal would be within the challenge goal, this is a good idea, and I think that this proposal probably will allow new Cardano users and the participation to community (developers and consumers).\nThe proposal want to organiz  events that will be participated by Illinois students and industry professionals to meet and mingle in a relaxed environment where they can network and discuss the Crypto industry.\nThis proposal is simple, clear and concrete This is an important proposal to attract many new users to the Cardano ecosystem and for wallet growth.", "q0r": 4, "q1": "The proposer (no teams) is skilled about the whole context, beacuse Adam Rusch holds a PhD from the University of Illinois in Education Policy where he works as a Teaching Assistant Professor in Information Sciences. He is the organizer of the Champaign Blockchain meetup group with a passion for cryptocurrency education and public policy\nThe scope of the solution is well explained and ther are simple: organization of monthly Cardano Happy Hour Meetups.\nIn my opinion the budget requested is small and coherent to the challenge (3k$), and coherent with the elapsed (10 months).\nOverall I think it’s simple to define the complete success of the proposal.", "q1r": 4, "q2": "Success criteria is simple to identify and trace with key metrics to measure the success by tracking the milestone and tangibly verified (e.g. how many people attended the Happy Hour Meetup)\nThe proposer haven’t founded other proposals in previous Fund from Project Catalyst.", "q2r": 4, "assessor": "z_assessor_2245", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 1764, "q0": "It is evident that the problem statement, a push for networking and togetherness cross-chain, does align with the Challenge. Opening up spaces such as this is undoubtedly a goal of the current Challenge, and voters can be sure this type of effort positively impacts Cardano and Catalyst as it also becomes a topic of discussion.\n\nThe KPIs offered to match the Challenge's spirit that promotes the idea of getting past maximalism to a future of collaboration across chains. The significant aspect of this plan is that the concept could be replicated in many locations to achieve the same goal. Great work, proposers.\n\nThe only risk mentioned involves participation. The answer offers a sort of vague \"hope\" as opposed to a mitigation tactic. If rewriting, consider including the example from the next section where the team even mentions that one plan is to \"rotate to different venues to optimize [reaching a larger audience].\" This would be a great example of a mitigation tactic for your risk.", "q0r": 5, "q1": "For the budget size ($3k), there is plenty of detail. The fact that there is a contingency fund for unknowns is also essential for such projects (especially given the lower budget). Good work to the team on that.\n\nThe skills necessary seem evident in the proposer, and his list of relevant skills are significant, and connections in the community (that are another often a mitigation tactic for unknown risks, as they provide a great resource to brainstorm with when unexpected things occur).\n\nJust because these gatherings may seem more informal and with a lower budget does not excuse them from having a well-thought-out roadmap for success. As someone with much event-planning experience, I can say that dates, pace, planned hosts, and a refreshments list are all included in this well-laid event plan. If rewriting, please consider voters are looking for actionable tasks in order of execution with a realistic timetable.", "q1r": 5, "q2": "The \"detailed plan\" offered above, though needing more detail for that purpose, at present makes a super clear roadmap. Voters can feel confident that the work following that roadmap will likely be successful. However, as a plan, it could use a more profound amount of detail to determine the particulars of all areas mentioned.\n\nThe team will measure the best areas to define success with the report metrics they plan to offer. Voters should feel confident that in this area, the team has given much thought and attention since their last edition of a similar unfunded proposal in Fund8. Significant advancement, team!\n\nThe team plans only to offer their monthly report to the Catalyst challenge team. A Gitbook account or a monthly 3-5 minute YouTube video update would offer even more to your plan's auditability and likely be rewarded by voters too. The rationales are thus determined at a 4-star score.", "q2r": 4, "assessor": "z_assessor_2261", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "The Immutable Research Institute will hold monthly Happy Hour Meetups near the University of Illinois Urbana-Champaign. The invitation will go to all Crypto enthusiasts and Cardano will be featured.", "experience": "Adam Rusch has served as organizer of the Champaign Blockchain meetup group since January 2021 and assisted with event planning before that. As an experienced event organizer he can help interested people at the UI Research Park learn about Cardano in a relaxed atmosphere."}