{"id": 422381, "author": "cole.vt", "title": "Positive Blockchain Database V2", "url": "https://cardano.ideascale.com/a/dtd/422381-48088", "category": 26598, "amount": 25000, "description": "There is not a user friendly way for people to learn about all the verified impact projects in the blockchain space.", "f6_no_assessments": 10, "f6_rating": 4.366666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 517, "q0": "This is a brilliant idea with a proven track record and a proposal that speaks directly to the challenge ask. The proposal provides a call and response writeup about how it contributes to the challenge ask of \"enriching, open and save environment, where people from different communities can find common ground...\" It also speaks directly to addressing triablism and maximalism, also challenge asks. \n\nThe proposal detailed solution is very detailed, organized by background, development, bulleted list of its impact, goals, the data, and the current impact of the existing database. \n\nAdding features for new users and project owner functionalities will have an even greater impact than the current product!", "q0r": 5, "q1": "The proposal provides detailed milestones and timeline spanning through 2023 Février.  There is a detailed budget breakdown with broken out line items. The team and partner organization is already doing the work, who's better to do more of the same work!\n\nFive stars all around!", "q1r": 5, "q2": "The proposal does an excellent job tying key metrics back to challenge's key metrics. The proposal does not provide detail about how it plans to mange the work internally. It does however has clear deliverables the team will be tracking. Would have love to also see how these metrics will be provided to the community...spelling out of where the cardano community can go to audit and keep track of the work being done. ", "q2r": 4, "assessor": "z_assessor_2098", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 934, "q0": "Raising the “Real-World Impact” flag high up in the air, this proposal aims to strengthen the Positive Blockchain database (https://positiveblockchain.io/) in a blockchain-agnostic fashion. It aims to provide educational content, relevant insights and impactful solutions. Entrepreneurs, research projects, consortiums, governments, events and different organizations can use the Positive Blockchain hub to increase their own impact by mobilizing communities, stakeholders, and funding in a coordinated fashion.\n\nAt the time of writing, the database boasts 1,156 environmental and social impact projects utilizing blockchain in the areas of Health, Identity & Ownership, Government & Democracy, Education & Employment, Finance & Insurance, Aid & Philanthropy, Internet & Telco, Transport & Infrastructure, Logistics & Traceability, Products & Consumption, Agriculture & Food, Climate & Environment, Energy, and Digital content & Arts. Sounds great, no? Well, right at the moment the “database” is nothing but an Excel Sheet and due to the hugely successful data gathering efforts funded earlier, the team now needs to make this more user-friendly and feature-rich.\n\nBecause of its blockchain-agnostic nature, this can become a hugely important hub for any do-gooder in any community on any chain. Since there is no user-friendly way yet to explore impact-driven blockchain solutions, the Positive Blockchain database is being developed with project owner capabilities and Cardano-based projects are invited to claim their pages. \n\nI fully agree that this simple but powerful proposal effectively addresses the challenge.", "q0r": 5, "q1": "The project extends from September to April next year. Preparation has already started. This leaves them enough time to make the tech stack choice and build the features required.\n \nAs for the budget, the research bit ($5,000) and tool development ($15,000) are justified. With this stretched timeline it’s enough to have such ballpark figures. The third bit—“Supporting other PB initiatives” ($5,000)—on the other hand, is not entirely clear. Cross-checking with other parts of the plan, however, it becomes clear that the proposers intend to use their partner network to find core developers through events and other outreach activities and this last $5,000 is reserved for that. In all honesty, this uncertainty does decrease the feasibility of the plans a little bit. Let’s hope there will be available designers and developers to get the work done.\n\nThe main proposers, Raz and Cole, have included exemplary “workload management” reports that summarize their involvement across funds and pinpoint what other proposals they are working on. This proposal also goes to show that they are not afraid to partner up and ask for help to get additional minds to work on the deliverables as needed. Their team includes Jessica, Paul and Lucas as well as potential help from the related projects such as Cardano4Climate and SustainableADA.", "q1r": 4, "q2": "Some of the KPIs are really well-aligned with the challenge, such as this: “Number of initiatives with cross-chain teams (members from different blockchain communities together)”. Others could be improved. Instead of tracking the number of new features, it could be more beneficial to include a qualitative measure such as User Satisfaction or Net Promoter Score (how likely is it that you would recommend this?).\n\nAlso, the outlined solution could be a little more detailed. But, I guess those details will come in at a later stage. Periodic “Community updates of progress” are mentioned in the timeline, which is great. Based on this and the proposers earlier involvement, we can rest assured that the community will get to follow their progress closely.", "q2r": 4, "assessor": "z_assessor_2156", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1145, "q0": "From a project perspective, Positive Blockchain is a platform to provide info on or learn about verified impact projects in the blockchain space. This proposal aims to bring Cardano projects onto the site. A simple search for “Cardano” on the website yields just two projects at this time (ClimateCoop.com and Cardano Ethiopia) even though the former just appears to be Cardano-friendly, but nothing is built on it. The site itself has some serious usability issues at the present time, but the idea itself is not a bad one.\n\nThe proposal’s value proposition is to continue developing the open source database and new web integration. The site itself does not appear to be open sourced, which is a shame as there are plenty of low hanging fruits that could be taken care of by volunteers to improve the look and feel of the platform. As Positive Blockchain is not just the site but supposedly a non-profit organization in Paris, open sourcing the site and providing links to the repositories would be meaningful and probably not contradicting any business model the organization might have.\n\nA significant part of the proposal is in researching a new web stack. As a developer for some thirty years, I can assure you that the least of your problems, as it relates to the proposal, is in fact the tech stack.\n\nIt is not clear without a doubt whether the database is curated by the Sustainable ADA / Positive Blockchain team or an improved version of the site shall be launched where project owners can manage their projects in a public facing capacity. The “possible impact” has feel-good scenarios that are not accounted for in the feasibility and auditability sections (e.g. “Accelerate the ecosystem of positive blockchain by mobilizing communities, stakeholders, funding through events and more!”) and empty buzz phrases like “sky is the limit” while at the same time they want to become the crunchbase for SDG deep-tech projects. The “deep tech” part is uncharacteristic of the team’s track record so far. Granted, their work has been referenced by others - adds to feasibility positively - but the lack of focus on what this proposal is really about is unfortunate.\n\nThe lack of focus is also apparent when they mention “SGT platform” in the risk section. Where did that come from? And is it really hard to find developers for a web1 platform? In my experience only when the incentives are not properly lined up. The amount requested is sizable for this type of work and I do not see a lack of developers that can assist in selecting the appropriate tech stack and development of the platform.\n\nUltimately this proposal can be seen as building a simple, central place for people to share and learn about impact driven projects. Because the NGO, non-profit sector is full of fraud and UK’s princes get millions worth of ADA in their local currency in suitcases for their “charities”, this proposal should have addressed how they ensure that the projects listed on their platform are actually verified.\n\nDue to the lack of focus on what is actually being built and too many open questions, I can only provide a rating of 3 out of 5.", "q0r": 3, "q1": "The team has the connections, timeline and budget to implement the proposal successfully. Given the outlined budget and the hours allocated, I would be surprised if this proposal was not fully implemented by the end of the year. Cole did a good job clarifying his involvement in other projects.\n\nI would suggest breaking the development part into smaller responsibilities as there is not only work to be done on the database, but also the front-end as well (and UX - which can be a separate cost entirely). Even if just one person ends up building the entire project by themself, it helps with planning and it helps the voter what goes into the successful implementation of this proposal. The $5k that is allocated to do the research should have ideally been already mostly done. The feature set should have been clear in the proposal (see impact comments), so that only final tech stack considerations should have been taken into account. That would be an hour discussion at most for a small team of three senior engineers and less time for one decision maker who knows what they are doing.\n\nNonetheless, I think it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The Sustainable ADA team has historically shown great commitment to transparency of their progress for their proposals. The success metrics are in line with the proposal and challenge overall. Commitment to more nuanced progress metrics would be desirable, but this is one aspect Catalyst proposals routinely fall short. I suggest open sourcing the development of the proposal if possible. That way, the community can get a better real-time understanding of the progress.\n\nStill, I strongly agree that due to the historical communication of the proposers with the community and their success metrics, the proposal provides me with sufficient information to audit the proposal.", "q2r": 5, "assessor": "z_assessor_2209", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 1402, "q0": "Yes, this proposal effectively addresses the challenge by creating an open source platform and repository for different blockchain projects working on driving sustainable impacts. \n\nThe project appears blockchain agnostic and welcomes members from any chain to submit their projects and help inform the broader community discussion on using this technology to drive fundamental change. \n\nThe team already boasts about having 1200 projects signed up to their platform, which is certainly an indication that they have already achieved some level of impact beyond just Cardano. This type of interaction between different projects and groups will certainly help to reduce the silos and maximalism of chains. Instead, teams may identify others working on similar projects and work towards mutual objectives. \n\nI also like that the team has decided to make their platform a non-profit rather than a private proprietary company, as this has the potential to mitigate some negative incentives that might befall private companies, such as putting profits before people. Instead, the not for profit focus will allow collaboration on issues, not the bottom line. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is highly likely this proposal will be implemented successfully. \n\nThe team consists of some key Catalyst Community players, such as AIM, and collaborations with others, such as Cardano4Climate. This type of cross pollination of groups is a good sign in the ecosystem and indicates a desire for all groups to succeed. \n\nAs for the plan, the goal appears to be to onboard new participants and develop a new webstack for the PB platform. I am taking a mark off here because the team could have done a better job of explaining the need for a new webstack and what this would deliver. Given that they already have a working website and have 1200 projects signed up, what is currently missing? \n\nFinally, the budget leaves a bit to be desired and perhaps could provide a bit more granularity on the specific activities for each line item. For example, if the team needs $5000 for events, outreach, new initiatives etc... it would be nice to know how that 5k will be divided, even if high level. Right now, this is unclear. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. \n\nYou can tell that this team is composed of some active Catalyst members as they do an excellent job of outlining the KPIs they hope to measure, and align these with their success measures. The goals are to onboard new projects, perform outreach, and include new features in the website. The team also does a good job at expressing their intention to update the community on a regular basis through community announcements. Perhaps the team could add in what venues they will use (yes social media but any others? - conferences, non-blockchain specific venues etc.)\n\nHere they mention that they will revamp the platform to incorporate new features and capabilities but perhaps pointing to some of these potential options would give a better sense of what the end goal is, compared to what's available now. With that said, this may be a personal preference only and so no points removed. ", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1765, "q0": "The problem statement is almost entirely clear, though voters may not understand what a verified impact project is. Perhaps for instant clarity, one might try: “...about all the projects that are verifiably beneficial in the blockchain space.” or something to that degree.\n\nThe problem statement is in harmony with the Challenge as it identifies a need for enhancing a collective database of impactful blockchain contributions. It seeks to find projects that can claim their pages on the site and improve users’ experience by providing an ever-widening collection of accurate blockchain data.\n\nAdding more Cardano projects to the list has a clear positive impact on the ecosystem, and the outcomes from that visibility are a sure value-add to Cardano, those projects, and likely Catalyst.\n\nThe proposer has taken the time to truly help explain how the KPIs in their project do indeed align with the Challenge. The spirit of breaking down the silos all our blockchains are in, and forging ahead into a multi-chain future are at the heart of the data collection plan.\n\nThe two risks mentioned are both mitigated by the community they have. If rewriting, it would be nice to hear specific, concrete, and concise mitigation tactics such as: “If we are unable to find developers, one tactic we’ve used in the past with our community is to XYZ. It had this outcome: X. A similar tactic will be employed here with the same community, and we are sure we’ll find positive results.” The proposer receives 4 stars for the section.", "q0r": 4, "q1": "The plan offered is in order of an actionable item, and the 12-month timeline looks to be adequate for project management. Some contingency plans are offered in the risk management section the team can fall back on if they find they need more assistance. Overall, voters will have no problem going through the information provided and understanding exactly how the team hopes to reach their stated outcomes.\n\nThe budget is broken down into identifiable items, and voters will benefit from being able to see down to the per hour rate that the team is charging for the work, a fair rate for the industry standard for the tasks. One area that the proposer may want to consider if rewriting is adding up to a 10% contingency fund for any unknowns that may come up.\n\nThough the skill sets needed aren’t called out in a detailed list, they are apparent in the outlined plan. The 5 members of the team mentioned, as well as the two organizations (Sustainable Ada and Cardano4Climate) that the team can rely on, are collectively more than capable of executing the tasks necessary to reach the end of their roadmap.", "q1r": 5, "q2": "The roadmap is offered in auditability and is a helpful addition to explaining what success looks like for them. Voters can see the full intentions of the team here, and what they define as success is “helping provide a platform for all blockchain companies with a focus on positive impact to showcase their projects to the world.”\n\nThe KPIs define success by offering users data that indeed track activity that happens as people are engaged in breaking down barriers. The metrics offered are typical progress indicators (social media shares, # of companies joining, etc.). One that is unique to a project such as this is the # of initiatives with cross-chain teams, a perfect metric to track to define success in a way that truly fits with the Challenge. Good work, team.\n\nThere is no current place for the community to track progress. Perhaps adding a Gitbook or monthly/every other month vlog to update the community would be helpful if rewriting. This adds to auditability and helps voters know you are concerned with that aspect of the Catalyst proposing. This section receives 4 stars due to the absence of a community tracking mechanism.", "q2r": 5, "assessor": "z_assessor_2261", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3039, "q0": "What I like the most about this proposal is its focus on giving project owners the ability to claim and edit their project pages. It also focuses on building the correct infrastructure, tooling and UX which is a must in my opinion when your goal is to make information easily accessible and digestible. Moreover, the project is multi-chain by nature, meaning that each community will be used to certain standards and ways of doing things. The proposers' focus on accessibility and user experience should have the benefit of reducing friction and allowing newcomers to feel at ease on the platform. All of this indicates that they fit the category's criteria well (cross-chain collaboration). Cardano as a blockchain and as a community would greatly benefit from being included in a project with such big ambitions in terms of scope. It is also worthwhile to note that they seem to have a track record of being successful at attracting usability for their platform, as can be seen with the list of entities that have used their database for various use cases. The team uses terms such as 'positive' and 'good' as a way to signal their focus on sustainability and SDG goals, however, their seems to lack a clear description of how a project would fit that category and who is responsible for categorizing projects as such. Will it be the team? A community? A DAO? More information on that front would be great. Another point which should be mentioned is the reason for their focus on SDG-related projects. It seems from their current proposal that they are focusing on scaling up their operations and technology stack. Why limit themselves to a specific subset of project listings? There might a technical reason for it but it is not clear in the text. Why not include all projects and attach a tag to projects that fit in the sustainability category, especially given the fact that they are spending a substantial amount of resources to research and implement a more generic and scalable version of their product.", "q0r": 4, "q1": "As I mentioned in the impact section, the track record of the team is very reassuring. Their websites point to working products and the number of teams that have used their platform attest to their growing outreach. This is very good sign! The twitter accounts of the main team members are also active and healthy. These reasons by themselves warrant a score of 4 or 5. The reason for not giving a full score, however, is the description of their roadmap, and budget breakdown which could be much more detailed that the somewhat abstract descriptions they have included. In addition to this, there is the fact that part of the success of this proposer depends depends on external factors, such as finding a developer. That said, the team description section is complete and attests to the capabilities of the current members. The signs all point to a potentially successful implementation of this project, but what would have made this section stronger is a more detailed and technical breakdown of the work to be done. A small portion of the research the team wants funded should have been done to a certain extent to show that there is a specific starting point and the roadmap has more tangible results in terms of technological specifications. For example, instead of \"Begin development of of the new PB webstack\", I would have liked to see something like \"Begin development of component X of webstack\" and give an estimate of it completion time.", "q1r": 4, "q2": "The nature of this project makes its auditability easy by default. Add to that the fact that the team has already a functioning product and that this proposal is essentially a V2 of their current one, with the fact that the team is fairly visible within the community, and we can that auditability shouldn't be a big problem at the outset. Their key metrics to measure are satisfactory, although they don't go much into detail regarding specific numbers we can expect to see. They simply say: 'Number of...' instead of giving exact numbers or estimations. Now, I usually do not mind KPIs that lack exact numbers, because these can often be hard or almost impossible to predict, but this section just has a general lack of details that makes it a little confusion to exactly pinpoint what the community should expect to see and at each stage of the process. Not having a github link doesn't help much either. Another minor detail is the 'Success measurements' section which is an almost exact copy of their roadmap from the feasibility section. That, in itself, is not a problem but I don't believe it would be unfair to ask for a bit more details (be it in text or number) regarding the different phases of development and what the community should expect to progressively see getting built. Breaking down the varying components of the work would have been very beneficial. One last point I would make for this section is regarding their previously funded proposal. I would usually expect to see in this section a breakdown of how the new proposal differs from the previous one, what has already been accomplished (if applicable) and why a new proposal is needed. Granted, they touch on this a little bit, but I would personally prefer more than 2 sentences to let the reader fully grasp the benefits of a new proposal. In general, this is a good proposal but would have benefited greatly from a little bit of research and technical background for the team to build a more convincing case. Also working on making their progress traceable and easily accessible would have been a great added value to the proposal.", "q2r": 4, "assessor": "z_assessor_2392", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 4552, "q0": "This proposal effectively addresses the challenge. As an African myself, I realize that the next wave of innovation and talent in Africa will need come from the people, and the best way is through a decentralized community such as Cardano. A stake pool alliance could go a long way towards bridging across nation state borders and connecting like-minded individuals together.", "q0r": 5, "q1": "I agree that the team seems competent and able to implement this proposal. There is one consideration missing from the proposal, and that is the centralization/decentralization question. An alliance is a valuable resource, but the potential downside is that it creates a pseudo-centralized body.\n\nI would like to see expansion on what precisely the \"Alliance\" part refers to. If this alliance is to create a centralized ideological power-house for African stake pool operators, it is working against the spirit of Cardano.\n\nI would encourage the team to answer the question of \"How does an alliance encourage and promote decentralization, without itself becoming a centralized authority\".", "q1r": 4, "q2": "There are a lot of auditing mechanisms given and that is great for the auditability. \n\nAs a successfully funded proposer and founder, I would encourage the team to collate all their auditing into a gitbook, or some central repo/doc-hub etc. Although many auditing mechanisms are provided, it is difficult to see where these will be located for access by the broader Cardano community. I did not deduct stars for this, this is just merely a suggestion for what we've found works really well.", "q2r": 5, "assessor": "z_assessor_2562", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4691, "q0": "The lack of understanding by users of all verified impact projects in the blockchain space is a problem that needs to be addressed in this challenge. It is directly related to the current challenge. The author has come up with a solution to this problem that they will pay new participants to help them better understand the platform and invite Cardano projects to claim their pages. Here is the solution the author came up with for this challenge. They also raised the risks that they can take when implementing the project that it is difficult to find the right developer and the time line is too long, which affects the implementation of the project. However, the author also offers solutions to satisfy the above risks and the author also promises to build a more comprehensive, sustainable and supportive blockchain space for everyone. people who understand more about Blockchain and Cardano.", "q0r": 5, "q1": "The author has identified clear, detailed and reasonable timelines to perform the work with specific goals. They give 4 important milestones to implement this project: from May to July they will do preliminary research and engage other PB collaborators, from August to October they will research to find new and existing solution for PB webstack, from Nov to Jan they will find developer or authorize existing PB member to support, from Feb to Apr they will develop new PB webstack. This project progress is fully auditable and trackable. The solution of this proposal will impact the challenge proposed by the team by helping to create a rich, open, and safe environment where people from different cross-chain communities can find common ground. shared. Where these communities can come to PB to share knowledge, resources, skills, ideas and visions with each other. The success of the project is that it addresses the pain points of the chain impact ecosystem cross and help provide a platform for all positive impact focused blockchain companies to showcase their projects to the world. Provides a gateway to a greater open, inclusive, and supportive blockchain ecosystem. The author measures the success of this challenge over 4 periods: 3 months, 6 months, 9 months and 12 months. They also detail the stages that must be taken in their successful progress so that the viewer can follow the project more objectively.", "q1r": 5, "q2": "Well-defined KPIs that determine the success of the proposal through the 4 metrics the author listed are: number of initiatives with cross-chain teams, number of posts sharing progress and community updates via Linkedin and Twitter, number of companies joining PB database, Number of new features added to PB and made available to community members. The author offers great ideas that will effectively tackle the challenge. The proposed funding budget is $25.000. The author's budget is divided into 3 expenditures for this project: research: $5.000, supporting other PB initiatives: $5,000, tool development in the amount of $15.000. The author also details the number of hours required for each sub-item. With this budget I think the project will be successful if funded. The team implementing this project consists of 6 main members and includes 1 Cardano4Climate community group. Group members are listed with names and clear personal links. They are good people with different experiences but one thing in common is participating in Blockchain. The advantage of the team is that there are more than 200 groups of active members in the Cardano community involved in this idea. I believe that with what the project listed, this project is enough to audit, enough to carry out this project and success will come to them.", "q2r": 5, "assessor": "z_assessor_2608", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5026, "q0": "The proposal team wants to add developer capabilities for new users and project owner functionalities to the ‘positiveblockchain.io’ website. The website essentially is a database for all blockchain projects that are built to create positive change. The plan is to keep the web stack open source so that users can add new functionalities to the website. The aim is to assemble users and all blockchain-based projects on one platform. This is very effective but I believe its effectiveness is maximized only if there is a way to communicate between individuals or teams on the platform. Another issue is for the users and projects from various blockchain communities to know that such a platform exists. This might involve some serious marketing or somehow catching the eyes of influencers with large followers. Also, I’m unsure what the incentive is for individual users to add functionalities to the platform is. This is an effective project for sure but due to the above-mentioned points, a score of four has been awarded for the impact section.\n", "q0r": 4, "q1": "The team is experienced and has the right connection to see this proposal through. The deliverables include research and development of the web stack. Marketing, outreach, and onboarding users, contributors, and projects from various blockchains. The project timeline is about eight months in total. Based on the proposal evaluation, I believe the team will deliver the tech stack but marketing to all the blockchain ecosystems and their users needs a lot more financial muscle. Based on this rationale, a rating of for has been awarded for the feasibility section.\n", "q1r": 4, "q2": "The audibility of the proposal includes onboarding PB contributors, researching web stack solutions, developing the web stack, and finally delivery of the web stack. After the release, the promotional activities kick-off.  All the developments will be announced to the community. The auditability is straightforward and clear. Hence a rating of five has been awarded for the auditability section.\n", "q2r": 5, "assessor": "z_assessor_2663", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14107, "q0": "The proposal is addrissing the challange as its talks about education regarding the PB and exploring the content and excess to all as its functions by conducting nature are of decentralixation .but at some point proposal said that proposals in part is a further continuation to begin the PB web integration giving Cardano community members direct access to their profiles where they could update progress on their project ,said its not gettng clear and also adding questions on difference between previous and current proposal .we need more clearification about this concern .also its helpful  as this is an open-ended challenge welcoming any proposal geared for cross-chain collaboration and by our community providing “Common research, education, outreach and innovation projects with other chains and communities ,also proposal also address the Educate society about positive blockchain applications by providing educational content.\n\n", "q0r": 4, "q1": "Given experience is sufficient but to engage the team of devlopers is difficult task .to rech out at the workforce who can join and work on running devlopement is quit difficult ,also the way of getting onboard and basic education to them is still not clearified .Provided  plan is not efficetively addressing the implementation of proposal to its success .if we talk abot the team ,they having good experience and also havin work xperience on previous funding rounds.team is having Razali Samsudin who have 14 years of experience as an interdisciplinary Educator from early years settings to postgraduate level, with a background in social sciences, humanities, and sustainability. also Freelance Writer, Editor, Digital Economy, Blockchain, Sustainability and Impact Measurements Researcher (#Blockchain4Good, #Cardano4Good, #NFT4Good), Social Entrepreneur, Catalyst Proposal Mentor. Paul Peschel who is master in Impact driven software developer, climate & tech enthusiast. Developed the first version of Positiveblockchain’s platform. Involved in back-end and front-end work. \n\n", "q1r": 3, "q2": "The provided process is two slow and not getting proper flows and steps to measure the running impact of proposal .one can not find proper access to get understand and also unaware about prior marketing and test to get programmers .audit can not be done as provided information are not sufficient hence its also leads to slow sucess of proposal .", "q2r": 2, "assessor": "z_assessor_3902", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Developing capabilities for new users and project owner functionality on the Positive Blockchain platform + inviting Cardano projects to claim their pages.", "experience": "200+ team of active Cardano community members. Cardano AIM team (voter-tool, CA-tool, vCA-Tool, SDG Proposer Tool, SDG Search Tool). Globally diverse multidisciplinary team of professionals: Catalyst, sustainability and impact research. Fund 5,6,7,8 winners."}