{"id": 422533, "author": "rod.g", "title": "Cardano Pilgrimage", "url": "https://cardano.ideascale.com/a/dtd/422533-48088", "category": 26598, "amount": 48000, "description": "Blockchain is a growing space with communities forming around different chains; many do not look upon Cardano favorably. More often than not it's due to misinformation and FUD, but it hurts Cardano.", "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 1403, "q0": "Yes, this proposal effectively addresses the challenge by hosting informative twitter spaces that focus on advancing cross chain collaboration, as well as some outreach to other chains and projects, referred to as \"pilgrimages\". \n\nThe idea here is good, to break down barriers by engaging with different chains both within the team's own twitter spaces and going to where the other conversations are being had. I like this dual approach, rather than just sitting and trying to get people to their shows alone, they will take a proactive approach to evangelize Cardano. \n\nOne way I think this section could be strengthened would be by sharing some  context as to how many people they reach currently, and then explain how the funding would allow them to reach more people. This feels important since there are several other projects that plan to also host community engagement events (through twitter and other media). \n", "q0r": 4, "q1": "Yes, given the experience and plan presented it is very likely that this proposal will be implemented successfully. \n\nThe strongest indicator for the feasiblity section is that the team has already been conducting their twitter spaces for eight months. The list of topics are diverse and I appreciate that academic/philosophical approach to discussing blockchain issues, beyond the tech but to include the human aspect of it too. \n\nThe plan is decently laid out and makes sense, however, there are a few things listed that I think could be better explained here. First off, the infographics/materials that are used to support the discussions. It is good that the team provided their list of past topics, however, since the focus is on cross chain collaboration, it would be good to have some idea as to what the topics you plan to cover are so we are not left wondering. \n\nSecond, I find the pilgrimage discussion a little weak compared to the rest of the proposal. The idea is excellent, entering non-Cardano spaces to dispel misinformation and/or lies, however, there is no real explanation as to what venues, how you will choose them, and whether all three of the proposers will participate. What worries me here about feasibility is that there doesn't seem to be any consideration of what happens if you are not welcomed in those groups? What makes you think that they will want to listen to you over other people? Is it a lack of information issue since the information you bring is already publicly available? Given that this is a major part of your proposal and is what's \"new\" in this proposal from what you are currently doing, it should be included. \n\nI'd also like more granularity on the budget rather than general expectations but overall it seems fair. For example, what I mean by this is, under artists they have $5k for infographics, NFTs for giveaways, minting costs, and decals/stickers, but how many infographics/giveaways/decals/stickers does $5k buy? Do you intend to spread it evenly? These are details but when to comes down to voting, these details matter. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nThe team commits to hosting twitter spaces and recording them in the CardanoMinistry Muse World where interested individuals can rewatch the spaces and also access additional information. This is easy enough to audit since it will be clear whether or not they held the spaces, how many attended, and what was discussed.\n\nAs mentioned in the other section, the auditing of the pilgrimages may be a little more difficult since the attendance at a different space, does not necessarily imply that they will speak or be listened to. Given that this is a major part of the project there should be more indicators about how to determine whether the presence there was a success. \n\nOne thing I would encourage the team to consider expanding on are the success measures. As it stands there are not really any tangible ways to measure what they determine to be success or if they have met it. While yes the goal is to \"engage audience in critical discussion\" what threshold of engagement is success? One additional person? Ten?  Making clearer linkages between your KPIs and success measures will certainly increase the score in the next round. ", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5807, "q0": "This proposal effectively addresses the challenge by holding discussions about cross chain collaboration. This is important for Cardano to collaborate and have discussions with other blockchains. This meets the challenge requirements of cross-chain. The Cardano Ministry directly address the issue of toxic environment by having a code of conduct and respecting all people. They interact with a lot of different chains in the crypto space.", "q0r": 5, "q1": "This is already a successful endeavor and likely to continue its outreach into the crypto community.  The team is highly experienced in holding discussions on twitter spaces and has a large outreach. The plan is laid out clearly and has enough information to likely be successful. The team has a large following on twitter. The link to the Cardano ministry muse place has a lot of information about the group and is done very nicely. ", "q1r": 5, "q2": "The information in this proposal is sufficient to audit the progress of this project. They are doing twitter spaces every week which are recorded and publicly available and shows metrics of how many people came to the space. The metrics of success are clearly laid out and could be audited. The project will include NFT minting which can be audited publicly because its on the blockchain. ", "q2r": 5, "assessor": "z_assessor_2751", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6152, "q0": "Blockchain is a growing space with communities forming around different chains. Many people are not sympathetic to Cardano and mistakenly think about the ecosystem. The idea is that the Cardano Department has organized Twitter spaces for the past 8 months and imported spaces held by others, to disseminate accurate information about Cardano and its thriving ecosystem. it follows the typical philosophical, academic style. Proposals are consistent with the goals of the challenge and are detailed and richly described. The plan is to promote and encourage cross-chain collaboration. The output of the proposed team will include educational material, infographics, a rich web space to house these resources, and the mentioned NFTs, stored in the Cardano Ministry wallet. The team will encourage new proposals while informing others of the benefits of voting and evaluating proposals. Besides, the group was confident in their ability,. The team saw little or no risk with this project and was well prepared to take on the project it was actively working on.", "q0r": 5, "q1": "The proposed team outlined a very clear and detailed plan. Milestones are set over 4 weeks. The team also provides a specific and coherent timetable for each task that needs to be done during the week. and elaborately explained. With the plan sheet provided, we know all that will be done and in what time period. Next is the budget. The proposal asks for $48.000. The rate is less than 10% of the total challenge budget set. In my opinion, the value requested is quite reasonable and deeply justified. The author has provided a very detailed budget table. The budgets are broken down, and allocated to each very specific job, estimated hourly, per job. Finally, about the core team members. We know the members are all people with the right skills and experience to do the work on the project. It would be great, if the author provides a link about each member, so that we can know more about the history and experience of the members that the proposal has presented. In general, the plan of the proposal is very good, the budget is transparent and the members are skilled and experienced, increasing the feasibility of the proposal.", "q1r": 5, "q2": "The proposal is new, but from the plan board, it shows the expertise and active efforts of the proposed team. A detailed roadmap in each milestone can help developers easily audit the progress and success of the project. In addition, the strong team and detailed and transparent budget in the proposal, create strength for confidence in the success of the project. The proposal team provided us with a lot of specific information so that we could easily track the progress of the project. By keeping track of the number of wallets, containing Cardano Set tokens. Community involvement on Twitter...Meaning we can track in many ways how the project's phases will evolve, and we know what value it will bring to the community. And the final product is what is expected, the success of this project. Since we are provided with a lot of information, I believe that information is complete and satisfactory has been established. The proposal has good auditability and transparency.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 9801, "q0": "The challenge addressed in the proposal Cardano Pilgrimage brings value to the cardano ecosystem by providing useful information to onboarding new members . \"The Cardano Ministry has been hosting spaces on Twitter for the past 8 months that emphasize deep, critical discussion of philosophy, poetry, psychology, art, and technology\" The terms listed here relate to all humans regardless of blockchain , but serve as a connection space . The knowledge that the members of the Cardano ministy find importance in relating this information back to Cardano. The twitters spaces have been a globally accepted space for people to connect. The ability to scale the cardano ministry is favorable as they can create new spaces with new hosts and existing hosts, and allow active members to scale to different time zones as the cardano ministry grows. ", "q0r": 4, "q1": "The proposal plan for the Cardano Pilgrimage proposal has a great team for leadership in the space . The cardano Ministry has been a leading example of how twitter spaces can revolutionize the mindframe to connect us all together, thus the outreach is exponetial . The proposal is suggesting the most amount of funding to provide their host with incentives for their time in the space and onboarding new cardano members to the ecosystem . The members are well diverse to uphold certain aspects of the proposal including management, web development, and giveways. The users will recieve tokens to track the number of wallets that hold the Ministry Token.", "q1r": 4, "q2": "The proposal suggests that the engagement on social media will help track the auditability of success . The Cardano Ministry also plans to creat a token that when held in users wallet will help estabish a \"membership\" This could create positivity and inclusivity amoung followers of the pilgrimage . Proposal suggest that progress be meausre on a weekly basis. ", "q2r": 4, "assessor": "z_assessor_3098", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13737, "q0": "The proposal identifies a problem within the challenge that needs to be solved. But the approach proposed is already being done plentifully by other individuals/entities. Taking this into account, the impact of the proposal, if executed does not justify the amounts of funds requested. Therefore, I rate this proposal 2 stars out of 5. To get a higher score in this department I'd suggest reducing the amounts of funds requested by the proposing team to make the expenditure worth it. Some areas in which I'd suggest the proposer cut expenses would be giveaways and marketing expenses, as these are not key to the success of the proposal.", "q0r": 2, "q1": "I do believe the team is going to achieve the proposal will be implemented successfully given the experience provided. Sadly, the experience of the proposing team is not \nascertainable as only one of the team members is Doxxed, and no LinkedIn pages were provided. To get a higher score in this department I'd suggest giving more transparent information about the team members.", "q1r": 3, "q2": "The number of active wallets is not a valid KPI as the proposer does not explain how it's going to determine which wallets were created thanks to the implementation of the proposal and which are just byproducts of Cardano's adoption. To get a higher score in this proposal I'd suggest using new delegations to the SPO as a better KPI.", "q2r": 2, "assessor": "z_assessor_3773", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "The Cardano Ministry will hold spaces, and enter spaces held by others, to disseminate accurate information about Cardano and it's thriving ecosystem in typical philosophical, academic style.", "experience": "The Cardano Ministry (@iamnotstradamus, @Rod.g., @Genki.ada) has been holding spaces on Twitter for over 8 months that offer a unique flavor of philosophy, poetry, psychology, art, and technology. We are building a long-term community in the ecosystem.\nWe also operate DRMZ SPO."}