{"id": 422712, "author": "nmkr", "title": "Crosschain Minting Solution", "url": "https://cardano.ideascale.com/a/dtd/422712-48088", "category": 26598, "amount": 100000, "description": "Non-Crypto-Native NFT collectors don't care about on which chain the NFT is stored. They just want to pay with their wallet and receive the NFT on their current chain.", "f6_no_assessments": 10, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"id": 838, "q0": "The final user of NFTs shouldn’t have the need to be a “tech-head” to acquire and use those.\nLike the internet, people must be made able to use blockchain with ease & pleasure, that’s the whole point of our industry.\nConcerning more advanced users, they should be able to move their assets across different chains, and use them in any existing piece of metaverse.\nBeing able to get your favorite NFT, on your favorite blockchain seems like a game changer, and could help define a new standard for the whole industry.\nImagine if you could just get your precious Crypto Punk onto the Cardano Blockchain! Based! Right?\nBridging these blockchain can be made using a layer 2 like: Milkomeda, which has already made it possible to use “cross-chain” Dapps.\nI would say this proposal is perfectly aligned with the challenge, Bulls Eye!\n", "q0r": 5, "q1": "The NFT-MAKER’s team is composed of true OGs of the Cardano ecosystem, their CEO: Patrick Tobler is well known among the Cardano community. \nNFT-MAKER was the first NFT minting tool on the Cardano blockchain, with a very large part of NFTs on the market that have been minted using this tool. (1.2 million NFTs).\nThey are genuine problem solvers! We don’t know the identity of their solidity developer, but it does not look like a potential issue.\n\nThe budget seems to be adequate with their needs, briefly broken down, but clear.\n", "q1r": 5, "q2": "This part should be pretty easy, the team can be found almost everywhere, as on Ideascale and Twitter, or Linkdn.\nThey will keep the community updated using monthly written reports and share them with the Catalyst community.\nThis could have been better explained because we don’t know how, exactly.\nStill, I'm confident about their ability to communicate with the community along the process.\n", "q2r": 4, "assessor": "z_assessor_2138", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 995, "q0": "It goes without saying that this is an interesting proposal by NMKR Team. That is to create a solution where people could mint NFT on Cardano and Milkomeda (cross-chain). This proposal will bring another technical implementation connecting Cardano and Milkomeda for the community for sure. Furthermore, it will also increase on-chain activity growth due to the new cross-chain implementation for NFT use case. The metrics is also aligned with the challenge setting metrics. From my point of view, this solution will bring benefit or freedom for the end-customer to choose whether they would like to mint the NFT on Cardano or in Milkomeda chain. In general, this will bring new options for the NFT artist and NFT collectors in Cardano community. I give 5 stars for the impact.", "q0r": 5, "q1": "When it comes to the experiences in Cardano NFT (CNFT) minting, I think NMKR team that’ lead by Patrick is quite well-known in the communities. Furthermore, Patrick is also part of Plutus Pioneer Program from IOG. With the addition of Solidity DEV + ReactJS DEV + legal team, I think they could achieve the target that they mentioned in the proposal. Equally important is that they also explain the timeline with milestones for the development. All the possible main risks are concisely answered with the solution to mitigate the risk. For example, established partnership multiple EVM experts to support the EVM development. The budget is broken down based on the manpower necessities. Nevertheless, it could be written in more detailed instead of lump sum, so that the community know what the hourly rate for the developer and legal team is. Overall, I’m quite confident that NMKR team could bring the project into realization. Therefore, I give 5 stars for the feasibility. ", "q1r": 5, "q2": "First of all, it’s worth considering that NMKR is an established company based in Switzerland. I’ve checked their website and also following their journey since 2021. Even though they only put the link of their website in the proposal, I could find lots of documentation and tutorial also via their YouTube channel (https://www.youtube.com/c/NMKR_IO). And we could monitor their progress project maybe from their blog (https://www.nmkr.io/blog) or press announcement (https://www.nmkr.io/press). Nonetheless, it would be nice if the NMKR team could add the KPI/metrics that is measurable for the success of the project itself. Weighing up both sides of the argument, I give 4 stars for the auditability.  ", "q2r": 4, "assessor": "z_assessor_2174", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1405, "q0": "Yes, this proposal effectively addresses the challenge by integrating a smart contract into NFTMakerPro to allow minting NFTS on Cardano or Ethereum. Given that NFTs make up major revenue streams for both chains and respective communities, this solution could have a major impact at reducing silos between the two and the unnecessarily competitive tribalism. \n\nThe proposers clearly understand the lay of the land and the fact that most users (and likely to increase with retail investors) don't actually care about which chain they use, they just want their good. As Charles always says, we will know we have made it when blockchains are like Wifi. It doesn't matter which provider it is, it matters that it works. \n", "q0r": 5, "q1": "Yes, given experience and plan presented it is highly likely this proposal will be implemented successfully. \n\nNFTMakerPro and Milkomeda are two major players on Cardano and have already provided great services and utility to the ecosystem. Given that they are leading this proposal it is very likely that it would be implemented successfully. \n\nThe plan is short but clear. I would encourage the proposers to provide more information in the plan however. While I respect the knowledge and skill of the proposers there should be more explanation of what each of the steps entails. These are leaps that not all voters can make and therefore the more you can spell it out in a plain and concise manner will only strengthen the proposal. \n\nFinally, I am marking this section down given that the team doesn't have EVM capabilities but that it is 40% of the budget. Therefore, there is a chance that the team is unable to obtain the appropriate individual to help realize their vision. If the team has already obtained the services of someone then that could be better clarified. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. \n\nBoth groups leading this proposal have excellent track records of participating in the community, providing valuable feedback, and continuing to expand what is possible on Cardano. It is certain that they will continue to act in this manner given that the continue to be named as stand up members by Charles himself, and you see them everywhere. \n\nThe written reports that will be shared are a good start but it would have been nice to know what the testing/audit/validation process would be for the SC itself. Would the team be pursuing additional input from key players in the community or would it be proprietary and not shared? This could be better explained. \n\nRegardless, the teams' end goal of being able to mint through NFTMakerPro and have it issued to the Cardano or Ethereum blockchain would be a great achievement.\n\nExcellent work. ", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1964, "q0": "The proposed solution aims to bring interoperability and collaboration between Cardano and other well established blockchain by launching a smart contract on Milkomeda. This will enable a kind of smart minting which easen the launching process for NFT projects. This will help artists and developers in the initial phase and later on it will help the community members and users that want to acquire the NFTs by enabling smart chain selection.\nThis is a great step in the right direction to make Cardano relevant in the future of multi-chains. The proposal is well aligned with the challenge settings campaign brief and has to be considered impactful in that sense. With that in mind, it is likely that this solution will bring value to the Cardano ecosystem. As a result, the proposal receives 5 points in terms of impact.", "q0r": 5, "q1": "The proposing team has relevant experience in most of the areas required to implement the proposed solution. This can be backed up with evidence from their provided website. However, there is one position for a “Senior Solidity Developer” that is currently undisclosed. Is this position undisclosed because of legal reasons or is the position not filled yet? It is hard to tell from the proposal and it will affect the feasibility greatly if it is not filled, since it can be hard to find the right talent. This should be addressed in order for the community to be confident that the proposal really is feasible. \nThe claimed budget does not provide hourly rates, and this should be included in order to strengthen the confidence in the budget (It can be calculated quite quickly by hand so it's not a huge deal, but good to know for future reference). \nThe plan is somewhat detailed but could be argued to be sufficient enough given the scope. It would be interesting to know if some things could be developed in parallel or if the project is estimated to be finished by the end of week 16. \nOverall, the proposal receives a good rating in terms of feasibility but in order to feel fully confident, the undisclosed solidity developer position should be further clarified to the community. A score of 4 points is given. ", "q1r": 4, "q2": "The proposal is unfortunately lacking a bit in the auditability department. It is mentioned that monthly reports will be shared to the Catalyst community, but it is unclear where, how and in what format. A widely accessible and public channel should be provided, and this is where all progress and relevant updates should be shared. This makes auditing very easy and clear for the community. \nAnother aspect that is lacking in the proposal are KPIs that are measurable, this would make the progress easy to evaluate. A definition of done is stated somewhat clearly but it could also be further refined to make it measurable. After the development is done, it should be easy to evaluate if the project is a success with simple “Yes/No”-questions on a set of criteria. \nAll in all, the proposal could be audited from the written reports (but should be stated where we can get hold of them), but the main problem in terms of auditing is the lack of KPIs and measurable metrics. It is hard to evaluate the progress and finished product, therefore a neutral score is given. 3 points.", "q2r": 3, "assessor": "z_assessor_2290", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3023, "q0": "This challenge setting and its objective are very important to end the tribalism in crypto and avoid duplicate development efforts on many chains that may even feel hostile to each other. Overcoming silo mentality and supporting interoperability of blockchains stand at the core and should be embraced by every proposal in this category. This proposal addresses that challenge setting in that it offers cross-chain communitcation when it comes to minting NFTs. It is also very useful that double-minting will be avoided, as time, money and resources will be saved. This is the first try in that direction and i thibk it can add up great value to the Cardano ecosystem. I believe that it can be a great start for future challenges. ", "q0r": 5, "q1": "On feasibility, there is a very clearly outlined budget that has been broken down into identifiable items and is quite reasonable for this project, when thinking that two kind of blockchains have to come together. The only thing i would like to ask is why the developers involved in this project will not be necessary for the whole 4 months that the project will be running, but only for 2 or 3 months? Don't you think that they have to be up and about, should something new appear? Unfortunately, the details of the people working on the project are insufficient. No solidity developer has been hired yet, the legal team and the Q&A team is something very abstract, as no team members are referred. No links have been provided for at least the two known members of the team or even their relevant/prior skills. However, there is a clear implementable plan with a realistic timetable and that is a plus when considering the feasibility of the project. Also, there should be a reference when it comes to the necessary resources to implement this proposal. ", "q1r": 3, "q2": "There is a time horizon with all the milestones in it and all the necessary details needed, but there are no clear metrics to define the success of the proposal. The proposer states that measuring the success by artists launching their NFT collection on multiple chains at once and end-customers choosing on which chain they want to receive their NFT, but there are no other key metrics or mumbers on them. For example how many artists should there be to consider this project a success? How many customers choosing each chain will be considered as enough? Also, tracking the progress will be via reports as it is mentioned. Will those reports be available on the site link you have provided at the start of the proposal or somewhere else? For those reasons, i cannot give a good rating for auditability. ", "q2r": 2, "assessor": "z_assessor_2385", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3140, "q0": "The impact of this proposal is huge. By creating a simple UI for end-users to mint NFT across any supported chains is going to be beneficial for both Cardano and the integrated chain. As most creators/end-users don't really care which blockchain the NFT is being created or store, this proposal solves the issue for them. If a user has MetaMask and wants to buy/mint an NFT at Cardano, there is currently no option for this particular set of users and this proposal solves it by enabling them to buy the desired NFT using their MetaMask. All in all, I strongly agree with this proposal as it effectively addresses the challenge.", "q0r": 5, "q1": "The timeline & deliverables in this proposal are listed accordingly across a time range of approximately 4 months. The budget breakdown is clear and reasonable. The team behind the project is solid and has a good track record with a working product that many of us used(NFT Maker). The risk are mentioned and addressed professionally. Overall, with all the given experience and plan. It is likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The milestone and deliverables are clearly stated and the team would write monthly reports on their progress and status. However the author did not state on which channel/platform the reports will be listed at. Would appreciate if that is written in this proposal. The proposal lacks information regarding metric/KPI to quantify the project's success. To be fair there is a brief statement but more details would be appreciated (i.e x numbers of artist using the platform). Overall, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2403", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4233, "q0": "The \"crosschain minting solution\" proposal addresses the cross-chain collaboration challenge by providing a solution that allows for minting on Cardano and Milkomeda at the same time. Previously if the NFT is already minted on Cardano, it won't be mintable on Milkomeda and the other way around. With this tool, the user can simply select which chain they want to launch their NFT and select either a Cardano wallet (Nami, Eternl, etc) or a Milkomeda wallet (Flint, metamask). The tool will be one of features in NMKR studio (formerly NFT-Maker Pro). This will boost the flow of NFT minting activites in both chains and make this proposal addresses the challenge very well. In the end customers (NFT buyers) are the winner as they can choose which chain they can receive the NFT and also allow NFT sellers to launch collections on multiple chains at once. The team considers that they might need manpower in EVM development to increase competency in this task.", "q0r": 5, "q1": "The project will take 16 weeks ie. 4 months in total to complete. Although the team hasn't specified the pay rate explicitly, I can work out their pay rate provided with timeline and budget for each role. Even though the team member is a well known founder of NFT-Maker, I would appreciate if the team could supply team member profile link (Linkedin, any URLs). There is also \"Undisclosed\" solidity developer (not sure if this is because it's not been fixed yet or trade secret) but the team could add this to the transparency of the project. The proposal would need to provide the pay rate and team member profiles in order to make this project feasibility rank improved. Also I would need to say about the budget the team request in future should be more considerate when comparing against the total budget for this challenge ( $100,000 out of $900,000 for the challenge would be more than 10% and leave too little room to other proposers). The team has a very clearly laid out plan and considered risk/challenge. They also manage to find way to mitigate those risks (mostly in cross-chain smart contract part). ", "q1r": 4, "q2": "The team will create the monthly report to share with the community. The solution will be done in simple to use GUI. The team should have included how they will measure progress and provide the target figures. It would be quite a challenge for the community to track the project progress if the measures of success is unknown and so as its unspecified targets.  I would recommend the team to provide more information explicitly in future as the voter wouldn't need to come up with their own conclusion or read between lines. The score reflects my appreciation of their work which would be beneficial to the entire CNFT ecosystem and also to their own platform. It will boost the NFT activities for Cardano and also allow Cardano to catch up with their counterparts in this space.", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4558, "q0": "This proposal provides a problem statement and and a very clearly described answer to that problem.  NFTs are huge business, and I could see the community being turned on by having the ability to release and mint NFTs cross chains.  For example, I know someone who learned of Walking Dead NFTs on Ethereum, but was turned off by the gas fees/historical security concerns and opted to pass.  Beginning with NFTs, this idea could build bridges for further interoperability in future projects, bringing value to the Cardano ecosystem and very much addressing the Cross Chain Collaboration challenge setting.  Scaling to address future challenges is not addressed in the proposal, but the final product is expected to be an “simple to use GUI”.  No mention of open-sourcing this product, which would even better align with strategic goals for fund 9.  Rated 5 stars.", "q0r": 5, "q1": "The description of the team's goals is clear and simple.  I noted that the team hasn't included many extra links (Github, videos, etc.) to help understand how this will be built.  The extent of presented material is their website and this does not offer technical information re: building.  I would like to see more information available about the team and what they do – the “Team” section of the website has vague titles but no other information about the personnel or their specialties.  The proposal outlines how many people and types of specialties they will need for the project to be completed successfully, though only 2 specific team members are listed as being on board for this project.  Between the timeline and budget information, it appears that the team has a plan to deliver, but I would like to see more technical breakdown of the steps to justify the pay rates for the developers.  There is no plan mentioned if additional funding is needed to complete the project, but the author confidently states that if funded, this team has no plans to ask for further funds in Catalyst for this project.  I noted that material resources were not mentioned in the proposal,  but perhaps it can be assumed that they have resources to accomplish their goals as an existing NFT minting service that has minted over 1.2 million NFTs.  There is one risk listed having to do with the team's lesser knowledge of the EVM development, but I would also like to see how the team plans to address the risks of cross chain security, as many hacks have occurred on Ethereum.  In conclusion and most importantly, the makers of NMKR (formerly NFT Maker) have a track record of delivering.  Rating feasibility at 3 stars.", "q1r": 3, "q2": "There is a 5-point roadmap that has time limited milestones included. The success of the project will be measured by the existance and functionality of the promised product and there are no KPIs listed.  This is an awesome feat loaded with utility if completed, but as mentioned above, there is missing information re: steps/personnel/resources involved in arriving at this final product.  The completion of the final product is somewhat measurable in its existence and functionality. The proposal states that monthly progress reports will be shared with the Catalyst community. Specificallywhere and how does the team plan to publicize this information?  Rated 2 stars for Auditability.", "q2r": 2, "assessor": "z_assessor_2563", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6496, "q0": "This proposal is very interesting. The proposal delivers the idea that NFT users don't care which chain their NFT is stored. It would be easiest for them to pay for the NFT and receive it on their current chain. NFT-Maker proposes the idea to resolve this issue by allowing for an NFT to be minted on both Cardano and Milkomeda at the same time. This means that if it was purchased on Cardano. The user wouldn't be able to mint it on Milkomeda. This has a lot of potential because there are many users that are planning on using both Cardano and Milkomeda blockchains. I believe that this proposal can bring a lot of utility to both blockchains and ultimately, help grow Cardano. I believe that this addresses the current challenge completely. The team just needs to make sure that they inform their community of this proposal so that they are aware. I am uncertain if this has taken place. That would be my suggestion. For these reasons, I give this section 5 stars.", "q0r": 5, "q1": "The team behind NFT-Maker have been very successful in the early Cardano ecosystem thus far. The proposal includes information on their team members which is great because it allows for the team to be held accountable for this proposal. I would suggest including a LinkedIn profile or possibly a link to more information about the team for assessors who aren't familiar with the team. The proposal includes a specific roadmap that ideates what the team plans to achieve. There is about 16 weeks of work that the team plans on accomplishing from building the smart contracts to bug fixes and testing. There is also a detailed budget breakdown that shows where the funds will be allocated. These specific details throughout the proposal are important because it allows for the community behind NFT-Maker to hold the team accountable for their proposed idea. For these reasons, I give this section 4 out of 5 stars. There could be more explanations on the team's experience and details on the budget breakdown. This would suggest exactly why the required funds would be needed for each section. ", "q1r": 4, "q2": "There is a lot of important information included in this proposal. The team is fantastic and has already achieved a lot. For those that don't know the team. They may not have as much trust because the details in the proposal weren't very detailed or specific. This could use more details. Apart from that, the roadmap is very descriptive and gives specific information. This helps audit the potential success of the proposal. When looking into a proposal. Having a community behind the project or team is very important. This allows for transparency for the team and ultimately accountability to take place. This form of accountability will be one of the strongest tools to help determine the likelihood of success for this proposal. I believe that this proposal to bring a cross chain minting solution between Cardano and Milkomeda will benefit a lot of users and bring more value to both chains. For these reasons, I give this section 4 out of 5 stars for just some minor touchups.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11337, "q0": "This proposal is addressing a not so known, but soon to be known issue. What chain do you mint your NFT's on? If you mint them on Cardano, you are locked into the Cardano ecosystem and can not sell or trade them on EVM's (Ethereum virtual machines). This proposal is addressing this issue by presenting a solution that would allow a user to choose which chain to mint on... the Cardano blockchain wallets, or Milkomeda wallets such as metamask opening up a huge area to sell and trade your Cardano based NFT's. \n\nThis proposal effective addresses the challenge of cross chain collaboration. This would expand the CNFT space into the EVM space and begin the process of interoperability in the NFT space. This will also add value to the Cardano blockchain as it will allow people to choose where they mint their NFT's and for whatever reasons they have.  Furthermore, it will be trivial for artists & developers to launch collections on multiple chains at once, bringing the space further together.\n\nThe only area of concern would be around scalability. I would like to see more detailed information in this area within the proposal. Is Milkomeda the only chain this can be implemented on? Would it be possible to scale this out to where a user could chose to mint on, say, Cosmos, or some other chain? This seems to be a grey area within this proposal. However, the cross chain collaboration between Milkomeda and Cardano is great starting point.\n\nOne final area of uncertainty is has the team considered what will happen when Milkomeda becomes a layer two to Cardano? This is not presented in the proposal, and something I feel like should be added. With all of that said, I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "When it comes to feasibility of this proposal I will start with the timeline and milestones. Here we are given a descent amount of detail concerning timeframes and milestones. Everything written into this section of the proposal is reasonably achievable. \n\nNext is the budget. In this budget section we are given only the basic information. A voter wants to know exactly what the requested funds will go to and why and for what purpose. We are told very basic information with not much detail at all. For example, here are the first couple parts of the budget:\nSenior Solidity Developer for 3 Months: 40 000 $\nSenior C# Blazor Developer for 2 Months: 30 000 $\nSo here we are told that $40,000 will go to solidity developers. However we have no idea who that will be, nor what the solidity developer will be developing and why they need exactly $40,000. With a lack of details in the budget section I can not agree nor disagree as to whether or not these funds are actually needed and whether or not that would cause the project to ultimately fail or succeed. The voter needs a more detailed budget section in any future proposals put forth that breaks down exactly what the funds are being used for and are more easily identifiable. \n\nIt is also mentioned within the proposal that CNFT MAKER and the team behind it does not have much experience in the EVM space. They have recognized this as a risk, and have also provided ways to mitigate that risk in leaning on other experienced and qualified people who know this space inside and out.\n\nFinally we have the team itself. This proposal has given a us a complete list of all team members, but has failed to give us links where we can go and verify the education, history, accomplishments, etc of each of the team players. The good side, however is that everyone listed are known names in the Cardano community and most are part of NFT maker and we can see the history and success of that project. This, however, is not a reason to leave out links to information on each team member. The voter wants to know that the team members has the qualifications and skills required to successfully implement this proposal, or they do not have a real reason to vote for funding the project. It is very important that any future proposal provide links to team members.\n\nWith everything said here, the information given around experience and the plan presented it is difficult to determine how successful the implementation of the this proposal is and so I have chosen to rank this well needed project as not being able to agree or disagree that given the experience and plan presented it is highly likely this proposal will be implemented successfully. However, as a side note, i would vote to fund the project simply because I was able to do some personally research into the team members, read up on their discord, and do a few other things that have convinced me that this project would be implemented successfully, but as far as how this proposal is written currently, the rating I have chose still stands.  It is important that when various proposals are written, that they are written properly to give them the highest chance of receiving the votes they need to get the funding. ", "q1r": 3, "q2": "This proposal provides no roadmap at all concerning key performance indicators (KPI's) to let individuals see the progress of the project. There is nothing listed to determine the progression of the project once it is funded.  With that said, they did specifically let us know that they will create monthly written reports about the status of the project and will share them with the Catalyst Community. This is sufficient but not optimal. \n\nIt is important that a voter, once they have voted to fund a proposal and get it on chain and benefiting the Cardano ecosystem to be able to keep up with the progression of the project from funding to implemented and usable on chain. Without KPI's this is not an easy task for any individual. If the proposer every creates a new proposal, please consider this aspect when filling out the proposal. \n\nThere is work that needs to be done in this area in any future proposal, however, since they plan to create monthly written reports about the status of the project that will be shared with the catalyst community, I do agree that that it is sufficient (though barely) to audit the progress and the success of the proposal. ", "q2r": 4, "assessor": "z_assessor_3237", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We are proposing a solution that allows for Minting on Cardano and Milkomeda at the same time. If the NFT is already minted on Cardano it won't be mintable on Milkomeda and the other way around.", "experience": "NFT-MAKER\nWe built the first NFT Minting tool and have since then expanded into becoming the largest Minting API, powering over 1.2 Million NFTs on Cardano.\nPatrick Tobler\nPatrick is a Computer Science graduate, Stake Pool Operator, Plutus Pioneer and founder of NFT-MAKER"}