{"id": 422723, "author": "konmaorg", "title": "Konma to bring in TRUTS on Cardano", "url": "https://cardano.ideascale.com/a/dtd/422723-48088", "category": 26598, "amount": 60000, "description": "Although Cardano has begun its adventure on being the go to place for DAOs and other community related ventures There's no platform or solution where you can find all these communities in one place.", "f6_no_assessments": 5, "f6_rating": 3.0666666666666664, "videos": [], "media": [], "f6_assessments": [{"id": 369, "q0": "The proposal addresses the challenge in the sense that it is a platform with cross-chain projects listed on it. That being said the How the proposal addresses the challenge portion of the proposal doesn't really dive into details on this. It would have been great to get an in-depth view of how Cardano fits into the existing TRUTS platform and how cross-chain collaboration can be formed out of it.\n\nIt would have been great to see some cross-chain metrics in the tracking project progress section of the proposal. Understanding general usage is great but how can we ensure that the proposal is hitting metrics in alignment with the challenge.\n", "q0r": 4, "q1": "The team behind the proposal has an existing product which creates confidence around their capacity to complete deliverables. Diving into the people who will work on project section it is clear the team has the competency to succeed at the task at hand. My only issue is this section was the longest out of any in the proposal. This illustrtes a lack of information (demonstrated by risk and proposed solution sections) that make it difficult to understand what success is for this proposal. \n\nThe milestones section of the proposal is well formated in the sense that it gives you a deliverable, timeline to complete, and the KPIs for the deliverable. One tip would be making the detailed budget section a bit more clear. At the current moment it looks like the costs for the milestones is in addition to the specific budget items of engineering and talent, partnerships and marketing, and other. \n\nOverall I am excited at the potential of this proposal but the planning section leaves a bit to be desired. What does the development process look like? How will the project work to onboard users? to onboard communities? Answering these questions would be a great way to get a higher star rating in a future proposal. \n", "q1r": 3, "q2": "The information provided in the proposed solution is a bit sparse. A value prop is provided but there isn't an in-depth description of what TRUTS will look like from a Cardano perspective. A bit of digging on their links does clear up a bit more on what TRUTS is but all this is focused on EVM projects. It would be good to describe in the proposal where Cardano fits in. \n\nThe risks section is definitely lacking in the amount of text it should have. The risk stated of total usage of the platform by communitities is listed but there isn't any expressed language on how it will be mitigated. Additionally it would have been great to get more risks such as moderation of reviews and potential development issues. \n\nOverall this proposal has a good skeleton to it but there isn't nearly enough information to feel confident about auditing the progress and success of the proposal. Expanding on the ideas stated would help a lot with future proposals!", "q2r": 2, "assessor": "z_assessor_2070", "no_vca": 16, "ne": 3, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 1147, "q0": "Konma presents a solution to a problem that does not exist. The team claims that no one place exists where one can find out about different DAOs and web3 communities among different blockchains. However, the title mentions TRUTS, a site with over 480 communities listed. Even for Cardano specifically, plenty of projects exist that showcase DAOs and communities (e.g. BuiltOnCardano, Essential Cardano). Granted, none of the resources have a full list. As a funded proposer and full-time Cardano contributor, it personally does not bother me that not a single place exists where one can stumble on my projects. In the case of TRUTS, which Konma apparently wants to clone for Cardano (while having team members working at TRUTS), only 5 projects have more than 10 reviews. Apparently it is not worth it for even community managers to incentivize their members to submit a review on a platform like this. Even KonmaDAO is not listed on TRUTS.\nIt would be a stretch to apply the challenge example of “Already successful projects expanding from other chains to Cardano” as this would be a rewrite of TRUTS.\n\nThe team addresses the risk in not listing enough communities for proper traction and thus making it easy for newcomers (how they will discover the site is unknown) to join a community of a specific project - presumably based on a five star rating. From a business owner perspective, I don’t even bother with the data entry task of more “established” sites (mentioned above) for Cardano as I rate the possible positive impact as very low.\n\n\nHowever, if you find a way to survey all the blockchain spaces and enter accurate data yourself, then that would be a very different and a lot stronger proposal.\n\nThere’s also a missed opportunity to connect with the fund’s purpose to “Prepare a group of people willing and able to make contributions to the ecosystem.”\nA clear articulation how people would be incentivized to tell others about communities on your site, the impact rating could be higher.\n\nYet, for the reasons mentioned above, I do not agree that this proposal identifies a problem within the challenge.", "q0r": 2, "q1": "The project has a projected length of 7 months.\nBased on their plan, they would get 1000 reviews and 1000 users within four months, which would meet their success metrics. The reviews would be supposedly easily verified and users could be crawled as well. These metrics are good enough for the proposal itself but fail to connect to the greater purpose of the challenge itself. The 10k website visits are a vanity metric and quite low in relation to the other metrics as this would mean that far more than 10% of site visits are account creations.\n\nThe number of reviews are a good starting point, but if your goal is really to connect people to these communities, you should at least track click throughs to the communities socials.\n\nThe proposing team comprises a web developer, product manager, a generalist, an API dev / DB admin, and a smart contract developer (no plutus / plutarch / marlowe though?) from TRUTS. A whitelabelling of the site is very likely in the realms of possibilities and budget. However, the budget suffers from not being broken down enough. The team also has three members of Konma listed, who have two prior funded projects in Catalyst. Konma has not delivered proof of progress on these, let alone close any of these out yet. Surprisingly for such an engineering heavy proposal is the absence of any Github links. The success of this proposal is dependent on plutus development (“smart contract developer” and “learning blockchain” on LinkedIn for key personnel is not encouraging) and marketing, which is lacking. I would like to see how the $20k would be spend on marketing.\nAdding all DAOs of the ecosystem and having 15 reviews for each of them seems unlikely if they were supposed to be genuine. The team has not even accomplished thi for TRUTS itself. Only 5 of over 480 listed communities have 15 or more reviews.\n\nThe team indicates they may run out of money. If the team was breaking down their planning more carefully (incl. budget), they would probably be more certain about their needs. It is unclear what the team actually commits to.\n\nCan the team launch a TRUTS clone by cloning their existing codebase and slap a new logo on? Absolutely! Can they publish the reviews on Cardano, get all DAOs and communities listed and reach their reviews within 4 months? The evidence presented says otherwise.", "q1r": 1, "q2": "The project has a projected length of 7 months.\nBased on their plan, they would get 1000 reviews and 1000 users within four months, which would meet their success metrics. The reviews would be supposedly easily verified and users could be crawled as well. These metrics are good enough for the proposal itself but fail to connect to the greater purpose of the challenge itself. The 10k website visits are a vanity metric and quite low in relation to the other metrics as this would mean that far more than 10% of site visits are account creations.\n\nThe number of reviews are a good starting point, but if your goal is really to connect people to these communities, you should at least track click throughs to the communities socials.\n\nOverall, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_2209", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4424, "q0": "The proposal that solves the goal set out in the Challenge is \"Cross-Chain Collaboration\" as the team intends to build a platform to record assessments and insights from members. Currently, I have not seen any platform that does this. If you do it successfully, this will add value to the Cardano ecosystem. The essence of this is that it helps to increase the transmission of information and store information in a decentralized way for all participants in the community. If implemented well, it will be a valuable repository - a decentralized governance system (DAO), I know that there are a lot of good ideas to start from this platform. Thus, the team determined that the problem that needed to be solved was that the community was lacking a decentralized platform to store detailed information. This proposal refers to a platform that is also seen as a place to make it easier for everyone to access the Cardano ecosystem in particular and Web3 - the entire digital blockchain field in general. I think the proposal is powerful today, as it can meet things that are not available in the Cardano blockchain system, it can be scaled to solve future challenges by Decentralized storage and communication of information is always necessary in a modern world, on all continents, including developing and developed places, even more applicability is needed. of this proposal. I vote 5 stars.", "q0r": 5, "q1": "In terms of ideas, I consider the ideas expressed in the proposal to be practical, and applicable in practice. The members of the team are all experienced people in blockchain, crypto, DAO, web, etc... Most of them are public with the link of social networks, namely Linked and Twitter here. . Which increases the feasibility of the proposal and enhances the credibility of the team. I appreciate the disclosure of almost all the members that the team has presented.\nAs for the budget breakdown, I found this to be a rough, concrete one - the team just outlined the amount of money needed to hit the milestones without specifying how much it had to be from the top of the work to be done in the next few weeks. that milestone. I advise the team to quickly analyze the budget clearly for the community to understand. At present, such budget analysis makes the feasibility of the proposal less clear. In addition, I have a question for the team about the feasibility of using the budget, which is: If Fund 9 has not been funded by Catalyst, will the team continue to work on this proposal? Or does the team have other human resources sufficient to implement this proposal (money can come from other organizations that the team can mobilize)?\nThe team has a relatively specific plan divided into 3 main milestones to do the work (3 main milestones do not include time), with the corresponding duration of each milestone from 2 to 3 months. I temporarily accept the way the team presents the proposal's plan.\nIn terms of resources needed to implement, the team has quite adequate human resources to implement this proposal. They are all well qualified and experienced in the field in which they are involved. However, I noticed that some members of the team were also working on other proposals in Fund 9, which raised concerns in the community that the team could not concentrate on the best resources to complete the proposal. Because proposals that have team members involved in Fund 9 are executed in parallel. Can the team elaborate on this to increase community trust in the proposal and team members? This question is also my advice to the team, it is a way to increase the feasibility of the proposal. I hope the team will carefully consider my positive comments.\nOn the technical side, the technology that the team intends to use in this proposal - I have not identified any positive points on the technical side. All technical details are presented by the group quite sketchy without specific proofs or explanations so that readers can understand clearly. I would love for the team to add more technical analysis to keep the community informed (examples are: how to build a discovery platform with reviews for DAOs, how to add more specific bananas to the filter, etc...). This is the next way to increase the feasibility of the proposal.\nAbout the challenges and risks associated with implementation. The team raised the big risk of not being able to list enough communities to provide good enough traction. I and the community are still looking forward to the team taking on more challenging risks of this proposal. This is a new proposal, aiming at high-tech technology and having a certain impact on society, so there can't be only one risk raised. I would like to introduce another risk related to the price of cryptocurrencies, specifically here the price of Ada. We all know that the market is currently in a downtrend state, so the team may experience a slippage at the time of receiving funding from Catalyst compared to the current Ada price. Faced with this risk, I advise the team to rebalance the budget accordingly so that there is no shortage of budget when implementing the project. And if the team needs more money to implement, it should give more specific plans to verify.\nIn summary, after what the team has shown to demonstrate the feasibility of the proposal, I both agree and disagree with the feasibility of this proposal. I hope that the team will consider my questions and comments carefully and in a positive way to improve the proposal. I vote 3 stars.", "q1r": 3, "q2": "When it comes to the auditability of the proposal, we must refer to the roadmap and milestones the team has outlined. I've only seen the team map out three major milestones (each of which takes 2 to 3 months of work). I don't see a specific route on the suggested board. An expression like this makes the evaluation criteria of the roadmap and milestones of the proposal sketchy. The roadmap here is understood by me in the sense that major milestones or important work heads are tied to specific months of the year (January, February, etc... - this is just an example). If we do so, the new team will confirm the auditability and transparency of the proposal, helping the community to have a more convenient and faster assessment of the progress of work and audit. The presentation of the team's milestones (a bit sketchy) has adversely affected the auditability of the proposal. So, I would like to reiterate my advice: The team tries to supplement and associate specific months of the year with milestones or typical efforts. The team presented a pretty convincing KPI, based on the number of website visits, the number of referred communities, and the number of reviews on the platform. This is seen as part of an effective work report. In addition, Truts' main KPI is also reflected on Linkedin of John - a key member of the team. I am satisfied with the KPI that the team has started. It's a pity that I can't see key metrics. As everyone knows, key metrics are also one the important factors to confirm the transparency and auditability of the proposal. Therefore, I hope the team adds key metrics for completeness. In return, how the team defined the success of this project, by giving specific numbers (more than 1000 reviews, 10,000 website visits, etc...). Along with that is a clear description of the problem and a clear solution throughout the proposal. My additional question is: Can the team share more about how the improvement of transparency and real auditability when applied in practice will bring concrete results in the future?\nIn summary, with the points that have worked well and those that have not, I agree and disagree with the auditability of the proposal. I vote 3 stars.", "q2r": 3, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6259, "q0": "This proposal seeks funding for the development of a platform that records reviews and insights from the community members on-cahain.\nThe problem is not very clearly presented and the connection between the problem and the challenge is uncertain.\nThis proposal does not address the inclusiveness and the cross chain collaboration for solving common problems trough making connections between the blockchains this challenge is about.\nI disagree that this proposal effectively addresses the challenge.\n", "q0r": 2, "q1": "The proposer lists only one risk, the risk of not sufficient participation. However the proposer does not present a mitigation strategy to limit that risk.\nThe proposer presents a plan that is not very clear, however it is divided in 3 milestones, and during 7 months period. However timeline is not presented and it is not clear if these will be consecutive or parallel months.  There is a lack of detail.\nThe budget is outlined as an ask per milestone and other sectors. Hourly rates and specialized professions and work hours are not presented. Explanation for the rates is not presented.\nThe team is well presented and the team members present linkedin accounts and social media links for further investigation and support.\nThe proposer intends to seek further funding if they need it, however, they will try to deliver everything with this funding.\nThe proposer has 15 proposals in fund 9 for a total ask of $2248000. For fund 8 the proposer had 13 proposals and only one was funded for 24.9K\nI disagree that the project plans and budget supplied is feasible to deliver.\n", "q1r": 2, "q2": "The auditability section of this proposal  presents KPIs that are metrics of the website visits, however the proposer does not present any hard numbers against which the auditor could compare the real progress of the project. There is no timeline for when these KPIs will be  delivered or what will be the exact number that will be delivered.\nSuccess metrics are concrete and well defined however again the timeline is lacking.\nI disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 2, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14568, "q0": "The team aims to create a discovery platform with reviews for DAOs to make it easier for people in web3 to discover the communities, find the one that fits the most, and join the Cardano ecosystem and web3 more. Generally speaking, the proposal meets the impact requirements of the challenge when it encourages more people to be engaged in web3 and the Cardano network. When it comes to the project description, I find it pretty brief. More should have been elaborated on, like the KPIs to clearly and easily measure the impact of the platform, or the solution to the foreseen risk of the team. As the team anticipates the risk of not being able to list enough communities for bringing good enough attraction, they may keep building up their platform after it has been launched. This helps them stay updated on the latest number of the DAOs. Even when they can list all the communities at the time of their launch, more communities would also be built after that moment. Therefore, keeping updated is a necessary thing to do to benefit its users. My rating for this part is 4.", "q0r": 4, "q1": "The plan for executing the project is clear and quite easy to understand. It’s presented with three milestones with expected duration, results and requested funds for each. This part is well written and organized. Next, the team breaks the budget down to three components for achieving the three milestones. Unfortunately, this part is not explained clearly enough. For example, the community may question why all the milestones require $20,000 each or why the team comes up with this figure. The budget is explained again in terms of the three components covered to obtain the three milestones altogether.  And I wonder again why $30,000 is a reasonably allocated fund for engineering and talent, $20,000 for partnerships and marketing, and $10,000 for other things like events and hardware. Without some explanation, it’s difficult to see the feasibility of the required fund for these project components. Moving on, the description of the team members is much better. The details about the people who will be working on the project are explicit (responsibilities/positions and background information) and can be verified through the links provided. I deduct one point because of the unclear budget breakdown and my rating is 4.", "q1r": 4, "q2": "  The auditability part is short but I think the information provided hits it hard. It tells clearly and exactly what the community needs to evaluate the auditability of the project. How to measure the project progress and development? The team answers with three criteria, all coming in numerical form (number of website visits, number of communities onboarded and number of reviews on platform.) What does success look like? The team replies with specific goals as well (Having 1000+ reviews, 10k website visits, 1000+ people joining communities). These KPIs are easy to understand, and the progress, development and success of the project are easy to audit. In general, this part is very satisfactory to me. I’d like to congratulate the team on their good job and my rating is 5.", "q2r": 5, "assessor": "z_assessor_4072", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "We propose to build a platform that records reviews and insights from community members on-chain , this platform will help the communities rate themselves and others based on activities.", "experience": "Started MemeDAO, worked with clients like coinbase and polygon. Lead community at Questbook, made it biggest web3 dev community in India. Been early member of , pizzadao, daomasters, superteamdao and konmaDAO. wit the help of konmalabz we aim to integrate the cardano community"}