{"id": 382142, "author": "haskell2020", "title": "Cardano Chinese Tutorial", "url": "https://cardano.ideascale.com/a/dtd/382142-48088", "category": 26252, "amount": 10000, "description": "promouvoir Plutus et Cardano auprès d'un grand nombre d'ingénieurs Java(Solidity) en Chine", "funded": 0, "upvotes": 15624368, "downvotes": 19435364, "votes_result": 3810996, "votes_cast": 99, "f6_no_assessments": 8, "f6_rating": 2.5416666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer identifies the problem of how to promote Plutus and Cardano for engineers in China. As a solution, it presents the continuous translation of courses into Chinese as a way to promote Cardano to China blockchain companies. The proposer talks about completing the translations of some materials in 3 months but does not specify which or how many materials will be translated in that time. It would be good to establish goals to monitor the success of the proposal", "q0r": 3, "q1": "The proposer does not present evidence of its experiences, so it is not possible to assess whether it will actually be able to implement the proposal. It is not specified how many people will be involved in translating the materials. The proposal has a realistic deadline but lacks a conductible plan that shows exactly what will be done and how. The proposal does not pose risks for its implementation. The budget has been detailed and appears to be reasonable in line with the proposal", "q1r": 3, "q2": "The proposal presents a clear understandable solution to the problem and a description of the problem. The proposal has a deadline but lacks KPIs or metrics to monitor the success of its implementation. The roadmap would also be important to assess the auditability of the proposal. ", "q2r": 3, "assessor": "z_assessor_429", "no_vca": 15, "ne": 3, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "\r\nThe problem needing to be solved has been identified and articulated namely most Cardano-related news and resources are delivered in English,and therefore Java (Solidity) programmers dont understand English and need local language resources to learn programming,  presenting a barrier to Chinese speaking programmers. It is clear that this proposal falls within the scope of the challenge brief by translating courses in various Blockchain programming technologies.\r\nThis proposal shows how it adds value to the Cardano system by by translating courses in various Blockchain programming technologies.\r\n Key metrics  would be  number of users, number of terms translated, number of documents translated , number of CHinese programmers doing courses, no of programmers working with Cardano Blockchain. The key metrics and goals of the proposal fall within the scope of the challenge.Proposal can be scaled up to address future challenges by adding more articles. \r\nThis project will have a positive impact on Cardano system by increasing the awareness and knowledge among Chinese language speakers.  \r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 4 star rating.\r\n\r\n \r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.\r\n", "q0r": 4, "q1": "The proposers  have provided no evidence  of themselves with their skills and experience in  , translation or these sort of projects.  No Linkedin profiles are given here.     The links are not sufficient. \r\n  There is no way to know if the proposer is competent to do the site.   The type and number of team members required to implement the proposal is not stated.No team structure is listed.The budget has not been given in detail. No hourly rates nor number of hours has been given. \r\nThere is no plan for additional funding  if objectives are not met. Theres no timetable and not much details.  The proposal doesnt give  a sensible and conductible plan for implementation. The proposal has technical aspects which have been addressed The proposer has not identified risks in this proposal  iven experience and plan presented it is not highly likely this proposal will be implemented successfully\r\n This proposal is not detailed and budget is not reasonable hence I have given it a 2 star rating.   \r\nThe above mentioned issues could be resolved  upto the next Calls for funds. \r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities", "q1r": 2, "q2": "There is no clear roadmap with milestones  \r\n \r\n There are several Metric of number of viewers, number of users, number of terms translated, number of documents translated , number of CHinese programmers doing courses, no of programmers working with Cardano Blockchain\r\n  \r\n \r\nThe problem has been clearly understood but solution has not been given in much detail.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties.\r\n \r\n\r\nThe information provided may not be  sufficient to audit the progress and the success of the proposal hence I have given it a  2 star rating.\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool. ", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 15, "ne": 4, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "\"Translating programming documents into different languages ​​has always been a necessity in order to create a wide variety of language resources that are accessible to as many developers as possible. When there are many developers, projects can be developed aggressively.\r\n Besides, Chinese is one of the most used languages ​​in the world (currently more than 1 billion people are using Chinese). Therefore, the impact on people who want to become developers to use Chinese is huge. I really like the idea of ​​this proposal.\r\nProposal would be more impactful if it gave specific numbers on how many people these articles reach. How many developers are endorsed through these articles?\r\nBesides, these articles should be systematic as a specific course and not just articles on WeChat. Because it will be difficult to make real developers by just reading these articles. Therefore, it is more efficient in my opinion to translate a programming course, not individual articles that are not systematic.\"", "q0r": 3, "q1": "\"The proposer has 8 years of experience in java development and 4 years of Haskell development experience. But I don't see any evidence given to support those experiences. Where will the translated articles come from? Or are these articles written by the proposer himself? Proposer needs to clarify this information to ensure the accuracy of the translated documents.\r\n\"\"after reading my translated article, the reader will be able to develop applications. most Chinese blockchain companies use eth and solidity. I hope that in a few months, they can consider using the Cardano platform to build applications when selecting technology. I cannot guarantee that they will use Cardano 100%(because eth currently has a large market share and is more popular), but I will do my best to promote.\"\"\r\nAs I understand here the proposalr wants to make articles to create interest of people who are using Solidity to switch to Cardano-based programming using Plutus, not to use these articles to guide people who don't know yet. Programmers can learn Plutus.\r\nCurrently, the documentation, support tools and development of existing Dapps on Eth are huge. It will be difficult to convince people who are programming in Solidity (a language easier to learn than Haskell) to switch to Haskell and Plutus if the proposer does not offer specific benefits to these developers. Therefore, just writing or translating documents like this is not enough to encourage them to switch to programming with Plutus on Cardano.\r\nIn my opinion, the proposer should focus on people who have no knowledge of blockchain programming so that it is more feasible for them to get started with Plutus and Haskell.\"", "q1r": 2, "q2": "\"Proposer doesn't seem to understand Catalyst's funding. Proposer will give the budget of the proposal that wants to be funded in dollars, then Catalyst will fund the proposals in ADA corresponding to the amount that the proposal wants to be funded \"\"Requested funds in USD\"\" Therefore, the proposal for funding 10,000 ADA and making budget breakdown by ADA will cause many audit problems because it is different from Catalyst regulations.\r\nWe can audit the articles of the proposal through the articles in WeChat easily.\r\nBut without giving specific numbers on the number of people reached through these articles, the number of people who can become developers with Plutus and Haskell through these articles is also difficult to determine. the success of the proposal\"", "q2r": 3, "assessor": "z_assessor_645", "no_vca": 14, "ne": 5, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "The proposal is within the challenge because it would increase Chinese technical Catalyst members by translating  (Plutus,Marlow,Haskell,Glow) courses into Chinese and may increase adoption of Cardano in China. If it is successful, we may have new developers for Cardano and Catalyst community and widen Cardano adoption in specific region. \r\nIn my opinion, the idea is great.\r\nHowever, I would recommend the proposers should make the proposal more understandable by clearly articulating the success metrics, the plan, timetable because they seem to be in a mixture.", "q0r": 4, "q1": "As my reading, the proposal's problem statement and describing solution has 2 activities: Translate Plutus/Haskell/Marlow/Glow materials into Chinese and Promote Cardano to China blockchain companies. However, the targeted product is materials only ( in plan timetable as well as in budget broken down).\r\nBased on 2 activities in the plan of the proposal, I have two questions: 1. Where (what site) will the materials be posted? \r\n2. What is the detailed plan in promoting Cardano to China blockchain companies?\r\nI also suggest the proposal should be more feasiable by re-ordering information and adding missing information (of how success looks like, roadmap with milestones, metrics/KPIs). I recommend an example (It could be like this)\r\n- How success looks like: witnessing an increasing interest in Chinese community both to learn about the Cardano Project and also to build on it, and witnessing a wide adoption of Cardano in China blockchain companies.\r\n- Roadmap, milestone and action plan:\r\n       Months 1-3: translation of Plutus tutorials (at least 15-20 articles) and some Haskell tutorials (at least 20 articles); finding China companies that recruit blockchain developers in recruitment websites commonly used by Chinese people, and promote Cardano to them (at least 5 companies use Cardano platform to build their application).\r\n       Months 4-6: translation Marlow materials (at least 15 articles) and Glow materials (at least 20 articles); continue promoting Cardano to China blockchain companies (at least 7 companies use Cardano platform to build their application).\r\n-Sample KPIs for auditability of the proposal will be listed in the following comment (in auditability assessment).\r\n(Note: As a CA, my suggestion is just an example for the proposal more feasible, I do not suppose to ask the author follows my sample numbers since he is professional in his major.)\r\nBecause of the missing information, I rate feasibility with a score of 2.", "q1r": 2, "q2": "The proposal needs to be clear in metric/KPIs (Key Performance Indicators) and pushling the progress for auditing. So that the site in which materials posted needs to be provided. For example KPIs could be like this:\r\n- Amount of Plutus materials translated into Chinese\r\n- Amount of Haskell materials translated into Chinese\r\n- Amount of Marlow materials translated into Chinese\r\n- Amount of Glow materials translated into Chinese\r\n- Number of companies that have developed in Cardano platform\r\nBecause of the missing information to audit, I rate auditability with a score of 1.\r\nSince the idea is great, I believe the author can make it to become a great proposal in next Fund.", "q2r": 1, "assessor": "z_assessor_714", "no_vca": 11, "ne": 3, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The problem stated in this proposal is clear and relates to the channel in the sense that its solution aims  to teach readers to develop readers' own applications based on the Cardano platform and to expand Cardano's influence by continuous to translate Plutus / Marlowe / Glow / Haskell / Atala Prism / other courses to Chinese. Its positive impact is therefore addressed, both globally for Cardano and the Chinese community, but could have been more specific with regard to the Catalyst ecosystem. The KPIs could have been the subject of a separate and more clearly identifiable paragraph but are consistent with those of the challenge by giving quantitative objectives for translated articles. ", "q0r": 4, "q1": "\r\nThe experience and skills of the participant could have been more detailed and supported by links, which blurs the possibilities of the community to clearly identify who will be behind the project and be able to refer to it. Likewise, the implementation plan and the details of the budget could have been the subject of a very separate part to facilitate the understanding and reading of the document and to clarify the stages of the project in a more precise way. Because the information mixed both plan, budget, future and previous actions at the same time. However, the risks are approached with solutions provided by the participant to remedy them. \r\n", "q1r": 3, "q2": "\r\nAs a whole, it would have been preferable for the information to be classified by theme to facilitate transparency and understanding of this proposal. The fact that the articles will open comments and communicate with readers is a plus, but providing more explanation of how this project would communicate its progress to the Catalyst ecosystem would have strengthened the auditability of this proposal. Providing links to previous work would have provided a better idea and understanding of the project. \r\n", "q2r": 3, "assessor": "z_assessor_739", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "This proposal offers to translate to chines Plutus/Marlowe courses and other courses about Cardano Developer environment. The goal is not well described in the proposal, in terms of a number of articles, but it lacks details about what is the perimeter of one single article. I recommend the proposer elaborates about what is translated, example of article, what source. \r\nI agree  that chinese speaking people will play a huge role in Cardano's development, so the impact of Chinese tutorials can be huge.\r\nBased on above I neither agree nor disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 3, "q1": "The proposer is a developer claiming a 4 years' experience in Haskell. Unfortunately, he does not provide evidence of this experience, so I cannot take it into account to assess project feasibility. Indeed, understanding source documents is a prerequisite for a good translation job.\r\nA budget is listed, with a breakdown detailing how much money is used to translate Plutus, Marlow, Atala prism or Haskel content. However, feasibility depends on the quality of the availability and quality of source documents. I recommend the proposer to elaborate the source of the documents that will be translated.\r\nBased on above, I neither agree nor disagree that this proposal is likely to be implemented successfully.\r\n", "q1r": 3, "q2": "The proposer offers to translate and publish 1 article per week, which enables a good way for the community to monitor the progress.", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "I disagree that this proposal effectively addresses the challenge since the proposer commits to translate articles about blockchain and programming languages like Plutus, Marlow, Atala, Haskell to Chinese community. This may help readers have more understanding about blockchain but I see it has little impact to Cardano community. This proposal doesn't not narrow down the target audience.", "q0r": 2, "q1": "Since the proposer claims to translate all of the articles, I see his/her reference has no skills, experience or professional to do this job. Therefore, budget remains unconvincing. Timeline is his spare time at weekend and after work, which is authentic but unacceptable. \r\nI strongly disagree that this proposal will be implemented successfully.", "q1r": 1, "q2": "This proposal doesn't provide me enough information to audit. It has no roadmap, milestones, time horizon, key metrics to success and KPIs.", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Conceptually, this is a useful proposition, it translates Plutus / Marlowe / Glow / Haskell / Atala Prism / documents into Chinese, promoting Cardano to Chinese Blockchain companies. However, the time to translate the document is too long \"It is expected that the Chinese translation of Plutus tutorials and some Haskell tutorials will be completed within 3 months\". As you know, the knowledge and information about the blockchain as well as the Cardana ecosystem is always changing and developing day by day. It takes at least 3 months to be able to translate, during those 3 months, that information gradually becomes outdated, not keeping up with the times.", "q0r": 2, "q1": "Whether it is a large or small project, the role of a team is very important, it helps to divide each part of the work, thereby providing long-term development orientations. It's a pity that the proponent seems to be working on it alone, I think a few more associates will be needed. Although the knowledge and experience has been provided, but there is not any information to verify it (personal profile, linked in,...) The proponent only provides that they have development experience java and Haskell, not to mention translation experience, so how to translate those documents alone?\r\nIt's good that the proponent has provided ways to promote and attract people to the project. However, the implementation roadmap still has many unconvincing points. Budget required $10,000, budget allocation has been provided, although it needs to be further clarified, specifically this amount will be paid based on working days or hours worked or articles translated? The amount of content that needs to be translated is relatively large, translating alone will take a lot of time, which will definitely cause information delays.", "q1r": 1, "q2": "The information provided is not complete, it is not enough basis for people to judge the success. The proponent should provide sufficient information, and make appropriate corrections and additions to increase the persuasiveness of the project. Should provide profile/long-term roadmap/work with team/detailed budget allocation/... (as I mentioned in the previous section). In addition, there should be criteria to evaluate success, for example: the number of visitors, the number of positive comments, ...\r\nThis is not a bad idea, but let's do it together, don't give up!", "q2r": 1, "assessor": "z_assessor_862", "no_vca": 15, "ne": 4, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "traduire en continu les cours Plutus/Marlowe/Glow/Haskell/Atala Prism/autres en chinois, promouvoir Cardano auprès des entreprises chinoises spécialisées dans les blockchains.", "experience": "8 ans d'expérience en développement java\n4 ans d'expérience en développement Haskell"}