{"id": 382835, "author": "twomin", "title": "2Min Review by Vietnamese Voices", "url": "https://cardano.ideascale.com/a/dtd/382835-48088", "category": 26252, "amount": 18480, "description": "Les électeurs et les parties prenantes des communautés non anglophones, comme le Vietnam, ont du mal à comprendre les propositions de Catalyst rédigées en anglais.", "funded": 1, "upvotes": 49293908, "downvotes": 15218433, "votes_result": 34075475, "votes_cast": 229, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great proposition for Vietnamese voters. This proposal is intended to make it easier for the Catalyst Vietnam community to access Catalyst proposals by translating them into Vietnamese. The solution was to produce short 2-minute videos and podcasts in Vietnamese containing analyzed information for 25% of the recommendations in Fund 8 and Fund 9. There was clarity in the problem description and solution presented and suggested by challenge.", "q0r": 4, "q1": "The proponent has done a lot of background work and thought through the ideas that underlie the proposal, which adds to the feasibility of the proposal. A proposed 3-member team has been identified. The project team is very well presented, we know the names, fields of training, interests and social profiles (like Twitter, LinkedIn, and even websites) of the team members, creating a sense of security. safety and high reliability in their work\r\nFrom what can be read in the proposal, the proposal has invested considerable time and effort in this project demonstrating trust and dedication. I have full confidence that with the experience and planning presented here, this proposal can be successfully implemented. I am Vietnamese myself, I completely agree with the suggestions given, indeed with the increasing number of suggestions and not being good at English, it takes me a lot of time to understand a suggestion, because Therefore, it is not possible to evaluate many proposals. So I hope this proposal will be successful.\r\nA number of potential risks and challenges have been identified and proponents have been given several approaches to solving their problems.", "q1r": 4, "q2": "The required budget is $18480, explained clearly and concisely. The stated budget is reasonable enough and it makes me completely agree that the team has enough capacity to tackle the challenge. There are several goals with well-defined KPIs, such as the number of videos watched, the number of registered voters. I think the time frame given is reasonable and the community should be able to verify the work and process of this project", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 15, "ne": 3, "ng": 5, "nfo": 7, "vca_o": 1}, {"q0": "The idea is great. A short video &podcast in which a proposal' information is analyzed in Vietmeses would help Vietmese Cardano community easy to understand that proposal with a covenient way and saving time (a video just 2 minutes long). 25% of proposals in Fund8 and Fund9 would be produced. It would help voters to vote proposals better and therefore the quality of voting is increased. It is also able to scale to future challenge (by producing in other languages for example). Moreover, the proposal is within the challenge setting because it addresses most of the objectives in the challenge's success:\r\n    - Increase adoption and community engagement of non-English speakers\r\n    - Increase amount of resources in a variety of languages   \r\n In summary, I strongly agree the proposal is impactful.", "q0r": 5, "q1": "I agree the proposal is feasible as the description of the proposal's feasibility: goals are clear, roadmap with milestone and timeline provided, the team's experience and skills are undoubtedly for successful implementation, budget is split into items very clear and reasonable; risk is also considered.\r\nHowever, the team says in the proposal that some test videos about featured projects in Fund6 has been uploaded in your Youtube channel, but the link is not provided.\r\nI recommend the team should provide at least 1 video/podcast as a sample because it would be not only evidence of the team's experience and skills, but also useful for readers be able to understand clearly about how the proposal's product would be.", "q1r": 4, "q2": "I strongly agree the proposal is auditable because the goals and KPIs are understandable clearly and very specific. It would be very easy to audit and valuate the progress and the success of the implementation when the products are uploaded in the channel.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "Vietnamese Catalyst community is become bigger day by day. Therefore they deserve more support, especially for those who can not understand English can have better understanding and more access to the Cardano resource. These Videos and podcasts will be great ways to guide Vietnamese voters and stakeholders since our brain is better at get information in sounds and images than letters. ", "q0r": 4, "q1": "The team have experience in Cardano funding activities and seem really enthusiast about Cardano platforms (Team member have good reputation among Vietnamese community). The proposal is well prepared with clear goal and steps to do the job. Moreover they already have evidents in their activities.", "q1r": 5, "q2": "The result can be easily audited by the number of their videos & podcasts and the strength of Vietnamese community on Cardano platforms. The proposal includes details key metrics and KPIs and clear Road map which help the progress and success of the project is easy to track.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This is a very useful proposal. The number of proposals in the fund is increasing, which is a big challenge for the community. This proposal produces short Vietnamese videos & podcasts lasting 2 minutes containing analyzed information for 25% of the proposals in Fund 8 and Fund 9, it helps people who do not speak English, especially Vietnamese, to grasp the information, advantages and disadvantages of each proposal. Thereby improving the quality of votes.", "q0r": 5, "q1": "I don't know how to comment on the team or the roadmap first, because they both give me a good impression. The 2Min Review team consists of members with experience in community building and development, conducting surveys - field research, currently contributing to Cardano as CA and vCA, experienced in producing, editing, and refining video content. I firmly believe that with such a strong team, the project implementation will become much easier.\r\nThe goals are very specific, with key metrics, KPIs, and timeline. The procedures and methods are well defined from the beginning.", "q1r": 5, "q2": "As mentioned in the previous section, the content provided is very complete and detailed, it is a solid basis for people to judge success. The goals are very specific, with key metrics, KPI, and timeline, easy to track and evaluate. Key metrics are specifically identified and can be found at the 2Min Review channel on the Youtube platform. The budget is explained in detail.\r\nThis is a very useful, potential proposal. I think it will be implemented effectively. Not stopping there, in the future, I hope this project will reach more languages, not only in Vietnam but also reach other countries in Southeast Asia.", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 18, "ne": 5, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Production de courtes vidéos et podcasts en vietnamien d'une durée de 2 minutes contenant des informations analysées pour 25 % des propositions du Fonds 8 et du Fonds 9.", "experience": "L'équipe de 2Min Review est composée de CA, vCA, de constructeurs de communautés, de chercheurs et de producteurs de vidéos."}