{"id": 383018, "author": "cole.vt", "title": "Sustainable Hub for All Backgrounds", "url": "https://cardano.ideascale.com/a/dtd/383018-48088", "category": 26252, "amount": 12500, "description": "Il n'y a pas de partage d'histoires de projets importants représentant des groupes multilingues dans l'écosystème mondial de Cardano, réunis en un seul endroit.", "funded": 2, "upvotes": 104962574, "downvotes": 2662333, "votes_result": 102300241, "votes_cast": 327, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal identifies the problem of the lack of story sharing from impactful projects representing multilanguage groups. It offers a solution for facilitating and increasing the participation of multi-language groups at Cardano. The proposal makes it very clear how it will add value to Cardano and is in line with the challenge.", "q0r": 5, "q1": "The proposer identifies each team member by presenting evidence of their experiences and skills relevant to the project. The budget is detailed and appears to be reasonable for the proposed work. The proposal presents a realistic deadline for completion of the work. The proposal presents a plan to remain sustainable in the future. The proposal presents a conductible plan that shows what will be done.", "q1r": 5, "q2": "The proposal presents a roadmap with milestones enabling the proposal's progress to be monitored. In addition, it presents a deadline for work resolution and KPIs for evaluating the success of the proposal. The proposer made it clear what the target problem is and the solution that addresses the problem.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This proposal poses a clear problem in relation to the challenge criteria. In the sense that their solution aims to facilitate and increase the meaningful participation of multi-language groups. Its impact is clearly stated and is intended to be global, integrating stakeholders into the community through human interest stories. Their added value to the community is clearly articulated, with their desire to facilitate the process of building and growing the Cardano community for native speakers of a multitude of languages and their intention to develop a sense of community and conversation between people. These elements are reflected in the indicators given in the KPIs, which also correlate with those of the challenge. ", "q0r": 5, "q1": "The experience of each member of the group is very detailed and supported by links. Their skills seem to fit well with the needs of the project. The budget could have been a bit more detailed, but it is still understandable, coherent and realistic for the implementation of the project. The technical aspects and contextualisation are also well explained as well as the very detailed implementation plan with the progression of the tasks to be accomplished month by month. ", "q1r": 5, "q2": "All the elements provided in this proposal are clear and the process of setting up the group reflects an appreciable transparency which plays in favour of the communicative aspect of this group towards the community. The indices provided in the KPIs allow the community to rely on concrete elements to attest the success of this project. On the other hand, they plan to communicate their progress through their different social media, as well as a page with the inventory of all the translated texts. Finally, it is possible to follow them through their website and github.", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "I agree that this proposal effectively addresses the challenge as it wants to create a multi-lingual hub for people speaking 14 different languages can access to meaningful projects of Cardano and educational documents about blockchain/ Cardano. ", "q0r": 4, "q1": "This proposal is run by a team of 2 members who both have skills and experience doing research/ writing about sustainability and ADA. So I think if the team has someone an expert about blockchain/ Cardano or having real involvement in Cardano as stakeholders/ pool operators/ Catalyst project - will definitely strengthen the core team since he/ she will provides real experience. \r\nBudget has been broken down into $750/ per language translated, but I don't see who will be the translators for each language, also reference for cost. ", "q1r": 4, "q2": "This proposal should be added metrics to success and KPIs because I see they are now still blank. Roadmap with milestones are clear. The goals are too long yet unspecific in figures. I advice the team should work more on these point. ", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This is a great proposal. Sustainable ADA will be focusing on all the key language groups within the Cardano ecosystem, aiming to get a story written by a writer in their native language, with the ultimate aim of having at least one person representing each country in the world, and talking about their connection with Cardano, blockchain, and sustainability. Since then, becoming a multi language, multicultural, sustainability news and education hub, it bridging people into a world where they are welcomed on their lifelong learning journey & invited into the Cardano community.\r\nIt is essential to cooperate with a team of international collaborators, to translate the content into their native language, to help the content be fully transmitted. People who use the same language can easily exchange and communicate with each other.", "q0r": 5, "q1": "The team consists of members with a lot of knowledge and experience, I believe they are completely capable of carrying out this project.\r\nRoadmaps and plans are described in great detail, making it easy for everyone to track the team's work progress. For the budget part, will the collaborators be paid by the month or by the product?\r\nAlthough the described SGD sub goal is quite ambitious, but I still hope the proponents can realize it, if so, it will certainly bring great benefits to the community.", "q1r": 5, "q2": "I have looked at all the information the proposers provide,\r\nbased on it, people can fully judge the success of this project.\r\nHowever, in addition to the things that I mentioned in the previous section, to increase the persuasion, it is very necessary to clearly define the difficulty - the challenge as well as how to solve the problem - the challenge.\r\nIn my opinion this is a very cool project. I hope in the future, this project will be implemented, if so, it will certainly bring great value to the community.", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 16, "ne": 4, "ng": 8, "nfo": 4, "vca_o": 1}], "solution": "Faciliter et accroître la participation significative de groupes multilingues et de parties prenantes au sein et à l'extérieur de Cardano.", "experience": "Éducateurs, économie, durabilité, sciences humaines, sciences sociales, ONG, entrepreneurs sociaux, écrivains, montage vidéo, Figma, Canva, AdobeCC."}