{"id": 381375, "author": "captainnano", "title": "NANO Frames - Digital CNFT Frames", "url": "https://cardano.ideascale.com/a/dtd/381375-48088", "category": 26248, "amount": 40000, "description": "Los titulares de CNFT buscan una forma de mostrar e interactuar con sus NFT en pantallas físicas con la integración del monedero Cardano.", "funded": 1, "upvotes": 34202711, "downvotes": 20578881, "votes_result": 13623830, "votes_cast": 110, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Creating hardware that can display NFTs is a cool idea. The proposal want to integrade Cardano CNFTs into their hardware so NFT holders on Cardano can display their NFTs.The proposal does have something to to with the Cardano blockchain.", "q0r": 3, "q1": "The proposal provided detailed bios and links to LinkedIn for the team. The proposal provided a link to the website that showed the hardware. Given the experience presented the plan might be implemented succesfully. ", "q1r": 3, "q2": "The proposal provided a high level roadmap and line item budget based. I would like the team to recreate a detailed roadmap with milestones that are connected to the KPIs and budget, in this way the team can track performance vs. expenditure over time. Furthermore, I would like to see the team add measurable goals to the KPIs identified – create/sign up/ X number by Y date –, have 100 users by month 8, etc. As the proposal stands at the moment it might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 18, "ne": 0, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "A tool to display NFT directly from a wallet is a current requirement. It may also lead to a few additional unforeseen innovations like displaying board advertisements by buying an NFT etc. ", "q0r": 5, "q1": "The proposal has been filed by a strong team whose credentials have been provided in the proposal. There is a marked requirement too for an NFT linked digital frame. Therefore it is likely that the proposal will be implemented successfully. ", "q1r": 5, "q2": "The project will develop a physical-digital board displaying NFTs from a Cardano wallet, which is easy to verify. The budget also includes administrative overheads. The proposer's involvement and contribution to the project are critical for its success. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 21, "ne": 2, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "Hello ada voters ! The challenge this proposal is trying to solve is the MISC challenge and that is a challenge for proposals that do not fall under any other challenge fund. This proposal is by Nano Frames and I've researched them extensively! They are right to apply for this challenge because the product they make solves a problem that cardano nft's face and we do not have a challenge for solving cardano nft problems in fund 7. The problem is to give cardano nfts a place to display in the real world. This has been done on other blockchains in a very intrusive way by connecting the private keys of a wallet to a display frame. Nano solves this problem with out any security concerns by giving wallets a Nano digital nft that is connected to the real world display frame. By having the digital nano frame nft you can control what nfts appear on your real world frame. This means that you do not need to give any permissions from your wallet private keys to the frame to give it access to display your nft's. I think the other issue with cardano nft's is that the cardano wallets are just different than say your traditional meta mask wallets. Nano is a first mover in creating a cardano cnft digital display frame. You might ask why this is important. Nft's being displayed will bring awareness to cardano and this product will target long term holders interested in show casing their digital property. Of coarse that is one reason. Another reason is that eventually we may start putting credentials on the blockchain and need a way to display these credentials. For instance a real estate firm in many states is required to have the real estate licenses posted in the firm at all times. Most real estate firms end up having very sloppy photos of licenses covered with magnets or held by pins puncturing holes into the photos. This will be a product that will be essential for displaying neatly either records, digital art, or any other types of nft's. Check out how beautiful these look at the link below https://www.nano-frames.com/?lightbox=dataItem-kvypoxrn2 \r\nNot only will these help in bringing awareness to cardano and create many ways to monetize digital property but the team is also doing heavy r and d into what the cnft community is suggesting to them. They have deep connections to the cnft community and I know this because I do many twitter spaces with the cnft community and Nano is loved by the community by many people I respect. ", "q0r": 5, "q1": "Because i have had the privlege to talk with the team and also research them extensively I do believe they will be successful in bringing their vision to reality. The team is experienced in business and \"it\" as we can see in there credentials here I have copy and pasted from the proposal -  \r\n\"Sipke Soorstra\r\n21+ years in the field as a full-stack software engineer\r\n\r\n- Contributor to the Orchard Project as of 2011.\r\n\r\n- Steering committee member & Benevolent Dictator of the Orchard Project.\r\n\r\n- Creator of Elsa Workflows, an open source .NET library.\r\n\r\n- C#, F#, Python, JavaScript, TypeScript, VB, C (plus plus) , HTML, CSS/SCSS/LESS\r\n\r\n- React, Angular, Vue, Alpine, StencilJS, Xamarin, Flutter, Antlr, Blazor, jQuery\r\n\r\n- WebPack, Vite, Gulp\r\n\r\n- ML.NET, Open ID Connect, EF Core, Windows Workflow Foundation, MassTransit\r\n\r\n- MongoDB, SQL Server, PostgreSQL, Redis, Azure Service Bus, RabbitMQ\r\n\r\n- REST APIs, GraphQL\r\n\r\n- .NET, Cloud computing, Cognitive Services,, Kubernetes, Docker\r\n\r\n- Raspberry PI, iOS & Android\r\n\r\n- Orchard, Orchard Core, Umbraco, Sitefinity\r\n\r\n- DevOps engineering\r\n\r\n- Architecture & design patterns\r\n\r\nSandeep Shelkehttps://www.linkedin.com/in/sandeepshelke/\r\n\r\nLocation: Stavanger, Norway\r\nExperience:\r\n- 15 years of experience in software engineering and product development\r\n\r\n- Plutus Pioneer 2\r\n\r\nWide range of experience in:\r\n- Robotic software solutions\r\n\r\n- Autonomous drone software stack\r\n\r\n- Enterprise level applications\r\n\r\n- Complex architectures\r\n\r\n- c (plus plus), c, python\r\n\r\n \r\n\r\nJorge Orozco\r\n\r\nhttps://www.linkedin.com/in/jorgeorosan/\r\n\r\nLocation: Guatemala, Guatemala\r\nExperience:  \r\n14 years of experience in IT:\r\n- Data warehousing: etl, multidimensional modeling, aws redshift\r\n\r\n- SQL Databases: postgresql, oracle, mysql, sql server\r\n\r\n- Business intelligence: sap, power bi, pentaho, aws quicksight\r\n\r\n- Software development: angular, angular js, php, python, java, spring boot\r\n\r\n- Cloud architecture: aws certified solutions architect\r\n\r\n- DevOps: kubernetes, docker, jenkins\r\n\r\n- Ethereum: solidity, ganache, truffle, web3js\r\n\r\n- Cardano: plutus, cardano-cli\"\r\n\r\nNot only does the team's experience give me confidence but the fact that they are doing a pre sale and have already created products, and have developed a strong presence on twitter and a community on discord should be rewarded in my score as that's more than a lot of proposals can say. ", "q1r": 5, "q2": "We have been given direction of where they will allocate the funds. This means we can audit the usage of funds. My only additional thing I would like to see from the team is more timelines in the fund allocation section. I would like to see this so we could hold them accountable for both the ways the funds will be used and the time it will take to see a return on intention. In this proposal it would be for example a more transparent connection between the dates on the road map and the ways the allocation section would be linked to the roadmap. Maybe one example would be for a \" ui/ux designer \". Maybe instead of just saying we need 4k to for a ux/ui designer the proposer could say the following - \"we need a ux/ui designer hired by m/d/y and we need the ui/ux designer to get x part of our roadmap done by x date.  This will cost 4 k because we have gotten quotes from 3 different designers and that would be the amount they would require with a little extra in case of any human error\". something like that would make it a 5 of 5 for me.  Well, i hope this helps both the proposer and ada voters decide what to do next ! (: ", "q2r": 4, "assessor": "z_assessor_766", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Being a miscellaneous category, to provide a spot for proposals that are related to Cardano ecosystem, this proposal nailed it. In the most active area, NFTs, they are providing a great idea for having platform where people can share/display NFTs with frames/stereo/ and much. This is a fun idea that could only help grow activity and participation.", "q0r": 5, "q1": "The experience of the team is immense, especially related to this NFT framing idea. Plutus Pioneers, Business Admin professional, full-stack devs.\r\nThe plan is rather straight forward. Step 1 start with the presale and beginning. Step 2 launch Creator suite (which appears to be engagement features. And Step 3 to the full platform. The main site is already accessible.\r\nConsiderations for improvement. Expand more on the Creator Suite, as well as details on the functionality in scenarios.\r\nThe budget is outlined well. However, there is a pre-sale sign up going on. it is not clear if this has been factored in when considering the budget.", "q1r": 4, "q2": "One can easily consider metrics useable for auditing and tracking. These will generally be, stages of the platform launches outlined and adoption/usage metrics of the platform. Suggest adding thoughtful metrics within the proposal.", "q2r": 4, "assessor": "z_assessor_816", "no_vca": 17, "ne": 3, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Los NANO Frames son marcos digitales agnósticos para la cartera que muestran las NFT en la cartera Cardano del usuario sin problemas a través de la NANO App.", "experience": "Un equipo formado por 3 ingenieros full-stack con Plutus Pioneer 2 más un emprendedor en serie que se encarga de la parte comercial."}