{"id": 381361, "author": "fhilip.k", "title": "ADA Holder Engagement Survey - AIM", "url": "https://cardano.ideascale.com/a/dtd/381361-48088", "category": 26248, "amount": 50000, "description": "Catalyst necesita una base amplia y global de votantes comprometidos para que el experimento de gobernanza descentralizada tenga éxito.", "funded": 1, "upvotes": 38118072, "downvotes": 23054346, "votes_result": 15063726, "votes_cast": 131, "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta aborda toda una serie de problemas y áreas de desarrollo, tanto dentro de la comunidad del Catalizador como del Ecosistema Cardano en su conjunto. Al conectarse con los votantes, los SPO, los votantes potenciales y al involucrar a las personas influyentes en el proceso, el Catalyst recibiría una cantidad increíble de información inestimable. Sobre todo teniendo en cuenta que Voltaire está en marcha. La propuesta presenta un claro planteamiento del problema, y la solución de obtener información de un gran número de votantes de la ADA está muy alineada. Teniendo en cuenta que esta propuesta podría ser beneficiosa a tantos niveles diferentes en el desarrollo del Ecosistema Cardano (adopción, participación de los votantes y descentralización), creo que es un muy buen uso de los fondos distribuidos. Estoy totalmente de acuerdo en que esta propuesta aborda eficazmente el desafío.", "q0r": 5, "q1": "El equipo principal está formado por algunas de las personas más conocidas involucradas en Catalyst, y se presentan las pruebas necesarias tanto de conocimientos como de experiencia. El mero hecho de que AIM haya proporcionado a la comunidad de Catalyst activos de valor incalculable, como las herramientas CA y la herramienta para los votantes, es una prueba fehaciente del compromiso y las competencias del equipo, junto con la firme determinación de desarrollar toda la maquinaria de Catalyst. Tener varias propuestas financiadas con fondos anteriores también refuerza la credibilidad y la competencia del equipo. La propuesta contiene un plan muy detallado, incluso hay una sección de \"prólogo\" en la que se explican los antecedentes y el razonamiento para crearla, lo que es bastante raro según mi experiencia como consejero comunitario. La dotación presupuestaria es algo sustancial al pedir el 25% del presupuesto total del reto, pero teniendo en cuenta la cantidad de alcance y el posible impacto que la propuesta pretende conseguir, diría que esta cantidad es casi demasiado pequeña. Sobre todo porque casi la mitad de los fondos solicitados se distribuirán entre los participantes en la encuesta, la comunidad. La propuesta presenta un plazo algo realista de aproximadamente 5 meses, que podría ser un poco ambicioso si se tiene en cuenta que gran parte del proceso implica a una gran cantidad de personas de diferentes áreas. Gracias a la ayuda de la red, las personas influyentes y la experiencia del equipo, parece muy factible a pesar de su ambicioso calendario. Estoy totalmente de acuerdo en que esta propuesta se llevará a cabo con éxito.", "q1r": 5, "q2": "En la propuesta se incluye una hoja de ruta con resultados, hitos y plazos claros. Los indicadores de éxito serán fácilmente medibles debido a la naturaleza estadística de la encuesta, al igual que el proceso de análisis. Al leer la propuesta, el equipo pretende compartir los resultados y el proceso a través de ayuntamientos y canales semanales, donde habitan muchos miembros de la comunidad. Si la propuesta se financia, también podría llevar a mucha gente nueva a asistir a estos ayuntamientos después de asistir a la encuesta. Me gusta mucho que el equipo vaya a presentar los resultados de la encuesta públicamente primero, y en otro momento después de procesar los datos recogidos mediante algún análisis estadístico (y presentar esos resultados al público). En mi experiencia como investigador, esa forma de procesar y analizar los datos y compartirlos con la comunidad es una forma muy agradable de trabajar, y de conseguir resultados interesantes mientras se mantiene el contacto con la comunidad. También el uso de la red (SPOs, influencers, votantes, CAs, townhalls, etc.) es una forma maravillosa de mantener a la comunidad al día sobre (o presentar) a la gente a Catalyst. El equipo muestra un profundo conocimiento de los posibles retos al tener perspectiva sobre el desarrollo pasado, presente y futuro del ecosistema. En definitiva, estoy totalmente de acuerdo en que esta propuesta me proporciona suficiente información para evaluar el progreso en la consecución de sus objetivos declarados.", "q2r": 5, "assessor": "z_assessor_349", "no_vca": 17, "ne": 13, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "La propuesta tiene como objetivo ampliar una propuesta de fondo 6 que analiza los datos en torno a los votantes, como la participación, el conocimiento y su comprensión. El equipo comparte que consiguieron que 300 personas proporcionaran comentarios en su primera ronda de este proyecto. No se ha confirmado si han impedido que varias personas envíen el mismo feedback si se ha incentivado, ya que hay una razón para que la gente lo haga. Es difícil decir si esta propuesta tendrá definitivamente un impacto, ya que incluso con otras personas que compartan la encuesta, si la incentivación es sólo de 10.000 dólares, habrá un límite en el número de respuestas que se pueden conseguir. Si se consiguen 1.000 respuestas, esto supondría un coste de 50 dólares por respuesta y 10 dólares para el votante. Para estar de acuerdo en que se trata de un uso impactante de los fondos del tesoro, se necesitaría un buen desglose de las preguntas exactas que se formulan y por qué, con un buen razonamiento que lo respalde, de modo que se confíe en que el conjunto de datos resultante sea de gran valor. La obtención de más datos sobre los votantes es sin duda un área de interés potencialmente impactante, por lo que estos esfuerzos merecen la pena. Sería útil contar con más recursos y justificaciones sobre las preguntas exactas de la encuesta y los datos que se recogerán para que un asesor tenga mayor confianza en el impacto potencial.", "q0r": 3, "q1": "El equipo aparece con la mayoría de los miembros incluyendo su perfil de LinkedIn. El equipo participa con frecuencia en la comunidad de Catalyst en diferentes herramientas y partes del proceso de gobernanza. El presupuesto se desglosa en algunas áreas clave. No hay duda de que esta propuesta es factible, ya que se trata de actualizar la encuesta, compartirla y medir los resultados. Los aspectos clave de la viabilidad que hay que cuestionar son la calidad de las preguntas y de los datos que se recogen, ya que, por lo que se ha facilitado, no está claro si la encuesta se ha desglosado en todas las áreas de interés potenciales y si luego se ha analizado su utilidad en la encuesta. El equipo afirma que buscará el asesoramiento y las recomendaciones de expertos con experiencia profesional en la elaboración de encuestas de alta calidad. Sería bueno tener más información sobre quiénes tienen en mente para esto, ya que esto puede determinar realmente la viabilidad de la propuesta para ser ejecutada bien. Sería bueno ver un presupuesto general más bajo para esta propuesta que, una vez completada, ayude a mostrar una estructura de encuesta efectiva y respuestas de datos de calidad. Una vez que esto sea fácil de confirmar en la comunidad, podría integrarse en el proceso de votación de manera más estrecha, donde habría menos fricción para obtener respuestas. Actualmente se desconoce la viabilidad de obtener respuestas a mayor escala para esta propuesta y supone un riesgo moderado, ya que el equipo querrá obtener suficientes respuestas de los votantes para justificar el coste.", "q1r": 3, "q2": "La propuesta está bien estructurada y tiene una gran claridad que se facilita con el ejemplo anterior que tienen del fondo 6 para dar contexto. Se proporcionan algunos indicadores de éxito, pero parecen ser más bien hitos de finalización. En cuanto a la auditabilidad, sería estupendo ver indicadores clave de rendimiento más específicos sobre áreas de los datos que están analizando y que muestran el valor de la encuesta. Esto daría mucha más confianza en que el equipo entiende y puede articular todos los diferentes componentes de datos relevantes de la encuesta y lo que están buscando para analizar. Los proponentes mencionan que los resultados y los datos serán públicos, lo que será bueno para que la comunidad audite si este enfoque debe continuar en el futuro.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal brings contributions for future improvements of the Cardano ecosystem. Depending on how well the survey is prepared (its design and questions' accuracy), good information will be brought by it. ", "q0r": 5, "q1": "The proposal is complex in terms of achieving its targets, however, the team has considered possible challenges and barriers to reaching a large number of participants in the survey.\r\nThe team has also provided to have enough knowledge about the Catalyst system and has conducted a smaller survey before. ", "q1r": 5, "q2": "The proposal is transparent and easy to audit. There's a concrete final product, although the milestones and roadmap when it comes to analyzing the results and being able to communicate them to the audience are a bit audacious. Normally it takes more than one month to process all data before being ready to provide insightful information to the external community. ", "q2r": 5, "assessor": "z_assessor_386", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about creating incentivized surveys to obtain info from a statistically significant number of voters and distribute this data to guide improvements. This is an interesting idea. The problem is clearly described, and explained in detail. The solution is clearly defined, fit to the challenge, and clear impact on the ecosystem in short term and long term. Therefore, based on the given information, I strongly agree that this proposal effectively addresses the challenge, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is described enough for understanding, with suitable skill, experiences for implementation, with reference/proof (documents/links,...) for verifying, besides, this team has proposal funded in the prior fund. The requested budget structure is clear but without explanations of the calculation base. Risk is not provided.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There are a lack of the following information: (1) Budget structure explanations of calculation base for each item; (2) KPIs/ Metrics. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}], "solution": "Crear encuestas incentivadas para obtener información de un número estadísticamente significativo de votantes y distribuir estos datos para orientar las mejoras.", "experience": "AIM ha creado y mantiene la herramienta para los votantes, la herramienta CA, la herramienta vCA y la página de aterrizaje de la Comunidad. Desarrolladores, diseñadores, líderes y expertos en datos."}