{"id": 383207, "author": "chrisr", "title": "WILD NFT", "url": "https://cardano.ideascale.com/a/dtd/383207-48088", "category": 26248, "amount": 58000, "description": "Las NFT que apoyan el entorno natural están poco desarrolladas. Existe una gran oportunidad para las NFT que ayudan a proteger los entornos naturales y los animales.", "funded": 0, "upvotes": 16355369, "downvotes": 19596400, "votes_result": 3241031, "votes_cast": 85, "f6_no_assessments": 4, "f6_rating": 3.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "El planteamiento del problema se presenta de forma razonable y clara, y en consonancia con el resumen del reto, ya que no hay ningún reto que se centre en gran medida en las NFT de este fondo. En la actualidad, existen numerosos mercados de NFT, pero no muchos han hecho hincapié en casos de uso fuera del aspecto artístico. Incluso menos han decidido centrarse en el apoyo y el bienestar de los animales y el medio ambiente, haciendo (en mi opinión) la dirección de la propuesta atractiva y una contribución única al ecosistema de Cardano.  Desde mi punto de vista, la propuesta tiene el potencial y la intención de trabajar tanto a nivel local como global, invitando a organizaciones, miembros de la comunidad e inversores minoristas a participar en el proyecto. Como se indica en la propuesta, el proyecto tiene el potencial de ser variado en muchos niveles diferentes, desde organizaciones hasta individuos de todo el mundo. Especialmente cuando se centra en un tema que es muy relevante y tiene un amplio espectro, la sostenibilidad. La propuesta también inspira un amplio conjunto de casos de uso dentro del mismo tema, dentro de la misma plataforma se podría elegir apoyar a una especie en peligro de extinción (tal vez a través de la asociación con una organización) o apoyar al refugio de animales local en su ciudad natal. La escala de la propuesta es enorme, lo que puede explicar la importante cantidad de fondos. Estoy totalmente de acuerdo en que esta propuesta aborda eficazmente el reto.", "q0r": 5, "q1": "Los 7 miembros del equipo central cubren un área impresionante de conocimientos complementarios y experiencia en el campo relacionado con la propuesta. Tanto desde la perspectiva de ser miembros activos y colaboradores del ecosistema de Cardano, como de tener décadas de experiencia trabajando en el campo del desarrollo medioambiental y los derechos de los animales. Se proporciona suficiente información sobre cada miembro del equipo a través de sus respectivos perfiles de LinkedIn. El hecho de haber pasado por el proceso de creación de una plataforma en funcionamiento (DignifID) aumenta la fiabilidad y la credibilidad del equipo.\r\nComo ya se ha dicho, el presupuesto es bastante considerable, ya que supone algo más del 20% del presupuesto total del reto, pero tiene sentido si se tiene en cuenta que el proponente quiere lanzar un portal web multilingüe (fantástica adición) para la acuñación de monedas y un portal web multilingüe para el mercado en el plazo de 3 meses (más adelante se hablará de ello). Las asignaciones del presupuesto se presentan de forma clara, y el hecho de que su plataforma creada previamente (DignifID) esté ayudando a cubrir los costes del lanzamiento me hace pensar que el equipo ha previsto cambios repentinos en la asignación del presupuesto.\r\n\r\nEl plan del proyecto de un año está presentado de forma clara y estructurada, pero me habría gustado ver información más detallada sobre las diferentes etapas del plan. Añadir información sobre el estado actual del proceso de creación de la plataforma y la herramienta facilitaría la evaluación de la viabilidad de la propuesta. Por la información proporcionada en la propuesta, asumo que el desarrollo está en marcha, pero estaría bien ver alguna aclaración más incluida en la propuesta. Un añadido que beneficiaría mucho a la propuesta es un desglose presupuestario más detallado de las asignaciones presupuestarias. Por ejemplo: ¿Cuántas personas trabajarán en el servicio externo de marketing y comunicación, y cuántas horas de trabajo a la semana? ¿Cuántos miembros activos del equipo trabajarán en el proyecto y durante cuánto tiempo? La asignación presupuestaria está bastante clara, pero una estimación del alcance de las horas de trabajo debería aclararlo aún más, en mi opinión como Community Advisor.\r\n\r\nAdemás, ¿cómo es la divulgación? La propuesta deja entrever la existencia de contratos en curso con actores asociados a través de su anterior plataforma (DignifID), pero no está claro si pretenden utilizar sus conexiones de antes o necesitan una base de conexiones completamente nueva. La información proporcionada me lleva a pensar que el alcance principal será a través de las organizaciones al principio, y luego estar en contacto con la gente a través de ellas. (Lo cual es en sí mismo una idea bastante inteligente). En general, estoy de acuerdo en que esta propuesta se implantará con éxito.", "q1r": 4, "q2": "La propuesta incluye una hoja de ruta con hitos incluidos, presentada de forma clara y comprensible (con 3 meses, 6 meses, 12 meses como plazos). Para aumentar la audibilidad, el proponente podría haber añadido algunos KPI y métricas que ayudaran a las personas ajenas a la organización a entender mejor si los hitos se alcanzan o no. Por ejemplo, ¿cuántos usuarios espera acoger el proyecto al cabo de 6 meses? ¿Qué parte de los ingresos de NFT se destina a la protección de los animales y el medio ambiente, y cuál es el tráfico previsto tras 3, 6 y 12 meses de funcionamiento? ¿Se concentra en la difusión global de inmediato o hay un plan para ampliar o desarrollar desde unas pocas áreas/organizaciones locales?  Creo que responder a estas preguntas invitaría a la comunidad a auditar el proceso de crecimiento con mayor claridad.\r\nPara aumentar aún más la confianza y la credibilidad del equipo y de la propuesta, me habría gustado ver una lista de posibles riesgos y desafíos. Por lo que sé del espacio de las NFT, está lleno de organizaciones y artistas que acuñan NFT de temática animal. ¿Cómo piensa el proponente enfatizar su punto de venta único subyacente (sostenibilidad, medio ambiente y bienestar animal) tanto como sea posible, con el fin de separarse de los \"simios aburridos\" o los \"animales drogados\"? La idea y los valores de este proyecto tienen un gran potencial, y me habría gustado ver ejemplos de cómo este proyecto enfatizaría los fuertes valores que hay detrás del producto. En general, estoy de acuerdo en que esta propuesta me proporciona suficiente información para evaluar el progreso en la consecución de sus objetivos declarados.", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 18, "ne": 13, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "For an outsider is difficult to understand the meaning of the following statement \"delivering verifiable wellbeing & sustainability\" and this should be the output of a market place when NFTs are sold/bought (previously minted). The NFT ecosystem has evolved at a fast pace during this year on Cardano blockchain. Why would WILD NFT make a (big) difference comparing with the other mature platforms? Also another question that could arise is: there is a demand for this kind of NFT? \r\nAiming to be globally recognized the project faces an outstanding challenge, and the information provided make it somehow unstable on its path to success.\r\n\r\nThis proposal doesn't fit in the challenge objectives as it looks to fit well in F7 DApps & Integrations Campaign", "q0r": 2, "q1": "The proposer presented the team members and their roles in the team and each one seems to have a vast experience in at least one of the following fields: business, marketing, science and not the least there is already a NFT minting platform.\r\n\r\nChecking the website (nft-maker.io) there is statement about the quantity of minted NFTs and the revenue they produced but with just a few trails in support of this, thus making difficult to evaluate the declared success.\r\n\r\nThe budget is outlined and broken down into identifiable items but some of them are difficult to be evaluated (\"Minting Platform and Market Exchange design with multi-language interface - is not clear what are the components of this stage and if the design stage starts from scratch, and also if the the multi-language feature will be automated (translate service) or the translations are made by humans).\r\n\r\nThe proposal provides a conductible plan for implementation that shows only what is being done but lacks to describe how is done. (see above)\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation (risk awareness is an important aspect of any business)", "q1r": 3, "q2": "KPIs/metrics are not defined to define the path of success. There are some statements (\"Users will visit the web portal\" - why? how many? how many will come back/stay after first visit? etc.) that looks more like a desire than something that can be measured.\r\n\r\nReading the proposal the impression is that there is too much hype and overconfidence and less realistic and viable facts to sustain the implementation of the project.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 21, "ne": 4, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This proposal could possibly fit under: Daaps and Integrations, as it would be something that bring value to end users and attract new people to cardano.", "q0r": 3, "q1": "They have a highly experienced team with well rounded experience. They also state they have an NFT tech partner. They also have experience in digital IDs for animals which translates directly into what they're seeking to do.", "q1r": 5, "q2": "They did provide a proper breakdown of their KPIs and their roadmap, but this proposal would benefit from more details on how the funds will be spent we can audit efficiently.", "q2r": 4, "assessor": "z_assessor_612", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposal is an interesting use of NFT's to help conservation and animal shelter care. However, the proposal doesn't really explain how it will help conservation. They seem to focus mostly on animal shelter and their well being and less on endangered species.  ", "q0r": 4, "q1": "The team has valuable expertise in NFT and marketing. However, the budget allocated to communication seems very low to educate potential NGO's, animal shelter or conservation organization to adopt the project and create new NFT's. the proposal needs to explain more about who are those  credible auditors to verify and attest wild NFT. The road map presented here lack of clear KPI's. ", "q1r": 4, "q2": "The proposal is interesting with a strong team however more information is needed to audit adequately the proposal.", "q2r": 3, "assessor": "z_assessor_761", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "WILD NFT es una plataforma de minería/mercado de NFT de clase mundial que ofrece bienestar y sostenibilidad verificables para los entornos naturales y los animales.", "experience": "Hemos fundado dignifid.org, una organización sin ánimo de lucro que proporciona identificación digital para apoyar el bienestar de los animales y el medio ambiente. NFT Maker Pro es nuestro socio tecnológico."}