{"id": 383284, "author": "glaxas", "title": "Catalyst Circle Treasury Management", "url": "https://cardano.ideascale.com/a/dtd/383284-48088", "category": 26248, "amount": 11400, "description": "El Círculo Catalizador necesita pagar los gastos de funcionamiento y a los miembros del Círculo por las tareas realizadas. Las transacciones deben ser documentadas y gestionadas.", "funded": 2, "upvotes": 70138850, "downvotes": 3679374, "votes_result": 66459476, "votes_cast": 142, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Debido a que el Fondo7 no tiene un reto específico para Catalyst, estoy de acuerdo en que esta propuesta aborda el reto. A mi entender, la propuesta no trata de ampliar nuestra comunidad, sino de aumentar la longevidad y la eficiencia del Proyecto Catalizador. Con un enfoque específico en el manejo de la parte económica del Círculo Catalizador. La propuesta aborda un aspecto/problema muy importante, y proporciona una solución potencial a largo plazo mediante la creación de un sistema que hará que el manejo de la \"Tesorería\" de los Círculos Cardano sea más fácil de manejar y transparente. Tanto para las generaciones actuales del Catalyst Circle, como para las futuras. La solución que sugiere la propuesta es a largo plazo, y habla de entender la \"maquinaria\" de Catalyst como un todo y con la esperanza de optimizar la eficiencia para todos los involucrados.", "q0r": 4, "q1": "La propuesta presenta al equipo principal que parece tener experiencia dentro de la Comunidad Cardano, aunque el equipo actual no tiene propuestas financiadas a sus espaldas. Sí parecen estar activos en la finalización de una propuesta financiada por Fund6, pero aquí sería útil con algunos enlaces o más \"pruebas\" de que el equipo real estará involucrado. Actualmente, se proporcionan perfiles de LinkedIn, pero uno de ellos no funciona y el resto no habla de la experiencia en contabilidad y operaciones comerciales. Si la propuesta los incluyera, el equipo se presentaría de forma mucho más creíble y clara. No soy en absoluto contable, pero por mi experiencia en la gestión de organizaciones y comunidades, conozco la importancia de contar con expertos que trabajen en el aspecto económico. Las sugerencias de la propuesta sobre cómo gestionar la tesorería de Cardano Circle se presentan de forma muy clara, paso a paso. Dado que la propuesta se centra en un plazo más corto (3 meses), la asignación presupuestaria parece razonable, ya que sólo se pide aproximadamente el 5% del presupuesto total del desafío. La asignación presupuestaria también incluye una estimación de las horas de trabajo y la distribución de los recursos, lo que aumenta la credibilidad de la propuesta. Estoy de acuerdo en que es muy probable que esta propuesta se lleve a cabo con éxito.", "q1r": 4, "q2": "La hoja de ruta es muy clara y abarca un periodo de 3 meses, básicamente hasta el próximo fondo(8). Para hacerlo aún más claro, me hubiera gustado ver los plazos estimados de todos los hitos, ya que el único plazo proporcionado es el primero (12 dic-2021). El equipo promete que el sistema creado será de código abierto, lo cual es una forma maravillosa de aumentar la transparencia del proyecto. ¿Cómo podrá la comunidad seguir el desarrollo, además de a través de GitHub? Es algo complejo encontrar mediciones más \"abiertas\" del éxito, ya que se crea para una parte muy pequeña y especializada de la comunidad, pero ¿qué tal si se comparte el progreso de las pruebas del sistema o las actualizaciones del desarrollo a través de los canales de las redes sociales o TownHall, etc.? También vale la pena mencionar que el equipo para esta propuesta podría cambiar con el próximo fondo, si he entendido bien la propuesta. Esto significa que la transparencia es de suma importancia si el equipo de desarrollo está destinado a cambiar a lo largo de las diferentes etapas. Puede que haya interpretado mal la propuesta, pero quizá la propuesta podría presentar los planes a largo plazo de forma más clara. Quizás incluir una visión-plan menos detallada para los próximos fondos (8-9) para invitar a la comunidad a participar en el plan a largo plazo. Por último, me habría gustado ver una breve sección en la que el equipo describiera algunos de los retos o riesgos que podrían aparecer durante la fase de desarrollo, y cómo piensan afrontarlos. La perspectiva siempre será importante en cualquier situación, y esto me llevaría, como miembro de la comunidad, a tener aún más fe en la propuesta. No estoy ni de acuerdo ni en desacuerdo con que esta propuesta me proporcione suficiente información para evaluar el progreso en la consecución de sus objetivos declarados.", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This is a proposal related to supporting accounting, spending, compensation, salary... tools on the cardano platform. An essential support tool for any company or workgroup that wants financial transparency, financial organization in a more methodical, professional and automatic way.", "q0r": 4, "q1": "The proposal is practical and highly feasible, but it is necessary to specify more clearly how to deploy it to the market to serve the majority of the community, as well as the relevant experience of the working team.", "q1r": 4, "q2": "In the proposal, it was mentioned that the code is completely public on github, so the community can check the project progress as well as the implementation progress of this project.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The \"Catalyst Circle Treasury Management\" proposal addresses the objective of challenge which is to pay operating costs and circles for their performed duties. The Catalyst circle is important for the Cardano Ecosystem and that the team has contributed time and effort to make this possible. ", "q0r": 5, "q1": "The team is comprised of strong 3 team members from Catalyst Challenges. The budget is reasonable and broken down in detail. They also updated what the community can expect after Fund 7 and the handover for fund 8 treasurers. The proposal is reasonable and pave the way for future development.", "q1r": 5, "q2": "The roadmap with milestones/KPI are available so the community can keep track of their progress. The system that they plan to build along with the documentation in GitHub will be open source and  available for public usage.  ", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about building a system that makes CC operations frictionless and auditable when it comes to resource allocation. This is a great and meaningful idea. As we know, the Catalyst Circle plays an important role the Cardano's Governance as a whole. The problem convinces me, and is clearly described, and explained in detail. The solution is clearly defined showing a potential impact on the Cardano ecosystem in long term. Therefore, I strongly agree that this proposal effectively addresses the challenge, and can rate it with a score of 5", "q0r": 5, "q1": "Proof of feasibility from the team profile can be seen, with the external links for verification. The budget is provided with a clear items structure, and explanations of the calculation base. Risk is not defined. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of information with proof for verification. It would be better if risk/challenge (with mitigation) is added.\r\nBased on the given information, I agree with this proposal's auditability, I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal addresses the issue of  managing the Treasury fund's financial operations and obligations in a simple and clear manner. . They state that by developing and implementing a treasury management system they can help ensure that money provided by Catalyst is spent in a manner that is auditable and transparent. This seems to be something that will definitely support the Cardano/Catalyst ecosystem. This is very important, and therefore I rate this proposal 5 for impact.", "q0r": 5, "q1": "The team members are experienced in business and accounting and links are provided for their LinkedIn accounts. The budget is broken down and understandable. They have requested $400 to build the accounting system from scratch. I don't know if this will be enough, but they do mention that they might need additional funds in future. They have set out a plan with actionable tasks and a timeline and it seems realistic to me. The are already busy testing the solution and mentions that it is going well.", "q1r": 5, "q2": "The Proposer mentions that the \"system that is being built will be open source and available for the community to use elsewhere.  The onboarding documentation for future treasurers will be public as well as part of the CC github Playbook\". This ensures that the progress of the project can be followed and makes the project auditable. The KPI's given makes sense and will also provide the community a way to track how the project is going. Maybe provide a space where the community can already now start tracking progress.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Construya un sistema que haga que las operaciones de CC sean fluidas y auditables a la hora de asignar recursos.", "experience": "Nuestro equipo está formado por asesores comunitarios y miembros del Equipo de Desafío con experiencia en contabilidad y operaciones comerciales."}