{"id": 381939, "author": "tomwedler", "title": "Carbon as DeFi Asset | BlockCarbon", "url": "https://cardano.ideascale.com/a/dtd/381939-48088", "category": 26233, "amount": 30000, "description": "Las iniciativas de compensación de carbono proliferan, pero carecen de una norma coherente, confunden a los consumidores y frenan su comercialización como activo invertible.", "funded": 2, "upvotes": 149786701, "downvotes": 13951975, "votes_result": 135834726, "votes_cast": 829, "f6_no_assessments": 6, "f6_rating": 4.5555555555555545, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=22904"], "media": [], "f6_assessments": [{"q0": "¡Hola votantes de Ada ! ¡Ante la pregunta de si este reto es el adecuado para esta propuesta debo darle un 5 de 5 a esta propuesta! El reto está impulsando Defi on Cardono y esta propuesta impulsará Defi on Cardona por las siguientes razones. La primera razón es que los créditos de carbono que van onchain y la tokenización del mercado de carbono son cada vez más demandados. Esto se debe a la falta de transparencia en los mercados de carbono tradicionales y a que muchos inversores especulan con que los créditos de carbono que se emiten para las empresas de energías renovables y que compran las empresas que omiten el carbono serán cada vez más escasos y valiosos con el tiempo. Especialmente con los mandatos de los gobiernos y la popularización del aumento del precio de los créditos de carbono para encarecer su compra por parte de las empresas que omiten el carbono. Las avalanchas de capital llegarán a las primeras propuestas que consigan poner en cadena los créditos de carbono y el mercado del carbono. Incluso lo vemos como Mark Cubin afirma en este artículo https://www.yahoo.com/now/mark-cuban-buys-50-000-165355744.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAHUAOD2t7vn1ELZPZrhEdD2N2xuKp5LEybeqNLo7tmaZxGqdH6RmxCBRDoNVwnOm9w9uIC89fYk9B4nZ7gnmpVOVzkPDxsZ5wm7Qm96J1iq4P9SeSliB1xIoNlu2q-wcL3VJYDTT_cuXvEMYj-FZnkD3U9FMqfE7kh2xISeW7j7N que pondrá 50k cada 10 días en una dapp de polígono que toma \"Verra vcu's 2008 vintage y superiores\" (créditos de carbono certificados) y permite comprarlos a través del protocolo toucano. Hemos visto como Cardano se pinta como un blockchain muy verde así que cuanto antes se empiecen a implementar los mercados de carbono onchain antes veremos un impulso en defi en Cardano.", "q0r": 5, "q1": "Cuando se pregunta si el plan puede ejecutarse, hay que ver si el plan es factible. Cuando se nos pregunta eso, tenemos que ver 1. quién está detrás del plan y 2. cuál es el plan. También debemos preguntarnos 3. cuáles son los riesgos que están fuera del control de los equipos. Me alegra ver que el equipo cuenta con una gran experiencia y animo a los votantes de Ada a que se fijen en la experiencia del equipo, por lo que copiaré y pegaré la biografía de cada uno de los miembros del equipo al final de la parte de viabilidad de esta reseña. Para mí, la experiencia del equipo habla por sí misma en esta propuesta, con experiencia en Plutos, medio ambiente, finanzas, gestión de riesgos y marketing, así como en criptografía. No hay muchos agujeros en el equipo que pueda ver para lo que esta propuesta ha indicado que necesitará para ejecutar con los 30k que están solicitando. Además de la competencia demostrada de dichos miembros del equipo, el plan en sí mismo empieza siendo pequeño pero ofrece plazos y métricas ambiciosas. Creo que estas métricas son ambiciosas porque Cardano defi hasta la fecha no tiene muchos datos ya que defi en Cardano aún no se ha visto a escala sin mencionar defi incluyendo los mercados de carbono. Creo que el plan está bien definido y se han dado muchos elementos accionables que demuestran cómo se implementará esta propuesta y se escalará con el tiempo. Así que creo que la propuesta cumple con los estándares de viabilidad si contamos con el viento de cola de defi en Cardano y los mercados de créditos de carbono onchain creciendo en popularidad, así como la experiencia de los equipos. Mi única preocupación era sobre los riesgos en relación con el mercado de criptomonedas y la regulación, sin embargo, me gustaría dar crédito al equipo para la identificación de dichos riesgos en su propuesta, ya que no va en la vena de saber que el equipo ha tenido en cuenta estos riesgos fuera de su control y han indicado formas de mitigar estos riesgos a través de sus conexiones y futuras asociaciones en el mercado de carbono y espacios de cripto. Aquí están las biografías de los equipos según lo prometido.....\r\n\r\nThomas Wedler\r\nExperimentado comerciante de derivados de energía y empresario. Ex operador senior de Shell, Vattenfall y Masefield. Tom ha estado construyendo y desplegando programas para la creación de mercados automatizados y derivados de energía desde 2014. 15 años de experiencia en Derivados en organizaciones multinacionales trabajando estrechamente con organismos de la industria y ponente en conferencias y talleres del mercado energético. Involucrado en el trading de criptomonedas desde 2014 y en DeFi/oracles desde 2018.\r\nhttps://www.linkedin.com/in/thomas-wedler-18960/\r\nJune Akra\r\nExperta en mercados financieros y académica con amplia experiencia en gestión de riesgos, derivados y materias primas. Experiencia para diversas funciones de riesgo en fondo de 2 mil millones de dólares de AUM. Titular de un Máster en Inversión con distinción y galardonado con el Premio Draper. Ex alumno de Finanzas Cuantitativas Certificadas (CQF) Londres. Editor de vídeo experimentado, creador de contenidos con un total de 50.000 seguidores en las redes sociales, coleccionista y creador de NFT y practicante certificado de IA en python.\r\nhttps://www.linkedin.com/in/june-a-a3a0b4174\r\nStefan Herde\r\nExperimentado director general del mercado energético, consultor, experto en energías renovables y eficiencia energética y ex presidente de una empresa estadounidense de mil millones de dólares. En total, más de 30 años de experiencia en el sector energético.\r\nhttps://www.linkedin.com/in/stefan-herde-33058539/\r\nLloyd Duhon\r\nLloyd es propietario/operador de la granja urbana Living Greens y un veterano de las tecnologías de la información con 25 años de experiencia a nivel de CTO. Pionero de Cardano Plutus 2ª Cohorte. Con experiencia en liderar equipos de desarrollo y trabajar estrechamente con la Florida Gulf Coast University. Tom, June y Stefan conocieron a Lloyd a través de las etapas de ideación y refinamiento de ProjectCatalyst y planean colaborar con su proyecto de agricultura urbana compartiendo recursos de desarrollo.\r\nhttps://www.linkedin.com/in/lloyd-duhon/", "q1r": 5, "q2": "A la pregunta de si la propuesta puede ser auditada y si el equipo puede rendir cuentas, vamos a ver si nos han dado métricas clave y plazos de ejecución. A este respecto, parece que cada paso de su plan tiene un calendario y unos parámetros clave que se van ampliando a medida que pasan los meses. Por ejemplo, una de las métricas es el número de proyectos reales integrados en la propuesta: \"Número de proyectos reales (múltiplos de toneladas de carbono) incorporados: uno después de 2 meses, tres después de 3 meses, seis después de 4 meses, 15 después de 6 meses\". Añadiré información para el equipo de la siguiente manera. Una cosa que me gustaría ver es cómo vais a lograr algunas de estas métricas y por qué son importantes para que se manifiesten los votantes de ada... por ejemplo, cuando se trata de la presencia en los medios sociales, indicáis \"Seguidores del proyecto BlockCarbon en los medios sociales: 1000 después de 2 meses, 2000 después de 3 meses, 5000 después de 6 meses\" y desde el punto de vista de la auditoría esto es genial, pero creo que los seguidores en las redes sociales no es una de las mejores métricas a las que aspirar, ya que estos números pueden ser manipulados a través de bots o comprados, así que creo que la importancia y la calidad de los seguidores a los que se aspira sería una mejor métrica a la que aspirar en lugar de la mera cantidad. Espero que esta retroalimentación pueda proporcionar algún valor para el equipo, ya que realmente me gustaría que esta propuesta tuviera éxito como he dicho. Puedo ver el impacto que puede tener una propuesta de mercado de carbono para Defi en Cardano. Todo lo mejor para los votantes de ada y gracias por considerar esta propuesta y su revisión.", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 16, "ne": 12, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \nThank you from the BlockCarbon Team"}, {"q0": "Proposal identifies the problem of onboarding existing financial operations into Defi on Cardano. The project will ad value to the  Cardano ecosystem by driving new users from existing financial markets to Cardano. Key metrics are inline with the challenge setting's as it focuses on growth and collaboration. The proposal is able to scale quite well as it will be open source.", "q0r": 5, "q1": "Relevant skills and team has been provided. I can't find any proof of Lloyd's Plutus skills. I couldn't find his profile on github. This might steer away some voters. It is important to prove the team's skills in order to gain trust from the community. The budget is reasonable and broken down into identifiable items. Some of the work they will do voluntarily. The time to complete the project seems reasonable, they will need additional funding after the 6 month period to build a marketplace. They explain in great detail how they will approach, educate and integrate with the existing Carbon financial markets. One part I would like to see more detail on is the educational content that they will create. Will it include token creation education etc. More detail on the content of that package would help the voter understand what the packaged product looks like. The  technical aspects of the  content created has not been explained as mentioned. They went into great detail describing potential risks and how they will mitigate them.", "q1r": 3, "q2": "They provided a clear roadmap with milestones and lots of KPIs that are measurable. Tracking the performance and progress of this project will be easy as there are a lot of user based KPIs. They address the problem of current Carbon offset initiatives that create more confusion than actual value to the user and to the  earth. They solve this by brining these initiatives to Defi in an open source way so the community can get creative and build new alternative ways to create more value for these initiatives.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 22, "ne": 2, "ng": 16, "nfo": 4, "vca_o": 1, "reply": "Dear Assessor, you wrote in your assessment of our proposal Carbon as a DeFi | BlockCarbon that you \"can't find any proof of Lloyd's Plutus skills\". This resulted in a relatively low score of 3 stars. We found this a bit harsh and wanted to reach out to you. As we cannot possibly document all skills and work experience of every team member, we hoped that assessors would either take our word for it, or research themselves. For your reference, Plutus pioneers 2nd Cohort will have their class photo in January, as it was delayed on the IOHK side. Lloyd did write an article to help others in the program here:  https://www.publish0x.com/plutus-pioneer-trail/trailblazing-plutus-on-cardano-xvyweyp\nLooking forward to your feedback. Thank you from the BlockCarbon Team\n"}, {"q0": "The proposal is very ambitious and could, if successful, have a huge positive impact on Cardano. Creation of a good on-chain carbon marketplace with defi capabilities would bring the world's attention to Cardano and establish it as a leader in sustainability and green blockchains. The proposal clearly falls within the DeFi spectrum, but falls just short of HOW exactly DeFi would be used to generate yield for carbon hodlers/generators. The proposal clearly builds up to it, though, and DeFi seems like a natural fit with the project, even if the exact mechanism is yet to be determined.", "q0r": 4, "q1": "The project is very ambitious, and it seems unlikely that the team as is could reach the goals mentioned. However, they have a clear and targeted vision, and mention using volunteers as a resource for their project. The plan is laid out clearly both for the duration of the project but also for the future steps. The team has good credentials on the carbon-credits side, but lacks on the technical blockchain side. This concern is addressed in the risks and challenges, however, and isn't cause for concern for now.", "q1r": 4, "q2": "Basically everything in the project is auditable and measurable, so success can be monitored easily. The milestones for this proposal are laid out clearly and can be verified, and the success metrics are measurable and verifiable.  The proposal identifies main risks and challenges, indicating that they know what they would need to work on next to keep their project afloat.", "q2r": 5, "assessor": "z_assessor_318", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your feedback. We agree with your remarks on Impact and Feasibility. DeFi on Cardano is quite new and instead of promising high yielding features or building a huge team before the first initial successful pilots, we had to paint the roadmap in relatively broad strokes. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. Thank you from the BlockCarbon Team"}, {"q0": "Your solution; Open Source library to enable pricing and exchange of Carbon as tokens and derivatives utilizing Plutus. Is exactly what this Challenge is all about. I Strongly Agree", "q0r": 5, "q1": "Your teams experience in Energy Derivatives, Financial Markets, Renewable Energy and Plutus Pioneer program makes for an excellent and Very Strong experience level. \r\nYour Budget breakdown and timeline is good and your willingness to donate time at zero cost all indicate the path to a successful project.  I Strongly Agree", "q1r": 5, "q2": "Your project's Roadmap, KPI's and Performance Metrics are sufficient to audit your progress and success.", "q2r": 5, "assessor": "z_assessor_320", "no_vca": 26, "ne": 1, "ng": 13, "nfo": 12, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. Thank you from the BlockCarbon"}, {"q0": "The beauty of this proposal is the new knowlege gained just by reading it. It addresses the challenge from a unique perspective. Emmisions can be lowered with the use of blockchain and this proposal lays out a solid foundation for it to happen. ", "q0r": 5, "q1": "The team behind this proposal is very solid. They aren't anonymous and they have the credentials to see the project through. It's difficult to fault them and that is a good thing. Incentivising green practices is always a win and this win will require a lot of work. ", "q1r": 4, "q2": "Yes. With a detailed list of Performance indicators, it's easy to follow this project's trajectory. The details provided show that a lot of thought and consultation has gone into the planning of this proposal.", "q2r": 4, "assessor": "z_assessor_700", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \nThank you from the BlockCarbon Team"}, {"q0": "The proposal does an outstanding job of identifying inefficiencies and problems under the current carbon market constructs, and explaining why defi solutions will help. ", "q0r": 5, "q1": "The team's experience seems relevant. Although it's not clear what specific regulatory market jurisdictions they have expertise in; nor is it clear how far networking skills may lead to market participants committing. ", "q1r": 4, "q2": "The deliverables are clear, and associated project timelines are clear. ", "q2r": 4, "assessor": "z_assessor_716", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \n\nYou mentioned that it wasn't clear from the proposal what specific regulatory market jurisdictions we have expertise in. We have worked under Kyoto Protocol Clean Development Mechanism, which was a United Nations framework that linked global projects with Emissions Trading Schemes (we worked with parties in Malaysia, Thailand, Pakistan, Canada and the European Union). Today, most Voluntary Offset Schemes including those certified by Verified Carbon Standard (ex-Verra) are global and often criticised for their flaws and \"greenwashing\". Instead of national legislation, there is a strong case for auditability outside national or corporate interests to be made, something that has begun promisingly by some universities. We can make this a success with support from people like you.\nThank you from the BlockCarbon Team"}], "solution": "BlockCarbon - Fundación y biblioteca de código abierto para permitir la fijación de precios y el intercambio de carbono como tokens y derivados utilizando Plutus.", "experience": "Expertos en el mercado de la energía y en DeFi se asocian con Plutus Pioneer y con el director general de Energía. Con experiencia en contratos de carbono y derivados de Kioto/París."}