{"id": 384132, "author": "nftdao", "title": "Cardano Subnet/VM Avalanche Bridge", "url": "https://cardano.ideascale.com/a/dtd/384132-48088", "category": 26233, "amount": 9600, "description": "La ausencia de Cardano Subnet/VM en Avalanche impide que los equipos lancen instancias de Cardano para las dApps de DeFi, como los EVM de la competencia, lo que impide la interoperabilidad.", "funded": 2, "upvotes": 74318105, "downvotes": 11999403, "votes_result": 62318702, "votes_cast": 539, "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "It is mentioned that the team needs to postpone the beginning of this to Q2/2022 but it doesn't mean they need to wait until Fund8 to get the funding. Should they be funded now, they can start developing earliest in March 2022. Also, the comments section referred to a possible Cross Chain Collaboration challenge in Fund8. Should that be available, the team can then take the Avalanche-Cardano interoperability even further.\r\n\r\nSince Avalanche is purpose-built for DeFi it only makes sense to build interoperability with them as early as possible. That will have a hugely positive impact in the entire Cardano DeFi space as well.\r\n\r\nTherefore, this proposal meets the challenge brief beautifully!", "q0r": 5, "q1": "Building this in close collaboration with AvaLabs is a wise move. Three developer resources is sufficient to get the job done in time. The plan is good. Only caveat is what implications the changes on Avalanche side might have. Still, I'm confident this will be implemented successfully.", "q1r": 5, "q2": "Not sure what the current status is because the team has only mentioned that they will do Research, Communication and Documentation at this stage (no actual development).", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 25, "ne": 3, "ng": 18, "nfo": 4, "vca_o": 1, "reply": "Correct, we will keep abreast of all the changes, so we can implement more quickly in Fund 8"}, {"q0": "Cross chain collaboration projects have been acknowledges as important to provide Value mobility that with help both ecosystem. Therefore the proposal to being Cardano with Avalange is addressing a core challenge. ", "q0r": 5, "q1": "Ava labs have a very strong and big team. There CTO is a proposer. Therefore I strongly believe that this team from Ava labs should be able to complete the project in time. ", "q1r": 5, "q2": "The proposal is for $9,600 at the rate of USD 50 per hour for 12 weeks of R & D while the avalanche API is being refactored. This is a critical step and to prepare for the integration in features. I feel this is justified and an item of reasonable expenditure. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This proposal would enable a flurry on potential defi apps that could bridge into AVAX and unlock liquidity from avalanche and into Cardano. This proposal does indeed boost Cardano's defi by giving access to that liquidity and is worth 4 stars!", "q0r": 4, "q1": "The team has experience building successful products on Avalanche and have co-submitted with an atala prism pioneer. I believe they will be successful with their API refactor re-design that avalanche is implementing as the team is very well researched and has demonstrated alot of competence when building for avalanche.", "q1r": 4, "q2": "The roadmap includes a few milestones that mostly revolve around research, I would prefer if they could break down the items into a little more specific bullet points so we can be more clear about exactly what KPIs the roadmap contains, other than that  I think the roadmap is decent.", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Diseñar y construir una subred/vm de Cardano en Avalanche que permita establecer puentes DeFi entre la red de Cardano y la subred de Cardano en Avalanche.", "experience": "Arquitecto Jefe - Gabriel Cardona, Desarrollador Senior, AvaLabs\nEquipo de desarrollo - CTO, 3 desarrolladores, 1 gestor de proyectos"}