{"id": 384359, "author": "adilabd", "title": "Incrypture - Pooling DeFi", "url": "https://cardano.ideascale.com/a/dtd/384359-48088", "category": 26233, "amount": 50000, "description": "La explosión cambriana de protocolos DeFi no tiene una forma sencilla de agrupar los distintos préstamos en cadena para diversificar el riesgo del protocolo.", "funded": 1, "upvotes": 54524920, "downvotes": 14572557, "votes_result": 39952363, "votes_cast": 306, "f6_no_assessments": 7, "f6_rating": 3.9047619047619047, "videos": [], "media": [], "f6_assessments": [{"q0": "The product outlined in this proposal seems like a great addition to Cardano De-fi . While I am not deeply familiar with the practices of pooling assets, I recognize that it is common in the global financial system and it makes sense to start adding this functionality to Cardano's Defi Ecosystem.\r\n", "q0r": 5, "q1": "Based on their proposal and simplified explanation of how these systems work in the real world it seems as though the team has a solid understanding of what they are trying to achieve. That said, Links to professional sites like linkedin or resumes, even a website with a \"Team\" page would be helpful. Putting faces to names can make all the difference in a project. \r\n\r\nIt would be helpful to see a bit more of a technical breakdown for how the team intends to implement this proposal. A working Plutus/ Marlowe SC would be great, but the nuts and bolts of how that smart contract works is what the catalyst funding is for. Some kind of brief overview of how the code would work would make a big difference for voters. ", "q1r": 4, "q2": "See Above. As written, this proposal seems to be lacking in the technical aspects of what is required to achieve success. While it is important to keep these proposals brief and understandable, The metrics given currently seem too vague given the scope of the proposal. Some more refinement and presentation of the \"concrete use cases\" would be helpful.", "q2r": 3, "assessor": "z_assessor_252", "no_vca": 20, "ne": 2, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "(See the other three proposals from the same team.)\r\n\r\nSince bad mortgage-backed securities were a driving force leading to the 2008 financial crisis. Therefore, anything dealing with MBS should be approached with caution. \r\n\r\nIncrypture team, however, is very \"crypto\" in their thinking, replacing greedy intermediaries with smart contracts and allocating the benefits to the users.\r\n\r\nIf successful, this provides a definite value-adding use case to be built on top of Cardano. ", "q0r": 4, "q1": "(You need to read through the enclosed Google Doc \"whitepaper\" to understand the full proposal.)\r\n\r\nThe team doesn't only boast an impressive track record from the world of legacy finance. They've clearly done their homework in the cryptoeconomy, referencing the likes of AAVE, Curve and Barnbridge. What's more, they're running a fresh stakepool, too (https://incrypture-ada.com/).\r\n\r\nThe plan has a good basis but it falls short in detailing a roadmap. \"Identify promissing Lending Protocols\" is now planned to be carried out AFTER funding is received (Month 1). It would be easier to get the funding if that was done already. Month 2 on the roadmap mentions \"Apply for grants from lending protocols\". What if you would first identify the ideal lending protocols* and applied to funding from them first - and then only applied for Catalyst funding with a more detailed plan?\r\n\r\nReserving only one month for \"Code Development for MVP\" is probably not enough. In software development, there's always delays. In conclusion, ideally, more preparation would be done beforehand so that more time could be used for actual coding.\r\n\r\n*Do consider Centrifuge  (https://centrifuge.io/) as a potential cross-chain partner.", "q1r": 4, "q2": "The success metrics need some more work. Now it only states \"Specifications for a concrete use case with prospective TVL or other concrete metric of success.\" The budget is simple: 625 hours of development x 80/hr. This could have been broken down in more detail (but perhaps it's not possible at this stage).", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 20, "ne": 3, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralisation can be for economic empowerment. However, it is important that DeFi projects have good accessability and also enable to bank the unbanked instead of just beeing an elitist project. I have done some personal research on both DeFi and microlending especially with a focus on Global and social justice and hope to bring in a valuable perspective on accessability for poorer people with my reviews in this challenge. The proposal identifies a problem within the challenge, however they come up with a solution that defeats the purpose of DeFi by bringing in larger investors and thus counteracting the decentralisation idea of Cardano. Apart from this, the product presented relates to DeFi platforms on the Ethereum blockchain, so it is hard for me to grasp how this should be beneficial to the Cardano ecosystem. Hence, the goals of the proposal do not align with the outlined challenge settings.\r\nCardano specific scalability is not adressed well enough. Feedback: Try developing a way to securitize in a common, decentralised way instead of bringing in \"the big guys\" and this idea will suit cardanos mission far better.", "q0r": 2, "q1": "The proposers seem, according to their self-acclaimed compententcies, up to the task. The proposers define the type and number of team members required to implement the proposal. The budget is not outlined clearly but just broken down into an hourly rate without working hours specified for different parts of the project. This it cannot be assessed that it is reasonable to achieve the set goals.\r\nThe proposal only offers a very coarse-grained  timetable and roadmap to complete the work and a far to brief implementation plan. While it briefly describes the resources used, the technical background is not really discussed beyond a very superficial level. Thus it is difficult to assess whether this proposal is feasible. Feedback: You need to go into a lot more detail in order for us CAs to assess your project a good feasibility. Try looking up best practices.", "q1r": 3, "q2": "The metrics are very brief and coursely defined and partially relate to the Ethereum blockchain ecosystem. This provides only some auditable items, and those are so open that it would basically be difficult to properly audit, as a lot of those coarsely-defined points would be very open to definition. The problem and the solution however are described comprehensively.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 18, "ne": 2, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "The idea behind this proposal is to pool the same or similar products into one pool and then decrease the risk of capital loss.\r\n\r\nSince right now it is aiming to just prove an idea, I am decreasing the score because the outcome is not certain.\r\n\r\nI like the idea that intermediaries will be replaced by blockchain and thus monopoly will be replaced by smart contracts owned by the community, therefore decreasing costs.\r\n\r\nI find this challenge in accordance with the fund goal, rating given 4.", "q0r": 4, "q1": "Team members pose with relevant skill and experience indicating that they can deliver the outcome and it will be implemented successfully.\r\n\r\n", "q1r": 4, "q2": "The key metrics and the information in the roadmap provide a timetable and a direction on which the proposer proceed.\r\n\r\nThese are providing an idea and allow us to audit the progress, yet more details would be welcomed.\r\n\r\nRating given 4.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal wants to pool different defi yield protocols into one easy to use pool that helps to reduce protocol risk through diversification. \r\n\r\nThis proposal is very effective in providing a low-risk yield through their pooling smart contract and helps to onboard people with lower risk profiles and exposes them to defi on Cardano. I believe it is very effective in addressing the challenge in this category!", "q0r": 5, "q1": "This proposal includes technical backgrounds of the team members but does not include social media profiles. Pending the team's qualifications are accurate the team seems well qualified to successfully implement this proposal.", "q1r": 4, "q2": "I feel like the roadmap could be more detailed and include some more specific KPIs for the milestones presented i.e. \" Apply for grants from\" could we include which grants the team is applying for?\r\n\r\nI also think the success measures defined are sensible and make sense in the context of this proposal and make this proposal auditable.", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "The problem is within the challenge setting, and the solution address it. This function will allow pooling of on-chain loans to reduce risk by risk transfering and shifting, which will make investors more active and adopt Cardano. Also, the success measures that this project aims at are aligned with the challenges. ", "q0r": 5, "q1": "The proposer shows that this team is experienced to execute this mission. Moreover, they also attach a whitepaper that explains how this function works, hence I think they can do it. \r\nThe proposer also shows the timeline that the team will work in 4 months to finish the MVP and testnet. Hence, the budget they required is fits with the workload of this roadmap. ", "q1r": 5, "q2": "The roadmap and the success measures that the proposer propose are enough for audit. And, for their solution explanation, I think the brief info in the proposal and the whitepaper is fully for it.\r\nThe only advice I give to the proposer is that should show some relevant risks to the plan, it will not just help them prepare for uncertain case but also help Catalyst community assess and audit this proposal. ", "q2r": 4, "assessor": "z_assessor_671", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The problem identified by this proposal is the lacks of ways to pool on-chain loans to diversify protocol risks. This proposal offers to develop pooling functions of securitization on Cardano. Based on my google research I can confirm that this is a need and that this project has potential to boost DeFi on Cardano. \r\nSuccess is defined by a working smartcontract and the corresponding specification. I would recommend that the proposer further elaborates on the impact expected by its solution on Cardano's Defi. What impact is expected on TVL for example? \r\nI agree that this proposal effectively addresses the challenge.\r\n", "q0r": 4, "q1": "The proposal includes a detailed roadmap for core and business development. A whitepaper is provided offering a comprehensive description of the problem, even if my personal skills does not enable a perfect understanding of it.\r\nI'm convinced by the high experience of the 4 team members in Mathematics, Computer Science and Software development. the product (smart-contract) description.\r\nI strongly agree that this proposal is highly likely to be implemented successfully.\r\n", "q1r": 5, "q2": "The definition of success is precise : it is the working smartcontract that will pool two protocols on a testnet. The 4 months roadmap for business development enable a regular monitoring by the community of the progress. I recommend the proposer to include in the project plan weekly development updates, that would offer an even better vision for the community.\r\nI agree that the community will be able to accurately monitor the progress of this project.\r\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 18, "ne": 5, "ng": 12, "nfo": 1, "vca_o": 1}], "solution": "Desarrollar la función de agrupación de la titulización en Cardano, para que los inversores de DeFi puedan asignar más fácilmente a diferentes protocolos juntos.", "experience": "Matemáticos, informáticos, especialistas en finanzas estructuradas y un SPO que ha negociado ampliamente con valores respaldados por hipotecas."}