{"id": 383446, "author": "seedstars", "title": "FinancialTimes Startup Competition", "url": "https://cardano.ideascale.com/a/dtd/383446-48088", "category": 26255, "amount": 65000, "description": "Idéias e talentos existem em todos os lugares, não apenas no Vale do Silício. Capital, apoio empresarial e acesso a redes, por outro lado, não", "funded": 2, "upvotes": 85295943, "downvotes": 6236853, "votes_result": 79059090, "votes_cast": 208, "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a perfect fit to challenge brief of bringing Professional A-Grade accelerator programmes onboard. This proposal will bring previously funded proposals into a competition with huge exposure and the chance to win significant funding for expansion. This is what acceleration is all about, leveraging a small amount of Catalyst money to crowd in external funding into promising start-ups and bring wide exposure to the community and Cardano as a whole.", "q0r": 5, "q1": "The proposer is a well established Accelerator with a clear plan to integrate prior funded proposals into a competition with exposure from both themselves and the Financial Times. Every expectation they would be able to deliver.", "q1r": 5, "q2": "This proposal is well set out with deliverables that will be easily measurable. It would be good to have some metrics on the number of start-ups to be screened/accepted into the competition and goals around the amount of funding to be awarded.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 29, "ne": 1, "ng": 25, "nfo": 3, "vca_o": 1}, {"q0": "The issue is non-availablity of Capital, Business mentors, and access to networks is stopping many ideas from becoming reality. The proposal wants to have a global startup competition and the funded project will have visibility and get to meet mentors and investors while enabling them to make their ideas reality. This proposal addresses the issue successfully ", "q0r": 5, "q1": "The proposer and their team have proven experience and have the required skills to implement the proposal. The proposal consists of a detailed plan and has helped many ideas to receive funding for their project. Therefore the chances of the proposal being implemented successfully seem to be high", "q1r": 5, "q2": "The proposal includes a one-week plan and a rough cost estimation. It would have helped auditors if the proposed consisted of KPIs and a Definition of success. With the given information, it won't be easy to track the progress and success of the proposal ", "q2r": 3, "assessor": "z_assessor_317", "no_vca": 17, "ne": 3, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "* The proposal clearly articulates how it will add value to the Cardano ecosystem. The proposer is able to scale to address future challenges. This proposal could provide many Catalyst funded projects a fast track to get access to a hue network (250k stakeholders in 95+ countries) and scale their individual ventures. The Cardano network would benefit from the speedsters network and the FTxSDG Challenge which focuses on empowering impact-driven entrepreneurs in emerging markets through a startup competition. That fits well to the challenge and Cardano making the world better for all.", "q0r": 5, "q1": "The proposers provides intense evidence of required skills and successful track record to implement the proposal. The most impressive KPIs: 1700 teams, 4800 mentors, NPS of 79%, 2/3 increase revenues and benefit in staffing. The roadmap is outlined clearly and broken down into identifiable items. The cost plan is available on high level and could benefit from additional information who is receiving the funds, and e.g. where the campaign, marketing & pr activities are planned. The channels are mentioned and a mapping from resource to channel to budget would bring it on an even higher level. The requested amount is below the value package. For the case that we see this proposal as relevant and the package has that value, it is a no-brainer to fund this proposal.", "q1r": 4, "q2": "There is a clear understandable description of the targeted problem and the intended solution. Catalyst and a few project could benefit from the solution. The proposal is credible and transparent. In order to improve audibility and comparability to other proposals for voters it would be helpful to get a better (measurable) understanding how many projects could benefit this round and potentially in the future in order to benefit from the accelerator and grow.\r\n4", "q2r": 4, "assessor": "z_assessor_737", "no_vca": 14, "ne": 3, "ng": 9, "nfo": 2, "vca_o": 1}], "solution": "Criar uma concorrência global para iniciar projetos financiados para ganhar visibilidade e encontrar mentores e investidores enquanto recebe apoio financeiro.", "experience": "A Seedstars tem organizado a maior competição de inicialização nos mercados emergentes nos últimos 8 anos. Para saber mais seedstars.com"}