{"id": 383822, "author": "nielskijf", "title": "Social Design Academy (Adagov/SDA)", "url": "https://cardano.ideascale.com/a/dtd/383822-48088", "category": 26255, "amount": 71500, "description": "Existe uma lacuna significativa de conhecimento para que indivíduos e empresas se juntem à revolução web3.", "funded": 1, "upvotes": 34264468, "downvotes": 5983564, "votes_result": 28280904, "votes_cast": 105, "f6_no_assessments": 3, "f6_rating": 3.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge at hand is to help incubate and accelerate startups within the ecosystem, in short. This proposal does exactly that in it's well laid about plan of mentors, workshops, training, and toolkits (as examples to more information within the write-up. I do think that this idea directly addresses the challenge and is capable of aiding those in need of such a service.", "q0r": 5, "q1": "The team took feedback from a comment, and they added the names and experience of the Team. This goes a very long way in building confidence, but more importantly, a way to verify the credentials. This team has also had several other funded projects.\r\nPlan: The branding and site has been created as a head start (although nothing appeared \"clickable\" for me personally on the site. The auditability section also includes essentially the plan. There is a roadmap available int he proposal as well, which aligns with the model of the proposal.\r\nThe budget is provided, however for myself it feels a bit high-level. It would be nice to see a breakdown of where the number were derived for each high level section.", "q1r": 4, "q2": "Again, the auditability section also includes a well-defined list of metrics. There is also a good roadmap provided. In addition, as this is a project geared for the community, majorly speaking this will be verifiable by community members.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "I believe the knowledge of Web 3 is fundamental to spread the adoption of blockchain. This proposal has a huge impact in terms of number of projects that can be accelerated and number of mentors/investors that can be onboarded. I think it perfectly fits the objectives of the Catalyst Accelerators & Mentors Challenge.", "q0r": 5, "q1": "The team has good experience: both technical to build the project and educational for building the contents. Besides, the plan is well structured, and makes sure that the objectives are achieved gradually involving the target audience at different levels. Moreover, the Social Design Academy seems to have a concrete business plan to become a sustainable project itself. Despite the relatively high budget requested, I believe this proposal has high chances of success.", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and the success of the proposal. The list of auditable items is quite vast and includes the Key metrics from the parent challenge, e.g. monitor number of projects, mentors, learners, quality of contents, etc.", "q2r": 5, "assessor": "z_assessor_956", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This challenge aims to encourage professional accelerators and incubators to partner with Catalyst. This proposal seeks initial funding for a new Social Design Academy that does not exist, and will require some time to build. While that could end up being useful to Catalyst eventually, it is not what this challenge is about.\n\nAs an experienced investor and entrepreneur, I am familiar with a wide variety of accelerator programs, and they are hard to do right. The challenge recognizes that by seeking to work with established players.", "q0r": 1, "q1": "As mentioned in my response on impact, getting an accelerator right is hard. Generally, this works best when the accelerator starts with a very specific and focused vision and focuses on getting that right first. The proposed Social Design Academy has an extremely diverse and complicated vision (I do not fully understand it). This is too much to bite off, and I doubt that it will be feasible to deliver this full vision effectively. Among other things, the funds requested, while not small, are far from sufficient to build a quality accelerator with this scope, and plans to obtain additional funding appear to be nascent.", "q1r": 2, "q2": "The proposal provides a long list of criteria for audit, but they are too diverse and confused to provide a solid basis for auditing. Also, as mentioned under feasibility, the vision is not focused or organized and it is hard to figure out where the project will start effectively. Accordingly, it would be very challenging to audit this proposal effectively.", "q2r": 2, "assessor": "z_assessor_495", "no_vca": 20, "ne": 3, "ng": 15, "nfo": 2, "vca_o": 1}], "solution": "Um programa de design social para indivíduos e organizações, que lhes dá uma abordagem sistemática de nivelamento para Web3 / UX 3.0.", "experience": "10yr+ Sr. UX/UI Designer / Engenheiro de Sistema ML. Fundador da Academia de Design Social. Membro da Adagov. 13+ meses em Catalyst. Fundador da F6."}