{"id": 385196, "author": "dcspark", "title": "Milkomeda Accelerator", "url": "https://cardano.ideascale.com/a/dtd/385196-48088", "category": 26255, "amount": 50000, "description": "Muitos fãs Cardano podem querer implantar na Milkomeda, mas por último o conhecimento técnico para dar vida à sua idéia", "funded": 2, "upvotes": 65505582, "downvotes": 11177447, "votes_result": 54328135, "votes_cast": 259, "f6_no_assessments": 15, "f6_rating": 2.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "Este é de fato um conceito intrigante, mas a proposta em si é muito breve e pode encontrar muitas preocupações no plano proposto. A equipe tem experiência profissional suficiente para ajudar as pessoas a alavancar a rede, no entanto, não há um objetivo lúcido sobre como a equipe planeja fazer isso. O principal objetivo da proposta é adquirir mais profissionais para fortalecer a equipe até o primeiro trimestre de 2022 com os fundos alocados, mas novamente, não há um plano elucidado sobre como a equipe planeja aproveitar esta enorme força de trabalho para resolver o problema. A proposta não mencionou os potenciais inconvenientes ou dificuldades que podem dificultar o plano e como a equipe deve levar a melhor sobre eles. Em resumo, mesmo que o plano pareça promissor, não há como estabelecer a validade das reivindicações com as informações disponíveis na proposta. Acredito que é preciso olhar para esta proposta de forma céptica e confiar na equipe e em sua gigantesca experiência neste campo.", "q0r": 4, "q1": "A proposta parece abordar o problema em questão até um certo nível, porém, parece ser muito abstrata no momento. A proposta certamente aumentará o número de pessoas que desejam construir aplicações em Cardano, mas o roteiro para alcançar o mesmo não é fornecido na proposta nem em nenhum anexo. Além disso, a proposta solicitou fundos de cerca de 50000 USD, embora seja apenas cerca de 10% dos fundos destinados a este desafio, a equipe não menciona como planeja utilizar este fundo para atingir o objetivo. Todos sabemos que Sebastian e Nicolas foram membros valiosos da comunidade e fizeram algumas contribuições cósmicas, mas um plano de ação um pouco mais detalhado teria sido feito melhor. A proposta tem claramente os traços de se transformar em um projeto de grande impacto, o que por sua vez incentivará a adoção e trará novos usuários para a rede. Mas um plano descritivo ou um plano de ação ajudará as pessoas de fora a compreender melhor a eficácia da proposta. Acredito firmemente que um pouco mais de esforço para elaborar o plano de jogo e como a equipe planeja utilizar os fundos alocados e apresentá-lo em um estágio posterior pode claramente fazer desta uma grande proposta.\r\n", "q1r": 3, "q2": "Sinto que a proposta carece de muitas informações necessárias para que se possa imaginar seu impacto e eficácia. A proposta não inclui o horizonte de tempo pelo qual planeja atingir o objetivo proposto nem menciona os marcos para que a comunidade acompanhe seu progresso. A proposta apenas menciona a necessidade de fundos para iniciar o programa, mas não há um plano de jogo detalhado nem uma separação explícita de como e quando os fundos serão utilizados. A equipe não faz nenhuma referência às métricas que podem ser usadas para auditar. Não há métricas possíveis para medir a qualidade, a satisfação do cliente e o retorno do investimento para os fundos alocados. Aparentemente, a equipe também não faz menção aos desafios que a equipe pode enfrentar no processo. A proposta também não menciona porque ela se destaca em comparação com outras propostas sob o mesmo desafio. Infelizmente, há muito pouca informação para avaliar o progresso desta proposta.\r\n", "q2r": 3, "assessor": "z_assessor_751", "no_vca": 21, "ne": 15, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal aligns well with the category and would create a sub accelerator to Catalyst, specific to projects building on Milkomeda. ", "q0r": 5, "q1": "The dcSpark team has a consistent track record for building in Cardano. Milkomeda is also already live on testnet.", "q1r": 5, "q2": "More information specific to their overall implementation plan for the accelerator could be shared, the team's expertise and already deployed to testnet version of the protocol are carrying this entire proposal", "q2r": 4, "assessor": "z_assessor_1005", "no_vca": 44, "ne": 4, "ng": 20, "nfo": 20, "vca_o": 1}, {"q0": "This is a proposal to help people develop Cardano project on milkomeda. The proposal says they will start recruiting for an accelerator in Q1. No details however provided on this accelerator. Please provide details on how you would implement this proposal, who the accelerator would be structured (online, face to face, time frames). What is the funding for, is that to give to the start ups or for your own wages?", "q0r": 2, "q1": "Whilst the proposers are significant experience, there is not detail in the plan thus it is not possible to give it high likelihood of success. Please present a plan with a detailed budget on how you will build this accelerator. Is this a one off, or will it be ongoing. How many people/teams? How long will it run for? ", "q1r": 1, "q2": "There is no deliverable plan against which success can be measured so it is not possible to audit delivery. Please also provide KPI and goals against which success can be measured. What does success look like? How many teams come out and where do they go once the do so?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 31, "ne": 3, "ng": 27, "nfo": 1, "vca_o": 1}, {"q0": "A proposal without a way to track progress becomes very vague, with information and sample documents giving very little confidence that the proposal will be successful. Also, the proposer has not given any reference to any of his past work of a similar scale and the proposal has major gaps in terms of detailing the major topics and bringing clarity for a clear understanding. In cases like \"Many Cardano fans may want to deploy on Milkomeda, but last the technical knowledge to fully bring their idea to life\"....First, the concept of Milkomedia is not properly explained, assumptions are made without support and seem vague for a deep understanding.", "q0r": 2, "q1": "More details on the expertise behind making sure this can be launched need to be presented, what is the roadmap to see the steps along making it a reality. ", "q1r": 2, "q2": "The project doesn't have a list of deliverables and timelines which will be possible to audit. This is made harder though as the budget is not linked to any concrete milestones. The proposers have not set KPIs or deliverables under the heading of success.\r\nIt's recommendable a more understandable view of the proposed metrics and how the value can bring ROI and value to the entire Cardano ecosystem. Also, the proposer has not given any reference to any of his past work of a similar scale and there is no detailed project plan included in this proposal or attachments.", "q2r": 2, "assessor": "z_assessor_243", "no_vca": 23, "ne": 5, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "This proposal mainly focuses on guiding people to use the proposers' own solution, Milkomeda, which is fine as long as this solution is what is needed. ", "q0r": 3, "q1": "Team is no doubt capable and, if funded, will surely produce good results. Unfortunately the proposal only states that \"we want to run an accelerator program to help bring their projects to life\" but doesn't clarify how that would be done. As the feedback in the comment section suggets, more meat is needed around these bones. It's a pity those questions were left unanswered.", "q1r": 3, "q2": "Timeline, KPIs, budget and deliverables are missing. Progress impossible to track.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 24, "ne": 0, "ng": 15, "nfo": 9, "vca_o": 1}, {"q0": "According to the challenge brief the objective \"is to help catalyse early successes of Catalyst-funded projects and turn them into highly investable ventures\".\r\n\r\nThe identified problem isn't presented in a clear manner and seems that the proposal aims to help those in needs only from a technical (blockchain use) perspective leaving the business aspects of the accelerator/incubator uncovered.\r\n\r\nThe solution to the problem is presented in an unclear manner (specifically what is to be done to achieve the set goals of the proposal?).\r\n\r\nThere are no KPIs/metrics defined to measure the output", "q0r": 2, "q1": "There is no info (statements, links, documents etc.) about the strong experience that the team members have to have. Also there are no roles defined for each team members (who is the leader, and what are the responsibilities for the other members)?\r\n\r\nThe budget is set but is not broken down into identifiable items, thus being hard to assess if is reasonable to achieve the set goals.\r\n\r\nThere is no timetable defined to complete the work. There is no plan which describes the resources necessary to implement the proposal (human resources, stationary, equipment, rented space etc.).\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation (risks: competition, projects not feasible to invest in etc.)", "q1r": 2, "q2": "There are no metrics/KPIs set that define the success of the proposal. (i.e.: no. of projects assessed in a time frame: 20, no. of projects acceding to the next stage (feasible for incubating): 3 etc.\r\n\r\nUnfortunately the proposer has not provided enough information thus, the progress of this proposal is hard to assess", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 24, "ne": 5, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "As they themselves say, dcSpark is a crypto ecosystem builder company that builds critical infrastructure for promising crypto projects that it is passionate about such as Cardano. The team is unforuntately not as passionate about following the Catalyst proposal submission rules, which may hamper the scores of their proposals. Good news is that their proposals are usually great ideas (this one too!). The impact of this proposal is potentially enormous with the M1 sidechain launching as the premier EVM-based sidechain in the Cardano ecosystem powered by the Milkomeda protocol. Hence, the Milkomeda Accelerator program will come in useful to foster projects that want to capitlize on this new piece of infrastructure. I agree the impact would be amazing and  an accelerator program for projects interested in building with Milkomeda is something that would  amplify and commercialize projects of benefit for the ecosystem. The challenge specifies that Catalyst wants organizations and groups who have a track record of business incubation and acceleration to apply. dcSpark is one of them.", "q0r": 5, "q1": " dcSpark was founded by three former EMURGO members who have been deeply involved in the Cardano ecosystem for years. This time has the theoretical and practical knowledge to pull it off. What I don't understand is why does dcSpark (repeatedly?) fails to include a budget breakdown and often there are no detailed milestones. The total budget for this proposal is $50,000. That's it. Voters get no more budget-related information. The dcSpark team member who wrote this Catalyst proposal checked the \"Broken down my budget requirements\" checkbox - and then did not break down the budget requirements. The dcSpark team member in charge of submitting this proposal checked the \"Definition of success after 3, 6 and 12 months\" check box to indicate that this has been included - and then the proposal does not have even an explanation why this has not been included. OK, there might be different reasons for these omissions: the team does not know yet, or the team does not think it is relevant at this moment, or a more detailed plan will be published later... but still, Catalyst has a modus operandi and these proposals (not the first one) omit this information. One possible way of doing it would be to say \"\"We plan to provide funding for up to 5 teams, meaning that the desired ceiling per project would be $10,000\"... There could also be some added information on how teams will be selected - what will be the factors that you will use to sort among the apiring projects?  Or something else. I mention this because the dcSpark team can clearly up their game in terms of writing Catalyst proposals (when it comes to the Feasibility and the Auditability segments). You guys work with algorithms all the time, just follow the Catalyst algorithm and don't skip the stuff we need: \"The budget is outlined clearly and broken down into identifiable items.\" \"The plan describes the resources necessary to implement the proposal.\" \"The proposer has considered challenges and risks relevant to a successful implementation.\" etc... Community advisors are being expected to go out on a limb here and trust ... trust... trust... that everything will play out well. However, our job as CAs it to trust but also verify. I would advise the team to read the nitty gritty details of the Community Advisor Assessment Guide and what we look for in a proposal: https://docs.google.com/document/d/1g-iZhDlKhUBZkui1uv8NVNfJC4oVD3JtR-P6Fue7XPU/edit#", "q1r": 4, "q2": "This team has been very transparent and very vocal about its contributions to the Cardano ecosystem. They are very well known players and agents of change. I think their forte is the technical knowledge, experience, deep understanding of the matter at hand and ability to explain and foresee challenges. I am confident that they will be successful in what they intend - accelerating the Milkomeda projects. It might be somewhat difficult for someone trying to periodically follow the progress of this proposal if there are no clear milestones that the team envisages or regular updates. I presume there will be some, but the proposal does not let us know. Still this criteria is called not just Auditability - but Clarity/Auditability and the fact that the team has such a clear vision speaks favourably in their name that they will approach the project - I expect (!) with the same clarity that they put into practical projects. I would advise them to be proactive and to set a regular pace of updates to the community on how implementation of proposals is progressing. If this is something that they can take on board, then they can also include such a \"reporting mechanism\" in all of their Catalyst proposals in the future. Looking at the dcSpark website I see it lacks a news section - that's what you guys may need - regular technical updates. One of the commenters below the proposal (Richard Goerwitz) left some very good advice to the proposing team on Ideascale. I will repeat it here, as I think it is very pertinent (hopefully dcSpark is reading this): \"I'd personally like to see more detail on what you intend to do.  Will you be producing video lessons?  A textbook of some kind?  An interactive tutorial, with a credential at the end (extra credit: credential offered via Prism)?  Will you offer in-person classes?  Online classes?  Will you produce lesson plans?  How will you evaluate students? How do we know Milkomeda is going anywhere, too?  Why should developers care? What is your timeline?  How will you, and we, know if you have achieved what you set out to do?\r\nIt's possible to read this proposal as:  \"Trust us, we're good,\" and I think most readers won't be as impressed by your credentials and track record as much as by a great outline of what you intend to do.  Don't get me wrong.  The credentials are useful, too.  You just have to put them in later, as a way of convincing us you can execute.\" \r\n", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 20, "ne": 10, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "I have read many proposals of this team. All proposals have similar content. The ideas and solutions of these proposals are in different challenges but do not offer any specific plans or products. The content of these proposals is mostly an introduction to Milkomeda. Therefore, I am doubting their intentions maybe they just want to PR Milkomeda and not really want to make a complete proposal", "q0r": 1, "q1": "The team behind this proposal did not offer a specific plan or product description. They just come up with ideas and try to create as many Milkomeda proposals as they can to get the attention of people reading these proposals. But they did not specify a specific solution at all. Therefore, this proposal will not be feasible", "q1r": 1, "q2": "\"If you are asking for $50,000 you need to provide a very detailed budget.\r\n\r\nRight now I don't see a proper plan or a budget.\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 22, "ne": 1, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "Milkomeda is an EVM compatible sidechain in development and it will enable launch of many projects developed for Ethereum on Cardano. The impact of this solution can not be overstated, this is real interoperability. The proposal aims to educate and accelerate people to use Milkomeda as soon as possible thus drastically increasing Cardano adoption.", "q0r": 5, "q1": "The team is highly experienced and well known in the community for their work. Unfortunately, the proposal doesn't contain basic things like timeline, KPIs, metrics or budget breakdown. I simply do not understand why this information was not put in by such an experienced and professional team.", "q1r": 3, "q2": "Except stating that in Q1 of 2022 recruitment for the program will start, there is no timeline, success metrics, KPI's or any sort of plan of execution for the accelerator program. The team is amazing and they provide irreplaceable contributions to the Cardano ecosystem, so it is very difficult to understand why these simple metrics were not put in the proposal.", "q2r": 2, "assessor": "z_assessor_65", "no_vca": 18, "ne": 1, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "It would be good to elaborate more clearly both the problem and the solution itself. If the idea was developed it would surely have a positive impact on the Cardano ecosystem. It would be good to elaborate in more detail how this idea will add value to the Cardano and Catalyst ecosystem. Because there are no KPIs, it's hard to compare KPIs with challenge setting and the proposal is not able to scale and address future challenges.\r\n\r\n", "q0r": 1, "q1": "In the proposal unfortunately we do not have any information about who is behind this idea, how many people will work on this project, nor do we have insight into the work done so far by the proposer. It would be good to present team members and their skills, knowledge and experience needed to bring this idea to life maybe via LinkedIn or the Github or website. The proposed amount of money, which is not realistic, is clearly stated in the proposal. Unfortunately the proposer is has not broken down the budget into identifiable items so it is not clear what the money will be used for and how. It would be great if the idea had a detailed implementable plan with details of actionable tasks and order of execution. Another very important thing for the realization of the idea is realistic timetable to complete the work. It would be great to list in the proposal the necessary resources, technical aspects, technologies that are needed to turn the idea into a project. Risk awareness is a very important item in any project.", "q1r": 1, "q2": "The work and success of the project and the guarantee of performance is through the roadmap with milestones, time horizon for achievement and KPIs. As unfortunately everything I mentioned in this proposal is missing, the community in no way can track the development of this proposal.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about running an accelerator program for projects interested in building with Milkomeda. This idea makes a lot of sense and addresses the challenge. The problem is clear, matching the challenge presented, however, the proposed solution is still very abstract [no roadmap, budget distribution, KPIs, ...]. Therefore, based on the given information, I do not agree with the impact of this proposal, I can rate it with a score of 2", "q0r": 2, "q1": "Team profiles are descriptive enough to understand, with appropriate skills and experience to perform, along with references/evidence (https://dcspark.gitbook.io/milkomeda/details/team) to verify. So the team's profile convinces me of the feasibility. However, the plan did not. Budget breakdown with a total budget only, without any roadmap/milestone. In addition, the risk is not identified. Therefore, based on the given information, I am neutral on the feasibility of this proposal, I can rate it with a score of 3.", "q1r": 3, "q2": "Team profile is described enough for understanding with reference/proof (documents/links,...) for verifying. My advice is: for better understanding of the plan, the proposer should consider adding the missing information: (1) Budget distribution (with explanation for each item); (2) Roadmap (with KPIs/ Metrics); (3) Risk/challenge analysis Based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 19, "ne": 3, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "The proposal articulates how it will add value to the Cardano ecosystem. The problem statements requires that the advisor/voter knows Milkomedia and dcSpark in order to directly think about its advantages. The demographic information, currently described as \"many Cardano fans\" should be more specified in order to address those people who have a problem in ordre to benefit from the Milkomedia solution. The proposal does not explain the business advantages users have and therefore only partly aligns with the challenge.", "q0r": 2, "q1": "The proposal does neither include an action plan, nor a roadmap, nor KPIs. The proposer explains that they have a very experiences team but does not provide additional information where the reader can proof it. In order to increase the level of trust to the reader a link to the website, or linkedin profiles would be helpful. I trust everybody by design, but in the CA role requires to look for proof inside the proposal. Also helpful could be a cost break down to get a reasonable understanding what the requested funds are going to be used for (consulting time, documentation, coding, videos, …?)", "q1r": 1, "q2": "There is no detailed description about the targeted problem. It is hard to get a lot of details I a very compressed proposal. I like that it is short, but I muss clear metrics, KPIs and do have to read between the lines in order to imagine how it could help accelerate Catalyst projects. I would love to read an updated - more understandable - proposal in the next fund. ", "q2r": 1, "assessor": "z_assessor_737", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "The proposal suggests running an accelerator for the new Milkomeda side chain being released by dcSpark. The Milkomedia sidechain helps bring EVM compatibility to Cardano, by providing an easy way for existing projects to start using this solution through an accelerator the Milkomeda sidechain has an increase change of making an impactful change for helping increase adoption of Cardano.", "q0r": 5, "q1": "The team has experience working within or closely with IOG / Emurgo and have started their own company dcSpark. The team has also started previous startups before which provides enough evidence that the team has both the technical expertise to help new companies with Milkomeda as they created it but also with running their startup in the crypto market due to their own experience running different ventures. ", "q1r": 5, "q2": "A basic outline roadmap is provided for first half of 2022. No KPIs or success metrics have been provided. It would have been useful to have more information on defining the success more from the point of view of dcSpark. For instance they could be looking for just helping make it easy for people to deploy solutions onto Milkomeda from a technical stand point. They could also have an objective to support the business with advice on how to run as an organisation and look to take a number of startups through enough training to give them the right skills and knowledge to increase chances of success. ", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "This proposal does not outline what it intends to do for its accelerator program. While a fully fleshed out accelerator program is highly likely to be useful to the community and meet the intention of the challenge to provide professional grade support to smaller projects, there is nothing in the proposal which defines the accelerator program which is going to be produced.", "q0r": 4, "q1": "Difficult to asses as there is no clear plan of what this proposal intends to provide, however the team is highly experienced both in Milkomeda as the developers of it, and in Cardano having been involved in the ecosystem for a long time. Given they are the developers of Milkomeda they are likely highly internally motivated to produce a high quality accelerator program and support to developer teams required to bring activity to their product so despite the lack of details here, a good quality product seems likely. Success of Milkomeda would likely help the growth of the Cardano ecosystem, helping to bridge developers or products from EVM environments and increase activity and TVL on the Cardano blockchain.", "q1r": 4, "q2": "No information is provided on:\r\n- Intended output\r\n- Intended timescales\r\n- Planned breakdown of funding allocation\r\nSo any attempt at auditing the progress and success is going to be difficult.", "q2r": 1, "assessor": "z_assessor_902", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This challenge is for getting funded projects investment ready. We don't need fans to be onboarded. I strongly support Milkomeda EVM but I think this proposal is in the wrong challenge.", "q0r": 2, "q1": "I think this team will easily get any project onboarded to Milkiomeda becase of the their experience, but then again, how does being onboarded on Milkomeda, makes any project investsment ready. Sorry guys, just the wrong challenge I think.", "q1r": 3, "q2": "I think this team is really very good and will be able to deliver on their said promises because of thier proven tranck record. Shame that becuase of this brilliance the team has not put a lot of effort in making the proposal voting ready. Would be helpful to have KPI's so that we can measure outcomes. Come on guys! Your better than this.", "q2r": 1, "assessor": "z_assessor_996", "no_vca": 35, "ne": 1, "ng": 18, "nfo": 16, "vca_o": 1}], "solution": "Usaremos nossa experiência no dcSpark para executar um programa de acelerador para projetos interessados em construir com a Milkomeda", "experience": "Nossa equipe criou Milkomeda e temos trabalhado no ecossistema da cadeia de bloqueio por muitos anos, incluindo ex-EMURGO e ex-IOHK membros"}