{"id": 384495, "author": "erikrehbinder", "title": "new.tech circular accelerator", "url": "https://cardano.ideascale.com/a/dtd/384495-48088", "category": 26255, "amount": 500000, "description": "Sustainable consumption worldwide will only occur if we supercharge funding, collaboration and circular innovation at massive scale.", "f6_no_assessments": 4, "f6_rating": 2.75, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is asking for the entire amount of the challenge to set up a new entity to run an accelerator in Norway. Its not clear putting all the challenges eggs into one basket for an unproven new accelerator focused in one location is a good idea. A key measure of the campaign brief is \"Distribution of programmes across the world to serve different audiences\". For instance 2 competing proposal by established accelerator SeedStars for a 1/3 of the challenge funds in total would cover both Africa and emerging markets. ", "q0r": 3, "q1": "The two key proposers have experience in the accelerator and start-up space, however its not clear they have the experience to set up a new one from scratch. The budget breakdown is relatively with the $500k they are after broken down into pretty course buckets. It is hard to give this a highly likely to succeed rating given, especially given other projects which have been proposed by teams already running accelerators and for fractions of the cost. It doesn't seem like a great idea to put the whole amount available for the challenge to one group looking to set up a new entity.", "q1r": 2, "q2": "The proposal a clear set of deliverables and time lines against which progress could be audited. Success metrics such as 10-100 million of funding, 1000+ members and $1billion in token value of new coins though highly ambitious, are measurable and the proposal could be held to account against them.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 26, "ne": 3, "ng": 22, "nfo": 1, "vca_o": 1}, {"q0": "The team has lofty goals, riding on the ESG wave of Impact Investing. However, it has failed to address the constructive critique raised by Kriss in the comment section. Might have to get back to the drawing board and re-submit in Fund8 where more funds are available.", "q0r": 2, "q1": "Super-massively impressive team. Just not sure how easy it is to pull of this plan should there be a bear market. The website (new.tech) cannot be reached. It almost feels like the team didn't have time to finalize the plan. It still points to \"The latest draft version\".", "q1r": 3, "q2": "According to the budget \"Funding of pilot accelerator project: $50k\" is just 10% of what is being asked. That is what the team should have focused on. I don't think it's the best use of the Treasury money to fund the high Norwegian salaries and legal fees.\r\n\r\nSpeaking of legal matters, knowing the regulators' stance on security tokens, this bit makes me uneasy: \"Newcoins will be distributed by new.tech to startups in exchange for ownership in their respective equity and/or tokens.\" When you do re-submit your proposal, make sure you have finalized the model so that it won't be torpedoed by the SEC and the likes. At least you need to outline the associated risks and your plan to tackle those.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "While the proposal is exciting and no doubt needed, its not clear how this will directly lead to accelerating the general community or provide mentorship relevant to fueling the growth of the community.", "q0r": 3, "q1": "The milestones are generally not actions, per se, they are buckets of actions, each containing many many subactions. For example, this milestone: \"Secured commitment of $10-100 million in funding from an accomplished team of investors\" contains many, many linked subactions, each introducing an element of execution risk.\r\nThough the team is competent and impressive, in aggregate, there is substantial execution risk embedded within this proposal. ", "q1r": 2, "q2": "Given the proposal milestones as generally buckets of actions, rather than simple, specific, measurable, publically auditable actions, it is unclear how the community would judge if the proposal is on track or not. ", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The problem addresses a major global problem, which could also align with the challenge setting. If we find a way that the proposers build a community inside Cardano focussing on circular business models and ecosystems, the new.tech circular accelerator could bring in new mentors and investors to Catalyst funded startups and help them become profitable.", "q0r": 4, "q1": "    - The proposers build a powerful, diverse and very experienced team to plan, execute and deliver the proposed solution. Vision, value proposition and marked need is outlined detailed. The approach starting with 'newcoins via ISPO' is outlined and should be broken down into more details. The success metrics in a 3-months timeframe look impressive and are highly ambitious. Working in the VC-area for 5+ years I know how hard it is the 'first money'. It would be helpful to add the 'why' to multiple topics. E.g. why Oslo, why 10-100M, $1B market cap, 100 countries, … The cost is broken down to a very high level. It would be very helpful if we could get more information in which timeframe you need how much money in order to achieve xyz and what is the benefit for the Cardano ecosystem.", "q1r": 3, "q2": "The market approach became very clear to me. I did not understand at what stage (pre/post Catalyst) the new.tech circular accelerator helps our community. The audibility for the high level plan remains pretty open as we do not learn about how (in much more details) the team is going to achieve the targets. \r\nWhat remains open is the benefit for the Cardano ecosystem. In an updated version it would be great if you could elaborate on how to fuel Catalyst funded projects. Especially the budget topic is more than bold and unrealistic watching the behaviour in previous funds. I would love to see an updated version of this proposal with more details towards the execution with a smaller budget junks.", "q2r": 2, "assessor": "z_assessor_737", "no_vca": 13, "ne": 2, "ng": 9, "nfo": 2, "vca_o": 1}], "solution": "A global community and digital currency with a mission to accelerate circular business models and ecosystems.", "experience": "The founders own a successful circular business and have been involved in world leading accelerators such as Katapult, Antler and EMNY."}