{"id": 381822, "author": "nielskijf", "title": "Fund Builder for DAO's (Adagov/SDA)", "url": "https://cardano.ideascale.com/a/dtd/381822-48088", "category": 26236, "amount": 37000, "description": "Project Catalyst es estático y lineal, lo que provoca problemas de escalabilidad y retraso, e impide que los equipos con proyectos prometedores elijan Cardano.", "funded": 1, "upvotes": 61756009, "downvotes": 6700004, "votes_result": 55056005, "votes_cast": 231, "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "El primer punto bueno de esta propuesta es proporcionar un TL;DR, es decir, un resumen, de la propuesta. Esto es muy útil para los votantes y también para las AC/ACV. Además, la propuesta en sí está muy bien redactada y explicada, aunque es un poco larga, un problema que se ve disminuido por el resumen ya citado. Sin embargo, tiene mucha información sobre proyectos paralelos, relacionados con los proyectos más grandes de la Academia de Diseño Social y el Asistente Voltaire, que dan un buen contexto, aunque están un poco fuera del alcance aquí y hace más difícil entender exactamente lo que se incluye en la propuesta. Aunque, tras una lectura atenta, es posible entenderla. Esta propuesta tiene como objetivo investigar y construir una Prueba de Concepto para un nuevo modelo de financiación para Catalyst basado en un Modelo de Datos Circular, perfeccionado por múltiples talleres con miembros experimentados de Catalyst y con el objetivo de construir el mejor diseño y UI/UX posible. Este mecanismo podría utilizarse también para la financiación rápida, como se menciona en la propuesta, pero dado que se trata de una investigación, no podemos saber exactamente cómo será, ni tampoco cómo se tomará la decisión, es decir, cómo elegirá la comunidad qué proyectos recibirán financiación. Dos tercios del presupuesto se destinan a la mencionada investigación, mientras que 1/6 a la documentación y 1/6 a la construcción del PdC, aunque parece que el PdC se añadió más tarde y no se incluyó en el presupuesto final de la propuesta. Esta propuesta está muy bien alineada con el Desafío, y también la investigación es importante para hacer las cosas de una manera muy buena, en lugar de sólo empezar sin siquiera refelcción, y si esto se implementa con éxito, el beneficio para las comunidades de Catalyst y Cardano será enorme.", "q0r": 4, "q1": "El equipo que está detrás del proyecto es muy conocido en la comunidad y son responsables de muchas sesiones y talleres a lo largo de todo el 2021. Han contribuido activamente a mejorar el ecosistema. El equipo de revisión del diseño también está muy capacitado y tiene experiencia con Catalyst. Creo que es muy probable que la parte de investigación de esta propuesta se lleve a cabo con éxito. Hay una lista de progresos que hay que seguir, pero no coincide completamente con la lista de entregables esbozada en la sección \"Entregables\", lo que hace que sea un poco más difícil entender cuándo se va a entregar realmente cada uno de los entregables, y si hay un orden para que se entreguen, o no. El presupuesto se presenta como una suma global, y no explica en detalle por qué se necesitan 30.000 dólares para la investigación, por ejemplo, por lo que es difícil evaluar si el presupuesto es adecuado o no. Además, el presupuesto total no incluye el presupuesto para construir la Prueba de Concepto, creo que debido a un error humano, y esto podría dificultar la consecución de todos los objetivos de la propuesta. Aunque en general la propuesta carece de algunos de los temas mencionados, viendo las otras propuestas del equipo y lo que han estado haciendo en la comunidad, creo que esta tiene una alta probabilidad de éxito.", "q1r": 4, "q2": "La propuesta presenta un buen conjunto de información sobre lo que se va a desarrollar en general. Por otro lado, le falta un poco de conexión entre las diferentes informaciones que se presentan, lo que hace difícil encontrar la información sobre cuándo se van a entregar exactamente los productos de esta propuesta. Por ejemplo, la lista de \"entregables\" no está bien conectada con la lista de \"seguimiento del progreso\". También hay una hoja de ruta de la APS que añade información relevante, pero no aporta mucho a la auditabilidad de esta propuesta en concreto. La definición de éxito se proporciona de forma vaga, con un amplio marco temporal de 3 meses, lo que también dificulta la auditoría, y se podrían haber incluido algunos KPI para medir el éxito de esta propuesta. Dado que se trata de una propuesta de investigación, en su esencia, es realmente difícil llegar a algunas de estas métricas, pero también es necesario hacerla auditable para que la comunidad pueda seguir el progreso de lo que se está haciendo.", "q2r": 3, "assessor": "z_assessor_31", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "This project seems to be a vision to rebuild the way project catalyst is run through new governance software for both the current catalyst funding rounds and also a rapid funding mechanism. However the TL;DR really is that clear on what will be delivered, and the long version is more of a mission statement than a clear project plan with deliverables. I feel the proposers have good intentions and want to research some interesting things, however its not clear what they will deliver and how this meets the challenge goal of increasing the speed of funding. It seems to be more of a project to research how to change governance within Catalyst.", "q0r": 3, "q1": "The team has appears to have good experience and is clearly very motivated in the space. The main aim of the project is to research how to produce the outcome they want. However the project description lacks a succinct plan and description of what will be delivered. It is thus hard to give high ranking to whether this will be successfully delivered. ", "q1r": 3, "q2": "The deliverables and budget section is a very small part of the proposal, with the majority covered in 1 sentence. It would be nice to see this broken down with timelines so progress can be audited. It is also important to produce a number of measurable metrics with goals attached so success can be measured.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 24, "ne": 1, "ng": 20, "nfo": 3, "vca_o": 1}, {"q0": "An intellectually impressive proposal as well, hover, it does not effectively address the Brief by failing to lay out exactly how much more rapid it would enable funding. It claims improved speed amongst a portfolio of benefits but does not go far enough effectively.  The core goal per the brief: \"Increasing the speed of funding is critically important to allow important projects to move rapidly from volunteers to paid professionals. While volunteerism is strong in our community (and a strength), the ability to pay people for their time will accelerate and dramatically improve the time and energy people will be able to devote to Catalyst.\"", "q0r": 5, "q1": "There is no doubt a DAO will be implemented as the team is competent and accomplished. there is also no doubt a design community will be organized as well, but will the entire thing successfully implement? to this assessor, it is unclear, as the proposal is so massive and so varied, its unclear that all of it will come to fruition thereby entirely delivering fully on the promised value.", "q1r": 4, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, publically auditable, and time\r\n fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 20, "ne": 3, "ng": 10, "nfo": 7, "vca_o": 1}], "solution": "Un constructor de fondos con Social Appstore que despliega teselas laterales para incorporar nuevos equipos a través de vías de financiación rápidas, lineales y asíncronas.", "experience": "10 años de experiencia como diseñador UX/UI / ingeniero de sistemas ML. Fundador de la Academia de Diseño Social. Miembro de Adagov. 13+ meses en Catalyst. Financiado F6."}