{"id": 384249, "author": "ccadminteam", "title": "Catalyst Circle - Funding Mechanism", "url": "https://cardano.ideascale.com/a/dtd/384249-48088", "category": 26236, "amount": 37500, "description": "La financiación de Project Catalyst requiere varios meses antes de que los fondos estén disponibles. Las iniciativas críticas necesitan una financiación más rápida.", "funded": 2, "upvotes": 94490208, "downvotes": 9771995, "votes_result": 84718213, "votes_cast": 533, "f6_no_assessments": 8, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta parece encajar perfectamente con el reto del Mecanismo de Financiación Rápida, ya que asigna parte de la financiación de Catalyst para ser distribuida a iniciativas que son cruciales para el Círculo Catalyst. Como hemos visto, el Círculo Catalizador v1 tuvo dificultades para sacar adelante algunas iniciativas porque dependía del voluntariado de algunos de sus miembros y también de miembros de la comunidad. Esta propuesta asignará fondos suficientes para resolver algunos de los problemas percibidos por el Círculo Catalizador, aunque su presupuesto no será suficiente para financiar problemas mayores, como la creación de un modelo de reputación para Catalizador, pero es mejor empezar poco a poco y evolucionar. El impacto de esta propuesta como semilla para la financiación de futuras iniciativas de gobernanza puede ser enorme si se lleva a cabo con éxito, ya que puede ampliarse muy fácilmente si la comunidad lo considera valioso. Tal vez incluso el presupuesto de 7.000 dólares por \"grupo\" sea suficiente para pagar la ejecución de más de un proyecto, dependiendo del tamaño de los mismos.", "q0r": 5, "q1": "El equipo que propone el proyecto es el miembro del Círculo Catalizador y el equipo de administración. Ambos equipos están muy comprometidos y son capaces de llevar a cabo este proyecto, ya que lideran la iniciativa de gobernanza y hacen un seguimiento de lo que se hace, respectivamente, y son los más adecuados para dirigirlo. Aunque no hay una hoja de ruta en la propuesta, por su naturaleza no es necesaria y los pasos para la financiación rápida que apoya el Círculo Catalizador están claramente detallados y son adecuados para alcanzar los objetivos de la propuesta. El riesgo de no encontrar buenos proyectos para resolver las cuestiones planteadas, o de no utilizar todo el presupuesto, está bien discutido y se propone reservar los fondos para futuras iniciativas del Círculo, lo que parece bastante apropiado. Además, la propuesta añade algo de presupuesto para gastos imprevistos, lo que es importante cuando se intenta algo por primera vez, ya que esta iniciativa probablemente llevará más tiempo del previsto. El equipo proponente también deja espacio para ajustar la hoja de ruta y el plan en función de la evolución de Catalyst, lo cual es crucial ya que la mayoría de las cosas en Catalyst cambian constantemente. Por último, los miembros del equipo de administración responsables de auditar las propuestas ya están trabajando en otras iniciativas de auditoría y de código abierto en la comunidad, lo que me hace creer que el dinero se gastará de forma justa y transparente.", "q1r": 5, "q2": "Hay un plan claro sobre cómo ejecutar la propuesta, aunque no se presenta una hoja de ruta de forma habitual, es posible entender cómo se va a implementar esta propuesta y como todo va a quedar registrado en un entorno de código abierto (CC GitBook), es totalmente posible para la comunidad hacer un seguimiento de lo que se está haciendo y seguir los avances. Los KPIs de éxito de la propuesta tampoco son explícitos, pero se mencionan en el texto, que sería el número de proyectos financiados con esta tesorería, que actualmente es 1 por grupo, pero se podrían conseguir más.", "q2r": 5, "assessor": "z_assessor_31", "no_vca": 22, "ne": 14, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This is a great proposal to give each group in the catalyst circle $7000 in funds to chose one problem and then build a team to solve it. These groups are already out there looking at the pressing problems in their areas and it makes sense to delegate a small amount of funds to them to solve problems. The only question I have is, is the amount too small? But we can always build on that next round.", "q0r": 5, "q1": "The Catalyst Circle team is highly experience and connected within the community. They have presented a detailed plan and there is no reason to think they can't deliver on it. This is a great project from a team that is committed to the community.", "q1r": 5, "q2": "The proposal is well written and has clear deliverables and metrics for auditing and measuring success. ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 29, "ne": 1, "ng": 23, "nfo": 5, "vca_o": 1}, {"q0": "In the proposal, the formulation of the problem (section \"problem statement\") identifies with precision the meat of the problem of the entire \"Rapid Funding Mechanism\" campaign: the problem is bigger that the money.  The problem is time.  And time is in function of the necessary (yes, necessary) hurdles to conclude: a) the proposal submitted for Rapid Funding corresponds to a real need in the community b) the proposal can effectively address that need.  \r\n\r\nThe proposal has experienced people in charge and the Catalyst Circle is a trusted body in Cardano's governance structure.  Its ideas evaluation technique (described in the proposal) is a process curated by many iterations in the Cardano Governance environment.  Potentially that technique can be a great contribution to a bigger problem:  we need an effcient methodology for discovering and processing ideas, in less time and with fewer obstacles. And of course, with less risk, because  It's not a secret that discovering truly effective ideas is a business with a low probability of success (and that fact is a reality beyond the control of humans, include the Catalyst Circle).   However, it is an unavoidable job for any organization seeking to evolve.\r\n\r\nBasically, I think the proposal says: \"let's give the guys their funding. They know what they are doing.\"  Meanwhile, how to detect, evaluate and fund ideas with real impact potential, with a minimum amount of obstacles but with the maximum possible risk reduction, yet screams for a solution.  \r\n\r\nPerhaps the solution to the Rapid funding problem lies beyond the Catalyst Circle itself. Perhaps we need deeper integration of the Catalyst Circle's expertise and experience into the overall operation of proposal funding across the Catalyst Project. And perhaps endowing the Catalyst Circle with its own funds may mean alienating a body that can change for the better the way proposals are evaluated and funded across the hole Catalyst Project.  \r\n\r\nI believe that the Catalyst Circle is precisely one of the places where an efficient methodology for processing ideas can emerge.  \r\n\r\nSo, perhaps the funds are needed not to find a Rapid Funding Mechanism, they are needed for the evolution of the Catalyst Circle itself, which in its transition could teach to the hole ecosystem a better way to evaluate and select proposals. ", "q0r": 3, "q1": "-  In terms of funding, of course, they will be safe with them. But it seems to me that the implementation of the proposal corresponds to the evolution of the Catalyst Circle itself and not precisely to the search for a Rapid  Funding Mechanism.  However, the Catalyst Circle is a governance tool in our quest for governance independence.  Therefore, the exercise of providing funding to the Circle does not deviate from the needs of the Cardano ecosystem.  We need the Catalyst Circle to evolve as a decision-making body.\r\n\r\n- As with the many other proposals submitted at F7, provide information about the proponents and their work. Likewise, external links to that information. ", "q1r": 3, "q2": "Although the proposal KPIs depend on the KPIs of the proposals that the Circle would fund, please provide more clarity on your own KPIs.\r\n\r\n", "q2r": 3, "assessor": "z_assessor_541", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This proposal offers a rapid funding mechanisms specifically tuned to emerging problems in Catalyst as identified by the Catalyst circle. Catalyst improvements are one area where rapid funding could be very beneficial.", "q0r": 5, "q1": "The Catalyst Circle is evolving rapidly and is clearly committed to improving the Catalyst process. The proposed funding mechanism uses a similar framework to Catalyst and requires little in the way of technical development. The Circle should have no trouble running this experiment. ", "q1r": 5, "q2": "The Circle's role revolves around communication with the community so we can expect that the successes and failures  of the initiative will be thoroughly discussed. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 20, "ne": 2, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "The proposed solution enables targeted rapid funding deployment by the Catalyst Circle - a diverse, trusted and experienced group of community members outside of standard funding rounds. It would enable members to fund mission-critical and time-sensitive solutions faster than the standard process and aligns well with the challenge problem. As a pilot mechanism to distribute funds to time-critical community initiatives, the project offers to identify processes and protocols that could be scaled to other groups quickly and positively impact the entirety of the cardano ecosystem. ", "q0r": 5, "q1": "The team is made up of the most experienced catalyst  team members voted in by the community which points to a high likelihood of project success. The problem sensing process, as well as the proposal submission, assessment and review protocols are very well designed to accommodate for rapid and time-sensitive proposals. The budget is fine, it is important that the circle has funds on hand to tackle pressing issues that arrise. The rollover of funds is an appropriate tool to allow for future fund reallocation. Would suggest that the funding pool for each group allocation not be limited to one project only to allow for more flexibility in the allocation of funds.", "q1r": 4, "q2": "A weekly update on the use of project funds and administrative and governance processes from the Catalyst Circle and admin team at Project Catalyst Town Halls will ensure community accountability and transparency. ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 15, "ne": 5, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This is exactly the type of proposal soght by the brief. Increasing the speed of funding is critically important to allow important projects to move rapidly from volunteers to paid professionals. While volunteerism is strong in our community (and a strength), the ability to pay people for their time will accelerate and dramatically improve the time and energy people will be able to devote to Catalyst.", "q0r": 5, "q1": "These are some of the very best of the Cardano community, they have the competence and a long history of delivering value to the community. They are publically accountable and can rally additional resources at will.", "q1r": 5, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, publically auditable, and time fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 22, "ne": 1, "ng": 14, "nfo": 7, "vca_o": 1}, {"q0": "Excellent proposal. I will respectfully try to make some recommendations. The proposal meets the objectives of the challenge and meets the criteria of impact, feasibility and auditability.", "q0r": 5, "q1": "I believe that success is guaranteed, the support of the community will be the measure of the success of the proposal.\r\nIt is very interesting that there is a budget since according to the roadmap in some cases it may mean a part-time job or more. I think you have to give it an institutional framework with assigned roles and responsibilities. It would be important that when the term ends, a management report should be presented to the new members. Perhaps the new team approves the management of the previous ones, granting some type of bonus as an incentive to good management.\r\n", "q1r": 5, "q2": "I think there should be a way to audit the auditors, who controls the auditor, the community? or the new CC members.\r\n\r\nGreetings", "q2r": 5, "assessor": "z_assessor_743", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This is a great idea. The project can help speed up the disbursement process as well as solve the urgent needs of the community. The mechanism of action is clear. (Rating given : 5)", "q0r": 5, "q1": "Project progress clearly presented. The project is continuously improved and developed. No specific time has been given for the roadmap. However, the time limit for CAs to evaluate proposals is rather short. (rating given :4)", "q1r": 4, "q2": "The budget breakdown is obvious. Since catalyst circle version 2 is based on version 1, the possibility of success is quite high. (Rating given: 4)", "q2r": 4, "assessor": "z_assessor_969", "no_vca": 25, "ne": 3, "ng": 14, "nfo": 8, "vca_o": 1}], "solution": "Proporcionar al Círculo Catalizador elegido una reserva de fondos para la aplicación de soluciones impulsadas por la comunidad para los problemas declarados por ésta.", "experience": "Los miembros del Círculo Catalizador desempeñan un papel fundamental para convertir a Catalyst en el mayor fondo de innovación descentralizado del mundo."}