{"id": 381277, "author": "pgwadapool", "title": "DeepchainAda: Trustless AI training", "url": "https://cardano.ideascale.com/a/dtd/381277-48088", "category": 26247, "amount": 20000, "description": "Децентрализация федеративного машинного обучения путем обеспечения конфиденциальности для открытого сотрудничества, полезного в таких приложениях, как ИИ для поиска лекарств", "funded": 2, "upvotes": 76078901, "downvotes": 1279002, "votes_result": 74799899, "votes_cast": 329, "f6_no_assessments": 6, "f6_rating": 4.333333333333333, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=19530"], "media": [], "f6_assessments": [{"q0": "Автор предложения предлагает новый подход к изучению способов обнаружения COVID с помощью искусственного интеллекта. Автор предложения представил анализ существующих на рынке попыток решить эту проблему и объяснил, почему они оказались неудачными. Затем описывается третий вариант, который будет использовать возможности смарт-контрактов и криптографии для обеспечения конфиденциальности.\r\n\r\nСмарт-контракты, SingularityNET и NuNet являются компонентами этого предложения, которое, по словам автора, станет открытым. Наряду с информацией об авторе предложения, представленной в образовательных видеороликах, существует большая вероятность того, что это предложение может оказать большое влияние и предоставить примеры сообществу, а также пример использования, который может иметь глобальные последствия.", "q0r": 5, "q1": "Автор предложения предоставляет подробную информацию о собственном веб-сайте с контентом YouTube. Просмотрев эти видео, можно получить четкие объяснения по темам машинного обучения, Haskell и смарт-контрактов. Все эти источники дают уверенность в том, что автор сможет выполнить данное предложение.\r\n\r\nБюджет невелик, учитывая сложность проблемы предложения. Возможно, автору придется запросить дополнительные средства или завершить работу над предложением без дополнительного финансирования - это существенный риск для реализуемости предложения. Бюджет сфокусирован на требованиях к аппаратному обеспечению и не детализирует время, затрачиваемое автором предложения.\r\n\r\nВ будущих предложениях было бы здорово получить информацию о том, почему автор не включил в бюджет затраты на свое время и какие последствия это может иметь для его способности выполнить предложение. Добавив эту информацию, общественный советник сможет легко поставить максимальную оценку в будущем. Также было бы здорово увидеть профиль LinkedIn или немного больше информации о прошлом автора предложения (видеоролики на YouTube были, по крайней мере, отличным источником для проверки знаний автора предложения в определенной степени).", "q1r": 4, "q2": "С точки зрения ясности предложение отличается высоким качеством, в нем даны ссылки на другие работы и подробная информация о рынке, что свидетельствует о том, что автор хорошо разбирается в рынке и проблемной области. Представлен набор KPI, в котором подробно описано, чего должно достичь решение, чтобы быть успешным. Наряду с этапами, планом по открытому коду и низким риском бюджета для сообщества, проверяемость данного предложения высока.", "q2r": 5, "assessor": "z_assessor_758", "no_vca": 19, "ne": 10, "ng": 9, "nfo": 0, "vca_o": 2, "reply": "Thank you for the feedback. I am glad that you found my YouTube videos helpful. "}, {"q0": "Machines educating eachother by adding data and retransmitting new parameters through a peer-to-peer service could have a significant impact on the way ML is performed. Deploying this system on Mithril ensures that the influence any party can exert does not supercede the stake input by that party. All this while preserving privacy, which is important for both legal and ethical reasons. Certainly a technology that could prove its worth in the future not only in the medical field, but pretty much anywhere because of its modular nature. However, to my knowledge there has not been a release of Mithril at this time and there is no indication that this will coincide with the development of this proposed project. ", "q0r": 4, "q1": "The proposer's educational Youtube-channel is highly technical, confirming that the proposer has the technical capabilities to set up this system but it is unclear who is in the team and how many people it holds. Feasibility could be increased if this information is present in the proposal. ", "q1r": 3, "q2": "The proposal is very auditable but has overlooked something that will need a risk assessment to handle: What would happen if the input data is faulty?  \r\nAuditability could be improved by adding a short infographic image to clarify the prospected framework.  ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 25, "ne": 4, "ng": 18, "nfo": 3, "vca_o": 1, "reply": "Thank you for the feedback.\nPlease note that Mithril is not planned in the first version. The Mithril concept is mainly for keys and still under development and I cannot directly use it as Ada is not the main stake in DeepchainAda. \n \nRegarding team, I am in the process of hiring one intern who is going to assist me in this project. The intern will join in Feb-2022\n\nRegarding the Auditablity, please note that we are using NonInteractive Zero Knowledge proofs using the sigma protocols. So every party who is involved in the training will provide proof of their computation, a third party can then audit this. I am creating a detailed white paper and I love your idea of adding an infographic. I will incorporate that. Also please watch my YouTube video on security challenges. In that I have talked about lazy participants. This includes party with wrong data, or party not updating parameters at all etc."}, {"q0": "This project looks to expand and build on the various use cases the SingularityNet teams are developing and this meets the expectations of the challenge.  This project is focused on AI/ML aspects and this is growing topic of interest in tech spaces currently and could have broader impacts to spread Cardano and SingularityNet further.", "q0r": 5, "q1": "The proposer is an SPO, educator, and Haskell developer and has relevant experience both in the Cardano side of things as well as in the AI/ML learning side.  With the scope of the project and the implementation plan listed the proposal is highly likely to successfully implement the solution proposed.", "q1r": 5, "q2": "There is a section in the proposal strictly discussing the auditability of the project and describes how the project will be implemented as well as the transparency of what the total costs necessary from the funding will be.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 29, "ne": 1, "ng": 22, "nfo": 6, "vca_o": 1}, {"q0": "Developing a system where MachineLearning is developed using AI technologies (NuNet and Singularity Framework) by utilizing Cardano Smart contracts could increase use-cases on both sights. By focusing on ML also ensures that it's a self-sustaining environment.", "q0r": 5, "q1": "For feasibility, we are missing some crucial information. The plan itself is technical to a point where it's still understandable and the youtube link provided gives us clarity on how much the proposers are into this project. But what we are missing is critical information on who the team is, how many team members are they, what is the background information on them. We get some insight on this on the provided website but not enough to make a good assessment.", "q1r": 3, "q2": "Regarding the audit on this proposal, it should have no shortcomings besides the background information on the team. We get a well worked-out plan and although it seems the proposer or proposers plan to only ask for funding of the material cost.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 21, "ne": 1, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "Using the Cardano network for distributing machine learning data but guaranteeing privacy and auditability can be very useful and is a perfect example of project for this challenge so this is a proposal innovative and perfect for the challenge", "q0r": 5, "q1": "I think that the proposal is widely explained. It has lots of details and from a tecnical view it is very complete. The plan has several steps to follow it perfectly and I am sure that the person who is presenting the proposal know a lot about everything needed, but I cannot give the 5 stars because I need more specific information about the team", "q1r": 4, "q2": "KPIs are very useful and they are provided, so it is something to take into account. I would like to appreciate how to audit the success, because we only have the plan but it is not clear the final result of each step, thats is why I cannot give 5 stars here", "q2r": 4, "assessor": "z_assessor_522", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1, "reply": "Thank you for the feedback. I am an SPO of PGWAD and I constantly provide technical content in Youtube and also I have a daily tweet series on twitter about Haskell and Zero Knowledge proofs.\nI am hiring an intern who is scheduled to join in Feb-2022. So you will hear more about this project and team as we progress along.\n\nI will work on your feedback about \"final result of each step\". "}, {"q0": "Proposal describes using Cardano, SingularityNet smart contracts and DeepchainAda project to ensure Privacy & Auditability. Great proposition for connectivity while still ensuring privacy, it will open up a lot of use cases in the corporate world when it's proven. Solution stating Plutus smart contract and advanced cryptographic techniques to help Distributed Machine Learning and interface the model with SingularityNet Framework using AI DSL", "q0r": 5, "q1": "The proponent clearly states the solution and implementation plan focusing on the smart contract and the solution with video documentation and website. You should add identity, expertise, and experience that are easy to verify with the reader would be greatly appreciated. Cost 8000$ per computer, I think there is a mistake here.", "q1r": 4, "q2": "Clear milestones in 3,6,10,12 months and with KPIs to be achieved. The proponent should add some risk challenges affecting the project with solutions if any, I believe this will make the proposal more appreciated.", "q2r": 4, "assessor": "z_assessor_697", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "Использование смарт-контрактов Cardano, SingularityNet и проекта DeepchainAda для обеспечения конфиденциальности и проверяемости в ML-обучении", "experience": "Bare metal SPO, [PGWAD], разработчик Haskell и преподаватель YouTube по Blockchain+DeepLearning"}