{"id": 414393, "author": "fractalfuzion", "title": "DREP Marketing Blitz - Decentralize", "url": "https://cardano.ideascale.com/a/dtd/414393-48088", "category": 26601, "amount": 9500, "description": "Many Cardano users are unaware of project catalyst, how to be an informed voter, and the dRep role specifically. There is not enough Marketing. Lets fix it", "f6_no_assessments": 10, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"id": 1608, "q0": "The proponent is very assertive when he says that most members of the Cardano community are unaware of Catalyst, let alone conscious voters. The objective of this challenge is to make dRep's activities as diverse, coherent and useful as possible, and none of this is valid if the community itself does not know who they are and what they do. With that, the idea here is to make a kind of “marketing blitz”, as the proponent names, that is, a strong investment in publicity so that the members of the Cardano community know what dRep's are and what their role is for our growth like blockchain. It is positive that the proponent has already established what exactly the communication channels would be through which these campaigns would be disseminated (Twitter, Twitch, YouTube, Facebook and Reddit). The problem I identify here is mainly the lack of understanding of how these materials would be created. We know that the intention is for them to be fun and attractive, to be high quality and interesting. But first, what are we talking about? How does the proponent intend to create a survey on the topic, so that it can be disseminated? How would these contents be studied and elaborated? Another question I was thinking about would be in what format they would be addressed. Would they be written texts, or a mix between visual and written language? Or even videos? The same content would be posted on all social networks, or would it be adapted for each (for example, on youtube would it be a video while on facebook it would be an illustrative poster?). On the feasibility part, the author cites some formats (comprehensive videos, logos, banners, 3d content, AR, CNFT), but it is not said where each one would be published and also the percentage of them in relation to the whole (there would be more videos than banners , for example?). I wish these details had also been mentioned. If the proponent gave us more certainty about how these contents would be elaborated (how the technical part would be understood) and which design, marketing, artistic illustration strategies, etc. would be used so that they were generated in the most attractive and simple way possible, I believe that we would have even more confidence in the impact of this proposal. However, it is still an important idea that is very much in line with the objectives of the challenge, to boost the work of dRep's. Something that could raise the level of impact of the proposal would be the inclusion of some examples of materials that would be created. That way we could better understand how they would be designed in terms of design, how they would be built, and we would also have a more solid notion about the contents that would be covered in this publicity blitz. For these reasons, I will give it 4 stars because I agree with the need and urgency of what is to be done, but it lacked that some details were explained, so that we had greater solidity in the total understanding of the project.", "q0r": 4, "q1": "The project is divided into 3 phases, which from what I understand would last 1 month each. In short, I can understand very well what would be done and when, but maybe not how. I think that the vision we have of the process is very good, even solid, however some more details could be added in each of the phases so that the degree of understanding could be even more benefited. For example, in the first phase, the focus would be on creating these marketing materials. From what I could conclude with the full reading of the proposal, only the proposer would be responsible for this creation. But how can we verify that he has mastered all the techniques mentioned here? He says that he will invite some freelance artists to the project, I believe a graphic designer, so that some more specific content can be developed as well. It would be important for us to understand how these would be selected and their degree of commitment to the project. During this first month, how many hours per week will the proponent dedicate to the work, and how many will be the responsibility of the recruited artists? In the safe phase, how will it integrate and educate community advisors, how will this contact be made, how can we ensure that those involved are aware of the importance of the project? Finally, in the third phase, it would be interesting to know how the informative materials would be spread to the community, we know for when this solution is planned, but in practice it is not explained to us exactly how this would happen. Talking about financing, the asking amount is divided into a few parts. It is quite possible to understand how this would be used, but I would like to make a few observations. First, the $2,000 amount would be split between the contracted artists and marketers. However, we don't know how many there would be, nor how many hours of work they would dedicate to this project. Thus, it is not possible to have peace of mind about whether what is being asked is fair. The price of 25 dollars per hour for the proponent to prepare the materials seems to me to be compatible with the market, but we cannot say the same about the freelance workers who would be added here, precisely because we do not know their amount of time dedicated to the project. Talking about the financing of phase 2, this one did not open me to doubts. Now regarding the 500 dollars dedicated to comprehensive distribution methods, I couldn't quite understand what that would be, so if the asking amount would be adequate. In general, I think the money asked is fair, but a few more explanations would be useful to resolve these doubts. Finally speaking about those involved, we only know the proponent. From the description provided, there is a lot of confidence in him, but it would also be important for us to know about a portfolio, for example a linkedin profile, in order to verify everything that has been said. I also think it would be more appropriate if the freelance artists mentioned were already defined.", "q1r": 4, "q2": "Unfortunately, this was the topic that left a lot to be desired, because the information given is quite superficial both in terms of understanding how the development process would be monitored and the final results would be contemplated. Regarding progress, the proponent says that “it will document the number of posts, likes, comments, video views, to track engagement and make all data available to the public with full transparency”. But what data would be made available, exactly? In addition to the generated materials, how could we follow the work behind it, the production of posters, videos and the like? How can we be sure that the work routine, ie the amount of hours promised by the bidder, would be being fulfilled? How could we measure the quality and commitment of the freelance artists involved here? I think there was a lack of a view more of the daily work, a view that would provide us with an understanding of whether there were difficulties and how they would have been overcome, for example. I would like the proponent and guest artists to keep us abreast of any progress, however sensitive. I think that this feedback could be disseminated in the form of monthly reports, perhaps, through some means of communication chosen by the proponent - one of the various social networks in which he intends to work, for example, or even the telegram and discord channels already used by the proponent. community. Turning now to the final results, it would be important for us to know, in addition to numerical data, how this campaign qualitatively affected the Cardano community. Do people now know what dRep's are, what they do, their importance? How could this understanding be proven? Perhaps a field survey sometime after the marketing blitz? Overall, I think we need to know how this information about awareness of dRep's role in the project catalyst would be understood and proven. Much more study, research and depth is needed so that progress is accurately and periodically monitored by our community, and that all information is accessible; and a deeper understanding of how the proposal would be meeting the specific objectives of the challenge, such as increasing the number of dReps, working on the issue of diversity, inclusion so that the most diverse groups can be part of this initiative and that the work of these community agents is executed with quality. Unfortunately, much improvement is needed. Having said that, I believe that the auditability of the project still has a lot of improvement and deepening to be done, so that it becomes more adequate.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 13, "ne": 10, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 13692, "q0": "This is an appealing proposal to me and totally fits the challenge that it was submitted to. With the excerpt that the proposer stated “Many Cardano users are unaware of project catalyst, how to be an informed voter, and the dRep role specifically” it tackles the question of how to make the dRep more diversified. I agree with you that there wasn't enough Marketing to attract the dReps therefore it’s time to  develop tools for the Cardano dRep program, also deliver massive improvements to dRep understanding of how the program operates, just like what the proposer stated in his work. The proposal also impressed me by accidentally extending the Cardano community participants which made the ecosystem more developed more sustainably in the long run because the Cardano funcion partly based on the dRep. The proposals suggested a full marketing blitz which aimed at onboarding dRep's and explaining the incentives and strategies for success as an dRep and out reach on 5 social media platforms. I have a small curiosity about what “artistic methods” is exactly and what actions you take to explain the strategies for being successful dRep? Are they the social platform’s content including images or Zoom’s meetings? I just expect a clearer explanation of this, which would give PAs a better overview about the way you approach your target, and also suggest you to choose 2-3 platforms your target uses the most so that it would decrease resource dispersion. On the other hand, you said there would be tools developed for Cardano dRep programme and I had read 3 times just to confirm that I missed no information about the tools but I saw none so it would have been great if you have stated what tools were developed and the way they were functioned, based on which PA can justify the effectiveness of the proposal to the challenge. Every project underlies a risk and this project is no exception. I can’t agree more with the risk you have stated that would not create interesting high quality content, I believe that stating this risk means you have thoroughly understood this initiative as “Content is king”, we mainly approach our target individuals by words, therefore, it plays a crucial part in this project. However, I saw no solution for the risk, I suggest one in hope that it would help you overcome the problem. There might be senior content writers from the community, attracting them to join in this project with reward offered would be one way. In conclusion, your idea is supreme and I would give you 5 instead of 4 if these unclear points were to be explained in a specific manner", "q0r": 4, "q1": "The detailed plan is generally described with activities divided into 3 main phases and the approximate time for implementation. If the plan were to be explained precisely, from general to detail, it would be easier for me to catch up. I only saw that the first phase lasted for approximately 1 month, what about the 2nd and 3rd phase - how long would it last? I expected the first phases should include planning or implementing (if having a plan in advance). The reason I suggest planning first is because it’s vital to have a Marketing plan to clarify the purposes, the activities and KPIs, v.v for each, which keep you (and PAs) track with the plan. The one shown to me wasn’t really a Marketing plan as the actions are implemented with no specific purposes and timeline. For example, phase 1 will be started right after being funded or how long after that? During phase 2, which you stated coincided with Fund 10, but the date of Fund 10 has not yet been decided. I believe that the project should start right away after Fund 9 because it takes effort to raise people's awareness. Next, let’s talk about the activities included,  “set up interviews,... as many platforms and community groups and members as possible.”, “as many'' is how many, I suggest a limited number to focus the resources on. There are only 2 members in your team therefore doing as many tasks as possible will lead to overload. With the budget breakdown, a total amount of 9.5 thousand dollars is requested, which is suitable with the complexity of the project. However, there weren't  specific platforms to tackle so I wonder how you exactly divide for each platform and on air time based on this “40 hours of platform distributions - 20 hours of on air time”. On the other hand, I expect you count pensions based on fee/task to increase the transparency. The tasks you included in your proposal are quite diversified therefore I suggest you recruit more members, each specializes in one specific field to maximize the effectiveness of the project. In terms of the members involved, you are experienced in Cardano blockchain under various positions: stake pool operator, Cardano community member, catalyst community advisor and one of you has experience in MKT, in this way both the technical parts and the design, marketing etc will be well assured. My only 1 suggestion regarding this part of the proposal is: everyone would attach their linkedin profiles or anything I could check your authenticity. Above all, I still appreciate your effort so much.\n", "q1r": 3, "q2": "Regarding the development of the process, I congratulate you on having some indicators that can say well about the progress of the proposal itself: number of posts, likes, comments, video views, to track engagement which I believe are easy to measure by the tools of the platforms themselves. Moreover, I expect you to state the link in which all data is available to the public with full transparency so there will be more trust given by the community. With the successful scenario you mentioned, it is outlined quite perfectly, as I can see from the following excerpt: “Success would mean to have a robust marketing strategy that captivates the audience and increases awareness about the dRep role in project catalyst.”. The proponent states that such information must be measured, but again, it is unclear how it will be counted and measured. I just suggest you clarify your definition of “a robust” marketing by quantitative data and when you reach that point, success seems to be clearer. I think that the proposal is quite auditable, it just needs to be clarified with the community Cardano can actively participate in this auditability. Thank you.\n", "q2r": 3, "assessor": "z_assessor_3750", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 977, "q0": "#General\n\n(+-) Problem statement very broad but insightful and shows the proposer knows about gap between Cardano and Catalyst communities\n\n(+) relevant experience matches the requirements and past activity (without funding) is quite good! Presence on all social platforms\n(whereas almost all activity on Twitter).\n\n~~~\n\n# Impact\n\n(+-) How helpful the content will be for the dRep program will come down to how eloquent knowledgeable, patient and mindful the participants (of interviews, in discussions and live streams) are.The content not only needs to be engaging, fun, but also informative and solution oriented /actionable, since dRep role is still in design phase.\n\n(?) How can marketing Blitz be designed if full dRep functionality not yet completely defined?\n\n(+) The proposed marketing Blitz is all encompassing and massive with interactive and live elements like twitter spaces and twitch streams.\n\n(++) Publishing all content under CC license is healthy for the community and the commons.", "q0r": 4, "q1": "(+-) Good general timeline overview, a bit confusing because milestones are\ntied to specific events, but not further\nspecified. For example: \"as Catalyst Fund 10 concludes\" what precisely, the voting, the vote results, or the beginning of F11?\n\n(+) Budget breakdown sufficient for amount of funding and at $25/h very inexpensive labour for good quality work.\n\n(++) The team is a perfect fit for the job.\n\n(+) No additional funding required,this proposal is looking for funding for a turnkey marketing Blitz.", "q1r": 4, "q2": "The Auditability of the content production (progress) is quite clear, as it will all be publicly available, however measuring the quality or impact is what really counts in regards to auditing (success).\n \n(-+) It's mentioned what will be tracked, but not how often measurements are taken and where the data will be displayed\n(-) no KPIs for a marketing campaign is highly unusual, as there's a ton of data available. However this can and should be done in the first preparation phase. Thus doesn't impact the overall auditability score too much.", "q2r": 3, "assessor": "z_assessor_2170", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2773, "q0": "\"by introducing and creating videos and documents related to dRep, in order to serve the community to understand and participate, this proposal will also solve part of the problem that the challenge requires,\n   \n  The main objective of this proposal is to focus on Marketing, to introduce the community to the voting process and its importance, and to choose to operate primarily online, through platforms. , Youtube, Twitter, and Facebook in addition the team also claims to provide: logos, banners, 3D content, AR, CNFT, but the presentation is still not convincing enough for what the team has proposed. stated in this summary presentation,\n  * I have a few suggestions with this proposal: the proposed team needs to state specific content for marketing videos, or other intentions that the team commits to provide such as banners, content 3D. In addition, the group needs to clearly determine where the target audience of each region is, because it is a referral marketing problem, if you want to expand the world, the group needs to have a plan for supporting language barriers. language. the above are my suggestions hope the team proposes to accept them,\n  \n     accept the proposal's commitment to create quality content to attract, in order to reduce the risk of the problem that the proposal has mentioned, but I would like to add a little more that is: recommend should plan for their own community platforms to help explain and guide them through the basic steps of entering our ecosystem, and most importantly, for them to understand the importance of voting. \"", "q0r": 3, "q1": "\"The proposed team provides a plan to implement this idea that will consist of 3 phases, and specifically state each of the things that will work and complete them within the specified time, but I have this question that I would like to propose a solution to. Like to help : We will design all marketing materials including Full video, logo, banner, 3D content with these statements of proposal then, team will deliver these products On what platform, as far as I know, the team has no plans to operate directly, or do traditional marketing, so will the team provide them on such social networking platforms as appropriate and promote them to the fullest? its functionality brings no, as banner slogans will be very suitable for traditional, and on-site marketing,\n\n   in the budget section the team can provide some extra space for example 160 hours for the Art of Preparation / marketing material / Video, so the team needs to add more explanation of the marketing material. its content, and how many videos will be produced in this 160 working hours, this is a very delicate matter so the proposal needs to be as transparent as possible and more detailed to get a good rating. good price.\n   \n      team info i found all i wanted from the team here: https://fractalfuzion.com/?page_id=15, however the two members you mentioned have not mentioned their experience yet fit for this job,\"", "q1r": 3, "q2": "\"Because the proposal will develop online marketing content, it is also very easy to moderate the progress of the proposal because they are displayed on all the most popular platforms, their and community.\n   The success of the proposal determines that the marketing content and number of members of the community will be properly aware of dRep, and participate in the election. \"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 2979, "q0": "well, this one was very easy to read and to assess. This proposal effectively addresses the challenge with direct targeting of current challenges in the dRep delegation. the project proposal activities are directly aimed at onboarding dRep's. not jus onboardind but onboarding of quality dRep's. this project will do so with various marketing strategies and will be focues on educational and promotional purposes. project proposal, in my own opinion lacks educational moment on WHY should community be more engaged in dRep programme and should address that aspect as well. it can not be conluded from it as it is written in few words but recommentation for project implementation phase is that: explain what it is in for the community since creating interesting high quality content just may not feel enough in order for community to engage, the community needs an answer why. ", "q0r": 4, "q1": "feasibility and implementation of the project will be smooth. just by reading about Fractal (person behind the project) and his working experience in the marketing field says that the project anticipates no obstacles.  project consists of educational and marketing activities combined for optimum performance given the Cardano intention to maximise dRep present and future involvement. it is very fortunate that Fractal will record all the information about the campaign providing materials for the community. budget is clear and aiming for the quality and efficiency.   ", "q1r": 5, "q2": "the way it is described in the project proposal, audatibility is a strong point of the project. it is a brand new proposal and will document number of posts, likes, comments, video views, to track engagement. since inclusion of dRep's is a rather new thing, I would personally love ti see in F10 continuation of this project since Fractal presents himself as a good marketing expert. previously I mentioned about reasons that project should give more reasons why it is good for community to be engaged as dReps, and Fractal might have provided a hint to that: foster innovation, creating decent jobs in the environment and entrepreneurship. I think these should be focal points of the education activites of the project. once again, a good project proposal for Fractal. ", "q2r": 5, "assessor": "z_assessor_2377", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5053, "q0": "The challenge is to bring large numbers of people into leadership roles. \n\nThis proposal is for marathon-long public spaces to educate the community about opportunities and benefits of being a dRep. This is a great approach as potential dReps will come from a variety of backgrounds, have a variety of schedules, and will need to hear the call to action several times and phrased different ways. \n\nCreating a regular, reliable hub with live help would be great. ", "q0r": 4, "q1": "The proposal has a lot of vague ideas about CNFTs and tokens for faucets. This is a different approach than holding space and allowing people to listen and ask questions. One is very hands-off, and one is hands-on. \n\nThere is mention of recordings, but no sense of how many spaces will be held, or for how long. No mention of how the schedule will be designed, as far as accommodating different time zones. \n\nFractal Fuzion is well known as being well meaning and well intentioned. It is not not clear from this proposal, but they attempted a marketing blitz for Proposal Assessors for Fund 8 and kicked off a week of marathon twitter spaces. No more spaces were held. This was very disappointing to at least one proposer who was looking for guidance. \n\nThis experience does not speak well for the success of this project. \n\nThere are 2 proposers mentioned, but no information about the partner. This information is sorely missed. ", "q1r": 1, "q2": "There are some objective numbers to form a good matrix to track progress. Also, the overall division into phases seems thoughtful. \n\nThese measures do not really address the goal of the challenge which is to bring in more people. Some measures of people engaged would have gone a long way here.", "q2r": 3, "assessor": "z_assessor_2669", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 5997, "q0": "Regarding the idea of the proposal, I think it is quite positive when proposing a solution that is to build a strategy to introduce dRep through social networking platforms such as Youtube, Twitter, Facebook. The goal is to let more people know about dRep's role in Catalyst, attracting more people with experience including community building and project evaluation experience. This idea fits perfectly with the challenges that \"dRep improvement and onboarding\" presents.", "q0r": 5, "q1": "In my opinion, the feasibility of this proposal is average because of the reasons we will consider the following:\n- Number of project members: here the proposer only mentions 1 member who will carry out this project. The proponent also stated that they will use his/her friends to help, but this needs to be clearly defined at the outset before proceeding with the project. Because when we can fix the number of participants from the beginning, we can divide the work for each person in the most reasonable way. Therefore I have a suggestion that the proposer should add here the specific number of people and their information\n- About the budget: the proposer has listed all the costs involved for implementation, but there is still a case of risk due to ADA price fluctuations. This will affect the cost when you do the work. Therefore, I suggest that the cost plan should be added to the cost plan for risk due to price fluctuations", "q1r": 3, "q2": "I consider the auditability achieved by this project to be only average because of the following aspects:\n-The proposal does not specify how a roadmap to be implemented will take place. I mean there are no milestones to show the success of the project yet. A successful example of a project is when the 1st month has published #number of interview or discussion videos. The 2nd month published #number of posts on social networking sites. Therefore, I advise the proposer that these metrics should be added here so that the progress of the proposal can be assessed.\n-The information of each member does not really have a proof of relevant experience. I mean should add links to personal profiles like Linkedin or personal Facebook so that the community knows who humanity is.", "q2r": 3, "assessor": "z_assessor_2771", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 6850, "q0": "This proposal addresses a key issue within the challenge – public outreach for dRep program. It seeks to fulfil dRep diversity, dRep count and participation rate goals by spreading information about Catalyst and its dRep system. It is simple and well articulated. Solution is also scalable with additional funding and will generate material for future outreach use.", "q0r": 5, "q1": "Proposer provides evidence about their expertise in similar projects. Budget is reasonable and quite detailed; amount of necessary workpower is laid out. Provided plan is quite general but covers all the parts needed to complete it. Timetable is realistic as the project itself is quite simple. Proposer outlines major risks to proper completion (boring content), but doesn’t provide means of mitigating said risks.", "q1r": 5, "q2": "Proposal lacks a clear roadmap. Although main goals are set, no specific deadlines for goals are given. It has a clear definition of success, however KPIs are set in a very general manner (engagement, views, like). It would be preferable if a number is given so that success could be properly measured. Proposer commits to making said KPIs and data available, but doesn’t provide any means to check it in the proposal.", "q2r": 3, "assessor": "z_assessor_2836", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9799, "q0": "The proposal incentive is to bring more awareness to the role of the Drep. The proposal here is requesting funds in amount of $9500 to create and  promote a marketing blitz to reach out to the community in a fun and engaging manner. The proposals impact would reach out to the community via social media outlets and could reach an exponential number of Cardano community members as well as new members looking to Cardano as framework for new governance roles. The outreach that social media outlets hold are on a global scale and acessable to *most* . The content created as open source allows the community to use the educational information in many different ways. the creativity of the proposal suggests that the intentions are to make the infomation fun and engaging. \n\n", "q0r": 5, "q1": "The experience of the Proposer FractalFuzion is that of personal and community growth . The proposer is welcoming other artistic vision to help facilitate the growth of knowledge about the Drep . FractalFuzion developed a dynamic campaign per previous funding and has potential to deliver again, representing another part of cardano governance. The community is welcoming to such campaigns via social media outlets as that information is sharable and can outreach to members globally .", "q1r": 5, "q2": "The information provided in regards to audibility is tracking mechanisms through social media outlets. Number of views , shares, likes all represent engagement with the campaign. The timeline for delivering the campaign is accountable using a month for properations to the incentive of the campain as well as a roadmap to use time during the FUND 10 challenge prompts and is adressed in 3 phases, PREPARATION, MArketing BLItz, and documentation. THe proposer suggests to transparancy throughout the Marketing campaign .", "q2r": 5, "assessor": "z_assessor_3098", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 13997, "q0": "The requirements of \"dRep improvement and onboarding\" challenge are met by this proposal as my viewpoint and evaluation. The proposer is quite clever when he has taken advantage of social media like YouTube, FaceBook, etc. which are most popular and attract a lot of users currently. Thus, it would be an effective marketing strategy for introducing dRep via these popular social media platforms. The aim is to provide valuable education and guideline for the current users as well as the new potential users toward dRep’s role in Catalyst. Thereby promoting the improvement of the Cardano community as well as the number of novel projects sent to Catalyst and attraction of more people to contribute to the growth of the community. ", "q0r": 5, "q1": "I am quite disappointed for the presenting stuffs in feasibility. Due to the provided information about team’s members and, the request budget, this proposal cannot be considered as commitment for a high possibility of success. Thus, it impacts a lot on the possibility of the proposal and the expectation of voters as well. First, this is not a difficult or high requirement on skills of manipulating data or programming but it’s a complicated project and requiring tasks are much more than our imagination. The number of users on those platforms is definitely in an enormous range and the managing those data will need a lot of efforts. Moreover, to achieve the effectivity and productivity as the KPI of the proposal, there should be various ideas, opinions to guarantee about the creativity of the marketing strategy. However, there is only one member that will participate and conduct the project. This would be not enough since creativity should be involved and contributed by more than one viewpoint. If there is only one person, that would be the subjectivism. Although the proposer has his/her friends supported, this requirement needs to be considered again about its possibility and the proportion of success as well as errors during the process when there is just one person, and the errors or problems are unpredictable. Moreover, as I said, this is quite a fascinating idea about creating a new strategy and I can claim that if it is just a hand, there would be a small puzzle not the whole picture. Because, when you build a model on your own, you would see only your perspective and there might be some biases as it’s your product. Thus, I think there should be more team members. No matter how outstanding you are, work in a team would go far and farther instead of going alone. So, I do recommend that two or three more people cooperate in such a wonderful proposal would raise the value up a lot. Also, at the beginning, we can freely choose our own teammate and come up with the final list to ensure with the organizing committee and then conduct the project smoothly since a list of people with a specific job in the workload is planned already. Hence, I do hope the proposer can consider my recommendation and supplement the information of added members whether you agree with my point. By the way, about the budget, although the proposer has included almost all the costs that might occur or absolutely occur during the conducting process, some potential risks are able to happen, as I analyzed above. It will impact the budget allocation for each task of work. Therefore, I hope the proposer can reconsider about the suggestion and add if he may change his mind. ", "q1r": 3, "q2": "In this part, it is such a pity for this proposal. First of all, there requirement is asking for a detailed progress, but the provided answer is in general and did not state much about the targeted objective. There are some unclear points in this proposal like the specific “route”, KPI number, etc. so that the voters can estimate quickly and easily the possibility of the proposal. We prefer a timeline that indicates for us which important milestone is showing the success of the project. In other words, the proposer should mention his expecting number that would reflect the effectivity of the proposal. Also, I suggest that a criterion for measurement to better evaluate the proposal progress would enhance the benefit in auditability for the proposal. For example, he could offer to provide the community a statistical report about the actual number of views or posts’ reactions and then the voters can base on those number then make their evaluation and compare to the initial implied numbers. ", "q2r": 3, "assessor": "z_assessor_3870", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "A dRep marketing blitz is needed to promote understanding of the roles responsibilities and highlight the incentives.", "experience": "I was a community advisor in F7, F8 and also one for F9. I am a stake pool operator, CNFT artist and active community member. I am familiar with marketing for Cardano projects and would bring an artistic, entertaining, and fun marketing campaign to raise awareness."}