{"id": 414407, "author": "jo8n", "title": "💧 Democracy Means Everyone is dRep", "url": "https://cardano.ideascale.com/a/dtd/414407-48088", "category": 26601, "amount": 100, "description": "https://docs.google.com/forms/d/e/1FAIpQLSfPSb_cDlIxN6cnnbOrJN_oxDBmxB3kENbsE__pmMAw8yJk0w/viewform", "f6_no_assessments": 7, "f6_rating": 1.380952380952381, "videos": [], "media": [], "f6_assessments": [{"id": 5658, "q0": "The proposer failed to indicate the problem it intend to solve. Aside that, there is no detailed description of what the proposer intend to do and how to accomplish it. However we can infer from the title the goal —the objective is to ensure Drep role must be accessible to all without limitations. But I suggest the proposer provide a detailed description here.\n\n", "q0r": 1, "q1": "The information provided is not sufficient to prove how feasible the project is. The information on roadmap, budget and team experience is not provided in the attached document provided. Therefore it highly unlikely the project would be executed. ", "q1r": 1, "q2": "The attached document provided to extract data on the auditability of the project, lacks the details on the metrics required to measure the progress and success of the project. Aside that there are no milestones as well. Therefore, I think the information provided to audit the project is not sufficient.", "q2r": 1, "assessor": "z_assessor_2734", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1, "reply": "Hahaha it's undeniably 5 stars, I list the form to be a Drep, which many have not seen."}, {"id": 5998, "q0": "Although I tried to open all the attachments provided by the proposer, unfortunately, I could not find any information about the content of this proposal. The \"dRep improvement and onboarding\" challenge aims to support the diversity of dRep practitioners from different countries and languages. Increase the amount of dRep for Catalyst. And if the proposer has ideas related to these indicators, please do not hesitate to present them to the community for the best additional comments.", "q0r": 1, "q1": "As I suggested in the Impact section, if you have an idea please don't hesitate to provide the advisory community with clarity. Provide information about how you implemented the idea. The tasks that will need to be done are clearly listed in the implementation schedule. In addition, the project owner wants to propose a budget of how much and specifically what will be paid for each job. These are all extremely important information to help the project owner implement the idea in the most successful way.", "q1r": 1, "q2": "In terms of auditability, the following information will be important for you to visualize how successful your idea is:\n- We will have milestones to measure each work progress.\n- The number and criteria that your idea solves the challenge posed.\n- Clear description, easy to understand the problem. How will the solutions address the goal.\n", "q2r": 1, "assessor": "z_assessor_2771", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1, "reply": "Hahaha it's undeniably 5 stars, I list the form to be a Drep, which many have not seen."}, {"id": 14981, "q0": "This is not an actual proposal as it does not contain any information at all, except a link to the DRep enrollment form: https://docs.google.com/forms/d/e/1FAIpQLSfPSb_cDlIxN6cnnbOrJN_oxDBmxB3kENbsE__pmMAw8yJk0w/viewform.\nScore: 1.", "q0r": 1, "q1": "As mentioned earlier, this proposal contains nothing except a link to a form and hence there is no feasibility to analyze. I disagree it can be implemented. Score: 1.", "q1r": 1, "q2": "The same applies to auditability as well. There is no information pertaining to this category. I completely disagree the project can be audited. Score: 1.", "q2r": 1, "assessor": "z_assessor_2335", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15014, "q0": "I assume Proposer questioning about everyone availibility for dReps registration in the Project Catalyst. This proposal just \"copy-paste\"-ing dReps Registration form on every sections of the proposals. I think it's his way to protest about it. From the comment section we can see that some Catalyst member asking if Proposer already watch dReps recorded introductory workshops or read the Summary from our Moderator (Daniel Ribar).\nHis motivation for making this proposal is that he has the opinion that DREP should arise naturally in Project Catalyst. Meanwhile, this role has just been introduced in Fund 9 and will be tested in Fund 10. Project Catalyst is an experiment and there is nothing wrong with experimenting with this role of dReps. Although some member agree that everyone should be a dRep, this role is open (at the moment) for everyone. In my opinion, this should not be a proposal. Proposer could open a conversation about this topic in Discord / Telegram group about this role.", "q0r": 1, "q1": "There is lack information about feasibility in this proposal since Proposer mentioned his motive in comment section that he just want liquid democracy in Project Catalyst for everyone can sign up for this dReps role (which everyone can sign at the moment, actually).\nThis proposal don't have any information about Team (and experiences), budget breakdown or roadmap because Proposer just want us (Catalyst members) aware of democracy Proposer believe should be implemented in Project Catalyst.\nNext time, if this kind of important topic appears--not just Proposer but for every members here--better we bring up to our Discord or Telegram group to start a conversation about this.", "q1r": 1, "q2": "It should be auditable if it becomes a project. With example metrics like:\n- number of Catalyst members aware and agree with this kind of Democracy\n- number of Catalyst members aware and then apply the dReps role\n- number of Catalyst members approved to be dReps\n\nBut, since Proposer didn't want to make this topic into a serious project and only copy-paste the \"dReps Sign Up Form\" it could not be publicly audited by community.", "q2r": 1, "assessor": "z_assessor_2553", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15015, "q0": "The purpose of this proposal is stated in its title : \"Liquid Democracy Means Everyone is a dRep\". The proposal also contains the link to the google form for becoming a dRep. \nThe proposal does not include anything else than this goal to have everyone becoming a dRep. If successful, this proposal would be aligned with challenge criteria to ensure  many and diverse dRep participation. \nHowever the proposal does not describe and articulate a solution to reach this goal. Impact: 2", "q0r": 2, "q1": "While the goal is at least described in the title, no solution is described to reach it. I understand that the proposer aims a massive adoption and spread of the dRep role. Providing the link to the application form is a good start, but the proposer could also describe the dRep role, offer interactions with the community, and ways to increase the number of applications. Feasibility is scored 1, as basically no solution is described.", "q1r": 1, "q2": "As explained in the two previous sections, this proposal does not include a plan, and a clear definition of the steps to reach the goal stated in the title of the proposal. If funded, even considering the very low budget of 100$, there is no way for the community to monitor the progress of the proposal toward his goal. Auditability : 1", "q2r": 1, "assessor": "z_assessor_2264", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15036, "q0": "Since there is no proposal, only a copy-pasted link in every single part of the project’s description, it will be difficult to elaborate a formidable assessment. \n\nI would kindly suggest the author use actual words instead of spamming the dRep registration form link, it would be greatly appreciated.\nThe impact will be non-existent if we assessors can't figure out what the proposer is trying to accomplish, and the only thing that could make the proposal look aligned with the challenge would be the title. Personally, I would have used the term “can be” instead of “is”, in the title, because not everyone wants to be a dRep.\nSo: 💧 Democracy Means Everyone can be dRep  would sound pretty good to me.", "q0r": 1, "q1": "The feasibility is impossible to evaluate, and I tend to ask myself: how did this proposal pass any filter? \nReading this proposal, one is entitled to wonder: is the author a troll, or does he need guidance?\nDown the comment section, we can read that the proposer does not agree with the way dReps are “selected” and it is also stated: “I haven't had time to watch all the dRep recordings” \nHow can one disagree with something he/she doesn’t really know about?\nMaking a proposal in a challenge we disagree with, and do not really know about, looks a little bit counterproductive in terms of feasibility.\n", "q1r": 1, "q2": "Once more, it will be impossible for the community to follow a project that does not exist, sadly there is nothing to audit, except one thing: the fact that one can’t be a good dRep without even deigning to use well-crafted sentences.\nI really hope the proposer will come back with a solid proposal next time, and that he can find his way in our community.\n", "q2r": 1, "assessor": "z_assessor_2138", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15282, "q0": "The entire proposal consists only of the title and the link to the official IOG dRep sign-up form.\n\nI’m not going to give it a score of 1, because by making the official sign-up form more readily available to those participating in Catalyst and by writing a title that encourages people to sign as a dRep this proposal actually may have had some impact on the diversity of dReps and the willingness and ability of people to sign up - exactly what this challenge is about.", "q0r": 2, "q1": "I won’t evaluate if the proposal is feasible to be implemented because obviously the project has already been implemented by the submission of this proposal. The proposal is the project.\n\nOther assessors might choose to see this proposal as a troll or a joke, but we can also think of it as a piece of performance art, created with the intend of making a statement and having an impact on the dRep process. Besides that it can also reveal things about the Catalyst process itself, about how it reacts to the proposal in all of its stages - PAs, vPAs, voters and ultimately IOG.\n\nThe requested budget for the proposal is $100. There are 3 co-proposers, meaning that in the eventuality this proposal gets funded the budget will most likely be split between them at $33.33/person. I’ll leave it up to the voters to decide if it’s worth paying that amount from the treasury for this effort, that’s why I’m neutral on this section, and my grade reflects that.", "q1r": 3, "q2": "Have you read the proposal, perhaps even accessed the form?\nThen it means that the project has already been completely and thoroughly audited, because the proposal itself is the project. There is nothing more to add. No more milestones or KPIs to present to the community, everything is already in front of our eyes, totally transparent.\n\nAlso, because the proposal itself consists only of of a title and a link it could not be clearer, and after all this section also grades clarity.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "https://docs.google.com/forms/d/e/1FAIpQLSfPSb_cDlIxN6cnnbOrJN_oxDBmxB3kENbsE__pmMAw8yJk0w/viewform", "experience": "https://docs.google.com/forms/d/e/1FAIpQLSfPSb_cDlIxN6cnnbOrJN_oxDBmxB3kENbsE__pmMAw8yJk0w/viewform"}