{"id": 416276, "author": "jo8n", "title": "Everyone Start With More 👏", "url": "https://cardano.ideascale.com/a/dtd/416276-48088", "category": 26601, "amount": 100, "description": "I ran out of 👏 to give. The Popularity ranking in Ideascale is wrong and sorts based on who put up a proposal first. dReps need accurate, accessible measurement of community sentiment.", "f6_no_assessments": 5, "f6_rating": 1.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 4433, "q0": "Clearly Proposer have misunderstanding about the new dReps role. I think there's no correlation about kudos given, popularity ranking and dReps. The campagn brief clearly explained their focus on this Challenge are decentralization and functionality of the Catalyst. So the more Kudos (👏) Ideascale users have will not achieve any of those focus.\n\nI believe dReps have their criteria to choose & vote quality proposal for their delegators.", "q0r": 1, "q1": "About the Feasibility point, there's nothing I can check the list except the $100 budget. There's no references, project's timetable, team experience.\n\nProposer want a little Ideascale change with those \"more Kudos (👏)\". As far as I know that the Ideascale platform is a third-party platform, I think proposer can reach out to some important Catalyst members who can connect Proposer to the Ideascale devs.", "q1r": 1, "q2": "Same with the Auditability point. There's nothing except: \"I will show this proposal if funded to whoever controls Cardano's Ideascale settings and ask them to change it.\"\nI think proposer should not create a proposal for this kind of action, instead try to communicate with other members on Discord / Telegram / Cardano Forum, etc.", "q2r": 1, "assessor": "z_assessor_2553", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 5662, "q0": "Per this proposal, the author has a well captured problem that could probably improve the general idea behind giving kudos to proposal when addressed. But the proposer presented very little  description of what it intend to do to address the problem. In respect of that, I think this proposal doesn’t align with the overall objective of the proposal. Therefore the project does not address the challenge.\n", "q0r": 1, "q1": "The information provided on the roadmap, budget and team experience shows that, the project is not feasible. I wish to see more details on how the team intends to get this project implemented its roadmap , team experience and budget.", "q1r": 1, "q2": "The information provided to audit the project is insufficient. It’s clear from the onset that, the overall project needs to be refined to include a detailed information on project description, roadmap and possibly the parameters for the project to enhance the possibility of been funded.", "q2r": 1, "assessor": "z_assessor_2734", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 10063, "q0": "A proposal that your project makes is still unconvincing issues related to blockchain technology. Today's developed society entails every area of   advanced technology, all we need is to bring ideas and knowledge about Cardano blockchain. with communities across the country.\n- When I read your project information, I am completely unable to provide items to meet the demand for cardano blockchain.\n- you need to provide enough information and your ideas to contribute to the development of the cardano blockchain ecosystem, experiences that all members of your project need to present clearly and specifically to can contribute to the vitality of the project.\n- I disagree with the impact of this project.", "q0r": 1, "q1": "- When planning a detailed project for a project you need to outline a clear and specific way to increase the development of the project you give.\n- For a project to increase transparency, the most important thing is that the budget is published detailing what needs to be spent to develop the project better.\n- You need to provide personal information of each member of this project, it will contribute to increasing trust in the project.\n- I disagree with the feasibility of this project.", "q1r": 1, "q2": "- You should clearly present your problems and ideas to help track and monitor the progress of the project.\n- A successful project or not requires a high level of transparency. I recommend giving the project some information about the idea. and all project member personal information links. That will be easy for catalytic funding this time\n- I do not agree with the audit of this project.", "q2r": 1, "assessor": "z_assessor_3146", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"id": 12494, "q0": "The proponent writer first made a problem statement that was subjective and had no solution to his problem. The information the writer shares does not bring positive value to the Catalyst community. To back his position, he should provide valuable information or solid evidence for the proposed problem and solution. The second is that he does not provide relevant skills and experience information to ensure the proposal is implemented. The author himself does not know the feasibility and suitability of the project.", "q0r": 1, "q1": "The proposal does not provide any information regarding the skills and experience required to implement the proposal. The proponent does not have an implementation plan or budget table. Therefore I have to rate 1 star for this part.", "q1r": 1, "q2": "Similar to the above sections, the proponent does not provide any valuable information to illustrate the transparency of the project. This is a really bad proposition and I strongly disagree with the attitude of the proponent.", "q2r": 1, "assessor": "z_assessor_3425", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"id": 12717, "q0": "The Proposal correctly addresses the Challenge Topic of \"dRep improvement and onboarding\" when it proposes to add a more \"accurate, accessible measurement of community sentiment\" to the Cardano Catalyst Fund.\nJO8N's idea of providing additional ranking criteria for the Cardano Catalyst Fund Project is out-of-the-box and helpful. I agree with him/her that there should be several criteria for a project to be ranked by the audience for all projects to be properly evaluated.\nWhile the additional ranking criteria added to the current system can be helpful, there is not enough information provided on the proposal for us to judge if his/her idea is good enough to be implemented. There are many things to be considered when carrying the idea, starting from a well-prepared plan to good execution. None of that can be assessed given the current state of this proposal.\n\nThe proposal, if properly planned and executed, can be implemented for a lot of other ranking systems and criteria within the Cardano Eco-system in particular and other Eco-systems as a whole. However, we do not have enough information to determine this given the overly insufficient information given by JO8N.\nFor the above-mentioned reasons, I give this Proposal an average 3/5 score for Impact.", "q0r": 3, "q1": "While the b identified at USD100, there are not many cost items to list out given the total proposed budget for the project is also USD100. Technically, JO8N has provided clear and identifiable cost items for this project.\nHowever, I don't have enough information to determine if the proposal can be feasible or not. Proposer JO8N lacks the devotion to eon elaborate on his/her Project and present it to the audience with more details, hence I can only give him a low score. I think that he/she should at least tries to intrigue readers with some information about his/to order to make his/her proposal more believable.\nFor the above-mentioned reasons, I give this Proposal a 1/5 for Feasibility.", "q1r": 1, "q2": "There is only 1 cost item within JO8N's proposal, and it is to pay for human labor. I find this pr auditable with only 1 cost item.\nHowever, the KPIs of this Proposal are not listed, therefore there is no way anyone can assess the success/failure of this project. As a Cardano Analyst, I give this Project a low score due to the Proposer's lack of effort to prepare a well-thought-out plan.\nJO8N's solution is not specific and detailed, and the Team's profile is not given. It looks like this person is working alone, which gives little room for brainstorming and counter-ideas.\nThere is no reporting system proposed in this project.\nAs a result, I give this Proposal a 1/5 score for Auditability.", "q2r": 1, "assessor": "z_assessor_3470", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Everyone Start With More 👏  and present the proposals according to actual Popularity in Ideascale. Right now, the popularity ranking is wrong, for it ranks according to who put up a proposal first.", "experience": "Project Catalyst participant."}