{"id": 416409, "author": "crazy.brain", "title": "Supporting LATAM's dReps", "url": "https://cardano.ideascale.com/a/dtd/416409-48088", "category": 26601, "amount": 9980, "description": "Many LATAM dReps will have difficulties in carrying out their task due to the gap between their native language and English, resulting in under-representation.", "f6_no_assessments": 9, "f6_rating": 4.592592592592592, "videos": [], "media": [], "f6_assessments": [{"id": 52, "q0": "Latam community has shown a lot of interest in helping improve the system and community projects. While this proposal request budget to make groups sustainable, we can already see the work being delivered and new members onboarded to Cardano's vision through this. We need a proposal like this to make drep role as global as possible and imbue as much collective knowledge as we can.\n\nHaving these guys back while dreps come up with new proccsess and guidelines will make more impact than just translations. Clarity questions and color to documentation is also important.\n\nIf the official document amount is lacking, I am sure the team is willing to translate community initiatives", "q0r": 5, "q1": "This Latam team has proven they are capable of delivering on the proposal.\nI think they have over-estimated the number of documents they will translate, but better safe than sorry.\n\nThe process has been done before and is only waiting for documents to be translated.", "q1r": 5, "q2": "Project progress can be tracked through an application where I think all the translations and to-be-translated files will be organized.\n\nIt's not mentioned but Im sure all the translation versions will be shared through different community channels and also included to offcial IOG repositories.", "q2r": 5, "assessor": "z_assessor_2035", "no_vca": 24, "ne": 0, "ng": 15, "nfo": 9, "vca_o": 1}, {"id": 484, "q0": "The proposal solution to translate dRep \"institutional documents\" into Spanish and Portuguese answers the call of the challenge well. While the outputs of this work is seemingly intended to directly impact Spanish and Portuguese speaking dReps, the proposal does an excellent tying this back to the delegator the resulting indirect impact. \n\nThe proposal mitigation instincts is clear and makes sense--the proposal stand a great chance of achieving the full intended impact. ", "q0r": 5, "q1": "The proposal detail clear milestone targets. They expect to translate 50 documents and will return fund if less than 50 \"institutional documents\" is available for translation. A monthly cadence spanning four months have been detailed with number of documents that should be translated during each month. The budget is pretty straightforward with four detailed line items. The team are not only native speakers but also have experience with translation work within Cardano already. I have every confident this proposal will be completed... just one question though:\n\nWhat are institutional documents? I think I know but the proposal does provide a definition. Still a five star proposal nonetheless. ", "q1r": 5, "q2": "The proposal plan to provide a public appsheet for the community to follow along and track translation with some clear metrics they will be tracking internally. Would have been great hear how the community might be able to track \"How many LATAM dReps require your documents.\" This is also true for the other two metrics, how will you share this information with the community? ", "q2r": 4, "assessor": "z_assessor_2098", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 906, "q0": "Lack of available resources in other languages is a hindrance that needs to be solves for Project Catalyst to reach more areas of the world. This proposal tries to tackle this problem by translating and providing frameworks of translation for documents of Catalyst (Catalyst school, Catalyst circle...). The way they contribute to this challenge is by specially, but not only, focusing on dRep documentation. This is great since not only does this proposal align with the strategic objectives of fund9, but also with this specific challenge.\n\nTranslating Catalyst documents will result in more people from different backgrounds entering this space, which subsequently will provoke an increase in all areas, such as delegation rate or number and diversity of dReps. As a native Spanish speaker, sometimes it’s hard to convey to other people how governance in Cardano is organized, and I also recognize that people who don’t speak English find it impossible to learn about how this system works due to a lack of content in their language, that’s why I find this proposal particularly interesting and beneficial.\n\nA plan for future scalability is also mentioned, and it involves the growth of the Cardano ecosystem and the involvement of LATAM as a whole. If successful, this project could also expand to other regions of the world, which in my opinion is a logical next step.", "q0r": 4, "q1": "The team in charge of carrying out this proposal have the skills needed in order to succeed. Enough evidence is provided in the form of LinkedIn accounts as well as a web page where all evidence of the previous work can be found. Regarding the team, it is great to see that many of them have participated as CAs, VCAs and have funded proposals, as this means that they know the Cardano ecosystem and also have experience in Project Catalyst. It’s also good to see that the number of translators which will work on the project is also listed.\n\nWhen it comes to the budget, it is broken down into 4 elements. Two of them consist of document translation in Spanish and Portuguese, and ask for $3750 each ($0.05 per word). Considering the average cost per word of translating from English to Spanish is in the range of $0.09-$0.13 (depending on if it’s a general or technical text. Source: GTS Translation Services), the amount requested in this department seems more than reasonable. The other two elements are repository development and project management, which also ask for a reasonable amount. On another hand, the proposal states that future funding will probably be needed in order to keep supporting the Spanish and Portuguese Cardano communities. Perhaps the team could explain if they plan on requesting funding indefinitely or if the project has a determined lifespan.\n\nRegarding the roadmap, this project will last for a period of 4 months and will translate a total of 50 documents. Considering the amount of translators who will be working on this, this timeline seems realistic and justified.\n\nFinally, there are two possible risks listed and some solutions which can be effective to mitigate them. For example, in the case of possible overload of documents, a priority order for translation would be established. This solution effectively addresses the problem and also serves as a guide to translate the most important documents first.", "q1r": 5, "q2": "The milestones for this project are the translation of a determined number of documents for each month of the project’s duration. This makes sense, since translation is the main focus of this proposal.\n\nRegarding metrics, the team have chosen 3 which align with the project and are efficient at tracking success. That being said, perhaps they could clarify how they are going to measure some of them. For example, one of them measures how many dReps require the translated documentation. Some more information on how will they keep track of this would be helpful, but nonetheless the metric serves the purpose.\n\nFinally, it is important to mention that the voters will be able to follow all the progress through “appsheet”(a public channel), which is a great thing for people who are interested in seeing how this project evolves.", "q2r": 4, "assessor": "z_assessor_2151", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4914, "q0": "Although dReps are still a ways off (and therefore perhaps this Challenge should have been approved for the next Fund rather than this one), as the Challenge team indicates, \"(1) dReps must be diverse, and (2) there should be many dReps. Failure to achieve (1) and (2) is centralization\". In this regard, translation/interpretation services ensure that Catalyst not become a centralized experiment, and when it comes to highly unequal regions such as LatAm, where English is not a predominant official language, Spanish and Portuguese are key to inclusion of the regional diversity and the many fine people that may act as dReps for the community as a whole. Otherwise, we risk that dReps end up centralizing decision and delegation within a Euro-centric frame of mind, which lacks the necessary sensibilities to the developing country regions where Cardano prides itself on focusing for the economic development of the world as a whole.", "q0r": 5, "q1": "The team comprises key members of the LATAM Cardano Community and even EMURGO Academy, such as Sebastian, and as such already have a long history of engagement with Catalyst and Cardano, providing translation services for Latin American proposers for several Fund iterations now. They are also still working on proposals funded in previous editions, and have alternative proposals to support Latin Americans within Cardano in general and Catalyst in particular. This ensures that their continued service to the community is beyond doubt.", "q1r": 5, "q2": "As a project with a a 4-month completion period, during which the proposers will translate into Spanish and Portuguese 4 documents (average: 10 pages each) for the first month with an estimated increase rate of 30% per month, according to a specific detail, the total 50 translations they intend to achieve constitute an easily verifiable series of products to track the progress and measure the success of the proposal. ", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5663, "q0": "Certainly education is key to increasing participation on the drep role. But how do we introduce the drep role to people with different language background? In my view, supporting Latam’s drep initiative could bridge this gap. The end goal of the initiative is to have accurate translation of all proposals from and into English into the two predominant languages in Latin America as soon as possible, contributing to the LATAM Dreps onboarding. The value addition to the ecosystem is cited as, helping to scale up the growth in drep participation. In that respect, I agree absolutely that this project fit the objective of the dRep improvement challenge setting. Apart from that, I see this project becoming the starting point in translating English based drep materials into several languages. This would certainly foster awareness creation on drep, improve the accuracy of delegate decisions and increase participation in the drep role. I only suggest to the team to create more awareness on the project when is completed so as to make more Portuguese and Spanish speaking communities aware of the materials.", "q0r": 5, "q1": "Is the project feasible? Starting with the analysis of the roadmap, we ‘re presented with a concise yet precise information of the activities expected along the path to project completion. The more revealing details here  is that, these activities are time bound with specific milestones to be achieved. On team experience,  we understand from the profile presented that LATAM is a well recognized brand within the ecosystem and with a track record in terms of project execution, as per the link provided. However, I suggest the team consider assigning roles to each team member so as to ease the implementation process. Aside that, I see a team of 4 translators from the team with attached links that confirms their expertise. I believe these experts would be relevant to the project. With regard to the budget, my knowledge of market prices of these items is that, the amount for these items are a reflection of the market value. We would conclude on the basis of these information that, it is likely the project will be implemented.", "q1r": 4, "q2": "The proposer has presented appropriate information to audit the project’s performance but these information could be improved. Based on the extensive information made available on the feasibility, it is possible the information provided can help audit the project. We have enough KPIs here, in my view, the only thing that could be better specified is how the Cardano community could have access to such information. As important as providing ways to monitor the project, it is necessary that we know how to carry out this monitoring. We know that the team provides a link regarding the metrics, but will they always update this site? How often would it be updated? How would the Cardano community be aware of the updates, when attached? Would any member of the team let you know through the Catalyst general group on Telegram?\n", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5822, "q0": "One of the problems this challenge seeks to address is the diversification of dReps. To get this diversification, dReps should be able to have training resources edited to suit the languages they are fluent in and can easily understand.\nThis team suggests that they will translate relevant deep documents into Portuguese and Spanish to be able to give information to delegates in these areas in a more understanding language. In this case, the judgment of delegates will not be affected by language barrier. \nThis may lead to more Latin Americans showing interest in being dReps since there will materials for training. ", "q0r": 4, "q1": "The team is comprised of members who active participants in several Cardano activities. I believe their cumulative experience should give them an upper hand in executing this task. There are relevant links to their individual experience and skills, an impressive one relative to this project. They have set the project milestones within 4 months and the roadmap is clear, easy to understand and executable. \nThe proposers also present a comprehensive budget and indicate that any surplus from the fund will be returned to the community. \nThe fund requested is reasonable I think.\nI suggest the team gets a system for intensive proofreading by other language scholars to ensure quality of work sine this is a very sensitive area is the Cardano ecosystem. \nOn a whole, this project is implementable. ", "q1r": 4, "q2": "This proposal includes key performance indicators for easy trailing of the progress and to ensure reporting to the community. The success metrics are also presented simply and measurably. The budget is also detailed to ensure accountability for the funds requested. ", "q2r": 4, "assessor": "z_assessor_2754", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 6394, "q0": "The proposal does a good job at describing the language barriers many Latin American citizens face when participating on international governance mechanisms. For a decentralized, global network such as Cardano, it is of vital importance to be as accessible as possible to as many regions of the world as possible, and this proposal represents a signifcant step forward in the inclusion, through better representation, of countless people in Cardano's governance and future.", "q0r": 5, "q1": "The budget requested is reasonable and the translation schedule seems achievable for a core team of five people who, in turn, are well-versed on the Cardano and Project Catalyst spaces. However, I do have one concern, especially for the long term, that I believe it would do this proposal well to clarify: The proposal doesn't include a maintenance plan for the doc repository, which could be determinant to its impact. Particularly, I believe it would be helpful to include how the proposal will address the recurring need of updating documents as Project Catalyst/Cardano adapt their governance mechanisms, and in what platform will this repository be hosted for better accessibility and navigation.", "q1r": 4, "q2": "The proposal is easily auditable, as it includes a detailed schedule of the total translations that will be completed on a monthly basis, although I think it would be necessary to have the documents peer-reviewed by an external party after comlpetion. The success metrics are also interesting and well chosen, although I would like to see which data-collection method will be used to determine how many LatAmdReps require the documents and how it will be implemented.", "q2r": 5, "assessor": "z_assessor_2815", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 13593, "q0": "The issue of language differences has always been a big issue for Cardano in terms of user scaling. I like the author's idea of ​​how to help dReps in Spain and Portugal who do not speak English access material in their native language to help them fully understand the mission and role of dReps. Help new members who want to become dRep have the necessary knowledge and skills to fulfill that job.\nI also have a lot of trouble reading documents in English and have to use Google translate a lot. Many times, Google translated documents make no sense and cause unnecessary misunderstandings.\nI believe this proposal is necessary to help Spanish and Portuguese speaking members more interested in the dRep job position. Helping to solve the challenge of diversifying dRep in many countries instead of concentrating in just a few countries.\nThis recommendation was very helpful and I give it 5 stars because of its potential.", "q0r": 5, "q1": "The information the author provides about team members and links to their personal profiles on Linkedin is very detailed and complete.\nLooking at the jobs and tasks that this proposal takes, I find that the author and the research team have all the necessary skills to complete this proposal with ease.\nRegarding the presentation plan, I don't think it's detailed enough, other contents need to be added. For example, what topics will be translated? This needs to be made clear so that when the proposal is funded, the author and the team will immediately start implementing it. Instead of wasting time figuring out which articles we need to translate. That will prolong and delay the proposed implementation roadmap.\nTopics you can refer to for example: What is dRep? Roles and responsibilities of dRep? How to make dRep work?\nThose are a few suggestions from my personal side, hoping to help the author and the team in making a list of content to translate.", "q1r": 4, "q2": "In the presentation of solutions to avoid risks. The author did a great job and had a perfect plan.\nIn the end, I think they need to add some of this content.\nThey should build a document repository of translated documents on a website or on google driver, notion. This helps the reader to view these documents in sequence and easy to understand which increases reading efficiency and saves a lot of time. Imagine, if you threw all this material on some media channel, it would be like throwing a whole bucket of messy documents for someone to read. What a disaster for a must-read.\nIn addition to the above comments, I do not see the need to add much, all the information is very complete. I believe, the author and their team will do well with the proposal if supported by voters and funded by Catalyst.", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13657, "q0": "The proposal is a necessity to provide information and documents about dRep to the Cardano community in Spain and Portugal.\nWithout these translated documents, members who want to participate in dRep will have a lot of difficulty in studying to become a good dRep. The proposal addresses the requirements of the dRep Diversity Challenge.", "q0r": 5, "q1": "I see the author and their team of 5 people with very complete profile information. They are people with a lot of experience in translation and have been with Cardano for a long time so that it is not difficult to translate Cardano's confusing technical words. So I don't see how they would have any trouble completing this proposal if it were funded by Catalyst.", "q1r": 5, "q2": "The information provided by the author and the team is presented in great detail. I only regret that I wasn't able to click the link on Notion to see what they've been up to before.\nMaybe they should learn from the experience for the next time they write a proposal, put the information in a document or put what they do on a powerful platform like Google.", "q2r": 4, "assessor": "z_assessor_3718", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "We'll build a workspace to translate Catalyst institutional documents into Spanish and Portuguese and save them in a repository developed for this purpose and easily available to the dReps community.", "experience": "Members of the Cardano LATAM Translator Team have over 4 years of experience translating English, Spanish, and Portuguese, as well as over 2 years of researching Cardano Catalyst and CA/PA experience. Since 2022, we've been actively contributing to the Catalyst ecosystem."}