{"id": 416737, "author": "antoine.cathalau", "title": "Documentary on Cardano's governance", "url": "https://cardano.ideascale.com/a/dtd/416737-48088", "category": 26601, "amount": 12230, "description": "Few people are aware of the potential of blockchain governance", "f6_no_assessments": 9, "f6_rating": 3.8518518518518525, "videos": [], "media": [], "f6_assessments": [{"id": 53, "q0": "I don’t think we will get much value out of this proposal at the current state. And it's only in french too. You should stick around and put something small together if you are interested in the future to get funded for documentaries because I think the potential is here, but not quite in this particular role right now.", "q0r": 2, "q1": "I would like more from the plan. No plan was provided, but through a detailed budget breakdown, it looks like they know what they are doing. Just not writing that to the Proposal.\nWhere and how feedback and resource are collected?\nWhat strategy is used for screenwriting?\nWho are you interviewing, or how did you find them?\nWhere do you release and announce deliverables?", "q1r": 3, "q2": "There is quite a lot of hours distributed to different kind of work categories, but there is not much information available where we can see the results. Also looks like no feedback cycles are built into the proposal, so it's basically a black box of a proposal.\nWe send money and wait for the final product.", "q2r": 3, "assessor": "z_assessor_2035", "no_vca": 26, "ne": 1, "ng": 15, "nfo": 10, "vca_o": 1}, {"id": 479, "q0": "The documentary creators are clearly qualified in making documentaries. Great!  The goal of diversifying Dreps candidates to include French speaking community suggests greatly needed impact. Other intended goals are reasonable \"Attract people interested in the challenges of innovation in governance\", \"Promote culture around these questions\", \"Explanation of the role of Dreps.\"\n\nHowever, there are weak points in the proposal. Beginning with lack of any  indication of the producers own knowledge of the subjects - dReps and Blockchain Governance. As content editors, the point from which they begin deciding on the material to be presented is unclear. \n\nLittle if anything is settled about Blockchain governance. Dreps being the most recent exploration in uncharted territory. \n\nFor example, it can be said that governance = politics. One goal of the documentary is presenting a \"Perspective on the history of democracy, and how the Voltaire Era on Cardano is opening a new chapter in it.\" Does that history present democracy in a favourable light? Or emphasise failures? Is that perspective in favour of democracy, or against it?\n\nLess clear is the benefit coming from the ways they will source information \"Interview of one or more catalyst personalities\" and \"one or more Dreps candidates.\" Those perspectives are 100% subject to editorial control. \n\nThe proposal does not give confidence to suggest that those opinions will reflect the reality, community opinion and or state of the topics. Dreps remains uncharted territory. There are as many questions about the system as there are possible directions.\n\nEven Townhall presentations (a source mentioned) only introduce the subject from an extremely high level, without really getting into the details (which are not yet worked out).\n\nYet in general, I support the idea of funding videos that expand community understanding of blockchain governance. And offer information in languages other than English. My comments about the weakpoints are meant to be food for thought for the proposers.", "q0r": 4, "q1": "The proposers inspire great confidence that they can produce a beautiful video. But without any discussion of the topic itself, it is unclear that the video will shed meaningful light on this blurry topic, which is presented as the bottom line objective.", "q1r": 4, "q2": "Editorial control is entirely in the hands of the documentary producers. As in the other ratings, not knowing anything about the producers knowledge of or understanding about Dreps and blockchain governance, their position on democracy, the research process (to decide content) makes the progress and success of the proposal unclear. \"This documentary will help to attract a new public to Cardano’s governance and the DREP role, including people passionate about governance innovation.\" Hence 4 stars not 5.", "q2r": 4, "assessor": "z_assessor_2095", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 5664, "q0": "This is a more educative  initiative that intends to onboard more people into the Drep role. As the frontiers of the Cardano ecosystem keeps growing, especially with the introduction of drep role in the governance phase, more needs to be done to reach a larger audience on the potentials of the drep role in addressing the challenges that confront the voting process. The proposal here is to “… create a documentary that will explain and illustrate the possibilities of blockchain governance. It will serve as a pleasant and motivating introduction for anyone to learn on this subject”.  I envisage that this project would interest a lot of people about the Cardano ecosystem and potentially onboard them into the DRep. However, from the script, it is difficult to identify who the target audience for this project is and the strategy to attract them to watch the documentary? Is it for existing members or new members. And, what’s the long term strategy? Per the information presented, this project is a one time event, with documentary video lasting for only 10-15 minutes. In my view, providing a short video documentary without a specific target audience may not make the expected impact indicated within the project. In my opinion, the video could be short but the event should not be a one time event as there may be questions to be asked on concepts within the documentary by whoever the audience may be. Therefore, I suggest the proposer presents a more refined version of this proposal that reflects a long term strategy, marketing strategy and a specific target audience. \n", "q0r": 3, "q1": "The likelihood of this project being implemented depends on the roadmap, team experience and the budget presented. Let’s start with the team, the proponent presents 3 member team with expertise in production and screenwriting, graphic works and administration and editing and interviews. Will these expertise be needed here? Without  a doubt, for every movie or documentary production these expertise plays key role. Therefore, the experience and expertise of the team would be relevant to the project. However, how do we confirm the credentials of Antoine and Claire in the absence of relevant links to their profile? I suggest the proposer consider the inclusion of such details. Apart from that, the budget also presents to us the overall cost of the project, with specific allocations to all identifiable item. However, the overall budgets is a little high considering the purpose of the project. I think some items need to reconsidered. I would cite a few examples to explain this point. Why would music cost $750? Is that the average amount? Why is communication be necessary when there isn’t a marketing strategy here? Assuming there was, i would have agreed with the amount allocation. In all, I think the proposer has a good idea but the total budgetary allocation with respect to the overall project doesn’t reflect the actual market value. Apart from that, the roadmap gives us what to expect with the next 3 month after funding. It's very concise and precise.\n\n", "q1r": 3, "q2": "Ultimately, the expectation here is that, by virtue of the roadmap, the budget and the team experience, the project should successfully be implemented to achieve the project’s objective. However, the proposer failed to present any significant milestones for the roadmap to guide the auditing process.  Aside that, there isn’t a well defined parameters to measure the progress and success of the project . To add to that, even if there was, we’re not informed whether feedback from the progress report would be available to the catalyst community for their perusal.", "q2r": 2, "assessor": "z_assessor_2734", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6851, "q0": "Proposal identifies a problem within the challenge (public outreach for diverse and thriving dRep ecosystem) and provides a clear solution (professional short documentary/educational video) that would help alleviate said problem while bringing value through exposure to whole Cardano ecosystem.  ", "q0r": 5, "q1": "Proposer demonstrates other high quality videos as evidence of their expertise. Required work is laid out. Even though I personally can’t fully evaluate budget needs for filmmaking, nothing stands out as out of the ordinary given proposers location. Budget is clear and broken down into parts, with a realistic timetable. Potential risks are accounted for and mitigation discussed.", "q1r": 5, "q2": "Roadmap is very general, milestones and KPIs not specified, although given the end result (a video), it might not be necessary. A commitment to auditability is given “We will apply the traditional framework of audiovisual project management, in which every phase of production is clearly identified within a time frame”, but no details provided. Also, there’s a lack of KPIs directed at distribution and later engagement of created content, which in turn makes auditability harder. ", "q2r": 3, "assessor": "z_assessor_2836", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8187, "q0": "The team addresses a valid problem that there are few people aware of the potential of blockchain governance. Their solution to create a 10-15 minute documentary to educate about cardano's blockchain governance is creative and impactful. This documentary with be in French with English subtitles and will explain the possibilities and roles within blockchain governance. The community members will have the possibility to release this film in other languages which would further help with diversity, catalyst participation and dRep onboarding. ", "q0r": 5, "q1": "I really enjoyed the beautiful cinematography in the links. The teams skills and experience are impressive. I do not see someone on the team with blockchain or cardano community experience. For me it isn't a deal breaker but I hope the team knows who to interview to get the most accurate and clear representation of cardano's blockchain governance. The budget is broken down, clear and seems reasonable, also the team would not require future funding. The given milestones and timeline seem feasible.", "q1r": 4, "q2": "The team gives a clear and understanble solution to their problem statement. They also provide a clear roadmap with milestones. My only suggestion to help tracking and auditbility of this proposal is sharing the completion of milestones such as screen writing completion, upcoming interviews, ect with the cardano community. Success of this proposal will be a documentary that helps educate and make the public aware of block chain governance and roles that will help onboard more people to catalyst voting and dRep participation.", "q2r": 3, "assessor": "z_assessor_2963", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8858, "q0": "There are lot of reasons why people fear to participate in cardano eco system, some of them might be slip in the price of ADA or insecurity related myth of wallet , etc.  There are lot of people who are still unaware of cardano's governance, on how the cardano has decentralized most of its governance to its wallet holders as dReps, hence to develop a documentary and present it to audience is a great idea where people can get clear picture on how cardano's governance works, this can also boost the audience to be a member of cardano society in the future, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "It is not an easy task to develop a documentary and make it to reach the people, because creating documentary holds many tasks where it should involve geniune facts and should collect information from all the people who have participated in cardano projects, the other difficult task is how the proposer wants to reach the people in most unique way so that maximum audience can get engaged with his videos.\nThe proposer has decades of combined video creation experience where he has even showcased some of his past tasks which shows that the proposer has proven experience , Hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit has clear goal of making documentary and clear the myth's of people related to blockchain governance, it has already readymade topics presented on which the documentary building should commence with,\nThe audit has even presented the work of proposer from past which is definitely great which displays , the proposer has proven experience, the audit has even introduced other team members who have experience in script writing, editing, graphic work etc.\nThe audit could have added timeline still more effectively and has provided decent budget breaking idea , hence with given experience and task the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9329, "q0": "I find it a good idea to make a documentary, which makes Cardano more accessible to everyone. I also like that the movie is only 10-15 minutes long. This makes sense because this time will help keep people from getting bored and sleepy. With vivid images and sounds, it will make it easier for everyone to understand and quickly. You should also come up with a method to make the documentary accessible to everyone, such as posting information on social networking sites, announcing in domestic and international Cardano groups.", "q0r": 4, "q1": "I still want a more detailed plan. Your project lasts 3 months so I think you can divide the plan by week to be more specific. Regarding team members, I have not seen you have expertise and experience in the blockchain field as well as a deep understanding of Cardano. I see you only have expertise in the field of art content creation, filmmaking, video creation...", "q1r": 3, "q2": "\"The proposal does not provide clear insights into how the community can assess progress and success.\nThe proposal includes a clear description of what you want to happen. In terms of success, I agree with you, besides there is another specific measurement that can be added that you can measure the number of viewers, create a survey for those who are interested to see the level of the audience. Public understanding of Cardano, the number of positive responses...\"", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 12570, "q0": "The problem raised by the proponent is in line with the social situation, Not everyone is aware of the potential of blockchain governance. Currently, cryptocurrencies are considered a place for speculation and NFTs. The public remains largely unaware of the governance innovation that will benefit Cardano and Catalyst. The team's solution was to create a documentary that would explain and illustrate the possibilities of blockchain governance. Envisioned as a quality documentary that is both entertaining, educational, and aesthetically pleasing. It will capture the extraordinary nature of what is happening on Cardano. The main topics:\n-Prove links between governance and blockchain. Management ambition (internet country).\n-Attracting those who are interested in the challenges of innovation in governance...The 10-15 minute movie duration will not make viewers feel bored, and especially the language is French with English subtitles. I completely agree the proposal is suitable for the challenge.", "q0r": 5, "q1": "The proponent has provided information about the project implementers, each project implementer has its strengths. The team consists of 3 members including Antoine Cathalau, Production & Scriptwriter. Antoine is a project designer, mixed media artist, and meditation teacher...Claire Pichelin, Graphic work & Administration, Claire is another co-founder of Suki publications. She has over 10 years of experience developing multimedia projects, and creating art, video, and marketing content. Last will be Rémi Nelson Borel Editing & Interviewing. Rémi is a professional video director. He is the founder of La Forge aux utopies, his video production company. The team provided a clear detailed budget breakdown, the requested budget amount was $12230. The proponent has also given a rather vague plan, I can tell the project will be done in 3 months and in each month there is work to be done, however, if the proponent can divide it In more detail, for example, in 1 month, what should be done each week and then each week will summarize to see if the work has been completed well? then summarizing the whole month, I think if we can do that, the project will be even better. The proponent also pointed out the risks involved in undertaking the project, the main risk would be to make a documentary that could soon be out of date, considering Catalyst's fast pace of development. But aside from that the proponent also provides solutions to address this risk. in general, I think the feasibility of this project is quite good but with only one small problem, I hope the proponent can give more consideration to my suggestion.\n\n", "q1r": 4, "q2": "As mentioned in the feasibility, the implementation schedule of the project to achieve success will be 3 months. The success of this project is to create a beautiful and inspiring film that makes it easy for us to understand the huge potential we see in Catalyst and Cardano. A great success is that the public is aware of this potential and vision so that many candidates from different backgrounds can be interested in joining the movement. With the above information, I am fully capable of assessing the auditability of this project.\n", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 13430, "q0": "Having a 15-minute length documentary showcasing the heart of Cardano’s Governance System and dREPS is certainly the way to go. It’s obvious that I’m in love with the idea but more importantly let’s review the proposer’s details. \n\nNot only that the proposer has stated a viable solution but this was also done it elegance. Proposer was right on the ball in saying that crypto is seen as a mere investment speculation rather than a true technology game changer. We could relate to this every time we encourage someone close to us to get in to crypto. Focusing in governance would definitely open the public’s eyes on what crypto (Cardano) can offer. \n\nKey themes mentioned shows not only familiarity of the proposer to the said topic but also what is required to for the audience to fully submerge their heads in this “decentralized governance” idea hence dreps. These also gives us a glimpse on what we should be expecting out of this documentary, content wise. Certainly, Interviewing Catalyst personalities and Dreps candidates allows the audience to relate with the experience of working for a decentralized system. Though it would be good to highlight the rewards for such activities as I see this as a main attraction for audience to participate.\n\nHaving this released under CCO license enables the community to freely use this on their presentation and in other educational platforms (at least not commercially). This allows a wider reach of audience. \n\n Future proofing the content by means of using first principles (rather than dwelling on the current state is definitely a good way to maintain value of this production overtime. I could see this as a standard learning material in years to come.\n", "q0r": 5, "q1": "Timeline provided from start to completion of the documentary is 3 whole months. Each month is dedicated for each phase of the production. Proposer gave us a list of activities for each phase. While budget doesn’t clearly mention how many people will be working per category or if there’s overlap of resources, it does gives us an idea on the man hours spent for each. \n\n\nAll 3 personnel have their own expertise and track record to support their skill. As a video editor myself working for school research documentaries I’d say a combination of Screenwriting-Directing, Graphic Work, Interviews and post prod edits will fare well. Some prominent youTubers does all of this by themselves so true test of quality is still based on the output video itself. In light of that I highly recommend our voters to check their work. It’s great that sample projects are linked. Upon reviewing them I could say that cost is reasonable for the production quality (samples provided have good transition, well balance soundtrack – especially on showing amenities, good lightning for image capture of outdoors). It would have been better though if a similar length production sample was shown/highlighted as this would increase our confidence as voters. \n", "q1r": 4, "q2": "I agree that watching the finished product is the best indicator that the project was completed as promised but this doesn’t change the fact that as part of a funded Catalyst Project the community reserves the right to be able to track and monitor its progress. I highly appreciate that a reliable project management approach will be used but all this activity seems to be only visible from the inside. I understand that CCO license would only apply on the finished product hence looping in the community to have access to your inner works/footages/materials/scripts is not ideal but we should find a way to keep us posted. We’d love to know from the get-go on which platform we should expect the documentary to be released, and if you have plans in possibly sharing clips or teasers along the way? I feel that’s a good compromise.\n\nAnd lastly, I would recommend to track the reception of the film as well. Perhaps the numbers of viewers and reviews/feedbacks. At the end of the day there’s nothing more important than the number of eyeballs this film gets. \n", "q2r": 3, "assessor": "z_assessor_3644", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create a short documentary to explain what is the role of DREPS and more globally what are the ambitions of Cardano's governance era", "experience": "Decades of combined video creation experience (you can see some of our realizations in the relevant links section)"}