{"id": 417166, "author": "jo8n", "title": "Condense PA/VPA Into New dRep Role?", "url": "https://cardano.ideascale.com/a/dtd/417166-48088", "category": 26601, "amount": 100, "description": "PA/VPAs are redundant roles now with the new dRep role?", "f6_no_assessments": 6, "f6_rating": 1.0555555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 1287, "q0": "Unfortunately, the aim of the proposal is not clear, and it appears that it was not supposed to be proposal at all, just an idea how to propose a change and request a feedback. The problem is not described and the solution is stated in a form of a question. The risk part is filled, and it is stated, that Pas or vPAs are not required to vote on the proposals they assessed, but no follow up is linked to it. Many parts of this proposal are left unspecified and open for interpretation. ", "q0r": 1, "q1": "There is no roadmap, and the requested budget is 100 USD for writing the proposal. Regarding the team, the leader is “Me” but no linkedin or bio is posted, so it is hard to evaluate. I am afraid that this proposal is not feasible.", "q1r": 1, "q2": "The problem-solution is not described, and there is no information to assess at all. The proposal is quite hollow, and was intended to start a discussion, therefore no KPIs or audit tools were disclosed. ", "q2r": 1, "assessor": "z_assessor_2222", "no_vca": 21, "ne": 0, "ng": 16, "nfo": 5, "vca_o": 1}, {"id": 4436, "q0": "Proposer wrote this proposal to get some attentions about his concern about dReps. Since dReps were introduced by IOG as a concept (source: https://iohk.io/en/blog/posts/2022/04/11/introducing-the-concept-of-delegate-representatives-dreps/). Because Project Catalyst \"is an experiment\", so was dReps. Every Fund in Project Catalyst always have some improvements on it, so we hope dReps will have some improvements if they have to. And Proposer could tell his concern in some kind like Town Hall or to Catalyst Circle or something like that.", "q0r": 1, "q1": "Proposer wrote \"I'm just putting the idea out there to see if anyone else has constructive feedback.\"\n\nAnd me personally think that this is not appropriate media to have a discussion about Proposer's concern. Maybe IOG / Catalyst already created Discord channel or Telegram to discuss this dReps concept. Proposer may try to find it and reach out the community in there channel / group.", "q1r": 1, "q2": "Proposer wrote \"PA/VPA role condensed to dRep role.\"\n\nThis 2 kind of roles are totally different. PAs is assigned with assessing several key points in the proposals submitted at Catalyst. On the other hand, dReps' job is to vote on quality proposals submitted on Catalyst. So I think PA/vPA roles can't be condensed to dReps.", "q2r": 1, "assessor": "z_assessor_2553", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 5665, "q0": "The proposer identifies an existing problem that could help improve the current system if addressed. However, the proposer failed to provide a detailed description of what it intend to do to address the problem. On the basis of this, I think this proposal doesn’t align with the overall objective of the proposal. Therefore the project does not address the challenge", "q0r": 1, "q1": "The information provided on feasibility is very inadequate. I wish to see more details on how the team intends to get this project implemented its roadmap , team experience and budget.", "q1r": 1, "q2": "It’s clear from the onset that the information provided by the proposer, the information on auditability is insufficient. Therefore, the overall project needs to be redesigned to include a detailed information on project description, roadmap and possibly the parameters for the project.", "q2r": 1, "assessor": "z_assessor_2734", "no_vca": 21, "ne": 0, "ng": 11, "nfo": 10, "vca_o": 1}, {"id": 9966, "q0": "Does the proposal raise the issue that PA/VPA is now a redundant role with the new dRep role? dReps can provide greater transparency and community through reviews with live proof verifying their votes.\n\nIn my opinion, we should keep separate roles because of decentralization and separate evaluation, if we combine all the roles into one person or a group of people, I think decentralization. the middle is against Cardano's philosophy. In my opinion, the voting dRep is good and PA/vPA pooling is not feasible.\n\nThe project's solution is not clear, so I don't understand if the solution is the solution or not if it can be explained clearly.\n\nI will give the project 1 point for impact", "q0r": 1, "q1": "The project only called for 100 USD, so the project owner did not specify specific spending items\nThe project owner has not provided clear roadmaps and information related to the information of project participants has not been provided.\n\nso I will give the project 1 point for feasibility", "q1r": 1, "q2": "The roadmap has not been provided for the project, the audit methods are not written so I cannot evaluate\nMy advice for the project is to do it step by step as best as possible\non audit calculation, I will give the project 1 point", "q2r": 1, "assessor": "z_assessor_3139", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 10066, "q0": "-Aggregating the information your proposed project offers is not enough to convince the cardano blockchain development goal. As today with rapid development, the community's demand for blockchain is increasing rapidly. The problem here is that it is difficult to bring new users closer to the cardano blockchain. That's why drep projects need to make suggestions aimed at developing cardano for the community easily. than.\n- When I consulted your project, it completely failed to meet the information needs and development goals for the cardano blockchain community.\n- I recommend you need more evidence to come up with convincing ideas. In addition, you should add evidence of a level of experience and expertise to facilitate building the foundation of this project.\n- I disagree with the impact of this project.", "q0r": 1, "q1": "- a project needs a clear and detailed development plan to add vibrancy, that will easily create quality products for the cardano blockchain technology industry.\n- To increase transparency. The most important thing is still specific and reasonable capital allocation details to contribute to the development of your idea.\n- You need to add the details of the member's personal information and add project-oriented information to the cardano blockchain.\n- I disagree with the feasibility of this project.", "q1r": 1, "q2": "- When the project needs you to provide progress information to deliver quality products. You need to provide more details about the idea.\n- When an excellent project requires high transparency. So you need to provide enough information about the development idea as well as the personal information of each member of the project clearly. Specifically, this will confirm the development of this project, creating more credibility for the catalytic funding.\n- I do not agree with the audit of this project.", "q2r": 1, "assessor": "z_assessor_3146", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 12497, "q0": "The problem statement of the proposal is an unfounded question and is indirectly denied by the PA and vPA to the Catalyst community. Because the problem statement is not clear, it is difficult to evaluate the solution that the author proposes, so the proposal has not shown the positive value it brings to the Cardano/Catalyst community.", "q0r": 2, "q1": "The proponent could not give a detailed plan of the proposal and asked for $100 in public money to write the proposal and the writer's answers were of no value illustrating the viability of the project.", "q1r": 1, "q2": "Because there is no plan for the implementation of the project, through the assessment, I found that the probability of the project being implemented is almost 0, so the writer of the proposal also has no KPI to measure the progress or success. of the project. A budget of just $100 for proposal writing doesn't make sense either. Therefore, I strongly disagree with the auditability of the proposal", "q2r": 1, "assessor": "z_assessor_3425", "no_vca": 12, "ne": 1, "ng": 6, "nfo": 5, "vca_o": 1}], "solution": "dReps can give greater transparency and community through assessments with proof of life that verify their votes.", "experience": "Project Catalyst participant."}