{"id": 421204, "author": "chrisaiks", "title": "dRep Awareness Creation", "url": "https://cardano.ideascale.com/a/dtd/421204-48088", "category": 26601, "amount": 11000, "description": "\nLow participation rate in catalyst voting.\nEnglish Language barrier by some voters, posing a challenge in analyzing and voting for over 1,200 proposal\nLow technological skills to set up voting App\n", "f6_no_assessments": 10, "f6_rating": 4.433333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1076, "q0": "The proposers intend to create a series of awareness events to promote the new role of dRep across the African continent. I find this proposal to be very well within the challenge parameters as well as have a positive impact on the Cardano and Catalyst ecosystem. As probably the participation in the voting process is quite low, especially due to the English barrier, having these events and workshops would engage a larger number of community members to delegate their voting power. Probably a large percentage of holders would participate more if they were to have the time, the language and technical knowledge to analyse proposals and vote for them.\nFor a better impact, I think the team should have been more specific when mentioning “The proposal seeks to host online and physical events to create awareness”, as the African continent is too large to not clearly define the location and the language of these physical events will be held in.", "q0r": 4, "q1": "The team has devised a solid plan for the implementation of the proposal. It stretches across 12 weeks, starts with a Kick-off meeting and ends with an online educational workshop on dReps.\nConsidering the task at hand, I would have suggested adding an extra week or two at both the beginning and the end, as to permit some time to prepare beforehand, and afterwards to have some time to analyse the developments and draw a conclusion.\nThe budget itself is sufficiently detailed, it seems to be covering both the personnel cost as well as venue costs, from my experience it looks feasible and reasonable.\nThe team description is very well written. There is adequate information about every member of the team, and each has provided a Linkedin account profile. From what I could gather, they seem to be very competent, and as such, I have no doubts about their capability to implement the proposal.\nAnother missing piece of information that should have been answered, as required and detailed in the submission form, was some details regarding the proposer’s other submitted proposals in Fund 9, as they provided a positive answer to the specified question.", "q1r": 4, "q2": "The KPIs offered for tracking the progress look reasonable to me. The number of people participating in dRep onboarding, number of people participating in talks with the dRep, increase in the number of delegators etc. are specifically tied to their efforts and as such, it would demonstrate the state and possibly also the success of the proposal. What I most like in this section, is one of the sentences describing the vision of success “as the number of people understanding and participating in dRep and contributing to quality decision-making and increased awareness of dReps”. To me, that shows that the team understands the importance of dReps and doesn’t want to only achieve high numbers to have another item checked on a list, but they intend to build quality relations with passionate people, for the betterment of the community. ", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 2850, "q0": "\"to motivate members of the community and introduce to explain to them the importance of voting, and to support members who own ADA but do not have the time and understanding of the proposals so the team came up with a solution to create a dReps, targeting Africa, so this proposal perfectly fits the requirements of the challenge,\n\n   I and the proponent team both understand the importance of elections to ensure that good quality proposals are found to give them funding to develop their ideas to benefit the community after the proposal. The proposal was successful, however, I would like to have some suggestions with the solutions presented below, please refer to the proposed group for further reference,\n  * the first letter of the group has not yet provided documents on how to obtain summary statistics of the results of qualified proposals and PA assessments, this is to serve the conditions of selecting proposals for election , and also increase the dReps reputation of the founding group, and create a premise for the community to trust it,\n   * second the group needs to be more explicit about this statement: \"Recommend finding ways to organize online and physical events to create awareness.\"\" for example: how the group can invite them members communities in Africa attend the events the group proposes to organize, and more the team needs to provide for this proposal with statistics on where Africa would rank in terms of the number of members owning ADA , this is the basic condition to be able to vote.\n  internet connection risk, has been thoroughly rectified by the team, but I still see there could be a possible risk: if your dReps hasn't gained reputation recognition in the short term then Why, because I see that the group has not had a specific plan for what will most effectively attract trust from the African community. the above are all my suggestions hope the proposed team welcomes it.\"", "q0r": 3, "q1": "\"This is community development, so I think the team can proactively do the initial communication before starting to do it, but don't have to wait until it is funded to start doing it, if the group takes the initiative first. The success rate of the group will be higher than that.\n\n In addition, the activities in the group roadmap should clearly state on what days the week will be operated, for example ; \"Week 5 - 6 - Organize the first live dRep educational seminar\"\" will it be on any weekday or the group will operate continuously for the whole week, need to explain more specifically about the activities This will ensure the high feasibility of this proposal.\n  it is very necessary for a detailed explanation of all the expenses stated above it would be better to break them down eg \"\"Online Registration - 1,000\"\" what will the online registration spend on? . I'm also a community developer and the way I go live on Youtube platforms will be free, so what will $ 1000 be spent when there is a payment for human resources and then please suggest a more specific explanation of the problem. this topic.\n   \n   However, about providing team information has been provided fully and the details are attached to the assigned positions, but there are still shortcomings above so I can only give you this possible part. 3 points. \"", "q1r": 3, "q2": "\"the team marked as a team member has received funding from the previous round, but there is no announcement about the success and what benefits it has provided to the community, and also the workload Will it be affected by parallel development if the previous proposal is incomplete?\n   along with that all the metrics that the team provides to serve the community to track and verify, for example: Number of people accessed and educated on dRep\"\" where will our community be able to track them ?. there has never been a commitment to support this so it is very difficult for our community to trust you and vote for you.\n   The success of the proposal will be difficult to determine for the community as much will be related to the number of people participating in their dReps, as there is no statement that these success metrics will be released to the community. \"", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 13, "ne": 3, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 5685, "q0": "This is a brilliant idea by the team in helping to provide education on the drep role. In that regard, this initiative is best fit to address the drep improvement challenge. In view of the huge community base of the Cardano ecosystem, it is obvious this platform could greatly help to demystify any misperception and misrepresentation associated with the role. Ultimately, the drep improvement challenge setting seeks to increase the participation in the drep role from the community. Therefore, I am confident in the value proposition this initiative offers in helping scale up the participation in this role. This initiative is specially designed not only to create awareness but to also galvanize community support that ensure the onboarding of community members into the Cardano ecosystem. My overall impression here is that, the community can anticipate better decisions on proposals based on the effort of initiative like this. However, because the team is not coming back for funds, it presumes that this is a one time event? If not, what’s the long term plan of this project? Ideally, the team could have presented more details here. Again, how would the team attract its audience? I suggest the team adopt social media platforms to reach out to voters within the community for such event.", "q0r": 4, "q1": "The proponent presents a team profile with attached links that supports the expertise and experience of the team. From the profile, we see a detailed information of the team’s experience in both the traditional work field and the Cardano ecosystem. Certainly, the nature of this project requires the experience and expertise of long standing members of the Cardano ecosystem. More importantly, the proponent has assigned roles to each team member which could ease the implementation of the project. Hence the team is well positioned to execute the project. Aside that, I think the roadmap Is well framed to complement the effort of the team. The roadmap details specific timelines for each event outlined within the roadmap. This tells us how the project would proceed along the line to implementation. Finally, on the budget allocation, I think the proposer provides a clear budget breakdown that details how much each identifiable item would cost. My only problem here is that, the amount allocated for venue and online subscription is on the high side. I suggest the team readjust that part of the project.", "q1r": 4, "q2": "Taking into account the overall view of the project, I think the project description and the feasibility shows a clear approach to achieve the end goal of this project. In this  regard, we’re also presented with the parameters to help assess, monitor and track the progress and success of the project. These parameters include the number of dreps participation, the number of people educated on drep and a few others. In my opinion, these are relevant and accurate parameters to monitor the performance of the project. But, how do the community get access to the information on these parameters?  For the purpose of demonstrating readiness to be accountable and transparent to the community, I suggest the team refine the proposal to reflect their intention to present the information on the performance of the project to the community.", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5782, "q0": "Creating awareness and educating people on the power and delegation of votes to make informed decisions in the catalysts ecosystem is key to vote on best proposals that have the potential to drive the adoption and application of the cardano blockchain in solving problems.\nWith little to no knowledge on the delegation tool, everyone by extension driving for change and innovations.\n\nThe proposal is aligned to the campaign objectives with potential to help increase voter participation. The solution to the problem is self explanatory and realistic ", "q0r": 5, "q1": "The proposal has an experienced team in the catalysts ecosystem and looks to have taken up other initiatives within the catalyst circles. This wealth of knowledge and experience is a great asset to ensure the successful implementation of the proposal. \n\nThe proposal has clear timelines and structured deliverables that are simple and achievable. Looking at the activities put in place  the requested sum is also realistic and would help in the smooth implementation of the proposal.", "q1r": 5, "q2": "The proposal has listed KPIs that are realistic and can be measured. This would make the evaluation of the project very easy. Most importantly, the team is measuring success through the number of attendees demonstrating understanding of the presentations with the aim enhancing delegate voting\n", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 7073, "q0": "The proposal fits in nicely with the challenge's stated objective for creating dReps and increasing awareness, to allow ada holders in Africa the possibility to transfer their voting power. This would undoubtedly be helpful because it would provide the less active voter an opportunity to continue being heard, albeit across a wider range of proposals than they could individually read and assess. These dReps will cast votes on the vast majority of Project Catalyst proposals, which will improve the caliber of decisions made inside each Fund. It is great news for the entire Cardano community that the Cardano ecosystem is still growing. However, exponential expansion poses a challenge. The community's obligation to scrutinize and decide on proposals grows along with the number of them. The development of dReps and raising voter knowledge in Africa are necessary to maintain sustainability and address the issue of the low participation rate in catalyst voting. This will help ensure that all proposals receive the attention they deserve and will facilitate continuing growth.\nThis project is without a doubt incredibly important and promising, thus it meets the criteria set forth in this challenge.", "q0r": 5, "q1": "The team appears to be very competent, and they are undoubtedly qualified to complete the project successfully. We are familiar with each member of the team—we know their names, have a brief summary of their educational and professional backgrounds, , as well as links to their individual LinkedIn profiles where we can learn more about each of them in-depth.\nThe team is already extensively involved in the Cardano community in a number of capacities, in addition to having the necessary experience in raising Cardano and blockchain awareness in Africa The budget for the project is precisely described and broken down into details regarding how it will be allocated. The proposal also includes a comprehensive plan for how the project will be carried out, together with a defined timeline and all necessary resources. The proposer highlighted a few potential risks and suggested strategies for mitigating those risks. I think the team will implement this project to help expand Catalyst ecosystem successfully.", "q1r": 4, "q2": "The proposal includes enough details and KPIs to allow for a thorough audit of the project's development and success from the outset until integration. The provided benchmarks are also useful for gauging development. The likelihood of fulfilling this objective of establishing dReps throughout Africa as well as the plan to raise awareness of dReps is therefore quite high. This will be a chance to spread knowledge and encourage sustainable economic progress.\nThe project milestone effectively sums up the tactic. In my opinion, the information provided and the metrics for a successful project have been outlined, which are good indicators for gauging the performance of this project in Africa and could improve the caliber of decisions made within each Fund.\n", "q2r": 4, "assessor": "z_assessor_2869", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8923, "q0": "People should make use of the voting power provided  through dReps , as there are lot of people in the catalyst who doesn't make use of this power , which hindrance the growth of cardano community , the idea to create awareness among voters and  to participate in cardano development is  a great idea, where they gets even rewarded for participating which will help them grow both economically as well idealist towards to blockchain, the team even wants to break the difficulties in the language or technical terms used in proposal and help in making them easy topics , Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed task is not a difficult one where hosting a meeting online is very easy now a days, as there are lot meeting platforms available in the market for hosting online, the team can make use of anyone of them to host the meeting , the proposed task just needs one good speaker who can make the proposed difficulties to break into lament terms and help the voters to understand the topics, the team has also planned to reward the participants which is a great marketing strategy to achieve ,with this more members can participate in growth of cardano , by casting their vote. Hence ,iven experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal has introduced all the team members who will be involved project , where proposer alone has more than 20 years of experience in the field which is definitely great to hear , and even other members have worked in cardano eco-system from fund 4 projects.\nThe audit has simple goal to achieve where it wants to create awareness among dReps of Africa and has come up with well planned marketing strategy to get more rewards on more participation, The proposal has simple timeline provided for the project and decent budget breaking feasibility , with provided experienced team and involved minimal risk the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 9636, "q0": "The proposal  indicates a clear plan to increase awareness and  participation in voting across Africa through the creation of dRep. The project will not only increse participation but also enhance the quality of decisions that inform how voters' vote.", "q0r": 4, "q1": "The implementation of the project should go smoothly as planned if the risk identified is meted with the solution to provide available copies of presentations on youtube. The risk however portends that the language barrier remains unattended to, I suggest transcriptions be attached so that users can translate with ease or implore the service of a couple of translators. The medium of delivering the training is well thought through and feasible. ", "q1r": 5, "q2": "The general information provided is accurate for auditing the project. The KPIs are sufficient to measure the success of the project. The KPI should include a survey at the end of the training to reveal how the trainee's decision-making and voting patterns will be affected by the training going forward. The KPI can also include targeted numbers so that success can be measured quantitatively. ", "q2r": 5, "assessor": "z_assessor_3072", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 9672, "q0": "The focus of the proposal which is to Create dRep and increase awareness for delegated voting among voters in Africa as well as increasing voter participation and reward and to mitigate the problem of Low participation rate in catalyst voting and eliminating English Language barrier by some voters, which has been posing a challenge in analyzing and voting for  proposal. This I think is directive and inline with the general objectives of the challenge. I would say that the proposal therefore identifies a problem within the challenge which needs to be solved because, the successful implementation of the proposal will  help for quality decision-making during voting and reduce if not totally alleviate the low level of awareness in Africa. This would help to vote for quality and good proposals as well as provide a better pool for a reward and to breakdown the comprehension of individuals to enable increased participation. This is an evidence that the proposal  clearly articulates how it will add value to the Cardano ecosystem and address future challenges as well. However my only concern is that,per the little knowledge I have about voters, one cannot automatically register as a voter unless they have a minimum amount of about $500 in thier wallet,lest,the individual would have to first register as a CA and kick start from there untill they are rewarded in ASSESSMENT participation which will help them move to become a voter. I'm saying this because ,a novice in the ecosystem may not have any idea about this and may wander how the project will be beneficial to them and for the community. I think the proponent could add a little schooling about this,for the benefit of such people so that they will see and understand the relevance of the proposal and to give them an idea on what the Voter portfolio is all about.\n", "q0r": 4, "q1": "I believe the proposal is likely to be successfully implemented, given a pool of qualified team who have oodles of experience in the field and are still serving members in the cardano community. There is also a clear timeline and a good timetable that will guide and aid them execute all the phases of the project implementation,starting form when the events will kick off to hosting of educational workshops. I think the budget allocation can be further broken down a bit and the budget itself reduced slightly. $11000 for a project like this is a bit limited in comparison to the exchange rate available in the country.Also there is a good consideration in the risk and  challenges that may be encountered  and a substantive remedy has been provided to curb it. For this reason I have no objection to the successful implementation of the project should it be considered for funding.\n", "q1r": 4, "q2": "In my opinion,I think the proposal has information to measure the progress and success of the project in that,there is good description of the problem, solution and how the proposal is aligned with the objective.However there is scanty information on how the  measured success will be made available and communicated to the members of the cardano community. I will suggest that the team makes an effort to make such information easily accessible in so that, their transparency would be clearly considered. My suggestion is that ,they can do this by providing the data collected in the form of a PowerPoint presentation,word documwmt,etc and presented to any of the communication channels in the community. Telegram,discord etc for thier perusal. Aside these,I believe that other information given in the audit stage are  good indicators for measuring success.\n", "q2r": 4, "assessor": "z_assessor_3081", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11164, "q0": "The creation of the dRep Improvement and onboarding category is a very wonderful innovation which will really help in coming out with the best project that truly needs to be funded. Having a review at this amazing project, I am very much impressed about the idea behind this project. Looking at the problem statement that highlight low participation rate in Catalyst voting, English being a barrier by some voters and also low technological skills to some voters who want to set up the voting app for voting. These indeed are much of a challenge that needs to be addressed and I believe this project will help do that. In my view, this proposal positively will help give the Cardano ecosystem by helping to bring as many people unto the dRep scheme which in effect will help raise the participation rate in the Catalyst voting. Also I believe voters who are not good with the English language an leverage on the dReps to help them with voting and also gain increase in the voting reward. I really find this dRep initiative a win-win effect which will be of great benefits to the community of voters.", "q0r": 5, "q1": "As an assessor, I find myself happy to review this project. This is a great innovation which is going to be accomplished by an experienced team in the Catalyst community since fund 5 with a combined experience of over twenty years in various fields. The team lead of this project has a good background in the field of computer application (masters) and financial accounting (masters). Looking at the stated budget in the proposal, it has been well broken down for the community to appreciate the cost involved and its reasonability. Speaking on the need for the additional funding if needed was well answered in the proposal and I really agree with them on that submission. As part of the campaign brief it is stated that Catalyst voting is often less than 20% of the expected voting and this project seems to help bring out much increase in the voting percentage by bringing onboard as many as possible dReps from diverse locations to participate.\nIn view of the risk of this project that looks at the problem of poor internet connection in Africa especially which will have an effect on the online event that will be organized. To mitigate this, they will make a provision for the event tobe recorded and made available on youtube and other media.\n", "q1r": 5, "q2": "As part of the Fund 9 strategic goals, proposals are to help prepare a group of people willing and able to make contribution to the ecosystem. In this light, there need to be the need for projects to be aligned to the strategies to help ensure productivity and creativity to grow the Cardano ecosystem. \nThe team has stated some indicators that would help them track the progress and measure success as a way to sufficiently help audit the project and that includes measures like number of people participating in dRep, number of people reached and educated on dRep and many others.\nThe budget looks good and well detailed to ensure efficient use of funds. I will urge the project team lead to ensure that the funds are used judiciously as stated in the budget and provide an audit on the use of funds on timely basis.", "q2r": 5, "assessor": "z_assessor_3228", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12579, "q0": "The issue raised by the proponent reflects low participation in catalyst voting. Some voters' English language barriers pose a challenge in analyzing and voting for more than 1,200 proposals. Low tech skills to set up a voting app. By creating awareness that will influence individuals to vote through dRep. dRep is an avenue for voters to delegate votes, it will help vote for good quality\n proposals as well as provide a better pool for better rewards than an individual gets for voting. promissory note. The main goal of the proposal is to raise awareness in Africa that will help influence more voters to save time while making quality decisions through dRep. With this proposa,l I believe it is possible to scale up to address future challenges. I rate this project 5*.", "q0r": 5, "q1": "The team consists of 3 main members involved in the project, Christopher Aikins as team leader, and senior assistant accountant of Volta River Authority with 10 years of experience working in the Finance department ... The second person is Nathaniel Dwamena, a Research and Administration. . . , a researcher with over seven years of experience in think tank development, nonprofit management and business development consulting ... The third is Angela Okai-Nartey in the Marketing and The media. She has 3 years of experience in Think Tank Development, Digital Marketing and Nonprofit Management... Finally, Richmond Oppong is a team member, a developer. graphic designer with over 10 years of experience in logo design, print and poster design, business card design, 3D signage, and advertising and marketing... Proposer provides budget analysis clearly detailed budget, with a total required budget of 11000. The proponent has provided a detailed plan, roadmap to implement the project within 12 weeks. The group commits to carry out follow-up activities within the next 3 months after funding. According to the proponent, the main risk that could prevent a successful project implementation is poor internet connection in Africa for an online event, with which the proponent has come up with a solution by record the meeting and then make the video available on YouTube so less interested individuals can access the recorded content and get up to speed. This is a big plus point of the project,  I rate this project 5*.", "q1r": 5, "q2": "As I said in terms of feasibility, the implementation roadmap will take place in 3 months with important milestones to achieve. The success of the project is The team understands that the progress that is achieved will directly impact the project's catalyst. That said, the team has defined its success as the number of people who understand and participate in dReps and contribute to quality decision-making and raising awareness about dRep. In short, in this project, everyone can follow the whole process. ", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Create dRep and increase awareness for delegated voting among voters in Africa as well as increasing voter participation and reward.", "experience": "This is a team from a Cardano-based community network with a combined experience of over 20 years in the field of Computer Application, Marketing, Research, Finance and project management."}