{"id": 423120, "author": "christopherseuc", "title": "Community Workshop&Travel to France", "url": "https://cardano.ideascale.com/a/dtd/423120-48088", "category": 26601, "amount": 8000, "description": "Building longstanding relationships and collaborations can be a lot of work. Sometimes it is difficult to get a good sense of community members and the way they work. ", "f6_no_assessments": 8, "f6_rating": 3.125, "videos": [], "media": [], "f6_assessments": [{"id": 39, "q0": "The drep challenge brief calls for increasing diversity among dReps and facilitating easy voter delegation.  The proposal calls for a week-long guided visit in Paris, with some workshops related to Cardano. The proposal would be improved by explaining the connection to the challenge brief. Perhaps the workshops will focus on the delegation process or perhaps the invitee list will focus on diverse dReps from other parts of the world. Additionally, the potential speakers listed are deeply involved in stake pools and the Cardano community, but it would be helpful to understand how they are participating, or intend to participate, in the dRep process. A more detailed description of how the broader Cardano community would benefit from the conference and workshop activities would also be helpful. ", "q0r": 3, "q1": "The detailed plan focuses more on the agenda for the conference itself. Given the proposer’s experience with event planning, it would be helpful to see a bit more detail regarding how the planning process work. I would be interested to know the proposer’s strategy for booking accommodations, venues, and excursions without knowing how many people will attend. It would be useful to get a sense of the target size of this conference and whether the proposer is envisioning that 10 people will attend or 1,000. In the absence of that target number, it is hard to assess whether the budget is feasible. Additionally, the proposal would be strengthened by devoting more attention to the sign-up process. The proposer has the laudable goal of providing equal opportunities for all. It would be helpful to understand how the accommodations will be provided if too many people sign up. Or alternatively, if everyone can’t be accommodated, it would be helpful to understand what the selection criteria would be. This information would give us useful information not only about whether or not the proposal is feasible, but also about the impact the community can expect from the potential investment of funds into this event. ", "q1r": 3, "q2": "The proposal would benefit from concrete and quantifiable KPIs, such as the target number of attendees (as mentioned above). Ideally, those metrics would relate to the drep challenge brief, and help the community measure how the funding of this event would improve drep diversity and facilitate vote delegation, as defined in the challenge brief. Additionally, the only answer to the question regarding what success for this project looks like is, “Hard to measure. TBD.” The proposal would be strengthened by articulating how the Cardano community will realize a return on intention from funding this event. The PA guide calls for an accessible public channel for delivering regular updates to the community for auditing progress. The proposal would benefit from a discussion of how the community will learn about the planning process for the event, particularly given the lack of detail regarding the sign-up process. And additional transparency would be helpful to understand how the community can assess whether or not the event was a success. The proposer intends to create a small production video about the trip, which would serve as a kind of ad. While this would certainly help to understand what had occurred at the event, it would be useful for the proposer to explain what differentiates this video, which is the only measure listed in the auditability section, from the close-out report video that all funded proposers must create.", "q2r": 2, "assessor": "z_assessor_2030", "no_vca": 27, "ne": 11, "ng": 15, "nfo": 1, "vca_o": 1}, {"id": 2548, "q0": "This project has the potential of a great local impact on France and other neighboring countries i.e Germany, Spain, Portugal, UK.\nSuch gatherings will definitely strengthen relations between community members and create many opportunities for collaboration and also learning. The structure of the events presented would also encourage newbies to participate since it has a friendly and not too techy vibe. The ability to scale on the other hand remains limited but still possible if the events are made in multiple countries simultaneously. This would imitate the swarm concept but in real life.", "q0r": 4, "q1": "The proposal presented includes a detailed day-by-day breakdown of the event and the planning necessary to make it happen. The proposer also claims to have extensive experience with organizing various types of events. The team specifies the need for a venue and further funding for different types of activities throughout a couple of days the event is being held. There is no specific time for the event but a specific timeline of the event is provided for 5 days. Risk is said to be limited by the team and they mention that perhaps only travel hick-ups would make the event impossible to make which is understandable. If an experienced team takes responsibility for the event, there wouldn't be many limitations since the logistics are taken into consideration.", "q1r": 4, "q2": "For starters, the community can audit the project by checking on the event and getting feedback from attendees on whether the expectation from the proposal was met or not. Furthermore, we already have some PAs from France that would probably attend such an event and would let the community know. The roadmap of the project is presented as a daily breakdown of the activities provided by the event, I wish a clearer view for future growth would have been provided, especially when it comes to logistics if the events become very big. Some KPIs are provided in form of the activities the event will include which will help the community keep the project accountable. Finally, the delivery dates are lacking but it's understandable since giving a specific date before funding would make the logistical issue larger than what it needs to be. The event seems promising and its DAO structure when it comes to access to funding gives an extra layer of transparency and comfort when it comes to the suitability of the project.", "q2r": 4, "assessor": "z_assessor_2317", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 2713, "q0": "I'm struggling to see how this proposal - which appears to be aiming at anyone in Cardano - has any particular relevance to the dReps challenge as such - unless perhaps you argue that anyone in Catalyst is a potential dRep. But if this is the thinking, I see a danger of it creating a meetup of either a random group of people who have no synergy and no interest in the dRep role; or alternatively, a clique of people who are rich enough (in both time and money) to take time out for a meetup. And unfortunately, the proposer does not argue at all for how this would not happen, or how the  proposal does address the challenge, since the section on how the proposal fits the challenge does not reference the challenge's goals at all. I think potentially, this proposal could even be detrimental to the challenge's goals -  the challlenge clearly references the need for greater inclusivity and diversity in who becomes a dRep, but the idea of a several days long meetup in Paris is something that is quite out of reach for many potential dReps, either because of money, or time, or the length of the journey, so this would actually entrench barriers rather than removing them. The proposer doesn’t say how many people are expected, but it seems not to be many, judging by the budget - however, in order to achieve any impact and be worth doing, I think it would need to be rather more people than the proposal is allowing for. Overall, I don't think this proposal addresses the challenge at all well.", "q0r": 1, "q1": " I feel unsure what \"feasible\" would mean in the context of this proposal, as the proposer doesn't give much detail on what goals they are trying to achieve in terms of numbers attending, or results in qualitative terms (whether people enjoyed it, or whether new connections formed, or crucially, whether anyone was encouraged in the role of dRep). I also don't see any information on how it will be promoted and publicised, so I don't feel anyone will be reached, beyond the proposer's own existing contacts. The budget is clear enough, but I think important elements (notably pubicity and documentation) are missing from it - and without those, the event is in danger of just being a holiday. The time-plan also could say more about what the \"workshops\" will consist of, what they are trying to achieve, or how they will have the effect of \"speed[ing] up relationships and community collaborations\", so we can assess what the proposer is trying to deliver and how feasible it looks. I also think it's an issue that the proposal is fuzzy about which \"community\" it is aiming to reach - it says it's the whole of Cardano, but people in very widely divergent parts of Cardano don't really have any cause to collaborate, so it would need quite a skilled workshop facilitator with a lot of insight into the ecosystem to be able to get \"community collaborations\" out of such a meeting. In short, yes it is feasible for this proposer to set up a meetup and a wine-tasting and a tour of Paris; but it doesn't seem very feasible that anyone from Catalyst will attend it, or that any of the purposes that the proposer mentions, or any of the goals of the challenge, would be met.", "q1r": 2, "q2": "Making a short advert does not count as auditability. There is little here that the community can audit. It would be nice to see a link to the tool that is mentioned, to be used for collating insights and collaborations. It's also pity the proposer chose not to spend any time thinking about what success looks like. Overall, this proposal is not auditable", "q2r": 2, "assessor": "z_assessor_2343", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5076, "q0": "The number one necessary element stated in the  challenge is diversity of dReps. This plan self-selects for a small number of wealthy people. Paris is n expensive city and nearly all costs are the responsibility of the dRep. The budget for group activities suggests that only a handful of people will be able to participate.  \n\nAccording to the challenge brief this small, self-selected group reflects centralization. ", "q0r": 2, "q1": "There is nothing to suggest that there are connections with the venues that are listed. The plan is so open-ended it does not look like there is any concrete plan. \n\nThe budget seems very small for providing guided tours in and out of Paris. Dinners, venue admissions and transportation can be quite expensive. This proposal does not show any research into how any activities will be organized. \n\nThe biographies of the organizers do not show any experience with organizing group travel, conferences or excursions. \n\nThe proposers say they are involved in other Catalyst proposals, past and present. There is no plan for balancing their responsibilities to each project. ", "q1r": 1, "q2": "A red flag is that there are no signs of success listed. How will the organizers even know if they are going in the right direction? There is no way to know. \n\nThe challenge has hard numbers set as goals for number of dReps to be recruited. This proposal could have picked any number as a contribution toward that goal. \n\nThere is not sufficient information to track progress with this proposal. ", "q2r": 1, "assessor": "z_assessor_2669", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 5699, "q0": "The proposer’s main focus for this project is to foster community connections via a workshop. This is a good initiative; however I think this initiative could best suit different challenge setting. From my analysis, I found it difficult to identify how this project fit the drep improvement challenge setting. Per the objective of th drep improvement challenge, this project would not lead to an increase in dReps participation, it doesn’t also lead to a high delegation participation rate, neither does it lead to appropriate selection of dReps for delegation. Clearly, the proposed solution detailed here doesn’t lead to achieving the end goal of the drep challenge. Ideally, any idea within the drep improvement challenge setting should be centered around the Drep role, however this project is a deviation from the primary objective of the challenge setting. Even though this project may eventually lead to value addition to the community, I suggest the proposer consider submitting this project in a different challenge setting or streamline the overall project to reflect the objective of the drep improvement challenge setting.", "q0r": 2, "q1": "The information presented helps us visualize what would be done to ensure project completion. However, does the information on the team experience, roadmap and budget make this  project feasible? Other than the deviation of the project from the main objective of the drep improvement challenge setting, the team have presented a well structured roadmap and budget for this project. The roadmap looks more concise and structured with time horizons that details activities for each day after funding. Additionally, per the design of the project, the budget is within the reasonable amount and fairly moderate. On team experience, the information presented failed to highlight the relevant experience of the team, relative to this project. Aside that, the proposer failed to present relevant links to the profile of the team.", "q1r": 3, "q2": "Based on the details presented to audit the project, I think the information is not only unclear but also insufficient to support the audit the project. On the KPIs, the proposer indicates that they “…will document any ideas, innovations, collaborations and insights from the Workshop”. Even though this is unclear, my inference from this is that, the number of ideas, the number of innovations, number of collaborations and insights are the KPIs for this project. Based on these inference, I think the KPIs suit the objective of the project but lacks clarity and specific milestones. However, considering that the overall objective of the project doesn’t fit the drep improvement challenge setting, it would be difficult for the community to monitor the progress and success of the project,  alongside the objective of the drep improvement challenge.", "q2r": 2, "assessor": "z_assessor_2734", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6073, "q0": "The idea of the proposal is to organize an annual \"In Real Life\" Working Workshop for all Cardano members in Paris, France and surrounding areas. The purpose of the conference is to connect Cardano members and exchange information related to the Cardano ecosystem. In the process, new ideas can be born and old ideas will be reinforced. However, the content of the challenge was related to “dRep improvement and onboarding” but there is no content in this workshop related to it. In my opinion, this project is not suitable for the challenge.", "q0r": 3, "q1": "The author of the proposal has 10 years of event coordination in Paris for international communities (AUP). Therefore, organizing a 7-day workshop program could not be difficult for him. The specific workshop schedule is as follows: 3 days for excursions in and around Paris, 2 working days in the workshop and 2 days for other activities. The author has listed specific content for these 7 days and analyzed a budget table of $8000 for implementing the workshop program. In my opinion, this plan and budget sheet is very well prepared.", "q1r": 5, "q2": "The auditability of this proposal is simple. Once the workshop program is completed, a 7-day summary video of the event will be produced and posted on community websites. One indicator of this project's success is the number of ideas, the collaboration among Cardano members, and the awareness of the panelists.", "q2r": 5, "assessor": "z_assessor_2775", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8974, "q0": "As community members must reunite sometimes and understand one an other so that it brings harmony among the people of cardano members, which encourages more people to participate in cardano ecosystem projects, hence to create such scenario the proposer wants all the cardano members in around Paris to join for a week and participate in the workshop , the proposer has clear idea of conducting small tour across Paris and later conduct 2 day of workshop , so that everyone can understand each other and create awareness among the people related to ecosystem's roles, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed goal is not a difficult one to achieve , where funding is most important aspect here, and the other challenge that the proposer's team might face is convincing community members to participate over 7 days , where people may try to find it difficult. Other than that providing sign up sheets to calculate the number of members participating and based on number of people participating Book accommodations, Book excursions in and around Paris ,Book venue for Working workshop, Book free time IE options can be achieved easily as it just needs funding , the proposer has been OG founder and contributor to ADAO and RARE.FINANCE. hence with such experience conducting workshop is achieveable , Hence Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clear goal to meet and greet all community members of in and around Paris for a week, audit has presented detailed schedulement on how the things will go on for a week which involves excursions in and around Paris and workshops, audit has introduced team members who'll be involved in the project and their roles in project.\nAudit has well structured budget breaking scheme where budget for every food and escort is clearly mentioned, it even contains detailed timeline and roadmap to complete the project where each day's task is mentioned, Hence with the minimal risk involved the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 14341, "q0": "I think this proposal solves the first 2 problems of the challenge, which is onboarding diverse dReps and attracting more dReps to onboard.\nI cannot deny that Paris is truly one of the most fascinating destinations for travelling and  conference in the world. I think the team was right to choose Paris.\nNow i will explain the minus point. I have not found in your proposal any ideas that can fulfill the request of the challenge: increasing the number of delegates to dReps and how well did you create content and tools to make it easier to consider dReps?. ", "q0r": 4, "q1": "This proposal can be successfully implemented if you add more information to make it more specific to attract interest from potential participants.\nSo how to make it more specific? Some of my suggestions are:\n- On which platform will you post ads so that the most people in our community know will about it?\n- The information about the accommodation, the places that you will let people experience should be outlined in more detail by the attached video/ files. When the plan is specific, it will create the trust of potential participants.", "q1r": 4, "q2": "In this section, I hope you can provide more infomation on the ways to track your project's progress (like: where can we track the progress?). Besides, i hope with your team expertise and experience, you can define your success as the clear your vision is the more successful your project will be.", "q2r": 3, "assessor": "z_assessor_3993", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "I propose an annual \"In Real Life\" Working Workshop for all Cardano members in Paris, France and neighboring regions. \nMy solution is to host a week long guided visit to Paris and host said Workshop. ", "experience": "10 years of event coordination in Paris for international communities (AUP). Former Student Advisor, event producer, Parisian Busker, French Server and Cook, Prisian tour guide, and current Cardano \"Human Catalyst\". OG founder and/or contributor to ADAO and RARE.FINANCE."}