{"id": 382150, "author": "tobrien", "title": "Paperless Cross-Border Trade", "url": "https://cardano.ideascale.com/a/dtd/382150-48088", "category": 26249, "amount": 146960, "description": "Los países en desarrollo tienen dificultades para aprovechar las enormes ventajas del comercio sin papel debido al elevado precio de los programas informáticos y los conocimientos técnicos.", "funded": 2, "upvotes": 163935684, "downvotes": 4395870, "votes_result": 159539814, "votes_cast": 665, "f6_no_assessments": 6, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Las ramificaciones que podría traer la propuesta anterior son amplias. Es una idea brillante planteada de forma sencilla pero elaborada. La solución propuesta menciona claramente el registro al que se dirige, el \"control de aduanas y fronteras\", que es uno de los requisitos en el resumen de la campaña. La base de usuarios a la que va dirigida es Kenia y Ghana, que son países en vías de desarrollo que necesitan este tipo de soluciones para una prosperidad previsible y sostenida. El proponente también menciona que la solución ya tiene una implementación que se ejecuta en la cadena Ethereum, pero quiere transferir la misma a la cadena Cardano. Por lo tanto, si se implementa con éxito, la propuesta no sólo tendrá una influencia global en el impulso de nuevos jugadores, sino que también invocará a muchos de los jugadores existentes para pasar a Cardano, con el fin de superar las vulnerabilidades que podrían estar enfrentando en sus respectivas cadenas actuales.", "q0r": 5, "q1": "Los proponentes, Tim y Jonathan, son caras conocidas en la comunidad y no hay duda de su experiencia. Y hay que valorar el esfuerzo que se ha hecho para detallar el plan. El proponente ofrece a la comunidad y a los lectores una hoja de ruta bien definida que incluye objetivos claros por fases, requisitos de recursos, riesgos y parámetros medibles. El equipo ofrece una breve descripción del mismo y de la experiencia que puede aportar al ecosistema. Sin embargo, los fondos solicitados constituyen hasta el 25% del fondo asignado para el reto. Aunque la cantidad parece hacer justicia a la considerable carga de trabajo que el equipo propone, sería una injusticia para las demás ideas del reto. Recomendaría al equipo que propusiera una parte del fondo durante las siguientes rondas de financiación mostrando algún tipo de progreso desde la asignación del fondo7. Una vez dada mi opinión, creo que una puntuación de 4 sobre 5 en cuanto a la viabilidad haría mucha justicia a la propuesta.", "q1r": 4, "q2": "El equipo, sin embargo, no hace ninguna reserva al proporcionar las métricas para el proceso de auditoría. El proponente menciona sus resultados deseados para cada hito y sus respectivas métricas de éxito. La propuesta incluye todas las métricas requeridas que uno debe esperar después de haber pasado por el resumen de la campaña, ya sea el aumento en el número de casos de uso de la aplicación y las transacciones, la asociación con las organizaciones internacionales, el impacto en la inclusión financiera, y el alcance global que son todas las métricas clave del desafío en cuestión. Además, el plan del equipo de hacer que la aplicación esté disponible como código abierto y proporcionar una demostración de la aplicación a través de canales catalizadores hace que la propuesta sea más viable y fiable. Con todos los datos anteriores en la mano, está muy claro que la propuesta viene con suficientes KPIs para controlar su progreso y su eventual éxito. Por lo tanto, le doy una puntuación completa.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of high cost of customs paperwork in cross-border trace by moving the TradeTrust framework of electronic trade documents to Cardano which aligns exceptionally well with the challenge goal of foundational Customs & Border Control registry.  \r\nThe proposal is an excellent example of articulating the value to Cardano ecosystem, articulating how the solution scales to address future challenges, providing key metrics and goals that closely align with the challenge.", "q0r": 5, "q1": "The proposal's feasibility could be improved by a challenges and risks section however given that the application is currently functioning the risks are likely minimal.\r\nThe proposal's feasibility is excellently demonstrated by evidence of experience (existing application), team composition, budget is broken down and reasonable, realistic timetable and plan, resources required, detailed technical explanation of the solution.\r\n", "q1r": 5, "q2": "The proposal includes excellent examples of a roadmap, milestones, time horizon, metrics/KPIs to measure proposal success, a clear understandable description of the targeted problem, a detailed description of the solution that addresses the problem. Overall the proposal is an excellent example for future proposers to follow.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 21, "ne": 3, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "The use case of this proposal is very interesting as it is designed to improve the current way of using trading documents. It's clear that paper based trading systems can be daunting, heavy and not optimized. The proposer has brought a solution that will use the cardano network to verify documents and enable rapide trading execution between parties. From the video published in the proposal, the proposer explained that the product was running on the ethereum network but the gas fees made them switch to cardano. Altogether, this proposal fits really well into the challenge.", "q0r": 5, "q1": "Since the project is already up and running, with a working website on mainet, I think that it's feasibility is a matter of continuing. Furthermore, the proposer has added all the information and details needed to achieve a positive note on a successful implementation of the project. Linkedin profile links have been added as well as team members and resources needed to complete the project. The budget has been broken and seems reasonable based on my intuition. Since I'm not a technical guy, I can't judge the reasonableness of the prices. Altogether, I have  confidence in the successful implementation  of this project.", "q1r": 5, "q2": "The proposer has added a roadmap with milestones that can help track its progress. Metrics and KPIs that define success are also included in the proposal. The proposer has clearly, described the problem and the solution.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 15, "ne": 3, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The project aims to eliminate complicated paperwork in the process of transporting goods across borders, saving costs and time for paperwork. Currently this technology is also greatly supported in developed countries. The application is highly practical. The team has professional experience and good relationship with many government agencies.", "q0r": 5, "q1": "The project clearly outlines the project goals, barriers, challenges, and how technology connects to achieve them. With the experience of the team and the solutions they offer are objective and feasible. But it requires a lot of time to implement as well as educate the market on the new method to be accepted for paperless cross-border freight.", "q1r": 4, "q2": "It is possible to check the progress of the KPIs in each stage and verify with the documentation they have done through the information provided about the results of the practical application of the countries implementing this technology.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "this proposal effectively addresses the Brief by working to place blockchain built paperless trade onto the Cardano blockchain. This is a fundamental governmental registry that is well suited for blockchains strengths.", "q0r": 5, "q1": "This team has already built the solution and has demonstrated value. The propsoal simply seeks to move the existing solution to the Cardano chain, the team has experience and the plan is sound.", "q1r": 5, "q2": "The plan presents operational auditable, measurable, specifc time-fenced milestones allowing the community the ability to audit this proposal's progress and success. it is nicely presented.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Brilliant. I recall the Government of Ghana tries to move port activities online, the initiative had a challenge integrating the process and rather cost delay. I think this proposal would be helpful, the educative component is important to integrating shipping agents and stakeholders for easy usage. ", "q0r": 5, "q1": "The team has proven evidence to ensure delivery successfully. Great team experience and I think the community should support and help the migration to Cardano blockchain.  ", "q1r": 5, "q2": "great cost breakdown. I think it would be easy to audit and trace activities. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Trasladar el marco de interoperabilidad de TradeTrust a Cardano para facilitar la interoperabilidad de confianza de bajo coste de los documentos comerciales electrónicos.", "experience": "Nuestro equipo cuenta con 30 años de liderazgo de pensamiento en comercio transfronterizo y diseño de blockchain con un equipo de 15 ingenieros experimentados en blockchain."}