{"id": 381811, "author": "dr.scurvey", "title": "Adalot the MMO/RPG/ECO-Sim", "url": "https://cardano.ideascale.com/a/dtd/381811-48088", "category": 26241, "amount": 80000, "description": "ゲーマーは遊びたいのです。そして、そうしている間に報酬を得られれば、さらに良いでしょう。\nADAをコミュニティに導入するには？", "funded": 1, "upvotes": 31587375, "downvotes": 12754320, "votes_result": 18833055, "votes_cast": 186, "f6_no_assessments": 8, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "アイデアはかなり違っていて、基本的にはいくつかのゲームアイテムを無料で征服して、ADAで金銭的に搾取できる商品を生成させ、それをCardanoに登録するというものです。この方法では、プレイヤーは自分自身に一種の投資をすることになります。私が理解しているゲームの目的は、RPGであり、一種の中世的な雰囲気を持つことです。これは、プレイヤーのかなりの部分がRPGが好きで、しかもこのような宇宙に興味を持っているので、うまくいく可能性があります。このゲームは、ブロックチェーン上のNFTの残高を増やし、スマートコントラクトによって複数の販売が行われるため、ADAでの取引を促進し、文字通りプレイすることで利益を得られるという提案に人々が十分に魅了されるため、エコシステムに新しいユーザーを惹きつけるというチャレンジ目標をよく満たしています。このような世界構築の問題がどのように機能するかは、「Build / grow together」というトピックでよく理解できます。また、著者はゲーム中に実際に起こるであろうことの例を提示しているので、説明されていることをよりしっかりと理解することができます。だから私は、これは非常に興味深いアイデアであり、他とは違っていて、いろいろな意味でカルダノのエコシステムに大きな利益をもたらすものだと思います。", "q0r": 5, "q1": "スクリプトには3ヶ月ごとの時分割がありますが、これでは間隔が空きすぎて何が起こるのか具体的に理解できませんでした。また、ゲームの中で何が達成されるのかということは大きく描かれていますが、その背後にある活動については語られていません。例えば、第1四半期にはマップを作り、プレイヤーがその宇宙と何らかの接点を持つようになるとか。そのためには、開発者、アニメーター、デザイナー、脚本家などが必要になります。彼らの日々の仕事ぶりを把握し、個々人ができる小さな仕事を積み重ねて、最終的な製品を作り上げていきたいと思います。これはすべてのマイルストーンに言えることで、ゲーム技術の進歩の裏にはどんな仕事があるのか？しかし、これらのマイルストーンは、以下のトピックで詳述するように、監査性を行う上でも非常に興味深いものです。無効になる情報はありません。コストシェアについては、著者は80kという高額の資金提供を求めており、いくつかのトピックで詳しく説明しています。しかし、これらのトピックはもっと説明されてもいいと思います。例えば、16Kのマーケティング：どのように行うのか？どのようなキャンペーンを行うつもりなのか？どのようにしてターゲット層にアプローチするのか？プラットフォーム・プログラミングに2万7,000円 - この金額は大きいので、より確実な理解を促すためには、さらに細かく説明する必要があります。この部分の提案は増額してもいいと思います。3Dデザインとモデリングがどのように行われるのか、ぜひ理解したいです（この分野は非常に興味深いと思います）。どのように、段階的に、誰が、どのくらいの期間で行うのか、などです。チームについて言えば、彼らの名前、役割、リンク先のプロフィールが示されています。提案書では、彼らが何をするのか表面的にしかわかりませんが、ソーシャルネットワークを通じて彼らをより正確に知ることができたので、その部分は満足しています。このように、全体的に見て改善すべき点はあると思います。", "q1r": 3, "q2": "このプロジェクトをモニターする方法は2つあります。1つ目は、視聴者へのリーチ、ゲーム内で作成されたパートナーの数、NFTの造語など、提供されているKPIを通じて、最もわかりやすい方法です。しかし、それぞれのマイルストーンが完全に達成されたかどうかを、小さな活動に分けて追跡することも可能です。したがって、著者は提案を適切に監査するのに十分な情報を提供してくれています。監査チームを結成して、実践を通じたモニタリングを行うのも面白いかもしれません。また、そのチームが、ゲームの成功をコミュニティに伝えるために、KPIで示されたデータを集めたレポートを作成することも興味深いです。この部分については、すべての提案が一致していると考えています。", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is aligned with the purpose of the challenge: bring gamers on Cardano, via introducing a MMO/RPG game based on a mixed concept play to earn/play to invest", "q0r": 5, "q1": "The website is already at a good stage and the team seems experienced. I see a marginal risk of too many environment deployed by the users or too many NFTs distributed which might have an impact on the gaming experience. \r\nThe project could also be linked to a staking pool dedicated to gaming, that offers a native token (Shilling as mentioned), as staking reward.", "q1r": 4, "q2": "A budget of only 7K $ for the game development seems a bit too optimistic. In any case, the timeline and the budget breakdown are clear. Budget requested is less than 1/5 of the total budget challenge so I believe it's a fair demand. ", "q2r": 4, "assessor": "z_assessor_530", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "The team provides very details of their gameplay and features that can help players enjoy the game, therefore, increasing new players to Cardano network. Especially, they also provide 2 case studies that can help us get it better. \r\nAs a game player, I can see this game is of the potential projects for scaling up our communities, not just about the idea but also with their implementation can help I assess like that. ", "q0r": 5, "q1": "I love the plan of in-game playing to support real-life Earth, and I do want to know more detail about that idea. \r\nNevertheless, I think their team has a serious time researching and planning this game idea because they have detailed descriptions of the gameplay, in-game elements, and a roadmap, and I see that it is like many other games I know. \r\nMoreover, the team have enough key persons for finish the game so well so I think I will vote this team for 5 ", "q1r": 5, "q2": "As I assessed in the feasibility, their roadmap is realistic as many other games. And with their key metrics that fit with the challenge, can help Catalyst community audit their progress after funding as their goals and vision. \r\nIn addition, the gameplay explanation and their gaming examples can help everyone clear how they consider challenging setting so well. \r\nBut NFT game industry now has so many players, I hope that they can provide some info about their way to get rid of them. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The place where gamers will gather and get paid brings great value and positive impact to the Cardano ecosystem. In the proposal we can clearly see what the problem is and a great solution is offered. KPIs in the proposal match the ones indicated in the challenge and proposal is able to scale (to address) future challenges.", "q0r": 5, "q1": "In this proposal we have all the necessary information (website, LinkedIn) and evidence about the team on the required experience, knowledge and skills. There is a link of great website in the proposal, but I was a little suspicious by the fact that the games posted on the page are misleading because they pointed out that they are finished and can be downloaded from the apple store, but unfortunately these games do not exist. The team is transparent which is a great thing. The budget is clearly defined but I personally don't prefere a proponent of large sums. In my opinion, it would be better if the requested amount of $ 80,000 was halved and half of the funds were requested in this Catalyst F7 and half in the Catalyst F8. Maybe the budget is realistic for the realization of such a project. It would be good to see within the budget allocation how many hours it takes to build certain parts of the project. Detailed implementable plan is excellently presented and details of actionable tasks and order of execution also exist. Any project that has a time frame of a year is quite risky in my opinion because we never know what can happen. So I advocate shorter time frames. The proposal states a time frame of as much as 18 months, which sounds quite unrealistic for a project like this in terms of the speed of project implementation. The plan describes the resources necessary to implement the proposal but has no description for technical aspects such as architecture, language and technologies. Unfortunately the awareness of the risks is completely omitted from this proposal.\r\n\r\n", "q1r": 2, "q2": "The proposal clearly defines a roadmap with milestones and a time horizon for achievement. KPIs are well presented and make sense and can be used to quantify the success of the project. Due to the long time implementation of this project, the community could have a problem monitoring this project.", "q2r": 3, "assessor": "z_assessor_656", "no_vca": 14, "ne": 2, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The proposal show clearly the way they solve their probem by the detail of gameplay and features in it. \r\nJust like other NFT games, the idea of this game can drive players that like their model to come and join. So it can increase the gamer in Cardano communities. .\r\nTheir KPIs are directly align with the challenge setting and when reading their detail roadmap, the implementation plan can help us know that they consider about the challenge setting a lot and can help to grow Cardano members further. ", "q0r": 5, "q1": "The proposal have detail roadmap into tasks for each phase that can help eveyone estimate the workload and scope. \r\nAnd the budget breakdown is reasonable. \r\nIn addition, it has detail explaination fo the gameplay, how people can play. \r\nIt also provide detail implementation plan but should show some risk and how the team can avoid it to successful launch the idea. ", "q1r": 4, "q2": "The proposal have its detail roadmap, key metric and explaination that can help everyone assess the feasibility of the game development and audit its progress by months. \r\nIts explaination about the gameplay with case studies can help everyone easily understand how they can solve the problem. \r\nSo, those above info are all clear that can help we audit the project well. ", "q2r": 5, "assessor": "z_assessor_670", "no_vca": 17, "ne": 2, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "Seem like the proposer really considers the challenge with their idea by the way they deploy their project. I think this game is close and align enough to the challenge setting with their KPIs and roadmap of implementation. Moreover, the detail of their gameplay and materials with case studies, absolutely points out how they solve the problem. ", "q0r": 5, "q1": "The proposal has a detailed explanation not just in gameplay but also their future implementation in the roadmap, and I think it's possible with their team of professionals. \r\nMy 2 advice for proposer in this proposal are: addressing the period of time that their required budget needs for - because I think it's not for 18 months and not just me but other CAs do want to know for how long, addressing the relevant risks that will help them beware and prepare better moves for future.  ", "q1r": 4, "q2": "For auditing this project, I think this proposal provided enough info. Because they have a very detailed roadmap, including the development and implementation activities of the project. \r\nOverall the proposal, seems that the team has well prepared for the way to the moon, and we can get that spirit in the detailed explanation of gameplay, example, and even their mission of \"Race for Climate.\" ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The game fully addresses the challenge, it has a high celling. There are a lot of options where transaction will be made based on the so called Shilling value which will be based on Cardano. Transactions can be made by producing own material, dungeons, selling items, etc. A lot of possibilities. The idea that portion of transactions will be given to real world organizations is nice to see. ", "q0r": 4, "q1": "The game seems to be quite complex in terms of all possibilities that would be available once it is finished. The timing of 2 years seem to be realistic and achievable. After 6months game could be playable at certain degree, at that point it would attract more players and presumably more transactions. ", "q1r": 4, "q2": "Yes, it should be possible to audit the progress. There are certain KPIs explained that would be good indicator of the game development. KPIs will be presented on monthly basis once the project gets in the proper development stage. ", "q2r": 4, "assessor": "z_assessor_672", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The proposal about gamers playing and getting rewarded in ADA will attract more gamers to Cardano blockchain. Mention was made that this game is aimed at giving a perfect opportunity to connect gaming with investment and giving a player the opportunity to invest himself into game. Their main slogan is 'The player is the key in every game'. This proposal addresses the challenge effectively.", "q0r": 4, "q1": "With the team's experiences in game testing, game design, business analysis, software development, design and Art, the proposal is likely to be successfully implemented. The detailed plan of the game process mentioned basic gameplay, play to earn, pay to progress/invest, build/grow together. \r\nIt also mentioned 'Race for climate'- while playing the game, the community is giving back to real life earth and will help save a healthy environment.", "q1r": 4, "q2": "The timeline or road map is showing the breakdown into 3 months and 6 months goals detailing the tasks involved. The budget breakdown is done but the bigger amounts could have further breakdown to make it easier to audit and prevent further questions about how much wa used for what.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "私たちは、プレイヤーが資源を耕してRPGキャラクターを作り、プレイヤーが提供するNFTダンジョンで戦うMMOを構築します。プレイヤーがコンテンツ", "experience": "クリスチャン、ゲームテスト、ゲームデザイン(デジタル、アナログ)\nGnana, ビュースネス・アナリスト\nRaja, ソフトウェア開発\nマイク, デザイン, アーティスト"}