{"id": 382358, "author": "mmahut", "title": "Cardano games assets for Unity", "url": "https://cardano.ideascale.com/a/dtd/382358-48088", "category": 26241, "amount": 57000, "description": "ゲームエンジンであるUnityには、カルダノブロックチェーンと連動するためのアセットがありません。", "funded": 2, "upvotes": 182708553, "downvotes": 2669545, "votes_result": 180039008, "votes_cast": 1004, "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Your problem solution is directly inline with this Challenge. Adding utilities that allow game creators to better utilize Cardano Blockchain will engage more adoption.\r\n\"Create Unity (the game engine) GameObjects assets that will allow Unity developers to easily interact with Cardano.\"\r\n", "q0r": 5, "q1": "Your previous experience in creating an active environment for game developers to participate with Cardano is without question. I've check the websites you have provided and all look good. Your timeline is a little aggressive but as you say it's based on your experience so I understand if it extends beyond the two month period. Your budget in is in line with the project however I'm concerned that it eats up a little too much of this funds challenge. You may consider breaking your projects up into smaller functional parts for the next fund.", "q1r": 5, "q2": "The two month timeline is auditable. However I would suggest breaking the man hours out into blocks of deliverables so the community can see progress as it provides funds. The way it is now the funds would be supplied and spent before a definitive audit of success could be accomplished.", "q2r": 4, "assessor": "z_assessor_320", "no_vca": 24, "ne": 1, "ng": 17, "nfo": 6, "vca_o": 1}, {"q0": "Excellent concept.  Unity is a popular game development engine, and enabling it to interact with the Cardano ecosystem could greatly impact the attractiveness to new developers of adopting and integrating to Cardano.  The positive potential of this proposal is considerable.", "q0r": 5, "q1": "The veteran developers created Blockfrost, which is highly known and utilized by the Cardano NFT community.  There is little doubt that this proposal can be successfully implemented with the extensive Cardano integration experience the developers bring to the table.  The plan shows that they expect to onboard a significant number of game developers.", "q1r": 5, "q2": "Costs are broken down.  Proposers intend to track metrics for utilization, including developers onboarded.  Proposer openly invites communication and involvement.  Auditing progress and success is likely to be a simple matter.", "q2r": 5, "assessor": "z_assessor_708", "no_vca": 15, "ne": 3, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The goal of this challenge is for Cardano becomes the go to blockchain to develop gaming applications due to its quality tooling and wide gamer centric user base. This proposal aims to accommodate that.", "q0r": 5, "q1": "This proposer have presented proof that they can implement this proposal and have experience in gaming developement.", "q1r": 5, "q2": "Same as with other proposals from this proposers, the discussion have been promoted and lively. I believe we have all the information needed to see the progress.", "q2r": 5, "assessor": "z_assessor_905", "no_vca": 20, "ne": 1, "ng": 10, "nfo": 9, "vca_o": 1}], "solution": "Unity（ゲームエンジン）のGameObjectsアセットを作成し、Unity開発者がCardanoを簡単に操作できるようにする。", "experience": "私たちはBlockfrostのクリエーターであり、開発者にとって参入障壁の低いサービスやツールを作っています。"}