{"id": 384400, "author": "brianlee", "title": "Connecting Tabletop Games & Cardano", "url": "https://cardano.ideascale.com/a/dtd/384400-48088", "category": 26241, "amount": 50000, "description": "卓上ゲームや物理的な収集品の市場は、カルダノとの統合のための主要なターゲットです。これは、Cardanoにとって未開拓の市場です。", "funded": 1, "upvotes": 33366179, "downvotes": 13100956, "votes_result": 20265223, "votes_cast": 200, "f6_no_assessments": 5, "f6_rating": 3.9333333333333327, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=23103"], "media": [], "f6_assessments": [{"q0": "This proposal aims to create a Cardano-themed physical boardgame, that provides an opportunity to learn more about the Cardano ecosystem and provides physical prizes that are only available by paying with crypto. It sounds like an interesting idea to onboard people who have perhaps heard of Cardano but might be intimidated by the idea of crypto and the complexities of wallets and smart-contracts. For this reason, I think it is a good fit for the challenge.", "q0r": 5, "q1": "The proposer has experience with art and programming but they don't really go into too much detail about that - however it doesn't seem that the level of technical expertise required to accomplish what is set out is very high so there probably won't be any roadblocks in that regard. The team seem to have a pretty good plan laid out for what they are hoping to accomplish and state that production of the game is already underway.", "q1r": 5, "q2": "The proposers have a detailed breakdown of what they hope to accomplish in the given timeline, and the team runs a staking pool", "q2r": 5, "assessor": "z_assessor_142", "no_vca": 20, "ne": 1, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "The proposal is to develop a physical card game based on Cardano, at first, the proposal will only focus on off-chain gaming, at a later stage the physical cards will be connected to NFTs via QR codes. ", "q0r": 3, "q1": "The team provided a bio, I would have liked to see a link to LinkedIn or similar to verify. The proposal has a clear plan and laid out road map for 18 months. I would like to see the proposal focus on the next 3 month only in detail, as the project can continue getting support from the community in F8 and F9.", "q1r": 2, "q2": "The proposal provided a high level 18 month roadmap and lined item budget based. I would like the team to recreate a detailed roadmap with milestones that are connected to the KPIs identified., in this way the team can track performance vs. expenditure over time. I would like the team to break up the proposal and funding over a 4month period, the team can apply for support again in F8 and F9. As the proposal stands at the moment it might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 19, "ne": 0, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "creating a tabletop game definitely addresses the challenge by trying to bring in new cardano members through a table top game and collectible experience.  I hope they connect it to the blockchain and a dapp successfully, but this is something that could bring a lot of spotlight to cardano.", "q0r": 4, "q1": "This plan is very thorough and thought through. They not only lay out a detailed plan for the building and launch of the project, but also a long term vision and goals for sustainability.", "q1r": 5, "q2": "This is a long term play, so the audits will need to take that into account, but the roadmap and other details provided will allow for a successful measure of progress.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Interesting card game idea, and this idea can attract the target players in their problem statement that who want physical collectible than virtual. Therefore, they are going to join Cardano gaming communities. \r\nI hope that the team can provide some KPIs or key metrics to concentrate on, but they also describe that all of their success definition is finishing their milestones in the roadmap. It's ok but I think they should choose some keys to focus on the whole of their journey. It also helps CA assess that their project will adapt to the challenge given or not. ", "q0r": 4, "q1": "The team shows us a great roadmap with detail in single parts of their job including developing, marketing, designs, game development... Moreover, they also describe their option are available for their print runs based on manufacturer pricing. In addition, with some of these attach links and documents, I think they have a bright vision to do their job. \r\nThe important thing to their project is the risk and I don't see that part in their detailed plan. Even with my experience, I can see some risks and their detailed plan seem to solve all but they should be aware of them and prepare something before facing off. ", "q1r": 4, "q2": "They have a good and detailed roadmap that fits with the explanation of the solution that they made. Sure that it can help to solve the problem. And these explanations also fulfilling our need of understanding their big picture. But they need to provide some outcome that would contribute to the network, some key metrics will help CA know that the team is really concerned about the challenge settings. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This proposal, as one for a physical card game, slips in the back door of this challenge rather than meeting it head on. But I don't think one can truly fault it for that, since it includes clever ideas such a connecting physical cards to mintable NFTs. Still, as a result this proposal, as presented, largely amounts to marketing for Cardano. There's nothing wrong with that, but I think it's important to see this with eyes wide open.", "q0r": 4, "q1": "Everything about the game and how to launch its release in phases is very well planned out, and much of the concept art is available on the website, which shows that the project is already in motion to some degree. The proposer has clearly put much thought into their vision and is heavily invested in seeing this project through. Proposers are also long-time community members. So I think it's a relatively safe bet: If approved, we will probably get the card game they promise.", "q1r": 5, "q2": "Here's where I am mostly concerned. The roadmap is good and I don't contest that at all. And while it's mentioned that the game was \"tested\" and that part is complete, I saw very little if any actual information about the playtesting of the game. It begs the question: If the game is produced, how do we know it will be a fun? How do we know it will be an engaging and enticing gameplay experience that people will want to return to and spread word of? Unless some detail is shared about the playtesting process (how many people, how many hours, how much were game rules revised as a result) I'm not sure we can say the game will be good with much certainty. And if it isn't, we won't find out until after it's released. If this proposal fails, I would encourage the proposer to give us more on the playtesting process and results the next time it's up for vote. ", "q2r": 3, "assessor": "z_assessor_853", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "まず、テーマに沿った物理的なゲームを通じてテーブルトップゲーマーにカルダノのアイデアを浸透させ、さらにブロックチェーンを融合させます。", "experience": "アートディレクターとして7年間のエンターテインメント業界での経験を持つアーティスト＆デザイナー。\n15年間のコンピュータとプログラミングの経験"}