{"id": 381873, "author": "benzvibenjamin", "title": "University courses", "url": "https://cardano.ideascale.com/a/dtd/381873-48088", "category": 26244, "amount": 4440, "description": "Бизнес-студенты не сталкиваются с кардано и катализатором", "funded": 1, "upvotes": 29447627, "downvotes": 15942857, "votes_result": 13504770, "votes_cast": 118, "f6_no_assessments": 3, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Valid idea that does seem to address the  challenge. taking Cardano to schools and universities is essential to attract new people.\r\nI liked its mentioned both how many students there are in the school (full potential impact) and how many they intend to reach (probable/target impact)\r\n\r\nHowever, there are some considerations:\r\nIn the plan, some descriptions are a bit vague. What \"well-informed\" mean? Is it to learn about blockchain/cardano or is it related more to a planning phase of the project? \"some advertising\" could also have more details.\r\n\r\nSecond, there seems to be not yet a defined syllabus for the course. Without, it is hard to assess the level of knowledge the students will have afterwards and how capable they will be to have impactful proposals in the next funds (-1start/score)\r\n\r\nApart from that, I liked the idea of having weekly phsycal meet up in places different from the classroom. It helps to strenght bonds and create a more solid network. I also liked the intetion of taking this project, if successful, to other universities in France in the next funds.", "q0r": 4, "q1": "There are 2 already committed people in the project with in principle would be enough. However, it could have moew description of their activities/participation in cardano and catalyst process to evaluate their level of knowledge on to be teaching this to others in the course. Their level of knowdge in blockchain would also be important to know beforehand. Without it, its hard to know wheter they have the capability to create a course from scratch. (-1 start/score)\r\n\r\nThere's a time-framed plan but some steps on it are a bit vague (-1start score), specially the part of \"get well informed\". If this means they still need to learn aboutblockchain and cardano, I see a great risk on this project.. Budget breakdown is sensible and well described, though.\r\n\r\n", "q1r": 3, "q2": "There are good metrics with target and milestones proposed. I particularly appreciate the metrics of a \"conversion rate\" to check how many of the students will have proposals next fund. To evaluate the quality of the course, I'd consider also to check how many will be funded. I'd also add as metrics the general feedback from students (measured either by a NPS or a survey)\r\n\r\nTheres one risk mentioned but no mitigation strategy. \r\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is a good idea. It successfully identifies  the problem within the challenge. Basically the proposer wants to expose Cardano to one of the biggest business schools in grenoble. Note that the school has 7000 students who can potentially hear about cardano. How many of those prospects would be future proposers, CA or any other role in the cardano community. Needless to say that this can add a lot of value to the Cardano ecosystem if the project is successful. I think that the proposer can kill 2 birds with one stone here as local communities can start to copy this and business students are, for sure, a huge asset for the community. So I think that the goals and key metrics are truly aligned with the challenge. Furthermore, I think that the proposal should have no issue to scale in future challenges as there are many ways they can do it.\r\n", "q0r": 4, "q1": "The proposal has high chances to be successful according to the information provided  by the proposer. However, I would suggest to the proposer to provide a link out to other resources that can back their business student status. As for now there is no evidence of the status and skills claimed by the proposer. Apart from that, the number of the team members is outlined in the proposal. The budget has been broken down into identifiable items and it seems reasonable. I want to emphasize that this judgment is based solely on my intuition. Also the proposer has planned to continue the work in fund8 in case of a successful funding. Nevertheless I didn't identify a timetable in this proposal. I suggest to the proposer to add one as it will tell us when the work will be complete. Apart from that, I think the plan is pretty strong and the product being built is clearly described. Altogether, I have confidence in the feasibility of this proposal.\r\n", "q1r": 4, "q2": "This proposal can be audited easily based on the information provided by the proposer. Although the roadmap is not really well written, it outlines all the necessary steps to achieve the final goals. What's missing in the roadmap is a comprehensible timeframe of the steps outlined. For instance the roadmap should include a definite date that signals the completion of this phase of the project. I think that the proposer can easily fix that by adding more precision to the roadmap. I would also suggest to the proposer to add a timetable to the project. Besides these floss, the proposer has added strong metrics and KPIs that define the success of the project. Altogether, the proposal contains a clear description of the problem and the real solution well explained as well. I give this proposal a positive note on its auditability even though it's not perfect.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The problem is that business students at the Grenoble school in France are not exposed to Cardano and its catalysts. The solution was to create a Catalyst course and presentation (both online and offline) for business students. Problems and solutions are clearly presented and easy to understand. I wholeheartedly believe that the solutions given will solve the problem perfectly.", "q0r": 5, "q1": "The writer of the proposal is a Grenoble student, he realizes the importance of Blockchain in the future and Cardano in particular wants to help business students learn about it and become active in this ecosystem. It's a good idea but I feel the proposal needs further development to ensure successful implementation. For example, what your course will cover, who will teach. Possible risks in the proposal and how to deal with it\r\nWhat I know about the team is that the team has two members named Benji and Viktor who are both Blockchain enthusiasts in general and Cardano and Catalyst in particular. Therefore, there is no basis to evaluate the feasibility of the proposal. However, your spirit is very encouraging\r\nThe proponent reflected potential challenges in many details but did not establish any measures to avoid them.", "q1r": 2, "q2": "It can be seen that proponents already know how to establish a reasonable actionable plan. A roadmap showing how people claim to plan to make their approach available to a wide variety of audiences\r\nKey indicators to track project progress are also provided. The budget is clearly and concisely defined, with a reasonable amount.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}], "solution": "Создать курс о Catalyst и провести презентацию (как онлайн, так и реальную), предназначенную для молодых студентов-бизнесменов", "experience": "Студенты бизнес-школы\nЧасть студенческой ассоциации\nРаботающие в сфере маркетинга и рекламы"}