{"id": 382528, "author": "darkartopia", "title": "Olon CNFT physical gallery London", "url": "https://cardano.ideascale.com/a/dtd/382528-48088", "category": 26244, "amount": 98000, "description": "Художники, коллекционеры изобразительного искусства и любители искусства оторваны от пространства NFTs. Им трудно понять его идею и войти в него.", "funded": 1, "upvotes": 30944280, "downvotes": 20041675, "votes_result": 10902605, "votes_cast": 150, "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "In all honesty, the problem statement is quite general. But , if it is well addressed, I believe there is a lot of potential to be unlocked. Even though I am not part of the target market for this proposal, I understand that people who are traditionally collectors and art lovers may find blockchain and NTFs to be somewhat abstract. Additionally, I believe that the proposed solution is aligned with the objective of this challenge. During the next six months, the team expects to sell 100 CNFTs and introduce 60 artists to the Cardano ecosystem and CNFT space. To be honest, selling 100 pieces in six months is quite conservative considering that, at the time of this evaluation, approximately 5,000 CNFT had been sold in 24 hours. \r\n", "q0r": 4, "q1": "The team was able to assemble a suitable combination of skills and experiences. Despite the links provided for checking their LinkedIn profile and considering the type of proposal, I would find it interesting if they could provide additional evidence of their areas of expertise in each case. This proposal contains a detailed breakdown of the budget and a description of the possible sources of revenue for the project, both of which I found to be positive. However, I cannot assess the reasonableness of the costs presented, since they are specific to the context in which the gallery will be located, this will not affect my evaluation criteria. I appreciate the team identifying what could go wrong. I notice, however, that you propose a countermeasure in which your website would include a virtual 3D model of your gallery and you don't include the related development and maintenance costs in the budget.  \r\n", "q1r": 4, "q2": "Here, I would like to congratulate the team for presenting all the auditability information in such a simple and effective manner. The team describe four major milestones that will lead to a final objective, which includes the sale of 1000 CNFTs, the onboarding of over 1000 users, and the holding of NFT and private events. From an auditability perspective, this is useful in understanding what happens at what time. Additionally, it provides success metrics that are fully aligned with the problem to be solved and what this challenge seeks.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 21, "ne": 9, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The success criteria are related to the challenge question. The point of the proposal is that artists, art collectors, and art lovers are connected to the NFTS space. The solution was to create a space to educate artists about NFT and Blockchain technology. I think this proposal can accomplish the stated goals", "q0r": 4, "q1": "The proponent seems to have enough knowledge and experience to come up with good content as he is suggesting. In terms of the author's ability to develop the project, the team consists of 3 members, we have a complete and satisfactory description of the team, including the field of training, time of experience, work / activities their own and even multiple attached LinkedIn profiles\r\nThe problem description is very broad and the proponent decided to choose win-win solutions as the main framework.\r\nThe proponent reflects the potential challenges in many details and establishes a number of measures to avoid them.", "q1r": 4, "q2": "The data provided can easily be served to check and monitor the process in promises, schedules and KPIs that are easy to understand and will help the community to know if this project is successful and will help community knows whether this project is successful or not.\r\nBudget offers $98,000 but interpreting the budget in GBP is a bit difficult to convert, however, all costs are reasonable", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "I strongly agree that this proposal addresses the challenge since it wants to create a NFT physical gallery in London, where CNFTs will be displayed and attracts a number of visitors, and get them on-boarded Cardano.", "q0r": 5, "q1": "I have checked on the proposers' profiles and I think they are capable of running this project since they have an artist, a blockchain expert and a project manager. Everything is well planned and presented. \r\nThe only thing make is concern is the sustainability of the gallery since its monthly rent is expensive (3000-5000 GBP/ month). I suggest team calculate specifically about the interest from selling NFTs and tickets for visitors to cover rent. ", "q1r": 5, "q2": "This proposal provides me sufficient information to audit its progress and success. Roadmap with milestone is coherent. Key metrics to success and KPIs are feasible to reach since I think NFTs art is so magnificent and will impress many more than 600 London users in half a year. Goodluck to team!", "q2r": 5, "assessor": "z_assessor_836", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Пространство для просвещения всех желающих об искусстве НФТ и технологии блокчейн, обеспечивая при этом простой и привычный способ создания, просмотра и приобретения НФТ.", "experience": "Профессионал в области искусства/художник на руководящей должности в ведущей галерее современного искусства, сформированная команда с разработчиком программного обеспечения и специалистами по финансам"}