{"id": 384707, "author": "siddharthkonma", "title": "Konma Xperience Centre", "url": "https://cardano.ideascale.com/a/dtd/384707-48088", "category": 26244, "amount": 51648, "description": "Учебные центры - это скучно! Представьте себе вместо этого центр Xperience, который показывает реальные примеры использования технологии Blockchain!", "funded": 1, "upvotes": 48738596, "downvotes": 12013428, "votes_result": 36725168, "votes_cast": 129, "f6_no_assessments": 4, "f6_rating": 4.416666666666666, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=3819"], "media": [], "f6_assessments": [{"q0": "It is the team's opinion that there are more effective ways to introduce people to the world of Blockchain and make a compelling business case for everyone to learn more about it. In order to demonstrate how DTL solves everyday problems, the team proposes to create a number of physical \"Xperience centers\". The authors also suggest a hybrid experience that allows the individual to select which type of experience they prefer. An excellent job has been done in describing both the demographics of the first hub location as well as the target audience. In conclusion, after analysing the success metrics presented, I can determine that there is a clear alignment between what this challenge seeks and what this proposal aims to accomplish. Congratulations guys. \r\n", "q0r": 5, "q1": "Once again, the team does a fantastic job of demonstrating feasibility by giving a detailed and complete explanation of their action plan, they provide links where you can explore the ramifications of Konma, where you can see that it is actually a DAO. Konma as an organization has 7 proposals in the current Catalyst cycle, of which none describe the team members. I was only able to identify 4 people on the Marketplace website. It is not entirely clear to me if these people are the ones who will be leading the implementation of all initiatives. Although the budgets of the proposals detail the relevant hires, it would have been helpful for me to identify at least one leader for each proposal. Although the budgets of the proposals detail the relevant hires, it would have been helpful for me to identify at least one leader for each proposal. The budget is broken down into 4 items, but unfortunately, I have several concerns. In the roadmap the project is described as \"Searching for real estate (Nov 2021),\" while at the end of the proposal submissions period they could confirm that they already had the local contract. Another aspect that should be improved is the breakdown of the operational costs, meaning that salaries are mixed electricity, setting up coffee, etc...\r\n", "q1r": 3, "q2": "The team makes an excellent case in this regard. There is a road map for every month beginning in November 2021 and culminating in October 2022, as well as a brief description of the actions to be taken. I do, however, believe this could be improved. Instead of describing, \"Searching for real estate (Nov 2021)\" as a deliverable, it may be more useful to describe it as \"A real estate contract has been signed\". Similarly, instead of describing \"Renovations in progress (Jan 2022)\", I would recommend describing it as \"renovations completed\". As a result, the community will know what to expect at each phase of the implementation. When it comes to the success metrics, I find that they are concise, accurate, they cover all aspects of the project, and they are completely aligned with the challenge. \r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 19, "ne": 9, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Very good idea and well written proposal.\r\nBring real experience to local communities is essential to show the true blockchain applications and can strenght the bond with it.\r\n\r\nThe proposal is also very well written and structured. It shows clear the target audience and its size, which is essential in a project like this. I appreaciated the experience is very detailed here as well\r\n\r\nMy only point of concern is not to turn the experience into a mere \"shopping brainwashing\". The shopping itself should be just a collateral effect, not the main  mean to make the experience vivid, so, proposer should be careful here.\r\n\r\n", "q0r": 4, "q1": "Konm is already a company, which is verifiable by the links provided. However, it would be nice to know the size of the team and their individual or group capabilities. A project like this will require several.\r\n\r\nThe plan is very solid and detailed. There is a clear roadmap to achieve the final goal.\r\n\r\nBudget breakdown is clear and is not so big for the size of the project,\r\n\r\nAll in all, the proposal seems feasible but it would be nice to have more details on the team itself.", "q1r": 4, "q2": "There are clear and good time-framed metrics with targets, which is really good!\r\nThere also good milestones during and after development/implementation.\r\n\r\nThis project is, in general, easily auditable during and after finished.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This proposal aligned with the challenge setting which is to bring community together to learn and socialize. Xperience centre is an offline community hub (centre) that will first open in India. The idea is to make learning experience much more interactive and engaging, by providing a real life use case of how DLT is used to solve daily problems. With Konma being an integrated project (there are couple others of Konma's proposal), this center will let people experience the blockchain world in real-time. This will benefit the Cardano community in term of awareness of its technology and adoption.", "q0r": 5, "q1": "This is an ambitious project from Konma team, having a real life place to build the hub centre. They got the action plan explained in details and scheduled for the next couple of months. However, there aren't any information regarding the people working on this project. It only says Konma team, but we don't know who these people are. This would be a big concern as this is a big project and not an online or website thing like many other hub does. Initial dedicated team information is needed to reassure the feasibility of this project.", "q1r": 3, "q2": "The roadmap, key metrics, and KPIs is explained in detail. From the 5,000 community members goal in 1 year, to a laid out plan for 12 months milestone. However, as this is a local physical hub location in India, the audit process would be rather different from the usual remote event (such as online workshop, YouTube content, Meetup event, etc). But it doesn't mean it's impossible to audit, because this is a public event and to attest its legitimacy of the progress, there will be real people attending the event on location. I'd still giving it a 5 stars because of how comprehensive this proposal is on metrics and KPIs explanation.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 16, "ne": 6, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "First of all, this proposal brings up an innovative idea since everyone has interested in tech or wanting to know about it, will reach out on cyber-space. This proposal wants to build up an off-line Xperience Center in the tech city Chenai, India. Aim-ing to get more people explore and engage in blockchain/ Cardano/ ADA during the tour in the center. I think this proposal addresses the challenge in a creative way!", "q0r": 5, "q1": "The team presents everything needed to run this proposal and the feasibility of it seems highly likely. I just want to suggest 2 things:\r\n- I would be better if the proposal breaks down its budget more. For example, add reference for rent $829/ month, and how large the venue will be for this budget.\r\n- The roadmap with different 12 topics for 12 months seems a bit intensive, so it would be helpful if I can know more about the team members, since the description about the team is not very specific. ", "q1r": 5, "q2": "I think it proposal is written well and quite sufficient information for assess. Again, building an Xperience center is a huge project, so the human resources should be considered/ informed more so that voters could give their votes. ", "q2r": 5, "assessor": "z_assessor_836", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Центр Xperience, где участники смогут узнать на примерах в реальном времени, как Konma использует блокчейн и создает решения на Cardano.", "experience": "У нас есть эксперты в области розничной торговли, электронной коммерции, управления сообществом, маркетинга и технологического факультета, чтобы предоставить соответствующий опыт сообществу."}