{"id": 384941, "author": "nzola8", "title": "Lokole Education Centre in DR Congo", "url": "https://cardano.ideascale.com/a/dtd/384941-48088", "category": 26244, "amount": 9420, "description": "Более 40% африканского населения не подключено к Интернету, а многие другие не имеют доступа к недорогому образованию.", "funded": 2, "upvotes": 65370806, "downvotes": 2281096, "votes_result": 63089710, "votes_cast": 128, "f6_no_assessments": 3, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is interesting but it doesn't clearly identify the problem in the challenge. I think that the creation of a device that helps communities get connected is a must, but they failed to mention how this can encourage mass adoption and bring value to the cardano ecosystem. Nevertheless, I think that, with some creativity, the proposers can include cardano into the device in order to add value to the ecosystem. My suggestion for the proposer is to write a better proposal with the cardano ecosystem in mind.\r\n", "q0r": 4, "q1": "The proposers have provided relevant skills and experiences with links to their github. They also managed to build a functional product that, according to the proposer, is being used in Congo. The team needed to a successful conclusion is also outlined in the proposal. The roadmap is broken down into understandable items. Based only on my intuition, I think that the prices and the budgets are reasonable. A detailed plan of what  they intend to build and how they plan to achieve it is also disclosed in this proposal. Nevertheless, I would suggest to the proposers, to add the challenges and risks they consider upon successful implementation. Apart from that, I believe that the project can be implemented successfully.\r\n", "q1r": 5, "q2": "The proposer has provided a roadmap and reasonable milestones to reach their goals. They have also provided  the metrics needed to measure the success of the project. I think that the problem they want to solve has been  clearly described as well as the solution.\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 15, "ne": 4, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This proposal addresses the essence of engaging local communities and getting them to ultimately adopt a product: it only happens if the product first helps the community to achieve something for itself.  And that phenomenon only happens in the most intimate and legitimate way possible if what the community pursues means being a little less in the hands of obscurity.\r\n\r\nIf Cardano wants to be in people's lives, it must contribute to changing their lives in ways that actually have flesh and blood flowing through their veins.  This proposal has those characteristics.\r\n\r\nThe budget and its description describe a recipe with just the right measures and a justified purpose. \r\n\r\nThey seem to have come a long way without Cardano.  With us they could make incredible progress.", "q0r": 5, "q1": "The voter will be interested in knowing more about the following aspects:\r\n\r\n- Please provide external links where it is possible to learn more about the proponents' experience, their background, their overall journey with \"Lokole\".  \r\n\r\n- Develop in a more specific way the activities related in the Road Map. \r\n\r\n- How do you see the success of the proposal in 3, 6, 9 months from the funding of the proposal?\r\n\r\n- Any other information of interest.", "q1r": 3, "q2": "There are no KPIs to measure the development of the proposal.", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "This proposal addresses the challenge by developing an off/online portable web and email network called \"Lokole\", which has been created since 2017. For the goal of helping more people in Congo get access to the internet, since 40% population of Africa doesn't. I can see if they are connected to the internet, they will get digital education. I suggest this proposal to expose more information about how many courses about blockchain or Cardano included in the Lokole ports if it is funded, so that it could show more value this project can add to Cardano and/or Catalyst. \r\n", "q0r": 4, "q1": "I checked on the link about the team and yes, I think they are capable of running this proposal due to relevant experience. Budget is broken down in details and very reasonable. I think the voters if they have time, should take a look at the articles in the link added, Lokole was recognised and the proposers did help many local people since 2019. I strongly agree that this proposal will be implemented successfully. ", "q1r": 5, "q2": "This proposal provides me enough information to assess the progress in attaining its goals. Again, adding more information about the hub will contribute to blockchain/ Cardano/ Catalyst (for example: to involve the ecosystem in the digital education) is definitely helpful. ", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "Мы создали портативную веб-сеть и сеть электронной почты под названием \"Lokole\", чтобы помочь создать подлинно африканскую сеть цифрового образования.", "experience": "Группа разработчиков Open Source, инженеров-программистов, кодеров и электронщиков, использующих Python, Microsoft Azure, Flask, GitHub и RPi."}