{"id": 384443, "author": "ben.mesnik", "title": "Browser tool- How to use DeFi dApps", "url": "https://cardano.ideascale.com/a/dtd/384443-48088", "category": 26243, "amount": 49800, "description": "DeFi is difficult to use and understand. It's a new paradigm that requires knowledge of how DeFi components work and mistakes can be costly.", "funded": 2, "upvotes": 68022355, "downvotes": 5717702, "votes_result": 62304653, "votes_cast": 159, "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem and solution described makes sense and is within the scope of the challenge. For a DeFi dapp to be functional and useful, it needs a good UI (user interface) and this proposal is seeking to improve this experience, bringing a tool that can enhance the use of dapps.\n\nAlthough the concept is promising, it is not clear how this \"buddy\" tool would be integrated into the dapps. Each dapp has its own interface and concept, so a \"buddy/wizard tool\" needs to be thought of individually so that it is appropriate for each dapp.\n\nRelevant metrics were included, which would allow quantifying the tips for the dapps at 3 and 6 months and that help to understand the positive impact on the challenge, but it is not clear how these tips will be evaluated in terms of quality. Any financial dapp needs rigor with tips for users, and while it is specified that tips will be audited, it is unclear exactly what this audit means. Who will audit this? Will there be a partnership with the developers of the dapps?\n\nI would recommend including more indicators/KPIs that could indicate the potential impact of the challenge.", "q0r": 3, "q1": "The proposer described experiences that may be relevant for the development of this proposal, but there are no sources or links that allow evaluating his qualifications. I would recommend adding links to Linkedin and repositories so the community can check the proposer's experience/qualification. Are you participating in Plutus Pioneer? Which cohort? Did you complete the program?\n\nThe budget presented seems reasonable and realistic, the hourly rates are within the reference prices of the market, but the workload presented is difficult to evaluate since there is not a great technical detail regarding the development of the extension.\n\nThe budget amount set for the translation does not seem solid to me as there is no estimate of characters or words to be translated, so there is no way to indicate whether the translation budget is appropriate or not.\n\nThere is a realistic timeline for the development of the project, however there is little information about how the extension will work. Each dapp has a different interface, so the extension needs to be customized and this creates a big project dependency on the dapp developers.\n\nI believe that this proposal has an interesting concept that can be taken advantage of, but it needs further clarification on how the tips will be integrated with each dapp. The feasibility of the project depends on the complexity of integration with each dapp, so this point is a big unknown.", "q1r": 3, "q2": "There is clarity on the problem and how it relates to the challenge, but the solution needs more detail, mainly on how each tutorial will be customized for each dapp and if this is feasible.\n\nThe defined metrics are acceptable indicators for evaluating the quantity of tips, but they are poor quality indicators. I would recommend including KPIs/metrics that allow you to evaluate tips performance. e.g. A simple button that allows the user to say if the tip was useful or not. How will the security of the extension be evaluated? If a user loses funds due to an inappropriate tip how will it be counted?\n\nThere is a roadmap with reasonable deliverables, which helps auditability.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 21, "ne": 12, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposal satisfies none of the \"Key Metrics\" of this challenge. If we apply a strict reading of the challenge, there's not a lot room for ancillary DeFi resources that's not actual DApps. With that being said, quality education is key maintaining \"daily active\" and other ongoing user driven metrics after novelty wears off. In this sense, this proposal effectively addresses the challenge.", "q0r": 4, "q1": "It is clear that Sir Ben has the technical and leader skills to execute. What is not clear is Ben's chops as an education. It would be helpful for the community to know about who is going to being these videos as well more details about proposal thinking around the community curation of tips.", "q1r": 4, "q2": "The metrics are clear and easy to audit. The community should have no problem tracking whether or not there's 100 tips within 3 months or that there are  tips for 10+ projects. What isn't clear again is how the community might go about verifying that tips are audited before addition to the Tip Genius knowledge base. ", "q2r": 4, "assessor": "z_assessor_336", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The idea is great and could improve the usability of Defi d'Apps. However, I am not sure re the alignment to the challenge. The challenge focuses more on new Defi d'Apps than improving user experience and usability, which are important but maybe aligned better with other challenges. In addition, to show impact on Cardano ecosystem at this point you could have add also list of DeFi d'Apps that you can work with and give some specific use case examples. ", "q0r": 3, "q1": "While the proposer seems to have a great background and was part of plutus pioneer program there are no links to support it. The website tipgenius.info is offline and Linkedin profile would have been helpful. Again it will be helpful to have a list of DeFi projects they would like to support, discuss with the project potential partnership and maybe focus on this proposal on a first pilot use case. The roadmap is clear, but having the 3month break down will be recommended to be more clear on deliverables. Great to have a 12 months scope of KPIs and deliverables. The budget is well detailed. Good to have some risks and challenges although could be great to add how to mitigate it as well. ", "q1r": 3, "q2": "KPIs and deliverables are clear and could be audited. Could be good to add some KPIs on how the tips improve the usability of the DeFi app. Also for better audibility, especially in the first 3 month, it could be good to break down KPIs and deliverables on a monthly basis.   ", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 23, "ne": 2, "ng": 21, "nfo": 0, "vca_o": 1}, {"q0": "The proposer want to launch a video that will pop up on a browser extension that will explain how to use specific Defi dApps when interacting with them. ", "q0r": 3, "q1": "The proposer is the founder of Tip Genius, and a Plutus pioneer developer, and is capable of successfully implementing the project. The plan mentioned that they will educate people on how to interact with the Apps; translate tips to 6 total languages and then release Apps. All these facts will lead to successful implementation of the proposal.", "q1r": 4, "q2": "The road map is clear stating 3 , 6 and 12 months scheduled work with details. The budget is broken down in details to make auditing easy.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 25, "ne": 1, "ng": 14, "nfo": 10, "vca_o": 1}], "solution": "Integrated educational video tips via a popup browser extension that explain how to use specific DeFi dApps as you interact with them", "experience": "Founder of Tip Genius, an automated video game coach that shows short video tips via an overlay live as you play\nPlutus Pioneer & Developer"}