{"id": 366767, "author": "", "title": "Planting Roots in Africa", "url": "https://cardano.ideascale.com/a/dtd/366767-48088", "category": 26108, "amount": 57000, "description": "Best solutions will come from the ground, but African devs lack infrastructure to push Cardano forward. Cardano community support is needed.", "f6_no_assessments": 5, "f6_rating": 4.4, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=35662"], "media": [], "f6_assessments": [{"q0": "To proceed with your project, I highly recommend analyzing why other projects have failed as well as selecting a project category that matches the unique characteristics of crypto funding and seeks to solve the problems presented. Since the beginning, I have always liked the vision and the mission of the WADA team and I will be pleased to see the continuation of the next steps with the WADA team's commitment and passion.", "q0r": 4, "q1": "Your idea proposal was interesting to read. Thank you for sharing. To make this proposal more relevant to the Cardano community, please consider the following suggestions: The project's objectives and focus can be improved. ", "q1r": 4, "q2": "The presentation of the idea has some shortcomings: the long-term purpose and costs breakdown, and the underlying principles. Finally, the cost estimate lacks structure and a clear grasp on the following question: \"How have you determined that USD was necessary? Overall I believe most of all the necessary details are present and overall the purpose is well explained, but to make the proposal even stronger the above recommendations can be considered in my opinion.", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The problem and solution statement is clear and reasonable.  African devs lack the infrastructure to push Cardano forward: Funding basic infrastructure in African hubs will start solving the problem. This proposal hits the key metrics outlined in the challenge settings - Number of purely African participants and Novelty and appropriateness of solutions. Therefore, I strongly agree that this proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "LinkedIn profiles are helpful to assess the expertise and roles of each team member. The profiles show relevant skills and experience needed to implement the proposal. The budget is outlined clearly and broken down into identifiable items. The budget is reasonable to achieve the set goals. I like the idea of collaborating with established businesses to ease government/ council harassment. \r\nThe risk assessment is clearly defined. Challenges and risks relevant to a successful implementation have been considered.\r\nI would consider providing a verifiable plan for additional funding being required to implement this proposal.", "q1r": 4, "q2": "The proposal team provides adequate documentation. To improve auditability, they could add more information on a timeline for the metrics like - New developers recruited and - New start-ups willing to collaborate. It's not clear what the community should be expecting or what timeline they should extend. I neither agree or disagree that this proposal provides enough information for the community to review progress.\r\n", "q2r": 3, "assessor": "z_assessor_311", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "I strongly agree with this proposal in the sense that it seeks to provide basic infrastructure such as electricity with power UPS integration,back up generators,fueling,rentals and maintenance which will curb blownouts/blackouts which most local Africa companies encounter.\r\nIt also aims to provide adequate internet access,chairs,tables,desks  screens and other learning materials to improve education.\r\nThis proposal will create links/connections between people and ideas(innovations) to simplify activities in the ecosystem.", "q0r": 5, "q1": "I strongly agree with this proposal based on the sufficient links and references provided which is very accessible and its contents is insightful.\r\nIt also has an outlined budget structure with timelines backing  it to pursue the necessary goals. The proposal has a record of expertise who are determined to execute their quota to make this task possible according to their works so far.\r\nThe proposal seeks to hire legal practitioners to acquire all necessary legal documentations to ensure that government officials and potential users can understand and accept their operations and business and to adhere to all local standards and regulations in the Afican ecosystem,which is very laudable.\r\nThe proposal has elaborated how well it will maintain its operations in terms of funds,materials and equipments.", "q1r": 5, "q2": "I strongly agree with this proposal considering the metrics in place,such as opening multiple resource centers/hubs across Africa to aid the adoption of cardano dramatically,networking in mobilizing local communities to solve local problems using cardano,create capacity expansion of IT hub relationships amongst governments,academics and businesses as a whole which will go a long way to impact Africa.", "q2r": 5, "assessor": "z_assessor_497", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The problem and solution statement is very clear and reasonable. The Proposal is highly aligned with the challenge at hand and has absolute potential that infrastructures can be made available to help outsourcing of best solutions from ground devs to help push Cardano forward. Looking at the relevant experience, it's stated clearly that  the team already has started delivering this project even though they've not been funded for. They have a skilled team of Cardano Community Practitioners and entrepreneurs located in Hubs, which is a good form of infrastructure across Africa. \r\nThe inclusion of education and outreach in this proposal is also a good initiative. Reason being that the kind of preconceived knowledge most people in most African Countries have is very poor and requires that these people must be reached with the accurate information (facts) to help convince in supporting of Cardano growth in the continent. Infrastructures without good outreach and education I think would be of no relevance so kudos to the idea of education and outreach inclusion.\r\nWith that being said, there's expectation for quick implementation, which increases the potential for positive impact on Project Catalyst.", "q0r": 5, "q1": "From reference and past successes, there's quite a good experience which affirms that this proposal will be successfully implemented. Hubs in 8 unique African countries is a clear indication that this team can do the job of expanding to all the other relevant African countries with infrastructure (hubs).\r\nA lot of efforts have been invested to outline problem, solution, activities, roadmap and costs except that I'm not seeing any line talking about sustainability which is why I'm not scroing it 5. However, the other many tangible information affirms for me that this proposal adds excellent value and will succeed.", "q1r": 4, "q2": "Everything is clear, concise and to the point. \r\nThe need is clear, implementation is already promising. \r\nThere's enough information about the team and metrics which would help the effective tracking of their progress by the Project Catalyst community. \r\nI think they could've requested for a higher budget/compensation for their work  because honestly, they deserve more.  But even with what they've requested for, I believe most of those who do the work are modest people. \r\n", "q2r": 5, "assessor": "z_assessor_565", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "The proposal fits very well with the objectives of the challenge, addressing a key issue on the African continent: the lack of structure that local populations face to develop technology projects. The WADA group, which I remember having already met in a proposal I evaluated before, is centered on African projects and, according to what they say, it has contact with other, smaller groups that will act directly in the investment, depending on the sector. For example, the money they ask for in financing will be invested on different fronts, from stable/quality energy supply and internet to renting physical spaces, chairs, tables and so on. In fact, it is sad to think that such resources, considered basic in other parts of the world, are scarce and expensive for the inhabitants of Africa, and even before investing in more complex projects - like several I have evaluated here, which involved the creation of sites, games and platforms that benefit the African people - it is necessary to pay attention to more primary resources, as this proposal suggests.", "q0r": 5, "q1": "There is no doubt how prepared the team is to execute the project. As I said in the previous comment, I already knew the WADA group of previously evaluated proposals (from what I remember, at bottom 5). And there's a part of the website attached ([https://wadalliance.org/about-us/](https://wadalliance.org/about-us/)) where we can get an objective and satisfying view of who they are, what each member does, and some have also attached the linkedin profile. In this way, it transmits a lot of security with regard to the technical competence to execute the proposal, in addition to being an already consolidated group and possessing a network, it will certainly have sufficient influence and contacts to put its plans into action. About the project's applicability, I have some points to comment. It is true that the team tried to inform us more generally what would happen in each time period after funding, measured in months. However, as it is a proposal of huge proportion, the activities of each month are complex and I felt that they required more detail from its parts. For example... right at the beginning, 6 spaces would be acquired equipped with internet and all the infrastructure to perform the tasks. But where would these spaces be, in which countries? In each of these spaces, called hubs, would happen, for example: \"Organization of recurring events, education in functional programming and blockchain technology\". What nature would these events be, within the bed of subjects that could be addressed in the Cardano ecosystem? How would these education projects take place, how would the contents be passed on? I believe that with this proposal, the WADA group intends to make a real revolution in the Cardano universe in Africa, but precisely because there are many activities, it would be important for us to better understand each one. One suggestion is to set up a website or even a slideshow to better detail each activity in the phases.", "q1r": 3, "q2": "We are presented with success metrics by which the community could track the progress of this project. The financial amount is very well detailed, through a slide attached in a document in the docs. In addition to these more standard details, the team that created the proposal was concerned to expose the risks that would involve this project, emphasizing the legal issue, and how they could deal with them. In this way, the auditability is very well done, there is enough detail to understand how things will happen and how we can monitor them.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}], "solution": "Funding basic infrastructure in African hubs will allow us to collaborate, coordinate, educate and initiate building out local use cases.", "experience": "WADA: Skilled team of Cardano Community practitioners and entrepreneurs, located in hubs across  Africa and the diaspora."}