{"id": 368190, "author": "", "title": "Transform Africa through Technology", "url": "https://cardano.ideascale.com/a/dtd/368190-48088", "category": 26108, "amount": 45000, "description": "Africa lags behind in digital transformation yet economic development is linked to tech and a digital culture; youth unemployment rises.", "f6_no_assessments": 4, "f6_rating": 3.3333333333333335, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=5328"], "media": [], "f6_assessments": [{"q0": "Technology has a great role to play in the growth of Africa. Organizing bootcamps is a good idea to introduce technology to people in Africa. My only concern is that the proposal does't specify what happen after the bootcamps. Maybe the students of the bootcamp can be introduced to the cardano ecosystem. This way they can become proposers, CA or just work on projects. This could represent the end game of the bootcamp.", "q0r": 4, "q1": "This proposal does not offer enough details about the team. The implementation can be done but I dont have evidences. I wish that the proposer give us more details about his experience like previous similar works or his linkedin profile.", "q1r": 4, "q2": "The budget is detailed and the roadmap is clear. I think that the proposer has provided enough details that can serve as auditing points for the community. I give it a 5.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This proposal highlights Bootcamps in Blockchain, AI, and entrepreneurship in all lingua franca to equip and empower the youth to contribute to economic development. There is a solid roadmap and the BootCamps will start in September.", "q0r": 5, "q1": "Proposer is an entrepreneur and the founder of Pan-African Tech Foundation with a passion for technology and innovation in Africa, and mentors and advises African technology start-ups (including Fintech and Agrictech start-ups) on strategy and capital raising. There is a focus on socio-economic development in Africa Programme managers, experts in AI, blockchain, trainers and mentors across the continent, entrepreneurship hubs and ecosystem builders. The team listed on the proposer's website demonstrates a very solid foundation for this proposal.", "q1r": 5, "q2": "This proposal has very defined milestones and the KPIs are not clear. The goal is very ambitious to provide education and experience to 10,000 people across Africa within 6 months. The budget is very reasonable, and the audibility can be measured. ", "q2r": 4, "assessor": "z_assessor_449", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "The proposal has been provided by a not for profit organisation based in London that services the African continent. The problem being addressed is technology literacy rates in Africa that will improve economic development into the future. This represents an extremely valid challenge problem. I would have liked to have seen further examples of how this will work in practice, visions of the organisation in terms of the graduates and their opportunities. Certainly has the potential to add much to the Cardano ecosystem in Africa. ", "q0r": 4, "q1": "The team appears to be well experienced as a training provider to African clientele although I could not locate any alumni portals to verify. The products appears quite polished and well written although I found some of the texts for some courses to be quite expensive which I found counter intuitive. The plan appears straightforward enough but lacks some detail. Website is informative and gives optimism that project will be implemented successfully. I am unsure if the budget is realistic or the KPI's stated achievable except in a superficial manner. ", "q1r": 3, "q2": "I really like the concept but given the information provided some aspects did not meet my expectations of how the team would achieve their goal. For example each boot camp costs $15000 USD and yet KPI's to measure 5000 -10000 participants across the continent. The logistics of this do not appear in the proposal so cannot be accurately gauged to risk assess likely success. I would love to see more information purely about how the boot camps will run, access participants and engage alumni so that the intended goals can be met. ", "q2r": 3, "assessor": "z_assessor_53", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Quite vague - especially as no referral are made to any content related to these bootcamps nor any outcomes base benefits", "q0r": 1, "q1": "Also quite vague in terms of schedules and the target audience and walk away benefits for ongoing momentum", "q1r": 1, "q2": "Deliverables/outcomes not clear - so very difficult to audit any acitvity - especially @ 15k USD a pop.", "q2r": 1, "assessor": "z_assessor_633", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "Bootcamps in blockchain, AI, and entrepreneurship in all lingua franca to equip and empower the youth to contribute to economic development.", "experience": "Programme managers, experts in AI, blockchain, trainers and mentors across the continent, entrepreneurship hubs and ecosystem builders."}