{"id": 368525, "author": "", "title": "Incorporating Non Profits", "url": "https://cardano.ideascale.com/a/dtd/368525-48088", "category": 26108, "amount": 2500, "description": "To build a global network to the outreaches of Africa and make existing Network stronger.", "f6_no_assessments": 5, "f6_rating": 1.6666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Making the existing network stronger will have great impact on Cardano's growth in Africa. Helping communities is a great way to build trust and network. The proposal fails to explain in detail how it or the non profits would help communities or grow the network.", "q0r": 3, "q1": "No evidence or info about proposer's experience. Adding more info and proof about yourself or the non profits will boost voter and CA confidence. The budget allocation and plan is also unclear. Stating clearly what the money will be used for will make the proposal seem more viable.", "q1r": 1, "q2": "No info has been provided to show how this project will solve the problems it wants to solve. There is no way to track the progress or success of this project. Providing goals at certain points in time is a great way to measure the progress and success of your project. You also need to consider risks and challenges. How would the network survive once you leave? Did you help the communities become able to help themselves or are they dependent on frequent visits from you?", "q2r": 1, "assessor": "z_assessor_140", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal clearly highlighted a problem and a solution, but there is a complete lack of detail to the solution or how this solution is different from an NGO.\r\n\r\nThis proposal is lacking the necessary details to form a decision on addressing the challenge.\r\n", "q0r": 3, "q1": "The proposal did not present any verifiable expertise with links and no implementation plan.\r\nThere is no breakdown on how the requested amount will be utilised in implementing the solution.\r\nI strongly disagree.\r\nI strongly disagree", "q1r": 1, "q2": "No audit information provided.\r\nI Strongly disagree.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "The problem description doesnt't present a problem and the idea is not clear. Draft proposal. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility  assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability  assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The idea behind this proposal, to build a global network to outresaches of Africa, is too broad. I wish that the proposer could give us more informations on  this idea. There is not enough room to give a jugement on the impact it will have on the cardano ecosystem. This proposal does not address effectively the challenge.", "q0r": 3, "q1": "The proposer didn't provide any imformation about the implementation of his idea. I give it a 2.", "q1r": 2, "q2": "There is no plan, no real project on this proposal. ", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The idea to build a GNO(Global Network Operations) does indeed fall within the parameters of the challenge. However, seeing this proposal it is clear that this is just an idea and is nowhere near to being a solid proposal. There is no context to how the proposer plans to actually work out his proposal. ", "q0r": 3, "q1": "I don't see this proposal working out. It's obviously still in an early stage of an idea. There is no detailed plan on how the proposer plans on implementing this. The proposer says he has 30 years of experience but gives no reference to this. However, I think giving a reference for being an ordained minister is not that easy. This gives the impression that he surely knows how to sound convincing and knows how to talk to people but to start a GNO there are so much more skills needed. The is no budget explanation as well. I would suggest working this out to an actual proposal for the next funding or search for another GNO proposal that gets funded and help there. We are one community.", "q1r": 1, "q2": "The idea is great but the proposal is missing almost everything else. We don't have a roadmap on where we can base an audit on. No budget breakdown to see why the budget is needed. No milestones to see how this proposal can be called successful after funding.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "In my past experiences I have incorporated nonprofI to help communities . By utilizing  my expertise background we would start relationships", "experience": "I am a Ordained Minister for ver 30 years as well as  and will start w my affiliations. With organizations affiliated  in Africa."}