{"id": 368891, "author": "", "title": "TheCatalystSchool - Focusing Africa", "url": "https://cardano.ideascale.com/a/dtd/368891-48088", "category": 26108, "amount": 9840, "description": "How do we enhance the African community participation in Catalyst process and accelerate Cardano adoption and impact on the continent?", "f6_no_assessments": 2, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal outlines a solution that is direly needed. Unfortunately you have to go through all the WADA proposals / links and The Catalyst Shool main proposal to understand how fantastic this collaboration is. The low data approach is spot on! I also like the fact that the translation efforts are first directed towards the largest languages to gain the biggest reach the fastest. Perhaps Swahili also?", "q0r": 5, "q1": "Both WADA and The Catalyst School have amazing teams and their combination is a guarantee of top notch quality. The plan is really simple to understand, very detailed and concise. Scoping is done very professionally! I can evaluate this objectively because I'm a business consultant and I deal with project scoping, implementation and tracking on a daily basis.", "q1r": 5, "q2": "The goals are clear and deliverables measurable so tracking the project success should be a breeze. A very high quality proposal that is easy to audit. Exemplary work.\r\n\r\nAfter laying the basis with this type of initiatives, I hope the collaboration between the two groups continues. Once this is carried out successfully, I hope you raise the bar and aim to create African Catalyst Heroes: teams of mainly African proposers who get their proposals funded and implemented. Highlighting these success stories is the best way to create more heroes tomorrow.", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Since Africa is one of the focuses of Cardano, this proposal contemplates the challenge as it proposes a means for greater engagement of Africans in Catalyst.", "q0r": 5, "q1": "I think it is likely that this proposal will be successfully implemented as relevant experience has been presented, and also the conductible plan for implementation and the budget is reasonable. they also considered the challenges and offered a way to get around them.", "q1r": 5, "q2": "All necessary information for evaluation was provided, such as roadmaps, milestones and key metrics. In addition, there is a detailed description of the problem faced and the proposed solution", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Provide Catalyst School content in a format that fits African needs - language, data usage / bandwidth, problems prioritization and more.", "experience": "The Catalyst School and WADA are partnering up to deliver this project to the African community."}