{"id": 369264, "author": "", "title": "Payment with ADA in Ethiopia", "url": "https://cardano.ideascale.com/a/dtd/369264-48088", "category": 26108, "amount": 8000, "description": "People don't see the value of ADA since they can't use it in their daily life and are unable to use any of the existing platforms.", "f6_no_assessments": 5, "f6_rating": 3.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Much needed intiative. Proposal is also well writen, with a clear problem statement and solution.\r\n\r\nI like the concept of doing trials in a limited scope and only broaden it, to other stores, aftwards. \r\n\r\nIt could be mentioned here this intiaitive will get funded after april/22 - will it become self funded somehow (like, with fees) or will it apply for future funds? \r\nIt would also be useful to have done some previous research and understand the williingess of the establishments to adopt ADA (have something like a letter of interest (LOI) or similar). Also, how the approach, convicement and engagement with local stores will be done? it could have more details on it.\r\n\r\nFinally, it also lacks a bit information the payment strucuture (both online and in-store). will it be created from scratch our use a 3rd party?\r\n\r\nA suggestion for the events parts, the tickets for it could be NFT using Cardano blockchain structure. it would allow more security in the transactions and even on the re-selling of them, among buyers.", "q0r": 4, "q1": "the current relationship the proposer says he has with local merchants seems a great start but it is not enough to implement a payment strucuture or even choose the best solution, it needs some technical knowledge. Also, there is no way to verify the allegated relevant experience here.\r\n\r\nAs to the plan, it it seems sensible and budget breakdown is fair.", "q1r": 2, "q2": "Metrics are good and with fair targets. there are also some milestones in the plan that could be used to monitor progress. I'd also consider adding the total number of transactions done in ADA and the ammount transactioned, if possible.\r\n\r\nHoweve, there are several risks that should be considered here and have a mitigation plan beforehand. As examples, theres a risk of low accpetance from the mershant to ADA payments, low number of ADA payments being done by final costumers and poor payment strucuture implemented", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Paying with ADA in Ethiopia is good idea. If cardano is already having adoptions in Ethiopia, why not give the people to use their ada in their day to day spending? This proposal addresses the challenge as this will further consolidate and facilitate mass adoption of cardano in the continent.", "q0r": 5, "q1": "Their just the marketing side of the project. I expected a product such as a wallet or payment processor that allow merchant to accept payment in ada. But instead this proposal is focus on the marketing the ada brand. The proposal is very confusing. I suggest the proposer the think about the product first before the marketing.", "q1r": 3, "q2": "This proposal starts with a great idea which is to allow ada payment in Ethiopia, but in the end there is no product. The proposal talk about organizing events. This is a very confusing proposal. I hope the proposer will refine the proposal to make it better.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal looks to be ad duplicate of Payment in ADA so am assessing them together. Hence the assessment look very similar.\r\n\r\nIn terms of meeting the challenge objectives this proposal will certainly get more people engaged with Cardano so in that respect its a good idea.\r\nHowever there are significant gaps with the implementation that need to be addressed first.\r\nThe most important of which is what is the $8k going to be used for (are we building something or just marketing?) I am reading this in conjunction with a 2nd proposal that is referred to (Payment in ADA) so if they are combined does that mean the proposer is asking for $18k?\r\n\r\nThis specific proposal would benefit from a POC, this proposer seems to have contacts and talks about 1000 transactions by March 2021. Evidencing this has been achieved would give much more weight to this proposal. \r\n\r\nVoters reading this will also get very confused with multiple linked proposals", "q0r": 2, "q1": "The plan and timelines for this specific proposal are needs lot more work, eg what does implementation and assistance mean in practical terms? what is being implemented here? is any technical build required?  It is also not clear to me how the budget lines relate to the plan items. A simple plan --> resources --> budget document would make this simple to understand and assess.\r\n\r\nI am coming at this from a marketing, app development and project management perspective having experience in all over the past 20 years. ", "q1r": 1, "q2": "further work is required on KPI, success criteria and metrics. The proposer should seek the help of a proposer mentor and come back n the next fund with something tangible (ie a POC - prove to the community you can do this 'show me' don't 'tell me')\r\n\r\nThere are plenty of people who would be willing to help this proposer, they just need to ask (go to TH, Telegram, discord) ", "q2r": 1, "assessor": "z_assessor_45", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "Being able to use ADA for a form of payment would help drive adoption and seed cardano in Africa. People would have the chance to spend it more and businesses will have paved the way for more commerce to transact this way.", "q0r": 4, "q1": "They do have experience with events, but they don't provide any experience dealing with merchant processors, or ways they leverage partnerships.", "q1r": 3, "q2": "The informatioin provided is on the boarder of being sufficient. We have the bare minimum needed to even request data to audit. The proposer does not explain how they will keep and be accountable to their proposal  mission, budget, and timeline.", "q2r": 3, "assessor": "z_assessor_612", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "The problem and solution statement is clear and reasonable. The proposal is fully aligned with the scope of the challenge brief and has great potential to improve the usage of ADA in Ethiopia and hence improving it's value. The proposer is already an event organizer which is one of the three targets of the implementation plan. It shows clearly that he can utilize his experience and that of the other departments in implementing the proposal which increases the potential for positive impact on the ecosystem because a lot more people will visit and utilize the Cardano Platform everyday.", "q0r": 5, "q1": "A verified link to the Facebook profile of the proposer  is provided. In the profile as I viewed, the \"about\" section contains vital information that I think would've been useful for inclusion in the proposal as team data.\r\nA reasonable budget is provided but I'm uncertain if the requested amount would be enough or not.\r\nThe proposal comes with an implementation plan which increases the feasibility level of the proposal.\r\n", "q1r": 4, "q2": "A clear and understandable solution has been provided in the proposal to a clear description of a targeted problem.\r\nA clear roadmap has been provided in the proposal to help keep track of progress and success by the community and Catalyst.", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Create simple ways for people to pay with ADA locally and encourage merchants to accept payments in ADA.", "experience": "I work with several merchants and Event Organizers as well as organize events myself."}