{"id": 369611, "author": "", "title": "Farm Management Software in Africa", "url": "https://cardano.ideascale.com/a/dtd/369611-48088", "category": 26108, "amount": 40000, "description": "small scale farms are losing competitiveness due to a lack of access to modern farming information", "f6_no_assessments": 4, "f6_rating": 1.75, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal presented a problem and solution but failed to give details on the solution.\r\nThis proposal feel unfinished.\r\n\r\nI strongly disagree", "q0r": 1, "q1": "Given experience was not displayed or a verifiable link to prove experience on the proposed solution.\r\nThere is no implementation plan presented or a cost request breakdown.\r\nI Strongly disagree.", "q1r": 1, "q2": "No information provided that can be used to audit the progress or success of the project.\r\n\r\nI strongly disagree.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "One can only imagine what the real problem is and what the solution proposed is to be honest. It is clear that the problem is the \"lack of access to modern farming information\" although its not clear what that information is. is it about the position/availability of farming machinery which can be rented or purchased? Because this is what looks like when you consider the solution should cut inventory cost and provide real time monitoring of the machinery. This need to be further explained. Otherwise its not clear if blockchain centered software could help.", "q0r": 3, "q1": "The proposer is a FarmWorks CFO in Kenya which certainly gives credibility to the idea since she knows what is needed in practice. There are no software developers in the team however. Its not clear how a blockchain based solution can become true.\r\nThere is no budget and no timeline.", "q1r": 2, "q2": "Such information is just missing.", "q2r": 1, "assessor": "z_assessor_408", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement and solution make sense and the idea is interesting, but the proposal is only a draft. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The proposer has articulate clearly the problem , but the solution lacks precision. The idea is good, but it needs further refinements to be considered good. I give it a 3.", "q0r": 3, "q1": "There is no details provided by the proposer about the implementation of the idea.", "q1r": 3, "q2": "There is no roadmap or budget detail. An audit will be quite impossible.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "A blockchain-centered software cuts inventory costs and allows for real-time monitoring of machinery, and assures fair trade.", "experience": "Current CFO at FarmsWorks in Kenya with Business management Experience In Ethiopia"}