{"id": 369883, "author": "", "title": "Global Sustainable Stories/Usecases", "url": "https://cardano.ideascale.com/a/dtd/369883-48088", "category": 26108, "amount": 7887, "description": "There should be more of a spotlight on Cardano projects implemented in Africa, their stories, challenges & solutions across the continent.", "f6_no_assessments": 2, "f6_rating": 4.5, "videos": ["https://www.youtube.com/watch?v=CJF4mCTvhLM&t=1s"], "media": [], "f6_assessments": [{"q0": "This proposal does show promise in addressing the F6 'Grow Africa, Grow Cardano' challenge. The team have created a beautiful website to populate with stories of Cardano success in Africa. Having people on the ground actively reporting on adoption and use cases will be inspiring and satisfying. One of the 'success metrics' described in the F6 challenge is - Cardano is considered the best public block-chain operating in Africa. Well presented media will definitely contribute to this goal.\r\nKeeping the community engaged and educated is paramount in all of our success.", "q0r": 5, "q1": "The team have shown commitment by already creating a well designed website and one very inspiring video on their/our mission to grow Cardano adoption in Africa.\r\nThis team has had a project funded in previous rounds and delivered a Cardano conference in West Africa. \r\nLooking at the work that has gone into their previous project and the beginnings of this one it seems that the team is committed. It appears feasible that they will be able to deliver but they have not outlined any specific stories they plan to cover/promote. I come to this proposal with a personal experience working in Africa on an environmental monitoring project.\r\n", "q1r": 4, "q2": "The team have not satisfactorily outlined how they will be accountable and auditable. \r\nPerhaps something like no. of views or shares/metrics  on YouTube or website to show that their content is reaching and being consumed by the intended audience. Currently their YouTube channel has only had a handful of views and less subscribers.", "q2r": 3, "assessor": "z_assessor_330", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1, "reply": "Having done some past work for the WADA team. I feel this shows the Sustainable ADA is ready to take on this work and is fully capable of doing so. We also do plan to post all of our created content through different social media channels and on our website, allowing for the community to be updated on new projects and processes throughout Africa. "}, {"q0": "This is a well written proposal, though the problem statement seem long and unclear but the description of the solution makes up for it.\r\nA better problem statement was suggested ('There is not enough media coverage of Cardano use cases and success stories in Africa' ) by https://cardano.ideascale.com/a/member/Corinne-Phillips/3104819-48088.\r\n\r\ngreat work from the team.I strongly agree.", "q0r": 5, "q1": "The proposal clearly presented experience with verifiable links and materials and also provided a clearly written implementation plan and its cost implications.\r\nThe request amount ($7,887) also reflect an easily fundable project and considering other submitted proposal on the same challenge.\r\nI strongly agree.", "q1r": 5, "q2": "The proposal did a great job of presenting clearly defined goals, milestones, timelines and cost breakdown.\r\n\r\nI strongly agree.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Share stories from change agents in Africa and diaspora, engaging with Cardano in cascading disruption, creating a better tomorrow, today.", "experience": "Economics, Sustainability, Humanities, Social Sciences, NGO's, Social Entrepreneurs, Writers, Blogging, Video Editing, Figma, Canva"}