{"id": 381338, "author": "tim.heidfeld", "title": "Global Identity and Authentication", "url": "https://cardano.ideascale.com/a/dtd/381338-48088", "category": 26254, "amount": 93000, "description": "Без личности нет: ни собственности, ни экономического прогресса, ни процветания, ни юридически обязывающих действий.", "funded": 1, "upvotes": 23090674, "downvotes": 14098296, "votes_result": 8992378, "votes_cast": 155, "f6_no_assessments": 4, "f6_rating": 2.9166666666666665, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=1860"], "media": [], "f6_assessments": [{"q0": "Проблема и решение, представленные в этом предложении, безусловно, ставят его в правильное положение. Цифровая идентификация будет иметь первостепенное значение в будущих экономических операциях, и решения, которые подчеркивают личную собственность на данные, вероятно, будут наиболее желательным аспектом для успешного принятия. Данное предложение направлено на содействие в ускорении решения этой задачи, поэтому я согласен с его влиянием и согласованностью. В чем предложение не получило высшей оценки, так это в неспособности четко объяснить, как это будет достигнуто. Здесь много высокоуровневых заявлений, но недостаточно подробных деталей, чтобы объяснить, что именно создается, как будет осуществляться сбор персональных данных (особенно биометрических данных), каковы юридические последствия сбора отпечатков пальцев, сканирования лица, радужной оболочки глаза и т.д. и как вся эта собранная персональная информация связана с выполнением 1-Click (и чьим?).", "q0r": 4, "q1": "Несмотря на то, что члены команды названы в предложении, а их соответствующая квалификация опубликована в LinkedIn и доступна через сайт iamx.com, я не уверен в осуществимости этого проекта, потому что нет никакой формы плана. Есть \"резюме\" целей и преимуществ, которые описаны на высоком уровне и в виде точек. В то время как это хорошо для краткого резюме, это не очень хорошо выглядит в предложении, где запрашивается $93000. Чтобы повысить выполнимость, я предлагаю переписать это предложение с четким графиком выполнения плана. Это даст избирателям уверенность в том, что есть начало и конец, и что каждый из промежуточных этапов имеет стоимость, которая четко объясняется. В предложении перечислены результаты и выгоды для отдельного человека, государства (Ганы) и экосистемы, но оно зашло слишком далеко вперед без какой-либо существенной информации о том, как это будет достигнуто. Также может быть полезно объяснить, почему именно Гана? Команда iamx, насколько я могу судить, базируется в Германии. Какие существующие отношения с ганскими организациями делают эту страну идеальной для пилотного проекта?", "q1r": 2, "q2": "Запрашиваемый фонд в размере $93000 не имеет четкой разбивки, из чего складывается эта сумма, что необходимо для любого аудита и экспертизы любого проекта. Кроме того, нет плана, объясняющего, как команда начнет работу, кто и в каких ролях будет участвовать и где/когда она закончится. Эти отсутствующие и очень важные аспекты являются причиной того, что я поставил столь низкую оценку за проверяемость. Я предлагаю переписать все предложение с ясностью, которая легко проинформирует голосующего, который может просто быстро просмотреть предложение перед тем, как проголосовать за или против. Также команде, подающей предложение, может быть полезно проконсультироваться с другими успешными участниками или просмотреть предыдущие предложения, чтобы получить представление о том, какие элементы являются обязательными для того, чтобы иметь определенный успех в запросах на финансирование. На сайте iamx указана ассоциация с Альянсом ВАДА, поэтому я дополнительно предлагаю обратиться к их командам, которые успешно получили финансирование. Они наверняка знают, какие детали необходимы, чтобы добиться успеха в Catalyst. Я почти оскорблен этим предложением, учитывая статус, который IAMX был предоставлен самим IOHK, будучи 1/3 команд, перечисленных в разделе IOG \"Экосистема идентичности\". Персонал IAMX - это люди, обладающие необходимыми полномочиями, но, похоже, не было приложено никаких усилий для подготовки этого предложения, поскольку большая часть контента была взята с их сайта. IAMX имеет активный пул и активен в twitter, так что в этом смысле есть каналы, по которым они могут быть привлечены к ответственности сообществом.", "q2r": 2, "assessor": "z_assessor_42", "no_vca": 23, "ne": 12, "ng": 7, "nfo": 4, "vca_o": 2}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. The proposal identifies a very important problem regarding DID: the lack off accessibility of identity itself and the cosequencies from it. It approaches this problem with a valid solution that will both benefit the Cardano ecosystem and the people that suffer from a lack of identity. The solution provided is very detailed and well-made. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing, and the related business seems serious and credible, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they and their project partners will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 5, "ng": 6, "nfo": 8, "vca_o": 1}, {"q0": "I disagree that this proposal aligns with the objectives of the challenge. The idea can be defined by the following passage: \"provide free and solid biometric identity, owned and controlled by the holder\". In theory this is great, but where does Cardano come in, where does Atala Prism fit in? Unfortunately, during the description of this project, the proponents focused on explaining the product but not on making us understand how it would benefit the Cardano ecosystem. At no point is it said that the decentralized identity would be stored on our blockchain. There's not much else to say, unfortunately. There is no point in offering so many advantages to the final customer, who would have these services free of charge, from what can be inferred, and not benefit those who would be financially supporting the idea... I suggest that the proponents clarify this issue better, because I have read the proposal completely and it is still not clear to me how this bridge would take place.", "q0r": 1, "q1": "We have and do not have information about the team here. I'm gonna explain. Are some companies mentioned that would be part of the project (IAMX AG, Zug, CH), would the executive board be the leaders of these organizations? Would a total of 25 people be involved in the project? It would be essential to know who they are, individually. Names, positions, how they would work on the project, professional training, who would be responsible for the development in Cardano... It is positive that they clarify the industry sector and the business model, but at the same time, some information is somewhat loose, such as for example, we only have contact information for these companies (IAMX). It is very positive that they anticipate the risk of so many different aspects, such as software risk, product risk and so on. This demonstrates a lot of experience in the development of this project. However, it is essential, in my opinion, that we know the characteristics of the members individually, this is what builds greater trust in the team: a more humanized notion about who we are dealing with. About the script: totally absent. The team provides us with a lot of relevant information about the project, such as benefits for customers, risks, objectives, etc., but at no time are phases and activities to be carried out to achieve the goals determined. It is not possible to understand how the development process of this project would take place. And finally, in terms of funding, nothing is said about how the 93k orders would be used! It is essential to share the money, how much would go for each thing and because, it is a very high value and without any explanation that justifies it, it is very difficult for the community to judge if it is a fair or exaggerated amount...", "q1r": 2, "q2": "The best part of the proposal. The team is willing to provide some very relevant information that would serve as a way of auditing the project, even though they have not traced a roadmap (through which we could monitor whether the activities were being carried out as promised) and KPIs. This information is: the objectives (indirectly, I would say they are the KPIs of the proposal); the results (they could also be called KPIs!); the benefits (through them, we can monitor if what was planned for the client was actually carried out, in addition to conducting a direct survey with the public to understand their degree of satisfaction) and risk analysis (here we have an idea of ​​the problems that would be faced and you can monitor whether they were avoided and/or resolved). It's the part that became clearest in my view, both the team could gather such data and wash it to the rest of the community; how much a local resident who was already part of the Cardano community could make contact with the team and take the information to the rest of us.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 27, "ne": 11, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This proposal includes some technical jargon but is severely lacking in real substance. Too few specific details are provided to judge the impact. Of course, we are all excited about the possibilities of digital identity, but this this proposal doesn't really offer a detailed solution to any problem and does not communicate any technical nuance. The project summary includes many commendable goals that are appropriate for the challenge but doesn't go into detail about how these goals will be achieved. ", "q0r": 1, "q1": "Frankly I'm confused by this proposal because the quality of the the team as listed on the website is very high, but the content on the website and in the proposal are severely lacking in detail and not convincing. The proposers do go into some detail in the comments section of ideascale when responding to questions, but these responses are similar to the proposal body in their tone. Their ISPO stake pool has 4M in delegation so they must have some trust from the community. I'm going to give them the benefit of the doubt that this is a language/communications issue rather than a scam, but I can't give more than two stars considering the quality of the information presented in the proposal and on the website. ", "q1r": 2, "q2": "No KPIs or auditability points are provided. No detailed road map/calendar.  no budget breakdown for the 93k requested. ", "q2r": 1, "assessor": "z_assessor_67", "no_vca": 23, "ne": 3, "ng": 17, "nfo": 3, "vca_o": 1}], "solution": "Обеспечить свободную и надежную биометрическую идентичность, принадлежащую и контролируемую Владельцем, и верифицируемые учетные данные, которые принимаются Верификатором", "experience": "Опыт работы основателей электронной коммерции из секторов телекоммуникаций, электронной коммерции, электронных торговых площадок, экологической моды, автомобилестроения, консалтинга"}