{"id": 381571, "author": "josec", "title": "Students dropping out of college", "url": "https://cardano.ideascale.com/a/dtd/381571-48088", "category": 26254, "amount": 19000, "description": "Только 55% окончат колледж. Отчисленные из колледжа становятся бременем для государства, которое только в США ежегодно обходится обществу почти в 40 миллиардов долларов США.", "funded": 1, "upvotes": 31216261, "downvotes": 11654472, "votes_result": 19561789, "votes_cast": 146, "f6_no_assessments": 5, "f6_rating": 4.200000000000001, "videos": [], "media": [], "f6_assessments": [{"q0": "Это предложение соответствует краткому разделу задачи \"Самоуправление новых сообществ\", и, будучи включенной в программу AtalaPRISM Pioneer Program, эта команда будет получать руководство, чтобы оставаться на высоте в этой задаче.  Первоначальная аттестация студентов, которую они предлагают, прекрасно сочетается с руководством по созданию и поддержанию репутации с помощью DID.  В случае успеха их ИИ может быть распространен практически в любом секторе образования, и DID смогут легко сопровождать студентов через выбранное ими наставничество, профессиональную подготовку или высшее образование.  Количество DID, подключенных к Cardano, трудно представить в окончательном воплощении этого процесса, но команда разработчиков предложения подтвердила предыдущий опыт подключения студентов к разработанным ими программам, и цифры поражают воображение, исчисляясь сотнями тысяч.  Теперь, чтобы внести ясность, этот запрос на финансирование предназначен именно для процесса создания наборов данных по карьерным программам, тестирования и доставки ИИ, которые будут разрабатываться параллельно с проектированием и установкой ИИ в AtalaPRISM.  Следующим шагом будет внедрение ИИ в MVP, которое не включено в данное предложение.   Как ни странно, показатель, по сути, включения 1 пользователя (тестовый пример, который они отслеживают, изучают и делают итерации), можно считать огромным успехом для плана такого типа, и дальнейшие раунды финансирования могут привести к его дальнейшему развитию.", "q0r": 5, "q1": "Команда разработчиков предложения выглядит очень квалифицированной, имея за плечами десятилетия опыта в сфере образования и наставничества, а также множество успешных стартапов и информационно-просветительских мероприятий.  Они признают важность высококвалифицированного разработчика для интеграции DID, и посвятили более 60% предлагаемого бюджета успеху в этой области.  На момент написания данной оценки не было никаких признаков того, что они нашли своего разработчика, однако они были довольно активны в поисках, и наличие связей с AtalaPRISM является хорошим показателем того, что они найдут подходящую команду.  Отсутствие продвинутой команды разработчиков означает, что они не смогли предоставить подробные этапы и технические требования к интеграции DID, поэтому им придется опираться на свое наставничество с AtalaPRISM, чтобы наверстать упущенное.  Их раннее внимание (уже в процессе) к UI/UX и алгоритму искусственного интеллекта (в сочетании с опытом команды в области дизайна) означает, что у них будет начало работы с этим финансированием над тем, что в конечном итоге станет одним из самых важных факторов: возможное привлечение клиентов через удобство использования.  Это проект, который заслужил шанс участвовать в экосистеме Cardano DID.", "q1r": 5, "q2": "В заявке были четко указаны цели финансирования и основные этапы, которые определят прогресс на пути к достижению цели - созданию полного тестового сценария наставничества над студентом.  Команда разработчиков заявки была очень откровенна в процессе подготовки заявки, взаимодействовала с сообществом и обращалась к ресурсам, чтобы усилить заявку, и ожидается, что они будут продолжать это делать.  Представленные этапы, возможно, позволят установить 2-3 точки естественного аудита примерно ежемесячно, но когда команда разработчиков вступит в должность, появится еще одна возможность внести больше ясности в процесс аудита.  Для ожидаемого срока в 3 месяца событий, подлежащих аудиту, должно быть достаточно, чтобы сообщество знало, что проект идет по плану.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Great and innovative idea by the proposer. The proposal effectively identifies a problem within the challenge which needs to be solved and has provided a concise proposed solution which has the potential of bringing value to the cardano blockchain.", "q0r": 5, "q1": "The proposer together with the team have provided the required information and links necessary to successfully execute the project when funded. The budget is on point and reasonable to achieve set target.", "q1r": 4, "q2": "The proposer has in place a roadmap to guide in project execution. The proposer however has not captured activity timeline, KPI's, launch date to execute and also track the success and progress of the proposal. This i think doesn't make the proposal fully complete.", "q2r": 3, "assessor": "z_assessor_420", "no_vca": 23, "ne": 2, "ng": 10, "nfo": 11, "vca_o": 1}, {"q0": "This project proposal could help reducing dropout rates by provide an AI mentoring as an on-demand service and deliver real-life pathway solutions to reduce dropout rates across countries. However, this project does not address the main challenge effectively and the DID implementation is very limited. It will be better if team can have better problem statement that relate more closely on the main challenge. ", "q0r": 2, "q1": "Given the experience presented, it is highly likely that the proposal will be implemented successfully because deliverables, timeframe, and goals of this project are very achievable. Furthermore, in this proposal, team requested reasonable budget with detailed breakdown. With the vast experiences and community involvements by team, I am very confident that this project could be delivered successfully. To improve the proposal, team can provide milestones and detailed roadmap for three, six, and twelve months so that it can shows the community about their project planning.", "q1r": 4, "q2": "Team will use cardano mainnet for issuing the verifiable credential that will make it open to public to audit. Problem statement and solution delivered match and address both the challenge effectively. Success criteria are relevant and feasible, making it not only auditable but also realistic. I would like to suggest the team to provide monthly report on the progress as well as budget spending in their website or cardano forum so it can be more accessible and transparent.", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 15, "ne": 2, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "Students who receive good guidance will drop out less at school and this is a very important goal to aim for. Dropping out of school is not always the responsibility of the student and is caused by many environmental factors that the student does not always have control over. Personal and digital guidance can offer a lot of value to the student here. It is very important that everyone has maximum opportunities to obtain a certificate according to his or her own talents. This has a very sustainable impact on society in the long term.", "q0r": 5, "q1": "The project still needs to take shape, a call is being made to a developer, so they already know what expertise they lack in the project team and are actively looking for this. The project is well substantiated with relevant literature and information.", "q1r": 4, "q2": "Under the heading measurability you can find the substantiation of the project again, a little further on I find the timeline and budget allocation.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "After communicating with the proposal team member, I believe their proposed implementation of giving students ownership rights of their educational identity (DID) in their project effectively addresses the challenge. The above proposal details could use some of the project's implementation overview on a high level. This way the Social Lab's team can clearly communicate this integration to the Catalyst  audience. Such a solution will use Atala Prism as an integral component that brings more utility and adoption to the Cardano blockchain. ", "q0r": 4, "q1": "I think the team is highly capable of executing this implementation.  They already have an MVP which speaks to their dedication, experience, and hard work. ", "q1r": 5, "q2": "Given the cost breakdown and the attached deliverables for each respective items, auditing for success or failure can easily be done. ", "q2r": 5, "assessor": "z_assessor_841", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Мы предоставим ИИ-наставничество в качестве услуги по запросу и обеспечим реальные решения для снижения уровня отсева в разных странах.", "experience": "Команда имеет +50 лет совокупного опыта в области стартапов, развития, образования, наставничества и направления молодежи к успешной карьере."}