{"id": 382306, "author": "arthurgreef", "title": "Cardano Circular Economy Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/382306-48088", "category": 26254, "amount": 50000, "description": "Участники циркулярной экономики должны в частном порядке доказывать соответствие своей продукции нормам и обязательствам в области устойчивого развития.", "funded": 1, "upvotes": 26168931, "downvotes": 19133811, "votes_result": 7035120, "votes_cast": 118, "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is highly technical an appears very well researched. Using PRISM technology to prove compliance with sustainability regulations for a circular economy is a good response to the challenge brief. I think the proposal plans to focus on electric vehicle batteries for their first use case. It would be helpful when assessing the impact if the business use case were explained a bit more clearly a bit earlier in the proposal. ", "q0r": 5, "q1": "Although the proposal is really in the weeds with the technical specifications, without having a deep technical understanding of all of the concepts referenced, it is difficult to tell how meaningful the information is. It would strengthen the proposal if the proposers had included a bit more background information about themselves, to substantiate their ability to deliver the proposed solution. From searching for Arthur Greef on LinkedIn, I believe I found his profile, which does indeed suggest he has the software engineering skills required to deliver on this proposal. As a participant in the PRISM pioneer program myself, I know that \"fastframk\" was active member of the cohort. It is also clear that the proposers have thought about not only the technical side of the project but also the governance framework. I do agree with one of the comments that the proposal might be better off focusing on DIDs and the circular economy and not trying to manage it as a DAO at the same time, as that could perhaps add complexity to an already very complex project. I appreciate the reference to the CLI wallet, as the team is aware of the current lack of functional wallet in the ecosystem. ", "q1r": 4, "q2": "A roadmap and metrics are provided, and the clearly link to the proposals strategic plan. It is a bit hard to understand whether the metrics occur sequentially, and thus serve as milestones, or whether they are tasks that could happen in parallel.  ", "q2r": 3, "assessor": "z_assessor_662", "no_vca": 14, "ne": 4, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The plans are well developed and substantiated, have clear goals to work towards, but do not always describe how they will do this.", "q0r": 3, "q1": "The proposers clearly see the risk factors, which means that they can anticipate or respond to them if they arise and thus increase the chance of success. A very extensive plan of action has been drawn up, which inspires a lot of confidence. It is clear how the PRISM pioneer program can make the project succeed.", "q1r": 4, "q2": "We get to read what the project wants to achieve within 3 months, but not in the long term. Is it possible to try to set goals after 6 – 12 months? A clear budget planning is also missing, I can see where the budget is going, but no subdivision has been made yet, it would be good to work this out.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal accurately identifies an avenue to accelerate DID adoption through the circular economy and providing greater transparency through the use of Atala PRISM", "q0r": 5, "q1": "The proposal is well presented and the team appears to have the requisite experience however it is difficult to determine without a comprehensive breakdown of its members. For the size of the funds requested there needs to be an accounting for how the funds will be allocated and their use. ", "q1r": 3, "q2": "The definitions of success provided are rather The metrics provided are adequate however the definitions of success are quite vague and make the audibility of this project difficult to define. ", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Экосистема участников циркулярной экономики, которые взаимодействуют между собой путем выпуска, хранения и проверки идентификационных данных и заявлений об устойчивости на Cardano.", "experience": "Ветераны индустрии программного обеспечения с 20-летним стажем работы и страстью к созданию решений для циркулярной экономики."}