{"id": 383996, "author": "chris42", "title": "Cardano for Global Health Supply", "url": "https://cardano.ideascale.com/a/dtd/383996-48088", "category": 26254, "amount": 50000, "description": "Проблема \"последней мили\" в кратком изложении кампании блокирует доставку диагностических средств для предотвращения передачи ВИЧ, туберкулеза и других заболеваний в Африке", "funded": 0, "upvotes": 16501536, "downvotes": 18597526, "votes_result": 2095990, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Да, это предложение эффективно решает поставленную задачу и в случае финансирования окажет огромное влияние на сообщество Cardano. Поскольку система Kountable уже запущена и работает в 6 крупных африканских странах, эта интеграция может быть быстрой и немедленно принести пользу экосистеме Cardano и ее пользователям. Доверие, созданное участниками проекта, снизит барьеры для принятия и увеличит охват Atala Prism за счет привлечения новых секторов. Я ценю то, что авторы предложения указали на предыдущую работу, проделанную ими в этой области, включая ее успех, а также указали ЦУР, на которые будет направлено их решение. Эти доказательства предыдущего влияния и внимания к глобальным проблемам, вероятно, найдут отклик у избирателей.", "q0r": 5, "q1": "Учитывая опыт и представленный план, трудно однозначно сказать, будет ли предложение успешно реализовано. Существующий продукт подчеркивает, что компания, стоящая за предложением, имеет опыт и успех в решении проблемы \"последней мили\", связанной с обеспечением сельских и развивающихся сообществ необходимыми ресурсами. Однако представленный план, хотя и интересный, требует дальнейшего развития и лучшего объяснения того, как будет осуществляться интеграция Atala Prism. Неясно, что нужно сделать, чтобы интегрировать Atala Prism в существующую программу, и сколько времени это займет. К сожалению, нет ни реальных сроков проведения работ, ни разбивки бюджета. За 50 тысяч долларов избиратели заслуживают большего, чем просто единовременная сумма без указания того, как эта цифра была достигнута или как она будет потрачена. Учитывая отсутствие важной информации по этим вопросам, я не согласен и не согласен с тем, что это может быть успешно реализовано.", "q1r": 3, "q2": "К сожалению, у избирателей нет никакой реальной информации для проверки прогресса или успеха предложения. Хотя идея явно присутствует, и послужной список компании позволяет предположить, что авторы предложения смогут ее решить, у сообщества Cardano нет возможности определить или отследить результаты. Я ценю KPI, представленные в рамках ЦУР, однако это не объясняет, как интеграция Atala Prism поможет в их достижении. Поскольку компания явно демонстрирует свой успех в решении проблемы \"последней мили\", можно сделать вывод, что многие из этих КПЭ относятся не к данному проекту, а к деятельности компании в целом. Кроме того, как было отмечено выше, отсутствие каких-либо указаний на то, как и на что будет потрачен бюджет, вызывает у меня некоторую обеспокоенность, поскольку избиратели, скорее всего, отнесутся к такому подходу с осторожностью. Для того чтобы повысить оценку, я бы призвал авторов предложения более четко сформулировать, как общество может быть вовлечено или проинформировано о ходе и успехе проекта.", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This team wants to use distributed network and to match diagnostics supply transactions, local distributors, and capital with Cardano tools to unlock access to help prevent transmission of HIV, TB, and other diseases in Africa. This project and its problem are fit with what the challenge wants to address. And their KPIs can be fit with the challenge.", "q0r": 4, "q1": "The team doesn't have a plan to show what they will do with this proposal. They're a great team that helps a lot of people, especially helped deliver 14M diagnostics to 3 African countries cloud tech, treasury, KYC/AML platform and digitized 3K trades $1.25B in value. \r\nTo me, I have no doubt about their ability to deploy this project.\r\nBy for CA and vCA assess and fund, the team should have a plan to go and a detailed roadmap. That's basic!\r\nThe good thing is that the team attached a video of them, some images, and a website that we can visualize what they're doing and support. .", "q1r": 3, "q2": "The basic thing in a proposal the team should have for helping to audit it is the roadmap with a realistic timeline inspired key metrics/ KPIs - they had their goals very clear but lacked roadmap. \r\nMoreover, we want to know what big picture that your team wants to get with your project/ idea by clarifying that you have a well acknowledge of the problem context and have the solution with detail to solve it. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly explains how UN SDG Goal 3 is addressed via an innovative implementation of the Atala family of technologies. ", "q0r": 5, "q1": "The experience of the proposers appears very appropriate - yet there is no actual plan presented with clear milestones and budget assigned to milestones by which progress can be tracked. We encourage the proposers to resubmit with a comprehensive plan detailing how the proposed work will unfold and how the budget requested will be spent at various stages of the plan.", "q1r": 3, "q2": "The KPI presented are very generic and cannot be measured at this stage of the project because their accomplishment require a long time to determine (e.g under 5 mortality rate, etc). We encourage the proposers to resubmit including shorter term measures of success, or at least mention what they achieved in the long run along the respective KPIs so we get confidence in their estimate. ", "q2r": 1, "assessor": "z_assessor_721", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Использование распределенной сети и согласование сделок по поставке диагностических средств, местных дистрибьюторов и капитала с инструментами Cardano для разблокировки доступа", "experience": "Команда поставила 14 миллионов диагностических исследований в 3 африканские страны с помощью облачных технологий, казначейства, платформы KYC/AML и оцифровала 3 тысячи сделок на сумму $1,25 млрд."}