{"id": 384835, "author": "mavster04", "title": "Health DAO", "url": "https://cardano.ideascale.com/a/dtd/384835-48088", "category": 26254, "amount": 28000, "description": "Данные здравоохранения - самая популярная цель среди хакеров. Их стоимость самая высокая - 408 долларов США за одну запись. Как Atala PRISM помогает в этом отношении?", "funded": 2, "upvotes": 110259046, "downvotes": 2081673, "votes_result": 108177373, "votes_cast": 285, "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Ваше предложение идеи было интересно прочитать. Спасибо, что поделились. Также поздравляю с достигнутым прогрессом\r\n\r\nМне понравилась общая идея, проектное предложение, и общие определенные мероприятия и этапы, как мне кажется, являются рациональной идеей, не только для запрашиваемой стоимости инвестиций, но и для общего проектного предложения. Кроме того, идея и конструкции проекта кажутся хорошо продуманными, и я также буду готов выступить в качестве эксперта в этой области для поддержки идеи и реализации проекта. С этой идеей связано несколько различных вариантов использования, которые, возможно, стоит также рассмотреть в более долгосрочной перспективе: контракты на результаты лечения пациентов, программы сертифицированного медицинского образования, управление контрактами в области фармакоэкономики здравоохранения и обработка данных о регистрации пациентов в клинических испытаниях.\r\n\r\nНесмотря на то, что, как уже было описано выше, были рассмотрены общие предположения, а также понятийные конструкции - также считаю, что следует поделиться более подробной информацией о принципах проектирования интероперабельности обмена медицинской информацией на основе блокчейна. Я бы также предложил на следующих этапах дополнительно рассмотреть вопросы конфиденциальности данных HIE, безопасности данных электронных медицинских карт и их хранения, а также все основополагающие принципы и концепции соответствия нормативным требованиям, обеспечения качества при контроле продукции и эффективных механизмов мониторинга.\r\n\r\nНиже перечислены некоторые рекомендации для всех команд, подавших заявки, а также для части участников этого раунда оценки.\r\n\r\n Опишите проблему с более конкретными примерами (особенно в областях проблем и ограничений из представленного pdf), если это возможно, и дайте краткий обзор того, почему это проблема, которую необходимо решить.\r\n\r\n Представьте, как компания будет работать в будущем, чтобы ваши пользователи или будущие партнеры лучше понимали ваш будущий план реализации.\r\n\r\n Предоставьте больше конкретных деталей, чтобы все читатели могли понять его, даже если он уже находится на хорошей стадии.\r\n\r\n Как и я, многие будущие партнеры и венчурные инвесторы будут считать, что для каждого случая использования есть свой инструмент, так что это уже решенная проблема. Есть много людей, которые не работают в этом секторе, поэтому они воспринимают это как мягкий вызов. Вы должны объяснить, почему существует возможность, почему существует проблема, иметь эффективную и четкую разбивку затрат и архитектурный дизайн (включая криптографические протоколы с доказательством zk).", "q0r": 5, "q1": "Данное предложение будет успешно реализовано на основе опыта и планов предлагающей команды, хотя я предлагаю включить в предложение больше информации о соответствующем опыте автора предложения в управлении инициативами такого рода, а также более подробный план и бюджет для выполнения описанной задачи.", "q1r": 4, "q2": "При чтении предложения у меня возник еще один вопрос: Насколько реально повысить эффективность и как будут выглядеть будущие инвестиционные раунды?\r\n\r\nЯ предлагаю более конкретный подход к пониманию проблемы, не сложный глубокий, а укорененный в реальности. Я хотел бы услышать примеры того, что хорошего есть в продукте. Включите более подробную информацию о том, что делает технология, а также соображения, касающиеся управления идентификацией, согласия, исполнения смарт-контрактов и любых возможных моделей управления на этапе исполнения.\r\n\r\n- Соображения для рынка США, понимание покрываемых организаций (CE), которые могут использовать или раскрывать защищенную медицинскую информацию человека (PHI). Закон HIPAA предусматривает множество способов разрешенного использования и раскрытия PHI, также известных как HIPAA Permitted Uses and Disclosures. Здесь необходимо привлечение специальной юридической команды или специальное юридическое представительство из США. Общая оценка управления рисками с точки зрения GDPR и HIPAA, поскольку они принципиально отличаются по своей направленности (GDPR нацелен на защиту PII граждан ЕС, а HIPAA, с другой стороны, фокусируется на американских организациях, работающих с PHI).\r\n\r\n- В качестве будущего рассмотрения, можно ли предложить проекту стать частью естественного процесса совершенствования и роста через программу акселератора или путем привлечения отраслевых экспертов, которые смогут охватить действующие сети контактов и сформировать потенциальные будущие партнерства в области фармацевтики и наук о жизни? Я считаю, что предлагаемая команда уже обладает очень солидными знаниями в области технической разработки, просто считаю, что у проекта должен быть владелец продукта/внутренний эксперт по развитию бизнеса/проектированию продукта.", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Это предложение идеально решает эту задачу и, безусловно, ускорит внедрение DIDs через Atala Prism, оказывая значительное влияние на экосистему Cardano. Оцифровка медицинских записей по-прежнему является примером использования, на который часто указывают как на яркий пример того, как могут быть реализованы DIDs, и я с нетерпением ждал проекта, подобного этому. Медицинская информация по своей сути является личной, и ее утечка может причинить значительный эмоциональный, а иногда и физический вред. Защита этой личной информации имеет большое значение для любого развертывания, и в этом предложении все это есть. Меня особенно впечатляет интеграция доказательств нулевого знания, когда информация может быть подтверждена или опровергнута без фактического обмена данными между сторонами, поскольку мы должны гарантировать, что человек защищен и сохраняет суверенитет над своей личностью. Еще одним аспектом, который усилит влияние предложения, является совместимость с существующими медицинскими системами, что будет необходимо для массового внедрения. Потрясающая работа.", "q0r": 5, "q1": "Опыт и представленный план дают мне 100% уверенность в том, что это предложение будет успешно реализовано. Прилагаемый документ является кладезем информации и держит читателя за руку, поскольку он не только описывает проблему и решение, но и предоставляет отличные примеры и графики для объяснения того, как они достигнут своих целей. Участники голосования могут быть уверены в вероятном успехе предложения, учитывая уровень детализации каждого этапа разработки решения, а также определенные меры по снижению потенциальных рисков. Ни один камень не остался нераскрытым, и предусмотрены непредвиденные обстоятельства, позволяющие участникам предложения оперативно реагировать на изменения в правовом и нормативном ландшафте. Команда также демонстрирует свой послужной список, ссылаясь на уже выполненную работу, не говоря уже о том, что предлагаемый ими инструмент уже работает и используется. Бюджет также кажется очень разумным, учитывая потенциал, который может обеспечить этот проект.", "q1r": 5, "q2": "Да, предоставленной информации достаточно для проверки прогресса и успеха предложения, особенно учитывая, что предложение сосредоточено на интеграции Atala Prism в существующую платформу Hippocrades. Предложение предлагает приличный график и дорожную карту с результатами на каждом этапе. Так как конечным продуктом будет интеграция Atala Prism в их платформу, это показатель успеха \"да/нет\", который легко измерить сообществу. Более того, короткие сроки в 3 месяца обеспечивают быстрый оборот инвестиций, но в случае успеха они могут окупаться в течение длительного времени. Еще одним интересным компонентом, способствующим проверяемости, является компонент DAO, поскольку сообщество, которое будет использовать платформу, также будет участвовать в ее управлении и операциях, что дает дополнительные возможности заинтересованным членам сообщества присоединиться и формировать будущее проекта.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 19, "ne": 13, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The project team is proposing to address the challenge of security risks involved in handling health care data. The sensitivity and risk of health care data being stolen by hackers is increasingly prevalent as healthcare is digitised globally and the value of this data increases. The proposal is to solve this through implementing atala prism DID and Zero knowledge proofs. The funding from Catalyst will allow them to implement DID into their suite of applications called curie. The suite includes a front facing set of applications, DID solution and healthcare API's. \r\n\r\nThe project aligns with this challengy by making use of Atala prism and establishing a DAO as a legal entity, facing growing problems with identity risk globally. The team demonstrates they have the requisite skill sets and have been working in healthcare since 2016 on a plethora of projects. Given the system is agnostic other health providers that already have systems can easily integrate into this one. Countries can instantly set up thier own decentralized Health Information Exchange since both Atala PRISM and Hippocrades are already in place. ", "q0r": 5, "q1": "Given the combination of skills and how established this team is in Healthcare it is highly likely this project will see succeed. They have already built a suite of healthcare applications that are being used by thousands of healthcare providers. Hippocrades will tie these platforms together. \r\n\r\nA relatively fast roll out given the scope, the team have projected to have their platform integrated within 3 months and have requested a reasonable amount of funding in their budget most of which is apportioned to wages and DAO registration. ", "q1r": 5, "q2": "The delivery dates are clearly defined and the community will be able to audit the use of Atala Prism in Hippocrades although it would be nice to see the progress through a public presentation. There is a clear roadmap and success can be measured through the uptake of the project and the legal registration of the DAO.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The proposal accurately identifies and addresses a problem within the proposal but aiming to aid in acceleration of DID adoption within the healthcare sector.", "q0r": 5, "q1": "The proposers appear to have the requisite knowledge and skillsets required however it would be could to see references to specific team members already within the ecosystem. The requested funds are reasonable for the time frame allocated.", "q1r": 4, "q2": "The roadmap and KPIs whilst listed are rather vague and do not have any small clearly defined measurable goals therefore it is difficult to determine audibility.", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}], "solution": "Наши API для здравоохранения могут дополнить возможности Atala PRISM, чтобы большее количество медицинских учреждений могли легко подключиться к системе.", "experience": "В настоящее время мы работаем над инфраструктурой здравоохранения для Web 3.0, которую планируется создать как DAO. Работаем над здравоохранением с 2016 года."}