{"id": 382465, "author": "aprildc", "title": "WEB3 - Image annotation phone-app", "url": "https://cardano.ideascale.com/a/dtd/382465-48088", "category": 26247, "amount": 120000, "description": "Image annotation should be affordable. But in the countries usually doing A.I. research $3/hr is not enough to satisfy a local annotator.", "funded": 0, "upvotes": 16610940, "downvotes": 14599297, "votes_result": 2011643, "votes_cast": 124, "f6_no_assessments": 5, "f6_rating": 2.8, "videos": [], "media": [], "f6_assessments": [{"q0": "Its not really clear how this uses SingularityNet or Cardano. Yes you could integrate it into Cardano somehow, but does that add anything? Payment could be with Cardano, but that's not actually mentioned in the proposal. It is not doing AI, though this sort of information is required for training AI models. AI developers have been using platform like Amazon's Mechanical Turk for over a decade to do this already. ", "q0r": 3, "q1": "The proposer stated this problem as if it needs to be solved, but there are already solutions out there solving it like Mechanical Turk. That changes the problem, which becomes making a better solution. However as the proposer has not referenced existing solutions, and how this will be better, how will this product gain usage. Its not clear the proposer has the experience to build both the back end and front end systems for this to work or integrate blockchain payments if that is to be part of it. The 2 and a half year time line to produce the product seems a long time.\r\nQ8 is time to star heavy marketing but there is no budget allocated for marketing? It would be good to link the budget to the roadmap.", "q1r": 2, "q2": "There is a timeline of deliverables which could be audited, though it seems quite long. We could end up a long way through this before we know if we have something that will work. As the budget is not linked to the road map it may be hard to audit delivery along the way.  Apart from \"Q10 - Onboard 50.000 users and 5000 image set providers.\" there is not much in the way of metrics to measure success.", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 29, "ne": 2, "ng": 23, "nfo": 4, "vca_o": 1}, {"q0": "This idea is great as a concept and the proposer is right about the fact that annotated images will be in high demand in the near future. But there is something about this that I believe will prove difficult to solve and has not been accounted for in the proposal. How could it compete with Google Captcha if they can force this on their users to retrieve the data for free? What would keep them from selling their data, effectively forcing all others out of the market? ", "q0r": 3, "q1": "The proposer has claimed somewhat relevant experience and has pledged to assemble a team to assist him with development. The feasibility of this project depends on the ability to solve competitivity issues with technological giants. ", "q1r": 3, "q2": "Basic information like a roadmap and funding breakdown are present to determine auditability of this project proposal. A risk assessment laying out how the project would handle big tech competition is advised to improve the proposal. ", "q2r": 3, "assessor": "z_assessor_113", "no_vca": 27, "ne": 2, "ng": 19, "nfo": 6, "vca_o": 1}, {"q0": "I feel like the idea in the proposal is too easy that it begs the question if it doesn't already exist? How will the image be annotated? Will there be tools available in the app to annotate the image or will the app highlight attributes by itself? We need a bit more in-depth explanation of the idea.", "q0r": 3, "q1": "On feasibility, the proposal is lacking some information. The proposer states that he doesn't have the knowledge to develop this and clarifies that is will search for developers, but he doesn't state how many team members he needs? The roadmap is clear but rather lengthy for an app of this size? The budget breakdown is reasonable if the information is given on the team.", "q1r": 3, "q2": "Everything needed for auditability is present. An essential roadmap, the funding breakdown. Since the team is still to be hired we can't assess this aspect of the proposal, although it would've been advised to give specifics on how many team members the proposer needs for this proposal.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "Image annotation is key for machine learning data pipelines, and it is a good idea to do such annotation in countries providing inexpensive labor. Furthermore, the plan to build an app that anonymously pays to a Cardano wallet is a good approach.\r\n\r\nHowever, there are already many solutions for image annotation, and this proposal does not have a sufficiently mature plan to build a new one. For example, the proposal budget (which is overall rather large at $120K) includes $15K for wallets and smart contracts -- it is not clear why either of these is needed in the proposal, and the budget for this aspect does not appear to be sufficient. \r\n\r\nOverall, I neither agree nor disagree that this proposal effectively addresses the challenge. The general idea is good but the proposed implementation is not.", "q0r": 3, "q1": "The proposal states that the project is not yet staffed. Although the proposer has relevant expertise, without a team it is not possible to conclude that it is highly likely that this proposal will be implemented successfully.\r\n\r\nFurthermore, some aspects of the plan do not appear to be well thought through -- e.g. the inclusion of wallets and smart contracts (see above).", "q1r": 2, "q2": "The proposal describes a reasonably clear vision for an app, but not does provide many details. For a budget of this size, significantly more detail would be appropriate. Accordingly, I disagree that there is sufficient information to audit the success of the proposal.", "q2r": 2, "assessor": "z_assessor_495", "no_vca": 20, "ne": 2, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "The proposal presents a clear problem with a solution to build a pay phone application for image captioners. In my opinion, this proposal can improve the value of Cardano Blockchain, but I don't know how this proposal will apply to AI, there is no Demo so it will be difficult to imagine. How will the assessment with dynamic scores be measured, using AI in the process of selecting the implementers?", "q0r": 3, "q1": "The proposed cost is large $120,000, and it's not clear how the money will be used (ex: Mobile app - $35,000 how many people to build in how much time? , Part ancillary - $25,000 no further information available describing its use). The proponent also stated that there is no partner involved in the construction and needs to find a partner. To attract more active team members to join you, you should advertise more information and evidence related to your skills experience. The scope of the application in which languages ​​are used is not clear", "q1r": 2, "q2": "The proponent provides a step-by-step roadmap for implementing clear milestones, coherent KPIs, and quarterly timelines. However, the proponent did not mention possible difficulties and solutions (e.g. how to get people involved, how to let those already involved know what they need to improve to do well). than ...). By Q10 there are 50,000 users and 5000 image set providers, this goal is too large for a long time to determine, I recommend the proponent to reduce the goal to ensure completion of each step", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 16, "ne": 0, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "Phone-app that pays the equivalent to $3/hr in AGIX to an image annotator in a country where $3/hr is a decent salary.", "experience": "Electrical Engineer and experienced programmer. Crypto enthusiast, very structured, good at documentation and good at process development."}