{"id": 383052, "author": "volibra", "title": "Identify patterns on Transaction", "url": "https://cardano.ideascale.com/a/dtd/383052-48088", "category": 26247, "amount": 30000, "description": "Detecting merchant, insider fraud in Crypto Payment system is difficult and identifying new types of risks in a timely manner is even harder", "funded": 2, "upvotes": 84237620, "downvotes": 3344431, "votes_result": 80893189, "votes_cast": 255, "f6_no_assessments": 7, "f6_rating": 4.285714285714286, "videos": [], "media": [], "f6_assessments": [{"q0": "This would be a great project if the proposers can pull it off. The ability to detect fraud on block chain transactions would obviously be very useful. Though given the inability to cancel transactions, in a deployment it would need to be built into the block chain itself and flagged transaction not be committed until verified and real. It is a research project, so success is obviously not guaranteed, but that doesn't mean its not worth funding the effort. Its a relatively small funding request so I would be inclined to support it. ", "q0r": 5, "q1": "This is a nice idea and the proposers have some good experience in the area. My biggest worry with the plan is lack of details on the data. Do they have access to merchant data, or just querying the blockchain for transactions itself. The point being you cannot learn the characteristics of fraudulent transactions without labeled examples of fraudulent transactions. Do they have access to a large dataset of labeled fraudulent transactions (which merchants may posses? The proposers are associated with Volibra, but its not clear it if it has transaction or is a system under development. Its the sort of thing banks and payments providers like Visa have for normal transactions) If so, you can do supervised learning and probably come up with some powerful results. If not you can only do unsupervised. You will be able to cluster into different groups, but there is no way to force any of these clusters to be a fraudulent cluster. You just don't have the data.", "q1r": 4, "q2": "There is a roadmap against which delivery of models and systems can be audited. However the proposers have not set any metrics against which the success of the models can be held. What sort of classification accuracy to you expect to achieve (Accuracy, Precision, Recall & F1 Score etc.)? ", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 28, "ne": 8, "ng": 20, "nfo": 0, "vca_o": 1}, {"q0": "A pattern detection system is bound to make any system using it safer. When referencingthe Ethereum blockchain, these types of fraud have been prevalent both in the past and the present. Currently there are multiple payment systems under development on the Cardano blockchain, which makes one wonder if there is a need for such a variety. In this case, the technology that is intended to develop could serve a bigger purpose if multiple systems could adopt it. It would make the proposed project more robust as it would no longer be dependent on the proposer's payment system alone and create a marketable technology across the ecosystem. Clarification on this could improve the proposal. ", "q0r": 4, "q1": "The team has relevant experience to develop the proposed technology. The budget has been defined and realistically broken down per phase. The technology is highly feasible to be implemented as a service on multiple payment systems. The latter has not been cited in the proposal and needs more clarity. ", "q1r": 4, "q2": "Very auditable proposal. All variables are present and defined. To improve the proposal quality, some explanation could be added on how the technology would be marketed to other payment systems in the future. In addition, a risk assessment is advised to clarify security issues for when the system misidentifies transaction patterns. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 25, "ne": 3, "ng": 19, "nfo": 3, "vca_o": 1}, {"q0": "The proposed plan is about an ML model for risk management in a Defi system. By allowing a model to detect patterns in crypto payment systems, we can stop frauds on a fundamental level. By providing this model on SN could serve multiple payment systems on the blockchain. But the proposer remains vague on this if it's adaptable by other systems. They say the model is intended for their own payment system, but as long as they keep the bigger picture in mind I believe this could serve us very well.", "q0r": 4, "q1": "About the team, we get all the information needed to give confidence that they have the relevant experience needed for this project. We get a very well-explained briefing about the roadmap and the budget is feasible in correlation to the roadmap. ", "q1r": 4, "q2": "All components are evident for an audit. A clear roadmap that gives complete transparency into the project. It would be advised to take the risk evaluation publicly since the proposer is now saying that the risk reviews would be handled internally.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "Transaction fraud analysis is an important application of machine learning, and applying this to DeFi will certainly be increasingly needed. The global credit card system depends heavily on such analysis, and DeFi will increasingly do so over time.\r\n\r\nThe clustering approach proposed is an interesting and intelligent approach to the problem. From my experience developing novel machine learning models, it will require substantial experimentation to tune the system for effectiveness, but that's the point of the proposal!\r\n\r\nThere is also a good connection to SingularityNet through the proposal to provide the application developed through their marketplace. This application could be of interest to many DeFi players.\r\n\r\nFor these reasons, I strongly agree that this proposal addresses the challenge.", "q0r": 5, "q1": "The team has strong machine learning expertise (including multiple experts on the team), and has demonstrated this by proposing an innovative approach to the transaction monitoring problem. I strongly agree that this information indicates that the proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal presents a clearly development roadmap and definition of success, which allow auditability. However, there are no specific quantitative KPIs suggested, and in particular no metrics for assessing how well the transaction analysis is performance. The latter class of metrics will be key to building and tuning the model, and to demonstrating that it is effective. Therefore, I agree but do not strongly agree that the information presented is sufficient to audit the proposal.", "q2r": 4, "assessor": "z_assessor_495", "no_vca": 20, "ne": 5, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "It seems to me a very appropriate idea applying artificial intelligence to the world of blockchain since many frauds are carried out on a daily basis due to lack of knowledge and control of the people who start in blockchain. Therefore, this idea can be very useful and it seems to me that it fits perfectly with the challenge", "q0r": 5, "q1": "Very clear plan with a roadmap divided into months explaining what they are going to do in each month and quarter of year. They provide a lot of information about the team members who possess the necessary skills for the development of the project.", "q1r": 5, "q2": "There is a definicion of success in 3 6 and 12 months but I would like to see some kpis, they are very important because they are very useful to audit proposals so I cannot give 5 stars becasue of thet.", "q2r": 4, "assessor": "z_assessor_498", "no_vca": 19, "ne": 2, "ng": 8, "nfo": 9, "vca_o": 1}, {"q0": "Brave idea. I can imagine e.g. it can help even when someone's account gets compromised and the theft would occur, such a mechanism could prevent it.\r\n\r\nAs I understand it, the AI will collect the data and predict what are regular or suspicious txs. e.g. if a small investor is trading only with 2 percentage of his portfolio, and suddenly there are requests for a larger txs, it could notify the user and request additional confirmation. And this would be unique for each user etc, therefore I see potential in this.\r\n\r\nRating given 5.", "q0r": 5, "q1": "Relevant experience seems to be stated, linked in profiles posted. \r\n\r\nThe webpage seems to be working, which is increasing the creditability. \r\n\r\nProvided roadmap seems to be worked in reasonable detail.\r\n\r\nRating given 5.", "q1r": 5, "q2": "I am missing some KPIs or expected outcomes.\r\n\r\nThe progress can be monitored (based on the information stated in the proposal) by another team using the product.\r\n\r\nMore information would be nice to see in the proposal, how we would be able to track and audit the progress.\r\n\r\nWill it be open source?\r\nSubtasks?\r\n\r\nIt would be nice to have it stated explicitly.\r\n\r\nRating given 3.", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 17, "ne": 2, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "DeFi as a fast growing industry will start to see these problems of malicious actors using the payment systems in the near future. Tools that help highlight trends in transactions which can be used to identifier these bad actors would be highly valuable to multiple stakeholders in the ecosystem who may interact with these actors. \r\n\r\nThe proposal addresses the challenge brief, namely it can help with some of the potential directions 'AI improvements to help project Catalyst scale to many times its current size', 'AI projects that fire the community's imagination and enthusiasm' and 'Samples, recipes and templates'. If the team is able to execute on this proposal and provide open source examples it could lead to important tools and data models that could be used across the ecosystem.", "q0r": 5, "q1": "Team information is provided with LinkedIn profiles and accreditation for the team members. The team has both finance and machine learning experience which are the two main areas of focus for this proposal.\r\n\r\nThe team has at least one of the team members already working on a payment solution, namely - https://www.volibra.com/\r\n\r\nIt is unclear whether the team has any experience working with SingularityNET however given the other relevant evidence of skills this is a minor concern in the wider picture provided.\r\n\r\nThe budget is reasonable however due to the complexity there may be a risk of it being under budget for the work required which is worth noting.\r\n\r\nIt appears that Volibra helps deal with payments. What is not clear in the proposal is if Volibra is the only area of focus for doing the machine learning analysis on transactions. If so we should know more about Volibra whether it does any transactions currently and what its plan for growth are as it would be a dependent to this proposal being executed well. If they intend to analyse other transactions elsewhere as well these should be listed with rough transaction volume to understand whether this data modelling will be useful or even feasible currently or in the near future.", "q1r": 4, "q2": "Some roadmaps and definitions for success are provided however no KPI details.\r\n\r\nWhat would be useful here is to understand more about the data they want to show in the analytics dashboard which will determine how effective the analysis will be. The analytics dashboard will be open on a website but it would be good to know whether this work will be completely open source with any code used to do the analysis for other developers to audit. This is important to mention as without this the impact of the proposal would not be as high.\r\n\r\nThe roadmap and timeline provide enough clarity on the execution however more information on what type of data is to be expected and how the team will help the ecosystem with open source examples would have been useful to give more confidence in this area", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "​​A Deep learning approach in Managing risk – through transaction pattern discovery to determine emerging risk in Crypto Payment behaviour", "experience": "A team of Machine Learning Phd student , Udacity Deep Learning Graduates , plutus Dev and Software Developers"}