{"id": 383548, "author": "victorcorcino", "title": "NLP Applied to Conflict Resolution", "url": "https://cardano.ideascale.com/a/dtd/383548-48088", "category": 26247, "amount": 24000, "description": "Dispute resolution generally happens behind closed doors with no public insight into determining what is likely to support a good outcome.", "funded": 1, "upvotes": 39344977, "downvotes": 14035325, "votes_result": 25309652, "votes_cast": 133, "f6_no_assessments": 3, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "This is an interesting project to apply ML algorithms to data from surveys on conflict resolution to support better resolutions. ", "q0r": 5, "q1": "The proposers have good experience in the area and have come up with a plan to collect data in the form of surveys and run relatively simple ML algorithms over them to try and identify patterns to help come up with better solutions. My biggest worry here is about the data. 1) Do they have access to the mediators with whom they intend survey and will these mediators respond to these surveys, If the mediations are behind closed doors are they not confidential and thus can the mediators even release that info?\r\n2) Even if they get that data, its it the right data to answer the question? Surveys of the mediators after the fact may miss the real information, which is what was discussed during the mediation. Can you discern information about how better to resolve a conflict with out data from during the resolution process?", "q1r": 4, "q2": "The proposers have a timeline of deliverables which can be audited. However it would be good to have some numbers on the data. How many surveys do they intend to do and thus how much data will they gather. What is the domain of conflict they will be analysing?  They have a KPI as tested model, but how are they testing it? What measures are they using for accuracy and what accuracy results would constitute  a successful model?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 28, "ne": 4, "ng": 20, "nfo": 4, "vca_o": 1}, {"q0": "Using AI to predict mediation outcomes is a good idea, and this seems a reasonable application to make available on SingularityNet.\r\n\r\nHowever, the proposal is rather sparse in terms of proposing an approach to this problem. There is a fair amount of existing research on predicting litigation outcomes using AI (e.g. https://www.bestpractice.ai/scenarios/predict_case_including_litigation_outcomes), and the proposers do not show any evidence that they have considered such prior work.\r\n\r\nFurthermore, the AI techniques proposed to address the problem are rather basic -- apparently support vector machines and basic deep learning models. While such models can produce good results, feature engineering is crucial (particularly in a complex environment like mediation), and there is no explanation of how this will be handled. I would also have expected some consideration of other possible AI methods, such as large pre-trained language models (e.g.  BERT, GPT-3, etc) which are having a massive effect on many areas of NLP. My experience running an AI start-up indicates that careful consideration of such issues is crucial to success of models adopted.\r\n\r\nFor the above reasons, I agree but do not strongly agree that the proposal effectively addresses the challenge.", "q0r": 4, "q1": "My concerns about feasibility are related to those mentioned above on impact. There is no evidence that the proposers have considered prior work relevant to this problem, and the consideration of AI techniques is not deep. The lack of consideration of techniques for feature engineering is particularly concerning. \r\n\r\nThe technical discussions and metrics suggest that the proposers may have deeper technical knowledge of anonymization techniques (which I agree are important here) than of the AI techniques that will make the predictions that are the purpose of the project.\r\n\r\nAccordingly there is insufficient evidence for me to form a view that the proposal has a high likelihood of being implemented successfully.", "q1r": 3, "q2": "The KPIs and metrics provided are good ones if the proposers are able to achieve their goals. However, related to the comments on feasibility, there seems to be a greater focus on anonymization metrics that on mediation outcome metrics, which seems to me the wrong emphasis. Therefore, I agree but do not strongly agree that the information provided is sufficient to audit progress and success.", "q2r": 4, "assessor": "z_assessor_495", "no_vca": 19, "ne": 7, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The proposal team looks to use surveys at the end of mediation sessions to then develop models that make it easier for parties involved to communicate productively with less conflict. Mediation and legal pursuits are expensive for both parties involved so tools that help to minimise conflict and for finding paths for being productive could provide a high impact to the market of mediation.\r\n\r\nThe amount of data required to train the model for this proposal is non trivial. To fully understand whether this proposal would be impactful more information would be needed on the amount of data that will be collected and where from. How many mediation cases or historical data can they tap into? Will that data be meaningful enough to create a useful end result?", "q0r": 4, "q1": "The proposal details two team members in the proposal with descriptions towards their background. No links are provided about the project or pre-existing work and no supporting sources are provided about the team members such as LinkedIn profiles. Victor is known by the community advisors due to his involvement in Catalyst School and the Catalyst Circle which helps with understanding who is behind this project however better professional background from the team members either from direct links or from previous work sources would be beneficial to really gage the feasibility. A basic budget breakdown is provided which appears reasonable for the task at hand.", "q1r": 3, "q2": "A roadmap timeline is broken down along with KPIs and some success metrics. The proposal has acceptable clarity but would benefit from more explanations about the market such as key problems faced by mediators and how this solution is a further benefit on top of their own accumulated experiences and how much access the team has data and feedback that will ultimately determine whether this proposal is both useful and can gain any traction. Finally it would have been good to understand any open source aspects to this proposal - how will this proposal help the community with education and examples of using SingularityNET that help foster more innovation?", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 17, "ne": 5, "ng": 12, "nfo": 0, "vca_o": 1}], "solution": "Developing ML NLP models to support better outcomes in conflict resolution.", "experience": "Loxe inc. (multiple Fund 6 supported projects) team members, Victor and Eli, are skilled in developing python applications & ML models"}