{"id": 383141, "author": "gradyw", "title": "3D Design and Print NFT Spacecoins", "url": "https://cardano.ideascale.com/a/dtd/383141-48088", "category": 26250, "amount": 10000, "description": "As NFTs precisam de produtos físicos com desenhos em 3D para representar e se manifestar para adoção comunitária além dos especialistas em criptografia.", "funded": 2, "upvotes": 37138927, "downvotes": 16953773, "votes_result": 20185154, "votes_cast": 130, "f6_no_assessments": 4, "f6_rating": 3.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": " Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In programming specific costs in budgets I draw my knowledge from research, and numerical programming capabilities back at my university, not professional experience in the field of software, hence this part of my assesments in this category will be more superficial and more focused on the general budget rationale with the research done and my general programming knowledge in mind. The proposal identifies the general problem of the comprehensibility of NFTs for people from outside the crypto space and tries to approach it by printing physical representations of NFTs. The proposal does not explicitly articulate how this will benefit the Cardano ecosystem. The key metrics and goals only slightly align with the outlined challenge settings. Generally, i find it hard to grasp how the idea of someone having  a monopoly on something, as the proposers say for their proposal, should benefit Cardano and match ist mission, as Cardano focuses very much on decentralisation and democratisation. The proposal has the potential to be scalable, if it is implemented correctly, however the implementation is not described well enough in order to determine this. Feedback: Generally try to make your proposal descriptions more detailed. I can see you have a substantial idea in your head, but you should try putting it into your proposal in a more detailed and enaging manner, otherwise it will come across rather as a pitch than a proposal.", "q0r": 3, "q1": "If the proposers are indeed experienced engineers, it seems reasonable that they have the capacity to realize the 3D printing part of the proposal. How sure they are to fulfill the blockchain/Cardano related specs is unclear, as they state in the proposal they still need to do some acquirement.\r\nThe budget seems reasonable and some parts of it are rationable, while other parts, like the hardware costs could be explained in more detail. No plan is presented for the case that additional funds will be required.\r\nThe proposer offers a timetable with milestones for the first 3 months, that could however be more detailed in order to indicate thath in-depth planning has already been done. Feedback: Put a bit more thought into the details of what you want to do and present it to us in a more clear and step-by step manner. In general, technical details are not explained, which is a clear requirement for proposals in catalyst. Feedback: Try going more into the technical parts of the proposal in order to demonstrate that you are up to the task and to make your proposal accessible to more users.\r\nIn its current form the proposal does not provide a sophisticated implementation plan.\r\nChallenges, resources required and all the deeper details are not considered in the proposal. General feedback: Try starting with 1 or 2 proposals next time and make them really sophisticated instead of starting up with seven proposals that are not properly planned. If you are unsure what I mean, take  look at some of the past funded proposal, and how they have a very dedicated and detailed plan, where every factor and every requirement is explained in detail. A big plus however is that this project is backed by Adosia, which makes it al lot more likely to suceed, which is why I increased my rating in this category from what I originally intended. I however still advise you to be more explicit in future proposals.", "q1r": 4, "q2": " Only a brief roadmap and three very short milestones are presented. The  Metrics/KPIs that define the success of the proposal could be more clear, as they are, ust as the milestones, very open-ended and would theoretically also allow a low-quality execution to pass auditing steps\r\nThe targeted problem is described and a solution along with some success criteria is presented. Here again, it allows for some auditing, however the criteria should be more dedicated in order to better allow auditing for quality.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 17, "ne": 7, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does not exceed the budget ask and provides products to users to help break down the mental barrier of NFTs. Like stated, it would be the first of its kind and has the ability to be produced for users quickly.", "q0r": 5, "q1": "The stated experience is promising aside from relevant blockchain and NFT development experience. They will be reaching out to teams, but there is no guarantee they have that figured out at the moment or have funds to make that happen. They provided the Adosia whitepaper, but I'm not sure that. it is relevant supporting material for this proposal.", "q1r": 3, "q2": "Considering it is in the low budget and within 3 months time challenge parameters, the budget and roadmap is sufficient for audibility. This proposal would benefit from more details on how the funds are to be spent, but it does enough in its current form.", "q2r": 4, "assessor": "z_assessor_612", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This is an interesting idea that will attract a lot of people because now the fiction world can come to the real world with a 3D printer. \r\nBut I hope that the team can tell us about how this project adds value to the Cardano ecosystem, even reading the detail of the plan I still cannot understand which part relates to the Cardano ecosystem. But after reading the whitepaper, I inform this project is developing in the Cardano network, so it will make some impact when succeeds. ", "q0r": 5, "q1": "I think this proposal is not providing enough content for helping everyone understand how their solution work to address the problem, and how they implement this idea to the world. To understand how the system work, we can check their whitepaper on the website. \r\nIn the scope of this proposal, seem like the plan is simple to do. Hence the given info is close enough to prove that the team can make it. \r\nLast but not least, there are still a lot of risks and difficulties in this type of project that I think the team should figure out and make some plans for them. For ex: timing, technical, bug... ", "q1r": 4, "q2": "The info that the team provides is enough to audit this project. \r\nOne more thing is the team must describe how they are aware of the problem context by detailed explanation about it, then detailing the solution that must address those problems. \r\nThey have the detail solution but not have the problem detail. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "I totally agree with this unique idea, design configurable 3D NFTs through parametric algorithms and 3D printing. The target audience will be learners who want to combine the physical and digital worlds, which can be extended with other unique NFT products such as games.", "q0r": 5, "q1": "The identity, expertise and experience of the group on social networking sites should be complemented. The docs would be great with a well-described parametric algorithm and 3D printing with a custom build and hash file. The proposed amount is described in detail for each specific job.", "q1r": 4, "q2": "The functions and metrics to be achieved according to the roadmap are described in great detail. If the algorithm and parameters are demoed in practice, it will be great for people to visualize and evaluate. Is this a free to use app? and can be used on which wallets?", "q2r": 4, "assessor": "z_assessor_697", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}], "solution": "Projetar NFTs 3D configuráveis através de algoritmos paramétricos e impressão 3D com um arquivo de construção e relatório final personalizado vinculado ao NFT.", "experience": "Dois engenheiros e projetistas de aditivos SpaceX com 18 anos de experiência na otimização de estampas e máquinas de metal, cerâmica e plástico"}