{"id": 384056, "author": "passthenachos", "title": "Flat Rules Based Abstracted P2P Net", "url": "https://cardano.ideascale.com/a/dtd/384056-48088", "category": 26250, "amount": 100000, "description": "O processamento On-Chain DApp consome largura de banda da rede e muitas vezes reprocessa arquivos redundantes. Os usuários de DApps utilizam igualmente os recursos da cadeia", "funded": 0, "upvotes": 15469881, "downvotes": 25839643, "votes_result": 10369762, "votes_cast": 124, "f6_no_assessments": 6, "f6_rating": 1.0555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal speaks directly to the main objectives of the challenge, by proposing Multi-layered flat-file P2P experience hydration to solve network bandwidth and reprocesses redundant files for On-Chain DApp. Unfortunately the team does not provide further details on the background problem as well as the proposed solution. This proposal looks like unfinished and therefore should not be funded.", "q0r": 1, "q1": "The team does mention relevant experience in the proposal but it lacks the evidences to back up the claim. The incomplete proposal makes it hard for community to ensure the continuation and success of this project. The team requested a relatively high budget without detail on how the money will be spend or allocated. It is surprising this proposal is pass for assessment given there is no roadmap, budget breakdown, or timeline for the execution of this project in the proposal. My suggestion for the team is to update the proposal with more information and details. ", "q1r": 1, "q2": "There are no clear success metrics or KPI in the proposal. The team does not provide deliverables, roadmap, or detailed plan on how to execute the project and there is no budget breakdown in the proposal. Team does not mention where they will publish the progress of project execution making it impossible to trace, monitor, or audit the project. My suggestion for the team is to update the proposal with more information and details including deliverables, goals, KPI, roadmap, detailed execution plan, and budget breakdown. ", "q2r": 1, "assessor": "z_assessor_643", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "It seems that the proposed group has not come up with a solution to the given problem. I think that with a proposal that has not yet provided a summary, the impact of the above proposal is not very positive. .hope the author will do well next quarter.", "q0r": 1, "q1": "this is a disappointment as you are not done with this project.the team has not released any information regarding the proposal nor the team information.it has requested such funding.I hope to next time you can read the group's finishing proposal", "q1r": 1, "q2": "the proposed team is missing the whole content of this proposal. I think next time the community we can read the complete proposal of the group. I am quite looking forward to the next time.", "q2r": 1, "assessor": "z_assessor_644", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The problem in the proposal is within this challenge. But there is no detailed plan or key metrics to assess how this proposal impacts Cardano ecosystem. For this idea, my recommendation about key metrics they can choose is about increased rate of total users, number of partners... ", "q0r": 2, "q1": "There is nothing in this proposal! \r\nFor assessing the feasibility of the proposal, the team should have a roadmap with a realistic timeline that they can adapt. The budget also should be detailed and fit with the plan and be reasonable. \r\nMoreover, showing some relevant risks will help us assess that the team has a well-preparation. ", "q1r": 1, "q2": "For helping Catalyst community audit the proposal, the team should give a detailed roadmap with a timeline that is realistic with the ability of team members. This proposal doesn't have these things, that's the reason why this proposal cannot be audited. \r\nOne more thing that the team doesn't have here is a detailed explanation about the problem and a solution that to show how they are well-knowing and addressing the problem. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The proposal has a problem that within the challenge but has nothing in detail. It doesn't have info about how it will impact on Cardano ecosystem. \r\nIt also doesn't have any key metrics or plans to measure whether what this idea brings is meet the challenge or not. ", "q0r": 1, "q1": "This proposal lack all basic info for assessing the feasibility. The short brief is not enough for assessing. They should inclcude: \r\n- Detailed implementation plan for knowing what they will do with their solution to address the problem. Not just about the features, but also includes use cases, technology explanation, marketing, activities... the more detail is great\r\n- Detailed roadmap and budget to assess that are they reasonable with plan or not \r\n- Team info to clarify the ability to execute the plan \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. \r\n", "q1r": 1, "q2": "Cannot scoring the auditability of this proposal because it lacks everything for that. For auditing the progress and success of the proposal, it must have: \r\n- A roadmap with milestones and a time horizon for achievement. And metrics/KPIs that define the success of the proposal. Those 2 will help Catalyst track and audit in periods. \r\n- Clear understandable description of the targeted problem. And the clear understandable solution that addresses the problem. These 2 will help to know what is this proposal expects up front. \r\nThis proposal have none of them. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "This proposal focuses on multi-layered flat-file P2P experience hydration reduces network traffic and has smaller processing needs with control over file sharing. It seems that this proposal is incomplete, since the detail plain was not provided. Besides, this proposal is currently requesting $100,000 [while this challenge's instruction states that the budget can not exceed $10,000].\r\nBased on the given information, I strongly disagree that this proposal effectively addresses the challenge, and would give it a score of 1.\r\n\r\n\r\n", "q0r": 1, "q1": "Since this proposal is incomplete [almost no experience information and profile link, doesn't have any roadmap or KPIs, and of course, the risk is not defined], there is not much proof of feasibility to evaluate. Therefore, based on the given information, I strongly disagree with this proposal's feasibility, and would give it a score of 1.", "q1r": 1, "q2": "As mentioned, since this proposal is incomplete [almost no experience information and profile link, doesn't have any roadmap or KPIs, the budget structure is not defined, and the risk is not defined], transparency is at a low level. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 17, "ne": 3, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "The increasingly used Dapps on cardano will make the on-chain transaction data larger and larger, this is the problem that the Deadalus wallet is facing when it takes a long time to sync\r\nThe solution description does mention the problem of layers, but the specific technical problem is not mentioned", "q0r": 1, "q1": "The project team has not been mentioned, the people on the team have not been publicly announced so that the community can know their experiences and related fields, via LinkIN, Twetter, Facebook or published videos. Attached solution\r\nThere is no roadmap as well as work items to be done so that the community can understand it\r\nThe KPIs have not been established detailing the work items in progress, to be done and other necessary resources", "q1r": 1, "q2": "The amount requested for the solution is up to 100000$, but there is no specific roadmap to clearly present the contents to be done with it.\r\nIn terms of budget, it is necessary to clearly explain what expenditures (in terms of human resources, equipment, etc.) need to be explained more clearly to the community.", "q2r": 1, "assessor": "z_assessor_757", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}], "solution": "A experiência de hidratação P2P de arquivo plano multicamadas reduz o tráfego de rede e tem necessidades de processamento menores com controle sobre o compartilhamento de arquivos", "experience": "A equipe fundadora detém mais de 20 patentes americanas, 2 Emmys técnicos, 1 Oscar, Saídas múltiplas, Web 2.0 Series B existente financiada com clientes da lista A"}