{"id": 366888, "author": "", "title": "Oracle for CPI data", "url": "https://cardano.ideascale.com/a/dtd/366888-48088", "category": 26109, "amount": 85000, "description": "Mandatory for mass adoption of DeFi is CPI data on blockchain\n\nLong term contracts like:\n\nrental, lending, insurance need yearly price adopt", "f6_no_assessments": 3, "f6_rating": 1.6666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Oracle data is important for DeFi. CPI data is one component of that. However $85k is a large proportion of the total challenge just to get CPI data onto the chain. Could we not get this data from the world bank (https://data.worldbank.org/indicator/FP.CPI.TOTL.ZG). The proposer should give some more information as to what exactly the CPI data would be used for. Is that all that is required for those use cases, or are we providing only one small piece of the puzzle? ", "q0r": 3, "q1": "Very little data has been provided on how the CPI data be provided. What resolution? How is the data verified. What are the data sources? Examples from Europe don't necessarily hold for Africa. How is the data paid for going forward? For Instance oracles pools on ERGO have a mechanism to pay providers for each data point. The proposer has also not provided information showing that hey have the technical capability to implement this. Please break down what the money is being spent on. \r\nPerhaps a smaller minimum viable project a a subset of countries to prove robustness and reliability of the data would be a good first step requiring less funds.", "q1r": 2, "q2": "There is no timeline for delivery or detail on the actual data to be provided for progress to be assessed against. What does success look like? Perhaps you could measure the number of smart contracts using the data, or the value locked in smart contracts relying on this data?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Draft proposal\r\n\r\nNo sources were provided to support the implied problem statement. The vast majority of data used by dapps in DeFi and provided by oracles has been price feeds. What is the demand for the the CPI index?\r\n\r\nThere is no clarity on the relevance that providing the CPI index would have in the next 6 months (deadline established in the challenge brief for impact assessment). Is there any dapp in development at Cardano that will need the CPI index in the next 6 months?\r\n\r\nFor the indication of impact a more robust argument is needed.\r\n\r\nThe proposer submitted the same proposal in two different challenges. There are only minor modifications to the problem statement and solution.\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Oracle-CPI-data-47-African-counties/366879-48088\r\nhttps://cardano.ideascale.com/a/dtd/366888-48088", "q0r": 1, "q1": "There is no plan, just a draft. There are no elements that allow judging viability. I recommend adding the items described in the Catalyst documentation for a new proposal.\r\n\r\nThe proposer submitted the same proposal in two different challenges. There are only minor modifications to the problem statement and solution.\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Oracle-CPI-data-47-African-counties/366879-48088\r\nhttps://cardano.ideascale.com/a/dtd/366888-48088", "q1r": 1, "q2": "There is no plan, just a draft. There are no elements that allow judging auditability. I recommend adding the items described in the Catalyst documentation for a new proposal. E.g. Metrics, KPIs, roadmap, budget breakdown, etc...\r\n\r\nThe proposer submitted the same proposal in two different challenges. There are only minor modifications to the problem statement and solution.\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Oracle-CPI-data-47-African-counties/366879-48088\r\nhttps://cardano.ideascale.com/a/dtd/366888-48088", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Even though a CPI Oracle is a good idea, the proposal itself needs work. The proposal should address how a CPI oracle will impact the metrics of this challenge. A more specific use case might also help readers that don't really understand contract adjustments based on reference data such as the CPI or Labour Price Index. ", "q0r": 2, "q1": "Christian could improve this proposal by giving more detail about his experience and why he will be best placed to produce this Oracle. There are many sources of CPI freely available on the internet, the proposal should probably address what additional value Christians experience is bringing this particular Oracle and why his version of this will be trustworthy as an Oracle for contracts to base auto-price adjustments off.", "q1r": 2, "q2": "The proposal can be improved by addressing the audit requirement directly. By either independent inspection of the Oracle function, working contracts on the test net that use the Oracle, and independent inspection of the historical CPI values and the process for adding new quarterly / annual CPI values to the Oracle over time.", "q2r": 2, "assessor": "z_assessor_493", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Provide customer price indes data for Defi Contracts as Oracle\n\nUS, EU, Asia", "experience": "more than 20 years experience in finance industry as manager\n\nlove cutting edge technology like Cardano as developer\n\nfree DEFI for all"}