{"id": 367422, "author": "", "title": "Fund unlimited social microlending", "url": "https://cardano.ideascale.com/a/dtd/367422-48088", "category": 26109, "amount": 6500, "description": "Microlending apps struggle to secure debt funding to lend out to their underbanked users as the financial system has tough entry barriers.", "f6_no_assessments": 4, "f6_rating": 3.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems like a great idea bringing an established micro-lending platform into the Cardano space. By using rewards as the collateral, stakers are swapping their ADA stake return for unsecured micro lending returns, whilst preserving their capital. I would like to see some information on how stakers are guaranteed that actually get the micro-lending returns. Is this just done off chain on trust or through a smart contract?", "q0r": 5, "q1": "The proposers are already involved in this space and have linked up with SPO's thus are likely to be able to deliver. The proposal is relatively simple with clear deliverables. It would be good to see more information on how returns/defaults etc on the micro-loans will be communicated to stakers. It is implied in the proposal, though not actually stated that stakers will earn these returns minus the 5% cut for the lending platform.", "q1r": 5, "q2": "The proposal contains clear deliverables with which to audit progress. It would be to see metric on the success side in relation to 2 things. 1) how much more stakers earn relative to just staking, 2) how much additional lending this facilitated.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 10, "ne": 3, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal enables the unbanked to access capital at low rates, this accompanied with the level of scale the proposal looks to address shows that it addresses the challenge well.  ", "q0r": 4, "q1": "It's not clear how social lending can be unlimited, someone at some point surely has to put up some capital as collateral, what if there isn't enough funds to lend out even if loan costs are small.It looked like from the comments that the tokenomics weren't established, perhaps this should be something that's sorted out before continuing further. Where are the 2 raspberry pi's going to be stored, for such a high value system i'd want better infrastructure than 2 pi's. Perhaps more server redundancy, devops, continuous integration and deployment. 270M Ada staked from a partnership seems to be significant risk if one or both pies went down. However they do have a track record in already lending out 25,000 USD in the last 5 months so that does indicate that the project could be a success when scaled up. ", "q1r": 3, "q2": "The markers of success have been clearly outlined with KPI's. However once these are reached where would the project go from there. A road map would a good tracker of success and then this could be matched against development deliverables with time dates and goals. ", "q2r": 3, "assessor": "z_assessor_332", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The problem cited makes sense. There is a large portion of the population in need of loans and there are predatory fees in many lending services, but the solution presented is unclear and unrelated to DeFi.\r\n\r\nThe use of stake pools by itself is not related to DeFi and the loan concept described involves at least one centralized custodian for the conversion to FIAT, which completely undermines the DeFi concept.\r\n\r\nHow does the project intend to lend FIAT having ADA as collateral without going through a financial institution?\r\n\r\nThe defined goal doesn't indicate impact on the challenge and is not related to the challenge.\r\n\r\nI recommend submitting the proposal in an appropriate challenge.", "q0r": 1, "q1": "The team describes relevant experience with centralized lending services, but since the proposal's goal is to create and operate a pool, there is no mention of who will be responsible for operating the pool.\r\n\r\nThere is a budget breakdown, but it's not clear what the senior dev's assignment is. Will he be responsible for operating the pool? Without information about the work to be done, it is not possible to assess the feasibility of the $3,000USD allocation.\r\n\r\nAlthough the proposal aspires to create an alternative loan model, in practice the proposal appears to be a request for funding for the pool's operating costs.\r\n\r\nMy recommendation is that before starting a pilot requesting people to delegate to your pool with at least 100% variable rate:\r\n\r\n- Finalize the tokenomics model, so that delegates understand the risks and benefits of exchanging the ADas they would receive for the platform token.", "q1r": 1, "q2": "The problem description makes sense, but the solution described is not in line with the challenge and there is no information to indicate that it is a viable concept.\r\n\r\nThe success of the proposal depends on the pool reaching some established criteria within a certain time, it is a simple concept do audit.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "A great proposal, aligned with the challenge and the Cardano mission: Making the world work better for all. I have interesting in microlending for many years and know some of the platforms based in Switzerland (i.e. Blue Orchard) and have been lending on platforms such as Kiva. There are still many inefficiencies in microlending and the proposal well approach the problem and the solution. \r\n\r\nThe proposal has the potential to grow and scale across borders. \r\n", "q0r": 5, "q1": "Great team and advisors with good relevant experience, although it will be good to have someone also with background from the microlending/finance industry. It would have been good to have more details on each member and LinkedIn profile link (which could be found on the website). Very relevant partners on board from the Cardano ecosystem. \r\n\r\nThe plan vs. the idea is aligned. The company is already operative with a very good website and initial measurables results.\r\nThe next steps and the idea to integrate to Cardano ecosystem makes total sense. \r\n\r\nI have been working with startups for many years (i.e. meteor at seedstars.com and givingway.com) and find the quality of the focus and quality of offer very good.\r\n\r\nThe budget is reasonable and I can see it finance mostly the delta for the pilot. \r\n\r\nThe team was very responsive to messages they got from the community and well answered. \r\n", "q1r": 5, "q2": "Deliverables, timeframe, and roadmap are all put in simple and clear terms which makes it easy to follow. Clear and measurable KPIs. \r\nBased on the successful pilot it would have been good to have a 6 and12 months plan and KPIs, which will show the full scope of the project once you switch the company funding to Cardano. \r\nIt would have been good to have a risk and challenges section. I believe there are many, and good to show you considered and understand them. \r\n", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "Create stake pools & use the rewards as collateral with liquidity partners to secure the debt funds needed, give our own tokens as rewards.", "experience": "CEO: former Regional Manager of Cabify (largest Uber regional competitor) & ex-McKinsey. CTO: former Tech and Data Regional Lead for Cabify."}