{"id": 367727, "author": "", "title": "Wise Rabbit- Livestock Investment", "url": "https://cardano.ideascale.com/a/dtd/367727-48088", "category": 26109, "amount": 30000, "description": "Farmers & citizens suffer from a lack of liquidity & investment due to an unstable, inflationary currency, resulting in poor food security.", "f6_no_assessments": 5, "f6_rating": 3.4, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=14922"], "media": [], "f6_assessments": [{"q0": "This is an interesting project that would allow ADA to be deployed into the real world in a interesting application. The majority of the project risk is off chain in the farm however, which poses interesting problems to be managed. ", "q0r": 3, "q1": "The proposers claim to have done a similar style project  with pigs. Projections of herd growth only talk about birth rates. There is not discussion of feeding costs, land rent, mortality, disease etc which must be major considerations. I would like to see more detail on how this adds up. It is also not clear how stock is sold or the mechanics for how investors are compensated. All the project costs are prior to a farm even being run. A value of 4000ADA as investment is mentioned, but this seems out of scale with the 30,000 ADA requested. Why hold a 5000ADA marketing event to raise 4000ADA? Please provide a clearer breakdown of the economics of the idea.", "q1r": 2, "q2": "The project plans stops before the farm is established, thus its hard to audit progress. Auditing of progress and success should continue until at least some operation of the farm with some metrics on returns etc to be me measured.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 11, "ne": 2, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "These sorts of investments such as real estate investments being on the blockchain are increasingly popular. This project would be a good addition to the other DeFi products and services in existence. It could also produce some press as, far as I know, is very unique and would make for good news.", "q0r": 5, "q1": "This proposal should be considered alongside their CheCha proposal as well, and then Anthony's qualifications are here: https://www.linkedin.com/in/anthonyza/\r\nhttps://github.com/expelledboy\r\nhttps://betaplum.com ...and Sacha seems very experienced in this field, as there is already a working investment platform in place: it just doesn't have a crypto asset. This is a very interesting project that could help not only Africa, but since it does this also this would seem favorable to Cardano's missions, but any farm investments. I am in Arkansas, USA, and am interested in this service myself for chickens, perhaps. Would be better than having to develop a ChickenCoin.", "q1r": 5, "q2": "This was one of the most comprehensive proposals I have seen. $30K for a new Cardano based coin, involving livestock investments, is a low cost to advance this proposal. I like they have not only working websites in place, but working platforms that seem like they just need a crypto space to work in.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The problem description and solution are not clear. Despite an extensive rationale, it is unclear what the relationship between livestock, token, and smart contracts will be.\r\n\r\nThere is no indication about how the proposal is related to the challenge and to the metrics established in the challenge brief.\r\n\r\nThe goals and deliverables described do not indicate a relationship with the challenge, therefore, they do not indicate impact relevante for the DeFi Ecosystem.\r\n\r\nThe proposal seems in line with the challenge \"Grow Africa, Grown Cardano\", I recommend that it be submitted to it.", "q0r": 1, "q1": "The purpose of this proposal is not clear. I understand that the culture of inflation in some countries makes people look for alternative assets to the local currency to store value and animals can become an alternative in some communities, but from this point on things don't make much sense in proposal.\r\nWhat is the intention of creating an asset? It seems to me that the intention is to link the value of the currency to the livestock or production, but this is not clear. What will cause parity to be respected? Will the token be an NFT or a fungible asset? How will the team solve the oracle problem in this proposal? Is the intention to use metadata and create \r\n something related to supply chain?\r\nThe proposal needs to clarify several conceptual aspects, mainly why using blockchain and how it will be done. If there is a need and usefulness to use blockchain, it is necessary to indicate if there will be a token, how it will be used and the tokenomics so that it is possible to check the feasibility of the proposal.\r\n\r\nWhat means \"Creating a livestock smart contract\"?\r\nReal-world physical assets aren't easy to tokenize.\r\n\r\nThe lack of clarity in the purpose of the proposal makes it difficult to understand the team's ability, but the intention to create tokens and use smart contracts was mentioned and although there is not enough detail on the technical part, I assume that experience of a Plutus developer will be necessary and there is no mention of the team's experience in developing smart contracts.Will the team rely on WADA to develop the smart contracts? It's my guess, but this needs to be clearer.\r\nThe budget breakdown is not clear enough, it is necessary to provide more details about the allocation of resources.", "q1r": 1, "q2": "There is no clarity in the problem, the solution described in the proposal and in their relationship with the challenge.\r\n\r\nThe indicated metrics are not sufficient to allow good auditing, as they are subjective. What does \"whitepaper approvals\" mean?\r\n\r\nKPIs were not included.\r\n\r\nThere is a roadmap, but the proposal milestones and deliverables need to be clearer to facilitate auditing.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 9, "ne": 5, "ng": 3, "nfo": 1, "vca_o": 2}, {"q0": "There is no doubt that the people in charge of this proposal knows what they do.  The proposal covers all the basis requested for the challenge in terms of information.   Undoubtedly, the proposal is an excelent example of \"killing the middleman\" in terms of access to capital.  And there is no other sector like the agricultural where the middleman (the traditional bank system) deserves a slow and painful death.\r\n\r\nSupported by initiatives like Wutano (which include the Wise Rabbit Project between the services offered by Wutano in its Wutano VIP Cards), the influx of investors to the proposal would be robust.\r\n\r\nIn the proposal there are two (2) concepts not very clear:\r\n\r\na.\tMeat prices behavior\r\nb.\tEnvironmental and animal's ethical treatment concerns\r\n\r\na.\tMeat prices behavior:  the maths behind the proposition to the prospect investors are*:  \r\n1.  A rabbit costs $7.50 to produce. \r\n2.  We plan to sell them for $10.00. \r\n3.  Thus each rabbit can produce a profit of 25 to 30%. \r\n4.  A rabbit will produce 48 Rabbits in Year 1. \r\n5.  It therefore costs $360 Dollars to Produce a Raise A Family of 48 Rabbits. \r\n6.  An investor who invests $60 Dollars therefore owns a 6th of that family of rabbits. \r\n7.  A $60 dollars investor therefore owns the profits of 8 rabbits by end of 12 months. \r\n8.  Their expected profits are therefore $2.50 x 8 rabbits = $20 profit.\r\n*Information extracted from https://wutano.com/wp-content/uploads/2021/07/Wise-Rabbit-Investment-Pack-PDF.pdf.  The inversion plans described in that document spins around the same investment rational.\r\nThat type of maths give to the people the impression of a business model without many mobile parts and sustainable in the long term but, as is widely know, the market prices (included commodities) does not follow a lineal behavior like the Rabbit's reproduction cycle.  Variables out of the control of any individual affects the prices of anything all the time and, in the case of the meat, factors like raw materials, transport, workforce, weather, government, competitors, etc, etc, etc.,  can push down or up the final margins.  It's simply the nature of the business.\r\nIn general, the proposal and the information in the links provided don't put up the sufficient clarity about that.  \r\n\r\nMy reasoning over this aspect (widely open to other arguments) points out to the implications for the value of the tokens to be issued for the proposal.  Of course, pegged the value of the tokens directly to the price of the commodity is an excelent solution againts an unstable and inflationary currency factor.  But the unstability factor does not finish there.  The oscilations (in ocasions, violents oscilaitons)  of the prices are part of the nature of the prices.  And that, I think, should be mentioned with total clarity in the proposal and not in a small-words-contract-bank way (typical practice from the traditional Banks industry).  Note: however, pages 15 to 18 of the document https://wutano.com/wp-content/uploads/2021/07/Wise-Rabbit-Investment-Pack-PDF.pdf provide a more informative approach about those risks (at the end of the document). \r\n\r\n2.  Consumer decision-making based on environmental and animal's ethical treatment concerns are a reality.  The actual world is a world of total integration of the supply chain where each link is an active piece in the satisfaction of the final client.  And the final client of this new world is a human that thinks the human behavior in front of the planet, the animals and the nature has to change radically.   That's the new world in which we live now, and the advantage of the developing countries is light baggage for make the relevant changes in their local agricultural processes \r\nif you study proposals like the \"Auto-onboard smallholder farmers\" presented by the consortium hummingbird tech – eaternity, for the F6: Grow Africa, Grow Cardano challenge (https://cardano.ideascale.com/a/dtd/Auto-onboard-smallholder-farmers/367514-48088), you realize that in the today's world the environmental and animal's ethical treatment concerns not only are not a minor concern, they are the norm for purpose of income sustainability in the actual global efficient market (efficient market = if you don't do it, someone else will).  And today, everything is global.\r\n\r\n\r\nIn conclusión, points a and b are important for a proposal that \"We want to create a large scale rabbit with export strength to rival Australia's largest farm. That's our long-term goal.\"\r\n", "q0r": 3, "q1": "-  There is no doubt that the people in charge of this proposal knows what they do.  The proposal covers all the basis requested for the challenge in terms of information.  \r\n\r\n- The proposal has not considered challenges and risks relevant to the volatility of the meat prices itself.\r\n\r\n-  The proposal has not considered challenges and risks in relation to the environmental and animal's ethic treatment impact of its practice.\r\n \r\n", "q1r": 4, "q2": "-\tThe proposal provided a roadmap with milestones for the follow-up of the proposal.\r\n\r\n-\tThe proposal present metrics/KPIs that define the success of the proposal.\r\n\r\n-  The proposal does not provide  metrics/KPIs taht permit make following of the environmental and animal's ethic treatment impact of its practice", "q2r": 4, "assessor": "z_assessor_541", "no_vca": 8, "ne": 5, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "The proposal aims to create a simple familiar way for African farmers to use Cardano DeFi. ", "q0r": 5, "q1": "Team is consisted of people active in the community with significant experience in the related subjects. Plan is well-explained with reasonable detail. Proposers are aware of the challenges regarding regulation and technical adoption which will definitely take some time to overcome.", "q1r": 4, "q2": "Auditable goals are set in the proposal. Budget breakdown is clear and concise. There seems to be sufficient understanding in the proposal to tackle the challenge.", "q2r": 5, "assessor": "z_assessor_65", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Africa-centric, micro-investment through a blockchain ADA wallet. Investment through a familiar practice known to Africans, that is farming.", "experience": "Existing crowd-funded piggery, supported by 200 investors. Seasoned software developer is a co-proposer with an existing digital app wallet"}