{"id": 368441, "author": "", "title": "Ensuro: A Decentralized Insurance", "url": "https://cardano.ideascale.com/a/dtd/368441-48088", "category": 26109, "amount": 50000, "description": "Insurance is hardly present where most needed, as in developing countries, and is unavailable as an investment product for ordinary people.", "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "This project is bringing insurance contracts onto the blockchain. The proposers have already implemented in Solidity for Ethereum and are asking for funding to convert to Plutus for Cardano. It snot clear whether the project would then run solely on Cardano or on both Cardano and Ethereum. This clearly meets the challenge criteria of bringing new DeFi users to Cardano, though its not clear whether it would bring a large number or just be limited to a small number of high net worth individuals. Either way it could bring significant capital onto the Cardano blockchain and provide a example for other projects.", "q0r": 5, "q1": "The proposers have already implemented smart contracts in Solidity and wish to convert to Plutus. It would be nice to se more detail on why $50 is the right amount to achieve this. How many hours do they expect to need to do the conversion? \r\nThey have a detailed plan to trial the product, have deep industry and technical experience and are in the process of lining up partners. \r\nIt would be good to have information on oracle sources. Are these smart contracts paying out on events, if so, how do they know those events occurred?", "q1r": 4, "q2": "The road map provided will enable progress to be audited and in same sense success is progressing through that road map. Perhaps there could also be some goals in terms of value insured, and number of participants involved in the contracts. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 12, "ne": 5, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement is somewhat vague, I was only able to understand the problem statement and solution after reading the proposal and the whitepaper.\r\n\r\nDecentralized insurance is certainly a concept within the DeFi spectrum, but the absence of metrics and KPIs makes the impact subjective. I recommend defining deliverables more clearly. The idea is to redeploy the contracts in Plutus in Q1 2002, but when is the dapp expected to be functional for users? Will it be ready within 6 months after funding? This is an important aspect, as it is one of the premises of the challenge. This was not clear in the proposal. Furthermore, there are no metrics or KPIs that indicate the impact of the proposal. I recommend including these items as well.", "q0r": 3, "q1": "The team has extensive experience in the financial and insurance markets. There are links to their LinkedIn profiles and repositories, where is possible to attest to these statements.\r\n\r\nIn the Ensuro repository on Github it is possible to verify that Guillermo is the main contributor, being responsible for the development of the project's code in Solidity, there is a mention of his participation on Plutus Pioneer Program but i could not find additional information on Github or Linkedin about his experience with Haskell or Plutus.\r\n\r\nConsidering that the main intention of the proposal (as described in the budget) is to re-implement the code in Plutus, it is essential that there is greater clarity in the team's ability to execute this, I recommend the inclusion of more details about the developer's experience with Plutus/Haskell.\r\n\r\nThe team mentions that the 50,000USD budget will be used to redeploy the smart contracts in Solidity for Plutus and hire a front end developer, but there is no detailed budget breakdown.\r\n\r\nMost roadmap milestones involve aspects outside the scope of the proposal itself. I think it is important that the proposal focuses on implementing the contracts and creating the interface for using dapp, since the budget request will be for the re-implementation of the code in Plutus and the creation of the front end.\r\n\r\nThere is one confusing points in \"Current Status\" section: \"1 Ensuro's smart contracts are completed and can be viewed here...\"\r\n\r\nThe contracts I could find are in Solidity(not Plutus), this may lead some people to understand that the project development is already in Plutus, I recommend modifying this section for clarity.\r\n\r\nAlthough the team mentioned that they are in the process of obtaining a license in Bermuda, regulatory risks were not mentioned and the use of stable coins, such as USDC, brings not only legal/regulatory uncertainty, but also technical risks in the peg of these assets.", "q1r": 3, "q2": "There is a roadmap with milestones, but it is not clear if the scope of the proposal will be completed within 6 months, even because there is no clarity on the deliverables. What is envisioned in the roadmap is the redeployment of smart contracts in Plutus in Q1 2022, but it is unclear when the front end and application will be functional.\r\n\r\nThere are no metrics or KPIs, I recommend including both.\r\n\r\nThe description of the problem and solution can be made clearer to make it easier to see the purpose of the proposal.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This team desires to solve the challenge of creating a decentralized liquidity pool that acts as a licensed insurance fund to back up insurance products. There is an outstanding White Paper on the website that describes the proposal in great detail.", "q0r": 5, "q1": "This team consists of 4 members and 2 advisors that have a high level of experience and domain expertise in the insurance industry. There is a high probability of success for this proposal, and the team has currently implemented a solution in Solidity and want to port the project into Plutus.", "q1r": 5, "q2": "This proposal appears headed for success and just needs to clarify the milestones and roadmap a little more so that everything can be audited to ensure that the proposal is successful. The final milestone for the project is partnership with a micro-insurance parametric MGA provider and identify NGOs for premium subsidization in emerging countries. There should also be numeric KPIs that are clearly stated for auditors to refer to.", "q2r": 3, "assessor": "z_assessor_449", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "This proposal has identified a suitable problem and appears to have the team already formed to effectively make an impact. The business sector they are targeting represents an excellent example of an industry run by the elite to the detriment of the masses and as such is an excellent opportunity for decentralisation. ", "q0r": 5, "q1": "The team is comprised of individuals with impressive experience and knowledge in disruptive business technology. The whitepaper discusses how the project will democratise the insurance industry and this fits nicely with Cardano ideals. ", "q1r": 5, "q2": "This proposal is an excellent example of what Project catalyst hopes to inspire. The team already have a website and whitepaper. Smart contracts are touted to already be formulated as are potential industry partners. Perhaps my only concern is the size and scope of the undertaking which is massive and will require a fully committed team. Having said that, after reviewing the enormous amount of information provided in this proposal I can find very few (if any) reasons to suggest this proposal will not be successful.   ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Insurance protocols are definitely an important part of the upcoming DeFi suite. Proposing team identifies it, deeply understands it and states an actionable plan of tackling the challenge.", "q0r": 5, "q1": "The team is highly experienced, there is clear understanding of the operations required for implementation and the proposal states it. I think it would be really beneficial to have a clear cost breakdown. The proposal states that 50 000 dollars will be used to rewrite existing smart contracts into Plutus, which is perfectly fine, but it would be great to see how many Plutus devs they plan to onboard and what would be their hourly rate.", "q1r": 4, "q2": "There are clear milestones stated and there is a clear operational plan in the proposal. However, I think it would be beneficial to see measurable goals in the proposal e.g. 100 insurance contracts sold, 5 million USD locked in liquidity pools etc. Also, I would like to see a more detailed breakdown of the budget.", "q2r": 4, "assessor": "z_assessor_65", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "A Decentralized liquidity pool that acts as a licensed insurance fund to back up parametric insurance products.", "experience": "C-suite comes from VC, Blockchain (L2), Reinsurance, 25yr+ Software Development, PhD Mathematics, Ms Physics, Financial Risk Management."}