{"id": 368779, "author": "", "title": "Maladex: Cardano Index Funds", "url": "https://cardano.ideascale.com/a/dtd/368779-48088", "category": 26109, "amount": 60000, "description": "Investors with the multitude of Cardano projects to choose from are unable to invest in all of them and control the risks involved.", "f6_no_assessments": 7, "f6_rating": 4.476190476190476, "videos": ["https://youtu.be/f1PBRsDiNPw"], "media": [], "f6_assessments": [{"q0": "Index investing in the crypto space is a great idea. This proposal fail to make an important distinction however. There are two components. First is the index, second is a fund which tries to replicate the returns on that index. The SS&P500 index mentioned as an example is produce by Standard and Poors. An index fund run you invest is generally run by an asset manage, say Blackrock. Sometimes they are run by the same entity, but usually this is separated for independence. Goldman Sachs sold the right to their commodities Index (GSCI) to S&P in 2007 for instance.\r\n", "q0r": 4, "q1": "The proponent has the experience to implement this type of product. However the plan required more details. For the proposal to work, the rules for the construction of the index needs to be defined prior setting up an index to replicate its returns. This also requires oracle for all the information that will go into these indices. Perhaps this proposal could come back in smaller pieces to build up the components for the oracles, then the index productions, then the funds to replicate the returns on those indexes. \r\nHow would and NFT fund replicate the returns on an NFT index. Each NFT is individual (non-fungible), so the index can calculate its price, but cannot buy pieces of it to replicate the return.", "q1r": 2, "q2": "More detail needs to be provided on all the components and how they will be built and put together to produce the proposed outcomes. It would also be good to have some goals the success is defined upon that are not just technical products, i.e, vlaue of index funds locked in the contract.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 15, "ne": 6, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "The proposal addresses one of the burning issue in Cardano, multy pool delegation to the Stake Pools via smart contract. The idea was even floated by Charles H. where a delegator can select a group of stake pool operators and delegate to them with 'one click'. Such group can be SPOs, mission driven or similar. A much needed solution to strengthen the decentralization of the Cardano ecosystem and support SPOs.\r\n\r\nThe proposal also offers a solution to invest with 'one click' to many NFTs, cryptos or other traditional assets in a similar way index funds work.\r\n\r\nKey metrics are presented as milestones to be achieved and delivered.\r\n\r\nThe proposal is fully aligned with the Challenge.\r\n\r\n", "q0r": 5, "q1": "The proposer has demonstrated extreme and detailed knowledge for this development, presented public YouTube interview as well as current state of the DEX development. \r\n\r\nThe proposer is also an highly educated individual with sufficient skills and experience to deliver. The presented plan is reasonable, both in scope and budget. \r\n\r\nBudget is consisting of working hours and is moderate in amount. The tasks to be performed are defined with the time estimates and persons are already part of the team. \r\n\r\nBased on the provided info, it is highly likely that the project will be implemented.", "q1r": 5, "q2": "The proposal has a clear roadmap, steps, budget, time estimate and deliverables. The problem to be addressed is clear (multitude of choice) and the solution is clearly presented (on-chain indexes).\r\n\r\nThe potential risks and challenges are not particularity addressed. It would be beneficial to see the potential roadblocks and ways to mitigate them, such as wrong time estimates, unexpected problems or similar. \r\n\r\nExpansion on the Metrics/KPI to measure the success would be beneficial, such as expected number of indexes and potential value locked. \r\n\r\nHowever, the progress can be audited based on milestones to be achieved (1-3-6-12) so no points will be deducted. ", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 12, "ne": 5, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The problem and solution presented are within the scope of the challenge. Index funds are popular financial instruments in the traditional financial market and have been popular on DeFi as well.\r\n\r\nIn the traditional market, index funds now represent between 20% and 30% of the entire US equity market, which represents over $10 trillion today. One of the index fund projects on Ethereum, Set Protocol, has ~$200 million in TVL today.\r\n\r\n\r\nThe deliverables/targets described in the timeline are in line with the challenge and indicate potential relevant impact, but there are no metrics and KPIs that allow a better quantification of impact, in relation to the use of index funds", "q0r": 4, "q1": "The proposer described extensive experience in finance and technical development (functional programming language/Haskell) and experience in the EUTxO model and in Plutus. The proposer has also been a SPO in the Cardano community for a few months.\r\n\r\nThe team has 4 fixed members (2 devs, a designer and a marketer). I recommend including more details about the qualifications of additional team members and if possible sources for data checking.\r\nThere is a reasonable plan, with a clear and objective timeline.\r\n\r\nA budget breakdown has been included according to the hourly load required to accomplish different activities and the combined hourly rate seems reasonable with the standards required for Haskell + front end devs developers.\r\n\r\nIt is important to say that from public information, there are still no reliable oracle models at Cardano and there are no clear indications when this will be available for dapps in general. Even the use of onchain feeds still allows price/attack manipulation. This is a risk that was not mentioned in the proposal.", "q1r": 4, "q2": "There is clarity in the description of the problem and the solution presented, the proposal is aligned with the challenge.\r\n\r\nThe roadmap includes objective milestones (within the period specified in the challenge) and deliverables that improve the audidability of the proposal.\r\n\r\nKPIs were not included. I recommend including KPIs so that the proposal can be more easily audited.", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 11, "ne": 6, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Safe investment into segments of DeFi ecosystem will be very important and provide a way for smaller investors to have larger market exposure.", "q0r": 5, "q1": "The team seems very experienced in the area of finance and enginering.", "q1r": 5, "q2": "Milestones, goals, deliverables all outlined in the proposal.", "q2r": 5, "assessor": "z_assessor_477", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "Index funds are a must have for passive investors. No index fund or even proposals for index fund existed before this one. This could be the first index fund on Cardano.", "q0r": 5, "q1": "Team is highly experienced. Glewellin has demonstrated his knowledge of the space on Discord. Developer team is no longer anonymous and background is very impressive. Success rate of this project is likely to be high.", "q1r": 5, "q2": "Roadmap has been published and updated. Glewellin is available for questions on progress in Discord. Some advice is increasing the usage of your Twitter for status updates instead of Discord.", "q2r": 5, "assessor": "z_assessor_508", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "Is anyone in crypto doing crypto indexes? This is literally definition of pushing the status quo forward. When delivered the impact on Cardano DeFi and reputation can be immense.", "q0r": 5, "q1": "The team remains mostly anonymous, but simply judging from the detail provided, Discord, Telegram, and Twitter where they engage in a lot of very technical discussions, and just talk about things that nobody else does, I believe it's a team of experts in the area.", "q1r": 5, "q2": "Good tracking information provided. Very detailed proposal.", "q2r": 5, "assessor": "z_assessor_573", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "Indices as financial instruments definitely bring another level to Cardano DeFi and will certainly attract new users. Proposer clearly articulates what kind of indices they will build and the benefits of these instruments.", "q0r": 5, "q1": "The proposer has large programming and financial experience and he speaks clearly with great knowledge and confidence as can be seen in the attached interview. The only concern is that he is the only stated member of the team. I would love to see more members  stated transparently.", "q1r": 4, "q2": "Measures of success, deliverables with a clear enough timeline are stated in the proposal. I would like to see some goals from the proposer e.g. 1000 wallets  investing in an index in the first month after launch.", "q2r": 5, "assessor": "z_assessor_65", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Maladex passive investment protocol offering a range of indexes from Cardano DeFi to fractional NFTs ownership funds.", "experience": "Experienced Haskell developers with years of experience in building advanced trading systems in top performing financial institutions."}