{"id": 369498, "author": "", "title": "Minswap DEX Security Audit", "url": "https://cardano.ideascale.com/a/dtd/369498-48088", "category": 26109, "amount": 75000, "description": "The security of Cardano DeFi smart contracts, which will hold billions of dollars, is unknown. Plutus eUTXO contract design is  untested", "f6_no_assessments": 9, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers need to make a clearer case for why $75k should be spent doing a security audit of their DEX contracts. How does this benefit the ecosystem as a whole? Why their DEX over others?", "q0r": 3, "q1": "They are using the funds to pay a third party with experience to conduct and audit, thus it is highly likely they will get the audit done at that price of the third party has given them a quote. ", "q1r": 5, "q2": "The proposal is pretty simple, pay for two audits, thus progress is easy to measure. What is success? Is is just a clear audit? Or is it related to volumes on the exchange? I would think they should have some goals on volumes which success can be ausidted against.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "It is crucial for a DEX platform to perform a security audit prior of becoming publicly operational in order to avoid undesired surprises later on. \r\nIt would assure confidence in the project and improve user influx over time. \r\nHowever, it seems like combining a proposal for a security audit with part of the requested funds intended to launch yield farming contracts should have been two separate proposals. \r\n", "q0r": 4, "q1": "This team has had a professional aproach in running their project. They have relevant experience in tech by previously working for big corporations in the sphere (Amazon, ...). \r\nRecently they have had some public testnet issues, which did not generate a desired outcome (things may break). \r\nI'd like to stress the fact that this is exactly why a testnet is a testnet and not a mainnet. \r\nThere is now a base to work from and fix these issues. \r\nA proposal that aims to perform a security audit following these events reassures the sincereness of the team. \r\n", "q1r": 4, "q2": "All elements to determine the quality of this proposal are present in detail except for a risk assessment in the case that the security audit would unveil some, which would have been desirable for a proposal that requests funding for a security audit. \r\nThere are some minor inconsistencies regarding the roadmap published on the website and the roadmap presented here. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 13, "ne": 6, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "I'm very glad to see this previously funded project moving forward with its next step. A rigorous technical audit of the platform's smart contracts is indeed very important to ensure user fund's security and increase customer trust in the platform.", "q0r": 5, "q1": "You've chosen to entrust the audit to FP Complete, which after a quick background check seems like a very experienced IT engineer company. Having worked for big names in the legacy tech industry like Adobe and Microsoft, as well as the Crypto industry with Hedera Hashgraph, extensive experience in Haskell and performing audits for non other than the Cardano Foundation and IOHK themselves!\r\n\r\nNo worries here we're in good hands!", "q1r": 5, "q2": "The Minswap team is one of the most transparent out there, with a clear and realistic roadmap (no false promises or rushed, overly optimistic deadlines), frequent updates on their development progress on twitter, full disclosure regarding the issues or roadblocks they face and how they intend to tackle them, so far so good!\r\n\r\nThe objective and deadline for this specific project are quite clear and I have no doubt they will keep the community posted and move forward diligently.", "q2r": 5, "assessor": "z_assessor_369", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The problem description and solution are within the scope of the challenge. One of the most important aspects of DeFi dapps is ensuring that the code developed is in accordance with the developers' intention and that it is predictable and secure, in order to avoid bugs and vulnerabilities that could compromise users' funds.\r\n\r\nAn audit is essential for smart contracts designed to handle user funds and the process has great potential to bring quality to the dapp, which is a requirement for dapp usefulness.\r\n\r\nRelevant goals were established within the 6-month period established in the challenge brief, which signals a positive impact, but metrics/KPIs that can measure the audit process were not included, which makes the impact assessment less objective.\r\n\r\nSmart contract audits result in reports indicating risks in the code and degree of severity of those risks, I believe some metrics/KPIs derived from the audit would be important and should be included. In addition, from the point that the idea is to guarantee the security of smart contracts for users, it would be interesting to measure bugs/vulnerabilities that may occur after the audit as indicators. This additional information would provide more assurance that there would be a commitment and an indication of positive impact.", "q0r": 4, "q1": "Considering that the purpose of the proposal is the audit of smart contracts, it makes sense to focus on the competence of the company responsible for the audit (FPComplete).\r\nThe Minswap team indicated a link to the company's website, where it is possible to confirm the team's experience with audits on Haskell and with blockchain. The team was also appointed by the Cardano Foundation to conduct an audit of Cardano's blockchain in 2018.\r\n\r\nThe information cited indicates ability to perform the audit.\r\n\r\nThe established budget does not provide details on exact rates and engineering hours involved due to an NDA agreement, but the established value seems to be in line with the values practiced in the crypto market in general.\r\n\r\nThere is a reasonable timeline with clear milestones.", "q1r": 5, "q2": "There is clarity in the relationship of the problem and solution to the challenge.\r\n\r\nA roadmap with clear goals and allowing for auditing development was described.\r\n\r\nNo metrics and KPIs that could quantify the audit results were described. I recommend the inclusion of these 2 items, as I mentioned earlier.", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This is the next logical step on the Minswap platform. Without a security audit, the platform won't last long when it's published. Making sure the Minswap is trustworthy would greatly benefit the userbase.", "q0r": 5, "q1": "Since Minswap already exists and it's already doing analysis on their platform I can only see positivity in this proposal. The team has proven that it can run a project in previous funding and they have the experience to back it up. I do find one red flag on this other spotless proposal, giving the solution in the proposal the team is asking for funding a rigorous security test but in the budget breakdown, they also ask for additional funding for yield farming. Is this to also test security or just additional funding for another field?", "q1r": 4, "q2": "All you need to know for an assessment is given and with a clear view. The roadmap and milestones are separate and give a precise vision of what the team plans to do. Although if I may point out one thing that I find missing and I see it missing in a lot of other proposals is risk management. How do you cope with aspects that fail down the road? Is there already a baseline establish to which the security audit can be compared with? ", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Audit doesn't contribute to the ecosystem building only helps to verify that developed solution is secure. Scale DeFi isn't the right category to fund auditors.", "q0r": 2, "q1": "I believe the team has experience as they already deployed on testnet. However, this outcome depends on auditor skills as to which we were provided no information.", "q1r": 4, "q2": "There isn't sufficient information provided about the auditing company - how many audits did they do already, what security background do they have, how familiar are they with Cardano and Plutus. ", "q2r": 3, "assessor": "z_assessor_477", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "Already funded in previous round. Asking for audit funds in challenge where project look for money to execute on innovative ideas is a bad trend. Asking for funds in 3 areas. Total close to $150k. Maximising the funds that can be obtained isn't healthy.", "q0r": 3, "q1": "They already did a lot of dev work, but recently they had some major struggles, I've got doubts they can deliver quality DEX. Their technical medium articles seems to be pure hype and repetition of what else is already saying. They insistently stick to be a copy of Uniswap, but it seems from the recent concurrency debacle (caused by Minswap) that Uniswap model won't work on Cardano. SundaeSwap, ErgoDex, and Meld cleary provided clear working models, but Minswap keeps insisting on the broken account-based model, just giving ETH maxis more fuel to gon on and spreading false information. They'd get some funds and hire an architect or someone more experienced to put their energy into more directed use.", "q1r": 3, "q2": "No information about auditing company record as auditing goes - what other projects in Cardano did they audit, do they even have security experts in the team, etc.\r\nNDA signed for the enginering rate?\r\nWhy is yield farming is part of audit proposal?", "q2r": 2, "assessor": "z_assessor_535", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "I'm worried it's yet another code review rather than a proper audit and for the rate of $1k per hour. I don't think it's the right way to go.", "q0r": 2, "q1": "The recent concurrency issue raised some doubts if they have really strong technical team, on the other hand they got to testnet. Hence, with the benefit of the doubt 4. I'm technical enough to see that Minswap runs a lot on the observation that many people in the community aren't technical enough to not know the difference, but the team clearly feels non-experienced. It's not a reason to dismiss them, but I've got to reflect that in star rating by taking at least one star off. What's worse, they admit openly to not have taken Plutus Pioneer course, which would be OK, if they'd be Haskell and Cardano OGs, but with testnet flop it clearly shows it's just pure arrogance.", "q1r": 4, "q2": "The description barely covers the actual deliverable work. Minswap on its own is good project, but this proposal misses critical parts and have important questions unanswered. Further, Minswap contributes to the unhealthy trend of community funding audits. Somehow ErgoDex didn't need to go that route? Maybe use the same model? I'm sure even blockchain experts from Ergo and Cardano would be happy to do the code review without the crazy price of $1k per hour.", "q2r": 2, "assessor": "z_assessor_573", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "Any action or activity that can bring much confidence and reliability on the Defi ecosystem in Cardano ecosystem should supported.\r\n\r\nSuch risk assessment audit will induce much reliance on the security of applications deployed on Cardano thereby increasing adoption by users and developers alike within and outside the community.", "q0r": 5, "q1": "The proposal has proven that the Security Risk Assessment Audit will be effectively executed.\r\n\r\n However, explaining the content and scope of the Audit will be added advantage.", "q1r": 5, "q2": "The Milestones and Success Goals are adequately affective for assessment of this proposal's Success.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}], "solution": "An expert 3rd party will rigorously test and verify the security of Minswap smart contracts before deployment to the mainnet.", "experience": "Minswap is led by a team of experienced engineers proficient in Haskell & Plutus. Our contracts are ready- public testnet launches in 1 week"}