{"id": 369894, "author": "", "title": "Tools for auto and home loans", "url": "https://cardano.ideascale.com/a/dtd/369894-48088", "category": 26109, "amount": 59000, "description": "Given the high variety in loan provisions throughout US states, how can we create standardized templates to work across jurisdictions?", "f6_no_assessments": 4, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"q0": "This is an interesting proposal to create templates for each state of the US from which smart contracts for home and auto loans could be created. The pressing question however is, is there a demand for home and auto loans on Cardano. As this is not even delivering that, but a stepping stone below. Why not trial in an individual state first and se if the product has demand, before building templates for 50 states? Would these be denominated in USD, or ADA (which could get very risky for borrowers if ADA increases significantly over the duration of the loan)? ", "q0r": 4, "q1": "The team has great domain experience, though it is less clear they have the programming experience to deliver that side. The have a detailed timeline with deliverables so they will likely be able to deliver on what they have proposed.", "q1r": 4, "q2": "The detailed timeline can be used as a set of milestones to audit progress. Perhaps more could be done on defining and measuring success. $59,000 seems like a lot of money to deliver a project who's success id defined by the delivery of a workshop, some tutorial and some templates. Would success not be measured by the templates being accepted as a standard by the community and actually used in some DApps which are producing home and auto loans?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "A proposal which is looking to test the extent of flexibility of smart contract and how these would cope in the ambit of loans for auto and homes. These smart contract are a good start even as a case study to understand how to tackle various financial transactions.", "q0r": 5, "q1": "The team has declared various experience in different areas, with a good mix of skills between team members. The process to developed such contracts has not started yet and therefore it is uncertain whether this can even be done or to which extent and variety of uses.", "q1r": 4, "q2": "The proposal has in built reporting and the results shall be published for the general public to see and learn from them.", "q2r": 5, "assessor": "z_assessor_281", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "The problem statement and solution are reasonable, but no data has been included to support the problem statement. This is a particular issue in the US loan market for homes and cars and Catalyst is a global community, so it would be important to add sources and data for more context.\r\n\r\nThere are no metrics or KPIs that clearly indicate the impact of the proposal on the challenge. Is there an expectation on how these templates can help grow the DeFi ecosystem at Cardano? If so, what is the demand for this type of service?\r\n\r\nI recommend that the team describe how this proposal will impact the metrics set out in the Challenge Brief.\r\n\r\n", "q0r": 2, "q1": "5 team members were cited for this proposal, but there is little information about them, there is mention of experience in the sectors of law, entrepreneurship, mortgage, car loans, these are areas related to the context of the proposal, but I recommend including more details and sources that can attest to these experiences and qualifications. It's not clear that the team has the experience to create the templates in Plutus, I recommend more details about that as well.\r\n\r\nA budget breakdown was presented and is associated with different stages of the project, but it is unclear how these resources will be used, there is no association of the budget by workload or by employees, which makes it difficult to assess the feasibility of the requested budget.\r\n\r\nThe budget mentions the allocation of 2,000 USD for website and YouTube channel, but there is no information on how or why a website will be created.\r\n\r\nThe budget also cites the allocation of 14,500USD for \"Project direction\", what does project direction involve?\r\n\r\nConsidering that the proposal is requesting almost 25% of the total budget for the challenge, it is important to be clearer.\r\n\r\nThe project implementation timeline is reasonable, but the deliverables described do not meet the challenge objective.", "q1r": 2, "q2": "Problem and solution presented make sense, but they are not aligned with the challenge. There are no indications of how the proposal will impact the metrics established in the Challenge Brief over the next 6 months.\r\n\r\nThere is an objective roadmap with defined milestones, but there are no metrics or KPIs showing a relationship with the challenge, allowing auditability and success evaluation of the proposal.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposal addresses the challenge by proposing the development of templates for use in DeFi apps for use in the US. While a more global approach to home and auto loan templating for smart contracts may prove to be a larger catalyst for DeFi scale-up, this is possible after the F6 funding period. The goals of the project would facilitate DeFi app development for use within the US home and auto loan markets, markets that are rife with unique quirks. ", "q0r": 5, "q1": "The team members listed in the proposal, and on the linked website, have the requisite experience in a focused subset of legal matters that will be needed to implement the proposal. The budget is clearly outlined and integrated with the timetable. While the proposal mentions the development of the templates during months 3-5 more details may be helpful for voters (what heuristics will you use to determine how you will triage states (by population, by similarity of case law) also what recurring queries might be put in place to alert the team of new legislation or case law that may place developed templates in need of updating in the future. Additionally, though the board of advisors appears to be well qualified to evaluate and provide oversight, added description of what they will be doing and at what level of engagement seems useful given that their compensation makes up nearly 25% of the total budget. ", "q1r": 4, "q2": "The plan has a roadmap of goals for months 1-5 with a budget assigned to each planned activity. Metrics that define success at each of these activity levels would add to the auditablity of the the proposal. The project clearly defines and describes the targeted problem. The contract templates proposed as a solution to this offer an understandable solution. ", "q2r": 4, "assessor": "z_assessor_524", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We will create contract templates in natural language and Plutus for multiple jurisdictions in support of DeFi Dapp developers.", "experience": "Business systems oriented on the problems of blockchain scalability, law,\n\nmortgage consultant, auto loan officer, educators, JD, Ph.D."}