{"id": 370254, "author": "", "title": "Decentralized Sous Sous Savings", "url": "https://cardano.ideascale.com/a/dtd/370254-48088", "category": 26109, "amount": 150000, "description": "Developing good savings habits when in an economically disadvantaged position is hard. The habit is hard to develop, but valuable to learn.", "f6_no_assessments": 6, "f6_rating": 1.7222222222222223, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal discusses what Sous Sous savings are. This could be a great idea to implement, however there is no detail on how this would actually be implemented in a smart contract. The key component that allows Sous Sous to work in the real world is the connection and trust between participants, so the first person does not run off with their handout and not later contribute. Governance processes around this need some serious work. As it currently stands it needs more work to move from and idea to a proposal. ", "q0r": 2, "q1": "This submission requires a detailed plan on what will be delivered and how. The proposer has experience with the concept in the real world, but has not listed any relevant experience that would enable it to be produced as a smart contract. $150,000 is asked for, however there is no breakdown on how this would be spent. The proposal should also include a list of deliverables with milestones. As it stands none of this exists thus confidence it would be delivered is very low.", "q1r": 1, "q2": "Please provide timelines and deliverables so that progress can be audited. Please also define some metrics for success, number of users, funds committed to the contract, and some goals for these so success can be measured. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 12, "ne": 6, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is very much in line with the ecosystem of cardano , but solution to the problem is not described in a comprehensive way. It's a very interesting idea but it doesn't detail what it would like to do.", "q0r": 2, "q1": "We don't know what previous experience he has and he didn't describe the job he would be going to and if he has a team.", "q1r": 1, "q2": "The information is scarce, there is no roadmap, the budget requested is very high and not justified.", "q2r": 1, "assessor": "z_assessor_361", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The problem presented is reasonable but the solution presented does not demonstrate how the concept of \"sou sou\" will be replicated in the blockchain.\r\n\r\nThe proposal is a draft and establishes a fragmented rationale of reasons and ideas for the use of \"sou sou\" in Cardano's blockchain.\r\n\r\nA plan/targets have not been established, so there is nothing to indicate the proposal's real impact.\r\n\r\nI recommend that the proposer explain the concept of \"sou sou\" more clearly(maybe provideing links to other articles), so that the community that is not aware of this savings model understands its context and usefulness.\r\n", "q0r": 1, "q1": "The proposer did not indicate relevant experience to implement the proposal. Developing a loan application requires developing smart contracts.\r\n\r\nThe proposal is a draft. I recommend that the proposer follow the Catalyst documentation for a new proposal.\r\n\r\nThe requested budget corresponds to 60% of the budget available for the challenge and there is no budge tbreakdown.\r\n\r\nI will not consider plan, timelines and metrics as the proposal is just a draft, so I will focus my assessment on what can be improved, which is the framework/incentive model for the proposal.\r\n\r\nI recommend that the proposer focus on financial incentives and how to create a reputation model so that the the concept can be feasible, since without a reputation model in practice, the dapp would be an easy target for scams.\r\n\r\nAnother point that was not considered by the proposer is that in the conventional \"sou sou\" some FIAT currency is used and this type of currency has relative stability during short periods of time (disregarding hyperinflationary places, where the purpose of \"sou sou\" is lost ). What type of currency would be used in this model? ADA? Any stable coin? Any cryptocurrency used that is not stable will result in exposure to volatility and would change the concepts by which \"sou sou\" has become a popular model, including volatility can make the interested public different from the conventional \"sou sou\" userbase.\r\n\r\nA participant who was drawn at a time of raising prices would be extremely benefited, while another participant who has been drawn at a time of declining prices would be greatly harmed, this puts into question the feasibility of the proposal and the use  case.\r\n\r\nI believe that the concept of \"sou sou\" came about due to the restricted financial conditions in places like Africa and Central America. Loan protocols like Aave or Liqwid are the natural evolution of this type of model, where there is no need to trust or maintain a small community of participants.\r\n\r\n\r\n", "q1r": 1, "q2": "The proposal is a draft. There are no elements to audit the proposal. I recommend that the proposer check the Catalyst documentation to prepare a new proposal and insert the required items (plan, roadmap, milestones, metrics, KPIs and details about the team)", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "This is a unique application in the DeFi space, attempting to bypass banks and digitize a Sou Sou savings mechanism where the pool rotates on who gets the pot. Leveraging stakepools might mean that a level up as well to the savings. ", "q0r": 4, "q1": "Sou Sou have an interesting and long tradition (https://www.essence.com/news/money-career/what-is-a-sou-sou-savings-club-facts/), through many forms in the African diaspora. They are traditionally done in small communities where everyone knows each other. This means there's a built-in level of trust to the system, since there's accountability should one \"hand\" not keep contributing so everyone gets their fair turn. Scaling this into a decentralized form where trust is unknown, however, raises some large questions of trust and vulnerability to scammers stealing money from others. This has been a documented problem with Sou Sou systems (https://www.washingtonpost.com/business/2020/08/14/fake-sou-sou-lure-blacks/) preying on the most vulnerable. Without mechanisms clearly planned out to account for these issues, the system doesn't scale well from a small community to a decentralized anonymous or pseudonymous system.", "q1r": 3, "q2": "Unfortunately no KPIs are outlined in the proposal, ie no benchmarks for success, timeline, or breakdown on how the 150k requested would be used to develop the project. It becomes near impossible then to audit such a project.", "q2r": 2, "assessor": "z_assessor_517", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "This is also a real-world need, but mostly among people who are middle-aged and have little use of information technology. The future of Blockchain develops, the salary payment is also through cryptocurrencies", "q0r": 3, "q1": "Need additional documents, implementation methods, plans, resources. No risk challenge", "q1r": 2, "q2": "The roadmap needs to be clearer as well as the goals at each stage need to be supplemented", "q2r": 2, "assessor": "z_assessor_610", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "There is no doubt that this idea will bring a kind of micro-lending/finance to the unbanked through such decentralised savings opportunity. \r\n\r\nHowever, the proposal is not well articulated and it has not started in clear terms, the modalities and/or plans on how to accomplish the set goals. \r\n\r\nConsidering, the amount of fund requested this proposal is not well conceptualised", "q0r": 2, "q1": "The proposer has not shown any level of experience in actually engaging/provided such services as proposed.\r\n\r\n In addition, there is no timeline or budgetary plans to allocate the funds requested.", "q1r": 1, "q2": "There is no metric or what success would look like. There is no stated means at all to what to expect if the proposal is funded. The proposal was really poorly prepared.", "q2r": 1, "assessor": "z_assessor_9", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Sou Sou - a traditional rotating savings by a group of individuals with one spend per cycle of the \"pot\" collected by one \"hand\".", "experience": "My mother helped grew her good savings habits (and community participation) with this system by participating in such a sou sou savings pool"}