{"id": 383998, "author": "mamazoe", "title": "RAEDA", "url": "https://cardano.ideascale.com/a/dtd/383998-48088", "category": 26256, "amount": 40000, "description": "MOBILITÉ - l'un des problèmes les plus anciens et les plus pressants pour un Africain moyen.", "funded": 1, "upvotes": 30096350, "downvotes": 23392600, "votes_result": 6703750, "votes_cast": 424, "f6_no_assessments": 9, "f6_rating": 1.7037037037037037, "videos": [], "media": [], "f6_assessments": [{"q0": "Je ne suis pas du tout d'accord pour dire que cette proposition relève efficacement le défi. L'idée est noble, et a un bon cas d'utilisation je crois. Mais clairement, l'idée n'appartient pas à cette catégorie, et serait plus adaptée au défi des dapps et des intégrations.\r\n\r\nSi, toutefois, cette idée correspond à ce défi, alors il aurait été bien que le proposant mentionne comment la solution adaPay sera intégrée à RAEDA. Je ne vois pas du tout ce lien dans la rédaction de cette proposition. Cela indique l'une ou l'autre des deux choses suivantes\r\n\r\n1) Le proposant n'a pas bien compris le fonctionnement de l'intégration Cardano/Coti.\r\n2) Le proposant a supposé que le lecteur peut déduire de la rédaction donnée qu'il y aura une sorte d'intégration avec AdaPay.\r\n\r\nDans l'un ou l'autre des cas, je pense que ce n'est pas un bon ajustement pour cette proposition. Pour moi, donc, je vais suggérer à l'auteur, d'avoir un regard sur d'autres défis et de mettre cette proposition dans le prochain tour là-bas. Je suis sûr que vous aurez beaucoup de succès et de grandes chances d'être financé à l'avenir. Bonne chance", "q0r": 1, "q1": "La proposition a donné une pièce jointe où ils ont élaboré sur l'équipe qui se compose d'une bonne part de personnes expérimentées.\r\n\r\n De plus, la section sur les mesures et les objectifs à long terme explique que l'équipe a une bonne vision de ce à quoi ressemblera le succès pour elle.\r\n\r\nSi je considère cette proposition seule, sans tenir compte du fait que ce n'est peut-être pas le bon endroit (cadre du défi) pour cette proposition, je trouve encore beaucoup de place pour l'amélioration. La mise en œuvre réussie de la proposition en elle-même nécessitera, à mon avis, d'autres partenariats, en particulier avec des dépendances externes, comme l'infrastructure Internet en Afrique. Je crois qu'il s'agit d'un jeu à long terme, et des projets tels que le rythme de promotion des jetons mobiles mondiaux et de la blockchain seraient un facteur important pour représenter le succès de cette proposition.\r\n\r\nJe pense que le proposant devrait également couvrir la définition du succès en ce qui concerne l'infrastructure en Afrique. Pour la communauté Cardano, il s'agit d'un domaine très important à connaître, car les personnes/communautés locales telles que le proposant ont une bonne connaissance et expérience en la matière.\r\n\r\nPar conséquent, à mon avis, le proposant devrait essayer de couvrir autant de dimensions que possible. Cela ne fera qu'augmenter la probabilité que votre proposition soit financée à l'avenir.\r\n\r\nEnfin, compte tenu de tous les points ci-dessus, je ne suis ni d'accord ni en désaccord avec le fait que cette proposition sera mise en œuvre avec succès (en considérant uniquement ce point et non le fait que cette proposition n'est pas adaptée à ce défi).", "q1r": 3, "q2": "La proposition mentionne qu'ils développent une sorte de système où les utilisateurs peuvent également accéder au service par le biais de paiements cryptographiques. Cependant, je n'ai pu trouver aucune information sur la feuille de route de développement/programmation/test de cette solution numérique.\r\n\r\nBien que la proposition donne un bon aperçu de la répartition du budget, si RAEDA doit être un produit numérique, je pense que quelqu'un doit également s'occuper du codage et de la mise en œuvre. Les jalons sont mentionnés mais la ventilation du budget ne mentionne pas les heures de travail des développeurs.\r\n\r\nEn tant que développeur senior moi-même, je pense que le succès de cette proposition dépend beaucoup de la qualité des développeurs qui mettront en œuvre cette solution. Cependant, les informations approfondies sur le plan de développement, la pile technologique qu'ils utilisent, le type de fonctionnalités/ensembles de caractéristiques sur lesquels ils travaillent, leurs plans pour l'évolutivité de leur solution, qui et comment l'AQ (assurance qualité) sera faite ? Il manque de tels détails de mise en œuvre qui sont très importants pour le succès de cette proposition et la communauté aimerait avoir une feuille de route claire à ce sujet.\r\n\r\nJe suggère au proposant de jeter un coup d'œil aux projets précédemment financés où tous ces détails ont été fournis. Cela vous permettra d'avoir une bonne compréhension de la façon dont vous pouvez fournir à la communauté une bonne confiance sur la possibilité d'un audit correct de la proposition et finalement la probabilité de succès de cette proposition.\r\n\r\nPar conséquent, je ne suis pas d'accord sur le fait qu'il y a suffisamment d'informations disponibles ici pour vérifier suffisamment l'avancement et le succès de cette proposition.", "q2r": 2, "assessor": "z_assessor_454", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "La proposition est certainement intrigante et pourrait faire des merveilles, en particulier sur un continent comme l'Afrique où la mobilité est un problème récurrent, comme l'auteur le mentionne dans son énoncé du problème. Cependant, je crois fermement que cette proposition ne rend pas la justice nécessaire au défi à relever. Le dossier de campagne mentionne le besoin d'un plug-in de paiement ADA, même si le proposant mentionne qu'il travaille sur une plateforme de paiement unique, il ne mentionne pas comment cette plateforme peut être étendue à d'autres plateformes. Je pense que cette proposition pourrait correspondre à d'autres défis tels que \"Dapps de construction de la nation\" ou \"Dapps et intégration\" car la proposition se concentre sur une application particulière qui pourrait ajouter de la valeur à la vie des gens et à l'écosystème plutôt que de fournir à la communauté un plug-in de paiement qui augmentera les transactions Cardano et l'adaptabilité en tant que moyen de paiement. Par conséquent, j'estime que, bien qu'il s'agisse d'une excellente proposition, elle n'a pas été soumise dans le cadre du bon défi. J'attribue donc un score de 2 sur 5 pour l'impact et la manière dont elle répond au défi.", "q0r": 2, "q1": "L'auteur de la proposition mentionne qu'il a déjà effectué une bonne partie du travail dans le sens de la proposition. Mais il n'y a pas de description du plan détaillé qu'il compte suivre pour réaliser l'idée proposée. La proposition soumise ne comprend pas non plus de description des membres de l'équipe et de leur expérience, si ce n'est la mention de leurs rôles. En outre, ayant demandé un budget global de 40 000 USD, soit environ 2/5e des 100 000 USD alloués, aucune ventilation du budget n'est disponible pour les lecteurs. Il n'y a pas de plan d'action ou de documentation sur les risques et inconvénients possibles et leur plan d'atténuation. Il n'y a aucune indication sur la manière dont le succès pourrait se présenter et sur la valeur ajoutée qu'il pourrait apporter à l'écosystème Cardano et à COTI en particulier. Dans l'ensemble, avec de nombreux détails manquants, la proposition semble très incomplète et place beaucoup de doutes dans l'esprit des lecteurs. Par conséquent, je ne suis pas d'accord qu'avec les informations disponibles, il est très difficile de supposer que cette proposition répondrait aux attentes de la campagne.", "q1r": 2, "q2": "Le proposant n'indique pas aux lecteurs quels sont les paramètres qui peuvent être utilisés pour faciliter l'audit. De plus, il n'y a pas de définition de la réussite par phase pour suivre l'évolution de la proposition dans le temps. Le proposant n'a fourni aucun indicateur clé de performance (KPI) qui corresponde aux KPI requis mentionnés dans le briefing de la campagne. En l'absence de jalons clairs et d'horizon temporel défini, il est très difficile de suivre la proposition et son succès. Après avoir parcouru la proposition, j'ai le sentiment que même en cas de mise en œuvre réussie de la proposition, il n'y a aucune preuve plausible pour dire que leur plate-forme de paiement peut être exploitée par d'autres commerçants et applications web pour les procédures de paiement. Il n'y a aucune mesure visible dans la proposition pour identifier le nombre d'utilisateurs qui utilisent cette méthode de paiement et sa fluidité. Un petit complément d'information concernant le taux de réussite du paiement, le coût de la qualité, l'évolutivité et l'expérience de l'utilisateur apporterait une plus grande valeur à la proposition dans son ensemble. Je suggère fortement au proposant de travailler sur un plan plus élucidé et de le soumettre à nouveau lors des prochains tours. Pour l'instant, la proposition n'est pas suffisante pour gagner la confiance et l'attention de la communauté et, par conséquent, je dois attribuer une note de 1 sur 5 pour la clarté et la vérifiabilité de la proposition.", "q2r": 1, "assessor": "z_assessor_751", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal completely misses the objectives of the campaign. The main problem of the campaign, that is how to build a plug-in to integrate ADA Pay seamlessly so small merchants are able to accept ADA payments is never addressed. Because of that metrics and roadmap are not aligned with the challenge goals.", "q0r": 1, "q1": "The proposal cannot be considered feasible because the goals are distorted. Even if they succeed with the presented idea, it will not be possible to state that the proposal was successfully implemented because they will not achieve the goals of the challenge.", "q1r": 1, "q2": "Because there is not a clear understanding of the targeted problem it is not possible to affirm the proposal has a good auditability. The KPIs defined completely miss the direction in which the project must go to fulfill the objectives of the challenge. The proposed solution does not address the problem posed so auditing is virtually meaningless.", "q2r": 1, "assessor": "z_assessor_341", "no_vca": 25, "ne": 2, "ng": 19, "nfo": 4, "vca_o": 1}, {"q0": "The proposal states a problem and provides a solution to fix this. Unfortunately the key metrics and goals of the proposal do not align with the outlined challenge settings. I would recommend to re-submit the proposal on the next fund in another category.", "q0r": 3, "q1": "There could be more informations provided about the team and also on the technical aspect of the idea. It is hard to tell how far the project already is and how much work has to be done. Also a breakdown of the budget as well as a risk-assessment would help to further assess the proposal.", "q1r": 2, "q2": "The proposal lays down the general idea but to properly assess the proposal much more informations are needed. A more structured roadmap or a clear budget breakdown would help. In overall the proposal is hard to assess", "q2r": 2, "assessor": "z_assessor_41", "no_vca": 19, "ne": 0, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "This proposal has not identified a problem within this challenge. My advice to the proposer is to find a challenge where this proposal fits better, in order to increase its chances of being funded.", "q0r": 1, "q1": "This proposal is not in the right challenge. Furthermore, it doesn't contain enough information to be implemented successfully. I suggest to the proposer read the the brief challenge or find a better challenge for this proposal.", "q1r": 1, "q2": "This proposal doesn't contain enough information such as a roadmap or metrics that can allow the tracking of its progress. ", "q2r": 1, "assessor": "z_assessor_439", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "Great project and idea. By providing mobility that is fair and easy to use to the people of Africa you solve a big problem. Now my concern is where is the link with the challenge. We look for ways to integrate the ADA Pay plug-in. You talk about developing a system where users can also access services through crypto payments. but as it stands now the funding requested for this proposal does not include this service. You also don't define that this crypto payment would go with ADA Pay. It's one impeccable proposal and the document attached gives all the necessary info but we are missing the link with the challenge. ", "q0r": 2, "q1": "Regarding feasibility, this proposal is very well written and gives the necessary amount of information needed. Looking at the team we get a full fletched team that is qualified for this proposal. They each have their own unique qualities that are explained short but clear. One thing that would've finished this is if you provided a link to the survey that you guys had taken before this. Everything else is well explained and provides evidence of the hard work that you guys already put into this proposal, but what I'm missing is the model to support these affordable rides and drivers offers.", "q1r": 4, "q2": "As stated in the previous rationale everything is provided in this proposal. The timetable is presented and I would normally say one month is not enough to provide a demo version but I assume they already started working on the prototype. risk management is present and nourishes my brain to the point that I see you guys are putting everything in this. One concern I have is the budget. I don't doubt that you guys need the amount but since it's asking for half the challenge funds I hope you guys know you're taking a risk on this. What I would suggest is if this doesn't get funded breakdown your project into several categories and submit proposals for each category. ", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 18, "ne": 3, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This proposal conceptually presents an interesting idea, however it does not demonstrate a strong alignment to the challenge objectives.  This is highlighted by the strong focus on the idea rather than detailing how it plans to address core challenge criteria such as testing the plug-in, measuring key metrics, etc…  Furthermore, the proposal has not detailed out core metrics of success even for its own concept. The business model is conceptual and only provides anecdotal evidence for why it is a needed idea.  \r\n\r\nIn order to turn this from a strong proposal in the future, the project team should aim to submit their idea to relevant challenges as well providing more details around roadmaps and how it realistically aims to become the 'Uber for Africa.' For example what is the detailed pricing strategy for the subscription model? Why use a subscription model as opposed to a Pay-as-you-go model? ", "q0r": 1, "q1": "The team appears to have a diverse background and existing involvement African blockchain community.  Both of these are great starting blocks.  A clear strength of this proposal is the ability to come up with an interesting concept for integrating Cardano into the real world. \r\n\r\nMy recommendation for a future proposal is to add more detail in the budget breakdown and roadmap section.  The requested funds for $40,000 makes up 40% of the total funds allocated for this challenge. Given that amount, I would expect an appropriate level of depth when addressing how this budget is going to be spent. \r\n\r\nFinally, I am struggling to understand the implementation path that lies ahead.  It is still an idea at heart and there is a strong disconnect of how the challenge objectives will be met through this project (as well as how the business model will be sustainable or successful). Using an existing business model would be a stronger proposal for COTI funds. Once again, providing some detail and structure around the next steps / roadmap for this project would give more color and evidence that the project will be successful long term. \r\n", "q1r": 1, "q2": "A key strength of this proposal is the tangible nature of the problem they are trying to solve. In order to improve the proposal even further, I suggest outlining important information such as a roadmap, estimate of key activities to be delivered and details on budget allocation. \r\n\r\nFurther, having alignment with the challenge metrics would increase the change of a successful proposal. For example, the challenge identifies success as testing the ability to integrate ADA plug-in solutions. Forming a view of a roadmap against this metric would have been a great opportunity of showcasing the linkage to the challenge in an auditable way.  ", "q2r": 1, "assessor": "z_assessor_586", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "I disagree that this proposal addresses the challenge because it doesn't mention  payment with ADA plug-in but just mentions \"cryptocurrency\" in general.", "q0r": 2, "q1": "There is just detailed plan, I don't see the team, timeline, budget breakdown, resources, etc. I strongly disagree this proposal will be implemented successfully.", "q1r": 1, "q2": "There is no key metrics to success or KPIs, roadmap or time horizon. This proposal does not provide me enough information to assess its progress.", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 17, "ne": 0, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "The problem statement of this proposal seems not to align with the challenge. The proposal is just about providing solution to making transportation in Africa conveniently and easily accessible by users and creating a Dapps for this purpose. So in my opinion, the proposal does not have effective impact on achieving the set goals of this challenge category.", "q0r": 2, "q1": "There is no detailed skill and experience profile of the team. In addition, there is no information to assess the reasonableness of the budget and it's breakdown plus no roadmapand/or milestone to verify the capacity of the team to achieve the successful implementation of the proposal.. There is a lot of work to be done to fine tune the proposal.", "q1r": 2, "q2": "There is no information on any form of metrics and/ KPIs to assess the proposal if eventually funded.", "q2r": 1, "assessor": "z_assessor_9", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "Raeda est un produit mobile numérique qui intègre un système simple permettant aux utilisateurs de s'abonner à des trajets abordables pendant une période donnée.", "experience": "Notre équipe est composée d'experts en stratégie de marque, de consultants en relations publiques, de développeurs, de spécialistes du marketing et de la gestion."}