{"id": 384837, "author": "matthiasksieber", "title": "Case Study: Yomi.ai & Ada Pay", "url": "https://cardano.ideascale.com/a/dtd/384837-48088", "category": 26256, "amount": 19600, "description": "Il n'existe pas d'incitations claires pour les propriétaires de petites entreprises établies à accepter l'ADA comme paiement.", "funded": 2, "upvotes": 151601115, "downvotes": 5656028, "votes_result": 145945087, "votes_cast": 1228, "f6_no_assessments": 6, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "Cette proposition est une excellente idée et démontre que l'équipe s'est efforcée d'identifier une solution pour relever le défi.  La solution proposée apporte une valeur ajoutée claire au développement du partenariat entre COTI et Cardano.  En outre, non seulement l'équipe a aligné ses mesures et objectifs clés sur les critères du défi, mais le problème qu'elle résout s'inscrit dans la vision plus large de Cardano, qui consiste à fournir des cas d'utilisation transactionnels réels pour ADA.   \r\n\r\nLe projet est également une expérience qui est évolutive dans la pratique. S'il est couronné de succès, les mêmes principes de conception peuvent être appliqués à une vaste gamme de cas d'utilisation à l'avenir.  Pour les propositions futures, afin de faire passer cette proposition de bonne à excellente, je suggère de fournir une certaine quantification des impacts et résultats potentiels de l'expérience. Par exemple, quels sont les critères de référence pour un résultat \"solide\" de cette expérience ?  Plutôt que de simplement décrire les paramètres à mesurer. Faire cette distinction permettrait d'avoir un argumentaire plus convaincant à l'avenir.", "q0r": 4, "q1": "Du point de vue de la faisabilité, il s'agit d'une excellente proposition.  L'un des points forts de cette proposition est la transparence qui entoure les antécédents et les compétences des auteurs de la proposition - l'équipe chargée de la proposition est composée d'un grand nombre de membres expérimentés. De plus, ils ont démontré leur capacité à comprendre et à construire au sein de cet écosystème grâce aux prix qu'ils ont obtenus lors du hackathon d'IOG.  En outre, certains des membres de l'équipe sont des membres réputés de la communauté Catalyst et y contribuent depuis longtemps, ce qui témoigne d'une bonne compréhension de l'ensemble du processus de financement et des attentes requises pour réussir.\r\n\r\nCela est illustré par la ventilation simple et claire du budget, des solutions technologiques qui seront utilisées et des attentes en matière de financement futur.  Le point fort de cette proposition est peut-être que l'expérience sera menée sur un modèle d'entreprise existant à flux de trésorerie positif.  Étant donné que l'entreprise est opérationnelle depuis plus de 20 ans, il est probable qu'elle a déjà expérimenté un large éventail de méthodes de paiement différentes (par exemple Stripe) et qu'elle a une bonne compréhension de ce qui est nécessaire pour que les clients passent de la monnaie fiduciaire traditionnelle aux solutions de paiement en crypto-monnaies.\r\n\r\nLa section \"risques\" de la proposition, qui mentionne qu'il n'y aura pas de risques ou de défis, a été signalée comme une source de préoccupation. Une bonne pratique consiste à dresser la liste des risques émergents (même s'il s'agit de risques faibles ou modérés) qui pourraient être présents (par exemple, des échantillons de faible taille, une faible traction sur les marchés, etc.\r\n", "q1r": 5, "q2": "L'un des points forts de cette proposition est la simplicité de la présentation des informations de base telles que la feuille de route, le temps estimé de réalisation des activités clés et les détails de l'allocation budgétaire. En outre, l'alignement sur les paramètres du défi [par exemple, le rapport entre le nombre total de tentatives de transaction et le nombre de transactions achevées] est clairement démontré.  La dernière chose qui manque dans les propositions est la reconnaissance (1) des défis futurs (post-expérience) et (2) les repères des mesures qui seront utilisées pour comparer les résultats. Une plus grande transparence à ce sujet permettra à la proposition (et à l'expérience) d'atteindre un autre niveau.\r\n", "q2r": 4, "assessor": "z_assessor_586", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem of no clear incentives for small businesses to adopting ADA payments. If successful this will drive adoption for Cardano and it should be able to scale accordingly. The metrics is aligned with the challenge as it focuses on online business payment options. ", "q0r": 5, "q1": "Relevant experience and team is presented. Budget is reasonable and broken down into identifiable items and shows that they know what is needed to build  this project. The launch date seems achievable. They describe what languages are used to build the frontend as well as the backend. Going into detail about the architecture and how payments are processed referencing API placement. They claim to not see any potential risks in implementing this. One risk I can see is that certain online businesses will have better results in this study than other online businesses. Will they stop at one study or target other businesses after this one. ", "q1r": 4, "q2": "They provided a roadmap with clear identifiable milestones and KPIs based on users and user input are easy to measure the performance of this project. The targeted problem is clearly described and their proposal in a whole is the solution needed to solve this problem. Concise and to the point.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 29, "ne": 2, "ng": 20, "nfo": 7, "vca_o": 1, "reply": "The impact and specially feasibility rationales don't seem to match the score given."}, {"q0": "I strongly agree that this proposal not only effectively addresses the challenge but also provides a different but important viewpoint for ada pay integration. \r\n\r\nAny solution, including AdaPay, has to have answer to basic question - \"What are the benefits for a business owner to move from fiat to Ada via AdaPay ?\".\r\n\r\nIn my opinion this proposal takes a very different approach where the emphasis is on the real use case than the number of ecommerce sites integrations happening. As there are other proposals in here which will cover those use cases, this proposal, if implemented successfully, will help both the  COTI/Cardano eco system  to have a real use case based case study, results of which then can be then propogated to future projects providing AdaPay plugins..", "q0r": 5, "q1": "This proposal has given good and detailed information on the experience of the team. Some of the names are well known already in Cardano community (Project catalyst) and the experience of developers are in sync with the tech stack team proposes for this solution. As a full stack developer myself I have no concerns in ability of the team presenting this proposal.\r\n\r\nAdditionally, plan is outlined in a very detailed fashion, Tech stack is given in details, which means team already is aware of what needs to be done on implementation side. Furthermore, the budget seems to be very well explained. Since team has good experience, we can see that budget although on a little bit higher side (20% of total challenge settings), the budget distribution and total is justified.\r\n\r\nIn my opinion, therefore the proposal is perfectly explained and well written, and i strongly agree that likelihood of this proposal being implemented successfully is quite high.", "q1r": 5, "q2": "The proposal has given a detailed roadmap of the execution plan, which means that community and voters have already a good feeling on when to expect what feature set.\r\n\r\nThis will allow community to keep the progress tracking and productive feedback loop among the community.\r\n\r\nThe detailed metrics and \"how success looks like?\" provides gives good confidence to the community as in to have upfront understanding of what can be expected as a result of successful implementation of this proposal.\r\n\r\nThese all points, therefore can be easily tracked by community to keep a track on proposal progress as time passes by. \r\n\r\nTherefore , I strongly agree that the information provided in this proposal is sufficient to audit the progress and success of the proposal.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 18, "ne": 8, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "A great way of integrating two challenges at once. Integrating ADA pay and helping the Japanese community to connect with the Cardano community. By providing an ADA payment method on a Japanese translating website you get both sides of the coin in this fund. This proposal does not speak to the masses of e-commerce but is rather a case study of how it impacts small businesses and this can surely scale up. ", "q0r": 5, "q1": "About the team members in this proposal, they are more than qualified to do this. This is clear because the team consists mostly of members within the community and they are all familiar with the Catalyst project. Also due to the way they give a clear explanation of what the problem is and how they plan on solving it. The roadmap is well explained and in detail. I have full confidence that this proposal will be implemented successfully.", "q1r": 5, "q2": "Since most members are well aware of what Project catalyst is there is no detail missing in terms of auditability. Not only is a roadmap provided but successes are also mentioned, which is a morale boost for the proposers when reached. This is something that is missing in a lot of proposals but in my opinion a key factor in success. Metrics that are offered give good measures on what to expect of the proposal.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "I like that the proposal is focused on a single integration, albeit with a very niche platform. If the work is open sourced it could provide useful research and templates for other integrations. However, the specific technical talking points in the COTI challenge are not discussed, and its difficult to know if yomi.ai has sufficient usership to produce meaningful research results or impact. ", "q0r": 4, "q1": "The team has wide technical experience and is established in Catalyst ecosystem. The have access to a working marketplace with which to integrate.", "q1r": 4, "q2": "The budget is broken down and some metrics of success are given. This is a combination of research and technical implementation. Assessing the success of the proposal should not be difficult. ", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This proposal starts with developing ADA Pay solution for Yomi.ai website, which is a Japanese subscription-based website. But this development is not the only objective, as the proposal is mainly about documenting the journey and evaluating the benefit for a small business owner to accept ADA as payment. \r\nI strongly agree that this project can be valuable to develop ADA as a payment for small businesses.\r\n", "q0r": 5, "q1": "Winwin team members are identified and experienced software developers and deeply engaged in Cardano's environment. This highly experienced team is probably the reason why the proposal states that no risk is identified with implementing this proposal (risk are pre-mitigated) : though I do not know any project without a single risk, so I would recommend the proposer to elaborate on risks and their mitigation.\r\nConsidering the highly experienced team, I agree that this proposal is likely to be implemented sucessfuly.\r\n", "q1r": 4, "q2": "Budget is well detailed, 2/3 of the total funding is dedicated to development, and 1/3 to marketing and documentation. Roadmap are is detailed, with a launch expected April 1st 2022.\r\nOne axis of the success is the fact that customers actually pay with ADA. But the main interest is the knowledge about whether small business would benefit from an ADA payment option, and the best way to achieve it. This objective is expected in May 2022 with the publication of findings.\r\nThe milestones provided are easy to be monitored by the community, and deliverables are expected short term. \r\nI agree that the community will be able to effectively monitor the progress of this proposal.\r\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1, "reply": "The CA doesn't explain why the proposal only partially addresses the challenge, and we are proposing a usage of DIDs, which is one of the 2 main goals of the challenge."}], "solution": "Une étude de cas qui illustre la migration d'une petite entreprise de l'acceptation de la monnaie fiduciaire vers ADA.", "experience": "Propriétaire d'une petite entreprise, équipe de Loxe Inc., groupe de développeurs Plutus expérimentés et vainqueurs de hackathon, et développeurs web expérimentés dans les startups."}