{"id": 414050, "author": "al.kc", "title": "Scale-up Africa’s Community Hubs", "url": "https://cardano.ideascale.com/a/dtd/414050-48088", "category": 26600, "amount": 19800, "description": "Community hubs in Africa are often seen as charitable causes as the value they deliver can be hard to quantify, and they may lack expertise in delivering focused commercial growth", "f6_no_assessments": 7, "f6_rating": 4.6190476190476195, "videos": [], "media": [], "f6_assessments": [{"id": 429, "q0": "This is a multifaceted approach on building community hubs in Africa. It involves education on an individual level the leaders of this community hubs. This is very important, for although we pride ourselves on being decentralized, in actuality the training, the materials that teaches on decentralization is still very limited. Hence this multifaceted approach is needed. A qualified leader that understands and is trained on the ethos of decentralization will breed a better DAO till the time comes where there is enough data on how to operate a self-sustaining community hub.\n\nAt this current development stage of hubs is more at a stage of being pragmatic meaning the main goal is to have one first. In future iteration, for these hubs to be truly effective, unfortunately needs qualified individuals. This is something that has not yet been identified by the Cardano community. There is a tendency to view an underperforming hub is not effective based on the founding of the hub itself. Where the issue might be that the individuals operating it is not qualified. I think this is what this proposal is trying to get at.\n\nFrom that it branches out to the main programs that have a direct effect on the development of Cardano in Africa. Those programs vary from target and intent such as a nation target program of becoming local channels for Catalyst supported products and capabilities. To individual target program such as having access to a wide range of educational material and training courses.\n\nTheir end goal simply put is to create a blueprint that incorporates that what is mentioned above and then some. This blueprint than can be exported and studied by other regions looking to develop their hubs.", "q0r": 5, "q1": "This is again, an intricate collaboration of vetted Cardano communities and entities, such as WADA and Cardashift and also a Edify Ecolabs, some form of think tank that addresses the needs of an organization so it can grow and scale in a sustainable mannerism. Claiming to have developed hundreds of organizations. Knowing WADA, knowing their reputation was and is very much highly regarded, partner with Edify to an extent validates their credibility as per their websites seeks to portray.\n\nWith having a strong partner that indeed is specialized in developing organizations, WADA and Cardashift has the potential to achieve the current holy grail of a community hub, which I believe is to become a self-sustaining entity.\n\nThe potential blueprints that come of this proposal would have far reaching effects for it then can be implemented by all hubs that Cardano has created. The game changer would be, by implementing these blueprints, all the existing Cardano hubs can potentially be self-sustaining, therefore freeing more funds for new endeavors. At this current stage, hubs are slowly taking an ever growing chunk of the Catalyst fund. This is not an effective use of funds and an effective sustainable model for the hubs.", "q1r": 5, "q2": "Unfortunately though, the structure of this proposal is quite confusing and time consuming. It is very hard to find the gist of the program. Program details I believe should be in put their attachments, while the proposal on IdeaScale should somewhat in spirit be something of a shark tank pitch. Of course, is should be structured as is what has been educated on by Catalyst School. The proposers should take this into mind, for Proposal Assessors are also a product of Catalyst School and have been trained in certain format that perhaps this proposers proposal is not conforming though. Therefore Proposal Assessors might miss or have little patience to go through all the details.\n\nTherefore making it quite difficult to determine mentally in bullet points ; what are the deliverables, when will they be delivered and how much is needed for to be delivered. If this proposal fails to receive the funding it needs I recommend to please re-tool it so it becomes more concise.\n\nWith that said though, the proposer has indeed provided sufficient concept explanations and metrics on why this proposal is needed and how to achieve the proposals intended target.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 15, "ne": 4, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 11531, "q0": "The proposal clearly states and describes how the Cardano Ecosystem could benefit from ACH expansion by accounting for both commercial and cultural value created by the community, as well as a potential risk in transferring the created content to local cultural norms.Furthermore, the project describes the impact on multiple levels, focusing on individuals through education and training materials, local communities through scaling solutions, international communities within the continent such as WADA, and the catalyst community as a whole through the establishment of a blueprint and MVP that captures the possibility of the program self-replicating and self-sustaining in the future. In line with the challenge's main goals, an ACH scale-up program would increase the likelihood of Cardano adoption on the continent.  ", "q0r": 5, "q1": "Based on the team's previous involvement in the F7 accelerator and F8 projects, the proposed projects are likely to succeed. Furthermore, the team members are identifiable on the Linked-in portal, and their backgrounds are related to the proposed problem solution, indicating a likelihood of carrying out the proposed work. I would suggest indicating which members will be in charge of communicating with African communities and how translation into different languages will be provided. The plan's breakdown is eloquently described in detail from both a temporal and spatial perspective using a miro roadmap and a detailed timeframe. The budget is described in sufficient detail and importance to the proposed work, and it is clearly stated how the budget will be split between collaborations - WADA.", "q1r": 5, "q2": "The process of auditing the project is described in sufficient detail by providing the key metrics that will be assessed by the dedicated project manager. The milestones and roadmap are detailed in the \"feasibility\" section. The provided miroboard specifies the delivery dates. The general risks are described, but I'm not sure if they are related to the milestone and roadmap completion. ", "q2r": 5, "assessor": "z_assessor_3256", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12384, "q0": "The goal of this proposal addresses a relevant issue by scaling up and transforming Cardano Hubs in Africa into a self-sustaining body of community, which fits with the challenge setting objective of growing Cardano’s outreach in Africa. This proposal provides a well laid out blueprint detailing the key goals of this project at several level (country, community hub, individual, and Catalyst), showing that the proposer knows what is needed to upgrade these community hubs as well as adding values to Cardano itself. Overall, I think this challenge addresses a relevant issue, fits the challenge brief, and the project can also be adapted for community hubs on other regions of the world. ", "q0r": 5, "q1": "The team working on this project have good track records with several previously funded Catalyst projects showing they have the needed experience and skills to deliver this project. The proposal provides a well thought out plan on how to implement the program. The 12 weeks roadmap is laid out well into specific milestones detailing all the necessary processes for this project and the attached timelines (via Miro) seems realistic to be completed in a timely manner. Additionally, the budget has been broken down into details going over the needed human resources, total workhours for each of the milestone, as well as the requested hourly rate. I’d have liked if the number of people involved in each sub-team is specified since the rate seems high if it’s only for one person.  ", "q1r": 5, "q2": "The KPIs chosen by the proposer was well detailed and relevant for evaluating the project’s performance in terms of the initial outreach and its success in reaching the set goals, such as the number of applicants/participants, number of engagement the hubs received after the program, etc. Additionally, the detailed roadmap can also facilitates evaluation of the project’s progress which will be updated on the proposer’s twitter (links provided) making the project easily trackable.  ", "q2r": 5, "assessor": "z_assessor_3408", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 15002, "q0": "The proposal meets the requirements of the challenge well, the problem situation raised is how the community centers in Africa are weak in the sense of not promoting such a significant change in the lives of the target audience. Not because they are poorly managed (although the elaboration of a well thought out MVP is very important), but also because of the way they are seen by the local society – as centers of charity, many times. With that, it is suggested here that a series of changes be made, for example the creation of models that value beyond the commercial vision of the centers, organizing the actions based on social impact and making all this use several Cardano technologies - this reaches well to what the challenge seeks, which is to benefit Africa at the same time, and also promote greater adoption of our blockchain on the continent. In addition, the project has a partnership with the WADA group, extremely consolidated in the Cardano community. That is, it will probably be a success.", "q0r": 5, "q1": "The script is great, we know what would happen with a good level of detail, in addition we are informed of the exact amount of hours expected for the development of each activity, this all allows us to have a very accurate understanding of what would happen and why how much time. In addition, a panel is available on the miroboard, where we can have a further view and that further help our understanding of this development process. The requested investment – approximately 20 thousand dollars – is relatively high, but it makes sense for the complexity of the proposal, and it is also well explained. Because we know what would happen and in how many hours, we know the hourly value of professionals' work. Speaking of them, the team is presented with extreme richness as we have long descriptions about each one, in addition to their linkedin profiles.", "q1r": 5, "q2": "Many metrics are said so that we can measure progress. We know that they will be publicized on twitter, but it would be important to know how often the various metrics, such as the numbers of “applications received onto Accelerator programme, successful applications, participants starting the programme” (etc) would be disseminated to the Cardano community. The ultimate success is defined well, as “a hub that can support the catalyst network by actively increasing its members and the capabilities of its members – acting as a hub for innovation and education”. But this part could be explored a little more, how will this scenario be measured, will it be palpable, verifiable for our community? So I think the auditability is good, although not perfect.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15086, "q0": "In the big scheme of things, I can see the impact this project can have on the Cardano and African community. The continuation and support of hubs development will inevitably result in attracting, even if in the short-term future, a small percentage of devoted and talented individuals, who will end up joining and interacting in a positive way with the Cardano ecosystem.\nDrafting a blueprint that will describe how hubs can become self-supporting and self-replicating will be an important piece of information to the ecosystem and especially to the young and energetic African community. The hubs will potentially lead to an increase in Project Catalyst participation and an expansion of cultural diversity throughout the entire ecosystem.\nI find the proposal well-fitting in the challenge of Grow Africa, Grow Cardano and to have a potentially positive impact on the Cardano ecosystem, I will thus rate it a 5.", "q0r": 5, "q1": "The implementation plan is described in detail, each task contains the number of hours necessary for the implementation and all tasks are grouped into 4 phases, starting with project management and ending with the refinement and post-programme management phase.\nThe budget of $19800 is well detailed, each task is provided and has a clear number of hours with a specified amount of dollars requested per hour of work correlated.\nThe team working on this project have provided ample description of their previous work and skills and has also provided Linkedin links to enable the community to verify their expertise. Their partnership with WADA will enable faster development, considering all the connections and hubs that WADA has already implemented.\nGiven the information provided, I find myself agreeing with the potential successful implementation of this project and I will rate it a 5/5.", "q1r": 5, "q2": "The KPIs provided for the progress tracking of the project are provided in detail.  The number of applications for the Accelerator Programme, the number of successful applications, the number of participants who started, as well as those who have completed the programme etc. Everything will be transparently provided to the community by the team’s project manager in their weekly project management online meetings and on their Twitter profile - link provided.\nThe success definition is, in contrast to the rest of the proposal, not so specific. There are no clear KPIs provided, and especially considering the metrics issued for the project progress measurement, I find that there could have been some specific ones compiled.\nRegardless of the lack in the success question, I find the rest of the auditability section to be well formulated and as such easy to audit, thus I will rate it a 4.", "q2r": 4, "assessor": "z_assessor_2192", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15098, "q0": "IMPACT\nBy creating more local hubs, with autonomous capabilities and clear models to become self sustained, the impact at the local level will be great.\nAlso as the approach of the proposal is to create templates, and if learnings are publicized many other regions in the world will be able to leverage that experience at local levels, multiplying its impact.\nSo I strongly agree that this proposal aligns with the Challenge objective.", "q0r": 5, "q1": "FEASIBILITY\nThe team is composed of well experienced people, active in Catalyst and with previous funded proposals. They are also working with WADA which provides enough trust for the project to be up to its promises.\nThe timeline is clear and very well detailed, with reachable milestones and also several risks where explained and mitigations provided.\nOn the budget, though it is clear and detailed, and all the requested money was assigned to roles and efforts, the value per hour is kind of high for the usual rates within Catalyst. The project is requesting up to $500 per hour for the Edify workshop delivery team, which I found too much.\nThis could be potentially mitigated with the statement \"this MVP programme will be built and delivered by the primary partners: EdifyColabs and WADA. On this basis, it is envisaged that once the programme support costs are paid, then the resulting funds allocated to programme design, engagement and delivery will be split on a 70/30 split with the wonderful WADA.\"\nSo based on that, I will agree that this project will deliver in its promises.\n", "q1r": 4, "q2": "AUDITABILITY\nClear KPIs were provided, with regular follow up by project management meetings and progress reports and socialization via twitter.\n\n-Number of applications received onto Accelerator programme\n- Number of successful applications\n- Number of participants starting the programme\n- Number of participants completing the programme\n- Number of Alumni from MVP engaged with new Cohort\n- Number of Tech, Busn, social dev's engaged with the hubs - following Community Hub Accelerator programme\n\nWith these outcomes being measured, the detailed timeline with milestones I strongly agree this project will be totally auditable by the community.", "q2r": 5, "assessor": "z_assessor_2398", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15104, "q0": "The proposers have taken an interesting social entrepreneurship approach to building up community hubs in Africa. The idea is to equip the participants with skills, knowledge and networks and coach them to create financially sustainable, impact maximizing organizations.\n\nThe proposal does “prepare Africa for a future of wide-scale Cardano adoption” and helps “grow adoption in 2022 and beyond”. Therefore, it’s a good match for this challenge. It is unclear, however, how many hubs will be included and what the actual scope will be.\n", "q0r": 4, "q1": "My first thought was: haven’t I seen this before? Yes, I have. The proposal explains it: “This is a continuation of the F7 Accelerator and un-funded F7 WADA accelerator”. The fact that the team proceeded with their WADA collaboration even without being funded shows their commitment and makes this a worthwhile proposal.\n\nThere are a few things that make me doubt a little. The first is that it mentions Cardashift (only once) and this shows it was originally meant for another challenge.\n\nThe second doubt is the fact that the proposal says “We are currently running this programme as a non funded MVP with WADA” yet the budget talks about funding an MVP. Let’s hope this doesn’t mean retroactive funding for work already done. Most likely not. The team probably had this feedback already and that’s why they are making a distinction between an ongoing “beta-level trial” and the actual MVP that is yet to be funded.\n\n“With WADA as our lead partners we will reframe this MVP to produce a viable MVP Community Hub scale-up programme that will then be run with selected Community Hubs on the continent.” That brings me to my third, and most important, point of critique. With all this time since Fund7, one would hope the plan would have evolved a bit more. Partly this similarity is explained in the enclosed Miro board (it was an honest mistake to leave some old bits linger). But at least those countries should have been selected already but there is no mention of the chosen community hubs in the plan.\n\nFinally, it is often mentioned in the proposal that the outcome is a blueprint (so did their previous proposals in earlier funds). It’s time to go past mere blueprints and create some real social impact action in the continent of Africa. Unfortunately, the proposal seems to repeat much of the old stuff. it even has a spelling mistake from the earlier proposals (‘watch on, do one, train one’). The enclosed Miro Board is a bit more updated. It states the phases of the road map: Whitepaper, Blueprint, MVP trial, Rollout, Scale.\n\nHaving said all this, it’s still a strong team, with a good amount of experience, great partners and the right attitude to pull this off.\n", "q1r": 3, "q2": "The team has listed a good set of metrics that they will be updating as they go, mainly utilizing their Twitter channel. They will be running a weekly project management meeting and attending regular Catalyst Coordinator meetings.\n\nThe proposers envision that the community hubs will be able to “scale down the need for support from Catalyst whilst also scaling up the ability to support their communities”. Ironically, it is also mentioned that the team itself will keep coming back for Catalyst funding “to continue with the rollout of the program”. Let’s hope Edify (E)CoLabs will also learn to become a self-sustaining social enterprise one day.", "q2r": 4, "assessor": "z_assessor_2156", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Impact scale-up programme empowering African community hubs to become self-sufficient social impact organisations: maximising their value creation and cultural and commercial impact", "experience": "Impact focused experts: we run high growth coaching & mentoring programmes from tech startups, through to Global businesses & Universities. We are funded proposers for 4 Africa CH related progs in Fund 7 & 8. We are currently running this programme as a non funded MVP with WADA "}