{"id": 414087, "author": "defi.babylon", "title": "JUS: Decentralized Onramp + Credit", "url": "https://cardano.ideascale.com/a/dtd/414087-48088", "category": 26600, "amount": 50000, "description": "In countries with high inflation, many are still economically marginalised, undocumented and unable to access banking systems- let alone Web 3.0", "f6_no_assessments": 19, "f6_rating": 3.596491228070175, "videos": [], "media": [], "f6_assessments": [{"id": 1595, "q0": "This proposal is extremely important for Africa, since this is one of the regions where the growth of cryptocurrencies is huge, however many people still feel the need to be tied to stable currencies, in addition to the difficulty that many users have to create an account. bank. The idea here is to create a peer-to-peer mobile wallet, called JUS, which works as follows: an Atala Prism ID structure is made, new users are verified and their biometrics are linked to a DID so that they can start doing exchange and integration transactions. They build, according to the proponents, a system of credit history and scores. It is important that the processes are done with an intermediary (bounty hunter) so that the transactions are complete when all the steps are followed, the fiat money is pegged to a stable currency and the transaction can proceed safely. This entire process is summarized by the proponents in the excerpt “in the scenario where the bounty hunter confirms that he has successfully received the fiat payment, the stablecoin is released to a VC minting smart contract that sends the new user’s biometric data to a service external third-party biometric authentication. It is also very relevant, as the proponents already have a well-defined target market, Sub-Saharan Africa, where the population (as far as it is understood) suffers from high fees charged on financial transactions, and in addition, unfortunately, it is a portion of the population that suffers with an economy that does not allow them to have security and quality of life financially speaking, that is, many people there experience economic problems. In this sense, it is essential that tools and solutions can be created and managed with the objective of filling these needs and truly benefiting your target audience. Undoubtedly, this project would also bring real benefits to Cardano, as it would promote the adoption of our technologies by a large portion of the population, which is marginalized in financial terms. It is difficult for people who do not have stability to bet on Ada, for example, so it is super valid and necessary that we think of ways to bring Cardano to them without this risky investment profile. On the contrary, proposing solutions to real difficulties they face, such as the issue of lack of access to bank accounts and the lack of infrastructure to convert crypto assets into fiat currency, as the proponents cite. That said, I believe this proposal perfectly meets the requirements of the challenge of developing projects that benefit both Africa and Cardano.", "q0r": 5, "q1": "The information provided in this topic is generally superficial. But let's go by parts. Starting with the development of the project, phases are not established. We don't have an organized timeline that allows us to understand when an activity ends and another begins, or which ones would happen in parallel. We are told what would need to be done and the total time for each activity itself, but we lack a better idea of ​​how this would be organized in relation to the months of the year, who would do each activity, what the work routine of the professionals involved would be like. In other words, we do know what would need to be done for the project to go from theory to practice, but the level of specificity is low, so I don't fear such a solid understanding of the whole. I would like to suggest that, first, the temporal division be done in a more chronological way, with the establishment of phases. Afterwards, each of these activities was better explained. For example, about providing the staking contract for the JUS token + Javascript SDK, how would it be done in process? What small actions would make up these activities, and how would the professionals involved deal with them? Talking now about the budget division, an amount of 50k dollars is requested, and during the financing detail we see that different parts cost different amounts, most of them above 50k, which confuses the reader. The values ​​are quite high, for example, 100k is requested for 10 weeks of work in relation to the development of the order book exchange contract + JavaScript SDK; what a result and 10k per week. How many hours would this professional dedicate to the project, so that we can understand if the requested amount is, in fact, fair? So, in general, I found the explanation of the budget a little lacking in detail, I believe that more information had to be passed on so that we can have an understanding of the asking price being, in fact, fair. Finally, speaking of the team, information about the members is not provided individually. All we know is what their names and roles are within the project, but more detail would be needed for us to have peace of mind about this team's ability to successfully execute the project. For example, Siddi Barrack: Co-founder. Besides being the co-founder of the project, what is his professional background? What jobs have they done previously? What is your experience with Cardano? Likewise, such information should have been provided to the other team members as well. I would like more to be said about each member, because the more knowledge we have about those involved, the more confidence is conveyed about how they will carry out the project successfully and peacefully. That said, the feasibility of the project is ok, but there is still a lot to be improved, both in terms of explaining the development of the project, as well as in the financial arguments and finally in the presentation of the team.", "q1r": 3, "q2": "Regarding auditability, there is a lot of information about how we could monitor the development of the project and also the success scenario. The information passed in relation to the follow-up of phases is quite scarce. It would be important for proponents to organize ways in which advances, however sensitive, would be perceived by the Cardano community. It is essential to first establish some direct communication channel with the community. It could be a youtube channel, discord and telegram channels, written monthly reports and etc. And in these channels, the proponents could inform us about what activities were developed that month, for example, what difficulties had to be overcome, and how they were mitigated, if all the professionals involved were properly committed to their tasks, if their work were respected, possible adaptations that had to be made and so on. In this way, we could follow not only the final result, but also what was behind it. Now talking about it, the success scenario, the proponents use a numerical indicator to state when success would be considered: 100k active users in the year. In fact, observing the number of people involved in the project is a safe and direct way to understand if it has reached its target audience, consequently taking Cardano's technologies to these people. But I believe that we need to go further in this study, in this research. We need to understand if, in fact, the problem that was initially addressed, at impact, was solved. Did people in Sub-Saharan Africa who had difficulty accessing bank accounts and loans get more assistance in this regard? How were these people supported, taught to use such technologies? How can we measure the direct benefits to your quality of life? Another important point, in my view, would be to understand if these people, who started to use this technology, became active members of the Cardano community, started to participate in other projects as well, as they are working within our blockchain. Both information on tracking progress needs to be made available, in relation to tasks and partial successes; as much as what it says about the success scenario. It is even possible to notice by the amount of text that is attached to the proposal (very little) how superficial the topic is, the ideal would be that some member of the team (the leader, probably) do this thorough and periodic work so that the community aware of all updates, even if the advances are sensitive. So, I believe that much should be reviewed and deepened on this topic of the proposal, so that it becomes more appropriate.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 12, "ne": 9, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1528, "q0": "The proposal adresses the topic of \npeople in the sub-saharan often being shut out of traditional banking and (micro-)finance and provides the concept of a cheap, affordable, trust-based, community owned way to give those people access. This is very much in the sense of Cardano and suits the challenge quite well. A big bonus is that the project is supposed to be community-owned by a big part, which even more matches Cardanos spirit of decentralization. The proposal seems by principle scalable. However, I am not sure how much good the combination of a lending platform with a trading platform would do to people, as this has the potential to make people amass debt from failed trades.", "q0r": 4, "q1": "The team has someone from Ardana onboarded, which gives \nthem some credibility. The project budget and the budget outline don't add up by one potency. Also, the project team demands a pretty high monthly rate for their developers (almost 700USD per month per dev.). Please consider this is not a VC business, but a fund. Tht technical explanation isn't very detailed and the exact team of DEVs not introduced. WHile some possible hurdles have been identified, no proper solution has been presented. The implementation plan is of sufficient detail, even a vesting plan is presented. Overall an okay proposal with some room for improvement.", "q1r": 3, "q2": "The auditability section could be more \ndetailed. While the problem and solution desription are both clear, the success tracking could be more concrete. The roadmap is there and sufficiently detailed and a relation to the SDGs affected is made. Some metrics are provided.\n", "q2r": 4, "assessor": "z_assessor_2257", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 11533, "q0": "By introducing a JUS marketplace where stablecoins with high availability can be purchased based on biometric authentication, the project aims to address one of Africa's most challenging issues - high levels of inflation - as well as phenomena such as high levels of powerty, unequality among countries, and a need for stable economic growth in African countries. Creating a marketplace with a biometric wallet could ensure safety, which is one of Cardano's core values. Furthermore, the development of this product coincides with the increasing use of mobile phones, while the African banking system remains underutilized by the general public. The creation of this product would bring more African users to Cardano, which is one of the campaign's primary objectives. Another goal of JUS is to provide education about cryptocurrency-related terms such as stablecoin and blochain, as well as to provide educational infrastructure, which is also a goal of Cardano's The Grow Africa setting. The scalability is not described in detail, but in the proposal, they refer to statistics recognizing exponential growth in P2P transactions in Sub-Saharan Africa, and I can extrapolate from this that the scalability is the project is successfully executed. This project has the potential to have a global impact by expanding the African blockchain marketplace, which is still in its early stages. ", "q0r": 5, "q1": "The success of this project is dependent on receiving funding from multiple sources in F9. Nonetheless, the team behind this project is made up of experts from a variety of fields, ranging from UX designers to Full Stack developers to analysts, and their previous work indicates a successfully executed financial product. The timeframe is described in detail and expanded upon in other F9 proposals. The budget is detailed, including sufficient details for the requested funds as well as how other proposals could potentially cofund the project.", "q1r": 5, "q2": "The auditability of JUS after lunch is described in detail; a good source of information will be the number of active users and community engagement; however, it would be preferable to provide more detail on how the community would hovever I couldn't find any information about how the community will be kept up to date on ongoing development updates, whether through social media or specific websites. The roadmap and milestones are described in sufficient detail, with advanced technical details provided in the related proposals in the DAO and Dapps sections. The exact delivery date is not specified, but it is most likely dependent on funding received from other proposals. The risks of the project are only mentioned but not explained, such as how the project will be conducted out if only a fraction of the funding is approved, or how the project will be delayed if the public release of the Atala PRISM is postponed. ", "q2r": 4, "assessor": "z_assessor_3256", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10771, "q0": "Investors always sympathize with and pay attention to projects with a solid base, and JUS is one of them. Indeed, I can imagine this convenient e-wallet with a bright and transparent manner of interacting with users, thanks to the detailed description of JUS in this proposal. And one thing that makes me appreciate your team's seriousness is that you've offered concrete evidence to support your claim. That is also why you have the ability to design such a comprehensive target market.\nYour presentation highlighting the current state of cryptocurrencies in Africa demonstrates the seriousness of your team. Understanding the flaws of peer-to-peer trading platforms and informal trading groups not only helps highlight the features of JUS but also demonstrates its efficacy and open future in the Cardano ecosystem.\nHowever, the explanation of the main risks is not as good as the two primary questions you answered completely and convincingly above. I hope you can add a few lines or provide additional details on how JUS will address these concerns.", "q0r": 5, "q1": "First, I'd like to compliment you on delivering a well-organized and concise budget. It's jam-packed with information on what to do, when to do it, and how much it'll cost. A good feasibility section, on the other hand, should not repeat the response to two different questions. And it appears that your team was unconcerned about this. As confirmation, I've seen the same budget statement in both the detailed plan and the detailed budget. Please go into further detail about how your team will carry out the suggested tasks, rather than simply listing them.\nAnother tiny suggestion for you is to attempt to be more verbose about your team members so that their abilities can boost your project's confidence level. Investors, I believe, will appreciate seeing more than simply their names and titles.", "q1r": 3, "q2": "In all honesty, I believe the public will understand your project's key metrics and KPIs as the bullet items you included in the Auditability section. You know what, though, your presentation is too monotonous and sketchy. You don't explain to people how they may follow the development of your project, and you don't even say what the noun phrases are used for. So that the JUS proposal can be more comprehensive, I suggest you expand this part with more words.", "q2r": 2, "assessor": "z_assessor_3193", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9284, "q0": "I feel that your solution is suitable for the challenge being solved. Because this project brings convenience, versatility, and saves both time and money for users. Decentralized Credit is a new asset management solution but with the strong growth of Cryptocurrencies, Decentralized credit is also expected to grow rapidly in the coming years. With the help of BlockChain as well as the increasing demand of users, Centralized Fee Financial Centers promise to bring many new solutions and features to the financial market. Some experts believe that, after a while, Decentralized credit will be able to operate in parallel with the traditional management system, creating a more complete, more open financial market and more opportunities. than. There will be a necessary compromise between these two forms of management for the entire financial system to operate smoothly and optimally. Therefore, your group's proposal is completely reasonable in accordance with the development globally in general and in Africa in particular. You also directly recognize the group's challenges and offer appropriate risk reduction solutions.", "q0r": 5, "q1": "\"After reviewing your team's proposal, I found it to be a very detailed plan with clear concrete numbers. The team calculated the estimated cost in great detail. The team members listed however need to have more complete information with the access link to show the more experienced, reliable project.\nI agree with the group's plan. The team divided the work plan into clear phases along with the actual amount to be implemented. Besides, it is necessary to have short-term and long-term plans to build more development step by step, to assess the risks that need to be solved. The group's proposal is good and feasible.\"", "q1r": 4, "q2": "\"I find that the information provided here is concise and easy to understand. But in terms of progress and development I think it should be more specific how it will develop in 3-6-9 months (short term goal). For example, in the first 3 months, how many people can be reached? Or how much % will the number of verified users increase? These numbers will illustrate how everyone can track progress and develop successfully to gain more confidence in the roadmap for this proposal. The team did not give a timeline to measure the progress of the project. This should be noted. Besides that, the team has clearly stated the goals. This is good.\nOverall, this is a good project, but there are still shortcomings that need to be overcome.\"", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7523, "q0": "The proposal links well with challenge settings in countries with high inflation, many of whom are still economically disadvantaged, undocumented, and unable to access banking systems - let alone Web 3.0 this is a problem to be solved in this project it fits the current challenge. The author has come up with a way to solve the problem is about their facial biometrics, phone number and mobile money payment method this is the solution or no one can fake those things. This solution can completely solve the current problem. The proposal links well with challenging settings in countries with high inflation, many of whom are still economically disadvantaged, undocumented, and unable to access banking systems - let alone Web 3.0 this is a problem to be solved in this project it fits the current challenge. The author has come up with a way to solve the problem of their facial biometrics, phone number and mobile money payment method this is the solution or no one can fake those things. This solution can completely solve the current problem. The main risks affecting the success of the proposal are lack of funding so the project owner cannot implement the marketing strategy which leads to the delay of the release date of Atala PRISM to the public.", "q0r": 5, "q1": "The author has provided a clear roadmap with detailed stages and milestones, a clear vision and targeted goals. MVP Development Plan ($500k)\n1. Order Swap Offer + JavaScript SDK (10 weeks ~ $100k)\n2. Offers a peer-to-peer lending contract (with included SDK functions on request) (10 weeks ~ $100k)\n3. Offer staking contract for JUS token + SDK 4. Javascript (10 weeks ~ $100k)\n5. Prepare for Audit (4 weeks ~ $40k)\n6. Mobile Wallet / UI Development (16 weeks ~ $160k)\n6. Number of Plays: 6\nWith the specific goals listed by the author, I think that if funded, the project will be successful.\nThe success of the project will open up a large and impactful business model for Cardano to help the community grow stronger. The author describes the success of the project as: 100k verified active users in year 1 and 1 million verified active users in year 2. All these successes are related directly to the challenge's campaign.\nJUS is an out-of-the-box peer-to-peer platform and an effective use case for the Cardano ecosystem. JUS is a peer-to-peer, decentralized marketplace and mobile wallet that allows users to facilitate secure crypto/fiat swaps and collateral-free stablecoin lending. Jus is built on top of Atala PRISM, JUS requires new users to verify and associate their biometrics with a DID which they can then use to initiate swap and referral requests in order to Earn and build on-chain history and credit scores in a privacy-based way. Dissemination of the Atala Prism DID across West Africa to create a fertile platform for the creation of verified, real human-associated DAOs.", "q1r": 5, "q2": "The proposed future implementation plan KPI is very detailed and complete. Performance metrics are complete and clear. Before launching for the market the project will: update development, audit, connect the community, active users.\nTashoma Vilini: UI/UX Designer, Atala PRISM Pioneer and Liqwid Co-Founder based in Senegal\nSiddi Barrack: Msc Distributed Network Engineer, Atala PRISM Pioneer, Full Stack Dev @ World Mobile based in Senegal\nIsaac Shapira: Platonic System - Highest Rated Plutus / Haskell Firm, Ardana\nThe team consists of four key members, whose experiences are well-suited to this challenge. Their identities are easily identified through pages linked from their social networks.\n1. Tasoma Vilini : Co-Founder/CEO, UI/UX Designer, Co-Founder @ Liqwid Finance\nhttps://www.linkedin.com/in/tashoma/\n2. Siddi Barrack : Co-Founder/CPO, Full Stack Dev @ World Mobile\nhttps://www.linkedin.com/in/sid-barrack/\n3. Isaac Shapira : CTO, Platonic System\nhttps://www.linkedin.com/in/isaacshapira/\n4. Jamie Lee George, CCO, researcher, analyst and operations manager\nThe funding required for this project is $50,000 less than 20% of the total challenge budget. The budget is divided into subsections which are explained and estimated for each item with reasonable expenditures. With the amounts listed for each item the roadmap and budget are sufficient to audit the progress of the proposal.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7283, "q0": "The proposal is suitable for the scope of the challenge, given that they have identified and identified people in less developed countries like sub-Shara African countries, it is very difficult for them to access banks, should offer JUS solution which is a mobile wallet, peer-to-peer, decentralized market, built on top of Atala PRISM, so it brings great value to the ADA ecosystem, just need a verified phone verify and link their biometrics to a tradable DID, which is a unique and user-friendly idea that makes transactions simpler, through trading in stable coins or fiat it will be more stable, compared to trading other cryptocurrencies with large price fluctuations, it makes trading safer from market fluctuations, so its future potential is very high. great. However, there are many mobile phone users in the world today, but the acceptance rate of cryptocurrencies is low, not widely available, the age of using cryptocurrencies is only about 20-35 years old. The level of education in underdeveloped countries is still low, access to technology is very difficult for them, so marketing will be very difficult, and stable coin also has risks, such as being spent. regulated by institutions that control, issue and supply, depend on fiat currency, so it is also affected by the global economy such as inflation… unfortunately in this proposal, we only focus on the good point and not yet see risk management measures.", "q0r": 4, "q1": "This proposal is more of an idea when the tangible plan is still vague, about how it implements and solves the problem. The proponent did not provide many details about his background or experience, I went to the website, twitter of the project, it did not show much, it seemed to be new. While a solution using Atala Prism may be ideal for the given situation, it is not well documented, concrete enough, to give voters confidence that it is feasible. The team is the people with the right experience and skills to be able to successfully carry out the project, which is easily known through the Linkedin that the team has provided. As for the budget, the proponent's request for Fund 9 is 50,000 USD, but the spending plan for the proposal is 500,000 USD, it is not clear here, the spending plan and resource allocation are not detailed, lacking base. For example “Offering an order swap + JavaScript SDK (10 weeks ~ $100k)” should be more detailed How many people does the swap offer, how much money it takes, how much time, and based on where to make it out that number. The javascript SDK is similar. The idea is good so I encourage the proponent to continue to develop this idea in the next funds.", "q1r": 3, "q2": "The solution is clearly analyzed and easy to understand how it can solve the presented challenge. The comparative figures and evidence were proposed and given specifically by the group, but did not provide links like Web pages for the proposed community to easily evaluate. The KPIs have been described and listed a number of parts that need to be measured, but it is not really detailed and the actual data of the KPI is not clear, so that it can be relied on to measure and monitor. The team did not specify any products or tools presented that the community can view and track metrics, I can hardly imagine what you guys do each month, and budget allocated to each participant each month. It would be better if the proposal provides details about the KPI and the results achieved for each month.", "q2r": 3, "assessor": "z_assessor_2886", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6794, "q0": "The number of unbanked persons across Africa is very much on the high side and inflation is increasingly eating up those regions. The proposer identify these bottleneck in these regions and intends to provide a solution for same. \nThe solution is in form of a peer to peer decentralized marketplace where users can make swaps and non collateralized stablecoin lending built on top of Atala prism.  My concern however is the language barrier in Africa and how to effectively reach the unbanked population, also making it strictly a stablecoin ecosystem seems less impactful for ADA in my opinion and also the regulatory aspect for countries like Nigeria who have a more reliable option like binance which provide similar p2p service and users can buy different assets, how do we get that market share with just a single token exchange.", "q0r": 4, "q1": "The timelines provided is well suited and it clearly mention all key deliverables to be expected. However, it is mentioned as part of the solution that there'll be non collateralized stablecoin lending and that is an exciting feature but how will that be implemented (I can just take out loan and never return if i have nothing holding me back? Remember we are targeting people who have been living for years \"unbanked\" who might already be used to the \"unbanked\" lifestyle and with a system like these, i might just come for the money and never return). ​\nThe requested budget amount is fair and reasonable. The team consist of notable cofounders of some major projects in the Cardano ecosystem like Tashoma Vilini for Liqwid finance, Siddi Barrack of World Mobile among others which gives me satisfactory feeling that the project is safe and likely to be implemented.", "q1r": 4, "q2": "The proposer provides me with sufficient and relevant metrics and KPIs to measure progress ad succes of the project. Timelines and milestones are clear and concise, there'll be periodic development updates, Audits etc. A successful implementation of these project will have atleast 100k users in year 1 and 1M users in year2. All these combined are decent metrics to audit the project. I'm however curious to know what marketing strategy team will employ to have these much users with the stated time period", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6290, "q0": "This proposal is about creating a 'peer-to-peer,' decentralized marketplace and wallet' to facilitate secured crypto/fiat swaps and non-collateralized lending. Furthermore, the platform will utilize the 'Atala Prism' DID solutions to authenticate the new users of the platform.\n \nThe proposer is eyeing the remittance market in Subsaharan Africa. Suppose the platform can solve the inherent problems in the field. In that case, it will provide value, provide the banking facilities to the unbanked, and onboard the untouched chunk of the population to the Cardano Ecosystem. If successful, this product will help in onboarding many African people who will utilize the platform for crypto/fiat swaps and lending services. This proposal is aligned with the Challenge as it focuses on serving people in Africa and will bring them to Cardano Ecosystem via this platform.\n \nThe proposer did mention the three risks he may face in the execution of the proposal: lack of funding, marketing & Atala Prism release delay. But I feel the main risk the proposer will face from the regulatory bodies as the platform involves fiat/crypto swaps and fiat lending. Unfortunately, the proposer did not provide his ideas on how he will circumvent or comply with the regulatory hurdles. This exclusion is one of the reasons why I rated it four stars. \n \nThe proposer is initially looking to provide solutions to the remittance market. Then, he wants to scale the platform to include Small and Medium Enterprises by providing them with lending services. ", "q0r": 4, "q1": "The team consists of three individuals who have worked or currently working on other projects in Cardano Space. The proposer is the co-founder of Liqwid protocol; two other members worked on Ardana and World Mobile. However, the proposer did not provide the team's LinkedIn profiles, but anybody can manually search on LinkedIn and find their qualification and experience details. Hence the team is capable of carrying out the proposal.\n \nThe proposer provided step-by-step details on how the platform will work after the launch and how he will utilize the Atala Prism, a third-party biometric authentication service, stablecoin, and mobile money services in Africa. This reflects the proposer is clear about how the platform will operate on swaps.\n \nBut the proposer did not mention the detailed plan of how he will provide the non-collateralized lending. The provided technical details of the plan on which the platform will be built are limited; only brief details are listed under the plan and timeline. \n \nThe proposer needs $500k to build the Minimum Viable Product. Since he does not need all the money now, he submitted the same proposal under three Challenges and asked for $350k in total. In this proposal, the proposer requested $50k; in DApps Challenge, he asked for $250k, and in 'DAOs<3 Cardano', he asked for $50k. This makes sense from the point that he does not need all the money here and does not want to take a big chunk of the Challenge allocated amount. But I was expecting more details on how this $50k will be used in the proposal. It seems more appropriate to mention specific information or at least provide the details of which stages of the development will be prioritized and allocated the total $350k.", "q1r": 4, "q2": "The proposer mentioned that to track the progress of the proposal; he will post the Development updates and keep the interested parties engaged on Social Media. However, the proposer did not mention on which platform he will post the updates like GitHub or Jira. \n \nAs mentioned above, the proposer did not provide more details on the technical development; only brief details are stated. Therefore, I think this will be a hurdle for the auditors or interested people to track the progress. \n \nRegarding the budget, as I mentioned above, more specific details are required being the proposer is not asking for the total required amount of $500k in this Fund 9. Instead, he asked for a fund of $350k in total in this Fund, $50k here, and the remaining $300k in two other challenges. The timeline and milestones are stated in detail. The total duration mentioned is 50 weeks, divided into five stages based on the tasks to be achieved in each stage. \n \nThe success metrics can be the number of African users who will be using this platform. The proposer anticipates 100k verified users in year 1 and 1 million verified users in year 2. The other success metric is the impact this platform will have upon successful launch and operations in Africa, which I think will be a great subject to the regulatory hurdles as I believe it will be there as this platform involves fiat.\n \nThe third success metric that can be applied here is the local partnership built by this platform. From the proposal, we know at least one partnership or service contract will be required from the third-party biometric authentication service. ", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4518, "q0": "[This proposal is a duplicate of the other proposal by the same team https://cardano.ideascale.com/c/idea/414100, I hence copy my assessment for the other proposal here] The proposal did a good job in highlighting the impactfulness of their solution. The problem (unbanking population lacking means to acquire and swap stable coins) is well defined, with strong supporting numbers. With the large market and high demand for crypto in African countries, this project, if implemented successfully, will significantly drive the adoption of Cardano system. I just have some reservations regarding the scalability of the project beyond the MVP stage as it was not presented in the proposal. If the team could elaborate further on what they think (on a high level) to scale the product across multiple African countries (for example, technical requirements, legal requirements, partnership requirements), it would be very helpful for me to assess the long-term impact of the project.\n", "q0r": 4, "q1": "While the proposer did very well on the impact criteria, I have yet to see the same caliber for feasibility criteria. First, the budget requested is inconsistent in different parts of the proposal: at the beginning, they requested $250,000, then at the MVP roadmap, it was $500k, and further down the proposal, it was $50,000. Lacking a well-presented roadmap adds to the confusion. The MVP development plan roadmap is very high-level for the large budget ($500,000) requested. I would recommend the team to spend more effort breaking the MVP into details such as system design, acceptance criteria, user stories, wireframe, mock, etc,. for the community members to assess the feasibility of the progress. I understand that this is a large scope project, at this initial stage, the team should probably ask for a smaller budget to build a whitepaper and prototype before asking for a big one without many supporting documents (there is a website but with no content). In addition, the risk section should be further considered. Currently, the risk section only has one sentence, which is overly simplified for a project of high budget and large scope. Some other risks you should consider are legal complexity (many African countries have unclear regulatory frameworks for crypto), dispute mechanism beyond community mediator (especially for a large amount of money), partnership challenges (mobile payment app partners, 3rd party KYC partners) and address those risks accordingly.\n", "q1r": 2, "q2": "[This proposal is a duplicate of the other proposal by the same team https://cardano.ideascale.com/c/idea/414100, I hence copy my assessment for the other proposal here] The project is not highly auditable, mostly because it is not clear which phase of the project this particular proposal is addressing. I again strongly recommend the proposer to elaborate the roadmap, add in milestones by months and by functions (technical development, product development, business development)\n", "q2r": 2, "assessor": "z_assessor_2558", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4334, "q0": "You put the problem of people in some countries having economic difficulties, not even being able to use basic financial services. Then you come up with a solution that is to create a peer-to-peer market - JUS - stablecoin - to avoid inflation and improve economic problems for the African community. I found that the team made a strong effort to identify the problem and come up with a solution to solve the problem. I appreciate your proposal, which directly addresses the economic goal - which most African countries are struggling with (target matched with challenge). I realize this is always a hot issue that needs to be resolved as quickly as possible to benefit the people of Africa, and at the same time, it has great value to be used in the Cardano ecosystem and scales the ecosystem in the future. Although you have identified the problem that needs to be solved, I think the problem is not easy to solve and if solved it will have a huge impact on the lives of the people of Africa. I wish there would be more such projects to apply not only in Africa but also in other continents all over the world.", "q0r": 5, "q1": "Your proposal now includes members' names and social media links (Linkedin), which increases the community's trust in the proposal. I'm pleased you did this. Affirming the community's belief in the team is very important. Surely you all know that one of the bases for the community to believe in the feasibility of the proposal is to clearly show its name, experience, and resources. materials and information pages on social networks. Therefore, I want you to complete as much information about the profile of the members as possible. What I find gratifying is that the members of the team all have the expertise and rich experience to implement the proposal. A good idea will come to life. You have presented a development plan with an allotted budget. What I would like to see is the planned completion time with an allocated budget for each period. I have a question, on what basis do you believe in asking for money for jobs such as Providing an order-book swap contract + JavaScript SDK, Providing a peer-lending contract, etc...? The purpose of implementing the team's proposal is welcome, it would be better if you elaborated on the technical and technological aspects of the proposal. This is equally important as it contributes to confirming the feasibility of the proposal. As for risks and challenges, the team stated the only risk was lack of funding. I would like to comment to further improve the suggestion that the funding may not be enough due to the slide in the price of the specific cryptocurrency here ADA. But I believe Catalyst will know and deal with this well so that all proposals no longer have to worry about ADA slippage in the market. If it has not been funded by Catalyst in Fund 9, will the team continue to implement the proposal? In addition, what other risks does the proposal entail? The team self-assessed whether the proposal could be brought to life immediately? Or wait for a response from the social community? Since I know a part of some people are elderly, they will face many difficulties when they have to use new technology, and their approach to new technology is not easy (steps to use a stablecoin, etc. ..). My suggestion is that the team can develop a very clear and convenient guide that everyone can follow easily, especially the elderly group. In short, the team's proposal is workable and I appreciate your efforts.", "q1r": 5, "q2": "I am satisfied with the implementation of the proposal, which shows that you are professional and good at expertise in the field that you are in charge of. However, about the implementation schedule, I would like to suggest that you should clearly describe the roadmap for each month of the year, doing so will increase the transparency of the proposal. Along with that, the description of the problem must be clear and easy to understand (you guys did a good job - of course, there are some technical elements, only the implementer or someone with technical knowledge, of blockchain can only understand). The performance evaluation index you set is associated with the implementation solution. It runs through the whole proposal. I endorse this. The macro KPI, which is the poverty line rate and the percentage of adults over 15 years old, is a fairly accurate measure of the team's performance. Regarding the KPI referring to the poverty line rate, the team chose the correct KPI, it is also related to the number 1 goal of the 17 sustainable development goals of the United Nations: Poverty eradication. However, I would like you to add key metrics to the proposal. All this adds to the transparency and auditability of the proposal. In summary, I appreciate the auditability of the proposal and hope the community will support the proposal to continue to thrive. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 3, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 4027, "q0": "This is a good idea and I would love to see it being implemented in the future but there's many points to be improved in the proposal. Firstly, the main idea described, of a decentralized exchange with biometric verification and alternative credit scoring does address the problem of the unbanked people in Africa because it is an alternative to overcome their operationally financial challenges. By that I mean that JUS could improve people's lives by offering services that are not currently attainable. However, for that solution to work some key points are being assumed that not necessarily are true. The system is dependent on the bounty hunters and if there's just a few of them they could risk the whole operation. Also, the system must be able to accept fiat payments which is not clear how it will be implemented and the team has not touched the possible problems of fiat currencies that are experiencing hyperinflation. Besides that, the only metrics provided are in the SDG section and they don't show a strong alignment with the challenge settings. Finally, the team could have provided the source of those statements made in the proposed solution section such as the one claiming that cryptocurrency transactions make up 7% of the total retail transaction value. Lastly, it is not explained why the use of non-collateralized stablecoins in the lending perspective (the recent LUNA issue makes us smell a rat).", "q0r": 3, "q1": "The proposer has showed adequate experience but has not backed it up with LinkedIn pages or any other means to verify their claims. It has stated 6 developers will be needed to implement the plan but has only provided information about 3 people that will participate. Also, the budget is not very well explained. They claim the whole project will cost 500k USD but only ask for 50k USD and do not describe how this initial resource will be spent. Moreover, each bullet point in the budget could be further broken down to enhance transparency. Additionally, the total amount seems a little exaggerated, the team could start by building a prototype and proving that it works with a lot less resources and then ask for funding to scale the solution. They have mixed the timetable with the budget and again, it could have been better explained. For example, they state 10 weeks are necessary to implement the peer-lending contract but don't describe which SDK functions will be created and in which order.", "q1r": 2, "q2": "The roadmap is provided within the budget and lacks clear milestones and transparent definitions of success at each stage of the project. The time horizon for each step seems vague as they don't fully describe what will be implemented. The only KPIs mentioned are the ones within the SDG section and they don't offer precise measures of success of the project. Besides, the team has not objectively said in the proposal how they intend to provide regular updates so the community can track their progress.", "q2r": 1, "assessor": "z_assessor_2513", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3854, "q0": "A great idea, it identifies many of the problems that need to be solved in this challenge, it covers almost all of the problems the challenge poses, it can expand rapidly and large to many other places, they can also solve problems that arise in the future, this is a very good proposition, it brings great development value to the Cardano ecosystem. I would like to see this project again in the next Foundation if this proposal is not Funded in this Fund. Inflation is spreading more and more all over the world, and the solution to solve these problems is always considered urgent, WEB3.0 is a good solution, especially for the undocumented, and unidentified. in the traditional banking system.\n\nThe impact of this project is quite large, the solution of this proposed idea is huge, and it identifies almost every problem to be solved in this challenge, in addition to the author's argument through a realistic description. reasonableness, clarity, and completeness. JUS is an independent peer-to-peer platform and an effective use case for the Cardano ecosystem because:\nit is not incarcerated.\nUsers are biometrically verified to prevent duplicate wallets and fraud.\nThe reputation generated from users' on-chain activity can be made available to Ceci incumbents to help expand their services into the untapped, unbanked market.\nAn on-chain reputation allows credit markets to flourish – allowing merchants to take on short-term debt – resulting in them having more liquidity to execute trades in larger volumes.\n\nThe project highlights some risks in implementation, which will help the community to manage the risks if Funded, in addition, the feasibility of the idea will be better if the author comes up with a solution. to overcome those risks when it occurs. \n", "q0r": 4, "q1": "The proposal to introduce unclear and detailed work implementation timelines compared with limited implementation resources will affect the project audit process. The proposal only estimates the project completion time and the goals achieved in general, the community needs a more detailed implementation plan corresponding to the implementation timeline, the author can refer to the Microsoft Project tool Management (or a similar tool) to support a more detailed and methodical schedule.\n\nThe proposed project budget is less than 20% of the total budget of this challenge, compared to the information the proposal provides, some project expenditures need to be clarified if it is to be funded. Budget requirements are usually summarized by the author. A detailed budget should list hourly wages for local workers, corresponding to the tasks of each employee in the project team. the project, and the community needs to know that, which helps in better transparency of the project. Compared to the information provided, it is a bit general and not yet a detailed budget.\n\nThe feasibility of this project is quite good when the human resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that it is completely suitable for the project. In addition, the members' identities are easily verified using the links listed above. The scheme is very clear, complete, and transparent. The author of this project is Tacoma Villani, along with his collaborators Siddi Barrack, Issac Shapira, and Jamie Lee George, show that this is a team with experience in working on this project, the identity is also easily verified. via an affiliate link. Reputable identity verification links like LinkedIn, ... for the community to easily verify identity\n", "q1r": 4, "q2": "This project provides KPIs for accomplishing project goals, but all goals are difficult to measure compared to the information the project provides.\n\nThe ideas of this project have clearly defined success, although they have not been tested in practice, it is still a good idea. A good suggestion and the author can fully run his tests with a smaller model to check for himself if the performance numbers are up and the project is funded.\n\nBrand new idea information on Cardano platform never received any funding from Cardano ecosystem.\n", "q2r": 3, "assessor": "z_assessor_2489", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3655, "q0": "This proposal basically consists of creating a platform for the purchase and sale of stablecoin through the user's cell phone, with the aim of integrating marginalized African people without access to banks. The proposal presents a viable solution to a problem that needs to be solved, in view of the development of Africa and the ecosystem of Cardano and other cryptocurrencies. In addition, the proposal has a high scalability potential even outside the African continent, and can also participate in future funds. One concern that I believe is pertinent is: how will proponents motivate people to become users of the platform? There is a risk that people will show resistance to embracing the platform and there are no ideas in the proposal to mitigate this risk. For this reason I give 4 stars in the Impact criterion, as this point can limit the impact of the project.", "q0r": 4, "q1": "This proposal is the initial part of the project. The entire project would have a budget of $500k and the part corresponding to this proposal would have a budget of $50k. However, when explaining the budget of the proposal, the proposers did so in the total value of the proposal. I believe this has somewhat undermined the clarity of the budget explanation and to resolve this, bidders could explain this part also thinking about how the $50k will be allocated if they get the funds. Proposers make it clear that the team is participating in other proposals and intends to participate in future funds to obtain the rest of the amounts necessary to put the proposal into practice. The team is able to develop the platform, being formed by a developer, UI/UX designer, engineer with experience in each area. In addition, bidders present the milestones and stages of the project with the corresponding deadlines. These deadlines appear to be reasonable for the work that needs to be done given the knowledge and experience of the team members. I believe it would be interesting for proponents to better explain how they will use the funds requested in this proposal so that the CA's understand better, for this reason I will give 4 stars in the feasibility criterion.", "q1r": 4, "q2": "The proposal explains in a simplified way the roadmap that the project will follow and the milestones it intends to reach with their respective dates. On this point, the proponents were reasonable in my opinion.\nProponents cited a few metrics to measure project progress and platform performance. I believe that it is possible to add other metrics to make the audit more complete, for example, using the milestones and expected deadlines and comparing them with what will be possible to accomplish over these periods of the construction of the platform. Thus, it is possible to understand if the proposal is following the scope as planned, if there are steps and deliveries in delay, etc. Another way to audit the progress and success of the proposal is to use platform reach and performance KPIs (when it is ready). For example: how many people are becoming users of the platform per month, how many people refer the platform to friends, how many transactions are taking place per month, what amount is being moved per month, etc. In addition, I think it would be prudent for the proponents and the community for the team to think better about how to mitigate the risks and challenges inherent in the proposal. As a CA and project manager by profession, I have no doubt that by better understanding the risks and ways to manage them, the team is increasing the safety and chances of project success. However, the proposal cites only a few risks and challenges and does not show ways to mitigate them. For these reasons, I will give it 3 stars on the auditability criterion.", "q2r": 3, "assessor": "z_assessor_2466", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2747, "q0": "By providing an application that is a mobile wallet for copying users to swap cryptocurrencies for fiat, and lend without collateral, this proposal fulfills the requirements of the challenge by providing a service financial services, I understand the purpose of the proposal why choose this challenge for this proposal, because in Africa the credit system is not yet fully developed, and these are thorough calculations for the vision of proposed, and the potential for credit growth in Africa will be a delicious piece of cake for those who know how to grasp it.\n\nthe way this proposal works is ; first need to verify facial biometrics, phone number and mobile money payment method of this app user, assist how to integrate the app into their mobile devices, then help they pay on the user's mobile application, by the peer-to-peer support of the JUS engine. will generally support them with mobile wallet payments. there are many other features that the application of the commitment proposal brings to the community,\nIn addition, examples are specifically explained, as well as statements of large-scale financial statistics, there is a link to the statement. The arguments for comparisons with and without the application are very reasonable, suggesting that people in the financially underdeveloped region of Africa need to use the features that the proposed application provides. level brings.\n\nsorry for the proposed team when the risks have been seen but no measures have been taken to reduce that risk, but it is a problem of capital to operate, so if it is funded, it is absolutely not. However, there are many potential risks in finance, so issues like the crash of the stablecoin LUNA, show how precious complete decentralization is. , so the proposed team needs to reconsider the risks that may occur in the future,", "q0r": 4, "q1": "This is the recommended group! We really need your explanation for how you broke down the 3 proposals to apply for funding in this round, so how are these 3 proposals related or complementary, much needed a part an explanation of why split, and how they are technically related, e.g. one proposal develops another proposal, like links, give If we see those in this summary of the proposal, then perhaps the proposal would be more perfect.\nIn addition, the group has provided timelines for activities established in weeks for each specific goal.\n\nThe team to develop this proposal is provided by the team of 4 people, and specifically the team has assigned to each person, although the personal information of each person is not very complete, but that can add after being funded no problem.", "q1r": 4, "q2": "the main work to develop this project involves a lot of engineering so, without the support of the proposal team, of course tracking and measuring progress will be very difficult, a good idea can sometimes be difficult. Funding is unlikely to be received if audit and monitoring issues are difficult to identify, so the proposal team needs to know the importance of transparency in project implementation, so the proposed team should consider the provision of measurement indicators, in addition to a commitment to support the community in monitoring by weekly or monthly reporting depending on the amount of work completed, ensuring transparency and widespread publicity. Winning the trust of voters will give you votes if you satisfy the above points.\nmilestones to define the proposed success by year. and the number of app users increased by 100% over the 2 year committed period,", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 12, "ne": 2, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 2383, "q0": "In fact, the proposal in question fits the goals of the challenge, since its main objective is to use blockchain-related technologies to solve economic problems intrinsically related to countries with a low degree of financial development, as in several African nations. In addition, an eventual success of the project would undoubtedly bring greater freedom and economic inclusion to local citizens. However, we realize that the project's goal is quite ambitious, given the scope it wants to achieve, and perhaps not enough detail was given in the proposal to convince us that the intended impact will actually materialize. Additionally, the amount being requested at the beginning of the proposal is $50,000; but later on we realize that an expenditure of an amount of $500,000 is being planned. One of the factors that raises doubts about the possible success of the project would be, as mentioned earlier, exactly the breadth of its action. At various times, the size of the market to be reached was mentioned, as well as what problems would be solved with this new way of carrying out transactions that the JUS aims to provide; however, there seems to be a little more clarity on how people will be convinced to adopt this new concept. We have the initial impression that the steps being taken are, for the current moment, very large, which raises doubts as to whether the strategy being adopted is the most appropriate. Additionally, it would also be interesting if more factors had been mentioned about the possible risks to deliver the project, given the intrinsic difficulty of such a comprehensive plan.", "q0r": 2, "q1": "Regarding the project's intentions, we realized that the objective is to reach a large number of users, as well as change an African economic paradigm, where many people are on the fringes of the financial system. However, the budget that you want to allocate to the project covers the totality of funds for the challenge, which is a big problem, as its possible funding would take away the opportunity of other possible projects, and given the objectives of the challenge, a central idea is that several proposals are successful on the continent. A positive point that we can mention in relation to feasibility is that the professionals involved demonstrate strong technical requirements that are important to execute the proposal, and we also noticed the presence of their resumes, but it would be nice if the addresses of the mentioned companies in which these professionals work were also provided in the proposal. A very important point, which could be better detailed in the feasibility plan, is the possible marketing strategies to promote the product, as barriers are likely to be encountered in adopting this new way of carrying out transactions and allocating funds. In the budget allocation, we could not find a clear explanation of how the marketing will be carried out, and given that initially the plan is to develop an MVP, once again it seems that the amount being earmarked for this is too large ($500,000).", "q1r": 2, "q2": "Once again, taking into account the size of the project in question and the number of users it aims to reach, it would be interesting to demonstrate more ways to follow the project's progress. One of the ways described was the update on the development, but it would be nice if more details about this had been mentioned, for example, which features would have higher priority to be implemented in this initial plan, which platform would be chosen to demonstrate this development (something like github or gitlab). It would also be interesting if a possible follow-up of professionals acquainted with the Cardano ecosystem were indicated to provide a technical opinion on the progress of the project. Regarding the metrics chosen to measure the success of the project, it seems interesting that other ways were also mentioned to better understand the adoption around the project, in addition to the number of active users. One possibility would also be to establish a desired volume of transactions in the first year of the project.", "q2r": 2, "assessor": "z_assessor_2306", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2052, "q0": "This proposal aligns well with the goals of the challenge as it addresses the issues that make the African community aware of the growth potential of cryptocurrencies. In countries with high inflation, many people, mainly women, are economically disadvantaged, undocumented, and unable to access their banking system, the author says. The solution to this problem is that JUS makes it easy for anyone to buy stablecoins. JUS is a peer-to-peer, decentralized marketplace and mobile wallet that allows users to facilitate secure crypto/fiat swaps and collateral-free stablecoin lending, users only need biometrics of their face, phone number, and mobile money payment method. JUS is divided into 2 rounds with clear goals. Round 1 targets the $45 billion remittance market in sub-Saharan Africa with “Send” and “Swap” features and round 2 targets the $360 billion gap in SME lending in Africa with the “ Borrow” and “Lending pool” feature. I think this is a great idea and fits well with the Africa development challenge, it will certainly be a platform that will benefit the entire African community as well as help more people in Africa participate. Cardano family.\nIn my opinion, this is a great proposal, but regarding the challenges and risks that may be encountered during the implementation of the project, I am a bit disappointed. The risk is referred to as \"Lack of funding, marketing strategy execution, and delay of the Atala PRISM public release date.\" I understand that for an ambitious project like this the cost is not small, as suggested then the MVP Development Plan is $500,000, but the proposal only requires $50,000, so how will the missing cost be compensated? Or if the stated cost is not enough, will this project continue to be implemented? And luckily in the comments section, the author clearly stated why asking for $50,000 for this proposal because there are two other proposals in Fund 9 to raise $350,000 of the estimated $500,000 received a request for MVP. The remainder will be raised in Fund 10.", "q0r": 4, "q1": "In my opinion, it is a bit difficult to assess the feasibility of this proposal. Because as mentioned above, the author has a total of 3 suggestions for this challenge. The roadmap and budget explanations are repeated twice by the author (and they seem to be used for the other 2 proposals as well).\n-Offer an order swap + JavaScript SDK (10 weeks ~ $100k)\n-Offers a peer-to-peer lending contract (with SDK functions included on request) (10 weeks ~ $100k)\n-Offer staking contract for JUS token + Javascript SDK (10 weeks ~ $100k)\n-Prepare for audit (4 weeks ~ $40k)\n-Mobile UI/UI Development (16 weeks ~ $160k)\n-Number of playbacks: 6\nBased on the above information, we know the budget associated with the activities that the team will perform, however, it is difficult to assess the roadmap and budget based on what is provided. The problem here is that this proposal requires a budget of $50,000, but the explanation is the budget and roadmap for all 3 proposals. Therefore, to assess the feasibility, I think we need to understand all three proposals. Therefore, in my opinion, this proposal is difficult to assess whether the roadmap and budget are reasonable or not. Although proponents provide several activities they need to do along with a timeframe for completion, and an overall budget for those activities. However, we could not envision during that period, what sub-activities would take place, and who would perform them, nor understand whether the required budget for each such activity would be appropriate suitable or not? In my opinion, the author needs to separate the proposals from each other. In each proposal, the author should present more details about the use of the budget, as well as the development roadmap of that proposal.\nFinally, about the team, I think this part also needs to be added. We know that the project consists of 4 members, we are provided with their names, and current occupations, as well as LinkedIn, links to some of the members. However, that is not enough to judge whether they are capable of carrying out this project, even if they have attached their link profile, the information about each person involved is still very superficial in themselves offer! I think it would be better to suggest updating their information like what is their role in this project, and their connection to the Cardano ecosystem", "q1r": 3, "q2": "The project's success is referred to as \"100k verified active users in year 1; 1 million verified active users in 2\" year overall success are very well defined, and it would be great if this proposal will achieve those. However, it is difficult for us to track the progress of the project based on what the author provides. Because we don't have a specific roadmap, we don't know exactly what to expect from the development process for this project. There are no small goals set, so I can't determine how we will audit this project about the development process. The measurement methods mentioned by the author are:\n\"Development Update\nAudit\nCommunity Connection\nActive User\"\"\nThe progress indicators are very short and do not provide enough points for the community to gauge the progress of the project. In my opinion, the proponent and his team should prepare reports, at least monthly, with updates on the project, these documents will be analyzed during meetings with the coordinator IOG and also shared simply and directly with the community. Unfortunately, again we have practically no information. In my sincere opinion, the proposal will need to be completely revamped.", "q2r": 2, "assessor": "z_assessor_2299", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12035, "q0": "This project is very helpful in helping locals buy stablecoins, which provides convenience as well as being available all day in a place where even banking is disrupted. This is a project that is suitable for F9: Grow Africa, Grow Cardano because it is located in the targeted geography. The face-based authentication method also facilitates those who are underage to join the coin community. This product also helps to transfer money with less cost, but I would like the authors to add to their proposed solutions to limit fraud during money transactions on the JUS system. ", "q0r": 5, "q1": "Although the project problem is very good, the content of the feasibility makes me wonder. The recommended amount is $50,000 but the proposed estimate is $500,000. So with $50,000, the project is not enough for completing one item. The authors explain in the comments that this is part of the three projects proposed in F9, but cannot confirm that the other two are funded. That leads to the risk that if this project is funded and the other 2 projects are not, all goals will be broken.", "q1r": 3, "q2": "The team cares about setting goals and KPIs but is vague. They should clearly plan for the proposal instead of being vague when targeting multiple projects. I would like them to develop a performance objective at each stage of this proposal. In that way, we can see if the goal has been achieved and at the right time", "q2r": 3, "assessor": "z_assessor_3329", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 13341, "q0": "JUS, your proposal is quite similar to the MobileMoney service in my country, but in my country, it is not possible to buy stablecoins via mobile money, actually, a service similar to MobileMoney will have a lot of value in In less developed places, there is not much infrastructure for internet, financial and banking services, in remote areas.\nTherefore, this proposal will be a great solution for Africans to have easier access to Blockchain and cryptocurrencies, helping Cardano to exploit the potential in this billion-dollar market, the proposal is suitable for testing. challenge posed.\nYour participation in the program requires KYC with face, and phone number and each person has an ID to help avoid inflation and fight money laundering because the proof of money transfer is stored on the blockchain and cannot be edited. Okay.\nMy suggestion is that in addition to using Smartphones for transactions, can you build a mobile payment platform with basic phones, because not everyone can afford to use smartphones in other countries? poor country and high inflation.\nSecond, the transaction fee of 0.5% per transaction is quite high, although this fee is used to generate revenue for JUS DAO token holders and maintain the system, you can adjust Is this transaction fee more appropriate and also to attract users in Africa, because there are also many exchanges with much lower transaction fees, so it will be your competitor in the future.", "q0r": 5, "q1": "Your team's action plan is 50 weeks ~ 1 year, and it seems like a big plan, but such planning is not detailed and needs to go into each smaller task.\nNext to the detailed budget analysis, it seems to me that the budget is too large while the budget you split is not reasonable because there is no clarity here for each item.\nIt is also very difficult for the community to track and check your project, can you rebalance the project budget with more clarity.\n- Furthermore, your proposal requesting $500k will be equal to the total budget for this whole challenge (Africa Development, Cardano Development), if your proposal is approved all other proposals will not be approved due to insufficient funds, and if many other proposals are approved, your proposal will not be approved because of insufficient funds for your project.\n- So the detailed plan for the project and the appropriate budget allocation, you should reconsider.", "q1r": 3, "q2": "Let me guess, your project presentation seems sketchy and untidy.\nParts such as development updates, audits, community connections, active users, how will the community check, and where?\nAccording to you, the success of your project is:\n  - 100K verified active users in year 1.\n  - 1 million active users got KYC in the 2nd year.\nSo how do you get these numbers? and the community will check where you don't see you, so you should create a file or a chart and then publish it to a URL or some calculation tool so that the community can track the progress of the work.", "q2r": 3, "assessor": "z_assessor_3616", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "JUS makes it easy for anyone to purchase stablecoin. All that's required is their facial biometrics, phone number and mobile money payment methods.", "experience": "\nTashoma Vilini: UI/UX Designer, Atala PRISM Pioneer and Liqwid Co-Founder based in Senegal\nSiddi BarracK: Distributed Network Engineer Msc, Atala PRISM Pioneer, Full Stack Dev @ World Mobile based in Senegal\nIsaac Shapira: Platonic Systems - Top Rated Plutus/Haskell Firm, Ardana\n"}