{"id": 414699, "author": "captivatingnaturals", "title": "Cardano Africa SmartFarming DApp", "url": "https://cardano.ideascale.com/a/dtd/414699-48088", "category": 26600, "amount": 15000, "description": "Lack of efficiency in coffee farming. Africa's potential Coffee production is not being met. We have a bounty of raw materials but production output is low. Miscommunication farmer owners/managers", "f6_no_assessments": 5, "f6_rating": 4.2666666666666675, "videos": [], "media": [], "f6_assessments": [{"id": 13776, "q0": "This proposal effectively fits into the Grow Africa, Grow Cardano challenge. Agricultural produce remains one of Africa’s strongest exports today in global context. While smart farming systems present a major boost to the production of these agriculture produce by maximizing crop production yields. \nUsing modern technologies especially through the blockchain and already built solutions in the Project Catalyst community to detect crop disease early and prescribe solutions, will go a long way to assist many African farmers in the urban and rural communities and not just only East Africa, but Africa in greater context. \nIt is also noteworthy to mention that coffee production and agriculture yield produce are one of the key drivers of the African economy as many countries on the continent derive their foreign exchange and base their multilateral trade agreements on their agricultural advantage. This means that agricultural practices and their workforce are a key interest to economic and social development organizations like the African Development Bank and the World Bank.\nFurther examination of the project proposal shows that this team have brought to bear their business acumen on the project by establishing a clear impact basis upon the promotion of sustainable agricultural practices, the environment and future product integrations in a wider scale.\nThe proposal team should further consider their mitigation measures towards the identified risk they have outlined. A high-level risk consideration has been done, but a missing part of their risk assessment should focus more on the project implementation and proposing possible solutions to those challenges.\nA great consideration has been given to the existing and future technology deployments in Eastern Africa that could impact greatly on this proposed project which shows that the project team is deeply aware of the changing African narrative taking place through technology advancement.\nAlso, a great job has been done to identify service improvements for the proposed DApp in terms of agricultural produce processing of coffee and in future could further aid African farmers producing other crops for human consumption.\n\n", "q0r": 5, "q1": "The proposed success benchmarks by this team should be tied to possible growth numbers in terms of early market adoption by urban and rural farmers and their workforce, possible number of software integrations on a monthly or quarterly basis and possibly identified service expansion areas for service delivery.\nThough some auditable benchmarks have been identified by the proposers, they are more inclined into the agricultural practice and the environment which could create doubts for future financiers of this project, especially those not inclined to SDG/ESG principles of investing. A better way to solve this issue would be to clearly identify auditable benchmarks in terms of the environment, services and integrations as I proposed earlier. \nAlso, another great success indicator for this project would be how many crop diseases and solutions could be identified by their DApp currently and the number of new crop diseases under research and development.\nTheir project timeline also needs to be reconsidered as time appropriation in terms of project deliverables are missing. Just to give an example of this suggestion, how long will it take in man hours or days to buy and install plant sensors? \nIn terms of feasibility with regards to budget breakdown and project team composition, the  proposers have shown quite a dynamic advantage as their project capabilities have been tested, trusted and certified in certain cases. Though more clarity needs to be provided by informing PA’s which team member will build which solution or work on which area of the project. \nIt is also great that the project team will return to Project Catalyst for more financing, as this will contribute immensely to the success of the future funds and campaigns.\n", "q1r": 3, "q2": "Improvements need to be made to the auditable benchmarks in line with the proposed project execution and market adoption rather than just environmental benchmarks to judge the success of this proposed project. \nThough their proposed solution will effectively tackle the challenge of improving coffee production and processing. It has a great potential to scale to other cash crops being cultivated on the African continent by farmers and their workforce. \nIn terms of their DApp development, the roadmap needs to be reconsidered with proper time duration in hours, weeks or months for new product features and deployment.\nAlso, the inclusion of a project team member with digital marketing skills will also go a long way to build service adoption in the agricultural community and in the global space that will in turn aid their market adoption.\nFinally, the current information is sufficient to audit the progress of this project. Although there are improvement areas to bolster the impact and market adoption of this proposal which should be considered by the proposers. As earlier mentioned, the agriculture market dynamics in terms of production and farm produce sale, remains one of the strongest areas for economic intervention and development in line with the advancement of new technological solutions that will impact on its future sustainability for everyone.\n", "q2r": 4, "assessor": "z_assessor_3800", "no_vca": 3, "ne": 3, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 1160, "q0": "This proposal addresses the challenge as it would deliver a DApp to help coffee farmers to monitor and certify the supply chain of their production. \nMore in details, the DApp would be available as a pilot for 3 coffee farms, each one of those in a different country in the East Africa region, and it will leverage on IoT sensors, machine learning to monitor the environmental conditions and the plants health to deliver a better quality product and allow farmer to sell their coffee at a higher price. \nThe tracking of the supply chain could go on to further coffee processing other than the crop stage, such as roasting , packaging, grinding...", "q0r": 5, "q1": "The proposal is feasible because it relies on a known technology, currently applied to gardening (as shown via a link provided by the proposer), that would be reapplied to coffee farming.\nTre proposer has already acknowledged that the lack of internet could be an issue for the proposal completion, hence she included in the budget 3 Starlink devices with the subscription for 1 year.\nThe proposer also spot the right sensors to integrate in the farm and already thought about a potential upgrade (instead of fixed cameras taking pictures of the plants and spotting the defects/diseases on them, there could be a robot running around the coffee farm).\nI would suggest the proposer to provide a template for the dApp they intend to build, and clarify how they would overcome the challenge of culture shift from traditional methods to a high technological one", "q1r": 5, "q2": "The information provided regarding the project execution are accurate, as stated above.\nThe budget breakdown is precise: the proposer asks for 15000 USD, which would solve spent mainly for hardware devices for data acquisition and connectivity, plus some minor costs for project management and legal (? Never mentioned in the whole proposal, is it required because of data policies/IDs of the workers in the farm shared I guess ?)\nIt is a bit surprising that no budget has been allocated to build the dApp that would serve as a monitoring tool for the farmers.\nOne big remark.\nThe proposer did not outline a timeline for this project, which supposedly would be completed in 12 months (assumption based on the period of Starlink subscription, see budget breakdown).\nI would encourage to set milestones, e.g. 1 month, sensor placement and connectivity, 6 months data collection while building the dApp.\nOne minor remark: \nOne of the future objectives to be achieved by the proposer is to get some volunteer carbon credits, given by entities investing in projects in order to reduce CO2 emissions.\nI guess the proposer gave it for granted that by certifying the production of the farmers in the above-mentioned farms, one of the outcome would be more plants grown so more CO2 captured. If that's the rationale, I would encourage to analyse the CO2 balance for the whole supply chain after this project is implemented.\n", "q2r": 4, "assessor": "z_assessor_2215", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4344, "q0": "The problem the team poses here is that Africa's coffee industry is working inefficiently. We all know the potential to grow coffee in East Africa is huge. But at present, it seems that the methods of farming, harvesting, and developing the coffee industry have not been as expected. You have stated that one of the reasons is mismanagement of information and made a suggestion to solve this problem, which is in line with the goal of the Challenge \"Grow Africa, grow Cardano\". I'm a coffee drinker myself, I'm interested in your suggestion. This proposal, if executed well, will address the efficiency in developing Africa's coffee industry while adding value to the Cardano ecosystem. With DApp building, I believe it can scale and solve future challenges. Even doing this requires a lot of time and effort from the team and the community. The team's DApp is associated with Cardano blockchain technology, using high technology related to artificial intelligence, Robotics, etc... I think the application of high technology creates conditions to increase value for the Ecosystem. Thus, this proposal has parallelized the two goals of solving the posed problem and increasing the value of the Cardano ecosystem. This requires a certain investment of human, material, and successful time, when achieved good results, it will contribute to the growth of the African economy, creating jobs for the people here. . This is in line with the 8th of the 17 Sustainable Development Goals of the United Nations: \"Good jobs and economic growth\". I fully agree and fully appreciate the visual impact of the proposal. I vote 5 stars.\n", "q0r": 5, "q1": "The first criteria I want to talk about to evaluate the feasibility of the proposal are the number of team members, the relevant experience, and the disclosure of the members' identities. Your team currently has 4 key members and will probably have some collaborators behind. What I am very satisfied with is the related experience of the members, the team has rich and diverse experience related to agriculture, information technology, Cardano and Catalyst, programming, accounting... Regarding the job public identity, I can trust the identity of the members. But I would like to suggest that you can cite more links from social networks so that the community trusts more and makes it easier to verify the identity of team members. There is a very interesting and prestigious detail for me that is that you gave all the documents related to the team and the work, along with the video of the meeting lasting more than 2 hours. However, I still have one question about a member named Jackie (with 80 years of experience in coffee farming), can you elaborate more on the number of 80 years, how old is Jackie's age? I would like the team to clarify these questions because doing so will increase the feasibility of the proposal and the community's trust in the team. With a budget that has been broken down into items, reasonable with the goal. My question about the budget: Do you plan to spend the budget on promoting and marketing coffee products? I think media advertising is important for any project. Will the project issue tokens later? I think that the token if issued by you, will be one of the ways to promote the product. Another question: If funding from Catalyst has not been received, will the team continue to implement this proposal? You can consider my last question with positive feedback to add to the proposal. The proposal has a clear plan and implementation, with the support of AI and other high-tech applications. It is also the resource needed to make it happen. I am satisfied with your plan. Regarding the resources needed to implement the proposal, it seems that the team has mobilized enough resources (from human resources, applied technology, accepted by the local government, gradually moving towards the implementation of the project). community support) to successfully implement this proposal. The technical aspects are presented quite clearly to create a smart farm, the team can not face the technological barrier - the members themselves are quite tech-savvy. I agree with this suggestion. However, I have yet to see the appearance of smart contracts on the Cardano blockchain platform. I think smart contracts have an important role to play in positively impacting the productivity of the coffee industry. I guess that sooner or later the team will use smart contracts in farming practice. As for the challenges and risks related to the implementation, the team pointed out the main risks that come from objective reasons. This is a risk not only in East Africa but also in the highlands of coffee in my country Vietnam. With the efforts and support of the government and the community, we have overcome. I believe you are too. Through the proposal, I understand the superiority of the project. The proposal, this project is good and not highly competitive (up to now - my personal opinion). Hope you can consider my recent comments. Proposals have good ideas, that will come to life. I vote 4 stars.\n", "q1r": 4, "q2": "As for the transparency and auditability of the proposal, I agree with the roadmap and milestones outlined by the team in the proposal at Fund 8. In Fund 9, I saw an expansion and development of the proposal. continued in Fund 8. This proves the seriousness and professionalism of the team when implementing. I love to evaluate such professional proposals, you must have an enthusiastic and serious working spirit before you can continue with the proposal that extends through the Funds. You have been very wise when giving KPIs. It is based on arable farmland, government spending, and development assistance from the community. I was particularly impressed that the team also set a standard for success, based on existing products, services, and integrations. As a PA, I find it difficult to come up with KPIs and benchmarks for success. There are not many proposals that offer both such criteria. But you guys have done it, this makes me believe that the level and knowledge of the team is close to that of an expert, especially in the field of agriculture. The professionalism comes from describing the problem clearly and easily and stating the solution (both Fund 8 and Fund 9 do this well). The factors I just mentioned confirm the transparency and auditability of the proposal, especially when applied to actual conditions. I only have a small suggestion, that this proposal should have more surveys on the current conditions in coffee growing areas, maybe even more surveys to consult from the leaders. lead the local government to further clarify the feasibility and transparency of the proposal. If this proposal is funded by Catalyst, will the team continue to implement it immediately? Or is the team's next step waiting for a response from the government and from society (people who are closely related to coffee and other related factors)? Just now is my small opinion contributed only with the desire to make the proposal more complete in my way of thinking. Good luck to the team.\n", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8341, "q0": "Increasing control over production leads to better cost management and waste reduction. The ability to trace anomalies in crop growth or livestock health, for instance, helps eliminate the risk of losing yields. Additionally, automation boosts efficiency. The proposer has identified the need for smart farming to improve the efficiency and quality of coffee plants in Africa and has worked towards a solution for it. By doing so, the proposal will benefit more numbers of users and gain more users to the Cardano community using dapps built on cardano which will in turn increase the value of cardano ecosystem and its users. The key metrics specified in this proposal gives a better understanding and defines the success of the proposal and is aligned to achieve the goal. The proposal can be scalable to address the future challenges and has adaptability to make changes to upgrade the existing proposal.", "q0r": 4, "q1": "The proposer has provided enough information to support their experience required for this proposal. The proposer has provided evidence by providing several reference links to support their proposal. The budget has been mentioned clearly which is 15000 USD and is very reasonable for this proposal and has also been broken down into identifiable individual units which is reasonable for the completion of the project. The proposer also offers a realistic time to complete the proposal as they have the necessary resources for successful implementation. The proposer has also mentioned the challenges or difficulties faced during implementation of the proposal and has considered them and is prepared for the successful implementation of the proposal.", "q1r": 4, "q2": "The proposer has laid out a realistic roadmap with the steps for the completion of the proposal within the specified time and the provided information is sufficient to audit the progress of the proposal after the funding. The key metrics mentioned in the proposal align with the proposed goal and also defines the parameters for success of the proposal. The proposer has identified the problem and has provided a solution that addresses the problem which is most likely to succeed. The proposer has provided all the necessary information and has analyzed the problem to be solved efficiently. Hence I feel the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2976", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11536, "q0": "The proposal elegantly describes the problems involved with coffee farming in Eastern Africa, pointing to ineffective communication between farm owners and managers, and provides a comprehensive solution that entails a number of technological steps to implement, including the development of a DApp utilizing AI and machine learning.Furthermore, the proposed solution incorporates steps such as behavioral UX research, SSI implementation on the blockchain, wireless/cable communication solution, and so on, all of which are required for the development of a smart farming platform. When used for DApp development, SSI data storage solutions among farmers, and other reasons, I see a huge opportunity to adapt the Cardano blockchain, leading to accelerated ecosystem growth. Furthermore, increased coffee smartfarming efficacy has a direct environmental impact on meeting sustainability goals, which are further incentivized by \"carbon credits\" (additional source of income for the project). With all of this, I see a significant alignment between the main Cardano pillars (sustainability goals, security, and so on) and with the current challenge to grow Africa by increasing blockchain adaptation for software development, data storage, and so on.As stated in the proposal, the impact is both local and global, with the potential for other countries (not just in Africa) and other farm types  (sugar indrustry) to endorse such technology. While I see a lot of capacity for scalability, I also see a huge amount of steps and technology development to carry out this project, which is both an advantage and a disadvantage of this project in my opinion", "q0r": 5, "q1": "This piloting/proof of concept project, in my opinion, has a very good chance of success. The projects in this step aim to investigate the feasibility of the entire concept, including the technical setup, piloting on multiple farms, and gathering data points to improve the technology. In my opinion, the team's skill set should include IT members, a project manager, a financial/content manager, and a local community member with coffee farming experience. However, I believe there is a typo in the proposal that is related to years of experience in coffee farming (80?). In the proposal, I'm missing specific roles and responsibilities that team members will take on during the project, as well as LinkedIn profiles. A github repository and a previously conducted and published research thesis in advanced farming solutions, on the other hand, support the relevant skillset. The timeframe lacks some necessary details, only providing the milestones that must be completed without defining how much time those will take to complete. The budget is described in sufficient detail, including technological, logistical, and personal costs, as well as calculation details. In my opinion, the budget is relatively modest and reflects the project's need.", "q1r": 4, "q2": "This project's auditability will be ensured by direct output from farming on a daily basis - photos, data from sensors, and so on. However, the proposal does not specify where the data will be made accessible to the community (but I would suspect on github repository provided in the proposal). TThe milesones are only listed without further explanation, and the KPIs mentioned in the proposal are for a later stage of the project, when the project will potentially be  adopted by multiple farms. It would be fantastic, in my opinion, to provide what KPIs are critical in this early stage of the idea's development. The delivery dates are not specified, but I suspect that defining delivery times in such projects is difficult because the amount of data gathered is likely to be affected by a range of factors beyond the team's control. The risks are described in great detail, but I couldn't find any information on how the team would manage these risks.", "q2r": 3, "assessor": "z_assessor_3256", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Create a photo taking DApp using AI, ML, Robotics to improve efficiency of farm production. Conduct user research and behavioral data to prototype a mobile app for SmartFarming in the coffee industry.", "experience": "80 years Coffee Farming experience, Agriculture Data Scientist, Plutus Pioneers, Atala Prism Pioneer, Entrepreneurs, Marketer, Community Mobilizer, CAs, VCA, Challenge Team Members, Boostcamp Alumn, Project Management & Ed Tech, Funded Proposers, 20 Years experience in Accounting"}