{"id": 414661, "author": "emeliasarfo2", "title": "Ghana Youth Onboarding Outreach 2", "url": "https://cardano.ideascale.com/a/dtd/414661-48088", "category": 26600, "amount": 5500, "description": "Most of the productive youth in Ghana are not aware of blockchain technology and its opportunities. Cardano project catalyst education can bring adoption and scale up through their wild ideas.", "f6_no_assessments": 39, "f6_rating": 4.572649572649572, "videos": [], "media": [], "f6_assessments": [{"id": 440, "q0": "This is what Cardano in Africa needs. Boots on the ground that understand the knicks and knacks of local nuances. First and most lowest hanging fruit in terms of onboarding onto Cardano is indeed the Project Catalyst community. Most specifically the engaging program called Proposal Assessor (PA). Involving oneself in PA, not only educates on the whole of Cardano community and all its branch out possibilities there also lies potential compensation. From there, what usually happens is a number of inspired individuals further involves themselves in their respective community representatives in Cardano. Or the holy grail, they create their own project and ask funding through Project Catalyst. The dawn of Cardano in Africa and all other places, starts from boots on the ground, from Catalyst School education and develops from there.\n\nThe onboarding format is there, it is slowly being proven real-time all that it needs is a continuation. Eventually Cardano will be a household name as the blockchain that truly cared for the community and not just businesses.", "q0r": 5, "q1": "As a previously funded proposer with almost similar action plan, whom achieve what they intended to do and has successfully reported their achievements to the Cardano community, there should be no doubt, their continuation efforts will go as successful or even better. One can simply click on their YouTube link to view their  previous efforts.Their efforts are simple and straightforward which is to have workshops at various institute (with their consent) to educate on Cardano.\n\nConsent being key here, for that means the higher echelon of that institute has successfully been persuaded to acknowledge the benefit of Cardano and all its nuances. Having consent also create trust among the students which eventually pushes attendees.", "q1r": 5, "q2": "The proposer has provided a clear timeline of when the seek to have this workshop and has also identified the need and duration of asking consent of the targeted institutes. Having being a previously successfully funded proposer, has provided them with metrics they can use for further continuation proposals such as this.\n\nBased on their previous success they have set an ambitious but rightfully so target of continuous 150 members in each of their workshops. Though perhaps in the future, as a development of this proposal, they could also target the growth on involvement onto Project Catalyst. This added challenge is justified by the background of the proposer being heavily involved in the African Town Hall and African Catalyst School.", "q2r": 5, "assessor": "z_assessor_2088", "no_vca": 19, "ne": 1, "ng": 18, "nfo": 0, "vca_o": 1}, {"id": 10776, "q0": "It is clear that CATH will not be a challenging project to carry out or demand too large financial resources, so your team created appropriate targets and followed the suggested action plan. KPIs are also specifically supplied so that individuals may evaluate which standards will determine whether this project is successful. However, I would still want to see real figures rather than simply the term \"number\". Just a few quantifiable numbers so people can gauge how well the project is performing. For instance, how many messages from the community do you anticipate there will be on each of your channels, how many community members do you anticipate there will be on each of your channels in the future, etc. It shouldn't be difficult for you to map out additional precise KPIs as you already have a baseline of Telegram group members, Discord users, and previously held meetings. Last but not least, I want to remind you to pay attention to placing the content of your answers in the appropriate place for each question. For instance, the paragraph you present about your team's accomplishments should be ranked best in the Impact section where you mentioned your proposal funded in F8.\n", "q0r": 5, "q1": "There is no doubt about the thoroughness of your proposal. Your careful preparation is always maintained to create the complete proposal possible. In this Feasibility section, you present a plan for two workshops with a clear timeline and detailed activity schedule. Again, experience helps you be better prepared for the proposed budget, and I hope this small change in funding will help the team create better workshops than the old one.\nYour team comprises excellent individuals with extensive blockchain knowledge and expertise. Further, your team member appears to be engaged in a different project inside the same fund 9. Please include a few paragraphs describing how you will manage your work so that the community can be confident in the quality of your work.\n", "q1r": 5, "q2": "It's not challenging for you to comprehend how to monitor the progress of this upcoming project because of the comprehensive strategy already in place and the knowledge gained from the first workshop. You keep track of monthly information about the seminar and distribute it to the community. You also plot the course this project will follow and its likelihood of success.\nHowever, I have a few suggestions to send to you to make your proposal even better. If possible, directly give the name of 4 higher education institutions where your team can plan the session. Since you specified Ashanti Region as the area, I don't think this should be too challenging for you. Finally, because you already know what proportion of attendees will sign up to join the Cardano community following the first workshop, it would be beneficial if you provided the exact estimate for these two workshops as well. It will serve as both a source of inspiration for your team and a means by which everyone will gauge the accomplishment of each project.\n", "q2r": 4, "assessor": "z_assessor_3193", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 11045, "q0": "Africa is the youngest continent in the world with 60% of the population under the age of 25. There is currently no coalition that can support single SPOs in Africa to promote network decentralization. Your Proposal: \"Develop the Africa Stakepool Alliance, an open-access database and framework for knowledge exchange, facilitation, and the growing impact of SPOs in line with operational mission in Africa and the community\". Your suggestions have helped young Ghanaians to solve the difficult challenges they face as they grow up, which is to develop Blockchain technology and skills so that everyone can access it and get a decent job. determined for yourself. I find this to be a very practical and humane project to help the Blockchain community in Africa constantly develop. The proposal has identified a risk that universities refuse to grant permission to organize seminars, I think you need to do a good job of marketing communication, meeting and exchanging with leaders of higher education institutions. study, help them better understand the value and effectiveness of the proposal will return, they will certainly welcome you.", "q0r": 5, "q1": "I have read very carefully the solutions you give,. I have not seen you suggest how to attract a large number of participants. In fact, many students still do not know about the project, so you need to strengthen communication in many forms, in which, you should take advantage of information technology to communicate. In the seminar, after the presentations made by the experts, you should design a discussion so that between the experts and the students have the opportunity to exchange directly to help students better grasp the technical knowledge. Essential skills on how to write comments, how to write and submit proposals. You can design a test to check the effect obtained. I agree with you that you need to organize tutoring activities, including one-on-one relationship building and tutoring. Teaching must be appropriate to the audience, this solution will directly help students who have difficulties in the learning process. You have provided a detailed budget analysis for the project, I see the appropriate funding source, the spending contents are clear. The team working on the project has experience in Fun 7, 8 so I feel very good.", "q1r": 5, "q2": "You have provided information to measure the progress of the project, but it is general, not specific. You need to be more specific about what work you do in July, August and August will achieve specific results. This project is clearly an extension of Fund8's Ghana Youth Outreach Program, the success of your proposal is pretty well described, I support you.", "q2r": 5, "assessor": "z_assessor_3216", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"id": 11535, "q0": "The problem that the proposed project aims to solve is also one of the current challenge's main pillars. It is almost certain that by introducing cryptocurrency, blockchain, and Cardano to young people in Ghana through educational workshops, some of the participants will adopt Cardano. This is especially true for young people, who are more likely to be open-minded and interested in technology. As stated in the previous aspon proposal, 3/4 of the participants became members of the community, giving the opportunity to rise more proposal assessors, vCA, and proposers. This, in my opinion, demonstrates Cardano's sustainable growth and scalability, which adds a significant amount of value to the ecosystem. According to the proposal, the impact seeks to have a more local impact in the Accra region of Ghana, but by getting involved in the Catalyst community, the impact would extend beyond the local African communities.", "q0r": 5, "q1": "Given the team members' experience, previous workshop success, and ability to receive funds in previous cycles, it is likely that the project will be executed successfully. Furthermore, the team consists of members with potentially great social skills (HR experience, hotelier, educationist, etc.) who are required to enroll participants for the workshop and interact with tertiary institutions that would hinder the workshop's organization. Furthermore, one team member is also an ingroup member (student), which will most likely facilitate enrollment. Additional information, such as contacts and LinkedIn profiles, are included in the proposal, increasing the reliability of the information provided. The timeline included all necessary details such as specific event dates, workshop content, and the presence of opportunities related to Cardano onboarding (Wallets opened). The budget for multiple sessions of the workshop is pretty modest, most likely reflecting the low cost of local services and items. The budget is also comprehensive for each item, along with the rationale for its requirement.", "q1r": 5, "q2": "The information provided about auditability is sufficient to monitor the progress of the project over the course of three months, with clear KPIs indicating the number of online/on-site attendees. What I'm missing is information on how the number of potentially onboarded Catalyst community members or Cardano adopters will be measured. One potential risk preventing the workshop from taking place was described in detail, along with a detailed solution based on previous experience organizing a similar workshop.", "q2r": 4, "assessor": "z_assessor_3256", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11596, "q0": "This proposal is one of the simplest but impartful project  and I think the proposer and her team deserve a kudos. They attached importance to virtually everything that is required to make or create awareness among the youth especially the tertiary students and our young men and women in Africa by Simply organising workshop and taking them to the knowledge of project catalyst and Cardano ecosystem to break the poverty gap and to make a lot of them micro business men and women. With the understanding of the proposer and her team about the situation in the country, I think they Hold the best Solutions through project catalyst and cardano to solve the problem in a way. The proposal has hinted that workshops have gone on already and a good number of the students have onboarded onto the cardano and project catalyst at the moment and are proposal assessors in this fund 9, I personally applaud her and her team. The proposer with her experience has requested for a budget that if funded will help the team in delivering the proposed projects before hand, here are some of the projects or programs she intends to carry out of which, most of the students and graduates are going to learn about blockchain and bring out great ideas such as in information technology talent which the student themselves may not even know that they possess those kind of capabilities. The students and youth will also know about cryptocurrency because currently cryptocurrency knowledge is very little in the country and in the continent as a whole, I for one only got to know about this a few weeks ago and so I think all these are some of the ways to get a lot of the youth that are in their hideout to know about Project catalyst and cardano ecosystem which will bring some liberation on to our tertiary students and the youths as a whole in Ghana and in Africa at large. The team also intend training youths or young people in marketable skills to boost their chances of escaping poverty and also training them in another way which will include technical and computer skills, these and many others are the reasons for the proposal and this I think if funded the proposal will be carried out successfully by the proposer and her team.", "q0r": 5, "q1": "The proposer has made it clear in the proposal that she has been a proposer and her proposal was funded and that she has run the program in a successful way which is still ongoing with that experience in the first workshop of her  'Ghana Youth Onboarding Outreache' she stand tall to make this program a success if funded again. Her candidness in raising issues she has seen in the past proposal by correcting thing she didn't have much information about makes her come out with a badger that she thinks can cater for this second proposal she has put forward in this challenge to be funded. Her requested budget has further been distributed according the activities she would be carrying out in the course of the two months intimated, she said that her program timeline is going to take a form of two months of delivery and she expects it to start somewhere in August 13th to 15th. But not sure of the exact date yet so she kept it as, an appropriate date within these dates will be the first of the second session of the workshop she intend to carry out she also hinted that depending on which date she's given by the tertiary institutions is going to carry out this project, publicity of this outreach program in the selected School will be done with a banner and flyers and also an appropriate date suggested will be set and the vanue set in order. The proposer intends to do an educational presentations which she said will be done by a team of experts so at the end of the day Wallets will be open for interested participants and mentoring activities would include one on one relationship building and tutoring she intimated, that the program will be a 3 hour duration program for every session of a workshop if funded. The proposer and her team has given a detailed links of the people she intends to work with during this fund 9 if funded.\nShe intend to replicate the date system for the month of August in the same arrangements with the month of September if not entirely as August but a little variation in date in Greater Accra and in the Ashanti region where she would be taking a drive of 5 hours to the Ashanti region to educate the young men and women on the above project catalyst and cardano. These workshops and conferences she said, she will be there in person with her team of experts that is face to face and at some point online engagement can also be done of which I agree with her perfectly because we are in a digital world and so the need for the dissemination of information can use any medium  that can work by given education on cardano ecosystem and project catalyst through it proposer and therefore support this project fully and pray it is funded.", "q1r": 5, "q2": "The information provided by the proposer and her team is precise and straight forward the proposal hinted that in July letter will be sent to these institutions that they intend to carry out these  projects two out of the numerous the letters were served will be selected for the program or Project to be done there. According to her in August when the program kicks starts participants both physical and present online will be recorded and information made public to the cardano community of which I think project catalyst and cardano community can audit with ease. She also said that the second session too same records of participants present and online will be taken and participants that will show interest of becoming volunteers in the ecosystem, their records will be taken and Coaching be done and finally they will be led onboarded onto the cardano ecosystem. What success looks like, the proposer said that she expect that by the end of the programs maybe people that will be interested in becoming proposers records will be taken to pour out their great ideas into the project catalyst and the cardano ecosystem by making changes in their societies and in the world they find themselves in by making cardano go to blockchain in Ghana and in Africa, that's by bringing more developers to bring in the innervated change in the ecosystem.", "q2r": 5, "assessor": "z_assessor_3260", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 11625, "q0": "The proposer and her team have very well placed the change idea to address the problems in the right challenge category on the CARDANO blockchain ecosystems that needs to be addressed that is awareness creation leading to adoption of CARDANO blockchain ecosystems among the youth. The proposal has also shown how much this proposal can add to the Adoption and scaling up project catalyst in the CARDANO ecosystems in Ghana and Africa . The key metrics of the proposal is to get the youth to adopt and scale cardano in Ghana and Africa beyond. And this adoption and scaling will lead to the youth developing much interest in becoming proposers, Proposal Assessors, Voters and creation of yori wallets. The proposal has not clearly shown how it will deal with future challenges should there one. The proposal is built on a project that was funded in the previous fund and once it is continuation to that project both are building toward sustaining it successes in Cardano adoption in Ghana when it is funded.\n", "q0r": 5, "q1": "The proposer and her team have provided link to the proposal and have also shown an ongoing project it has at hand for which this proposal is built on in project catalyst . The proposer has outlined in the proposal a team of three with their skills and experiences with collaboration with WADA Ghana team and also projects they have worked on with their references attached as person who will assist in the proposal implementation. The proposer and her team have provided break down of their budget and have itemized them with cost allocated to them. This proposal has a reasonable budget in relation to the goals set to achieve, it has in it a detailed planned time of two months to deliver on it activities for month of August and for month September with a list activities it will carry out. The proposer and the team have a well planned on how it will start with the plan implementation and who will be targeted. The proposal has clearly defined specific resources needed for the implementation and has also outlined the needs to the success of the proposal and the collaboration it will take for the proposal to succeed. The proposer and her team have stated the risk in carrying out it planned activities, which are refusal to grant permission to hold their program and have give some solutions to them give their previous experiences but I suggest that the proposer and her team should formal write to institutions it want to engage it students and then do the follow up for approval. If the need be engage the authority first on their proposal and projects then the student.", "q1r": 5, "q2": "The proposer and her team have a well layout plans in the proposal, that set time for which they will work in making sure they achieve what is set in the proposal. The proposal has in it two key metrics to measure how successfully the proposal project will be achieve, and this are clearly defined as follows, number of people who get to know about the Cardano blockchain and project catalyst and CARDANO becoming the place of choice for blockchain for Ghana and Africa. The proposal targets problems identifies many youths not aware of blockchain technology and once awareness creation is done using the platform of CARDANO blockchain ecosystems and project catalyst will easy with Adoption of project catalyst and the outcome will increase Cardano awareness among the youth in Ghana and beyond. Successes in the proposal are measured by the number of developers growing more, more ideas are generated from the coaching and monitoring processes through the effective awareness creation as a solutions to address the problem identified. The proposer and her team have a YouTube channel for the communications and for their updates too to the community. I believe the idea will have an impact when funding to the CARDANO ADOPTION in Ghana and Africa as a whole.", "q2r": 5, "assessor": "z_assessor_3262", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 12054, "q0": "This is a great idea and I think \nCardano can better expand in Ghana with this project. I think this is one way we can get the youth to develop interest in Cardano ecosystem. This will help the youth to get more experience and get involved in the Cardano ecosystem as well \nThis is one project that will offer young men and young ladies link opportunity in the Cardona ecosystems to the acquire knowledgelearnt, And once knowledge is acquired their is that room for development and take off the  cardona environment by this young men-and women.\nThe idea is very prefect for what the challenge ask for . I found it very interesting that this project is also aimed at the growth of the youth , I don't remember having seen other proposals that catered to this portion of the population , educating 300 students that is massively relevant for the blockchain education . When this project happens successfully , it would be a good gateway for new members to the Cardano ecosystem, maybe if  students are educated on blockchain parents will be interested in learning a little about our blockchain, it would also certainly increase the number of tokens being minted and ada being traded , so I believe the project would benefit the Cardano ecosystem in different ways, aligning perfectly with this challenge", "q0r": 5, "q1": "I agree that this project seems very important. Blockchain can help benefits The youth . sending  letters early and working  with institutions to get document for the event approved earlier before the event is also a smart step . \nReaching out to educate at least 300 tertiary and high school students in northern Ghana through conferences / meetups that will be organized is a good idea . Timing is correct. Numbers are good and I think the can do it . This  team is certainly qualified to carry out this project very good,we know who they are, their names, the briefed us of their backgrounds and history of their previous experiences already and also their LinkedIn profiles.I think we can get to know each of them in detailed . It would be good if the authors  show great interest in taking care of the usability part of the platform.To look into the benefits of the project, by making us comfortable of any fraud activities. how would this publicity? Because he made mention of only tertiary and high schools. This is a very  big project, so it needs a lot of publicity to reach the public.All though the organization of the entire project is good . the author made it clear on how everything is going to work on a given of time . Which is good because making sure everything goes to plan within every step is very necessary. This is a good project and it shows how everything is planned. ", "q1r": 5, "q2": "I think this is a project that could be improved by having    conferences / meetups meetings to assist with the delivery and ensure the project is in line . At this stage reporting back is very little detailed in the proposal pertaining on the project,however there is a great interest in Cardano and this would present opportunites for exchanging ideas and inspiring more interesting projects such as this throughout our Environment. \nThe KPI's and milestones are clear and measurable. He also explained how everything is going to carry on and every single detail about what’s going to happen. I think with the help of cardano accessing up their work with a small team so we can get feedback or updates from them time to time will be a very good ideals. ", "q2r": 5, "assessor": "z_assessor_3344", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12058, "q0": "The project is aligned with the Challenge setting under Grow Africa Grow Cardano. That is the focus is on the youth who form majority of the population in Ghana and African at large. This project when fully implemented will impact significantly on Africa’s adoption to Blockchain technology and Cardano/Catalyst activities. Giving the number of persons who signed on to the communities activities at initial implementation of this project as stated by the promoters, the fund must support this project to completion. Also, the project hopes to target other regions of Ghana to scale up the awareness on blockchain activities. Again, the proposers have targeted another 300 tertiary students to be on boarded and guided to with the aim of assisting them develop business out of blockchain technology and Cardano/Catalyst activities. The proposer have also provided detailed impact that the project hopes to make on the lives of individuals in terms of employment creation through blockchain technology, cryptocurrency and Catalyst activities.\nIn addition to these benefits to the individuals, the promoters hope to sign these 300 students on Yoroi Wallet, get some of them to submit proposals and also to be proposal advisors. Finally, the proposers have adequately outlined the risk to the implementation to this project and have provided adequate mitigation measures to address this risk. I will also recommend the promoters invite the Student Representative Council from these tertiary institutions to be part of the workshop as they will help in promoting the adoption on these targeted campuses. \n", "q0r": 5, "q1": "The promoters of this proposal have provided feasible road map that is implementable within the stated timelines. Also, giving the level of experience the promoters have acquired from the implementation of the phase one, and also the experience they have gained from other projects within Project Catalyst, they should be able to implement this with a much greater success. The various catalyst activities to be implemented within the two (2) months period is doable. Also, the proposed budget of USD5,500 is reasonable especially when the promoters have been able to identify budgetary gaps from the phase one and have made adequate provisions in this proposal to correct this gap. In spite of these feasible plans outlined in the proposal, the promoters should consider the time of implementation to ensure it does not coincide with exams on these selected tertiary institutions. They should also a lot of underground sensitization work is done underground to get the full buy-in of students and the schools authority. They should also engage a lot of campus reps to assist with advanced sensitization works. Finally, giving that the project hopes to do mass on boarding unto Cardano/Catalyst activities, selected Cardano members who were on boarded during the phase one should be made to assist to minimize the workload on few promoters during the implementation of phase two. ", "q1r": 4, "q2": "The two months period to execute this project is doable except that the timeline for the project implementation precedes that of Fund 9 approval timelines. The promoters should look at this and make adjustment to reflect the time table with Fund9 to prevent any funding challenge. The proposers have provide measurable roadmap for this project. Thus, their target of bringing on board 300 new tertiary students is measurable after project implementation. Also, they have outline the various Cardano/Catalyst activities that they are going to sign these people on. The project hopes to provide assistance to the youth in the areas of blockchain technology and the benefits within blockchain technology and Catalyst activities. It is important the promoters also provide quantifiable breakdown on these numbers (KPIs) in terms of the number of persons they hope to sign on to Yoroi Wallet at the end of the second month, the number of proposers they are targeting to submit from this project and the number of proposer assessors they hope to raise out of this 300 persons. Finally for the project to achieve the desired auditability and transparency required, it is important the promoters provide the medium they are going to use to communicate the success of this project to the community and the final outcome when the project is fully implemented. ", "q2r": 4, "assessor": "z_assessor_3352", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10131, "q0": "This is an interesting project, about educating young people in Ghana to access blockchain technology and reaching out to more than 300 young people in ghana. By ''organizing community outreach programs. community to safely engage more young people with submitable ideas that can bring jobs and real-life changes in their lives''. This could be a humane idea, the full text of which I was looking for, this proposal is a continuation of the second phase of the 'Ghana Fund8 Youth Outreach Program' proposal. this idea is looking towards the opportunity to develop the African regional community, and to expand the educational program throughout ghana. The writer offers a good solution to solve the problem of spreading the Catalyst for indigenous people , there are examples. specific to the idea. And in line with the African development challenge framework.\n\n   The risks that the idea faces, you have dealt with in advance with the local authorities. This is announced by the author due to experience from phase one. It's good because it will save time, and reduce the risks faced by the proposal. Also in this period, the proposal team will continue to open wallets for those who have already made Yoroi wallet public for participants. family.", "q0r": 5, "q1": "Regarding the experience provided by the author, you have participated in CA \\ PA since round 6 and voted from round 8. I think with the experience of your group, you can complete the project well. But there is one point I would like to suggest to you. , i.e. add a GitHub website/repository or any other related link, directly related to the proposal, to help the advisor understand more about the proposal, if possible you can provide more, to make it easier for community advisors to verify your information about the statements you provide.\n\n      The authors offer a two-month roadmap, outlining the work they expect to do in both August and September, and complete and publish their participation online. It showed the community how the project was run and what pleased me was a complete budget sheet explaining the budget gap between phase 2 and phase one in terms of cost. \\ travel, accommodation clearly, fully. With the requested amount of 5500usd, the notice states that the funds have been used up and explains why more money is needed due to increased travel and living costs.", "q1r": 3, "q2": "The idea is very good, if successful, it will expand the audience who know about the Cardano ecosystem and the catalyst in Ghana (Africa), promote to those who do not know about the ecosystem, will gradually join with us. Author milestone data also provides complete and detailed. To help voters, advisors accurately gauge the success of the proposal. But I noticed that this proposal is phase 2 of the proposal from round 8. This is a follow-up project clearly announced by you, but it is a mistake that you do not intend to include the proposed link. '' Foundation 8's Youth Outreach Program, in a challenge called Gender Gender. Introduce New Member '' that the team claims, which makes it difficult for community advisors to quickly access an earlier stage of the idea, to verify your claim. The reason above explains why I rate team transparency at this level.", "q2r": 2, "assessor": "z_assessor_3160", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 12381, "q0": "is deeply agree to above proposal because the problem needed to be solved has been identified and fallen withen the scope of the challenge\" why because in Ghana  all the student at the shs levels has no addoption \n addoption of blockchain technology, but looking at the potentials of blockchain   especially for  african countries is very great. So with the implementation of this nice project will help  the youth at the senior high school levels in Ghana to addopt change in  mind about the the though they  have that technology is ment for ousiders only but not the african countries  and others evn say its a scam, so with such proposal will help solve problems for today tomorrow and  tomorrow after.", "q0r": 5, "q1": "the proposal has provided a good links relevant enough for the success of this particullar project and the links are all working because i have checked them out. the proposal has stated the number and kind of team members needed to make this project a successful one ofcause.   looking at the detailed budget breakdown of the proposer it has also stated clearly on how the work will be done since this is  the face two of the project  and the sam of 5500 USD is enough for a good work to be done.   the budget has been broken   down into identifiable manner because  looking at the activities that will be  carried out, the proposal has plans on getting an additional funds but not in F9 but other funds regarding the same project since is going to be a continious one.    thank you  ", "q1r": 5, "q2": "i strongly agree because the proposal has provided good road maps to help audit the proposa if funded, and all KPIs defines the success of this project, since is not a new one but a continious project auditing would not be a problem ", "q2r": 5, "assessor": "z_assessor_3406", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 12841, "q0": "Great proposal and I believe this will educate the tertiary students to know and understand the concept of Cardano blockchain and the benefit they can gain from it. Having said that, the idea of hosting workshops to educate students becomes a needful solution to an identified problem needing to be solved in this challenge. It is a fact that most students may not have access to blockchain educational programs due to its omission from their curriculum. Most of these students do not have access to people who are enthused and acquainted with blockchain knowledge to help guide them towards understanding the ecosystem. Therefore, I see this proposal to be impactful since the approach is to reach out and educate these students about Cardono and project catalyst. What I see to be impactful is the onboarding of these students to the ecosystem. It clearly indicates that in some time to come, after a successful implementation of this project, the number of student participants would increase and thus contribute to the realization of the Cardano mission of seeing the upsurge in its adoption in the African region. The details and plan provided in this proposal make me convinced to give it a score of 5 for the impact criteria.", "q0r": 5, "q1": "The plan for the project is accurate and this idea, it will create another opportunity for students to take part in this Cardano blockchain. But I  think for the time duration given in the project is not enough. I suggest that it should be five days of training and presenting for a better understanding of the subject matter. \nThe budget is on point and the fact that the cost pattern is outlined makes it meaningful and strategic. The team members in this project, with their given experience, convince me that they can do a great job of imparting students with a clear understanding of the subject matter.\nThe proposing team has then a good job to identify a risk factor that is common to be a hindrance to a successful implementation of this wonderful project. Their mitigation plan, even though it sounds effective, it is quite unclear as to whether this action has been taken already or yet. This is due to the grammatical expression used in the context. Clarity is needed to help understand the intention of the proposing team. Aside from the given risk, there is another risk that I think would hinder the impact of the project. This is the risk of students not taking the one-day training seriously even if they attend due to the negative perception they already have about the blockchain technology as referred to as Bitcoin. What mitigation does the team have for this risk?", "q1r": 4, "q2": "The team has done well by providing sufficient information on the auditability criterion of this proposal. On the other hand, bringing people on board to mentor them is also lucrative for the project. It is clear that the project can be tracked by the community to know what actually is going on from the roadmap when matched against the metrics. The milestones from these would definitely help the community to know what to expect up-front for monthly reporting.", "q2r": 5, "assessor": "z_assessor_3489", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12863, "q0": "The problem clearly align with the challenge as its targeted at tertiary students who are seen as the future leader of Ghana and Africa as a whole. I think the proposal will be very beneficial to the cardano ecosystem if it is well executed as proposed. Since the goal of the project is to grow africa and cardano, I think it aligns with the challenge setting. If this proposal get the required funding and well executed, I think it will go a long make an impact in the further because the targeted group will soon be the leading voices in africa and for that matter cardano will be well known. ", "q0r": 4, "q1": "The team players have relevant experience as they are already working on a previous project, the the individuals qualifications also have makes them fit for the project, considering the over 20years experience of the human resource practitioner and over 10years experience of the marketer,  I think they are fit for the project. Considering the budget breakdown and the reason stated by the proposer as to why an increase in the budget, I think it is well broken down and understandable. A detailed road map is given for the execution of the project and its very clear for easy understanding. The proposer has factored risks that may arise from the execution of this project base on his previous experience which is realistic. But I think there could be other unforseen risk that the proposer should try and factor in next time. ", "q1r": 4, "q2": "Considering the road map milestone and time horizon provided in this proposal, I think they are clearly stated and understandable. I think the problem described is very clear to my understanding. \"To organize outreach programs to safely on-board more youth with ideas ideas who can bring employment and real life change in their lifes\" which is proposed solution is efficient to address the problem identified. The success of this project will help bring more people into the knowledge of Cardano and also better the lifes of many youth in Africa. The proposer has clearly stated ways to track the progress of the project but has not mentioned how he will give feedback to the Cardano community. I think the proposer should try to indicate how he can report progress to the community as well, either through twitter, Instagram, zoom etc.", "q2r": 5, "assessor": "z_assessor_3495", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 12948, "q0": "The proposal is about to Educate the youth about cardano-ecosystem .\nThe aim of Ghana Youth Onboarding Outreach is to get more people, especially the youth who are the future of Ghana and Africa to be aware of Cardano, and adopt it and scale it up in the continent. The proposer have already completed the some work on the stage one that is in june . The proposal clearly articulates that how it can add value to the cardano ecosystem. The proposer have already conducted the some of the workshops .The Key metrices and goals of the proposal  align with the outlined challenge settings. By looking at the proposal i agree that this proposal effectively addresses the challenge .", "q0r": 5, "q1": "The proposer have mentioned the timeline in very descripted manner. The timeline for upcoming two months is mentioned very clearly and the Budget breakdown is Mentioned,\nThe Budget is bit to high the proposer need to work on that other then that everything looks fine . The team looks very experienced \nproposer provides evidence of the relevant skills and experience need to implement the proposal , The proposal offers a\n realistic timetable to complete the work .The Proposer has considered challenges and risks relevant to successful implementation . The proposal provides a sensible and conductible plan for implementation. \nBy looking at the proposal i agree that it is highly likely that this proposal will be implemented successfully", "q1r": 4, "q2": "The proposal is very clear understandable description of the targeted problem and the proposal have provided the clear understandable solution that addresses the problem. The progress of the project can be seen after two months by looking at the how success the workshops were , like the number of people get to know about the cardano block-chain and project catalyst . By this way cardano becomes the  go to block chain in Ghana and Africa , thus bringing in more developers who ill grow and bring change in the ecosystem , By looking at the proposal i agree that this proposal provides me sufficient information to assess the program attaining its stated goals", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 13062, "q0": "Ghana, and to a larger extent the sub-region as a whole suffers from chronic illiteracy when it comes to cryptocurrency and blockchain technology.  There is a general misconception that you're likely to lose your hard earned savings to scammers if you were to engage in it, and thus not many people venture into it. Emelia's proposal is highly laudable as she seeks to change this narrative from the base. Educating some tertiary students about the benefits of blockchain technologies and its associated opportunities would have a ripple effect where peers, friends and families can also be roped in. Her statement,\" Technology and skills development should not be the preserve of the affluent in our society; it must be decentralized and accessible to all\" sums it all up.", "q0r": 4, "q1": "The author has prior experience of been a funded proposer in Fund 8.  This proposal is a follow up on the Fund8 Ghana Youth Onboarding Outreach which was in the challenge called New Member Onboarding. Coupled with her vast knowledge as an entrepreneur, training consultant, HR official, years of marketing  and vast experience in the Cardano ecosystem, she looks on course to do a splendid job.\nFrom Emelia's write up, she acknowledged, that the most challenging aspect of the first project was getting the heads of the tertiary institutions to agree to the workshops been organized on their campuses, due to their lack of insight on cryptocurrency and the stigma attached to it. She has already done some groundworks by educating them, and realigning any misconceptions held. She has further sought for, and has been granted permission by some school authorities to hold the workshops and seminars.", "q1r": 5, "q2": "Emelia said the enthusiasm and depth of questions asked during the Fund 8 proposal correlated in  over 30 people registering for the first ever Africa Catalyst School held online in June 2022.This number can easily be checked and verified.\nFor this project, when the first session is held, the number of people that physically attend will be on record, plus the online participants will also be recorded. Those that express interest to become volunteers will also be documented for follow ups after the program, as it has been done for phase one which participants have joined the Africa Catalyst School for education in Cardano and project catalyst.\nThe documentation and recordings from the sessions held will make auditing of the progress and success of the proposal easy.\nShe didn't however state how she'll show proof of the monies spent. The breakdown is good, but a means of checking to see where every dollar went will be much more laudable.\n\n", "q2r": 4, "assessor": "z_assessor_3555", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13403, "q0": "As a Ghanaian youth, I personally appreciate your effort to make Cardano and blockchain be understood in the country. What you said about unemployment in Ghana after tertiary is very true and through your proposal to make known Cardano to the youth will greatly impact their live because they are full of ideas and through Cardano Blockchain they can setup businesses to create employment for themselves and others to help the nation progress and the continent at large.", "q0r": 5, "q1": "Judging by the team working on the project, it seems to have a high rate of success. The team leader has so much knowledge about Cardano with some years of experience in other fields as well. The team will surely be given a chance to address the youth in the various schools because they are carrying out an educational programme to better the lives of the youth. As they have already seeked permission from the various schools ,there is high rate of success. Students will be very much interested and will participate because they know the state of the country's economy and will be willing to seek greener pastures from any opportunity they get. I like to also suggest that various advertisement be made on Tv and radio to also inform others outside the school and also on social media to make Cardano known and understood in the country and Africa at large.\n", "q1r": 5, "q2": "The success of this proposal will be seen from the number of people in the country who will join Cardano as they carry out their proposal. It also involves an online section for  individuals who will hear from their peers and all will be documented.We will see many ideas from the youth to grow the country, Africa  and Cardano at large making it the leading and go to blockchain in Africa.", "q2r": 4, "assessor": "z_assessor_3619", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 13441, "q0": "\nThis proposal helps in addressing the challenge of expanding the scale of Cardano adoption in Africa. The aim of  this proposal is to create awareness  about Cardano among the youth in Ghana. This will be done by organizing outreach programs which will educate and empower the youth with creative ideas, which can be submitted as  proposals on Cardano. This will go a long way to ensure easier ways of receiving funding for projects by the youth which will encourage participation and use of Cardano and will also bring employment and real changes in their lives.", "q0r": 5, "q1": "This project is a continuation of an already successfully implemented project with the same team. The impact of the previous project was strong  as 152 participants out of over 200 registered became part of the community, and many also participated in the first Africa Catalyst School held online on 21st June 2022. The proposal is to be implemented over a period of two months in two different tertiary institutions, which is enough time for the successful implementation of the project. The strategy for carrying out the proposal is well outlined and the budget is feasible. Thus from experience and the well laid out plan, this project will be carried out successfully.", "q1r": 5, "q2": " Information provided is sufficient to audit the progress and success of the proposal. This is because strategies for the successful roll out of the project, the targeted number of people, the ways of measuring progress of the project, method for recording participant information and a feasible, well outlined budget are provided.", "q2r": 5, "assessor": "z_assessor_3648", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 13566, "q0": "The proposal presents cardano to the youths as an opportunity which is attractive and draws many of them into cardano ecosystem and add to the spread of cardano blockchain across the country and then Africa as a whole. And this will make cardano move one step closer to achieving one of its aim of adopting Africa. The proposal identifies a problem within the challenge which is the delay and sometimes refusal to grant permission to undertake an event concerning the cardano blockchain in tertiary institutions. Sending letters to seek permission before the time of the event and explaining to the institution's heads about the opportunities that cardano blockchain have to offer will indeed prevent last minute disappointment. ", "q0r": 5, "q1": "The attachments and references verify that the proposer and her team have the experience and relevant skills required to implement this proposal. The proposal detailed the type and the number of team members to be involved in this project . The plan is to publicize outreach program in the selected school with a banner and flyers , setting a date on which institutions will not be busy with school work example is their examination and a set venue to proceed with the event.\nEducational presentations done by team of experts. The budget is not exaggerated and quite reasonable to take care of the project. The plan in the proposal will be very helpful in mass spreading and familiarizing the youth with cardano blockchain. The proposer indulged in  Fund6 as CA,  CA and vCA for Fund7, CA and Voter for Fund8, and given her experience and plan presented it is highly likely this proposal will be implemented successfully. ", "q1r": 4, "q2": "Recording the number of participants who will be interested in cardano blockchain and creating a wallet for them to make sure that the project is progressing is good. And with wada monitoring and tracking down the progress and success of the project . Using the internet to interact with the participants will also be a good measure to ensure  that the project yield the desirable results. With all the information provided in the proposal ,it is sufficient to audit the progress and success of the proposal.", "q2r": 4, "assessor": "z_assessor_3696", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 12744, "q0": "The proposal plans to make workshops on Cardano to show young people in Ghana the Cardano blockchain an the additional opportunities. One Workshop was held in the past. It showed a great interest from the people on Blockchain and Cardano and many of the participants took part in further activity with Cardano. \nTherefore the proposal clearly matches the proposal. ", "q0r": 5, "q1": "The team has provided some infos. Emelia Safro has much experience. She provided her Twitter and Linked in. The information seems credible. Awura Adwoas twitter shows connection and interest in the blockchain. Afia Owusus LinkedIn link doesn´t work and I don´t find the twitter but the information seems credible because the other have relevant experience. Please check next time for complete information and working links. \nThe budget seems very reasonable. It´s clearly described on what and how much they spend money. \nThere is a clear timeline for the workshops and the rest is also understandable. \nThey need additional funding in the future to make more workshops in Ghana. This is totally reasonable. ", "q1r": 5, "q2": "The roadmap is clear. It was documented detailed. The reader knows what happens and the workshops are explained. \nThe KPIs and metrics shortly described but reasonable. They have one short term goal which is measurable numerically and one long term goal which is imprecise. \nOverall the proposal solves the problem. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 13712, "q0": "The idea about this proposal is to grant youths with great ideas, who can submit proposals that can bring employment and real life changes in their life. This will be done by the organization of a two months workshop. The proposal has already been implemented before in the fund 8 which greatly benefited technical students and hence promoted cardano into a wider range. The proposal talked about the adoption of cardano blockchain to gain opportunities in cardano catalyst Africa. This proposal promotes grow Africa grow cardano and it has already been said too woo in about 150 students which was mentioned by the proposer. ", "q0r": 5, "q1": "The schedule for the two months workshop has been outlined perfectly in accordance to the number of students expected to partake in the workshop. The budget for the request has also been broken down into the simplest understandable form for it to be implemented. ", "q1r": 5, "q2": "This is an upgrade or continuation of a previously accepted proposal which has proven to make impact in the grow Africa grow cardano challenge. The proposer also made mention of a target of 150 students which makes it even more likely to succeed with this project. ", "q2r": 5, "assessor": "z_assessor_3759", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 9976, "q0": "The proposers have justify the the challenges in Ghana about the youth not knowing much,The youth will also know about cryptocurrency and it's uses. about Cadano ecosystem and other block chains and this proposal will help teacher most of the students and will also help to reduce unemployment in Ghana. the youth in Ghana complete school and doesn't get any job to do or work for I think the proposers reaching out to students in Ghana and teaching more about Cadano ecosystem will seriously help reduce the percentage of unemployment rate in Ghana. The proposers could have added or draw out the time of the training will start,on which day, how many times are meeting them In a month, the time the students will be taking lunch, topics to treated in a day, and also include a prize for the best students just to motivate them such that next time they'll come out in their numbers when they hear about any workshop about Cadano. The proposers have also show good and clear I information needed.This is the reason why I think proposal has address the challenge. ", "q0r": 4, "q1": "The speakers or teachers selected to work are people that has the experience and resilience to teacher the youth or students in Ghana about Canada ecosystem and other block chains trading, the working experience from the speakers provided I believe they can help change the lives of the youth in Ghana. It is so true that the u employment rate in Ghana is high and I think the youth will be happy to participate in this great opportunity. This is the reason why I think this is a good proposal to change lives and spread the name of Cadano. ", "q1r": 5, "q2": "The proposer have provided sufficient information  and has also attached pictures of the previous project, the proposers have show their working ethics to help the success of growing Cadano and also to help eliminate unemployment system in Ghana and to get the youth engaged always. Drawn out much information and this is why I think it's a good proposal ", "q2r": 4, "assessor": "z_assessor_3140", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 9821, "q0": "This proposal is a follow-up on an already funded project in the fund8 program. Considering the success of that program with over half of the attendees registering into the Cardano ecosystem, it is necessary for such a project to continue. Awareness of blockchain technology and its opportunities is at a minimum in Ghana and Africa as a whole, and education is a key factor to help arrest this problem. Through outreaches and workshops more youth could be educated about the Cardano blockchain,  getting them to adopt it and scale it up by preaching it to others, thereby achieving the main aim of the challenge, The Fund9 Grow Africa, Grow Cardano, which is about scaling up Cardano adoption into the Future of Africa by seeding and growing in 2022 and beyond. This proposal if accepted and carefully executed will not only address the challenge but provide real life-changing opportunities to the youth.", "q0r": 5, "q1": "Implementation of this project should not be a problem considering the experience and qualifications of the lead, and her team. Previously in the fund8 program, the team is well equipped to handle any kind of issue that may arise from this project. The project plan is well documented with each stage clearly stated. A very reasonable duration time and the target number are clearly stipulated. The budget is fairly reasonable given the current market conditions. Given the success of the previous project, this should be easily implementable.", "q1r": 5, "q2": "The budget demonstrates a high degree of accuracy. The stated costs look very realistic. Documentation will be a key metric in measuring the success of this project, especially for those who register into the Cardano ecosystem. Auditing the progress or success of this project looks very possible.", "q2r": 5, "assessor": "z_assessor_3106", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 1097, "q0": "Ghana youth on boarding outreach 2 is clearly in phase with the challenge grow Africa grow Cardano. It is a project about education and teaching Ghanaian youth about blockchain and Cardano in particular. At the present state in Africa we need to educate our youth about blockchain. Many people and institutions still have a bad idea about blockchains because they've heard of bitcoins as a mean of fraud. \nIn this project Emelia Sarfo we'll manage to inform three hundred students about Cardano and hope to embark in catalyst a few ten of those students. Achieving this goal is important because those tens of students who will engage with the blockchain Cardano are young and full of ideas. They have the potential of disrupting their neighborhood and even the whole region with new ideas implemented on the Cardano blockchain. \nThe only negative point about the alignment of this project is that it's not ambitious enough. As Emelia Sarfo says there's a lot of work to do in Africa. I would have liked a project aiming at opening several hundreds of wallets engaging thousand of students but hopefully this will be for another proposal. ", "q0r": 5, "q1": "Given the experience of the proposer and the relatively small number of students that have to be reached with this proposal, it seems totally feasible. \nWhat must be attained, is the realization of two workshops in different parts of Ghana where three hundred students in total will be informed about Blockchain and Cardano. \nDetails about the organization, the transportation, the reservation of the room, the accommodation, the flyers is correctly budgeted. The proposer was able to build on her experience of a previous project to adjust the budget without over expenditure. \nMy only concern is about where exactly will take place the workshops. It would have been good to already have a precise idea of the schools where they should happen. Unfortunately, it's only now that the proposer will write to four schools and see where to held the event. \nNevertheless proof where given from the previous proposal of the same project, that the workshop where effectively well done. I don't see any reason for not repeating the experience. ", "q1r": 4, "q2": "This project is a follow up on the previews similar project. Therefore we can check the auditability of the previous project to evaluate this one. \nUnfortunately educational project are difficult to evaluate. Phase one of this project was recorded a video that is accessible online but I feel that it's not enough. \nIn order to get a feeling of how many people were really impacted we need something like a form or a listing of signatures, more photos in galleries where we can see and count the number of people present in the rooms. Also it would be good if one or two participants were interviewed after the workshop or the presentation to share their view on it. \nIt is said that students embarked in the catalyst but how many exactly ? where are the link of their profiles. Maybe in their biography on catalyst the could had a little note stating that they registered after a workshop from this program. I would certainly be enough to do a full of activity of the project. ", "q2r": 4, "assessor": "z_assessor_2194", "no_vca": 17, "ne": 4, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 3376, "q0": "The current proposal will have an impact on the Cardano ecosystem as it has already generated some PA, VPA and proposers in the previous phase, funded in Fund-7. It's well aligned with the challenge objective as it's a response to the onboarding, expansion and adoption of cardano by the youth students in Ghana who will learn about it, be able to join and be more active as those who participated in previous session held in June.\nThrough this proposal, the proposers team plans to hold a session in another university in Accra, but to also move to another city in the Koumasi region to hold the second session of this phase. Which is a proof of scalability and expansion. reason for me me to give a 5 stars for the impact.", "q0r": 5, "q1": "With the positive results of the phase 1 of this proposal funded in the Fund-7, the proposers team has proof of success from which they based to submit this one, as a second phase.\naround 150 people attended the first session held in June, among them many who have become PA, VPA and Proposers. Most of those also opened up Yoroi wallets, signs of interest from youth to the project catalyst, but also the blockchain, Cardano ecosystem.\nThe proposers team if formed by people who have been involved in the project catalyst, with various professional background. This allow them to understand how does the catalyst process run.\nThe Budget is detailed and a roadmap clearly established. What would be an incentive to potential participants and may be attract most of them to sign up a Yoroi wallet, would be to plan an honorarium to each participant in ADA that they would stake through their wallets.", "q1r": 5, "q2": "The risks mentioned by the proposers would be around the access to universities to speak about the blockchain as a lot of people have misconception about the cryptocurrencies in Ghana. But they have developed a strategy of speaking to universities responsible ahead of time, and it has worked well.\nFor community tracking and evaluation of progress, the team would have stated the methods used for that, but also list some KPI's that define the outcomes.\nSince I haven't seen this in the proposal is the reason of the 3 stars to this section of auditability.", "q2r": 3, "assessor": "z_assessor_2458", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3438, "q0": "Proposer wants to run workshop sessions in different Ghana regions to attract young people in the country to catalyst and broaden their knowledge in Blockhain. This idea is valid as it tends to increase the outreach of Cardano in this Africa region and so is, exactly because of that, aligned with challenge, answering, for intance, at least one of the challenge questions (\"How do we continue to seed and grow adoption in 2022 and beyond?\") and targeting most of its kpis.\nImporant to say that this proposal is an extension of a previous one funded in F8 and proposers bring good elements of this previous experience to justify the impact and explain the value of it. She points out, for instance, how the students were excited about and brings the number of people who participated in it. There's also a very clear target audience already defined (tertiary students) which is very good as it makes easier both to assess its impact and for proposer to develop a specific communication plan, which is briefly outlined in feasibility section. This target audience is also interesting from a impact perception as the young ones are usually the most receptive to new technologies and will still choose their career path, so, if we can engage these people, its possible the consider an option for their future (an the future of Cardano).\nThe only extra thing that would be nice to see here is the content of these workshops and the acitvities that will be included in it (just presentation or some hands-ok tasks as well? if so, which ones?). This would help to enrich the proposal even more.", "q0r": 5, "q1": "There's a sensible timeline and place and its good that the more supporting acitvities are taken into account, such as publicizing and renting the venue. It's nice also that the events will be face-to-face and online, which helps to amplify its reach. The mentoring  acitviites mentioned could be better detailed though, explaning on what exactly the students will be mentored on (sign up in catalyst? writing a proposal? developing general knowledge in blockchain?).\nAs for the budget, it is broken down well and seeems to cover most of the expensesn, including travel costs, materials and cartering. it also matches the acitvities in project plan.\nRegarding the team, there are 3 people committed with background in marketing Cardano and catalyst, specially in publicizing it, so I guess the main competencies for running this project succesfully are covered. Links to verify the info are also provided. However, one question that is not so clear to me whether the so called \" team of experts\" in the project plan and the \" Resource persons\" in the budget  are the people mentioned here in the team of if they would need to hire other people. Considering the team already has experience with Cardano, I'll assume that no extra people will need to be recruited.", "q1r": 5, "q2": "In the auditability part, proposer mentions some key milestones that will be tracked to assess project success. Number of attendees is also a kpi, as it is mentioned throughout the whole proposal, with a targer of 150 for each session. It's good that the volunteers that will come out of it will be monitored. However, more metrics could be included, as the number of wallets open, the number of people proposing or becoming CAs in next fund due to this project etc, with some target as well. Feedback from these studens could also be measured via a survey, for instance.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4343, "q0": "The idea is too good. It has great practicality. Not only for young Ghanaians but it also has an impact on the country's IT education. The proposal to solve the goal set in the Challenge is \"Grow Africa, grow Cardano\". Specifically here is the dissemination of knowledge of Catalyst, a very famous fund of IOG that provides funding for implementation projects aimed at creating a better world, and Africa is one of the most recognized places in the world. Catalyst funds through proposals. This proposal makes young working people in Ghana aware of blockchain technology and its opportunities. At the same time, it also has the effect of collecting good and novel ideas of young Ghanaians (young intellectuals of society) as a premise to apply in real life. Young people in Ghana have the opportunity to attract and dedicate their brains to the country, which is to contribute to the development of the country. And that is also the great impact of the proposal. The proposal both contributes to Africa's overall growth and benefits the Cardano ecosystem. Wonderful. As such, the proposal identifies a problem that needs to be solved and directly increases the value of the Cardano ecosystem if it is successfully implemented. From this base, I think it's entirely possible to scale and tackle the challenge in the future.", "q0r": 5, "q1": "I was impressed by the rich experience of the proponent (marketer, human resource manager, teacher and mentor, PA, vPA, etc...). Accompanying that, the team members also made their identities clear through Twitter. These proofs give me confidence in the feasibility of the proposal and in the people who implement it. I just want to ask that besides Twitter, do the members join any other social networks (Facebook, linked in...)? Because more citations from different sources of information increase the auditability and feasibility of the proposal. After phase 1, the feasibility of the proposal seems to have been confirmed, next phase 2 I would like to talk about the budget that the team applies for funding. The budget has been broken down into sections and is reasonably targeted at young people in Ghana. But when looking at the budget I infer the number of sessions the team does (workshops, meetings, knowledge gatherings) and I am confused about how many sessions the team plans to do. How many sessions are you planning to hold with the funding of 5500 USD? This has to do with planning and execution. As well as the necessary resources (mainly human resources). What I am wondering is, if the number of sessions is small, will it have a significant impact on young people in Ghana? I will be satisfied if the results of this proposed phase 2 implementation are at least the same as the phase 1 you have implemented before. My view is that if you can organize as many seminars and youth community exchanges in Ghana, the better it will be for the development of the Cardano community and ecosystem, as well as the amount of knowledge. on Cardano, Catalyst will be more transmitted. Regarding the challenge and risks involved, I am pleased with the way you have worded the risk and how to overcome it. It is true that the deployment of Cardano in a continent with a low population still faces many obstacles. I would like to contribute one more risk that is the infrastructure of the conference venue, the quality of the internet connection...is it guaranteed to hold the conference? If not, how will you have a solution to minimize this risk. But I believe that with my enthusiasm, the team can do it. Another thing is that I don't see any mention of the cost of making friends, in both stages: phase 1 and phase 2 do not mention this. I vote 4 stars.", "q1r": 4, "q2": "Auditability has been clearly shown through the roadmap and milestones at specific times of the proposal. I am very pleased that you presented such a specific milestone roadmap. This helps to facilitate auditability. Throughout the proposal is a clear and easy-to-understand description of the problem posed along with a reasonable solution. There's only one thing I'm looking for in the proposal, and that's the KPIs. The team did not include KPIs in this proposal. This may affect the transparency and auditability of the proposal. My advice to the team is to quickly include KPIs in the proposal to demonstrate to the community that the proposal is completely auditable, and is directly open to everyone. . My suggestion: you can completely do your surveys with Ghanaian youth, about the level of understanding of knowledge related to Cardano, Catalyst. From there, filter the data and know how successful it is after the seminars, meetings, and knowledge sessions are over. Finally, you can clarify the details: \"During this phase 2, Yoroi wallet will be opened to the participants, thus addressing the key metrics of the challenge\". I understand the role of the Yoroi wallet in the Cardano and Catalyst ecosystem. But why does the Yoroi wallet resolve key metrics when it is opened? While the Daedalus wallet on the Cardano blockchain platform is very useful and plays a big role? Considering the above factors, I both agree and disagree with the auditability of this proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 11, "ne": 4, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 5362, "q0": "Ghana has 40% of youth population which is sad to see many don't have Idea about Blockchain Technology. As Africa lacks in infra and Tech so many youth cant access easily.\nAs most of youth who have potential and Creativity creating platform and giving opportunity is great idea. With help of Project Catalyst we can make them learn and in Return Cardano will get more creative wild ideas and many get employment.\nAs proposer plans to run programs that reach youth through webinars and workshops about cardano and onboard them into catalyst and create more projects and they get employment and new lifestyle.\nI strongly agree with proposal and It  proposal effectively addresses the challenge.", "q0r": 5, "q1": "As this is follow up project and got funded in previous round and delivered all given targets.\nThe proposer has impressive experince working on all fields and been member of community from long time and delivering all given projects.\nThe detailed plan is given from when it will start and all dates. Onboarding and training 150 members and divided into monthly phases which is also explained.\nThe budget requested is sensible and details given how they will spend and for what they need. All details from required equipment and \nsessions charge for 150 students.\nAs they have enough experience and its follow up project I feel with given experience and plan presented it is highly likely this proposal will be implemented successfully. ", "q1r": 5, "q2": "As proposer already in getting permission stage from institutions in July so we can tell \nits already started . As sessions  will be done in august and number of people attended and its record copy will be provided. same with second session which will be done in September. As number of volunteers entering Cardano will be given It can be considered as KPIs.\nAs number of new Onboarderd people will be provided as it will give more developers and creative artist to community. So with given information provided is sufficient to audit the progress and the success of the proposal.\nI agree with proposal.", "q2r": 5, "assessor": "z_assessor_2702", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}, {"id": 5759, "q0": "The proposal is aligned to the objective of the challenge to speed up the awareness and adoption of cardano and its endless opportunities. This is a great initiative as it has already begun in Ghana to educate the youths on blockchain and its transformative importance. The solution to conduct an outreach to onboard and scale up adoption is a great milestone. \n\nThe youth bloc is the future of blockchain and youth are curious and would like to learn new things in the digital world. This outreach is an opportunity for both students and youth to explore the opportunities in the catalyst ecosystem. ", "q0r": 5, "q1": "The proposal has in place experienced knowledge in the entire blockchain ecosystem and specifically the catalyst. The has organized similar onboarding outreaches and have that edge to deliver on the proposal. \n\nThe milestones and durations for taking off for implementation of the proposal is very easy and clear to follow. The actives are realistic and a replication of same activities would be easy to do so. However, the proposer should consider to identify challenges and success of the first outreach event and amend activities or improve on it for the next event. Though it is an outreach, the locations are different and change of milestones, content for speakers should all be reviewed. \nThe budget is concise but detailed and very much reasonable for this outreach. It shows the proposal could be implemented successfully. ", "q1r": 4, "q2": "Deducing from column of the audibility, there are expected milestones/KPIs to track for progress and success. The proposal however should have shown at least estimated metrics to measure outcome at each outreach event. This could have included X number of attendees at each outreach and a Y number demonstrating preparedness to get onboard. \n", "q2r": 3, "assessor": "z_assessor_2749", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 6582, "q0": "This challenge is about finding ways to scale Cardano adoption in Africa, and this project is indeed lined up to this goal. As it is well known, the younger generations are the future, and therefore they should be taken into account if what we are looking for is Cardano´s expansion through Africa. This is the way to settle the fundamentals so that in the incoming future Africa could “stop being a perpetual follower”. The impact of these workshops is considerable since it does not only impact in the present, revealing a whole new system for those who are unbanked in Ghana, but also it does create a long-term impact which is what solidifies a healthy growth of the Cardano environment. It is clear that the proposer knows where the challenge is and how to add value to the Cardano ecosystem. (Rating given: 5)\n", "q0r": 5, "q1": "According to the previous session, there is evidence that the proposer achieved its goal, so it is fair to say that the team has experience in educating young adults. Regarding the roadmap, which is presented in the proposal, it can be said that it might be a little uncertain, but as the schedule depends on the Institution, it is acceptable. Moreover, the budget is well broken down, though, for transparent reasons, I would recommend slightly more specifications on where these values come from. Overall, the funds requested are accurate in relation to the potential impact on the network.  (Rating given: 4)\n", "q1r": 4, "q2": "Since this project consists of 2 consecutive workshops, there are many ways to measure the success of the event. The proposal does mention its own metrics, related to assistance and a comparison of attendance between the first and the second workshop. This is a good way to realize how impactful was the first session and how much attention it caught. Some other metrics could be related to the number of wallets created after the workshop or the number of people who become interested in the follow-ups that the proposal mentions. Anyways, the way the proposer thinks success in their project looks is deeply linked to Cardano´s main goals in Africa, and so the success of this proposal would be the success of Cardano. (Rating given: 4)\n", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 9875, "q0": "The purpose of this proposal is to create awareness of blockchain technology and its opportunities to the Ghanaian youth. The proposal focuses on tertiary students to educate them about cardano blockchain and the opportunities in the project catalyst. This will be done  by organizing programs like workshops to reach out to the youth with ideas who can submit proposals that create employment. Previous projects like the Ghana Youth Onboarding Outreach was able to bring a number of youth onboard. This proposal seeks to onboard a larger number and reach to youth from other zones outside Accra targeting 300 participants. The proposal will have positive impacts on participants like educating students about cryptocurrency, turning great ideas into business and jobs after acquiring knowledge in the project catalyst, training young people to boost their marketable skills, impacting them with technical and computer skills and opening them up to money making opportunities rather than depending on government after school", "q0r": 5, "q1": "A pre-discussion is being held with various tertiary institutions and secondary schools to have engagements with students. A specific timeline of two months is also given to execute this proposal A detailed breakdown of budget is given which included equipment to hold the workshops, renumeration for resource who'll interact with these students and refreshment for all participants at both sessions. As part of the plans wallets will be opened for participants. A specific timeline of two months was given to execute this project.", "q1r": 5, "q2": "In order to audit the success of this project,the number of participants will be documented both online and physical will be documented. Volunteers will that get onboard will be documented and follow ups will be done after the proposal. The number of people who get to know about the Cardano blockchain and project catalyst and also want to put their great ideas into proposals for funding will be recorded and assisted through coaching and mentoring.", "q2r": 5, "assessor": "z_assessor_3123", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6780, "q0": "I Agree \nRating of 4\nThe proposal clearly addresses the objectives outlined in the challenge and also identifies a problem within the challenge which needs to be solved. The proposal appreciates the fact that most youth in Ghana do not understand the entire blockchain system hence the need to introduce them to Cardano and its related opportunities. The proposal seeks to add value to Cardano ecosystem by at least impacting the lives of over 300 Youth in conjunction with the key metrics of the challenge. With regard to future challenges stated by the proposal, it will be best if official documentations and write ups (introductory letters) are submitted to heads of selected academic institutions for consideration before even presenting a letter to host the program. This to me will enlighten management of various Universities to understand the need for Cardano adoption.\n", "q0r": 4, "q1": "To begin with, Ghana Youth Onboarding Outreach 2 is a follow up on the project called Ghana Youth Onboarding Outreach which saw most of its deliverables completed. The qualifications of the three member team to implement this proposal is good as they are actively involved in the activities of cardano. However, it seems to me that the team to implement the proposal when funded is 5 as stated in the budget and as such does not correspond to the question \"Please provide details of the people who will work on the project\". The budget is a good one but further breakdown should be given on Equipment rentals, Materials and Stationary as the team had gotten a first hand experience of how the projects looks like during implementation stage. The roadmap for proposal implementation is straightforward and does not present complexities.\n", "q1r": 4, "q2": "The information provided is enough to audit the progress of the project. However, clear indication of a tool for measuring (eg. Project management toll) was not stated. Realistic milestones were provided as to how the two sessions will be carried out but as to who will carry out what activity was not stated.\n", "q2r": 4, "assessor": "z_assessor_2830", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 7386, "q0": "The idea in this proposal is a great one and I must commend the proposer on the amazing project already ongoing. The idea in this proposal clearly aligns with the challenge. The solution to the problem in the proposal is also clearly stated and matches the goals of this challenge. Ghana youth onboarding seeks to bring onboard more youths of Ghana into cardano which will mean having a good number of them as proposal assessors,proposers,VPAs,referrers and other tasks in project catalyst and this to me fits directly into the goals of the challenge. Mass adoption of cardano in Africa (Ghana) simply means good number of youths will be part of cardano and make good use of it's opportunities.since this project is a continuation of an already funded proposal,the impact is going to be much more if funded again because this will help to reach out to other parts of Ghana where people's awareness will be drawn towards cardano thereby promoting mass adoption of cardano in every nook and cranny of Ghana if not all and as such I believe this proposal addresses the challenge.", "q0r": 4, "q1": "I will start with the budget here,I perceive the amount requested to be too much especially for a project that has already been funded and needs continuous funding to keep it going. I would have urged  the author  to look into the proposal again and cut down some costs since there will be other new and brilliant innovative ideas which will also need funding.\nApart from the budget,the experience of the team is a qualified one,I think we are familiar with them in project catalyst from the description given in the proposal,there is no doubt that ,they will be capable of handling this project if funded,a plus to them is that,they are currently undertaking a project which was funded in fund 8. Also, after watching the videos through the links provided by the team,I am satisfied and  all doubts are cleared and I believe if this project is funded, but then on a lower budget as I said earlier, is highly likely to be implemented.", "q1r": 4, "q2": "For auditability,I think the metrics of the proposal aligns with that of the challenge.At the end of the project, success would be measured by the number of new members onbooarded into catalyst, number of youths opening cardano based wallets (yoroi,Nami etc) and also number of youths putting innovative ideas into proposals and submitting for funding. The above metrics were clearly laid out in the proposal.\nThe author also plans to record all the sessions they intend to hold but one thing I expected to see,is where we get to watch these recordings in order to keep track of the project and that was not made known to us, nevertheless, I believe this project is auditable to some extent.", "q2r": 4, "assessor": "z_assessor_2890", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 7626, "q0": "The team has done well and therefore, the proposal clearly addresses the challenge to the maximum and seeks to bring out useful solutions that will address the challenge. This is because a lot of the teaming youth who find themselves in the tertiary institutions do not see the need to be involved in blockchain or cryptocurrency and see it as a rich man's sport for lack of a better adjective. In Europe, America, Asia, and other parts of the world it is the youth who are taking up the initiative, and the old fellow. It's high time we take it to the tertiary institutions in order to remove the blinds and let them see clearly what they are missing which is a project like this. Cardano is expecting Africa to not be a bystander and watch as the rest of the world takes over the crypto craze. We need avenues like these where the young ones have more than enough space to also exhibit and explore what they can do and know.  Furthermore, Ghana Youth Onboarding Outreach 2 has done exceptionally well by getting close to the 200-plus people at all the meetings they made mentioned barring their last conference which will happen later this month. They have also set up a realistic figure of 300 people to which they further want to train on the Cardano Blockchain, Ideascale, and the Yoroi wallet to more people in their subsequent training on Cardano Blockchain. Giving these students knowledge and skills to have something to do for themselves is a very good platform where developers, PAs, vCAs and etc can grow into the ecosystem. ", "q0r": 4, "q1": "The proposer has provided relevant links to members of the team who will help in executing the project if they should receive funding and I think it is highly commendable. The proposer has gone ahead to indicate the timelines of each activity that will be carried out for instance starting in August when tertiary students have returned back to school, up till September when they are about to go back home. This time is important because they will also use that time to teach their friends and family about Cardano and therefore extend the scope of the community at their various homes.  Moreover, the proposer and team from the link presented showed people who know what they are about and can adequately execute the project successfully.\nAlso, the proposer has broken down the budget adequately and highlighted how the cost will be shared across the board, that is it is broken into smaller bits of each expenditure and the cost. Additionally, they mentioned risks that might hamper the smooth progress of the project and it was clearly explained how such risks will be mitigated through organizing a meeting with the school authorities and thrashing out issues in order not to encounter such challenges the next time. ", "q1r": 4, "q2": "The proposer and team have provided a clear outline on how to measure the progress of their project should they be funded.The proposer and team even though they have done well to elaborate how success will look like for instance taking records of participants on the project and taking them through mentorship on how to write winnable projects and being onboarded onto the Cardano ecosystem. Noteworthily, they failed to point out how they will assist the participants over the long haul after they are absorbed into Cardano and also how the community will follow the progress of the project and these participants might not have the zeal anymore for Cardano if they left on their own. They constantly need a system to keep them in the community, else you will lose them. it might not keep Cardano in their minds when you move on to another group and start training them all over again. Systems need to be put into placed to ensure these talented students are brought into the GYOO2 to continually contribute and guide the new entrants.\nThe proposer has also indicated how their progress will be monitored and reported to the Cardano community, therefore, falling short to highlight how the community will receive such updates.", "q2r": 3, "assessor": "z_assessor_2908", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7780, "q0": "This proposal is of a kind and has equally gone a long way in addressing the challenge, \"Most of the productive youth in Ghana are not aware of blockchain technology and its opportunities. Cardano project catalyst education can bring adoption and scale-up through their wild ideas.\" With the steps which are said to be taken to solve the challenge, clearly articulate how it will add more valves to the Cardano ecosystem by onboarding more of the youth in Ghana which can even be of great impact to the country since there is currently serious economic crises. Also, blockchain related activities are seen as a \"scam\" or 419 by most people in Ghana, even some well-educated people too, think so. This proposal am much sure if funded, will help elighted people(Ghanaian youth) more about blockchain which will, in one way or the other, make things easier in onboarding them to the Cardano ecosystem and also, help create employment as well.", "q0r": 5, "q1": "There is much evidence that the team members are of relevant skills and have the needed experience to carry out the implementation of this proposal and also, the risk considered is relevant to foresee to the successful delivery of the proposal since the step taken to mitigate it as stated above, is not bad at all. The budget is reasonable as it properly outlines and is broken down into identifiable items to achieve the set goals. The timetable allocated to complete the work is very realistic and good enough for proper implementation.", "q1r": 5, "q2": "There is clear understandable description of the targeted problem with well understandable solutions addressing the problem showing a proper roadmap with milestones and a time horizon which clearly defines/foresee to its successful delivery.", "q2r": 5, "assessor": "z_assessor_2919", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 7833, "q0": "The Proposer idea is to create MORE awareness (as a follow up proposal)\nof blockchain and technology and its opportunities through Cardano project Catalyst education.  This awareness is intended to be created by organising outreach programmes to safely onboard more youth with ideas in proposal writing leading to life changing employment. \nClearly,  it's stated that, this proposal is a follow-up on previously funded proposal under fund8 and of the insightful successes are shared here.\nThis Proposal is mainly about how to scale Cardano adoption into the future of Africans by seeding and growing in 2022 and beyond.\nHere, the scope of the workshop is widen or expanded as 2 Regions in Ghana are chosen  Greater Accra and Asian to Regions to hold the workshop s.\nMajor chalkeof refusal in granting permission by Tertiary school authorities as a result of misconceptions blockchain  may be likely to encounter. Mitigation measure to this challenge is stated here.\nThese contributions strongly addresses the Challenge. ", "q0r": 5, "q1": "2 months plan for outreach programme is stated. Detailed timelines and activities are spelt out.\nBreakdown of the proposed total budget of $5,500 as against previously funded budget of $4,000. The increase in new budget has ironed out as a result of increase in transportation cost as well  as additional Regions of about 5hours journey  chosen as one of the avenues for the workshops. \nHighly competent , experienced and enthusiastic team in Cardano/WADA  activities in persons of Emelua Sarfo -project lead, Afua Owusu-CATH and others host and Awura Adwoa, blockchain ambassador .\nLooking at detailed budget,  Programme with competent team behind, am of the view that,  the proposal will be implemented successfully. ", "q1r": 5, "q2": "Clear metrics in measuring proposal progress are stated as, \nEarly seeking of permission for avenues for workshops,\nrecords of physical/online/volunteers\nand records of new onboarders  etc\nWhat to look out for as successes are,\nCoaching and mentoring for proposal writing and funding will be assisted , more developers will be raises etc\nInformation provided is sufficient for the audit of the proposal. \n\n", "q2r": 5, "assessor": "z_assessor_2927", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 7886, "q0": "From the information I have examined within the proposal, The Ghana Youth Onboarding Outreach 2 plan does successfully address the challenge of growing Africa and Cardano and meets all criteria. The proposal clearly outlines a problem that needs to be solved in the challenge; the most productive and bright youth within Ghana are unaware of blockchain technology.  The proposal clearly states how this plan will bring value to the Cardano ecosystem; it will onboard youth from Ghana who will either use the blockchain or become developers on Cardano. There are key metrics in which the effectiveness of the plan can be measured, which in this case will be number of new wallets and developers onboarded onto Cardano. It is also clearly stated how the project will sustain itself; the proposer intends to have future rounds of funding to ensure the success and continued impact of the project on the Cardano Ecosystem and the Africa Continent. Bringing more people into blockchain will give citizens within Ghana Access to the financial instruments which they so desperately need, and will also add jobs to the local economy through the opportunities blockchain presents economically. This all leads me to strongly believe the project addresses the challenge quite successfully as this will have a big impact on growing Cardano and Africa.  ", "q0r": 5, "q1": "I strongly believe the proposer will effectively implement this plan successfully. The skill and experience of the relevant team is listed, as well as evidence of the first onboarding outreach the team carried out, which is documented in a YouTube video and partnered with WADA. The proposer understands what is needed to successfully carry out the plan as they have done this before and this current proposal is to continue their project of onboarding Youth in Ghana onto Cardano. The plan entails everything from educating about blockchain to onboarding onto a Cardano wallet.  The project has the full cooperation of local authorities which will ensure the smooth implementation and continuation of the onboarding program This was the only risk to the project and has been accounted for by cooperating with the local government and educating them.  The budget that is required for the proposal to be effective is itemized and clearly listed. Everything from equipment to refreshments is accounted for. Technical aspects and knowledge required for this proposal to be a success are taken into consideration; there are team members working in catalyst, the Cardano ecosystem, as well as an educator who will help with the onboarding lectures.  ", "q1r": 5, "q2": "After reviewing the proposal, I strongly believe that the proposal provides me with sufficient information to assess the progress towards the goals that are trying to be achieved. The proposal has clear metrics that can be used to measure the success of the project. These metrics include number of students and wallets onboarded, as well as the number of students that put in their own proposals. The proposal identifies a problem that has a clear solution to it that can be used towards measuring its success; blockchain is not very well understood and under adopted in Ghana. Boosting blockchain adoption through education and onboarding is an effective way to solve this problem and implement a solution. The proposal does have a social media channel with its partner WADA where the last onboarding outreach results were shared, the proposal intends to share the progress in this same fashion, once the results are recorded once the outreach program has concluded. All outreach sessions will also be online, so the community can follow along and observe the sessions this way as well. ", "q2r": 5, "assessor": "z_assessor_2933", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9301, "q0": "After reading the proposal, I see that you guys are actually organized and quite successful. It is a good thing to organize outreach programs to engage more young people with submitable ideas that can bring jobs and real life changes in their lives. built. Your group also came up with the same risk that I thought when I read the project idea that higher education institutions refused to grant permission to hold seminars for students due to misconceptions about blockchain in Ghana. I agree with your risk-taking approach, which is to talk to the authorities about the opportunities associated with the Cardano project catalyst, and that blockchain is not just about bitcoin transactions, it's about major misconception among Ghanaians. You should have time to ask for permission long in advance so that if successful, you will need time to prepare for that event, for example, security issues, network connection technical issues, presenters. ..", "q0r": 5, "q1": "\"The detailed plan of the 2 months of networking events is clearly stated. The Proposal only gives an overview, not too specific, the Proposal can provide more details about the content of the program, such as the definition of blockchain, the application of blockchain, The benefits of the ecosystem. Thai Cardano...\nThe team consists of 3 experienced people with the profile link attached right below. I wonder if with the 3 of you, are you overloaded with work? I think there should be more people to support each other in the process of working.\nThe budget breakdown shows the cost of the venue, meals, keynote speakers all in detail. The total budget of $5500 is reasonable for a 2-month event.\"", "q1r": 5, "q2": "In the proposal there is a work progress metric for the audit mentioned like the availability of the ledger to keep the attendance measure; the number of people attending your event. I think you can record videos to post on social media sites and social media interactions; YouTube video viewership is also a way to measure project progress, you should show it with numbers like The specific number of attendees is estimated numerically.... I find the details quite complete to gauge the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9762, "q0": "The problem described in this proposal is aligned with the challenge: Grow Africa, Grow Cardano. There is no doubt that the challenges preventing Africa from being a Cardano adoption leader rather than a perpetual follower needs to be addressed and tackled.  Ghana an African country located in the west is not an exception to this problem. \nIn the wake of the economic crisis the country is currently facing, there is the influx of unemployed young people. Most of the productive youth in Ghana are not aware of block chain technology and its opportunities. Cardano project catalyst education can bring onboard more youth with ideas who can submit proposals that can bring employment and real life change in their lives through outreach educational programs.\nThe proposal is a follow on of the Fund 8 Ghana Youth On boarding Outreach Project,  of which the first workshop held to educate the youth to know and adopt Cardano block chain and gain the opportunities in project catalyst brought into the community 152 participants out of over 200 registered.\nThe proposed plan of seeks to be achieved through education and outreach in the Greater Accra and Ashanti Regions of Ghana in selected tertiary institutions in these two regions. \nThe metrics listed are good indicators of evaluating the success as the number of participants to be on boarded after the two-outreach programs would clearly indicate a great potential Cardano/Catalyst knowledge spread and market expansion among the youth in Ghana and the African continent to enable them tap all the opportunities the community comes with.\n", "q0r": 4, "q1": "The proposal provides evidence of relevant skills and experiences needed to implement the project giving the successful implementation of the Fund 8 Ghana Youth On boarding Outreach Project\nThe individuals who will carry out this project are experience Wada community advocates who are working or are already performing tasks for the Wada community hence bringing on board experiences in the Cardano/Catalyst system. \nThe budget is outlined clearly and broken down into identifiable deliverables as is reasonable to achieve given the experiences of the under budgeting done for the Fund 8 Ghana Youth On boarding Outreach Project. It offers a realistic timetable to complete the work in two months for the achievement of the project set successes as: increased number of students and graduates who are going to learn blockchain and bring out great ideas such as information technology talents which they did not even know they possessed, knowledge of students and youth about cryptocurrency in the country and the continent as a whole. These students and graduates would also be preview to ideas that can turn into business and jobs after getting knowledge in Project Catalyst through the workshops and the training of young people in marketable skills to boost their chances of escaping poverty thereby reducing their dependence on government for job after school education.\n", "q1r": 4, "q2": "There is clarity in the description of the issue of knowledge of Cardano market expansion among the youth in Ghana and Africa as a whole. Although there are risks associated to these, the proposal proposes a solution on solving it.\nThe road map engaging school authorities for access to the students through engagement and education is well laid down. The metrics chosen are good indicators for evaluating the success and impact of the outreach programs. Thus, the number of people(youth) who will be educated through the Cardano block chain and project catalyst and who will want to put their great ideas into proposals for funding will be taken and assisted through coaching and mentoring to bring ideas into reality to positively affect their lives. \nThis will project Cardano as the leading block chain in Ghana and Africa, thus bringing in more developers who will grow and bring change in the ecosystem.\n", "q2r": 4, "assessor": "z_assessor_3093", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6799, "q0": "To foster adoption and awareness of Cardano in a developing region like Africa, there's need for huge education and effective mentorship. Education fuels interest and as such, the proposed solution intends to provide an organized outreach program.\nThe proposed solution is targetted at people from Ghana, where there'll be even onboarding of youths on an exclusive two months workshop solely to explore Cardano, it's benefits and the vast opportunities it presents to a developing economy like Africa.", "q0r": 4, "q1": "First of all, the project is an ongoing project which has been funded in a previous funding round and team provides satisfactory progress/success detail of the previous proposal which show some degree of commitment and trustworthiness of the team. These proposal however follows thesame fashion as the previous one but targetting a different audience with an expectation of impacting atleast 300 Ghana youths (Which is a more larger milestone compared to the previous set target). \nThe proposed budget is objectively fair and reasonable and i have confidence on the team that they can implement the project effectively.", "q1r": 4, "q2": "Provided with a definite and concise roadmap, reasonable and realistic timeline (most of which has to do with direct participation/involvement of the onboarded community), auditing the project seem possible and easy. Furthermore, there are relevant metrics mentioned and which can be used to evaluate success of the project.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 13810, "q0": "Design a strategy to outreach and safely onboard Ghana youth into the Cardano blockchain technology are certain steps to expanding our Community horizons and nurturing our Developer Ecosystem variety and worth. This proposal effectively addresses the challenge of growing the African Developer Ecosystem and thus growing Cardano Community. Helping Ghana youth to strengthen with real life changing opportunities might be really groundbreaking for our Community goals and can draw in a wide variety of newcomers that will approach our problems from different angles. Getting Ghana's student environment to know the ground rules of Cardano blockchain technology will open up a whole new world of solutions and challenges in tackling poverty and socio-economic injustice. Empowering these young entrepreneurs with intellectual and economic resources might change their actual real communities.", "q0r": 5, "q1": "This proposal is the continuation of the first Ghana Youth Onboarding Outreach project which is proud to share their 200 registered students. The enthusiasm shown by students inspired the team to design this second course. Given the already achieved success by this experienced team it is highly likely this proposal will be implemented successfully, taking in account they know the groundfield they are working with and the Cardano Catalyst dynamic and functioning. Plan presented in the timeline and budget breakdown seems consistent and clear for an efficient implementation. It is also to highlight the value of continuously working on a solution problem for our Cardano Community as this is the only way to make real transformation and achieve our goals. ", "q1r": 5, "q2": "Number of registered students and applications is sufficient to audit the progress and success of the proposal although it might be interesting to share with Cardano Community feedback surveys where we can get to zoom in into Ghana students' challenges and impressions. This kind of quality data can be so fruitful for our internal dynamic. It can also be interesting sharing some audiovisual content in a strong social media strategy in order to expand exponentially Cardano Catalyst outreach and widen our horizons and opportunities of drawing in a wide range of newcomers. Auditabilty might be efficient with the information this team has already delivered and as communication channels are already set up, Community shouldn’t find any hurdles in this field. ", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}], "solution": "Organize outreach programs to safely onboard more youth with ideas who can submit proposals that can bring employment and real life change in their lives. Two months' workshop to be organized.", "experience": "Emelia Sarfo is a CA for Fund6, CA and vCA for Fund7, CA and Voter for Fund8, and Entrepreneur, Training Consultant, Community Worker, Over 20 years in Human Resource Management, Over 10 years Marketer, Funded Proposer in Fund8, Proposer in Fund9, PA in Fund 9,Teacher and Mentor."}