{"id": 414894, "author": "djmermoz", "title": "KodiaCoin: Mbongo=>Nzimbu paradigm", "url": "https://cardano.ideascale.com/a/dtd/414894-48088", "category": 26600, "amount": 30000, "description": "Most tokens use production and distribution models based on the scarcity paradigm typical of the Western context. Deep ancestral Africa has an alternative!", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1046, "q0": "The proposal aims to create a token, named Kodia, based on a system rooted in African culture, that will function on a different paradigm than the ones created so far. The token is based on the idea that there should be a web of trust, the co-creators of the coin, who will be vouching for every next person joining, until the web of trust grows, and others will be able to vouch for the new entries. Additionally, the system will have a Universal Dividend, which is a monthly allocation of equal dividends for each coin holder. The dividend will be calculated based on the total percentage of the coin in circulation divided by the total number of users. \nThis experiment will first start locally in Cameroon, where one of the co-proposers, DIT Cameroon is now located. \nFrom all the documents attached and the studies that have been carried out, my suggestion would be to try this new approach and see what results it will obtain. From my point of view, it is definitely a new tokenomics model, that should be tried out in a local environment and observed how it unfolds. Especially considering the fact that the financial system in Cameroon is not in very good shape, from the reports I have read, people are usually not incentivised to participate in financial systems and the entire banking system has been very close to insolvency.\n  As such, I find the proposal to be very much in line with the challenge metrics and could have a very high potential impact, not just on the Cardano community, but on smaller communities throughout Africa, as well.", "q0r": 5, "q1": "I highly appreciate the fact that the timeline for this proposal is a long-term one. The first two phases will each take up to 6 months to implement, namely, the “Consolidation and Refinement” of the tokenomics system in collaboration with local historians and writers and “Design and Architecture”  where the team will be collaborating with its stakeholders on solving the smaller issues that have been identified by then. And lastly, the third phase, “Implementation, Deployment and Marketing” will last for 12 months, which I find to be reasonable considering the task at hand.\nThe budget is split into larger divisions with a dedicated amount required. Perhaps, in this case, the fact that the team hasn’t provided an hourly rate and an approximation of hours needed to implement is better, since the project is spread over such a long period of time, that having fixed tasks entrusted to each person on the team is simpler to implement and calculate. Since I know DIT Cameroon and am familiar with their work, I know they are taking their job very serious, and as such I don’t have any doubt, that this budget drafting is the most appropriate in this specific case. Since I mentioned the team, I can also affirm that knowing part of the team and reading the descriptions and LinkedIn profiles of the ones I don’t, I am confident in their knowledge and dedication, not just to the Cardano Community but to the African one, as well.", "q1r": 5, "q2": "I find the auditability section to be as remarkably well written as the rest of the proposal. The project’s progress is very well described per each phase, with clear documentation and metrics provided. \nThe statements from the success definition are well-grounded in a historic context and offer a prime example of a successfully implemented vision. The current state of instability, both economic and societal in several African countries has been caused by colonialism and the remains of it are what still cause the problems these societies face. Solving even one of them would lead to a very positive effect on its citizens.\nAs such, I find myself agreeing with both the project’s progress and vision of success, and I consider them both to be auditable.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 2706, "q0": "Interesting proposal that looks squarely at its African cultural context to derive its approach, which is very much in line with the ethos of this Challenge. By actually using the token which it creates as a means to question the scarcity/rarity paradigm so prevalent in Europe and the US, and to thereby create a new \"take\" on decentralising finance which is informed by and approriate for Cameroon, the proposal will have a dual impact: it works simply as a proposal, in terms of the token and the project itself, and it also works in terms of its cultural approach - foregrounding African thinking, and centring African culture and history, to shape an African project. The proposal's clear grasp of the effects of marginalisation, and its understanding of the risk of being perceived as scammers, also ensures it will be impactful. The proposal offers a multi-faceted approach and addresses both the Grow Africa challenge, and the strategic goals of Cardano, in a really interesting and powerful way. (The decolonising element of the \"relative theory of money\" team being based in France is a particularly nice little extra in terms of impact, too).", "q0r": 5, "q1": "I like the fact that this team have allowed enough time to think and to integrate their ideas. They are working with a mix of complex philosophical ideas and engagement \"on the ground\", so it's important to the proposal's feasibility that they are not trying to rush this, and their timeline allows them to connect things, and look at both the \"big picture\" and the details of the local context. Their budget looks mostly very appropriate, and it's clearly broken down; and their team clearly have the necessary skills to deliver, and the input from the Relative Money Theory team which gives the theoretical and cultural/philosophical underpinning to the proposal.The only slight issue I see is that given the importance of marketing the proposal so that people understand and adopt it, I'd like to see a little more for marketing in the budget. Obviously the team might not have time or bandwidth to allow \"marketing\" to stretch too much into \"education\" - there's probably a whole separate proposal in that, really - but I think it's inevitable that there will be an element of educating and informing, rather than just marketing, and this might need a bit more resources than what is planned. It's a minor point, though, so not really enough to deduct a point for.", "q1r": 5, "q2": "Very solidly auditable, with a nice and well-thought-out mix of quantitative and qualiataive metrics that will enable the community not only to see what has been done,but alos to get a sense of what effect it is having. I also like the way that the 3 (very different) phases of the proposal are each going to be auditable in different ways and using different metrics appropriate to the work that's being done. The \"what does success look like\" section is incredibly ambitious; but I see that as a very good thing, that the proposal has a sense of itself and its wider aims.", "q2r": 5, "assessor": "z_assessor_2343", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11349, "q0": "The problem the proponent makes is that most tokens use a production and distribution model based on a scarcity model typical of the Western context. Africa's deep-rooted ancestors have an alternative!\n\nThe proposed solution is to create a token with spatial and temporal symmetry that is included in its production using elements of the African model of money concept and the principle of relativity.\n\nThe proponent described in detail how the solution was implemented, and what they would create in the proposal.\nthey also explain the uniqueness of the solution in their proposal\nand the value it brings to the Cardano ecosystem.\n\nThe proponent provides enough evidence with a reference link to how it works, they fully describe the token's formula and operating principle.\nThe proponent also explains who will benefit from a successful project implementation, and how it can be scaled up to address future challenges.\nThe proposal clearly outlines how it will add value to the Cardano ecosystem.\nThe proposal's key metrics and goals are consistent with the stated challenge settings.\nThe proposal clearly presents a plan for the future sustainability of the project.", "q0r": 5, "q1": "The proponent outlines the progress toward the goals with a clear timeline, and the work to be completed in each quarter.\n\nThe specifics of each item being completed within a specific timeline, stating what will happen at each stage, who will do it, what resources are needed, the stakeholders involved, and what is to be done. generated at each stage shows that they are fully prepared with the resources and capabilities needed to complete the project.\n\nThe budget has been clearly outlined, and broken down into identifiable and reasonable items to achieve the stated goal.\nand it would be great if the proponent could include a contingency budget to fall back on in his proposal if it is significantly affected if the price of ada drops significantly after receiving a payment.\n\nThe proponent provided details about the identities and experiences of the people who would be working on the project and included the job aspect of the proposal that each would undertake.\n\nIt would be nice if the proponent could provide links such as your own group's websites and social media, their profiles on professional associations, and public display sites. their previous work in catalyst or other places for the community to refer to.\nWith our experienced team and detailed description of all the list of goals to accomplish, I agree that there is a high probability that this proposal will be successfully implemented.", "q1r": 5, "q2": "Metrics are specified, and the information that the proponent gives, such as the progress of the project, and the desired outcome, is listed in easy-to-understand detail.\nA roadmap with clear milestones and timelines for success is outlined in detail.\nWell-thought-out metrics and achievements determine the success of the proposal.\n\nA clear, easy-to-understand description of the targeted problem can be measured against the proposed results.\n\nProponent have listed what they hope will happen at the end of their project as a direct result of what they have done.\n\nClearly stated solutions are easy to understand and effective solve problems with measurable definitions of success.\nThe proponent has also made public channels such as YouTube, wed, links, related documents accessible to provide regular updates to the community to check the progress of the project. \nThis proposal provides me with enough information to gauge progress toward the stated goals. I completely agree.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 15004, "q0": "The proponents do a great job of taking us from the current problem where most tokens have a production and distribution model that contains a lot of bugs. They cite, in extensive explanations, what these problems would be and how the creation of a new token will support projects in the locality of Cameroon, circumventing the aforementioned problems and increasing the adoption of Cardano's technologies on the African continent. They comment on how the African communities are organized and how the token would be designed to promote the connection and strengthening of the initiatives of different groups, thus allowing greater accessibility of the inhabitants of the country in question to our blockchain technologies. In other words, the proposal will benefit Africa and Cardano at the same time, thus meeting the objectives of the challenge. Although it is a complex idea, it is explained at length, so there is a lot of confidence in the impact.", "q0r": 5, "q1": "Regarding the script, I think that in terms of detail, this part of the proposal is very good, but speaking of temporality, I would like more specifications. The phases have a very long duration, for example 6 months. What would happen to each of them? It is possible to have a partial view of the development process, due to the absence of more details on the time schedule issue. The $30,000 requested in the financing is even well divided, but some parts could be more detailed here. For example, why would marketing cost $2,000? How would this publicity campaign be carried out? Finally, in terms of the team, this part is very good, I would say the best part of the topic. We have several details and also the linkedin profiles of the professionals involved, which conveys a lot of confidence.", "q1r": 4, "q2": "Auditability is average, we know some information that would be monitored, but we don't know how it would be studied and how this information would be passed on to our community. Even if the proponents say what is expected for each phase, it would be necessary for them to make it clear how this information would reach all members of the Cardano community. Would it be via telegram, gitbook, miroboard, after townhall...? The same is true for final success, as with measuring progress, the final results are quoted (they could be more detailed) but we don't know in what way this scenario would be provable and palpable for us. Research needs to be carried out, raising qualitative and quantitative data about the consequences of the project.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15112, "q0": "The team proposes to create a new token that does not follow in the footsteps of every other coin in the block. Instead, it proposes to take the relative theory of money and apply it to the reality in Cameroon. The basic concept is something like this: you make an initial investment, get certified by five existing members in a web of trust and just by living and breathing your existence creates new money into the system. This gets spread around the community in a way that the members' share of this “universal dividend” balances the wealth gaps and keeps purchasing power the same, even if the total number units of money in the system increases.\n\nIt is a system that probably works best in a local environment where people can meet one another. In fact, they must meet to get certified. This poses some limits for scalability but the team still has big ambitions: “This project is at the core of liberating Cameroon and later west and central Africa in general from French financial colonization through the CFA.” Ousting a fiat-currency is no small feat. The team is dedicated to this fairly long-term proposal where just the MVP in Cameroon is planned to take 24 months. Should it prove a success, they can reach out to Central African Republic, Chad, Republic of the Congo, Equatorial Guinea and Gabon, as well as in Benin, Burkina Faso, Guinea-Bissau, Ivory Coast, Mali, Niger, Senegal and Togo.\n", "q0r": 5, "q1": "I went through the video materials (https://youtu.be/kmuzCWNFLtg) and read the proposal thoroughly. It’s based on solid theory and could definitely work as one of the solutions for a much fairer society. The team seems solid and capable of making this happen. However, “this” is a bit undefined. Most of the proposal focuses on describing the issues with the “traditional money” (including most of crypto) whereas the plan itself and budget remain vague and generic. Even the title is not really explained. What is Mbongo? How about Nzimbu?\n\nThe ask is “only” $30,000 for a duration of 24 months. What exactly is that money going to be used for remains a bit of a mystery, however. Time-wise the plan provides broad strokes. First six months are spent on refinement and localization. Second six months are for design and problem solving, resulting in writing a whitepaper. The remaining 12 months are reserved for implementation, deployment and marketing.\n\nTo increase the feasibility of the plan, it would make sense to collaborate and exchange ideas with communities that have been around for a while (e.g. https://duniter.org/) and who have similar ambitions. It is mentioned that the ‘team behind the relative theory of money’ is eager to work with them, but there are no specifics mentioned what this collaboration will entail and how close-knit the cooperation would be.\n", "q1r": 3, "q2": "The leading indicators (number of documents, trips made or advertisements) are rather unimpressive. The main outcome is the number of people joining the network (Web of Trust). There are no goals set for these, which is a pity because this lack of concrete numbers and road map makes the proposal sound a bit utopian. Unfortunately the auditability section is not outlined very well.", "q2r": 2, "assessor": "z_assessor_2156", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a token that has spatial and temporal symmetry incorporated into its production process using elements of the African paradigm of the notion of money and the principle of relativity.", "experience": "\nWada Cameroon Hub DITC developer team,\nLocal researchers in monetary co-production\nWada marketing team\nSupport from the Relative Money Theory team\nKimuntu School\n"}