{"id": 416543, "author": "theartbanker", "title": "Cardano Community Center Cape Town", "url": "https://cardano.ideascale.com/a/dtd/416543-48088", "category": 26600, "amount": 100000, "description": "South Africa has no real-world education and training venues bringing South Africans together to learn and develop with Cardano, yet South Africa is the 3rd largest economy in Africa.", "f6_no_assessments": 24, "f6_rating": 4.763888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 1651, "q0": "The proposal aims to found the Cardano Community Center (CCC), in Cape Town - South Africa. This centre, according to the proponent, will develop a series of activities, including for example free education on Cardano, NFTs and Blockchain; a comprehensive teaching curriculum with experts that will help local people understand what use cases Cardano may have in South Africa; in addition to several other activities, such as “Events Hosting / Exhibitions / Announced Training Sessions / Awards / Other Cardano-Related Events (meetings)”. This all aligns perfectly with the specific objectives of the challenge, since here we are seeking to finance projects that can benefit the African population, presenting the possibilities of income and work that involve the various technologies of our ecosystem. I notice that in this specific case, a portion that will be greatly benefited will be the artists, as several topics about NFT will be addressed (What is an NFT, not just a JPG, and what is the value / How to open a wallet / How to mint an NFT / How do I get my art on Cardano / What are drop sites / What programs do I use / etc). The proponent argues very well why such a center should be created in Cape Town: South Africa is the continent's third largest economy, yet the unemployment rate in the country is estimated at approximately 46%. In other words, it is a place with a lot of potential, but currently suffering from the unemployment crisis, and the existence and activities provided in this community center will certainly present work opportunities that the local population may not know about. The proponent also states that there are no places where people can turn to get guided, oriented towards blockchain technologies. Certainly, too, the community center would bring many benefits to Cardano, I believe that these interventions would generate a new wave of active members to our community, increasing the number of Ada being bought, sold and delegated; greater participation in Catalyst projects, by people from the fields of technology, law, accounting, design, etc.; an increase in the number of CAs and later on VCAs in this location… In short, a greater participation, in short, of this specific population in the Cardano community. The proponent points out some problems that may arise with the development of the community center, and also how they could be mitigated. In addition, he explains in a long and detailed way several of the activities that would be developed there. Overall, he believes that in terms of impact, the proposal is perfect, aligning very well with the proposed challenge.", "q0r": 5, "q1": "The proposal roadmap is satisfactory, activities are divided based on months and numbered sequentially, but I believe that a greater detail of each activity would be beneficial for a more specific understanding of the development process. For example in month 1, we have several activities proposed, one of them being “producing marketing material and starting a campaign”. It would be interesting to understand how the attention of the local population will be drawn, since people correspond to the core of this project (what is a community center without a good amount of people, right?). It would be interesting to understand how stakeholder and community engagement would be done. The details get more superficial as the months go by (we see that the amount of activities listed for month 4 and month 5 is lower than for month 1, for example). I would like the same level of specificity to be maintained throughout the script, as we can see at the beginning: “Month 2: Improvements/Staffing, Design, Complete drawings/plan for design and fit-out of the chosen space. This may include refining plans for painting, signage, carpentry, lighting, audio, furniture, and other equipment, Procurement and Fitout, Complete procurement and fit-out work, Hire staff, Training gurus x 1, Service x 2, Cleaning and maintenance x 1\" etc. The following parts, budget and staff, provide us with very basic information. Starting with the budget: the total amount requested is very high and is divided superficially. For example, $35,000 would go towards location costs such as rent, security deposit, utilities, renovation, etc. How much would go for each part? Which place would be reserved, would the rental price be too high? How many years of rent would that money cover? How would $31,200 be split between two full-time employees? How many months would they work, what would their work routines be like? For the marketing part, $12,800 is reserved, but this amount is also not well explained, despite the fact that the proponent divides this part into some smaller parts (Videos, Short Documentary, Twitter, Discord, Traditional Online and Print Media). Finally, thinking about the team, we know who is involved, their names, roles and linkedin profiles. However their descriptions are very brief, we don't know much information about their CVs. In my view, it would be important for more details to have been given, more examples of previous work, how they relate to Cardano, why they are considered experts (in certain cases) and so on. In general, the feasibility is good, we have the necessary information to build a general notion of the 3 topics; but, especially in the last 2, more detail would be necessary to have a more solid understanding.", "q1r": 4, "q2": "Progress can be measured by many KPIs, as the proponent cites: “Total number of CCC visitors per week, New wallets signed up per month, Number of NFTs minted by new artists, Completed surveys submitted, The number of positive comments (or overall rating) comments, via Yelp, etc.), Number of followers on social networks, Number of events held”, among others. Two comments that I think are pertinent in this case would be, in addition to the aforementioned quarterly reports on open source, would we be able to provide tangible feedback to the community more frequently? It is said that a newsletter will be made, but we don't know the content that would make it up or how often it would be published. So, I was in doubt, when reading this part of the proposal, if the proposer would also include how the behind-the-scenes activities would be developing, what is behind these numbers, for example. However, I think he's taken a lot of care and attention in this part, we know how very detailed how various aspects of progress can be measured. We also have to consider that our roadmap is detailed enough to cite activities in chronological order, and from there we already gave a good idea of ​​what the development process itself would be like, the work routines. So, as much as there was a little doubt about whether these different types of information would be provided, confidence is passed that we will have many updates on the project. A suggestion I would like to make is: set a social network so that updates are posted at least monthly, it would also be great if the feedback from the local community is collected and taken into account during the continuity of the project. Speaking of final results, success would be seen as creating an operational model for CCC (Cardano Community Center), a business model that can be replicated by other African countries; and also with the local CCC becoming a meeting point for members of the local Cardano community, and being a place of visit for other community members visiting the city. Everything is well exposed in the excerpt “Success is proving the concept, with open-source evidence speaking for itself. In turn, creating the first sustainable operating model for Cardano Community Centers into a replicable business model to be deployed across Africa and potentially the rest of the world, etc etc”. In my opinion, it lacked that more study was suggested in relation to how the teachings supported there influenced the lives of those involved. What were the changes observed after the studies, artists started to produce CNFTs, tech people started to participate in Dapps projects, people in general started to participate in Catalyst, would the local population be acquiring more Ada? In my view, the audibility is good, small adjustments would be necessary for it to become ideal.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 12924, "q0": "The proposal floats the idea of establishing the Cardano Cape Town Community Center to facilitate the participation of the Cardano community, building an environment for learning blockchain and cardano knowledge. The idea made a lot of sense in Cardano's development in Africa. The implementation of the idea of bringing Africans together to exchange knowledge about Cardano/Blockchain is in line with the Challenge. The proposal has implications for the Cardano community in South Africa to increase user expansion and development. Users are infused with knowledge such as about NFT, How to open wallets and use ADA, are instructed to create NFT works, build Dapp, their projects on Cardano. With the purpose of being completely free when implementing the proposal will make people more interested, more research purposeful. Cardano Cape Town is a space for learning and experiencing the art of NFT. Participants are connected to each other through conversations that exchange knowledge, learn and research on blockchain that will create a growth for the Cardano ecosystem. The challenge given is that it is necessary to ensure the right vacancy and recruit the right candidates, the proposal already has a method to solve its challenges, it is reasonable under the current conditions. The main risks associated with the success of the proposal raised by the author are financial issues, actual conditions and the covid-19 situation, in order to implement the proposal, the author needs to take more reasonable measures to minimize financial risks, Such as calling for support, setting up a risk fund, Covid-19 is a global influence, so there should be forms of transmission to users such as livetream, videos, documents.\nRating: 4", "q0r": 4, "q1": "Having TheartBank as a support unit before the proposal came to Cardano was an important factor in the success of the proposal. TheartBank promotes Artists, The Arts and combines with other initiatives such as The Monet Society to create an educational curriculum that is represented on TheartBank's Wedsite and on Twitter. The team has provided all the resources necessary to implement the proposal, members of the group have experience in Cardano, Maketing, NFT, event management, etc. The advantage is that the local (Capetonian) should be well aware of the customs and conditions at the place where the cardano Cape Town Community was founded this is what is remarkable for the successful element of the proposal. Hr sources have clearly divided the work done so that the proposal is done well, the information about the member is introduced on LinkedIn. The roadmap of the proposal in 1 year is reasonable to show the advantages and ways to implement the proposal successfully when the plan is divided into small parts by month and can operate steadily from the 5th month when funded. The budget table is detailed and complete for each category the required amount accounting for 20% of the capital for challenge is enough. Proposed spending on site rent, purchase of necessary equipment is specified amount. The team has resources to fund monthly research that minimizes the risk posed by ADA fluctuations. \nRating: 5", "q1r": 5, "q2": "The implementation roadmap of the proposal clearly has clear milestones for completing each part of the work, the process of implementing the idea is completed in a monthly time. Indicators/KPIs for accurate audit: Number of CCC visitors per week, number of new wallets registered per month, Number of NFT molded by new artists, Number of events held, Number of projects initiated, etc. published on Wedsite, however, the wed address has not been given and there are no reports on the progress of completion during the preparation stage to make the audit easier. In general, the measurement indicators of the proposal are adequate, adding ways in which we can see that the proposal is being implemented according to the roadmap, for example: Wedsite address to be able to provide metrics, stored on GitHub. \nRating: 4", "q2r": 4, "assessor": "z_assessor_3514", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12606, "q0": "The proposer have been clear about the relevance of their proposal to the funding challenge. These Cardano professions have only recently emerged as more and more people learn and dedicate themselves to the field. There is potential for many new jobs for the African community. I am very impressed when you analyze the current space and access conditions in Africa, even though these are not articles. Professional research papers but it shows you've invested a lot in research.\nThe organization of exhibitions and awards is very suitable for the community to access NFT works, thereby understanding Cardano better because of its attraction. I like that you try to develop CCC into a go-to gathering place, that minimizes the constraint because most people are overwhelmed by new technologies, so let them have different perspectives through communication between individuals. multiplied by the individual. Every artist takes time to get used to, and it's easiest to throw them into a place of knowledge sharing, education, and social/cultural exchange where they can both absorb and create freely.\nI don't understand why this wasn't set up earlier. Too in tune with the wave of African proposals. I believe the attention to Africa continues to grow, I have seen many high quality startups showing a huge interest in developing Africa. We need to balance that with education, education and more education. It's for education on how to submit a strong proposal.\n", "q0r": 5, "q1": "Thank you for providing detailed information on who the project is in command of, and how their qualifications and experiences can give the voters ease of mind that the funds, if awarded, will be put to capable hands. The proposed scenario is very good, it determines which activities will take place in which months of the year. Although not the most detailed scenario, it is enough for us to safely understand its development. project will take place. I have no further comment on this part of the proposal, as I think the information provided is satisfactory. Financially, I think the amount requested is reasonable given the scope of the project, and is fairly straightforward to understand how it will be used.\nThe progress of the project is continuously reported through the Cardano community through blogs, newsletters. The given product roadmap is not impossible for the team's level as the Team is very experienced in regards to the development of this project, and all team member background information is provided level is very clear. TAB is currently spending $25,000 on content creation and research, training staff as Cardano instructors. The amount requested and the hours provided are reasonable to carry out the project as described. So this project has a very great chance of implementation.\n", "q1r": 5, "q2": "This is the kind of audibility we want to see in proposals, Key metrics to measure are given in great detail, the proponent also sets certain goals and how they are made clear to everyone, although I find the goals to be not specific, like the ending poverty in all its forms everywhere, this is a very difficult thing to achieve due to budget and human resource constraints. There are many previous proposals on Africa that set similar goals, but most of them were not funded. I hope you will have a new and breakthrough view. And you should give some numbers to measure for everyone to imagine like the minimum total number of visitors to CCC per week to be considered satisfactory. After all, I still agree with the project and expect you to systematize this information on an official website with enough pictures and videos of activities like many projects have done.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 11379, "q0": "Education is a significant factor for the all around development of individual and society. It should focus on the literacy rate in the country. As south africa is facing the problems with the education and training systems a hub is created which includes cardano enthusiasts , newcomers, enabling community engagement and education. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "After assessing the feasibility section the information given by the proposer about the detailed plan and experience in the work is quite convincing. The timeline includes ongoing operations everymonth and reporting the updates. The roadmap includes 50-100 new users per month and positive mainstream media coverage. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The key metrics dedicates CCC for the progress as open source information. The road map includes positive mainstream and media coverage on 30+ outlets and release of operational guide. The budget breakdown is outlined clearly and reasonable to achieve set goals. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 11351, "q0": "The problem proposed by the proponent reflects the fact that South Africa currently does not have any actual educational and training places to bring South Africans to learn and develop with Cardano.\n\nData costs on the continent are among the highest globally, and connecting to wi-fi can be problematic. so there is little space specifically for Africans to gather, share, learn and develop the opportunities and capabilities offered by the Cardano ecosystem.\n\nHowever, South Africa is the 3rd largest economy in Africa. According to Trading Economics, South Africa is the most developed country in Africa and this is an opportunity to prepare Africa for a future of Cardano adoption on widespread.\n\nso one solution proposed by the proponent is to create a venue where artists and creators, Cardano curious people, newcomers as well as Cardano enthusiasts from around the world can gather, get free education on Cardano, NFT, and Blockchain, facilitate the introduction and recruitment of artists into the ecosystem.\nthe proponent has specifically listed all of the educational content to be trained, indicating that he or she has the full technical knowledge and skills to successfully implement the proposal.\nthis helps to bring the community together with professionals that will facilitate adoption and engagement with Cardano in Africa.\nI really appreciate that in addition to being a permanent training facility, they have also developed the space as a dedicated venue for showcasing Cardano art, culture, and technology.\n\nThe proponent clearly demonstrates how they will add value to the Cardano ecosystem with specific work attached with a link, image, and full public project website.\n\nThe proponent clearly outlines the risks that may be encountered during the project implementation and clearly presents some solutions to optimally deal with the risks.\nThis proposal is in line with the stated challenges.", "q0r": 5, "q1": "The project implementation progress is listed by the proponent in detail in terms of time and tasks to be done for each month.\nwith full data, evidence (references, links, ..) the media.\nThe proponent knows, and determines, the number of team members required to implement the proposal.\nthey have a clear and flexible assignment of specific tasks for each member to ensure project implementation on schedule.\nThe team is professional, experienced people with full information and can be contacted.\n\nI really appreciate the fact that the proponent is transparent about the information, experience, and links of each member involved in the project implementation, which makes it easy for the community to verify.\n\nThe budget is clearly outlined by the proponent and broken down into identifiable and reasonable items to achieve the stated objective.\nNote that one additional issue is that the proponent needs to specify an additional contingency budget in case unexpected events may occur.\nGiven the foregoing, I believe there is a high probability that this proposal will be implemented successfully.", "q1r": 5, "q2": "The ability to audit and measure the success of the proposal is high.\nThe proponent has specified all the required plans for the project in detail.\nA roadmap with clear milestones and timelines for the successful implementation of the proposal has been outlined in full.\nWell-thought-out metrics/KPIs help the proponent to determine the success of the proposal.\nThe success of this project is to create the first sustainable operating model for Cardano Community Centers into a scalable business model for deployment across Africa and possibly the rest of the world.\nCCC becomes the de facto meeting place for the Cardano community in South Africa and the destination for all Cardano members worldwide.\nthe proponent has launched publicly accessible channels to provide regular updates to the community to check the progress of the project such as Twitter, YouTube, Instagram, website...\n\nThis proposal makes Cardano an open-source project and attracts more developers, so it meets the criteria of the challenge.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11286, "q0": "This proposal aims to bring South Africans to the Cardano Community Center (CCC) Cape Town to learn and grow using Cardano. The central idea of ​​the project aligns with the objective of the challenge. The Cardano Community Center (CCC) Cape Town receives free education on Cardano, NFT and Blockchain, to facilitate the introduction and recruitment of artists into the ecosystem. Obviously with the success of this project great benefits will happen, increase the number of new users in Africa joining Cardano, increase the number of wallet openings, increase the number of developers, increase the number NFT is created by new artists. This project can scale, impact locally as the Cardano Community Center (CCC) Cape Town is a place where newcomers as well as Cardano enthusiasts from around the world can gather to connect together. The group raised the challenges and risks when implementing the project. But they provided detailed solutions to reduce risks and address challenges. This proposal is well-written and up to the challenge.\n", "q0r": 5, "q1": "The proponent provided a detailed plan to complete the work. The project implementation process took place over 12 months. How the project will be implemented will be outlined by the proponent on a monthly basis. Tasks such as: location selection, social media, space improvement, procurement and equipment, hiring, Soft launch, launch event Artist and programmatic documentaries NFT will be held for the first 4 months. From May onwards educational activities, events will be held. In my opinion, it is a reasonable and convenient plan to implement the project. The budget is clearly outlined, detailed and reasonable enough to overcome the challenge. The author presented a budget to set up and run the Cardano Community Center in Cape Town for 1 year. Expenses for location rental, staff, equipment purchases, marketing, I find very reasonable. I am very impressed with the team members who proposed. The CCC team has over 100 years of experience establishing and successfully operating community and industry-driven venues and events. The information and experiences of the members provided in Linkedin are fully verifiable. With the above factors, I find this project feasible.\n", "q1r": 5, "q2": "The community will measure the project's progress through the CCC website. All project metrics and progress will be visible as open-source information. We determine the success of the project through key metrics such as the number of CCC visitors per week, New Wallets registered per month, the Number of NFTs minted by new artists, and the Number of NFTs displayed at CCC every month,... Everything is simple, clear, and easy to understand. The perception of what would be the success of the project was described in a way that was consistent with everything that was presented and the team had a clear goal of creating the first sustainable operating model. for Cardano Community Centers into a scalable business model for deployment across Africa and possibly the rest of the world. I think this proposal can be successfully implemented.\n", "q2r": 4, "assessor": "z_assessor_3235", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10813, "q0": "This is a very interesting idea, it solves the goals of the challenge. Artists all want to learn how to enter the new digital economy, and they need to learn about the new toolset that helps them digitize their art and market globally. CCC will be the go-to gathering place, showcase space, and training facility. This is definitely a place that will help artists in Africa get to know and understand the opportunities and possibilities of the Cardano ecosystem. Besides, the proposed team also clearly recognizes the risks and challenges that exist and they seek to solve them. That is absolutely essential for the project to be successful.", "q0r": 5, "q1": "I am very satisfied with what the author presented on this topic. A detailed roadmap, clear budget expenditures, and experienced and qualified members. They know exactly what they need to do to make this project a success. The tasks are scheduled on a monthly basis and it is amazingly detailed. Proponents also try to provide a detailed budget sheet. The human factor also gives us a lot of confidence in the project. They have many years of experience related to the project and Cardano. ", "q1r": 5, "q2": "With a detailed plan established, we can easily test. A variety of metrics are available and can be viewed on the CCC website. At any time we can measure the success of the project through the KPIs of the team. Overall, the proposal is very clear and testable. ", "q2r": 5, "assessor": "z_assessor_3196", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10782, "q0": "It is easy to understand why there are so many projects to create gathering places for communities in Africa, given that this continent has potential for the blockchain sector in general and Cardano in particular. And here, I appreciate your team's special focus on education and people's artwork.\nYour proposal does an excellent job of describing the situation in Africa and the factors that will allow Cardano Community Center to prosper there. Education is priceless, as the expression goes. You guys have created a beautiful space where knowledge is freely shared, and art is inspired. I can see a great community developing through the worthwhile activities that CCC offers to everyone, especially artists and creators.\nAs a result, your community initiative aligns with the challenge and may even grow over time. I can easily see how seriously your team took this project, as evidenced by your successes before deciding to create this proposal. The secret to development at its best is always having a base and a way to gauge success. I appreciate you teaching me that with this proposal.\nRegarding the anticipated difficulties and how to overcome them, I have no criticisms of this part of yours. Your team's dedication and careful planning demonstrate that you are totally capable of resolving issues when they emerge in the future.", "q0r": 5, "q1": "You'll still be in good shape in this sequel, just like the whole Impact section above. You establish a realistic timeline for finishing the assigned tasks in a fair manner, in addition to creating a clear Budget with bullet points for spending on activities. You demonstrate a reasonable strategy in both what you intend to achieve and how it should be done. I am particularly struck by and applaud your team's seriousness because you share details on the ongoing social and training events you have scheduled with the Monet Society. There is also a workload management approach (most of the proposals I assessed were lacking, they just answered \"yes\" and forgot to state this).\nThe TAB team is too committed and enthusiastic about this project. I sense the expectations of your team when you all invest all of your funding in the building of CCC and do not use the money to reimburse for the time you spent developing the CCC teaching materials. In my opinion, investors will have enough confidence in your project's future success with a talented and motivated crew like yours.\nBy the way, it looks like there was a typo problem. “The CCC team has over 100 years of combined experience…” I am a bit confused about the number 100, so please explain more clearly.", "q1r": 5, "q2": "First of all, let me just state that your team entirely deserves the 5 points I award you. You continue to be serious until this point and make the proposal as detailed as possible. With key metrics to define whether this proposal will be effective based on what number, the information in the proposal is sufficient to assist the community in monitoring and evaluating the step-by-step process of carrying out the provided plan. You have also clearly characterized the project's success, and I sincerely hope that the replicable business model you have envisioned will soon come to pass.\nBut I believe your proposal will be even stronger if you provide a few notes on the quantifiable figures you desire for the predetermined KPIs. Just an estimate, so investors can use it as a benchmark for tracking the project's development.\n", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10538, "q0": "This proposal aims to broaden the Cardano adoption rate in Africa by making a Cardano Community Center in Cape Town. South Africa is a huge economic center in Africa, and it is essential to have a presence there. The author offers 2 very interesting aspects that will help Cardano's presence in Cape Town. Firstly, it is important to have a real-life location, which willboost the feeling of community, and boost efficiency and output, as it is always more efficient when people meet face-to-face. It will help reach the technology disadvantaged communities, as the center will provide computers and wifi. Though real-life engaging, fun and dynamic events, they can attract people who are currently completely unaware of crypto and cardano. Having a location where people can productively create and ideate will help bring innovation, and dynamism to the cardano ecosystem. The second very interesting point the author offers is the teaching courses. This proposal offers comprehensive courses and learning ressources about blockchain technology, Cardano, NFTs, and digital art making. It is important to have a big community, but it is equally important that that community is educated, and has the opportunity to learn and contribute in the most meaningful ways possible. For these two reasons, I think this proposal answers the challenge perfectly: preparing Africa for the future through building a solid and trustworthy community, and teaching the necessary technology for Africa to keep contributing to the Cardano ecosystem for the years to come, with innovation and dynamism. ", "q0r": 5, "q1": "There are three key components that will determine if this proposal will be successful. The first component will be the competence of the team leading it. The combined exprience of the team members is very impressive. They offer a team of local residents, who will understand the culture and connect with the people of Cape Town. They seem knowledgeable in the crypto space, so they can guide newcomers effectively. It is also very nice that they have members with extensive experience in event planning and managing, to deal with the everyday operations of the center. Having an artistic advisor, they will be able to build an attractive brand, with an identity people will be able to connect to and enjoy. I think the team is very well rounded and ready to take on this project entirely. The second component that I think will help the team succeed, is their very detailed financial breakdown, preparing a budget for location, staffing, hardware and marketing for an entire year. I think the budget is sufficient and reasonable for the first year, enabling the kickstart of operations. The research the team has shown to put into location, marketing and staff give me faith they will make the correct choices. The third component that worries me a bit, is the sustainability of this project. There is not yet a detailed plan on how this community center will generate enough revenue to be self-sufficient after the initial launch, and keep the quality of operations for the years to come. Will the community center hold crowdfunding events? Will the members of the center contribute financially for the upkeeping of the center? Is there a budget set aside for potential slow operations, where no revenue is directly generated by the center? Overall, I think the team and the budget and planning will help this project be a success, but I have reservations on the sustainability, and would like the authors to research more into that. ", "q1r": 4, "q2": "The authors of this proposal offer various interesting metrics to track progress: frequent updates through their blog, a 12 month report, and number of participants and their contributions to the cardano ecosystem. This will be sufficient to track progress, and compare it to their given timeline to see if everything is going according to schedule. To track success, we will be ableto see community engagement on their social media platforms, and reviews of the center on google or yelp. Success will also be seen from the amount of contributions the members make to the cardano platform. Overall, I think this project is very auditable. ", "q2r": 5, "assessor": "z_assessor_3189", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9724, "q0": "South Africa is one of the countries with the leading economy in Africa, but there is still no real education and training venue to bring people to learn and grow on the ecosystem. Cardano. Therefore, “Cardano Cape Town Community Center” is an important project that can contribute to bringing Cardano to many localities around the world, which is one of the big goals of the Cardano ecosystem. CCC will be a hub for Cardano enthusiasts, a gathering place, engaging the community to help more people know about Cardano, as well as create educational values. This project is suitable for the challenge of “Grow Africa, Grow Cardano”, the project scale is relatively large to affect communities in Africa as well as around the world.\nCCC is a place where artists, creators as well as novices, Cardano enthusiasts from all over the world can gather. CCC is a free educational platform for Cardano, NFT and Blockchain in general, to facilitate the introduction and recruitment of artists into the ecosystem. The team has a specific lesson plan about the training program, helping everyone to have in-depth knowledge. In addition, CCC aims to develop the space as a professional venue for showcasing Cardano art, culture and technology. Dự án thành công cũng mở đường cho việc áp dụng và phát triển ở nhiều địa điểm khác trên khắp Châu Phi cũng như trên toàn cầu.\nThe research team was provided with the risks and formulas, as well as the appropriate methods. The main risk is the revenue-generating business model to ensure continuity of operations. In my personal opinion, the project can also apply additional income stream generating models, such as selling soft drinks, coffee, books, important documents, related display products. Cardano… In addition, CCC can also rent out the hall, for suitable external training units. This latter can contribute to generating additional revenue to maintain operations.\nThe project's challenge included finding a suitable position and recruiting the right candidates. Personally, in finding a position, the Team needs to work with 5-10 local real estate agents specializing in office rentals, come up with specific topics for them and then select them. choose method. the most viable solution among the many proposed alternatives. Regarding recruitment, I think that priority should be given to those in the Cardano community, of course still having to meet the professional requirements.", "q0r": 5, "q1": "The team provided a specific product roadmap, managed workloads, as well as a project implementation schedule. In my personal opinion, the Team should come up with a longer-term roadmap, and should put the Timeline according to the work, so the project will be bigger and have a more roadmap.\nFunding amount is $100,000, 20% of Challenge Budget, this amount is suitable for project development. The amount is consistent with the explanation, the explanation is clear and detailed every little part.\nThe team is people with a lot of experience in the field of expertise. We can easily check each person's information through linkedin. However, the project should clearly divide the work, divide each department and who is in charge of that department. The team has members involved in other projects, proving they have a lot of ideas and are very competent.", "q1r": 5, "q2": "The team has come up with key metrics to measure, which are displayed on the main CCC website, which we can easily check. However, the Project has not yet provided specific KPIs.\nThe success of the project is reflected in the creation of the first sustainable operating model for Cardano community centers, from which the business model can be replicated to other localities across Africa as well as across the world. all over the world. all around the world.\nThe team made two proposals in two separate categories, but the proposals are closely related, supporting each other.", "q2r": 4, "assessor": "z_assessor_3087", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9403, "q0": "This proposal effectively addresses the challenge. The Proposer realizes South Africa has no real-world education and training venues bringing South Africans together to learn and develop with Cardano though South Africa is the 3rd largest economy in Africa. Therefore, the writer proposes to establish Cardano Community Center (CCC) Cape Town as a hub for Cardano enthusiasts + newcomers, enabling community engagement, value creation, and education. The CCC will provide access to a curriculum filled with training materials and teaching to go with it. Bringing together the community with experts will facilitate adoption and engagement with Cardano in Africa. Clearly, this solution help raise the value of Cardano. This model can be broaden in scale. ", "q0r": 5, "q1": "The proposal has logical plan covering activities for 5 first months, including planning and design, Marketing; Improvements/Staffing; Opening; Event; Ongoing operations and making reports. Participants into this proposal have good experiences in operating this model. They once co-sponsored events including a recent NFT event in Barcelona with The Art Suite. In addition, they worked with artists to apply NFTs to their real-world projects, create novel ideas, and turn them into viable business models. These are valuable proofs for the competence of  the participants. Also, the budget is described clearly into items for running the program, including: Location Costs (Rent, Security Deposit, Utilities, Renovation) for year one; Staffing; Hardware for Art Display at CCC; Marketing & Business Development Budget. The writer also consider the risk and gives out the solving method applicable. In conclusion, I agree with the plan drafted out by the writer.", "q1r": 5, "q2": "The proposal is clear. Problem solving is easy to understand. The dedicated CCC website will display all the key metrics and progress as open-source information. This helps supervisors follow the target set initially and mease the success. Key metrics to measure include: Total number of visitors to CCC per week, new wallets registered per month, Number of NFTs minted by new artists, completed surveys submitted, the number of positive reviews, number of followers on social media, number of events held, etc. Success of this proposal is creating the first sustainable operating model for Cardano Community Centers into a replicable business model to be deployed across Africa and potentially the rest of the world. I evaluate this criteria at mark 5.", "q2r": 5, "assessor": "z_assessor_3052", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9106, "q0": "The proposal states that Input Output (IOG) has been operating in Africa since 2017 and Cardano has a passionate community across the continent. However, there is little space specifically for Africans to gather, share, learn and develop the opportunities and capabilities offered by the Cardano ecosystem. In particular, South Africa is the most developed country in Africa but the unemployment rate is high. Cape Town lacks a place to bring Africans together to learn and grow with Cardano. Therefore, the proposal presents the idea of setting up a Cardano community center in Cape Town so that artists, creators, Cardano lovers, newcomers as well as Cardano enthusiasts from around the world can have can gather and get free education about Cardano, NFT, Blockchain. CCC aims to be both a gathering place, a space to showcase Cardano art, culture and technology and a permanent training base in Cape Town. Thus, the proposal is completely consistent with the goal of the challenge. The proposal also introduces risks and challenges when implementing the project and also provides measures to minimize it.\n", "q0r": 5, "q1": "The project is expected to be implemented in 12 months, with a specific implementation schedule for each month such as: month 1, the location will be selected, lease contract signed, marketing; month 2 design for leased offices, equipment procurement, staff hire; month 3 Soft Launch, Operations, refinement ; month 4 Grand opening and debuting Artist Onboarding Documentary and NFT Art show; From month 5 onwards, there will be regular activities such as training, events, community support, making manuals, documents and continuously reporting to the Cardano community via blogs and newsletters and 12-month impact report. This roadmap is quite specific, clear. \nHowever, I don't see the project team stating what training 6 days a week is training, what knowledge and content. If the training content like the impact section mentions is education about what NFT is, how to open a wallet, mint NFT, how to get works on Cardano, what is Drop Sites, how to use the program, the duration is 6 days a week in 8 months will be too much.\n\nThe estimated cost for the project is 100,000 USD, of which the costs of the location is 35,000 USD, the lecturer is 31,200 USD2 x Part-time staff, cleaner and maintenance 5,000 USD; Hardware for Art Display at CCC 16,000 USD; Marketing & Business Development 12,800 USD. \nI find the cost percentage for the location costs and 2 full-time lecturers to be high compared to the cost of the whole project. The project team should not rent a place for the whole year, should cooperate with universities to organize training. The team should also consider training content 6 days a week. Without a lot of training content, hiring 2 full-time trainers would be a bit of a waste.\nIn addition, the budget is 12,800 USD for marketing and business development, but it is not detailed how many videos and movies to produce, how many events to organize, the size of the event, etc. It is difficult to assess the reasonableness of this expenditure item.\nThe project staff consists of 6 people, including someone who is a Cardano expert, someone who is a marketing expert, who is an expert in NFT, marketing, event management…, and therefore, the project staff are suitable for the requirements of project. The community can find out information about personnel easily via linkedin. This information is reliable.\n", "q1r": 4, "q2": " The project provides key indicators to measure the progress of the project such as: Total number of visitors to CCC per week, new wallets registered per month, number of NFTs minted by new artists, completed surveys submitted, number of on social media, number of events held, number of newsletter subscribers, number of projects initiated…These indicators will be displayed on the dedicated CCC Website so it can be easily controlled by the community.\n", "q2r": 5, "assessor": "z_assessor_3021", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7834, "q0": "In this Proposal,  the Proposer intend to build a Cardano Community Center in Cape Town where Africans can gather, share, learn and develop opportunities and possibilities provided by the Cardano Ecosystem. \nThe  center will be a venue where artists and creators, Cardano curious, new comers as well as Cardano enthusiasts alike from all around the world can gather and receive free education about Cardano,  NFTs and Blockchain. \nAgain, it will create space for showcasing Cardano art, culture  and technology in Cape Town.\nHolistically,  the building of the CCC is to help artists, Cardano enthusiasts to learn how, yo enter new Digital Economy and so the need so, the need to learn new tool set (Cardano Blockchain) that will help them digitize the art and market globally.\nThe main challenge identified that be faced in this Proposal is, securing a suitable location with favourable rental agreement for a period, easy renewal and future purchasing options which may lead to difficult interviewing and employing the best fit candidate for the C CC locally. However,  a clear solution to mitigate these risks are provided. \nHaving state all these facts, I strongly believe the proposal effectively addresses the Challenge. ", "q0r": 5, "q1": "5 months timeline for planning period is detailed below by the Proposer. \nMth.1 - location  & design planning\nMth.2 -Improvement/staffing planning \nMth 3 -Opening & Lunching \nMth.4 -Event launching and\nMth.5 - provision of training materials.\nProposed budget of $100k is stated with detailed breakdown and to list few are,\nLocation,  labour hired &maintenance- $71.2k and Hardware for Art Dusplay at CCC totalling  $16k etc.\nTeam employed for the successful implementation are, Aaron Arfman, Dee Bishoff, Murray Walker, John Patrick Vab and few others with several years of experience in artistic advisory, event planning and managing etc.\nTaking into consideration of information on the budget, team experiences, planning and what is already in place,  am of the view that, the likelihood of the proposal being implemented is very high.\n", "q1r": 5, "q2": "Dedicated links like YouTube n CCC website and others in tracking the progress of the proposal will enable us to total net of visitors ho CCC per week, NFTs marketed by new artists, pact students research on artists Onboarding  etc are stated. \nWhat success will look like is clearly stated as making CCC become the de-facto meeting avenue for Cardano Community in S/A and a destination for all Cardano members worldwide. \nThe information above justify the auditability of the progress and success of the proposal ", "q2r": 5, "assessor": "z_assessor_2927", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7629, "q0": "The problem described in this proposal is closely aligned with the challenge. The team has done a great job by putting the proposal at the right challenge. Moreover, the proposal identifies a problem within the challenge which is the need for the people of Cape Town (South Africa) to have Cardano Community Center Cape Town (CCC) which will facilitate the education process of Africans, to conceptualize and innovate in an ecosystem that affords them the opportunity to be trained in a structured curriculum about everything Cardano.\nThus the proposal clearly adds value to the Cardano ecosystem through education, training, skill development amongst a whole lot. Surely, not a lot of people know of the new digital economy and how to take advantaged of it as artiste to deal in NFTs, nor developers to make apps and the rest for Cardano. \nThe proposal is able to scale to address future challenges and it is also able to plan for the project's future sustainability since it is something that is a source of livelihood for four strong willed persons. The proposal also captured key important metrics/KPIs under the campaign brief.\n", "q0r": 5, "q1": "The proposer has provided relevant links to members of the team who will help in proper execution. The proposer knows the type and number of team members required to implement the proposal. The proposer provides evidence such as references, links and websites of relevant skills and the experience of the people who are needed to implement the proposal. Taking a look at some of these people one can see that they have a combined 100 years experience in the sector which means they know what they are doing.  As it is not their first rodeo, this means they will be able to execute the project should they be funded which I think is highly commendable. The proposal also outline the milestone by providing duration with which the project will be for funded. \nThe budget is clearly outlined and broken down into identifiable items. The budget is reasonable to achieve the set goals should they also be funded. \n", "q1r": 5, "q2": "The proposer and team has provided clear outline on how to measure the progress of their project should they be funded. Looking at the total number of visitors to CCC per week, new wallets registered per month, number of NFTs minted by new artists\n, completed surveys submitted, amongst others. \nMoreover, the success story will come from the ability to create the first sustainable operating model for Cardano Community Centers (CCC) in Cape Town (South Africa).\nIn summation, the proposers have been able to provide a well-thought out Metrics/KPIs that define the success of the proposal, and also they have been able to provide a clear understandable description of the targeted problem that can be measured against the proposed outcomes, also provided a clear understandable and effective solution that addresses the problem with measurable definitions of success and more importantly, an accessible public channel for delivering regular updates to the community for auditing progress. This in my opinion is an excellent proposal if it is funded.\n", "q2r": 5, "assessor": "z_assessor_2908", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7290, "q0": "This is a good idea and I think it effectively addresses the target formulas. It is about creating a space that is both a gallery of Cardano art, culture, technology and a center of Cardano learning at the same time. A place where artists and creators, who like Cardano, can go there to exchange, chat, enjoy, experience quality NFT artworks, while being licensed to participate in activities. knowledge training class centered around Cardano and NFT as training experts, The General Classroom is flexible for everyone, from beginners who don't know anything about Cardano, to those with a basic knowledge If you want to learn in depth, share the lectures and correspond to the material. for example when learners are taught about NFT, then after teaching learners have enough knowledge, and themselves can create their own NFT products on Cardano, in my opinion that is a great thing, it helps benefits for work and art closer together, removing barriers for an artist or for non-techies to help them create their own art products, it can be said to bring Cardano closer to the world. everyone. In particular I find it quite positive that newcomers and experienced Cardano community members can connect with each other, engage in conversation and build community, interact, network and grow. More strongly, Another difference of the proposal is that the gallery is opened in Cape Town a tourist city and the tea service is the legislative capital of South Africa. I think it makes a lot of sense to launch this project, in a location compared to other Africa, where Blockchain is known, the information infrastructure is also relatively developed. Fing open the Display here is favorable and creates interest and curiosity among people. In addition, the proposal is also updated to the future business expansion plan, with the operating and process manual published on open source code, I think it will create favorable conditions for the application. successfully used and developed in different points in Africa and globally. Regarding the issue of development, future expansion in my opinion, the goal is worth every thought, to promote the development of local centers that create favorable conditions for everyone, Subject not just an artist, an art maker, it belongs to the characteristics of each locality, we should be flexible to adapt to the characteristics of that local community based on the core idea of ​​being a gallery original display of their art, thus being able to enrich and diversify their digitized products, to be closer and develop better. An example can be a showroom of local products, cultural beauties, and scenic spots through NFT.", "q0r": 4, "q1": "The proponent has provided detailed and complete profiles of each member about the experience and working skills in accordance with the job content of the proposal, the roles of the team members through Linked, instagram. Currently, the proposed team has built an art bank, \"The Art Bank\" has spent $27,500 per month to develop, an amount I think is relatively large to create a foundation as well as a premise for success. The success of the curriculum for the future CCC shows the group's thorough preparation, and determination to successfully implement this proposal. The proponent also gave a detailed and specific plan accompanying each content with specific timelines, preparation work, divided into 4 months with 1 content each month, from Renting includes the selection of locations, contract negotiations, to design, marketing, staffing, procurement of equipment, up to the opening, the release of the documentary about the artist. and the NFT art program, and from the 5th month onwards, the team proposes to continuously report to the Cardano community through newsletters and blogs, which makes it easier for the community to understand what's going on. doing and how to do each to complete it. The proponent also gave specific risks and measures to reduce each of those risks. The required budget is 100000, it is a relatively large number, but the project involves many things and in fact, a lot of costs, moreover as said currently 1 month the team is also spending 27500 to build. development, so I think it's probably compatible with what's proposed. With that analysis I think the proposal is likely to be implemented successfully.", "q1r": 5, "q2": "The information provided by the proponent is sufficient to assess the progress and success of the proposal. The proponent has committed to providing a dedicated CCC website and will display key metrics and progress in an interoperable, free-to-use, open-source, highly reliable, open source format that can be made available to voters. Tri a great trust, can track the audit easily. With open source web development, everyone in the community is free to interact, comment, and critique, through the process it is possible to solicit material that makes the repository stylish. richer, contributing to the group achieving its vision. Clear specific KPI metrics, measured by week and month, like total CCC visitors, newly registered wallets, number of NFTs minted by new artists, number of positive reviews, number of followers on the network etc. makes it easy for the community to track the proposal's progress to success.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6859, "q0": "5 stars\nThe proposal fits the challenge as it aims to spread knowledge about Cardano and attract new participants to the community. \n\nCreating Cardano Community Center in Cape Town would help to raise awareness of Cardano, NFTs, and Blockchain in South Africa to facilitate onboarding and recruiting artists into the ecosystem. Besides, it could give an opportunity for many people to get income considering the high unemployment rate. \n\nMeetings in person with coaches who can pass their knowledge and experience would simplify assimilation of the information for non technical people and reduce distrust to new technologies.\n\n I also like that it's not a one time event but a permanently functioning center which will attract and train artists and community members.\n\nThe proposal provides ways to mitigate possible risks and challenges by employing the best-fit team with the relevant experience to make the startup self-sufficient with a limited budget and onboarding and training staff who will coach the participants. Using existing contacts to search for real estate will allow to find the most suitable variant of the premises and optimal long term rental conditions.\n", "q0r": 5, "q1": "The proposal provides a clear roadmap with monthly milestones which indicates the activities to develop this project.\n\nThe budget looks realistic. The budget breakdown shows yearly costs of rent and renovation, employees salaries and technical equipment. \n\nI find the team qualified and experienced to fulfill the proposal as they have already started artists training, preparing curriculum and content creation investing $25000 monthly. This shows the initiative and far-reaching plans to develop the proposal for future challenges and spread this model to other African countries.\n", "q1r": 5, "q2": "I find this proposal not difficult to audit as the progress updates after completing each task as well as all transactions will be provided in open source on the CCC website. \n\n Public access will give the community an opportunity to track the proposal in time and without any issues.\n  \nKey metrics to measure allow to assess a successful implementation of the project, its developing, growth and impact in the Cardano Community. \n", "q2r": 5, "assessor": "z_assessor_2840", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6101, "q0": "Cape Town lacks a place to bring Africans together to learn and grow Cardano. The team proposes with the idea of ​​taking advantage of the great advantage of South Africa as the 3rd largest economy in Africa, creating value and education, enabling the community, newcomers and enthusiasts of Cardano to come together learn and develop. Suggest a clear, easy-to-understand description. Cardano provides access to a curriculum filled with training materials, demonstrations on how to use the tools, free education... CCC aims to be a gathering place, hosting events, exhibitions Presenting Cardano NFTs. Very detailed solution proposal. The proponent, in addition to explaining what it will do, provides a lot of detail on how it will be done. It is very good that the proponent provided the KPI from the very beginning of the impact analysis. It proves that the proponent has precise goals, knows what he will do, how to achieve the ultimate goal successfully. In addition, the proponent also identifies and establishes solutions to the challenges and risks that may occur when the project is implemented. Show the active preparation to deal with the immediate difficulties and barriers. I think this will be a very attractive portal for artists and art. I believe this proposal can add more value of the cardano ecosystem, diversify the audience and increase the number of users on the Blockchain. It will increase the number of NFTs minted in Cardano. That is, it will bring little benefit to the ecosystem in many ways and achieve the general and specific goals of the challenge.", "q0r": 5, "q1": "The feasibility of the project is very high. Geographically, Cape Town is the legislative capital of South Africa. Besides, South Africa is the most developed country in Africa. In terms of experience. CCC has a team of 100 years of experience. The proposal team has all the strengths to make the project a success. The proposal has a very clear and detailed plan. First about the route. The team has provided their main product roadmap from 2022/2023 onwards, which includes: 50-100 new user introductions, art events, surveys, 30+ media coverage, sales, CCC release and operation manual, digital content. This is followed by a month-by-month implementation schedule and a very detailed description of what needs to be done for the project to come to fruition. We can visualize how and when each job will work. Above the requested budget of $100,000, which is 20% of the total challenge budget. I believe the value is pretty fair given the complexity of the work to be done. However, the cost value is quite high, I think I can still add more details. For example: Regarding cost of location: The cost can be broken down in more detail: How much is the rent, how much is the deposit ... where, for how long... About the budget for marketing and business development. Funds will be divided for videos, documentaries... how much, how many videos and documentaries to release (in each month or throughout the project). All basic feasibility information is available here, but I believe more detailed information can be added in some small sections, to better understand the process. Increase project success and transparency. Regarding the team, the team provided a rather satisfying breakdown of the core team members. The members are all experts, co-founders, advisors ... have many years of experience and skills to successfully implement the project. We know them well and it's good that each member has a link attached. A very positive and important point is having a team member who is a Cardano expert. About the team, everything is almost perfect. In general, a few more details could be added, but the plan of the proposal is very good.", "q1r": 5, "q2": "Translation results The proposal is completely new, but the preparation for the whole project plan is very good. Show that the team is very talented, has the necessary skills and experience to carry out the project. What's amazing is that the team provides KPIs right from the impact analysis section. Detailed roadmap for each job in each month, the budget is analyzed clearly and transparently. Finally on the auditability of the project, the proponent begins by stating what is to be expected. The proponent provides a lot of metrics so that we can easily measure the progress of the project. The dedicated CCC website shows all the key stats and progress. Successful project with open source proof, scalable business model, CCC becomes the de facto meeting place for the Cardano community in South Africa. We know the work is done and in what time period. With this, we can track what the proposal is doing and the successful progress of the project. Because ours are provided with many important details, which I consider a complete and satisfactory set. This is a good auditability.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 7, "ne": 2, "ng": 2, "nfo": 3, "vca_o": 1}, {"id": 4359, "q0": "I appreciate the impact of the proposal because, from the start, the team has clearly shown the impact of the proposal on the Challenge. Specifically, the Cardano community development in South Africa (Cape Town). The team clearly defined the problem to be solved as a gathering of passionate, inquisitive Africans, plus the facilities that needed to be further developed to raise awareness of Cardano and the ecosystem - what was involved regarding Cardano. This proposition is highly realistic because it directly increases the value of the current and future Cardano ecosystem. Not only that, with this proposal, the team can scale up and continue to solve the Challenge in the future (shown in the next Funds). This is a proposal with a good idea, it will bring many benefits to Africa - where there is still poverty and unemployment. At the moment I am interested in the possibility but you continue to do and develop what is in the proposal. Because to spread knowledge about Cardano, develop the economy, and raise the people's knowledge in Africa, takes a lot of time and patience, and determination to do it for many years to come. With such an obvious impact. I vote 5 stars.", "q0r": 5, "q1": "I have read the list of group members attached to the social networking site and believe in them. The members all have experience in Cardano, marketing, event organization... These factors are suitable for the development of the Cardano community in the region. The list has been divided into specific, detailed items into small, reasonable items. For me, this is a very important photo to demonstrate the feasibility of the proposal. In addition, the implementation progress has been specified in terms of months in a year. It would be much better if you could show more about how to implement the proposal over the timelines. The implementation resources are relatively adequate. I wonder if the team can be more specific about NFTs, how many NFTs are going to be released? I support the release of NFT because it is also a way of advertising communication to increase the number of people aware of the proposal. I see you present challenges and risks associated with the implementation of the proposal. I would like to comment on whether the implementation of the proposal is hindered by the local government or some indigenous peoples? Because some places want to develop the Cardano community but are banned by the local government. If that happens, can you present a remedial plan so that this useful proposal can be continued to benefit African countries?", "q1r": 4, "q2": "I do not doubt the transparency of the proposal because the team has fully outlined the implementation roadmap and described the problem clearly and easily. Along with that are many metrics related to the details of the work performed. This proposal is certainly of high value. However, I would like to add the goals that the team wants to achieve when implementing the proposal. For example, how many people do you want to participate in accessing CCC, or how many NFTs are minted? etc... I would like any proposal to be as transparent as yours. Plus, you have the great solution of free education on Cardano, NFT, and Blockchain. This knowledge is essential for the world shortly.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3856, "q0": "The idea of ​​​​the proposal has identified many problems to be solved in this challenge, most of which meet the problems posed by the challenge, but the impact scale is small, with many limitations. limited, only within a certain area with certain conditions. Also, this is a good idea, it has the potential to bring value to the Cardano ecosystem, and the author can make it better, I look forward to seeing this project again in the next Foundations if The project is not Funded in this Fund. South Africa is the 3rd largest economy in Africa and one of the most developed in the world, so the lack of a place for education and training to grow Cardano is a problem for the system. Ecological. need to be remedied.\n\n The solution of this idea is good, it identifies some of the problems of the challenge and the author of the idea argues logically, neatly, and creatively Cardano Community Center (CCC) Solution If Cape Town is successful, it will also spread to countries near South Africa for reference, in addition, it will also create a strong motivation for Blockchain to be developed here.\n\nThe project has a detailed description of some implementation risks, in addition to some suggested solutions by the author to overcome them, but the community needs to be informed for more solutions to these problems. . That risk if the Scheme is funded.\n", "q0r": 4, "q1": "Great when a project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project is aiming for are also very specific and completely achievable.\n\n  The project budget required less than 20% of the total funding of this challenge, compared to the information provided by the project, all expenditures for the project were clear and explained very clearly and transparently. White. The budget analysis table is quite complete but needs more details, in addition, in my opinion, the author should watch out for price slippage, which is when the price of ADA at the time of proposal and the time of disbursement. Consider the project.\n\n The feasibility of this project is quite good when the human resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that it is completely suitable for the project. In addition, the members' identities are easily verified using the links listed above. The scheme is very clear, complete, and transparent. The author of this project, The Art Bank, and colleagues Aaron Arfman, Dee Boshoff, Murray Walker, John-Patrick van Rensburg, David Harris, and Sergecal_One, indicate that this is an experienced team working on this project. . , identity is also easily verified by a reputable link to identify identities such as LinkedIn, or Instagram... for the community to verify identity easily and practically.\n", "q1r": 5, "q2": "Project transparency is very good, this project provides KPIs for accomplishing project goals, all goals are easily measured by the indicators provided by the project, and they are also easily tested in an implementation.\n\nThe scheme has clearly defined success, the information from the scheme shows what is being done and how it is being done and the testing has achieved considerable initial success which is amazing.\n\nBrand new idea information on Cardano platform never received any funding from Cardano ecosystem.\n", "q2r": 4, "assessor": "z_assessor_2489", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3451, "q0": "There's a real problem identified and solution, an in-person place to learn about Cardano and expose NFT art, can potentially address it, at least partially. The proposal is also well written as proposer brings concrete data to support both his claim in problem statement (for instance, one of sources used is the Trading Economics) and why his solution could be a path towatrds solving it (as in the research of the MIT’s Human Dynamics Lab mentioned). Indeed, after pandemic, it is essential to return the real life events in order to deepen connections between people and whatever is being taught. Cardano Community Center team seems to have experience in doing that and the value proposition in the proposal is clear. The risk management part is done well, with good 2 challenges mentioned and risks mitigated. It also explains well what is going to be done in these rented venue for a real life Cardano showcase and learning experience. The only thing it would be nice to see here already, specially considering they already had experiences with such projects, is the business plan that is mentioned and will be available open source later on. It would be nice to understand, at least in a preview/drat format, how they would operate. It's good though that it is already being considered and will be open.", "q0r": 5, "q1": "There's a really nice and sensible plan in place, timeframed and with a good description on the activities. The roadmap is divided by months and it's very nice that a planning phase is considered in the beggining. It's good also that marketing is one of the acitvities mentioned, this is key for this project success. Budget breakdown is very clear, broken down by 3 main costs type: venue, hardware and business development costs. it is very well explained what is included in each of these budget lines and and no salary is included in here for proposers, which they will pay with their own investment, not catalyst. \nIn regard to the team, there are 6 people already committed, with competencies in art, Cardano, marketing and events and linkedin links are provided. The only thing that would be nicer to see here is a bit more explanation on each person background or previous experience in the mentioned capabilities. the roles of each one in the project could be mentioned as well. However, these details dont seem to compromise overall project feasibility and, therefore, my rating is 5.", "q1r": 5, "q2": "There are several good metrics provided that will certainly help to assess project success. There are also good key deliverables in feasbility section and these ones have pre-defined target, which is very good. They will help to track progress throughout deployment, just as some milestones that can be extracted from project roadmap. Proposer mentions also that all these metrics will be available in their website to anyone can access in complement to the business plan, operating manuals and procedures stated in impact part. All these points combined make this project audtiable from every perspective.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 15, "ne": 0, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 3379, "q0": "Cardano Community Centre by its name gives already the meaning of a Hub where people, enthusiasts and cardano lovers may be going to to learn, get trained, read, watch, discuss about Cardano. As a go to Centre, this initiative is in alignment with the challenge objectives. It may also be replicate in other cities and countries, and the impact wll start by being local with possibility to go globally.", "q0r": 5, "q1": "The Art Bank is the organization behind this proposal but it would  also be better to mention few people who are taking the lead on this by demonstrating their experience, background that would prove their abilities to make this proposal succeed.\nAs for the budget, the breakdown in made, but for the staffing cost (full time and part time), there's an amount, but it doesn't specify how long that salary covers. And finally on this, the proposal budget is 20% of the total budget challenge.\nExcept the above few elements, the seems  to have chances to succeed and it's a concept multifaceted with possibility of it being sustainable in the long run as the venue would be able to generate revenue out of the rental service .\nThe proposals team has already approached real estates and identified 3 potential venues for renting, which is in advancement in the process.\nI would suggest the team to also think about the volunteers involvement. As a community Centre, it may be possible to find people with knowledge and expertise who would be willing to offer few hours per week/month freely to train, or help in different ways the run of the Centre.\nI totally support the idea and would like to give a 5 star, but gave 4 because of the few elements I raised above. Also, a collaboration with other Catalyst initiative to be implemented would be great, like within this current Funding cycle, same challenge, there's a proposal that I would think may be important and impactful to unite the efforts: ''Boosting Cardano In South Africa''(https://cardano.ideascale.com/c/idea/419831)\t\t\t\n\t\t\t\n\t\t\t\n", "q1r": 4, "q2": "In order to mitigate the risks, the team talked of getting a best-fitted team which may sometimes be challenging, especially at the beginning, that why make a recourse to the volunteers wouldn't be helpful.\nThe KPI's are well described to show the fila results, while the follow up of progress will be done through the organization website and other social media platforms.", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 2984, "q0": "I agree the proposal meets the goals of the challenge. Adoption in Africa is lacking because of entry points, other than buying and selling cryptocurrency. We need new way of attracting users in Africa and NFT's are one way of doing so. New users to the Cardano ecosystem require different approaches and I do agree with this hands on approach of creating a community center, art NFT's are really about communities and from these communities are larger ecosystem may grow. Use of NFT's can trigger more adoption of Cardano and adoption of other applications within the Cardano ecosystem.", "q0r": 5, "q1": "The team has a great chance of being successful with this proposal, seeing they are coming from different backgrounds and have led other community initiatives provides them with the experience required. I would suggest that they do add more team members who are subject matter experts both technical and non technical. Technical experts who know about the Cardano blockchain as a whole and information technology experts. Experts in the legal realm knowledge of the up and down sides of NFT's, NFT's are a growing industry and are just getting adoption. Real use cases on NFT's have not been realized, the curriculum should be tailored to NFT's from an African perspective, how African can use NFT's for their benefit besides Art NFT's also introduce the concept of utility NFT's. Once African adopt real use case for utility NFT's this would lead to the wider adoption of blockchain, an NFT as Art may not be the catalyst to adoption but if I can use NFT for something more valuable that gives one the appreciation for such technology. This proposal has potential to grow and can be replicated across different cities and countries in Africa, additionally this community center can also be used for developer training/Hackathons and act as a launchpad for African builders to build real world applications for Africans. Additionally this program can also branch out to mobile community center for a more rural outreach, vehicles equipped with everything required to bring such training and initiatives to rural based people who would otherwise be left out because they do not live near a city such as Cape Town more of copy a Doctors without borders approach. the community center being the hub.       ", "q1r": 5, "q2": "The team has outlines various metrics and milestones to be met and measures, it gives and variety of ways to measure success. They will use both on chain and of chain metrics. The website should provide all the audit information being gathered, NFT's should be viewable on the blockchain and different stats about them observed. Followups can be done with different participants to measure the impact and how long lasting it is. One key metric that I would like to see is measuring the number of referrals done by previous participants or community members. This is a clear way to show wider adoption, Africans highly honor a good referral if the community center is doing a good job people will always recommend it. ", "q2r": 5, "assessor": "z_assessor_2380", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13749, "q0": "Implement the establishment of cardano Cape Town Community Center with the idea of facilitating community participation. The idea of creating a learning environment, absorbing blockchain and cardano knowledge, this is a great idea when this is done in Africa. Cardano Cape Town Community Center brings Africans together to learn and grow with Cardano, the idea that fits the Challenge to help the Cardano community in South Africa grow and can be expanded across Africa. The way that the proposal is made is to convey to the community the relevant knowledge such as: What is NFT, it is not just JPG and what is the value? How to open an ADA storage wallet,how to mold an NFT,how do I get my work on Cardano, Drop Sites? And many other programs. Importantly, this is done for free, cardano knowledge, NFT and Blockchain will be easily received. The proposal creates an ideal space for learning as well as sightseeing, experiencing the art of NFT, having connections with each other through community-building conversations. The proposal addressed much of what the Cardano community expected, which was a fitting fit for the challenges posed. The proposal presents 02 challenges in the implementation process: It is necessary to ensure the right vacancy and recruit the right candidates, the team of authors has a good way to solve these challenges. The authors also outlined the main risks associated with the success of the proposal, financial issues, actual conditions and the Covid-19 situation and took appropriate mitigation measures.\nI Rated: 5\n", "q0r": 5, "q1": "Before making the proposal the group of authors had TheartBank promoting Artists, Arts and combined with other initiatives such as The Monet Society to create an educational curriculum this is evidenced with wedsite addresses: https://www.theartbank.io/content/catalyst-proposal And on Twitter. Being supported to implement is a good foundation to expand the proposal, solve the budget deficit when implementing. The team of authors who have the resources needed to implement the proposal include 06 members with experience in Cardano, Maketing, NFT, event management, etc. The majority of the members are local (Capetonian) this is an advantage because they can understand the customs and conditions at the place where the cardano Cape Town Community was founded. . The team's human resources have clearly divided so that the proposal is well implemented, the information about the member is clearly described on LinkedIn. The proposal is carried out in 1 year and the preparation period is 3 months, the actual timetable for completing the work is clear in the first 5 months, from the 5th month onwards the operation takes place in a repetitive sequence with the training 6 days a week. The proposed plan gives a reasonable indication of the advantages and ways of implementation to propose successfully. The authors team has partnered with the Monet Society to provide regular social events and training that have the best conditions for the implementation of the proposal. The budget table is detailed and complete for each spending item with the total required amount of $100,0000 accounting for 20% of the capital devoted to challenge. Moreover, the authors have their own external sources of funding for monthly research, which minimizes the risks posed by ADA volatility. I appreciate the team's budget, which helps us see that the authors are spending reasonably the granted capital.\nI rated: 5\n", "q1r": 5, "q2": "The proposal has given the full process of implementing the idea completed in a monthly period, has a timetable for the training facility, creates events from the 5th month (completed preparation and put into operation). Total number of CCC visitors per week,new ones registered each month, Number of NFT molded by new artists, Submitted completed surveys, Number of positive reviews (or overall reviews, via Yelp, etc.) , The number of events held, the number of projects initiated, etc. published on Wedsite these indicators (website address has not been given). The success of the project with open source evidence creates the first sustainable operating model for Cardano Community Centers into a scalable business model this is what the community assesses when the proposal is completed. We agree with the transparency of this proposal.\nI rated: 4\n", "q2r": 4, "assessor": "z_assessor_3777", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 13815, "q0": "Having a Cardano Community Center in Cape Town will help our community expand and enhance their expansion opportunities. A venue where artists and entrepreneurs can meet and engage with Cardano can help our Catalyst project get closer to a wider audience in Africa, bringing closer in a digestible language basic concepts that could draw in a variety of newcomers. South Africa is the third strongest economy in the continent and yet still Cardano hasn’t invested in developing a physical space where networking can flourish. Creating nodes and a strong hub in Cape Town can help a great deal consolidating our actions and projects in the African continent. It is to highlight the interest in this proposal in the onboarding of artists. They can help us fight against the general reluctance that is usually generated around the blockchain universe in the wide audience. Artists can be the key element in helping us outreach and expand our strategy of development.", "q0r": 5, "q1": "Having 100 years of experience seems to be enough at the time of considering this project funding. According to experience and the plan presented it is highly likely this proposal will be implemented successfully. CCC team knows what they are talking about when they talk about venues although this might not be a guarantee of bringing specific numbers of newcomers into the Cardano Community. In order to target this proposal into that goal, Cardano’s experts involved in the team will do the heavy lifting. The engagement this team shows with the African project of Cardano Catalyst shows that this proposal is just the starting point of a continuous work that will certainly not end in this particular venue. ", "q1r": 5, "q2": "Having the CCC website sharing key metrics and progress in an open source platform is sufficient to audit the progress and success of the proposal. Number of visitors and followers on social media can give the Community a quantity hint to the auditability process. Nevertheless, a quality feedback survey can be of great profit for the Community. Knowing South African impressions towards the Cardano and general blockchain universe might be super interesting for our future development strategies. It might be interesting this wonderful team shares and explores strong channels of communication with the whole of our Community to strengthen our internal dynamics.  ", "q2r": 4, "assessor": "z_assessor_3833", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Cardano Community Center (CCC) Cape Town will be a hub for Cardano enthusiasts + newcomers, enabling community engagement, value creation, and education.", "experience": "The CCC team has over 100 years of combined experience establishing and successfully operating community and industry-driven venues, training centers, and events. Our team has successfully launched and operated venues in several countries, four of them in Africa."}