{"id": 416989, "author": "paulmb", "title": "ISIG-GOMA Cardano Hub", "url": "https://cardano.ideascale.com/a/dtd/416989-48088", "category": 26600, "amount": 12000, "description": "Students in Africa and especially those in the DRC (French speaking) are lagging\nbehind in the development of Blockchain and its usefulness.", "f6_no_assessments": 7, "f6_rating": 4.142857142857143, "videos": [], "media": [], "f6_assessments": [{"id": 4360, "q0": "You are well aware of the current problem of African students falling behind in global blockchain development. And I think that the team's solution correctly identified the problem to be solved, solved the goal set in the Challenge. Specifically, you bring to the student center knowledge about Cardano, Plutus, and Haskell. I think that this work is very necessary for Africa - the continent is facing backward, less developed than other continents. Not only that but this proposal is also needed in all parts of the world. I endorse it because it solves the region's growth problem and it adds value to the Cardano ecosystem. Although the initial implementation has not had much impact on the Cardano ecosystem, if done well in the long run, it will have a large ecological limit impact. Especially, this proposal is aimed at young people, students who have the capacity and still have time to develop. They will be the future masters of the world. So the ability to scale and solve future challenges is there, but it takes time. I have an additional contribution to the proposed impact, that is, you can choose more people to participate in seminars and meetings, not just students. The selected audience here can be people who are interested in Cardano. Expanding the audience will be better for the overall development of the continent and Cardano. I vote 5 stars.", "q0r": 5, "q1": "I was quite relieved to know the number of members of the team that implemented the proposal and the accompanying identity. The team has detailed the link in the social network to clarify publicity to the community and increase the feasibility of the proposal. Being backed by Wada is a good guarantee of the team's credibility, we all know how reputable Wada is in Catalyst. Enough team members to execute a proposal of this size, in terms of the quality of the team's expertise - I find when the members all have good programming expertise, architecture, and engineering skills Pham, etc. I have read the budget of the team in detail, I am quite satisfied that you have a plan to minimize the cost to a minimum. Specifically, taking advantage of available facilities: Conference room, electricity, sound, projector, etc. The remaining costs have been listed. However, I would like the team to list more clearly the payout of the $3000 Hackathon Prize. For example, you spend 3000 USD on Hackathon Prize, so what does Hackathon Prize consist of 3000 USD? My intention is for the team to list more clearly to fully convince the community of the feasibility of the proposal. Regarding the implementation of the plan and the way it is done, I completely agree with the professionalism of the team. You have demonstrated your skill in planning and sequencing. It would be much better if the team explained more about the technical aspects and applied technology beyond just stating the language used as Haskell / Plutus. I am convinced of the implementation risk you have raised. I want you to think about my other question about risk, which is how do you deal with it when students come into the program and find Haskell/Plutus a difficult language to learn and they give up? Is there a way to encourage learning again and is there a way to reduce this risk?", "q1r": 4, "q2": "Milestones have been divided in sequence. When implementing the proposal, I just want to comment that if these milestones are attached to the months of the year to become a roadmap, it will be very convenient for the community, and the PAs will appreciate the controllability more. calculation of the proposal. I recommend that you do so to make the proposal even more amazing. The team is divided into 3 stages to evaluate the success of the proposal. I support you to do that. I consider that as the key metric of this proposal. However, can the KPIs be shown by you? Everyone understands the importance of KPIs (performance evaluation). Why can't I see my KPIs? Hope you will add it to improve the auditability of the proposal. Although there is no KPI, I still have a good assessment of the auditability. What you have stated in the proposal is still convenient for analysis and reporting. I appreciate everything you've done in this suggestion including describing the problem clearly and succinctly and outlining the solution to the problem and its risks.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7292, "q0": "This proposal aligns with the goal of the challenge, as it provides, training and additional knowledge related to blockchain and Cardano, specifically teaching Haskell and Plutus programming. in French, for French-speaking students in the African town of Goma, when out there, blockchain documentation is mostly in English, students who are not good at English are a big disadvantage for them. Their access to blockchain knowledge becomes more difficult, causing them to lag behind the development of Blockchain and its usefulness. Teaching and training in French for the French-speaking community in addition to spreading Blockchain knowledge to them also shows respect for their cultural and linguistic identity to be preserved. In fact, it is really necessary to establish centers in universities for blockchain and Cardano education, especially schools related to information technology, as this is the core workforce to continue to grow. continue to inherit and develop blockchain in the future. However, what I want here to suggest should be more clear and detailed about the vision in the future, in my opinion, the proposed group should be more open to the audience, such as working people.. about the language group, adding more languages. language learning because Haskell and Plutus programming is still difficult to reach for non-English speakers, and the geographical area is extensive in many parts of Africa and possibly globally, as the proposed team has a reach. Looking at it like that, I think it would be more convincing to the Cardano constituency on the issue of future expansion and development of the proposal.", "q0r": 4, "q1": "The proponent presented a plan with the stages of development of the idea and corresponding to it a number of tasks and content of work that make up these stages. This means that there are no specific timelines, which makes it difficult for voters to grasp and understand the processes. Normally, a complete task consists of three basic things: when to do it, what to do, and how to do it. Here only phase 1 mentions the time, but it is not specific and content to do anything, while the other stages the only information voters have is what to do, there is no timeline. specific time to carry out the work, so it is difficult for voters to visualize the progress of the proposal. Therefore, I expect the publisher to carefully consider and improve the above content so that the plan becomes more complete. As for the requested budget of 12000 USD, I think it is quite suitable for the level and scope of the proposal, given that the team has outlined the challenges and risks that may be encountered in the implementation process, and to limit the risk that money is needed, the proponent has also included in the budget table, which is refreshment and motivation money for attendees. Regarding the personnel profile, the proponent has also provided full information about who they are and the relevant work experience that can meet the challenge of successfully implementing the challenge through LinkedIn. I think the most positive thing is the partnership with the WaDa team, because WaDa is a great team, with a lot of experience, active, has many proposals related to Africa development and is supported by the Catalyst Cardano community household. So along with improving the things I said above, I think the proposal is highly feasible.", "q1r": 4, "q2": "Although the proponent provided a roadmap as phases with implementation items, it did not provide a clear timeline for achieving the results, And the method by which voters can track progress, possibly is through Web sites, Blogs, social networking sites, meetings with the constituency community. As such, I think making it difficult to audit voter tracking, I hope the team can improve this, The KPI measurement section is relatively complete and specific, easy to understand and can be measured. measurable but the results achieved in each specific period are. Stage 1: event attendance and feedback, KPI is total 300+ event attendance in 3 events. Stage 2: hackathon attendance, feedback and scores, KPI is hackathon attendance over 60+ total attendance for 3 hackathons. Stage 3: the number of students enrolled in Wada's educational program, KPI is the number of students enrolled in Wada's educational program, more than 12 students.\nIn short, together with the partner I recommend to complete the missing things that I have presented, the transparency of the proposal is very high.", "q2r": 4, "assessor": "z_assessor_2886", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7630, "q0": "The problem described in this proposal is closely aligned with the challenge. The team has done a great job by putting the proposal at the right challenge. \nThe proposal clearly provides a solution through the organization of a series of meaningful events both face-to-face and online bringing participants onboard the Cardano ecosystem, and also training local developers to find solutions to local problems using the Cardano blockchain. Launching a student hub to inspire young developers to choose Cardano and train them through conferences and hackathons by promoting Haskell and Plutus.\nMetrics to be used to access the impact of the proposal includes; Creating the best products from the Hackathon sessions and scholarship for students to learn Plutus or Atala Prism not limited to the proposal also mentioning how some of the participants of the hub will be brought on board the Cardano ecosystem in Goma. \nThe proposers failed to address a key part of funded projects which is how sustainable it is. Failure in this part renders the project in a certain light due to the lack of continuity. \n", "q0r": 4, "q1": "Even though the proposer has provided relevant links to members of the team who will help in the proper execution of the project I believe it is highly unlikely they will be able to fulfill and implement this proposal properly because the head is someone who is still learning more into the ecosystem. The margins given for the various months where the project timelines follow also leave much to be desired such as phase one, three events should take place post first fund and the budget is also not properly done for instance putting the cost of speakers, motivation, and logistics as one is not the best. These are all independent items that need to be separated from each other. That is each item must have its own unique costs such as speakers, logistics, and others. The budget needs to be properly done and looked at. There is a need to break it down extra to ascertain the real cost of each unit. \n", "q1r": 3, "q2": "\n\n\nThe proposer and team have not provided us with a clear outline on how they are going to measure the progress of their project should they be funded.\n\nAlso, they have not provided us with key milestones, or information on how success will look like should they be funded thus elaborating on key milestones to look out for such as the number of students who will receive the training, and how many will be onboarded, trained among others. I can say that this information is not helpful to audit the veracity of this proposal. The Cardano community expects thorough work done to ensure every funded project matches the expectations of the community and goes a long way to adding value to the Cardano ecosystem. For instance, matching approximate figures of attendees who will come for the training is not a realistic figure. Lest say you are matching attendees based on expectation for funding then you will not get the funds you need. This is a serious project in which if put well has the potential to open the whole ecosystem of Africa. The people of Goma especially the students who are craving such a hub will be greatly impacted if this project gets funded. How can we march the success story?\nThe proposer has also indicated how their progress will be monitored and therefore being part of WADA their reporting will be followed closely by the Cardano community WADA which I think is quite a reputable organization in the Cardano ecosystem. ", "q2r": 2, "assessor": "z_assessor_2908", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9107, "q0": "Students in Africa, especially French-speaking students, are lagging behind the development of Blockchain. The project will launch a student hub in Goma town to inspire young developers to choose Cardano through conferences and hackathons promoting Haskell and Plutus. They will hold 3 showcase events to get students' attention, then offer some virtual hackathons for 3 days. Those who excellent in this competition will be trained with Wada's Cameroon Hub to become trainers in Wada's Haskell and Plutus education initiative. In addition to holding introductory lectures on the Cardano ecosystem and Project Catalyst, the Student Hub would do the following: Organize programming sessions on Haskell and functional programming for computer science students, encourage the student to participate in Project Catalyst as community advisors by introducing them to decentralized governance, accompanying students who want to apply for funding through Project Catalyst…\nCardano wants to thrive in Africa, so training young local developers, especially students, is a great, possible solution. As such, I find this project to fit the goal of the challenge. The project also introduces the risk that people may not be interested in participating in these events at first, especially given the costs such as transportation, internet. The project also has solutions to reduce this risk.\n", "q0r": 5, "q1": "The project is divided into 3 phases, phase 1 organizes 3 events in 3 months to introduce Blockchain, Project Catalyst Ecosystem; phase 2 hosts some virtual hackathons with prizes; phase 3 brings together students who excellent in attacks on Wada's larger Haskell and Plutus education initiative. The project has a clear roadmap, so it is easy to successfully implement.\n\nThe required budget is 12,000 USD which includes speaker fees 5,000 USD, internet 1,000 USD, refreshments 2,000 USD, attendee motivations 1,000 USD, hackathon prizes 3,000 USD. The project team should further detail the cost such as how many people participate in an event, how much the support costs per person, how many prizes, how many USD each prize… for better cost management.\n\nThe project team consists of 5 people, who are experienced in Haskell programming, are senior software developers, project managers, Multilingual..., suitable for the project's requirements.\n", "q1r": 4, "q2": "The project provides indicators to measure the success of the project such as: event attendance 300+ total in attendance for 3 events, hackathon attendance 60+ total attendance for 3 hackathons, number of trainees enrolled in Wada's education program, 12+ trainees. These indicators are specific and measurable, so it is convenient for community control.", "q2r": 5, "assessor": "z_assessor_3021", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10566, "q0": "“ISIG-GOMA Cardano Hub” is a good idea and meets the challenge “Grow Africa, Grow Cardano”. The core goal of the “Grow Africa, Grow Cardano” challenge is to increase awareness, understanding, and adoption of the Cardano ecosystem on the African continent. This proposal raises an important issue: Students in Africa and especially those in DRC (France) are lagging in the development of Blockchain and its usefulness. I find the idea of ​​this proposal very relevant and useful because as far as I know, Africa is an underdeveloped area, and many areas are still limited. Besides, Blockchain technology is still a relatively new technology, not yet applied in many parts of the world, it has only been popularized in some regions and developed countries such as the United States and some other European countries. So this proposal for Africa I think is necessary and reasonable. Launching a student center in Goma to inspire young developers to choose Cardano through conferences and hackathons promoting Haskell and Plutus will give DRC students more exposure to Blockchain and especially they have the opportunity to learn more about Cardano, and Haskell. Besides, it also helps the Cardano community to grow stronger and more popular in Africa. After learning more about this project, I learned that to attract students at universities the proponent would put in three showcase events and then offer some 3-day virtual hackathons to engage students one day. More practically, in addition, those who excel in the hackathon will be put on a more serious training course with Wada's Cameroon Center to become trainers in Wada's Haskell and Plutus education initiative. This can be seen that the group has invested and is dedicated to this idea. After the introductory lectures on the Cardano ecosystem and Project Catalyst, there will be more programming sessions on Haskell, creating a path for students to have more opportunities to receive Plutus and Prism scholarships. Atala and importantly also helps students see opportunities to start a business, Accompanying students who want to apply for funding through Project Catalyst. It can be seen that the group of proponents came up with very specific solutions, identified most of the problems of the challenge, and made a reasonable argument. To successfully implement the project, the proposed team also pointed out the risks that may be faced. That is People may not initially be interested in participating in these events. However, these risks have all been assessed by the team and given solutions to overcome. With careful preparation of the plan as well as measures to limit risks, I think that the success of this project will be relatively large.\n", "q0r": 4, "q1": "In the \"Feasibility\" part, I found that the team proposed quite well because this is a relatively large project, so it needs specific and methodical plans, the team has done it. Regarding the timeline, the proposed team has divided into different time cups, detailing the work to be completed in 3 phases. This proves that the group is very enthusiastic and serious about the proposal. About the budget: the proponent has also given a plan for the period and clearly how to allocate capital, helping the community understand the information about the amount of money that should be used for each fund, and the purpose of each amount. What will be the result of spending? The data presented in this section I find very transparent, easy to understand, and completely reasonable. But if possible, I think that a small part of the budget should be used to reward outstanding students, or for attendees at Blockchain/Cardano demos who have good questions. or have really valuable contributions, it will help increase the efficiency of the project. About the team involved in the project is also listed by the proponent fully, with details of full name information as well as information through LinkedIn to make it easier for the community to check and track. Besides, this team is all experienced in many aspects, so the assurance and reliability of the project will be relatively large.\n", "q1r": 4, "q2": "To help the community measure the progress and success of the project, the proponent has divided it into 3 phases for easy monitoring and control. In addition, the proponent also stated the goal with specific figures such as event attendance of more than 300 people for 3 events, hackathons attended more than 60+ and the number of students enrolled in the educational program of the company Wada more than 12 students. By providing these specific KPIs, the transparency and credibility of the project are increased. This is a new project but it means a lot to the community.\n", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 11381, "q0": "Cardano is a proof of stake blockchain platform founded on peer reviewed research and developed through evidence based methods. It combines pioneering technologies to provide unparalleled security and sustainability to decentralised applications, systems and societies. Cardano exists to redistribute power from unaccountable structures to the margins to individuals and be an enabling force for positive change and progress. As African students are lagging behind the development of blockchain launching a student hub in Goma town inspire young developers to choose cardano. This proposal effectively addresses the challenge and I agree with the proposal", "q0r": 5, "q1": "The project has detailed plan in three phases  including events taking place monthly, introduction of blockchain, channeling the energy through events into practical applications and funneling the students in hackathons into wada's larger Haskell and plutus education initiative. The budget breakdown is feasible and reasonable to achieve set goals. The people working with the proposal has experience perviously in Haskell programming and the hub support technical training and hackathon implementation and coordination. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by measuring event attendance feedback, number of trainees enrolled in Wada's education program, hackthon attendance, number of trainees enrolled in Wada's education program. The plan describes the resources necessary to implement the proposal and it clearly explains technical aspects like architecture, language and technologies which are crucial for implementation. The proposer has considered challenges and risks relevant to a successful implementation. This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 12280, "q0": "From the concept outlined and with the vision, i believe the proposal meets the challenge need. how ever is not too clear, given the information provided, how the team foresees that the project may scale up for future requirement of project catalyst. The team domestrates some level of experience, knowledge and interest in the issue at hand. If i get the concept clear, they are targetting computer science students as base front by teaching them basic programming as a way of capuring them in a pool so blockchain and cardano can then be intregrated. i highly recommend that, if the proposal is funded, the team pays attention and implement strategies how their experience can be transfered to other none-computer science students in the university. Cardano Ecosystem may be scaled to contribute directly to project catalyst ASAP and Camaroonians in the near future. ", "q0r": 5, "q1": "From the various experiences outlined with the team, i have the believe that proposal is likely to be funded for successful implementation. they provides us with an individualized description of each member to know and  understand them better. what am not clear is, knowing their names and roles in the project, a brief history of provious work and how these professional relates to the Cardano Ecosystem. what ways do they dialogue with blockchain. furthermore, in this proposal, the team provides milestones in 3 phases but is not clear how the team will fulfil any long-term goals. I am aware that the team has indicated the various activities to undertake to inculcate Cardano but i do not see where the team makes provision to engage students even after the phase one of introduction to  blockchain & Cardano. Nevertheless, if they are funded I will also suggest that the team makes provision for Materials about Cardano blockchain for students to read to appretiate the impact of Cardano. ", "q1r": 3, "q2": "The team desmostrates clarity in the description of the problem, the solution and  how the proposal is aligned with them. road map though not too detailed, is quite of a good design, there are deliverable/milestones that make audting the proposal easier to achieve the success of the first phase of the three phases. The team experience also shows that there is an experience and dedicated and experience auditor with technical knowledge in the specific domain area. The metrix in terms of activities are well chosen and i believe they are good indicators of evaluating success as the chosen outputs would clearly indicate the number of students anticiapted to attend and benefits and the progression over time.", "q2r": 4, "assessor": "z_assessor_3383", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Launch a student hub in Goma town to inspire young developers to choose Cardano\nthrough conferences and hackathons promoting Haskell and Plutus.", "experience": "Paul Mupenda\n\n5th year university student (Computer science), previous experience in Haskell programming.\nMember of the college of ISIG-GOMA students.\nRegular participant in the WADA's Haskell Hackathons\n\nWada Cameroon Hub support with technical training and coordination"}