{"id": 417189, "author": "tylercase", "title": "Regenerate Yem (Ethiopia)", "url": "https://cardano.ideascale.com/a/dtd/417189-48088", "category": 26600, "amount": 22600, "description": "In Ethiopian highlands, population explosion and mis/over-use of the ecosystem have caused acute resource and food insecurity leading to conflicts and threatening widespread famine.", "f6_no_assessments": 7, "f6_rating": 4.476190476190476, "videos": [], "media": [], "f6_assessments": [{"id": 1163, "q0": "I find the proposal addressed the challenge because it aims to help Africa, in particular the lowlands (land located below 1400 m) of Ethiopia, by setting up a new village running on agriculture. \nThe village will spread the culture of employing the manure to regenerate soil, instead of using it for heating/source of energy. \nThe energy needed by the new village will be given to by solar cookers, and the use (and/or the number) of solar cookers will be related to a token to track the usage of these devices and serve as a proof of carbon sequestration (avoided carbon dioxyde emission which would be generated by burning manure).\nThe team counts on trackinf the progress of the farm by generating a series of NFTs for each aspect of the project, from artwork to proof of progress by capturing images/videos of the crop. The sell of the NFT would generate extra income for the farmers working in the village. \nI would suggest to leverage on the CNFT.io platform to sell the NFTs. The team does not want to go for smart contracts related to NFTs but I would suggest to go for it so every time and NFT is sold, the revenue would be automatically split between the farmers and the trasury.\nDespite this minor observation, I would see more useful to track some of the progress, in particular scientific data on maps, GPS coordinated of new crops, journal treatment and scheduling, not via NFT but via a dApp built on Cardano. \nOf course this could come on a later stage, or it could come by partnering with other projects on the space (see what's happening in Tanzania/Zimbabwe with this project: https://cardano.ideascale.com/c/idea/414699", "q0r": 5, "q1": "The proposer has clear idea on team setting (two experienced people with deep knowledge of the territory, legal requirements for setting up the land management, project management ect...)\nThe upcoming risks I see with the implementation is: \n1) getting the volunteers to work in the lowlands given the high rate of mosquitoes/difficult living conditions;\n2)  scarce interest for buying the NFTs (would it be advertised like Treedom in which users would finance local economy from aborad ?)\n3) obstacles in the cultural shift from burning manure to get solar powered devices to cook. \nAll of these risks can be mitigated by the team by planning upfront with a mitigation plan. \nThe budget required seems adequate to cover the raw material costs, travel costs for the main project leaders, and there is no specific deadline for project completion as the development and the scale up of the village will be potentially ongoing for some years if successful. \nI would suggest the team to seriously evaluate power outages and internet connection to avoid interruption in data recording and NFT creation/engagement with project stakeholders", "q1r": 4, "q2": "The information to audit the proposal is sufficient because the team provided an accurate plan in terms of execution timeline and budget, and has presented a problem-solution approach targeting a specific need of one community living in the Yem region of Ethiopia. I would suggest to summarize a bit more the proposal as the brief is too dispersive in some points and would need some clarification in other ones (e.g. token related to solar cooker, NFTs marketing, scheduling reporting to Catalyst circle...)", "q2r": 5, "assessor": "z_assessor_2215", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3858, "q0": "A great proposition, it identifies many of the problems that need to be addressed in this challenge, it responds to nearly all of the problems the challenge poses, it can scale quickly and widely to many elsewhere, it can also solve problems that arise in the future, this is a very good proposition, it brings great development value to the Cardano ecosystem. , if this proposal is not Funded in this Fund Food security, uncontrolled population explosion, violent conflict, and famine are global problems, not just in Africa or Ethiopia, the Cardano work taking projects like this to review and solve them based on Catalyst and the Cardano community is very humane.\n\nThe solution of this idea is good, it identifies some of the problems of the challenge, in addition, the author of this idea argues in a logical, neat, and creative way. The solution will send an expert grower, Tichafa, to Yem, where he and a team of 10 hand-selected participants will build an eco-environment in the lowlands. They will begin an iterative process of re-scaling the landscape: manually digging up suitable terraces and swarms, planting perennials, and managing to graze, all while enhancing their understanding of the landscape. them about the landscape. what's best for the land, wildlife, and people.\n An affordable solution for local farmers.\n\nThe project has a detailed description of some implementation risks, in addition to some suggested solutions by the author to overcome them, but the community needs to be informed for more solutions to these problems. . That risk if the Scheme is funded. The risks related to financing, source, culture/behavior, politics, and climate have been listed in quite detail along with mitigation solutions and ways to solve the problem reasonably and easily. understand. \n", "q0r": 4, "q1": "Great when a project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project is aiming for are also very specific and completely achievable.\n\n The project budget required less than 20% of the total funding of this challenge, compared to the information provided by the project, all expenditures for the project were clear and explained very clearly and transparently. White. The budget analysis table is quite complete but needs more details, in addition, in my opinion, the author should watch out for price slippage, which is when the price of ADA at the time of proposal and the time of disbursement. Consider the project.\n\n Human resources to implement this project have been assigned specific jobs for each item, the experience of the members shows that they are completely suitable for the project. However, the identities of the members are also difficult to verify. clear. The author of this project, Tyler Case and collaborators Tichafa Makovere, Tegegne Tefera, & Kevin Dubienski, said it was an experienced team to work on this project, however, the author would like to provide more information. detail. Reputable identity verification links such as LinkedIn, Facebook, Twitter, Discord, etc. for easy and practical identity verification community.\n", "q1r": 4, "q2": "This project provides KPIs for accomplishing project goals, all of which are easily measured thanks to the metrics provided by the project. With measurable goals, this goal can be easily measured, but the author is happy to provide the community: with where and how we check that number.\n\n    The scheme has clearly defined success, the information from the scheme shows what is being done and how it is being done and the testing has achieved considerable initial success which is amazing.\n\nBrand new idea information on Cardano platform never received any funding from Cardano ecosystem.\n", "q2r": 4, "assessor": "z_assessor_2489", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4362, "q0": "This challenge aims to recreate and grow an Africa with a population of more than 1.4 billion people (early 2022 figures) using the Cardano blockchain. The team had a proposal to address the stated goal of regenerating and developing Africa while adding value to the Cardano ecosystem. The specific job here is to build an ecological environment for young farmers and ranchers under the guidance of experts using the Cardano blockchain including NFT. I find this proposal very interesting, we already know the long-standing situation of the Ethiopian Highlands is population explosion and environmental ecosystems are being destroyed causing food and resource insecurity. serious. Your suggestion is very necessary for such a situation. It is undeniably hugely impactful and can scale to address the challenge not only in the Ethiopian region but also in other parts of Africa. This is a specific problem of Ethiopia in particular and of Africa in general, which desperately needs the support of IOG, the efforts of dedicated people from all over the world, and especially from the people who are born. live in Africa. The team raised the problem to be solved very clearly, increasing the impact. Do you think it will be possible to use the existing resources of the Cardano blockchain and NFT to solve other problems that exist in Africa with a similar measure? I vote 5 stars.", "q0r": 5, "q1": "The scope of the proposal is great, the idea is good, and will come to life. When successfully implemented, it will be of great benefit to the environment ecosystem and the people of Africa. Followed by a team of experienced members in the fields of the natural environment, animal husbandry, aquatic products, natural resources, and land. I believe in the feasibility of the proposal because I see the professionalism of the people who have the expertise to implement the proposal. However, I only have one small idea to contribute: That is, if possible, you can make your identity more public through links on social networks. For example, Facebook, LinkedIn, etc... will increase the community's trust in the implementation team. This is how some members of the other suggestions have done very well. About the resources needed to implement, I would like to talk more about the resource as human resources. This is a proposal built on the Cardano blockchain, so the staff on the team must have information technology expertise, especially in the blockchain field. Your proposal is quite convincing, but perhaps you need to give more details about the member in charge of the technical aspect. For example, the construction and development of NFT, and DAO. Doing so will greatly increase the feasibility of the proposal. Does the team plan to implement NFT? If so, how will it be implemented? Will NFT holders get any benefits from the project? I strongly support the release of NFT, because it also has another effect, which is to increase the publicity of the project. Of course in the proposal, you did that but it doesn't seem clear yet. Therefore, I would like to add suggestions to help you get a very clear, concise, and complete proposal. Regarding the detailed budget allocation, which I like very much because it demonstrates the feasibility of the proposal. Listings are paid out in small and targeted increments. Does the team plan to increase its marketing budget beyond some of the communication channels the team has deployed? My opinion is that if possible, you should do it because advertising and marketing play a huge role to increase feasibility and impact on the community. Regarding the plan and implementation, you did well with all the options and the application of high technology. The technical aspects here are all based on the Cardano blockchain platform (NFT, DAO, etc...). I must admit this is the most advanced semi-project, leading in technology in Africa. I am very happy that countries in Africa have been exposed to such a good level of modern science and technology and information technology. In terms of risk and risk prevention: the team raised risks that are subjective and objective. It is true to the reality you will have to face. I would like to ask if the team has taken into account the permission of the local government leaders to implement the proposal and project implementation? Does it have anything to do with the legality of the host country? If possible, the team can clarify this to increase the feasibility of the proposal. I think this is an important step to putting the proposal into practice. I always hope that everything will go well so that this proposal can soon be successfully applied to live. I vote 4 stars.", "q1r": 4, "q2": "You've laid out your roadmap and milestones to a very high standard. When attaching things to be done with dates. This makes it easy for the audit community. The team has also clearly defined what the goals in each phase are. I like this very much because it helps a lot in auditing. The steps of the problem description are clear and easy to understand, and the solutions are given in a reasonable and timely manner. We can see the richness in describing what the team intends to do. It is related to many aspects of the natural environment and human living environment such as Water Resources, fauna, flora, land resources... Regardless of whether it is related to the entire ecosystem No matter how large the living environment is, the team knows how to arrange and present it very coherently. I admire you. It is also related to the 17 sustainable development goals of the United Nations: clean water, clean energy, good work, etc... So, the team has affirmed quite clearly the transparency and auditability of the organization. offer. I believe the community is quite satisfied reading the proposal in detail. I just wonder about KPIs that you haven't mentioned yet? If possible, include KPIs in the proposal to make the assessment even better. It is also a way for the community to track the success of the project. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4608, "q0": "Evidently the proposal has a social and environmental impact that cannot be debated, now at first glance it is not so easy to identify how the proposal is aligned with the objectives of the challenge, however, and this is something that stands out, the team has been able to argue how the proposal adds value to the Cardano ecosystem beyond the local impact. Generating a model for the integration of local production of regenerative food that can be replicated in the continent already tells us about the possibility of being able to generate a massive adoption of cardano technology. \n\nThe proposal aligns with the key metrics of the challenge, as it does address some of the problems that impede adoption, since there is training in the use of blockchain technology, use of tools such as wallets, and the local impact can be measured through the interaction of these people with the project, It is a good idea to start with a small cohort to ensure a correct implementation, I can recommend to the team to look for models that allow replication and scaling in an easier and faster way, this process is not simple and I can imagine that the process will be improved with each iteration. \n\nThe use of NFTs as collectibles seems to me personally a good idea to start, in my experience I know projects in Latin America that relied on the sale of NFTs to fund proposals from the community in projects related to sustainability, I invite the team to investigate more about these projects, one of them is ALDEA (https://aldea-dao. I invite the team to explore other ways to be sustainable, in my experience I have worked with small farmers and I understand how complicated it is for a family or subsistence farmer to take the step towards formal markets, in the long term these regenerative systems could help producers to improve their production, and allow them to have certifications that bring them closer to formal markets.Looking at carbon credit generation models may also be another viable option for sustainability of projects. look at proposals within the cardashift challenge or with the Cardano4Climate community. \n\nI invite the team to study e-commerce models and traceability solutions where I believe cardano technology has a lot of potential and use cases. \n\n", "q0r": 5, "q1": "In the feasibility issue it is necessary to evaluate the probability that the proposal will be successfully implemented, for that having a reference of the people who will execute the idea is paramount, as PA I can highlight how clearly the proposal describes the people involved in the project and especially what role or activities they will play, placing the roles and previous experience they have in the subject certainly gives a level of confidence that facilitates this evaluation process.\n\nLooking at the timeline, the tasks can be identified, the people who are going to do it also, it explains in a very detailed way how the activities will be done, the times are sensible and when reading the proposal the way it is written maybe at first sight it seems a bit cumbersome but when you read it, the proposal tells you a story and it is as if you were there watching the whole implementation process.\n\nThe budget is well broken down and defined, the expenses of each item are also reasonable, I can highlight that the detailed plan and the well broken down budget will help with the auditability process. \n\n\nThere are two points that in my opinion could improve the proposal, first the need to include in the budget a contingency fund that can help to solve unforeseen events, in addition to this contingency fund, to include a plan of what can be done in case additional funding is required.\n\nAnd the other point is the importance of communicating to the community the management of the workload in case there are team members who are working on proposals from this fund or past funds, probably because this part is new in this fund, I make the recommendation not to omit this part as it is important to evaluate the feasibility of implementation.\n\n\n\n\n\n\n\n\n", "q1r": 4, "q2": "The proposal provides a clear description of the problem and a clear description of the solution, although I must say that understanding or digesting the solution is not so easy for the reader, not because of a bad explanation but because the solution involves many aspects and factors, I could say that it is a general solution and not a specific solution, I recommend seeing this proposal as a comprehensive solution that consists of different phases and depends on the involvement of different actors in the ecosystem.\n\nThe metrics are well defined, probably it would be necessary to explain a little more in detail or a little more technical level what are the DIDs, otherwise it is focused on the value of the ntfs sold which is quite concrete and in terms of adoption and interaction with the Cardano community is well aligned.\n\nSome more metrics could be added, but as the proposal mentions those additional metrics could start to be measured in the medium to long term. Probably some metric that has to do with how the first users adapt to the use of the technology, some way to measure these first interactions with the technology , especially because from my experience working with people outside blockchain and technology in general is a major challenge that involves a learning path so the assistance improve the learning curve, these challenges are already raised in the proposal and probably add metrics that reflect this challenge will be of much interest to the community and future proponents of catalyst.\n\nMy point is that although these metrics are not necessary, they could help a lot to understand how to approach non-technologists, if more proposals would include this kind of metrics it would be beneficial for Cardano, because future proponents would have tools and insights that allow them to approach these users in a more efficient way.\n", "q2r": 5, "assessor": "z_assessor_2575", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5224, "q0": "This is quite a meaningful topic when applying NFT technology to store information process of the build an ecovillage in the lowlands of Ethiopia.\n\nYour proposal is written in detail, showing the seriousness and investment in the work.\n\nI just have a small suggestion regarding promoting NFTs to the Cardano community. Because if NFTs are minted but no one buys or owns them, there will be no stable source of money to maintain this project.\n\nTo create communication channels for NFTs, you can build your own website to show all the activities of the ecovillage that you have built, to demonstrate how the real value in NFTs is.", "q0r": 5, "q1": "The implementation plan for this proposal is written quite detailed with timelines and results to be achieved, you even name specific team members who will have to do the work. I really appreciate your way of doing this. From this blueprint, the community can completely monitor the actual implementation of the project. However, according to my suggestion, it is necessary to add a detailed plan for the management and promotion of NFTs - where it is possible to bring stable financial flow for the project in the future.\n\nThe budget for this proposal is $22600, all costs are detailed. I totally agree with this budget and the $22600 budget is reasonable.\n\nThere are 04 members participating in this proposal, and their experiences and abilities are described in detail. However, if members have profiles (Linked In, Facebook, Telegram, ..) it will be better for the community to be able to verify the identity of these members is correct as stated in the proposal.", "q1r": 5, "q2": "The indicators you use to measure the performance of the project are completely reasonable. For example, Number of Unique DIDs onboarded, Total $/Ada value in NFT purchases,...\n\nHowever, to evaluate the success of the project, it is necessary to add specific numbers to the above indicators. For example, 100 unique DIDs onboarded, or $20,000 (or ADA) value in NFT purchases, etc. Once you have specific goals, you will know how much effort you need to put in to achieve them.", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7293, "q0": "Ethiopia is a country with more than 100 million people, population explosion and misuse and overuse of the ecosystem have caused many bad consequences to the ecological environment, human life and put great pressure on the environment. the economy, the projects trying on the issues of improving the ecology and environment are commendable and welcome. The proposal that aims to create dual effects through recreating real-world ecological environments on a daily basis is the creation of a Cardano-based NFT that captures those activities, increasing community awareness. Cardano Blockchain technology in the community through activities that are close to life, making the technology easier to access and apply in practice. I think the success of this project will be the premise for expansion into the territory, not only in Ethiopia, but other countries in Africa are also under the same pressures as in Ethiopia, or maybe expanding into other renewable-related fields.", "q0r": 5, "q1": "The proposed working environment of the team is mainly outdoors, under direct impact from nature. The proponent has carefully researched and analyzed from internal conditions such as nature, environment and people, and then what is the ideal time, content, and topics of the NFTs to be cast. Then came up with a detailed, reasonable plan, objectives, work content corresponding to a specific timeline to successfully implement the project. Detailed analysis budget table, from travel expenses of experts, administrative fees, money to buy tools, plants and animals, and salary, I think it is quite reasonable with the size and content of the proposal. . The proponent also considered the challenges and risks involved in successfully implementing the project. Finally, the proponent profile analyzed in detail both the experience and the roles and responsibilities of each member. in the group however need to provide more details such as a link/reference to the Linked profile for easier evaluation by the voter community.", "q1r": 4, "q2": "Through the help of metrics and milestones and timeframes provided by the proponent, the progress of the proposal can be easily audited, before the implementation of the proposal is the preparation phase from July until December, with a project directly affected by nature, preparation is very important, to limit risks and create a premise for successful implementation of the proposal later. Also in this phase In this case, if the team has not received funding from the Catalyst, the team will consider self-funding to welcome experts Tichafa and Tegegne to work in time for the most ideal time for the successful regeneration of the ecosystem. , showing a very high work ethic and determination for this project. The implementation phase has three stages, until the final stage is the stage of replicating the development of the model to other regions with very clear timelines, work content and how to do it, this makes it easy to measure progress. KPIs like total $/Ada value in NFT purchases and % of which will go to Ethiopia wallet, Attend open meetings and Youtube interaction of recorded meetings etc. The project is clear and easy to understand, and can be viewed to track the success of the project.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13010, "q0": "The proposal clearly identifies a problem within the challenge which needs to be solved. It describes the advantage that it is bringing to the community, which is based on educating and sharing knowledge from highly skilled end educated persons to wide range of native people. It is in line with plan of adding value to Cardano ecosystem. Given goals are aligned with challenge conditions. The future evolvement of the project is highly scalable for expansion to other localities, wider community and supporting dealing with other problems in given ecosystem while growing in size and variety.", "q0r": 4, "q1": "The proposal has clearly identified key sources, skills and experience needed for realization of the proposed project in form of articles, web pages and videos providing more details and insights. Although it is highly dependable on experienced person sharing knowledge and educating, while spreading to larger community even with limited sources, the results of project might go far beyond defined target when incorporating remote support and services while decreasing costs of project. The budget is clear and broken down into specific items, timetable structured and realistic and risk evaluation provided with reasoning for their minimalization. The technology needed for succesful operation is presented, with the plan of ownership and further usage.", "q1r": 4, "q2": "A clear roadmap with significant milestones and a clear time horizon for achievement of the project defined and supported by other technical and personal means necessary for its realization. Management, data collection,  knowledge sharing and reporting incorporated within different phases of project giving it possibility for growth in community and continuation in following projects with educated and experienced local people. Measures for future assesment of results defined as well as clear targets and aims. When sharing the process and progress via recording and describing procedures, useful guidelines and updates of current situation, the impact might be easily followed and spread over a wide area giving it so higher chance for influencing greater community with project and Cardano business.", "q2r": 4, "assessor": "z_assessor_3532", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Proof-of-concept ecovillage of young farmers and herders under expert guidance in hitherto-uninhabited lowlands; Novel NFTs to document findings, reward work, and invite Community engagement.", "experience": "Tichafa: 28 yrs teaching permaculture across Africa.\nTegegne: 20+ yrs Engineer. Relationships with leaders in Ethiopia.\nTyler: 8 yrs farming. blog. host regen cardano conference c4c\nKevin: nftseed, Permaculture designer HOPEthiopia, 10+ yrs in software dev, apps, animations"}