{"id": 417537, "author": "ebutech", "title": "Hackathon and Internship Program", "url": "https://cardano.ideascale.com/a/dtd/417537-48088", "category": 26600, "amount": 26000, "description": "Over 90% of African businesses are SMEs and cannot afford traditional business protection through a lawyer. This factor puts them at risk of losses in case of contract breaches and non-commitment.", "f6_no_assessments": 18, "f6_rating": 4.518518518518517, "videos": [], "media": [], "f6_assessments": [{"id": 7631, "q0": "The problem described in this proposal is closely aligned with the challenge. The team has done well putting the proposal at the right challenge. The problem within the challenge which needs to be solved by this proposal is over 90% of African businesses are SMEs and lack access to legal services and the solution the proposer proposes is to expose Cardano and the blockchain ecosystem to the larger market using students of European Business University (EBU) to train them as developers to build smart contract solutions for some of these local businesses in Africa because majority of their students are in their certificate impact program. \nThe proposal clearly articulates how it will add value to the Cardano ecosystem through their hackathon and internship program, businesses will be able to have smart contracts implemented which will create  \nthe potential for job opportunities that emerge from this smart contracts thereby will create a demand for the skill encouraging more people to take on Cardano development. Also, the key metrics and goals of the proposal align with the outlined challenge settings which is positive. And the proposal is able to scale to address future challenges  as it will become a main course for subsequent stidents who are attending EBU to also have the opportunity to learn and come on board the cardano ecosystem. The proposal clearly articulates a plan for the project's future sustainability.\n\n  ", "q0r": 4, "q1": "The proposer has provided relevant links to members of the team who will help in proper execution of the project. Moreover, the proposal and team from the links provided have the desired skills and experience to be able to execute the project should they be funded  such as Dr. James Mulli - Director/Academic Dean, European Business University, Ernest Musyoki - Data Scientist and Plutus/Haskell Instructor, European Business University etc. \nThe total budget is $26000 and is also clearly outlined and broken down into identifiable items and the budget is reasonable to achieve the set goals.\nThe proposal offers a realistic timetable to complete the work since it falls along the academic calendar of the school.\nThe plan describes all the resources necessary to implement the proposal. The proposer has considered challenges and risks relevant to a successful implementation and how to mitigate them. Some of the problems are natural difficulty of the Plutus/Haskell course might limit students from successfully completing the course which is a requirement to benefit from the program, risks of not having 100% of their students getting internships etc. \n", "q1r": 5, "q2": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThey have indicated a roadmap with milestones which is divided into two (1 milestone - Organizing the Hackathon and Milestone 2: Internship program) and a clear time horizon for achievement. Furthermore, they have a well-thought out Metrics/KPIs that will define the success of the proposal which are; KPI 1: the projects developed during the hackathon, and detailing the depth of the projects and the practicality of the project and if they solve the problem statement presented etc. \nMoreover, they also have a clear understandable description of the targeted problem who are the SMEs, which can be measured against the proposed outcomes who will be the graduated students who will be sent to these SMEs to help them build the smart contract for their firms.  and success for their project will look like the following; students will/can build great projects during the hackathon that solve the problem statement, having more students pique interest in learning Plutus/Haskell and enroll on the course as a result and last but not the least, students landing internships and even job opportunities thus applying their new knowledge and skills to real business applications and many more.\nAnd, they have provided an accessible public channel for delivering regular updates to the community for auditing progress through their school website. \n\n", "q2r": 5, "assessor": "z_assessor_2908", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1679, "q0": "The proposal is very relevant, it is about solving a business problem that would really have a high positive impact both for African corporations and for Cardano. I realize that most of the proposals in this challenge aim to educate people about Cardano, so that from there they have new income opportunities, for example. This is important, but there are already several initiatives in this direction, so investing in more innovative things is really necessary. This is the case here: the problem portrayed is that “over 90% of African companies are SMEs and cannot afford traditional business protection through a lawyer. This factor puts them at risk of losses in case of breach of contract and non-commitment”. And to address this, the proposed solution would expose “Cardano and the blockchain ecosystem more to the larger market and our student developers have built smart contract solutions for some of these local companies.” This would be done by the European Business University - Luxembourg (EBU), a university that has 85% of its students coming from African countries, as the proponent reports. They already offer a course on Plutus/Haskell, which is based on teaching material provided by IOG itself; In this course, students need to deliver a practical project to be approved. The idea here would be, from what I understand, to give impetus to this initiative, through the organization of a hackathon for each period. As a result, more students would be educated about Cardano's technologies, and would be encouraged to produce more and more smart contracts. The idea is that successful students in the hackathon are directed to internships in partner companies of the university. This certainly achieves 100% of the challenge objectives. On the one hand, many young people will be instructed to work with our programming languages, which will open up opportunities for them to get involved with the most diverse projects of Cardano; thus, they would have an opportunity to grow professionally, have their careers boosted and generate a good income. On the other hand, skilled labor would be generated, which is increasingly a need within our ecosystem. As Catalyst progresses, more projects need more developers, even interns, to put their ideas into practice. With this program, both Africa and Cardano would fully benefit; in addition to students, companies would also benefit, as their actions would be better protected through smart contracts. With this, I believe that several specific objectives of the challenge would be met, such as “Number of proposals addressing the fundamental issues preventing Cardano adoption in Africa + Number of proposals offering solutions to infrastructure and education concerns + Number of new Africa-based users onboarded onto Cardano (wallets, platform sign-ups) + Number of new Africa-based Catalyst members (proposers, voters, CAs) + Number of new African projects seeded in 2022”.", "q0r": 5, "q1": "The proposal roadmap could be more detailed. For example, let's look at the following snippet: “Milestone 1: Organizing the Hackathon. During the first occurrence, organize all past successful students to form groups, and work on their projects based on a problem statement. One week later, the students present their working projects during the hackathon. Have the projects assessed by the EBU team and the Plutus/Haskell course instructor”. What is said is, in a superficial way, what would happen in the practice of the project. However, more details about each part could have been attached. Starting with temporality: we don't know how long each milestone would take, what time is expected for each result to be achieved. For example, milestone 1 would be based on organizing the hackathon; we know what would happen (“during the first occurrence, organize all successful alumni into groups and work on their projects based on a problem statement. A week later, students present their work projects during the hackathon. Have the projects evaluated by the EBU team and the Plutus/Haskell course instructor”). In this part, the level of detail is much better than, for example, in milestone 2, which would be the internship program itself. We know what results would be expected, but for example: how would the contact with companies that need the solutions being studied and created here be made? How would students be introduced to these corporations, how would they be supported to start working in the institutions? I believe that what we have is a general idea of ​​what would happen, but the level of specificity does not allow us to solidly understand each step that would be taken. Speaking of the budget, in my view the asking price is quite fair, it's 28 thousand dollars. The value is divided into some parts, some of which are better explained and simpler (such as the prizes for the winning teams of the hackathons, the money destined for the interns, etc.). However, the final part of the explanation is a bit confusing. $10,000 is set aside to “run the program each period to create more demand for Cardano smart contract developers as well as increase our reach.” How much would go for each part? How would the range be increased, how would that be done? Perhaps a marketing process, to publicize the program, so that new students and companies would be interested in the program; but it would be important that the use of the $10,000 be explained more precisely. The team is also presented in a superficial way, that is, we know little information about each team member. We are usually told their names, roles and linkedin profiles. But it is always interesting that we have a more in-depth knowledge of each one, that a slightly more extensive curriculum is attached to the proposal itself as well, to better understand their professional background and how they are qualified for the project. Overall, feasibility is not bad, but all topics could be better detailed.", "q1r": 4, "q2": "The proponent presents 4 KPIs that would serve as ways for us to understand whether the desired progress is being achieved: “KPI 1:\nThe projects developed during the hackathon (…) + KPI 2: The number of students incubated as interns for the development and implementation of smart contract solutions needed by these corporations/businesses. + KPI 3: The number of students offered job opportunities within these corporations to progress with the development and implementation of more smart contract solutions within their operations. + KPI 4: Development of EBU Hubs as a result of larger masses taking interest in the use of the Cardano blockchain technology”. However, I believe that in addition to the partial results, we must understand what the work behind it would have been like. For example, we know that the first KPI is based on the projects developed during the hackaton; How can we verify if, in addition to the projects, the learning process was adequate, if the possible doubts were solved, if the students really made the best use of the knowledge provided here? How can we understand that the internship program, suggested in KPI 2, would be as beneficial as possible, both for students and for companies? And how could we monitor the work done by the team members, by the university team, behind each of these small successes? The proponent also lacked an explanation of how this information would reach the members of the Cardano ecosystem. Would there be reports, so the community would be constantly updated? Perhaps through social networks, the university's website, through the participation of the team in Townhalls, how would this contact be established? For these reasons, I believe that auditability is well underway, but not yet adequate. Speaking of the success scenario, that is, the final results, what are suggested are very clear ways of realizing if the project would be achieving what was planned: “students build great projects during the hackathon that solve the problem statement / have more students sparks interest in learning Plutus/Haskell and enrolls in the course as a result / students get internships and even job opportunities, applying their new knowledge and skills to real business applications / EBU Hubs development starting in Kenya, where they come from most of our students, and eventual expansion in Africa and the world”. In my view, what remained pending here was: to study in more depth the impacts generated for the companies themselves, how they would be facing Cardano's technologies, how such technologies were useful for their businesses to be preserved and their revenues to increase. In general, understanding how our blockchain would be entering the market - the observations pertinent to the students are ideas, in my view. So the suggestion I make is that these data are also studied and that all the information is gathered in a final presentation, which could be done through Townhall, for example. Auditability, as well as the other topics of this proposal, is good, needing only a few improvements.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 10572, "q0": "“Hackathon and Internship Program” is a good idea and it is suitable for the challenge of “Grow Africa, Grow Cardano” because as far as I know, Africa is an underdeveloped region, and many areas in this country are still limited, especially are the economic crises of recent years in Africa that make businesses unable to afford to grow. Besides, Blockchain technology is still a relatively new technology, not yet applied in many parts of the world, it has only been popularized in some regions and developed countries such as the United States and some other European countries. This proposal has deeply emphasized an issue of concern today, that is: \"Over 90% of African businesses are SMEs and cannot afford traditional business protection through a lawyer. This factor puts them at risk of losses in case of contract breaches and non-commitment\". Through this program, the proponent wants to introduce the Cardano ecosystem and Blockchain technology more to a larger market that requires students to build smart contract solutions for a larger market number of businesses in this locality. I see that this is an important issue and has a relatively large impact scale with the current situation, universities and research centers are built everywhere, which means that the number of students is increasing day by day. Moreover, this is the human resource for socio-economic development in the future. Therefore, creating a platform that brings opportunities for young people to access and experience the Cardano ecosystem is an extremely useful and meaningful idea. I think, if this project is successful, it will increase the number of participants and scale-up up the Cardano ecosystem. Besides, to ensure students continue to apply the knowledge and concepts learned, EBU plans to hold a hackathon every semester, Students will also have a chance to win prizes for their proposed method. It can be seen that it is worth mentioning that the new participants are all young people, they will have many ideas, more creativity, and a relatively new perspective on an issue that they are approached to help a lot in promoting the overall development of the whole ecosystem. Not only that, but it also creates conditions for the young generation who want to work on Blockchain technology to have a stable job that matches their interests and passions. Specifically, here students will be interning at these corporations as they build on these solutions. This not only creates potential future employment opportunities for them but also a way to solve real business problems. The plus point here is that in addition to presenting the great impacts of the project, the proponent also offers and explains the solutions in detail and is easy to grasp, the solution clearly states the purpose and the focus is that through the hackathon businesses will be able to implement smart contracts for their operations, thus building and empowering them and more potential job opportunities will emerge, increasing the incentive for newcomers to develop Cardano. In addition, by pointing out the risks and challenges that the team will face when implementing the project, which is \"Natural difficulty of the Plutus/Haskell course might limit students from completing the course which is a requirement to benefit from the program.” or “Not having 100% of our students getting internships”. Although the challenges are relatively huge, the proponent has proposed strategies to reduce those risks. However, if possible, I hope if this project is successful with students, it will be extended to many other audiences, people who work in other fields but also want to learn more. about Blockchain technology, learn about Cardano. To do this, I think the team can build both online and offline scenarios to suit each audience's adaptive conditions.", "q0r": 4, "q1": "This proposal presented the implementation roadmap with 2 main milestones and the work and tasks to be completed for each of them. However, I found that, instead of just listing those tasks, the proponent should add a more detailed plan, such as Milestone 1: start and end time of the organization Hackathons? Where is the venue? Who will be assigned the main responsibility to control the process and the quality of each stage, etc. thereby making it easier for everyone to grasp the overall situation and control the results achieved? Regarding the budget, the proponent has also given a fairly clear and detailed outline, allotted and clearly explained the 3 purposes of using that budget, specifically the budget will be used to award prizes are $2,100 and an internship portion of the program is $18,750, Logistics and planning $5,000. This specific detailed planning, helps everyone see more transparency and rationality, and helps control costs and avoid unnecessary waste. However, perhaps there is confusion here, the total budget detailed is only $25,850 but the team is leaving a total value of $26.000. Regarding the participating team, the proponent also provided information about the full names and positions of the participants, including the Director, Technical Administrator and Support Officer, Scholarship Program Coordinator, Data Scientist, and Instructor, according to which the proponent also attaches a LinkedIn for easy access and inspection. However, in my opinion, this section should add more working experience and suitability of each member in each specific position in this project to increase credibility and persuasion.", "q1r": 4, "q2": "To measure the progress and success of the project, the proponent has provided very specifically and clear KPI groups, divided into 4 parts with 4 different contents. However, in my opinion in this part, if possible, the proponent should add more specific data so that people can easily evaluate the effectiveness. The success of the project is also presented in great detail, separated into 4 stages for everyone to follow more easily. Thereby, I see that the auditability of this project is relatively high. This is a completely new project but it is not difficult to realize that the team has planned and built very detailed and methodical and reasonable, full of aspects. With these strengths, I think this proposal will be approved.", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 3, "ne": 3, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 12927, "q0": "Hackathons and internship programs of students of the European-Luxembourg University of Business (EBU) are the proposed ideas. Solving this challenge the practice at the enterprise is appropriate, testing the Smartcontract for the operation of the business with the holes of students to create confidence for students in the process of working. The impact on the Cardano and Blockchain communities is employment for graduates, motivating businesses to apply Smartcontract, Cardano, and Blockchain to business activities. The proposal can solve future challenges when building DEX, Smartcontract for businesses, attracting plutus/haskell learning to get jobs for graduates. The goal is in line with the challenge, with the trend of sustainable development. The difficult risks of the Plutus/Haskell course have limitations for students, the ability of students to undertake internships can also affect the success of the proposal this is a risk that is easy to meet during the learning process to limit the strategic EBU risks based on the university's reputation and the partnership with the internships. Economic team, this solution can minimize the risk to a low level. However, the mitigation should show how attractive and valuable the Plutus/Haskell course is. I have an opinion on the risks that occur when the ADA/USD slide, there should be a backup fund for this.\nRating: 4", "q0r": 4, "q1": "EBU facilitates students taking the Plutus/Haskell course to provide knowledge for an internship that is what we see. The information on Github, Wedsite information about the university, featuring student feedback videos are factors that show us that the implementation of the proposal is highly feasible. Members who make competent proposals are seen through Linkedin, which has a division of work according to the competence of each suitable person. The first work to be done is to organize the Hackathon and implement the internship plan, the specific time to implement has not been announced. The amount spent on the proposal details the $2100 Hackathon prize, internship costs, money to run the program each semester creating more demand for Cardano smart contract developers. The budget analysis is detailed, indicating how much money is being used properly. \nRating: 4", "q1r": 4, "q2": "The success of the proposal given in these 4 stages are visible results with the number of projects carried out by the students, the number of students involved, the development of EBU centers in Kenya, etc. The proposal should show us more specific numbers for example: The number of students enrolled in the course? How do students achieve results and their ability to apply? Reasonable KPIs consistent with the success of the proposal, KPIs on the number of students, projects created, businesses with students coming to internships are auditable through periodic EBU reports. \nRating: 04", "q2r": 4, "assessor": "z_assessor_3514", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11384, "q0": "Cardano is one of the biggest cryptocurrencies by market cap. It's designed to be a next generation evolution of the ethereum idea with a blockchain that's a flexible, sustainable and scalable platform for running smart contracts, which will allow the development of a wide range of decentralised finance apps, new crypto tokens, games and more. As African businesses are SMEs and cannot afford traditional business protection through lawyer exposing cardano and blockchain ecosystem help students to develop smart contract solution for local businesses. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project plan is detailed in two milestones the first includes organising past successful students from groups who work on projects based problem statement and working projects during hackathon and winning team get awarded. The second includes business requiring smart contract solution and employment creation for interns. The budget is outlined clearly and broken down into idenfiable items. The people working with the project has academic Dean and European business university. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by measuring KPIs including number of projects developing during hackathon and students incubated as interns for development and implementation of smart contact solutions, students offered job opportunities and development of EBU hubs in the use of cardano blockchain technology. As students build great projects during hackathon and who landing in internship and job opportunities by applying knowledge and skills to real business applications helps for success. This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 9845, "q0": "The proposal addresses the challenge well, as the case of businesses lacking protection due to inability to hire a lawyer being at risk of losing cases of business contract breaches and non commitment is real and high. The proposers proposal of building a smart contract solutions for local businesses through internships and hackathons is absolutely great as it even gives the participants of the hackathons and beneficiaries of the internship a great learning opportunity, whiles offering real life solutions to businesses. ", "q0r": 5, "q1": "With the experience and plan outlined, the proposers will be able to implement successfully the proposal, as they already have a great track record of work in relation to the proposal. So funding this proposal will be a  great advantage to offering real life solutions to businesses through the hackathons and internships.\n\n\nThe team has done well by giving out information about themselves and their field of expertise.\nInterestingly, they are all of the European Business University (EBU), which makes it great in respect to implementing the proposal.\nTheir individual roles comes out nicely into the implementation process. \nThis indicates that the proposers have a great knowledge of the entire proposal.\n\nWhat is somehow not clear is the inability of the proposers to set specific timelines in respect to dates or time of implementation of the proposal. I think being specific with timelines will have the implementation plan more solid.", "q1r": 4, "q2": "The information provide is great to commence an audit into the project but the absence of the timelines in respect to each milestone or output is gonna make it challenging measuring the KPIs and tracking the progress of the proposal. \nSetting a 14 weeks for the implementation of the proposal is not enough to help with the auditing but a breakdown of each week and the milestone to be achieved. This will make auditing the proposal much more better.\n\nAlso, the budget presented for the proposal is ok and clearly stated but what is still made unknown is the absence of the breakdown in respect to the cost for the logistics and planning which cost $5,000. Giving a breakdown to the cost could have been great to enable Auditors of the progress of the proposal really have a clear picture as to what the $5,000 is really used for interms of the stated logistics and planning. What goes into the logistics and planning should had been made know.", "q2r": 4, "assessor": "z_assessor_3109", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9244, "q0": "The proposal in question corresponds especially to two key points mentioned by the challenge. Mainly by offering a solution to infrastructure problems and by involving the education of a public that has the potential to generate value for the local community in Africa.\n\nThe problem was clearly described and your solution seems to be well connected.\n\nA question worth raising is about the size of the problem, if compared to the proposed solution, it seems to be disproportionate. In addition, the difficult mission of gaining scale with this project.\n\nAnother sensitive point is that the proposal could generate more value for local SMEs from the use of smart contracts as a tool, than from spreading the adoption of the Cardano community. This last one seems to me to be more of a secondary gain.", "q0r": 3, "q1": "The strength of this proposal lies in the information presented about the team involved. Good references were provided on the competences of the members and the overall structure of the initiative.\n\nThe action plan was divided into two major milestones and detailed in macro deliverables. In this respect, the author could have presented a structured timetable for the implementation of the proposal.\n\nAnother detail that remained pending was the requested budget. The values referring to the award and a value indicated for the cost of the internship program were indicated, which would be important to understand how these costs were estimated. The logistics and planning stage also had an unclear budget.\n\nRegarding the risks involved, these were presented in a structured way, with a clear proposal for mitigation. This point is also one of the merits of this proposition.", "q1r": 3, "q2": "The author has a clear vision about what success means for this project. From the points listed, we can make a direct correlation with the pains that the challenge seeks to solve.\n\nHowever, on the ways to monitor the progress and development of the project, the proposal presents little information.\n\nFive indicators were indicated, which are in fact relevant, but it was not informed how the development of the project can be monitored by the community, nor what would be the expected results for each indicator, so that we have a comparable reference.", "q2r": 4, "assessor": "z_assessor_3035", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8872, "q0": "The presented plan helps students to build a solution for the problems faced by SME's of their own country which not only helps socially it also helps them to achieve self reliability of their own country.\nHackthon helps students to have clear knowledge regarding blockchain projects and also helps them to learn new programming language by which they can build their own website/app in the future ,  hence this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "As conducting hackathon wont be difficult task to any team , the main challenge here is providing tools to the students through which they can achieve the objective of the project.\nas Dr. James Mulli has great experience working towards development project, he can guide the students for the improvement of the project.\nWith the achieved project SME owners can rely on cardano's indirectly for any small help or insurance , during occurrence of uneven event hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal has failed to explain how they'll provide tools or software to achieve the goals of the each student's project, and proposer could have provided some basic session to students to efficiently use the open source software available in the market.\nThe proposal has introduced to a team with whom he'll be working with and provided role of each person in the team, the proposal even contains proper budget feasibility , hence with information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7868, "q0": "The proposal provides a detailed explanation of an hackathon and internship program and also intends to achieve is very vibrant. They provided EBU scholarship demographics and students testimonials and it is subsidiary for students. The teams offer Haskell course, edified in English for a period of 13 weeks and partnership established between IOG and EBU and out of 140 students 25 are prosperous. The students will build more perspicacious contracts on the cardano blockchain. Internship will be able to have clever contracts implemented for their operations and inturn increase job opportunity and helps for inspiriting more people to take on cardano development. The proposer is additionally vigilant of various risk involved and withal how to surmount them. ", "q0r": 5, "q1": "The proposal comes with a elaborate plan. The team also has put up a detailed scheme of how they plan to get this done and the milestone look doable. The proposer mentioned about organising the hackathon and internship program. In hackathon program the top three victors will be awarded and for internship team $18750 has provided and the experience of the proposer is very brief role of the members are clearly identified, no other members expertise is showcased who might contribute to this proposal. The team has a compact plan and do not intend to return for more funds as they believe to complete the project in its entirely in just one go. ", "q1r": 5, "q2": "The proposer provides well defined KPIs about the development, implementation and opportunities provided in hackathon and internship program and also they allow people in Africa to connect through internet and make use of the cardano blockchain technology. Inturn helps the students to build new knowledge and skills about real business application and as this is a new proposal they could come up with similar plans next time around to make sure great minds are put to the right use. ", "q2r": 5, "assessor": "z_assessor_2929", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 448, "q0": "EBU I believe addresses the current and future bottleneck of Cardano. The current bottleneck as more and more of the Cardano community understands, involves the lack of developers understanding and building on Cardano. While the future bottleneck is, when we have addressed the developer pipeline how do we address finding them employment. It's something that needs to be tackled together, which one part of it is already being done by EBU.\n\nAs a trusted partner of IOG, who are given the responsibility to develop the syllabus to teach on the languages of Cardano are now submitting a solution where it provides employment of their students through a hackathon and internship program. The internship program as suggested by its name is quite straightforward while the hackathon's intent is to build awareness of the graduates from EBU. The support and success of this program can become the gold standard to implement in similar regions and ecosystems.", "q0r": 5, "q1": "The EBU team behind this proposal are more than capable of delivering on their targets of this proposal. Being an official partner for IOG that uses the materials developed by IOG, ensure a certain standard of graduates. Rendering their intent to have this hackathon effective for students involved would have been exposed the high quality education on Cardano therefore capable of creating working smart contracts or executions.\n\nTheir internship program is that of a typical internship with the only difference being the skillset offered. A standard type of program that is offered around the world. Something that EBU would be accustomed too. This is also reinforced but the metrics they shared of previous program results. ", "q1r": 5, "q2": "As stated above, there was a metric regarding their past program performance in the early section of this proposal. This then  potentially becomes our benchmark to gauge whether their current KPI is a continuation and can be achievable.\n\nThey have identified all the right metrics, from identifying the potential risk, a clear roadmap, a detailed budget and achievable KPI. All their planning is actually based on their previous graduate achievement, where of 140 participants who took it, 25 successfully went through the 13 week Plutus/Haskell course. Hence the hackathon participants are divided into 5 groups of 4 and where the paid internships are for 25 individuals.", "q2r": 5, "assessor": "z_assessor_2088", "no_vca": 16, "ne": 1, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 7412, "q0": "Africa is the continent Cardano laid the first practical application, every process is implemented quickly and efficiently. EBU is a university with students from 85% of African countries, an impressive number. This proposal creates a Hackathon for EBU students, clearly, the proposal is suitable for the Challenge\nHappy to know that Plutus/Haskell courses have been taught to students, one of the important classes of knowledge. The Hackathon plan creates a playground for students to practice what they have learned, and at the same time helps companies apply blockchain technology to recruit quality personnel. Contribute to Africa and Cardano's influence here\nAs for the risks and the natural difficulty of the Plutus/Haskell course, I think if the student is determined and wants to develop into a global citizen, and at the same time has a dedicated team of teachers, it is very easy to overcome. The second problem does not help 100% of students get an internship. In addition to the businesses, you associate with you can keep students who want to become teachers and practice at the school. At the same time, it is proposed to be able to combine with large organizations in Africa like Wada, they have a lot of projects being implemented in the Cardano ecosystem.\nI only have a few small suggestions like that, this part you guys deserve 5 points\n", "q0r": 5, "q1": "Regarding the detailed plan, the proposal lists 2 major milestones and small activities within. All logical. This is a flexible Hackathon race in terms of starting time, however, it is recommended to also estimate the time needed for each activity (how many days, weeks ...) for the community to know and follow. As for the detailed budget, the expenditures are appropriate, the total budget is $26,000. But in my personal opinion, to encourage and motivate students to study and rub, the reward should be increased, because each team has many members.\nThe team consists of 5 members with extensive experience in teaching, all working at EBU, this proposal is within your reach.\nAnother plus is that the proposal will not come back for more funding, you are confident that it will resonate and businesses will join hands with you, which is very respectful. With all of the above, I'd be happy to rate this section 5 points\n", "q1r": 5, "q2": "There are 4 suggested KPIs listed, all easy to quantify and test. The index should be added: the number of businesses accepting interns and the number of students becoming full-time employees. This is an important indicator of the success and impact of the project\nIt is proposed to create a social page link about the Hackathon, to update the results as well as promote the image of the contest, helping to attract more students and businesses with abundant human resources. It's also a way to report progress to the Catalyst community.\nThe success of the project is a very desirable thing, it is a premise for the development of Kenya, then the whole of Africa and the world. I give this part 4\n", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7298, "q0": "This is a great idea, because the success of the project benefits all parties, through the connection between Schools, students and the Cardano ecosystem with businesses. It is the fact that EBU at the end of the term of the Plutus / Haskell course to let students apply the knowledge and concepts learned at the school will organize a Hackathon on the Cardano block chain, excellent students have the opportunity to receive prizes, such as: Thus, creating a playground for students, being able to test and evaluate their learning, help students hone their knowledge and earn more income, especially stimulating students' interest in the Cardano ecosystem from That helps build and expand the ecosystem more. Based on the experience as well as the relationships between EBU and corporations, small and medium enterprises in the world, especially businesses in Africa, connect and cooperate with them, for students to practice. Remote learning via the Web is very convenient, creating EBU centers where students can receive support and internet resources, students grasp the needs of the application of Blockchain technology of student businesses will come up with a smart contract solution all based on the cardano block chain to improve their operations, after finishing the internship students will continue to develop for the business, thus helping students jobs, businesses recruit the right people, the Cardano ecosystem grows stronger and more sustainable in the future.", "q0r": 5, "q1": "The plan is given with clear and scientific work content and implementation roadmap, divided into 2 milestones corresponding to Hackathon organization and internship program, more perfect if the proponent attaches more milestones. specific time. Through LinkedIn profile, team members are provided with full details of work experience and skills, they are all working at EBU in accordance with the work content of the idea, the budget of the proponent Give reasonable details of expenditure items for each work content, budget including logistics and planning. The positive thing about this proposal that I find very cool is that through the Hackathon program it creates awareness and increases visibility for students as Cardano smart contract developers with the ultimate aim of helping them get jobs in the organizations where they will build these solutions. Through employment, developers will then be able to sustain themselves. Furthermore, after the launch of the pilot program, the program will disrupt the required market and the EBU will be able to run the program every year as planned, with support from these organizations, without additional calls. capital from Catalyst to make similar content. The publisher considered the challenges and risks involved and offered a full solution to successfully implement the project.", "q1r": 5, "q2": "The proposal is a combination of close support between the School, students, Cardano ecosystem and Business. The proponent has given the implementation process with a very scientific, rigorous step-by-step order, the work goals, the clear solutions to deal with specific milestones. The descriptive KPI indicators are clear and easy to understand, with 4 main indicators, corresponding to the main indicators, there are many secondary indicators and attach specific target time, thus helping the voter community easily Easily track the successful implementation of the project. The proponent also actively presented the picture of success with 4 phases and sustainable development goals to motivate stakeholders to strive for success.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6109, "q0": "Africa is more than 90% SME, inability to protect traditional businesses, this is a factor leading to loss of contracts and non-commitment. To solve the problem, idea groups through Hackathons and Learning Programs will introduce Cardano and the Blockchain ecosystem, and build smart contract solutions for businesses. There are 85% of students from African countries out of a total of 7,700 students. Students will take one course, Plutus/Haskell courses and are taught in English for 13 weeks. Successful students will build more blockchains, encourage development and build the Cardano blockchain in Africa. In my opinion, the proposal describes in detail, is easy to understand, and the specific solution impacts the challenge. In addition, the team recognized 2 potential risks and had strategic solutions to mitigate the risks when the proposal was implemented.", "q0r": 5, "q1": "Regarding the roadmap, the team has broken down into milestones, where these milestones describe very specifically what needs to be done for the project to come to fruition. With milestone 1: Organize Hackathon, organized with different jobs. Milestone 2: The internship program is divided into 4 detailed outputs. In other words, the tasks are presented and explained in detail. However, it would be nice for the team to analyze the work in a timetable. When will the work begin (day, month, or after funding), and by what time the project will be completed. Which expert will do what work to get to the end result. For the requested budget. Proposal asks for $26,000. less than 10% of the total proposed budget. The team presented a very detailed budget table for each area of ​​work allocated: Hackathon, which is an allocated budget for 3 rewards. Internship program: students practice for 3 months. Finally, the logistics and planning. About the team, the team has 5 core members. We know who they are, their identities, the skills needed to do the work on the project. We know the roles and responsibilities of each member of the project and are attached with links so we can have factual evidence of their history and work. In my opinion, the feasibility of the proposal is fine. There are some issues that can add more detail.", "q1r": 4, "q2": "The team cares a lot about this part of the project. The team provides many detailed and insightful ways to measure project progress and success across 4 KPIs, and we can measure as time goes by (Hackathon duration: 1 week per period for 14 years) week; 3 months internship period). It's a qualitative analysis, meaning we know what to expect and the effects this will have on some aspects of the Cardano ecosystem, especially people, which are central to the project.  About the final product is the success, which is what is expected in the project. I believe the information is complete and satisfactory for us to transparently and securely audit. The proposal has a detailed roadmap and a qualified team that will help develop the project successfully. Since we are provided with a lot of information, I believe the auditability of the proposal is very good. If the proposal is successful and properly developed, it will be a new step for the team, students, businesses... Africa and Cardano development", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 4371, "q0": "I find that this is a very good proposition for businesses in Africa, especially for SMEs, as they run the risk of losing money in the event of a breach of contract and non-commitment. We all know that business plays a very important role in the development of a country. Especially for developing or poor countries, the role of businesses to revive the economy is extremely important. This proposal thus addresses the goal set out in Challenge: Grow Africa. Because protecting businesses in developing countries in Africa. I think the beauty of this proposal is that the team introduced Cardano and the blockchain ecosystem to the market. And businesses are interns who are students to build smart contract solutions on the Cardano platform. It is not only good for businesses but also good for the young generation of the country when it comes to making technology products that are useful for the country. I strongly believe in the impact knowing that EBU has an active partnership with IOG. This information combined with the idea outlined in the proposal will add value to the Cardano ecosystem provided the proposal is implemented. It also has great potential to expand in the future because the resource is the students who are still very young and have many development conditions in blockchain technology. In summary, I appreciate the impact of the proposal and look forward to it being implemented soon to become a reality.", "q0r": 5, "q1": "In the proposal you listed the number of group members as 5 people, not to mention about 20 students participating in the program. In my opinion this is the right and necessary resource to implement the proposal. The identities of the group members are made public. I see that the members are all experienced and professional people who completely ensure the feasibility of implementing the proposal. In the planning section, the implementation method, the team has implemented it very clearly and is suitable for the university environment with many students. For me, it's a very good way to utilize human resources. However I would like to know more about the technology applied in the smart contract, is it simply plutus/haskell? Or are there other programming languages? Organizing software programming competitions for students is a great thing, I fully support this plan. In the proposal, the team took the risks exactly as I feared. It is about the quality of smart contract programming and the quantity when not 100% of the participants are enough. You are very correct in providing solutions to overcome those risks. Let me have a personal opinion, giving another risk, which is: Is 100% of student smart contract programming products thoroughly tested by teachers or experts? For example: If there are poor quality programming products, how will the team fix it? I think this requires a strict monitoring mechanism, not only for the quality of the smart contract programming product but also for the copyright for good programming products. Will good quality, excellent smart contract programming products be protected by the team and IOG?", "q1r": 4, "q2": "From what the team has shown, I think there is a high possibility of a transparency audit. You have clearly stated the solutions when implementing, clearly described the problem, and are easy to understand. You are a professional in training and implementing recommendations to your strengths, I believe. The team identified important milestones in the implementation of the proposal. However, I would like to comment on the roadmap - implementation milestones: You should add timelines so that readers can easily assess the progress of the team's work. This is an important factor to be able to audit and demonstrate the high transparency of the proposal. Even better, the team has given the desired indicators to achieve, which will clearly show the goal that the team needs to aim for. And the KPI is what I want the team to show in this proposal, the team has done it, KPI is the measure that any performance reviewer needs. Teams can share more about students' work. It could be smart contracts on the Cardano platform, so who will test the results of these products? And how will it be applied in practice in businesses? I want to ask more clearly about the actions that are considered to be the bridge between the products of the students and the current businesses (bringing products to introduce and businesses to apply at work).", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 3384, "q0": "The current proposal is aligned with the challenge objectives since through the hackathon organized by the university,  students would be working on projects on Plutus/Haskell, and also developing smart contracts for corporation and businesses in Africa.\nBy doing this, those companies will adopt the Cardano blockchain technology and will have to train their own employees on this, which will increase Developers, meantime, based on the success, other partners businesses may catch an interest to the blockchain et decide to join.\nDoing this will increase the number of proposals offering solutions to infrastructure and education concerns in the continent, which is one the challenge objective.\nReason for me to rate with a 5 star.", "q0r": 5, "q1": "As an project initiated by a Professor and that will include students, there is much chances of success, since the outcome will be evaluated and included in the final university results.\nHosting a hackathon will allow students to work on projects around Plutus/Haskell and use their knowledge and expertise to the benefit of the cardano blockchain. Being in their field of studies, the results of those projects would mostly be positive and feasible, while applicable practically by some of the corporations and businesses that proposers sill be approaching in Africa.\nAmong the proposers team, there is a Plutus/Haskell Instructor who would be an asset for the team to follow up the projects developed by students while supported by his team partners.\nHowever, what may be missing in the proposal is to learn whether corporations and businesses have been approached around this proposal, and if yes, what are those?\nFor the students projects/topics, are these identified by students themselves or proposed by the university (Instructor) ? these two elements may help evaluate the success of this proposal.\nIt would also be important to make connection with some African universities on this project to collaborate with them on this, and may also have another perspective to share with the team for the success of the current proposal.\nContrary to what the proposers mentioned, I would see this type of proposal go back to to the project catalyst from more funding before it can be sustainable, since the number of businesses & corporations is not yet defined and may be limited at the beginning.\nThe budget breakdown describes important project sections, however there are few details on how the money will be spent on logistics and planning.\n", "q1r": 4, "q2": "”The problem is well described and solution aligned . The road map is well designed and deliverables may be evaluated. What would also be to mentioned, was the mechanism to be used by the community to follow the progress of the project implementation. \nImplementation of hubs, host hackathon, develop smart contracts for corporations and businesses are clear indicators of clear deliverables\n", "q2r": 4, "assessor": "z_assessor_2458", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2819, "q0": "\"The idea of ​​​​contributing the solution closest to reality, will create a premise to completely impact the requirements of the proposed challenge.\n  The main goal of the solution is: cooperate with IOK to organize classes on Plutus/Haskell technology (this has been proven) for students in Africa, issue certificates when students have completed through training and testing with good results. In addition, it also provides documentation on smart contracts with the aim of bringing benefits and tight conditions to African businesses, overcoming their lack of understanding of business law leading to to business losses unnecessarily in traditional contracts. this will also have a great impact on the interests of businesses, and also open up a potential job for people and students who have been trained in this proposal. but it also affects the increase of new developers for the Cardano ecosystem who are students who have passed these trainings and developed.\n  There are two important risks that have been proposed to be mitigated. However, the risk I am seeing is that it is the painful problem language of many other national communities around the world that want to participate in learning in the Cardano ecosystem. In presenting this solution I see the group mentioned that they will teach in English for 13 weeks, so will this affect the direction of expanding the size of students in Africa? I found out that the majority of people in Africa will speak French, probably a high percentage, and most will use their mother tongue. So the workaround for this idea could be to support them in their mother tongue. Maybe the team can learn more about the cooperation with the proposal titled \"\"Cardano Legal Community in DRC\"\" link : https://cardano.ideascale.com/c/idea/414389 , this cooperation is possible more efficient in terms of scaling. \"", "q0r": 4, "q1": "\" step one of this proposal would be to commit to accomplishing training goals, organize hackathons, test students' awareness, and reward students with good achievements. *step two is the first step. began to reap the benefits of the proposal by referring students to do internships at previously affiliated corporations,... *generally very detailed for each sub-goal of the major milestones. * there is no question about the professional experience of the group as it is evidenced by the social lines of each member, and the assignment of positions is also done properly. * I have seen a what's great about the budget part that this proposal provides it's true to the title of the challenge: develop africa develop cardano, by the way the team took the funding to pay the best students and secondary, that is temporarily called a scholarship and it will also affect the interests of students to help attract more students to join classes. ugh. however, to ensure the continuity of future classes without applying for additional funding, this issue has not been mentioned by the team or the group has a plan and would like to provide more information on this issue, or the team can generate additional income from providing smart contracts for businesses.\"", "q1r": 4, "q2": "There are many metrics that can be used to measure progress or success, and they can be easily measured and verified by visiting their main page, to track the number of students and can register to experience the courses I have tried to register on, and the first training schedule will be September 26, 2022 in cooperation with the IOK organization this proposal will have a very high success rate high.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 12, "ne": 2, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 13751, "q0": "Hackathon is a competition to implement smartcontracts for business operations organized by the proposal and internship program of students of the European Business University - Luxembourg (EBU). The proposal raised the idea of hackathon and internship program to apply the Plutus/Haskell course that was taught at the university for a period of 13 weeks, Great ideas in learning and practice. To address the challenge posed by the author who has shown that practice at businesses is appropriate, students provide Smartcontracts for the operation of the business, building and empowering them. motivate businesses to apply Smartcontract, Cardano, and Blockchain to their business activities, thereby creating a strong Cardano community. The proposal is a model for addressing future challenges as the higher the demand for DEX, Smartcontract, etc. of businesses, the greater the job opportunities for students and the more plutus/haskell will attract learning. The main objective of the proposal is in line with the challenge, african students need to learn knowledge such as Plutus/Haskell, Cardano and Blockchain to serve the local businesses they live in to create sustainable development. Therefore, the proposed solution contributes to the development of both Africa and the development of the Cardano ecosystem. The proposal raises the difficult risk of the Plutus/Haskell course having limitations for students, the ability of students to practice can also affect the success of the proposal. have a risk reduction strategy based on the reputation of the university and the cooperative relationships with economic corporations.\nRating: 5\n", "q0r": 5, "q1": "The proposal, made by the European Business University of Luxembourg (EBU), offers the Plutus/Haskell course for a 13-week period to students, based on the materials provided by IOG. The proposal is informed on Github, Wedsite information about the university, the feedback videos of students to validate the author's ability to carry out the challenge. The 05-member team of authors is assigned to perform tasks for each member, there is nothing to doubt the competence of the members that have been seen through LinkedIn. The conditions for implementing the proposal are already complete, the proposal gives 02 important milestones to implement the Hackathon and the milestone of implementing the internship plan but there is no specific time to carry out the work. The budget breakdown clearly divides the Hackathon, interning in addition to the money to run the program each semester to create more demand for Cardano smart contract developers. The total proposed amount is $26000 in line with the installed challenge implementation funding.\nRating: 4\n", "q1r": 4, "q2": "To audit the proposal, there were four stages of the challenge that were recognized by students building projects, attracting plutus/haskell learning. The proposal does not include specific numbers for example: How did 25 trainees achieve results? The number of students enrolled in the course, the ability, the assessment transcripts for each student? The kpi proposes to give 04 KPIs is reasonable in line with the success of the proposal, through KPIs we easily see how the Hackathon takes place, the number of students who are trained, the opportunity to find a job of students. I agree with the fact that the proposal can be audited.\nRating: 04\n", "q2r": 4, "assessor": "z_assessor_3777", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14494, "q0": "This project enhances EBU students ability to participate in internships at various businesses while also assisting big and small businesses in having access to potential lawyers. Moreover, students have a great likelihood of not being unemployed in the future. All actions concerning the establishment of smart contracts, in particular, are done out on the Cardano ecosystem, which benefits the community greatly. Not only does it broaden the African market, but it also allows more Europeans to learn about and participate in this unique ecosystem. Even if additional obstacles arise, the approach will adequately handle the problem at hand.", "q0r": 5, "q1": "The proposal includes a detailed plan and explanation of how it will be carried out. They have provided information on the team that will be working on the proposal as well as their experience and skills. In addition, social profiles of team members, such as LinkedIn profile links, are included to check their credibility and skills. The proposer has requested a $26K fund and has provided a detailed budget breakdown. Based on these breakdown, it is reasonable to conclude that the requested funding is adequate to carry out the project. The team also evaluated potential risks and proposed a strategy to mitigate them. With the details presented for feasibility, it is very likely that the project will be implemented.", "q1r": 5, "q2": "The roadmap offered here is clearly stated, with clear milestones and a timeframe that will help in keeping track of the project. The metrics/KPIs chosen are good indications of project success because they count the number of projects produced during the hackathon and the number of students incubated as interns for the creation and execution of smart contract solutions. The SDGs and subgoals will also be used to assess the project's success. The information provided is sufficient to assess the proposal's success and progress.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Through the program, we would expose Cardano and the blockchain ecosystem more to the larger market, and have our student developers build smart contract solutions for some of these local businesses.", "experience": "Dr. James Mulli, Academic Dean of European Business University - Luxembourg has years of experience teaching blockchain development and has implemented several smart contracts. EBU has an active partnership with IOG to teach Plutus/Haskell course in a structured and guided form."}