{"id": 418146, "author": "kmuhindi", "title": "Buy Ada with M-PESA", "url": "https://cardano.ideascale.com/a/dtd/418146-48088", "category": 26600, "amount": 41000, "description": "A large number of Kenyans have heard about crypto but, currently there is no easy way for new users to get started with buying crypto. Most options are global exchanges with difficult KYC processes.", "f6_no_assessments": 9, "f6_rating": 3.8518518518518525, "videos": [], "media": [], "f6_assessments": [{"id": 1684, "q0": "The proposal is well in line with the objectives of the challenge, I'm just not sure about the innovation aspect involved here. A mobile app is said to be launched to make it easier for Kenyans to buy Ada. A tool called “M-PESA” and a digital wallet of the user's choice would be used. It would be important, in my view, if the proponents had better conceptualized what M-PESA is; after doing some basic research, I discovered that it is “a Vodafone mobile banking service offered in Kenya since March 2007, being the first to operate extensively”. But it would be necessary for this concept to be clarified along with the scope of the proposal, so that all readers understand well what will be done. Overall, the idea is that the app will allow users to use a service they are already familiar with to buy Ada, Dapp will provide the option to enter a digital wallet address and will guide users on how to buy Ada and make transactions on the blockchain. What I commented about in terms of innovation is because there is already Binance's Dapp, which is quite simple and widespread for the cryptographic community to carry out this type of transaction. On the other hand, it is very interesting to combine something that Kenyans have already heard about or even use, with a new technology that can often be predatory (complex in the eyes of those who do not know about blockchain, etc.). Another advantage of Dapp would be that, according to the proponents, in addition to buying our cryptocurrency, Dapp will provide a function that will be a listing of services and products that the user could pay with Ada; which is a very interesting idea to increase Cardano cryptocurrency use cases in the practical life of this target audience. For this part, it would be interesting if the bidders had already presented some partnerships with companies that would accept payment in Ada, so we have a good idea of ​​what kind of business we are talking about. An excerpt that, in my view, summarizes well what the objective would be with the funding of this project would be “to enroll new users in cryptocurrencies through the Cardano blockchain and make them actively participate in transactions so that they become more accustomed to the idea around the cryptocurrency and at the same time make the Cardano blockchain the dominant player in the Kenyan crypto space.” And with that, it is expected that more and more Kenyans will get to know blockchain technology and make use of the tools available, which would popularize Cardano across Africa, as it seeks the challenge, and foster the growth of our active community. Thus, the objectives of the challenge would be directly addressed: the number of digital wallets would potentially grow with the launch of this project; the number of Ada in circulation as well; and if all goes well, more people will get involved in ecosystem projects, which will generate benefits for both them and Cardano.", "q0r": 5, "q1": "Speaking of the script, I believe this part of the proposal could be more detailed. Activities are reported in a superficial way. For example, we know that the total project would take 1 year to complete. On the “get user category and adoption factors for success” part – how would that be done? How would users be attracted to the project? How to make the tool popular with Kenyans, how would marketing and promotions be done? Speaking of developing the UI/UX design, it would be important for proponents to situate us in relation to how flows and mockups would be built; as well as how the coding and development process would be done, how the professionals of this sector would work for the final product to be built in the proper way and in the planned time. In other words, in my view, the script is valid to have an idea of ​​how the project would develop in practice, but at the same time our level of understanding is superficial, we cannot understand the specifics of the project, what the work routines of each would be like. professional involved. Regarding the division of expenses, a situation similar to that of the script occurs: the information is passed on in a basic way, it is possible to understand in general how the money would be used, but we do not have a solid understanding of this. Most of the budget - $16,000 of the $33,000 requested - would go towards the salary of software developers. However, what would your work routines be like? How long would they dedicate themselves to the project? What would the hourly rate be? Speaking in terms of research and training, what research would that be, exactly? Who would be trained and with what goals in mind? How would marketing, events and advertising be done? How would the $3,000 set aside for that part be used? What legal expenses would be required for the establishment of this Dapp? We know what it would cost how much, but not why. And finally talking about the team members, we only have two people already defined (Kelly and Ann). Little information is given about each one, so we don't have a precise idea about their CVs, projects they were involved in previously and, especially, if they have any kind of connection with Cardano (and if so, which one). This can be seen in the excerpt: “\"Kelly M (Software Developer): Overall project management, Design and development of the mobile application, Integration work with M-PESA API + Ann Gatende: Research and advise on market and adoption strategies. Manage efforts in product launch and subsequent user focussed events . Lead role in promotion of business partnerships\". We need to know how this duo has experience with the technologies of our ecosystem, so that we can have more confidence that they are prepared to develop this project. The second developer is yet to be defined, as I understand it; ideally, in my view, all team members would already be defined and properly presented. That said, the feasibility of the project is ok, because we have basic information on all topics, and more detail would be important in general.", "q1r": 4, "q2": "Speaking first of all about tracking the development process, the proponents say that some tools will be used, such as Asana or Bitbucket. They will be used to perform general management; it would be important for them to explain exactly how these tools work, as some people (including me) may not be so familiar with them. So for us to understand how this monitoring would be done, such explanations would be necessary. It is also said that Dapp development will be sprint and sprint, where each will have deliverables and feature oriented; in addition, the github repository will be available for internal project members to consult the progress (would external members, ie the Cardano community, also be able to access this material?). I believe that the suggested ways to audit the phases are interesting but not entirely sufficient for an adequate follow-up. It would be important that the progress of activities was also monitored, and for that the level of detail of the roadmap could be intensified. Ideally, some member of the team would be responsible for constantly updating the Cardano community on what had been done, how and when. That is, that updates on the progress of tasks, the work of each professional involved, were provided directly to our community. As the team will work with several online tools and have attached a Notion page (a site where we can include texts, images, tables and many other features), it would be very positive if any of these platforms served as a communicative bridge with the Cardano community. Talking now about the final scenario, success is seen here as numerical factors: “at least 1 million Kenyans will be able to buy Ada on the platform and use it for transactions or investments + at least 100 small businesses, in different sectors, will accept Ada ( or a Cardano-based stablecoin) as a payment option.” But a deeper analysis would need to be done beyond these numbers of users, Ada being transacted and companies that would be accepting payment with our currency. Are Dapp users actually understanding blockchain better and getting involved with other Cardano projects? The ideal, in my view, would be for the proponents to carry out a broader study to understand how the initiative would have affected the lives of these people, and consequently, what this would have generated for our community/our ecosystem. How would these people be participating in community activities, if they are? Therefore, I believe that auditability is ok too, the information passed is valid, but as with feasibility, more depth is needed.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 3317, "q0": "This is a good concept of attractive kenyan into the Cardano Ecosystem. This is challenge fit into this challenge and i can see the impact if this is implemented correctly. On the  Impact section the proposer seem not to have an up to date knowledge of some of the wallet mention like Yoroi, Nami ,which are not Mobile wallet that can be integrated in a Mobile App of this nature.  But Overall the Impact will be big.", "q0r": 4, "q1": "There is a reasonable timeline with date on the project but the seem to be lacking the core component Smart contract Development in Budget Item and the road map.\n\nThe Team seem a one man team at the moment with a Software Development Skills but no Cardano Smart contract Experience and there is no way it is mention that a smart contract Developer will be hired.\n\nI would suggest the proposer should build a team first to be part of the project.\n\nThe first milestone \"Refined market research specifically on our target groups of users and adoption considerations\" does not shows readiness as this market research would have been done to increase the feasibility of the project. \n\n", "q1r": 3, "q2": "The audit-ability of this project cannot be measure and quantified , I would suggest that proposer mention KPI in numbers , example numbers of issue fixed , number of feature completed. There is no definition of success for 1 , 3 and 6 months and there is no launch date. \n\nI like the fact that this proposer has mention the main risk \"the provider of the M-PESA payment platform may reject the application to connect to its API \" and the title of this proposal is \"Buy Ada with M-PESA\" which does not give room to alternative payment solution to be use. I would suggest that this proposer research other solution as well.", "q2r": 3, "assessor": "z_assessor_2439", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3862, "q0": "The idea of ​​​​the proposal has identified part of the problem to be solved for this challenge, but the scale of the project's impact is so large that we can extend it to many different areas. conditions are the same around the world. KYC processes have always been an issue for the crypto exchange industry, for those not easily identified it is a problem in much of Africa, but the future of Blockchain is looking ahead. . decentralized exchange, it's a good idea.\n\nThe solution of this idea is good, it identifies a few problems of the challenge, and the author of this idea argues in a logical, neat, and creative way. Storing ADA with M-PESA is a simple but effective solution, it promotes the strong growth of the Cardano ecosystem in the future as it can also connect with existing ADA wallets like Yoroi, Nami, Eternal,\n\nThe project has a detailed description of some implementation risks, in addition to some suggested solutions by the author to overcome them, but the community needs to be informed for more solutions to these problems. . That risk if the Scheme is funded. Financial, technological, and marketing risks are part of the project, when implementing the project, there will be many other risks: such as deploying personnel having a long-term commitment to the same project or leaving halfway, The factors affecting the implementation of the project schedule are considered as the main risks.\n", "q0r": 4, "q1": "The proposal to introduce unclear and detailed work implementation timelines compared with limited implementation resources will affect the project audit process. The proposal only estimates the project completion time and the goals achieved in general, the community needs a more detailed implementation plan corresponding to the implementation timeline, the author can refer to the Microsoft Project tool Management (or a similar tool) to support a more detailed and methodical schedule.\n\nThe proposed project budget is less than 20% of the total budget of this challenge, compared to the information the proposal provides, some project expenditures need to be clarified if it is to be funded. Budget requirements are usually summarized by the author. A detailed budget should list hourly wages for local workers, corresponding to the tasks of each employee in the project team. the project, and the community needs to know that, which helps in better transparency of the project. Compared to the information provided, it is a bit general and not yet a detailed budget.\n\nHuman resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that they are entirely suitable for the project. However, the identities of the members are also difficult to verify. clear. The author of this project is Kelly M (Software Developer) with partner Ann Gatende & Developer 2 (Worked) showing that this is a team with experience in implementing this project, however, the author please provide more links to identify reputable identities such as LinkedIn, Facebook, Twitter, Discord, ... for easy and practical identity verification community.\n", "q1r": 3, "q2": "This project provides KPIs for accomplishing the project's goals, but some of the goals are difficult to measure compared to the information the project provides. good that the author says: A GitHub repository can also be provided for members to access progress on tasks and issues with a daily/weekly commit view, but affiliate links do not available and are very general information.\n\nThe ideas of this project have clearly defined success, although they have not been tested in practice, it is still a good idea. A good suggestion and the author can fully run tests with a smaller model to check for himself, the performance numbers achieved whether the project is funded or not?\n\nBrand new idea information on the Cardano platform never received any funding from the Cardano ecosystem.\n", "q2r": 3, "assessor": "z_assessor_2489", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4376, "q0": "The team's proposal is in line with the goal set out in the Challenge which is \"Grow Africa, Grow Cardano\". Thus, if this proposal is implemented, both Africa and the Cardano ecosystem will grow together. I realize the goal of the proposal is to make it easy for Africans to buy and sell cryptocurrencies, this is a big step forward in information technology - cryptocurrency blockchain because Africa is underdeveloped than other continents. The ease of buying and selling cryptocurrency will gradually increase the number of people who know about cryptocurrencies and use them in daily life. This is an important factor that helps increase the value of the Cardano ecosystem now and in the future. M-PESA is an application built on the Cardano platform, I hope that there will be many similar applications like M-PESA for Cardano to grow stronger and meet the greatest goal that Charles Hoskinson and IOG's mission is to build a better world. I think the team's M-PESA application can be fully developed in terms of features shortly. This will greatly help Kenya in particular and the whole of Africa in general. I have commented on the impact of the application that you mentioned in the proposal in a very appropriate sequence. Initially, it was encapsulated in Kenya, then gradually developed the application for people in the community in Africa. This sequential increase in impact is consistent with the African situation.", "q0r": 5, "q1": "It seems that your team is full of high-quality members with experience and information technology expertise. I am impressed with the membership of Emurgo Developer Professional, but one thing I think is quite important but I have not seen you in the proposal is the proof of the identity of the members, specifically the links of the members. a social network containing profiles and photos of members making this proposal. This is important because it increases transparency and feasibility and community trust in the team. I would like the team to add the missing member's profile with a picture for the community to see clearly. The total amount requested by the team of $33,300 seems reasonable for such a potential proposal. If funded, the amount of 33,300 USD will be used by the team to implement the proposal within one year (until 8/2023). The budget allocation is shown in detail in each subsection with the corresponding amount. This is appropriate, making the community believe in the feasibility of the proposal. If the proposal is successfully implemented in practice, I think you can submit more proposals for the development of applications running on the Cardano platform in the following years. The team also outlined the plan and 7 implementation steps, I have questions: Refined market research and Deploy initial MVP version only take place within a month for each stage, is it short and the team does not have enough time to do these two stages for real quality? In some projects, the implementation of this stage takes at least 2 months. Although your staff is highly appreciated for their expertise, I still doubt the feasibility of carrying out these two stages. So can you please describe more clearly the implementation of these two stages within a month or not? On the other hand, this is a proposal that has a lot to do with information technology, specifically the Cardano blockchain. That's why I think the community needs you to explain in more detail the technical aspects, and the technology used to implement the proposal. Regarding the challenges and risks associated with implementation, you have outlined 3 challenges and associated solutions to overcome them, I have thought about one challenge when implementing the proposal in your document. friend. That is, with the elderly, do they easily absorb new technology like young people? Elderly people will have to work a lot with applications, wallets, and digital currencies on the Cardano platform. Are they happy with that? If it is an obstacle, what should the team do to overcome it? I think the team should build a very thorough user guide so that even the least tech-savvy customers can use it. I would like to take an additional risk to contribute: the African community may not or only a very small number of people accept this application. Because of the concept of digital money, digital blockchain is still foreign to the vast majority of people in African countries. Therefore, when implementing the proposal, the team should have videos or articles related to the topic of Cardano blockchain technology, and digital currency to popularize knowledge for people in the African community. Thus, we will be able to carry out both tasks at the same time, which is to improve people's knowledge about new technology and more convenient for the implementation of the proposal.", "q1r": 4, "q2": "The roadmap and the milestones are quite clear - that is, the proposal will be implemented step by step within 12 months. I just want to ask, why don't you specify the months of the year in which each stage of implementation takes place. Doing so will be convenient for the community to track the progress of the team's work. That is my suggestion. I have read the numbers the team gives when the project is successful: At least 1 million Kenyans will be able to buy Ada, and at least 100 small businesses, of different sectors, will accept Ada. But I think this is the metric you describe the success after the proposal was implemented across all East African countries even beyond East Africa, are you sure that after 12 months of being approved funding you will achieve the success as described or not? Now, are there any metrics to measure the success of the proposal after the proposal is funded? But anyway I still believe in the success of the project. Do you think KPIs are important to evaluate the success of the job? I would say that if the team includes more KPIs, it will be good to increase the transparency of the proposal. This is also what the community wants. In summary, I am very interested in the proposal you have raised. And hopefully, in the end, it will be of great help to Africa and the Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6806, "q0": "Generally, buying cryptocurrency is very much a daunting experience (Most especially Africa) for an average or new entrant into the crypto space. Most exchanges are either too classy for Africans or have a more advanced way of KYC and as such, having a native means of buying Cryptocurrency will help level these bottleneck and lead to an even better adoption. These proposal aim to build a mobile app that allows users to buy ADA using a payment gateway called M-PESA. The solution is targetted as first approach to Kenyans and since M-PESA already has KYC of over 35M users, it becomes easy to integrate and facilitate payment through their platform. However, my little concern is where the cryptos will come from and how is it guaranteed that users who send back cryptos are trusted and reliable because according to my understanding of the proposal, the payment gateway will not be connected to any known crypto exchange but probably some kind of peer to peer mechanism where only the payment is automated but token issuance is manual. If this is the case, i can only imagine the possibilities of vulnerabilities and inadequacies. Secondly, it is very likely according to the proposal that the app is just a marketplace where ADA can be purchased with Fiat and also other products can be sold and purchased with ADA. In as much as these idea will add value to the ecosystem, i see the need for more refinement to the solution presented to the problem. I see the need for smart contract to automate the sending of ADA after confirming payment and smart contract should also be designed to hold a certain minimum ADA balance at all situation to ascertain consistency and reliability and as such, these proposal does not fit into these challenge criteria. The problem works but the solution requires more refinement.", "q0r": 2, "q1": "The concrete timeline for completing the app and other integration is 12 months starting from August 2022 - August 2023 and a well defined breakdown is provided although some milestones doesn't look realisable considering the timeline allocated for them like Definition of product vision, product backlog and marketing strategy which is timed for 2wks (moreso that the team has only 2 team members according to the proposal with other roles yet to be occupied).\n\nThe requested budget amount is reasonable, however, some items are not properly broken down, there's no explanation about the technical architectural structure that are crucial to the project and not much conductible plan for implementation. I will suggest that team should do some more understudy and refine the solution some more.", "q1r": 2, "q2": "Team provided a well defined and concise means of tracking progress. The development of the project will be sprint based and each sprint will have feature oriented deliverable, project management will be open for assessment by the community, open source github repository and proper metrics will be monitored and documented. Project will be considered successful when more Kenyans are able to buy ADA using the platform and a sizeable number of small businesses accept ADA as an option of payment.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 6856, "q0": "Cardano has a mission of seeing a lot of users patronizing it Ecosystem. From the many African countries Kenya is by far one of the less inclusion in the Cardano Ecosystem. This can be attributed to the problem identify in this proposal. This problem can and would go a long way to save as a challenge that handed the successfully releasing of the Cardano mission hence it needs to be solved immediately. Then identify solution in the proposal which provides sufficient information with radiant to impact cattery that will aid in solving the identify problem. through this solution the Cardano Ecosystem will see a raise in the usage of it native token and other alternative coins thus contributing to the growth of the tracery. I strongly agree this proposal will be impactful if funded.", "q0r": 5, "q1": "In as much as the proposal looks great i feel insecure about the budget as there are some uncertainties regarding the project plan. From the budget breakdown there is an allocation for duplicated task. These tacks are \"Research and Training\" which seeds to take care of (Marketing/Adoption strategy/User events/Support) as described in the proposal and \"Marketing, Events & Publicity\". Its is not quite clear what the deferent between this two allocations are as far as budget statement is concern. More over the proposal did not capture any information on the hosting of an event which has been budged for. The proposing term should have provided answers to the following questions to help the assessment of weather or not the 3000$ dollar budget allocated for marketing, event, and publicity, is feasibly: \n1. What type of event would be hosted (face to face or online)?\n 2. How many participant do they expect for the event? \n3. if there is a face to face event then how much do they intend to spend on an event center, logistics, presenters, etc. I would like to end my feasibility argument here while been skeptical about the successful implementation of the propose solution to the identify problem.", "q1r": 3, "q2": "The term does a good job by choosing to use the Jira project management tool to record progress regarding the project. The idea of making this platform accessibly to all is indeed a good initiative to enable the community's ability to track the various activities of the project. The team also mentioned that the GitHub repository for this project would allow the tracking of the App development. However links to these platforms weren't provided to the community in this proposal. This makes it difficult for me to confirm that the progress of this project if funded can be tracked easily by the community even though a link to the proposers LinkedIn profile has being provided. I say this because a personal profile on LinkedIn may not be sufficient for the reporting of project progress as compared to the project management tools like Jira and GitHub which was stated in the proposal. \nSomehow the metrics align with the challenge and can be easily be tracked by the community having in mind what to expect of upfront. These metrics also helps to define what success looks like for this project. My score for the auditability criterion will be three as i am not too sure about how the community can track the progress of this project.", "q2r": 3, "assessor": "z_assessor_2838", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7304, "q0": "The proposal is to create a money transfer app for mobile devices, allowing users to buy Ada with M-PESA and into a wallet of their choice, I think with the development of technology, so will the smartphone market The technology is also growing rapidly, the ownership of a smartphone among people in Africa is increasing, and more and more people in Kenya know about Cardano and want to find it with the development of technology. understand to buy and trade, so with an application that has local advantages, it is easy to understand and reach people, so it will bring a suitable and timely solution that will be very suitable for the people here, By simple KYC, it will make it easier for people to sign up, giving people the opportunity to access and participate in Cardano by being able to buy Ada and use it for product and service payments. services and as an investment property, can help them earn additional income. so it has a positive impact on Cardano's ecosystem in the present and in the future, as the demand for Cardano transactions is increasing, so the application can scale to east africa and global countries. Advice because digital currency trading is always a high risk, especially for African people when their educational level is still low compared to other regions of the world, so I recommend the proponent to have Measures to help people minimize this risk to a minimum, for example, in the application should attach detailed videos or pictures on how to transact, and how to protect the circuit to avoid bad people from attacking..v.v. This will help people feel secure and increase their confidence in the Cardano ecosystem.", "q0r": 5, "q1": "The plan is very detailed, clear and easy to understand, the work contents and implementation are arranged in order according to a specific timeline divided into 7, research, production and testing stages for the project. An application like this takes a lot of work to do for nearly 12 months, and 2 months of marketing and promotion is enough to introduce the product to the market. The team member profile includes the experience and skills appropriate to the role and task assigned to successfully implement the proposal, but it will be more perfect if the proposer provides additional links such as: Linkedin, more complete members' twitter will increase trust for the evaluation community. The project's budget includes contingencies, for an application development project that has a lot of work to do, done within a year with the amount of 41000 USD is quite reasonable. To be better, I think the proponent should analyze in more detail, the hourly salary for each position, and how much time to do it, it will help the voter community easily understand and evaluate. than. The proponent has considered the risks and challenges that may be encountered and proposed a number of measures to handle for successful implementation. I would like to add a few more risks. For example, risk of being hacked, need to buy security for transactions, and implement security measures, award prizes to those who find vulnerabilities in the application, etc., Or may be owned by the government. In the case of banning local development, the proponent also needs to have a backup plan for another local alternative. I find it quite positive that the presentation of a plan for a further future after a successful application in Kenya will open up to East Africa and more broadly a decentralized exchange globally. . Shows that the proposed team has a high desire and determination to conquer each set goal.", "q1r": 4, "q2": "The project provides a roadmap with very clear timelines and well-described job descriptions, making it easy to track the successful implementation of the project. Application development will be sprint-based, and each sprint will have feature-oriented deliverables. The project will use a tool like Asana and Atlassian Jira to manage the overall project management and this panel will be open to the community for easy evaluation. A github repository can also be made available to members to access task and issue progress with daily/weekly commit view. For users using the app, the On Join campaign will be run with the target user groups. This will be managed using Asana (PM tool) so new user numbers and metrics as well as progress reports will be trackable and measurable. Therefore all metrics and KPIs are sufficient to meet the requirements for a successful project implementation. Considering the above, I think the information provided is sufficient to gauge the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11385, "q0": "KYC is the first anti- money laundering due diligence stage. When a financial institution onboards a new customer, KYC procedures are implementing to identify and verify the customers identity. These processes enable financial institutions to assess the customers risk profile based on their propensity for financial crime. As large number of Kenyans heard about crypto and no easy way for new users to buy crypto building a mobile app which allow users to buy Ada using M- PESA which is an easy way to get started with cardano. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project has detailed plan including market research on target groups and adoption consideration key for success, coding, marketing and promotions, defining product vision and product backlog. The budget is outlined clearly and broken down into idenfiable items. It is reasonable to achieve set goals. The people working with the proposal has good experience. The proposer offers a realistic timetable to complete the work and provides a sensible and conductible plan for implementation. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by tool such as Asana and Atlassian Jira to which will manage over all project management and will be open to community for assessment. On boarding campaigns are carried out with target groups and is managed using Asana and reports on progress can be trackable and measurable. The plan describes the resources necessary to implement the proposal and it clearly explains technical aspects like architecture, language and technologies which are crucial for implementation. The information provided is sufficient to audit the progress and success of proposal.\n", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 14379, "q0": "This proposal is really in the challenge where it was filed. The proposers of this proposal have thought of a problem that really requires the solution, since the lack of means for new users to buy cryptography is a challenge that even hinders the development of cardano in Africa. By creating a mobile app of sorts to buy Ada using M-PESA and in a wallet of the user's choice, many other new users will be able to register for cryptocurrency through the cardano blockchain and there this Africa which will be evolving", "q0r": 4, "q1": "This project will be feasible because the proposers have in a way shown the way the activities could take place but also their budgeting. But the budgeting does not reveal a good clarity, on this, the proponents had to deeply detail the rationalization of these funds. However, referring to the staff members of this proposal, the project could be feasible given their areas of qualifications which reassure their skills. But what proves it?, And why the second developer is not affected in this list? Anyway, this project can be feasible but after the insertion of these challenges raised above saw its relevance.", "q1r": 4, "q2": "The team of proposers proves well that it will be able to carry out this project in spite of some failures recounted there, but it is pointed out an insufficiency of the sites where the links which can be used as indicators for the follow-up of the activated ones. The Sources were very necessary to allow the verification of the evolution and the impact of the project.", "q2r": 3, "assessor": "z_assessor_4010", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Build a mobile app that allows users to buy Ada using M-PESA and into a wallet of their choice. M-PESA has 35 million KYC'ed users and will provide an easy way for users to get started with Cardano.", "experience": "Team member 1:\n\n7+ year developer\nEmurgo Developer Professional - Ongoing\nCardano blockchain developer.\n\nTeam member 2: (To Recruit)\n\n5 years experience in development.\nExperience in blockchain\n\nTeam member 3:\n\nResearch and Training Expert\n30 years experience in project management\n"}