{"id": 418252, "author": "lidonation", "title": "Swahili Learn to Earn", "url": "https://cardano.ideascale.com/a/dtd/418252-48088", "category": 26600, "amount": 38200, "description": "Vast numbers of native Swahili-speakers in Africa will not learn about Cardano or use Blockchain tools unless there is engaging educational content in a familiar language & clear incentives to learn.", "f6_no_assessments": 13, "f6_rating": 4.717948717948718, "videos": [], "media": [], "f6_assessments": [{"id": 1685, "q0": "The proposal is excellent and deserves top marks in all aspects. Started with impact analysis: the project works directly with what the challenge seeks. Here, we are looking to finance projects that benefit both the African continent, its inhabitants and so on, as well as Cardano; ie - ideas that can be useful, generating opportunities and income for the locals but that are also advantageous for our blockchain, fostering the growth of our community, contributing to Cardano being widely adopted in Africa and being better recognized and valued. That will certainly be worked on here. The problem raised is that, generally, people will not go out of their comfort zones to learn about a new technology, which is something as complex and different as blockchain. Therefore, the solution would be precisely to create a more attractive way for them to learn about Cardano and get involved with the technologies relevant to our ecosystem. This would be done by earning small rewards (in Ada, from what I understand), as users would read content and answer some questionnaires involving the various contents of the blockchain universe. Several positive points are observed here: first, the project is inspired by something that already exists (an application called coinbase), which performs the same function; probably the proponents observed how the proposal worked and will replicate it, directing knowledge to Cardano, which will certainly bring solid benefits to our blockchain. Another positive point is that the content would be produced in the Swahili language, which is certainly a very influential and strategic language for us to invest in. I say this because, in addition to the arguments provided by the proponents - that the language is spoken in 12 African countries and by more than 200 million people - I have already seen several proposals that seek to translate content in English into Swahili, that is, it is really a very relevant language for our project to invest in Africa. Another positive point is that the proponents are already financed, that is, they already have successful proposals in other funds (I remember having evaluated something of them before); but for those new reviewers and readers, they have attached the LidoNation website, where they already have a lot of content regarding Cardano available in English, Spanish and Swahili. They explain well what kind of content you can already find there (\"how to open a Cardano wallet, reviews and overviews of different types of wallets, how to buy ADA, articles on many facets of Project Catalyst and how to participate, news about Cardano and etc. \"); so we have a good understanding of the type of work they have been doing so far. And not enough, they attach a step by step of what would be done here (I consider this project as an extension of successful initiatives they have had before). In the “how do we do this” section, it is detailed what various steps would be followed for the ultimate goal to be achieved (that more Swahili speakers understand Cardano and get involved with our blockchain). In other words, the idea is very good, it is very well explained and it has everything to work out and reach the objectives of the challenge, as new wallets will be created (so that users can receive their rewards), new people will be learning about Cardano and maybe become active members of the community, in general, I found it to be a smart and accurate strategy on how to popularize our blockchain on the continent.", "q0r": 5, "q1": "The proposal script is entirely adequate; I say this because we know what would happen with a degree of detail rarely observed in the proposals. All the activities that will be developed are minimally explained, so that our understanding of the whole is very solid, we can visualize the development process with very solid accuracy. This can be noticed already from the introductory excerpt: “Getting Started -> Create multiple choice quiz questions for 50 Swahili articles on LidoNataion. After quiz questions are created for existing articles, they will be created for each new article that is published (We publish 1-2x/week. Quizzes will be first created in English before Swahili translation. The lead resource for Quiz writing is writer and educator Stephanie King. For example on the build part, we know what would be built and how (supporting content such as program description and overviews to be translated into Swahili) and we also know who would be primarily responsible for that part of the proposal (Stephanie King King). Another very well explained part, to argue what I'm saying, is testing and launching - a long paragraph is dedicated to explaining how these actions would be done. Regarding temporality, although the level of specificity is not as high as the detail of the actions, it is enough for us to have a good understanding of when these actions would be done (speaking of the examples cited - the construction would be completed at the end of the month s 3 while testing and launch are scheduled to be done by month 4). Therefore, we can move on to the next topic of analysis, which would be cost sharing. The amount requested is approximately $37,000. The value is not low, but in my view it makes sense with the breadth of the project, and without a doubt it is very well argued. The total is divided into some parts and each one is explained individually, for example, we know that the translation of the quiz would cost 1000 dollars, and that “this amount pays for 100 questionnaires translated into Swahili plus 7,000 \"words\" - worth content translation (i.e. how-to documents, landing pages, etc.) at a rate of ~$0.05/per word”. Likewise, the other parts of the funding are also well argued. Finally, speaking of the team, trust is automatically passed on to the team, since they already have other previously funded proposals; LidoNation already has a lot of content released, so it is possible to verify in practice what has already been done and the quality of the work (and the involvement) of this team. However, they also present themselves properly - we know the name of each team member, their roles in the project and professional area and a little of what they have done so far within our community, in addition to their linkedin profiles. So, in my view, the proposal is totally viable, because a lot of security is passed on to the team, the script is carefully broken down, so that we have a very detailed knowledge of what will be done and how, and the budget division is also argued with a lot of wealth of details.", "q1r": 5, "q2": "A lot of information is attached regarding the auditability of progress, and as with the other topics in the proposal, each is explained in detail. We know that partial results can be measured through the creation of multiple choice tests, we know how many tests to create (75) and also what topics would be covered (questions about Cardano, Catalyst and blockchain in general). We know when they have to be filled in and English and Swahili. Other suggested metrics are the number of wallets linked to the site, number of tests performed and NFTs granted granted. My only suggestion for this part of the proposal would be for the proponents to update us on each of the tasks mentioned in the roadmap part, in addition to the partial results presented here. As we have a very comprehensive wealth of details, it would not be difficult for the community to monitor whether activities are being carried out the way they were planned. My only question here would be, really, how could we be aware of this context - what would be our way of contacting the team? I don't think it's appropriate for updates to be posted directly on the LidoNation website, so I suggest they prepare monthly reports to be sent out at the end of each month to our community members (via discord, for example). In terms of success, the goal is for Swahili-speakers to understand decentralization and blockchain well, according to the proponents. They detail, once again quite richly, how this scenario could be better understood, in snippets such as: that they will understand why Cardano is an especially exciting blockchain project, important Cardano news, projects and partnerships; will have practiced basic blockchain interactions, including opening a wallet, connecting to a blockchain service, and receiving funds and NFTs; they will also understand the basics of DeFi, DApps, DAOs and DEXes and will have demonstrated their knowledge by passing tests, etc. Again, one more suggestion I would like to make would be in relation to the communicative bridge between the members of this team and the rest of our community. How can we be sure that the target audience would have enjoyed all these benefits? It would be important for the team to carry out a field research, post project, to understand how the participants of these questionnaires would be relating to all the concepts mentioned here; It is equally important that this information be made known to all members of the community (a good idea would be to present the final report/research somewhere after town hall). So, I think we have a lot of material to work on to audit the proposal, and we just need to establish a bridge between the project team and the rest of the Cardano community.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 8, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 13883, "q0": "This proposal clearly fits within the Grow Africa, Grow Cardano challenge in particular onboarding more users onto Cardano, providing education and offering local impact.\nThe proposers, creators of Lido Nation, have a website and community already in place with English, Spanish and Swahili resources to learn about Cardano and Catalyst. The next steps they are requesting funding for are to create more resources about opening wallets, and specifically learn to earn resources. They propose educational content supported with quiz taking to earn ADA similar to an existing popular feature from Coinbase. Through working in the education and technological integration sector for over 18 years I have experience with gamification and have seen many successful projects deliver educational goals. Although the project mentions possible rewards will be capped at $25, that is significant enough to motivate users to complete the task. I spent 4 years living in Tanzania (a Swahili speaking country like Kenya), and traveled throughout south east Africa. That small amount of money, plus the chance to learn and develop a new skill set will be very valuable and desirable to many people within the community.\nThe impact also reaches the blockchain lab in Kenya (created in fund 7) they plan to work with as Swahili translators, beta testers and local marketing leads. Having this local, on the ground support and integration allows for the impact to be felt directly within the community.\nThe proposers give clear detail as to the direct impact on the Cardano community, and the metrics that will be gathered to document the success in regards to the challenge. The proposal also highlights the ability to upscale it once the initial cohorts of learners engage in and give feedback to the learning system and quizzes. Once the initial success is achieved, the project has a clear future, but ongoing funding may be required, whether through Cardano or other means.\nThe potential impact of this proposal for the Grow Africa, Grow Cardano proposal is considerable, through the people in the African continent being able to learn about Cardano in their native language, for those who speak Swahili. I give this proposal 5 stars for impact.\n", "q0r": 5, "q1": "The team behind this proposal have provided a fantastic level of detail to assess the timeline, budget, staffing and many other implications. \nThe timeline for the proposal roll out is 7 months. Each stage is detailed with specific outcomes, and hurdles to overcome within that month. The timeline is realistic and I’m confident they’ve added enough safeguards and testing before the planned global roll out in month 5. \nThe staffing and support team behind the proposal are three main people, plus the local support of a blockchain lab in Kenya. The team have proven success with their website already being fully operational in multiple languages. Their ability to develop new content is highly likely, the only issue will be the blockchain labs ability to correlate the new content (quiz feature) and the ADA wallet payment method in the given time. The staff provide detailed information about themselves, their experience and motivations for the project to succeed.\nAs the proposers note, roughly 40% of the $38,200 requested of this proposal is going towards ADA rewards for the users taking their planned learn-to-earn quizzes. Although it is a rather large sum of money, it’s clear to see that they have calculated these costs precisely and have a sliding scale understandability from how many ‘super users’ complete everything to get the maximum $25 payment to casual users earning a few dollars here and there. This being said, the real impact of the program is Cardano ADA adoption and increasing the number of people holding wallets. This incentive is likely to offer success within this aspect of the challenge.\nThe other financial information provided clearly outlines costs along the way for salaries, the contracted work for the blockchain lab and the NFT minting costs. It appears feasible, I would suggest that the budget had an additional component for contingencies, having lived in Africa for 4 years, there is the likelihood of difficult situations, governmental, electricity/internet, and staffing related that may severely hamper the project without this financial insulation. However, it appears the team has other projects in place, so hopefully they have the liquidity to overcome any minor hurdles.\nOverall, I rate this proposal 5 stars for feasibility. \n", "q1r": 5, "q2": "The auditability information outlined in the proposal clearly indicates how and when the team plans to document their measures of success.\nBeginning with the number of quizzes created, early on in the project, the community on the Swahili-language side of the program website will be able to see these implemented. They state that eventually these quizzes will be populated to the English side of the program as well.\nA clearly auditable aspect will be the number of wallets linked to the site. The proposers plan to document each month how many new users have joined and how many wallets have been connected. A thought, possibly a minor concern, is how to ensure these new users are Swahili-speaking Africans, what’s to stop a ‘bad actor’ somewhere else translating the website themselves and completing the quiz? Without collecting overly personal information it will be important for auditability to ensure the true identity of the new users as the target audience.\nThe last key auditability factor will be the rewards given in the form of ADA and NTFs once the ADA threshold has been met. The team has explained clearly how the budget breakdown will occur for these items, and that they will continue to award the prizes as long as the budget remains.\nThe proposers go on in detail to describe micro level success attributes and public financial documentation that both lend a great deal of confidence about the proposals potential success. The proposers should be commended for the dedicated time and effort they put into such a thoughtful proposal.\nI rate this proposal 5 stars for auditability.\n", "q2r": 5, "assessor": "z_assessor_3840", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 449, "q0": "LIDO Nation has approached onboarding in a welcomed innovative way which is through the use of gamification of their translated articles. Their gamification system attempts to mimic that of Coinbase, where contributions are given a range from $1 to $5. It is capped though to $1 dollar per wallet per day. On paper this should be interesting, as the proposer has mentioned but through my personal experience, these efforts are more of complementary one and does not replace the effectiveness of free direct education. An approach that is being currently being used by many of this proposers peers.\n\nIt seems LIDO Nation seeks to establish this system to be a primary system of education on blockchain. In my experience no matter what the incentive is, if the topic itself is complicated and not engaging enough, it will face challenges in gaining traction. Let us take the efforts of Catalyst School themselves as an example, for instance Proposal Assessor. Even though the compensation are quite high for even advanced economies the growth of PA's are not as substantial as it was in the beginning of it's introduction.\n\nSeeing how LIDO Nations seeks to cap it to $1 per waller per day, this level of incentive has the potential to become wasteful no matter how engaging the content is. $1 per day is $30 per month. Even if we were to increase the incentives, there will always be stagnation of interest by the reader. An equally extensive effort would be needed in expanding the readers pool.\n\nDespite all that, it would be interesting to see how this effort pans out in Africa. Perhaps the results would be different, if so it would prove to be invaluable data as a strategy of deployment in various similar regions.", "q0r": 4, "q1": "Although LIDO Nation does indeed have experience in creating bespoke solutions that have gradually become a new golden standard of proposal transparency and display, this would be their first attempt in creating such a solution. Though as was their previous effort to display proposal in a more friendly UI/UX, that too was their first experience. And the delivered with flying colors.\n\nThe plan they seek to execute is also surprisingly in detailed. What is impressive is that they also anticipated an important challenge that I touched briefly in the first part of my assessment which is ; low traction in which they addressed in a way that uses their local insight of the Swahili speaking community. They mentioned that these communities are currently in a depressed economic situation, which although $1 might seem small, it goes a long way in the Swahili speaking community.\n\nAnother preemptive effort is anticipating gaming the system, which again they go very deep in providing 3 (three) layers of anticipation with one going as far as the potential of utilizing physical proof-of-life if needed. This attention to detail is echoed throughout their proposal which instills confidence that their efforts and plans will hopefully go as intended.", "q1r": 4, "q2": "As this is their first endeavour, having clear targets, numeric targets is essential for the Cardano community to have a general understanding where all the funds go. And indeed they provide numerous metrics, one though does cause for concern which is their plan to use NFT as an incentive.\n\nNFT currently is at a phase where it's existence is being questioned. We can see this from the attacks on Spacebudz. People are asking what is the underlying value of NFT.  Perhaps if the mechanics of their NFT were to be tweaked in a way that it can be accumulated which then can be exchanged for perhaps with some form of merchandise. This can be done by collaborating with NFT Link. Therefore it does not become just a $1,500 gimmick but actually educates that NFT is more than a *.jpeg.\n\nOther than that, they have covered a litany things, with the most important is their main delivery item, which is the Coinbase inspired gamification. The mechanics are clear, how they mitigate gaming is also clear, the educational effects of this gamification is also clear.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3385, "q0": "Incentives and rewards always attract people to fulfil a task, even if it may appear to be small. I' m sure it would be the same for the idea presented by the team in this proposal.\nLearn in a native language, and get an incentive would make  a lot of visitors of the Lido Nation website to comeback for an extra visit. meantime the person would be share that information with his entourage and attract them .\nThis approach would have a direct impact to the cardano ecosystem as many people would lean more about the blockchain, the DeFi, the NFT, open wallets and try this process by themselves when they are signing up.\nThis proposal is scalable as it may be expanded in other countries where Swahili is spoken, and this is one of the project implementation plan, and that would create a global impact, since the Lido Nation is an online platform, accessible to everyone.\nI totally support this project and rate it with 5 star", "q0r": 5, "q1": "The proposers team is composed by people with knowledge in digital technology, translation and involved in the catalyst project since the Fund-6 with a number of funded proposals with actions already carried out, and other under implementation.\nThe Ngong Road Blockchain Lab which is a community hub located in Nairobi, Kenya has been frequented by cardano lovers and curious people who want to learn.\nThe budget breakdown reflects all the necessary expenses related to the project, with a timeframe and roadmap reasonable of seven months.\nThe vision of the team to connect with other Cardano initiatives in other countries is a plan to expand this project and attract more people on top of the 500 , which is the target number for now.\nThis proposal is clear and realistic. That's why I support it and rate the feasibility with a 5 star.", "q1r": 5, "q2": "The plan to mitigate risks(team turnover, people abusing the system...) is clearly defined. the progress  ay be followed through the Lido Nation online platform.\nthe indicators of success described the necessary elements that prove the success.\n% star for auditability as information, implementation process and results would be accessible to every person interested.", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4044, "q0": "This is a thorough and substantiated proposal.  The creative idea to spread knowledge about Cardano and blockchain in general is to create an engaging educational content that uses gamification to make learning more appealing. This strategy has been proven to work in different scenarios and it is even more likely in this case due to the use of monetary reward in the form of ADA distribution as prize for the quizzes. The goals of the proposal clearly align with the challenge as they aim to grow the number of African-based users onboarded onto Cardano, increase awareness about Cardano in general and cause a local impact. Unfortunately, I could not find suggestions regarding scalability and future sustainability in the proposal. But I would add as next steps at the end of the project a search for a way to maintain the project as a going concern. For example, with the success of the proposal the team could quantify their results through the KPIs proposed and look for partners or sponsors that could fund the plan in exchange for marketing or access to potential clients.", "q0r": 4, "q1": "The team has exhibited compelling skills and experiences and they have provided LinkedIn pages for Stephanie, Darlington, Sallyanne and even for Lido nation to back it up which is enriching. In the budget section they clearly explained which type and how many members will be necessary to implement this project (they range from the translator to the project manager). The amounts requested are reasonable and their destination is very clear. It is worth noting that roughly 40% of the funds will be directed to future users in the form of rewards. The timetable they provided is pretty achievable with the resources they will have. It is good to see they left enough time for testing and for the beta phase. All in all, the plan is well written, articulate and sensible. The team is transparent when it comes to not only what they want to do but also on how they intend to do it. For example, they described in detail how the mechanism of rewards will work but they are aware it may need to be adapted depending on new information they gather or how the software ends up being developed. Finally, their assessment of the risks is conspicuous. Not only they have precisely identified risks such as turnover and lack of interest but they have also offered mitigating actions to prevent them.", "q1r": 5, "q2": "The roadmap provided in this proposal has pertinent and consistent milestones. It is very complete; it goes from the first steps as creating the quiz questions and starting the development on the website up until the rollout and the exhaustion of the prizes that will be rewarded. Also, for every step of the way there is a time horizon estimated which sounded reasonable and achievable. The KPIs chosen by the team are well-thought and translate well what success means. For example, the number of quizzes taken and new wallets linked to the site measure how engagement is flourishing in their website and tracks how much knowledge is being spread by the initiative. The solution found is effective and has a cascading effect because once someone is lured to the website and sees first hand it is both entertaining and rewarding chances are they will tell their friends about it. Finally, the team already has a pretty nice website in place where they will share every aspect of the progress of the plan which is extremely desirable by the community.", "q2r": 5, "assessor": "z_assessor_2513", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4377, "q0": "You are stating a long-standing reality: Vast numbers of native Swahili speakers in Africa will not learn about Cardano or use Blockchain tools. And you made this proposal to solve that situation, I comment that it achieves the goal set out in the Challenge, it contributes to the development of Africa and Cardano. This directly adds value to the Cardano ecosystem. If successful, this proposal could scale up in the future and solve a similar problem. I love how you make engaging content in the familiar language (Swahili) of the people of Kenya. It is a way of encouraging learning that contributes to improving the community's knowledge, understanding, and understanding of Cardano. This is very important for underdeveloped African countries. It is proposed that Swahili speakers have an understanding and access to the Cardano ecosystem, a cutting-edge blockchain of its kind. Although the team model is similar to Coinbase's, I still find it very interesting and above all the benefits it brings to the community in Africa. This is one of the proposals that I think has the most suitable goal to solve the Challenge \"Grow Africa, Grow Cardano\". I vote 5 stars.", "q0r": 5, "q1": "I am very interested in the team members because they are the ones who take the proposal one by one and implement the proposal to actual results if the proposal is funded. I see that the members of the group are all experienced, professional, with clear identities, and public and I appreciate your enthusiasm when writing this proposal. On the other hand, I would like to know more about the blockchain and Catalyst knowledge of the team members because when proposing, the members will have to convey basic knowledge about Defi, DApps, DAOs, DEXes, etc.. . to everyone. Can the team make that clear? I am satisfied with the presentation of the budget, the budget has been broken down into categories, reasonable with the goal. In the section Mint & Send NFTs: $3000, I have a question for you, can you elaborate on what the team will do if the price of ADA goes above 1 USD and you won't have enough 1,500 NFTs? The reason I ask the question is that I want everything to be clear when implementing the proposal because it is directly related to feasibility. The team has a plan and a good way to execute it. Regarding required resources, I want to emphasize human resources i.e. team members. With that said, we need at least one member who knows very well about information technology and what is involved in the Cardano ecosystem. From there, explain more about the technical aspects for the community to know more clearly. That is my contribution to the team's human resources. Regarding risks when implementing projects, the team has saved 3 risks that I think are very accurate, especially technological risks. This is also why I want the team to have members with good expertise asking about Blockchain, and information technology to reduce the risk to the lowest possible rate.", "q1r": 4, "q2": "The proposed roadmap you listed lasted 7 months, I have read what the team will do when implementing the proposal. But I have questions about specific timelines for implementation. What's the problem that you don't include milestones with the action steps? I was particularly impressed with the team's solutions, which were very clear and concise. You guys did this well and not all proposals in Catalyst do. You have stated KPIs and key metrics, I like your ability to express key metrics. I only regret that I have not been able to see specific KPIs, key metrics. The description is great, but the numbers aren't there yet. I recommend the team to add more to complete the proposal in the best way. This is quite important so that the community can audit at any time during the entire implementation phase. For the rest, the solutions are good and workable.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5232, "q0": "Expanding Cardano to many people with many different languages ​​is necessary, because, through the native language, it is possible to reach more people with many classes, thereby bringing Cardano and Blockchain to a wider audience. rather than just limited to a few people who know English.\n\nYour proposal wants to push more Swahili-speakers in Africa to learn about Blockchain and Cardano through 50+ articles about Cardano & Catalyst in Swahili through the incentive mechanisms program. This is a reasonable approach because the content after being translated, if the number of people reading and accessing this content is too small, it will not bring a great impact.\n\nTo encourage people to read the content, your group uses small quizzes and participants will receive a small reward and NFT when they complete a quiz. This is a way to apply gamification in education, which is quite effective.\n\nI believe this proposed solution  will attract a large number of Swahili-speakers participating, thereby increasing the number of people who understand Cardano and Catalyst. I fully support the idea and implementation of the project.\n\nHowever, to be able to bring this program to the community proactively, it is also necessary to have a detailed marketing and communication activities attached. Because a good product or program with a good marketing plan will make a much bigger impact.", "q0r": 5, "q1": "The implementation plan of the proposal is 07 months and is divided into 04 phases with detailed tasks and effective measured results for the community to easily follow and evaluate.\n\nThe total budget of the proposal is $38,200 and is broken down in detail by item and associated costs.\n\nThis project has the participation of Darlington from LIDO Nation Foundation, who has had many projects funded by Catalyst, so I fully believe in the success of the project.", "q1r": 5, "q2": "The performance indicators of the project are described in detail and are suitable for the project. For example, Number of Quizzes created, Number of NFTs awarded,.. These indicators all have specific KPI numbers attached to evaluate the success of the project.\n\nHowever, I also want to suggest more to the proposal to more understand the feelings of the participants, the quality of the content of the quizzes, etc., that every month you should have a small survey to understand what the participants are thinking, do they have any additional comments to make the program to make it more suitable for them, ... from the results of these surveys will give you many insights to improve the program and program will have the best results.", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6115, "q0": "The Swahili (Wawahili) are an ethnic group residing in the Great Lakes region of Africa. There are 2 - 15 million people (in 2012) who speak their mother tongue, 30 million people with a second language and more than 100 million people in total. There are many native Swahili speakers in Africa. However, they won't learn about Cardano or use a blockchain tool without engaging educational content, encouragement, and familiar language. Personally, I am very confident in the ability of the team to implement the proposal. Sallyanne is a Swahili interpreter at the Cardano blockchain lab in Kenya and has been with Lido Nation for 6 months. Stephanie: Experienced Blockchain Educator...Darlington: 14 years of software, engineering and blockchain experience. The Lido Nation ideation team 50 articles on Cardano and Catalyst in Swahili, encouraging Swahili speakers to learn, open wallets, earn ADA + NFT by engaging in educational content. The team clearly and specifically describes many of the details presented about: What they already have, what they will do, how they will do it, pervasive awareness and market size. At the same time, detailed solutions specifically impact the challenges posed. This is a rather complicated proposition and fraught with risks. The team recognized the hidden risks to its challenge and the solution to the risks when the proposal was implemented.", "q0r": 5, "q1": "The team pays a lot of attention to this part of the project. The team provides a lot of detail. First about the route. The team started by creating multiple choice questions for 50 articles and started working on the LidoNation.com website. Then they will build the supporting content, Swahili translation table and Complete Development. Next they will test and demo (beta testers and phase 1 deployers are Kenya lab participants). Continent of Africa released. According to the project schedule, the project will take place in 7 months, the team has detailed, the projects are in progress, and the specific amount of work will be done, and attached specific links to the project. We are easy to follow. easy to understand and verify. We understand everything the team will do in the proposal, to achieve the end result. For the budget. The proposed budget request is $38,200. Less than 10% of the total challenge budget. In my opinion, the required budget is appropriate for the complexity of the work the proposal needs to do. The team also presented a very detailed budget sheet. We know each budget is delivered hourly, weekly, and monthly for each person, per job. Specifically, $1,000 for 1 artist is 3 NFT, 2500 USD for 75 quizzes and 7,000 words, translation words, etc. Of which the positive thing is that more than 40% of the budget goes straight to my wallet. artist. new Cardano users, in the form of puzzle rewards and NFT badges. Finally, about the core members of the team. The team has members with all the skills, skills and experience needed to perform the tasks in the project. and there are attached links, so we can learn about what the team mentioned. One positive thing is, members all have in-depth knowledge of Blockchain technology and extensive experience in the Cardano ecosystem, working with Lido Nation, one of the founding members of Blockchain Sugar Lab at Nairobi, Kenya ... In my opinion, all is very good and very necessary, the feasibility of the proposal is very high.", "q1r": 5, "q2": "For the proposed team, the Catalyst project will continue to be a potential way to keep their work going. Based on its own design and value, it will bring in hundreds of new cardano wallets and users from Swahili-speaking Africa. At the same time, it will build a toolkit for learning and continuing to serve the community after July of this project. There have been previously funded translation and writing proposals, but this is not a follow-up proposal, but a completely new one. The proposal has a detailed roadmap, the budget is analyzed reasonably and transparently, creating favorable conditions for monitoring project progress. A team of skilled and experienced members will contribute effort and time to complete the task according to the set plan. If successful, it will be a new step for the idea team, Swahili-speaking communities in Africa, Africa development and the Cardano ecosystem. Here, the team has provided many ways for us to track the development and measure the progress of the project. Number of new wallets associated with the site. Number of Rewards paid and NFT awarded... All will be reported monthly, final report and on website. We have many ways to check that, I believe, complete and satisfactory information has been established. We know what will be done and how it will be done to achieve the end result that is the desired success in the proposal. Regarding the final product, which is what is expected of this project, there are product indexes listed. Swahili African Community will learn about Decentralized and Blockchain technology; Cardano is a particularly interesting blockchain project; they will share with their friends, who are Africans who speak Swahili. Proposal has good auditability.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 3, "ng": 1, "nfo": 2, "vca_o": 1}, {"id": 11074, "q0": "Many native Swahili speakers in Africa will not learn about Cardano or use Blockchain tools unless there is engaging educational content in a familiar language and clear incentives to learn. Faced with this situation, you have come up with a very good proposal that is \"encourage Swahili speakers to learn, open wallets, earn ADA + NFT by participating in educational content and participating in quizzes.\" quiz\". Why are you focusing on the Swahili market because Swahili is one of the 10 most widely spoken languages ​​in the world with over 200 million users. Most Swahili-speaking areas are economically depressed, meaning the value and impact of the monetary reward system is substantial. Your proposal not only directly solves economic difficulties for the people here, but also affects the development of Blockchain technology in Africa, which is the core goal of the Cardano ecosystem. You have also raised the risks that can occur in different aspects I find very accurate, the explanation to reduce the risk I find reasonable. I strongly support your suggestion\n\n\n\n\nMany native Swahili speakers in Africa will not learn about Cardano or use Blockchain tools unless there is engaging educational content in a familiar language and clear incentives to learn. Faced with this situation, you have come up with a very good proposal that is \"encourage Swahili speakers to learn, open wallets, earn ADA + NFT by participating in educational content and participating in quizzes.\" quiz\". Why are you focusing on the Swahili market because Swahili is one of the 10 most widely spoken languages ​​in the world with over 200 million users. Most Swahili-speaking areas are economically depressed, meaning the value and impact of the monetary reward system is substantial. Your proposal not only directly solves economic difficulties for the people here, but also affects the development of Blockchain technology in Africa, which is the core goal of the Cardano ecosystem. You have also raised the risks that can occur in different aspects I find very accurate, the explanation to reduce the risk I find reasonable. I strongly support your suggestions.\n", "q0r": 5, "q1": "Your way of doing is very creative, practical, always interested in the interests of users, which is to earn income from their own learning activities. Do you guys have a very clear, transparent explanation of how you help users make money? It is your explanation that will be a very effective marketing way to attract new users to the project. But I want you to clarify the solution, how to control a person using many different nicks to receive many prizes, while proposing to have many people participate? You guys have built a very detailed plan with specific jobs, I see it very clearly and clearly. The detailed budget analysis table for the project is quite complete, detailed, and the spending content is appropriate. The members involved in the project have full information about their background, professional capacity and practical experience, I feel very reassured.\n", "q1r": 5, "q2": "You have provided enough information to measure the progress of the project. The success of the project is described quite clearly. I know this project builds on previous successes. However, it is not clear the continuation of that work. Instead it was a new idea and a unique endeavor, building further value on an established foundation. I fully support your suggestion. Good luck.\n", "q2r": 5, "assessor": "z_assessor_3216", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 11295, "q0": "A lot of native Swahili speakers in Africa won't learn about Cardano or Blockchain. So the team that came up with the solution is to encourage Swahili-speaking people to learn, open wallets, and earn ADA + NFT by participating in educational content and answering quizzes. This project fits the challenge posed by \"increasing the number of new users in Africa participating in Cardano, targeting education directly\". Based on the facilitation available on the website \"LidoNation.com\", they add a Swahili multiple-choice question to each article. Encourage anyone who visits Cardano's informational site to answer 25 quizzes that will be rewarded with ADA and will be sent an NFT. This method will help more people in Swahili-speaking Africa to open Cardano wallets. The project effectively addresses the challenge. Through an educational platform that makes it easy for the community to adopt Cardano, \"Beginner Level\" blockchain interaction, increasing the number of new Catalyst members based in Africa. Proposals have local impact and can scale to address future challenges. The proposal presents very clearly how it will add value to the ecosystem.\n", "q0r": 5, "q1": "This proposal is very detailed which helps to ensure that it can be implemented smoothly. The total project implementation time is 7 months. The time and method of implementation are outlined in detail by the group. January: they create multiple choice questions for 50 Swahili articles on LidoNation.com, and start development on the website. February & March: completed development work to assist users to log in to the site, take quizzes in Swahili, and receive ADA & NFT Rewards. April: Testing and demos. For the rest of the months, they release globally. I find it a very realistic timetable to get the job done. Budgets are clearly outlined, detailed, and broken down into definable items. The total required team budget is $38,200, of which $12500 is the cost for the team to award ADA rewards to new Cardano users. I find the budget to be divided like that to be reasonable and increase the feasibility of the project, stimulating the user's participation in the website to learn knowledge. The author provides evidence of the team's experience on Linkedin. I have full confidence in the experience and knowledge of the team members who will successfully carry out this project. They are teachers, technologists, and translators with deep knowledge of blockchain technology and extensive experience in the Cardano ecosystem.\n", "q1r": 5, "q2": "Regarding the ways to measure project success, I found the team to be very detailed and choose the correct way to measure engagement around the proposal. The community can easily measure the success of the project through: Number of quizzes created, number of new wallets associated with the site, number of quizzes taken, number of NFTs awarded. The conversion rate of the new members, the number of new wallets and the rewards given out have helped to prove that the team knows how to monitor the results well. In addition, we also found that the ideas transferred regarding success awareness education are well-suited to any challenge.\n", "q2r": 5, "assessor": "z_assessor_3235", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13821, "q0": "Awareness and education are fundamental in order to make Africa a Cardano adoption leader. This proposal hits the core of it. Developing gamification in dapps for the learning of Cardano blockchain can be a practical and concrete project that will rapidly increase the amount of Cardano wallets. A monetary-reward by learning can be a really attractive way of drawing in a wide range of newcomers. Also, giving people the chance to have monetary reward for their learning will help Cardano Catalyst fight against the reluctance the wide audience may feel towards the blockchain universe. It might be interesting to find a way to engage dapp players into the Cardano Catalyst Community because it may be a risk to lose the opportunity of engaging potential active members if gamification only focuses on solving quizzes. Somehow, quizzes can end with some audiovisual content inviting newcomers into our Community.", "q0r": 5, "q1": "Team is highly experienced and we can enjoy Stephanie’s excellent work on the Lido Nation website. Their communication strategy is great and we should expect this dapp outreach to a wide audience rapidly. Road map presented is super consistent and clear and shows the strong intention of the team to achieve their goals and successfully implement their project. It is to highlight the high calibre marketing strategy they designed. Budget breakdown is also well organized and down to earth. Funding this proposal is an excellent way of investing in a fruitful project and taking good care of Cardano Catalyst treasury at the same time. ", "q1r": 5, "q2": "Number of Quizzes created, number of wallets linked to the site and number of the NFTs awarded is sufficient to audit the progress and the success of the proposal. This kind of easily auditable project is great to fund and mentor. Monthly reports in numbers can help a great deal the Community database to gather and improve African data. Feedback surveys can also help to know about the quality of users' experience and help the team improve and develop their dapps.  \n", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14380, "q0": "A large number of Swahili speakers in Africa do not learn Cardano or use blockchain tools as these contain educational material that engages the colloquial language, this is due to the fact that almost all cardano are done in English.\n From this, we dare to affirm that this proposal stands in its challenge as it will constitute to the growth of cardano among Swahili speakers as well.", "q0r": 4, "q1": "Referring to the experience that this team has, in particular the realization of projects on cardano funds (Fund 6, Fund 7 and Fund 8), I am with great hope that this project is also feasible. \nThe detailed plan that this team has put in this proposal is very clear and proves that this project is feasible, but also the way in which they have detailed their budgets as well as the allocation of the budget to the different activities is very worrying and shows that this project can be realized. \nI believe this has proven that this proposal will help the development of cardano by creating educational tools that will enable new cardano members to learn and use cardano blockchain tools by way of making the tools available in English, Spanish, and Swahili. The number of team members being 3, with experiences and Studies in the field of the project, I reassure myself that this project will bear good fruit.", "q1r": 4, "q2": "The links indicated in this proposal are convincing and constitute good indicators to measure the project. \nThe sheet is well detailed in this proposal is well clarified and proves that this project will be auditable. \nThe number of questions they have indicated in this proposal (75 multiple choice quizzes) show how the objectives of this project will be measurable. For, I am For this proposal to be funded.", "q2r": 4, "assessor": "z_assessor_4010", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14688, "q0": "This is one of a few novel initiatives in the past few years that’ s introducing people to the blockchain industry. Based on my analysis of the script, I see a comprehensive approach to provide education on the blockchain technology in a way that would attract more young African people. Considering the unemployment challenge in africa, I am convinced that this incentivized learning platform would drive the growth of the Cardano in Africa especially among the young population. This is because incentivized learning system stimulate students to pursue more successes. Therefore, I think this initiative has the potential to scale up the growth of Cardano in Africa in several ways. Firstly, this initiative has being designed to be used in several communities with different language background. By estimate, close to 14 Africans speak Swahili, and with the improvised environment in africa, this could serve as an escape root from poverty. Therefor, this platform could serve as the springboard that would advance awareness creation of Cardano among young African population. This project could help address the challenge of adoption in Africa. In several ways, this project opens the door of value addition to the Cardano community —from awareness creation to on-boarding, to increase in developers and to adoption. By this project the Cardano project could penetrate several communities that are open to addressing challenges via the blockchain ecosystem with their ideas. From the script we know the target audience and marketing strategy adopted here, solid and well designed marketing strategy. The only setback to this project may likely be the issue of internet accessibility in some  part of the continent. Have the team anticipated that and what’s the team strategy to mitigate this?", "q0r": 5, "q1": "This project is both clear and practicable in terms of its feasibility. The approach provided on the roadmap is well-defined to align with the objective of the project. The proposer outlines a clear time horizons with specified duration set for activities to be done. By the roadmap, we're told what to expect to attain the goal of this project. In my view, I prefer the proposer set each activity with specific time limit. Notwithstanding that, the proposer presents a well-balanced and detailed budget breakdown. The identifiable items, per my understanding of market prices, reflect prices accurate and consistent with existing the average prices. Apart from that, I am convinced that the project would effectively be implemented because of the rich profile presented by the team. Already, the team have several ongoing projects the team is pursuing, therefore this confirms the expertise, track record and experience detailed by the team. In addition, the team has attached a number of external links to their profile and various  websites that supports their profile. \n", "q1r": 4, "q2": "The information presented to audit this project looks comprehensive and well detailed. Hence I am convinced the information is sufficient to audit the project. To assess, monitor and track how well this project performs, we must know what the end goal of the project is — (to ultimately help participants from Swahili-Speaking Africa learn about Decentralization and Blockchain technology - many for the first time, in a real way or with deeper understanding). With that been said, the proposal states that, the number of quizzes created, number of new accounts linked to the sites, number of quizzes taken and number of NFTs awarded would be the metrics needed to  measure the progress and success of the project. More importantly, for each of these KPIs, the proposer provides specific expected performance target and also indicates how the team would get these information. I am more satisfied with the team’s readiness to make available all report on these KIPs to the community via their website.", "q2r": 4, "assessor": "z_assessor_4093", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Lido Nation has 50+ articles about Cardano & Catalyst in Swahili. Next: incentives for Swahili-speakers to learn, open wallets, earn ADA+NFTs by engaging with educational content & taking quizzes.", "experience": "Sallyanne is a Swahili translator at the Cardano blockchain lab in Kenya & has worked with Lido Nation for 6 months.\nStephanie is a trained teacher, experienced blockchain writer & educator.\nDarlington brings 14+ yrs exp. in Software & Cloud Engineering, Blockchain development."}