{"id": 418376, "author": "zakariam.munir", "title": "Cardano and Agri Value Chain", "url": "https://cardano.ideascale.com/a/dtd/418376-48088", "category": 26600, "amount": 35268, "description": "African Agriculture is late regarding blockchain technology information and payment system integration, especially in the Ghanaian Agricultural world.", "f6_no_assessments": 17, "f6_rating": 4.470588235294118, "videos": [], "media": [], "f6_assessments": [{"id": 452, "q0": "The idea of the proposal itself largely addresses the use of ADA. And a limited use of it. The proposers intention are for ADA to become the currency of choice for farmers to buy and sell goods. There is indeed an education factor in this, but what it seeks to educate is limited again only to the potential use of ADA in day-to-day transactions.\n\nWhen it comes to value chain, the use of ADA should perhaps be the last effort. The focus should be more into the supporting infrastructure. The use of ADA will come naturally.\n\nGoing back to the point of education, targeting farmers is perhaps not the most effective method. Rather farmers, it would be better to target perhaps local students through the promise of blockchain education and a part-time job. Then from there approach the farmers village/community and identify and train individuals who are trusted in the community and interested  in being conduits between the farmers and the technology. Will go deeper into this in the following assessments category.", "q0r": 3, "q1": "The team involved or related to agriculture itself are passionate individuals. This can be view by their various credentials and long history in this field. The implementation team though is only generally stated, which is WADA. There is no further detail on who from WADA and what credentials do they bring. Indeed WADA is trustworthy, but you still would need to identify the certain individual who will take lead on the implementation of the technology.\n\nHence, my previous assessment which states they are focusing too much on the use of ADA without detailing the implementation of the technology involved. What is stated briefly is the mentioning of \"Agri Input Shops\" and \"Agri Input Markets\". These 2 (two) entities are essential, for this is where the transaction of goods happens. We need to know what and how is the method of input? Is there a front-end app? And how does this app connect with the blockchain? How will the farmers use this app? Is it through a mobile? Or is it through some stationary data input in the physical Agri Input Markets? How does ADA travel from one individual to another? And how does the proof of transaction be recorded? Will be written on the blockchain? These are some of the questions that should have been addressed by the implementation team.\n\nAt the very least, there should a visual/simple infographics that depicts the whole process and explains in further detail the concept of the technology. A simple wireframe would do. There are various other shortcomings but I will limit it as is.", "q1r": 3, "q2": "It becomes difficult to audit when the goals itself are unclear. Indeed there are some targets, but there is also an overliance on WADA. There is a continued mentioning of \"X will be done by WADA, Y will be covered by WADA\". Again, this is dangerous, for it can potentially compromise the good name of WADA. Before going deeper regarding auditability, highly recommend the proposers to please in the future, if this proposal does not get funded to please coordinate and communicate well with WADA.\n\nThe goals mentioned are again too focused on the use of ADA. The use of ADA itself will not have much change in creating a better livelihood and ecosystem for the farmers. It can actually add a burden in the existing agrichain for you are adding an additional process that perhaps is just not needed yet.\n\nThen there is the budget, again, there is very limited mentioning of budget allocation for the implementation team. What is stated is only a huge lump sum of $10,240 for this \"Agri Input Market\". What is actually this \"Agri Input Market?\" Other than that, the budget is largely used for marketing and PR gimmicks and for team operations.\n\nIf not funded, kindly recommend for the proposers to first coordinate well with WADA and also participate more in-depth with the Catalyst School. There are numerous other notes regarding the proposal, but I will leave it as is.", "q2r": 3, "assessor": "z_assessor_2088", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 11600, "q0": "The proposer and his team's  proposal is timely and will go a long way to solve a problem that has bedeviled this country in terms of price hikes in agro-inputs and I therefore applaud this proposer and his team. The proposal and has identified a major problem that is facing the agro community in Ghana and therefore is intending to use project catalysts and cardano  ecosystem to assist farmers get value for their sweats and money when using Ada as a medium of exchange for agric input. The proposer bemoan the fact that taxes and levies on mobile Money are too much and normally when you engage in farming which deals with money and you want be transacting with the mobile Money vendors and other financial institutions your cash end up reducing in value, hence  the introduction of Ada by agritech company to assist farmers through  training. The proposer said farmers normally are always disadvantaged by the shortcomings of cash which are costly to collect and send and that, the cash can also be stolen or misappropriated and when there's slow transportation. The proposal according to the proposer has two phases, one according to the proposal will involve the following, that is organising workshops, online training sessions, practical training sessions will aid farmers to have smooth usage of the Yoroi wallets. The proposer said knowing your farmer gives you a better chance of assessing his financial status, also by building internal and external value proportions for Ada payment. Cardano ecosystem will be used as a legal tender or a medium of exchange to acquire agro-inputs. The proposal also intimated they intend enabling farmers to spend their funds and access Services digitally that is by sensitizing farmers on the value of Ada payment using the Yoroi app.\n\nThe Phase 2 of The Proposal seeks to use angritech Society to create an ecosystem where farmers can freely use Ada for transactions by creating agri inputs shop where farmers can buy inputs and pay with Ada. According to the proposer and his team farmers who buy inputs with Ada will be given a discount of 10 to 15 Ada and this will depend on the volume of goods or the kinds of goods one buys from this agritech shop.\n\nThe project also seek to help solve issues related to the farmers and that farmers who get involved in the cardano ecosystems and the blockchain will be trained on how to use yoroi wallet to help themselves. Another thing the projects would help is the unemployed youth, by employing a number of youths to help run this project \n and the other thing is food security and poverty will also be addressed by this project if funded. This proposal projects also seek to use the cardano community to help the farmers overcome the challenges facing agriculture in this 21st century, there are multiple challenges that faces the labour force of farming, it produces more food and fibre to feed a growing population with a small rural labour Force and this project if funded will help farmers realise their potentials and the fruit of their toil.", "q0r": 5, "q1": "The proposer and his team has intimated that they have ever work with atinker on agro processing. Therefore I have no doubt in my mind that this project if funded will be a success to the glory of God. The proposal said the project will take five months to complete which will go in the following order with the milestone. According to the proposer the projects will be launched then recruitment and training of Community-Based Assessors(CBAs) and creation of a physical agri input marketplace that will enable or accept Ada transactions from the farmers after they've been onboarded onto cardano ecosystem. This training is expected to be organising in the 5 northern regions of Ghana. The first and the subsequent months almost all, if not the same but similar programs running through all the months with \ndifferent dates and months  a summation of the five regions where the project are expected to be launched.It willl be a two-day program that will invite stakeholders and farmers in the value chain to help create awareness about the project and how it's recruitment and training of 10 CBAs two from each of the five northern regions to help in the dissemination of information in the language which may be a barrier as a way of getting the message of the proposal. These candidates are expected to be literate and should come from these regions, they should be natives and should be able to speak the local languages of the people in order for easy dissemination of information. The project is expected to take a form of 5 months training sessions in the five northern regions.Its expected to go this way if not same but similar, but a varying dates of which I think it is laudable. In every month and a given proposed dates will be sets for maybe a first week of the month or second week of the month then the time for everything is from 8 a.m. to 2 p.m. and the targeted people are hundred farmers from the said communities.Where Agritech input shops are open these products are expected to begin sale on this day. When asked about the risk involved in this, the proposer and his team intimated that language may be a barrier which may not be helpful to the cause of the project cardano but with his vast experience in farming and agritech he said he will be able to liaise with the Community-Based Assessors(CBAs) who understand the language of the people to break the language barrier in order for the information to get through to the farmers so at the end of the day project catalyst will benefit immensely from this an the farmers themselves would also benefits from this program if funded.\nThe proposer and his team have also been able to request for an understandable amount of budget which they further broke it down into activity base for cardano ecosystem to be able to fund it and monitor the progress of this project if funded.", "q1r": 5, "q2": "Yes the information provided above is enough monitor or audit the progress and success of this program. The proposer said, monthly status documents will be communicated to the community and that Wada a reputable blockchain organisation is also going to be involved in the provision of transparent records on the progress of this project and some deliverables that are also going to be measured by way of auditability will include the number of farmers who express their satisfaction in using the Yoroi wallet to transact business or buy agri-inputs at a cool price. Moreover the results from the proposal will be communicated to the community through a joint meetups by cardano4climate and wada. Receipt, waybills and invoices, records on transactions made by the proposed payment system will all be available for auditability and to this extent I agree that the information provided above is enough to monitor the progress and success of this project. On what success look like the proposal has hinted that a mass adoption of Ada as a form of payment for goods and services in the agricultural value chain which will create employment for people as well as farmers getting the privilege in buying goods at a good discount are all going to be things that are visible and auditable and I believe this alone is a success and worth funding.", "q2r": 5, "assessor": "z_assessor_3260", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11387, "q0": "Agriculture is a source of food and sustenance whose supply chain must be kept going at all times, as livelihoods depend on it. Blockchains technology has emerged as a viable method to support all the stakeholders along the supply chain.Farmers , retailers can use blockchain for product certification and traceability from farm to table for transparency in the supply chain. As African agriculture is late about blockchain technology payment system integration especially in Ghanaian agricultureal world incorporating payment into agricultural world is the project. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project has detailed plan of five months includes farmer training sessions, creating physical agri input market place that will accept ada transaction, recruitment and training of CBAs and project launch also has advertising and training sessions.The budget is outlined clearly and broken down into idenfiable items. It is reasonable to achieve set goals. The team has good experience and consider challenges and risks relevant to successful implementation. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The progress of the project can be tracked by status document communicated and results from proposal to community through joined meet-up by cardano climate and WADA . Farmers can be educated on Cardano blockchain and securing ways for transactions by creating employment for people and adoption of Ada form of payment for goods and services in agricultural chain. The proposer provides sensible and conductible plan for implementation.  This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 11296, "q0": "This project aims to organize online and in-person community events to educate young high school and university students in Northern Ghana in particular and Africa in general about the Cardano ecosystem and its benefits. Cardano aims to make a big impact on Africa, which will only be possible when this issue is resolved. Their first focus is on educating secondary and tertiary students in Northern Ghana, but if the project is successful it will be relatively easy to roll out to other countries in Africa. The proposed indicators and objectives match the challenge. The group will organize meetings and conferences to reach more than 2,000 students in universities and high schools in Northern Ghana, thereby working to increase the number of students becoming community advisors, increase the excellent proposals submitted by these students, and increase the number of Cardano wallets. I see this proposal as scalable and addressing future challenges.\n", "q0r": 4, "q1": "The proposal team provides a very detailed plan for implementing the project. This project will take 5 months to complete, the implementation methods are also clearly outlined each month by the team. In the first month, they will raise awareness of the project among people in the Northern Rim of Ghana. 2nd the month, they create two physical Agri input markets that will accept Ada transactions. Months 3, 4, and 5: five farmer training sessions will be held in each region of the northern belt of Ghana. It is a very reasonable and favorable plan for them to successfully implement the project. The team budget breakdown is clearly outlined and broken down into identifiable items. The project is expected to be used in Ada, the total amount is $35,268. Expenses to pay for the work: launching projects, recruiting and training CBA's, Training courses, and seminars are quite reasonable to achieve the set goals. The research team has sufficient knowledge and experience to carry out the project. That is fully team-listed and verifiable on Linkedin. With the above factors, I find this project very feasible, scalable, and applicable in the agriculture of other countries.\n", "q1r": 5, "q2": "I find the indicators/KPIs that the team gives to the community to determine the success of the project very general and not yet specific. The group mentioned that for each phase of the community plan project progress can be measured through monthly reports, WADA will participate, the number of farmers using the payment system, and record of transactions. I think the team should come up with specific metrics tied to the milestones and timelines to achieve this project will be more feasible. Regarding the success of the project, I find it suitable for the challenge, of increasing the number of new users in Africa joining Cardano.\n", "q2r": 4, "assessor": "z_assessor_3235", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9847, "q0": "The proposal is really laudable and a great news to the Agribusinesses, as adopting the blockchain technology and integration of the ADA payment system will improve on the chain value of agribusiness and a great boost to the economic growth of farmers and all who are involved in the agribusiness chain.\n\nImplementation of the proposal by incorporating the Blockchain payment system in ADA will help in the elimination of levies and taxes that crippled the economic growth of farmers and by extension the whole agribusiness sector. \nThe proposal of a 10% to 20% discount is a great move to also encourage more farmers in the adoption and usage of the ADA coin.\nThis proposal is great and worth funding, as it will be a great win to the Cardano community and the blockchain industry.", "q0r": 5, "q1": "With the experience and plan outlined, this proposal is most likely to be implemented successfully if proposers stay committed to the action plan outlined concerning the timelines given.\n\nWith the experience and plan outlined, the proposers will be able to implement successfully the proposal, as they already have a great track record of work in relation to the proposal. So funding this proposal will be a  great advantage to offering real-life solutions of incorporating Blockchain tech and ADA payment systems in the Agriculture industry.\n\nThe team has done well by giving out information about themselves and their field of expertise, which gives them a great stand in the successful implementation of the proposal.", "q1r": 5, "q2": "The information provided is absolutely clear and accurate for easy auditing of the progress and success of the proposal. The proposers set realistic KPIs with an understanding of timelines that are specific to the activities. \nThe case of the proposers presenting a monthly report to the Cardano community, making transactions using the Yoroi wallet, keeping receipts, waybills, invoices, and others to the general public, and reporting to Project catalyst is great in ensuring that there is sufficient information to audit the success and progress of the proposal. \nThe budget of the proposal too is comprehensive and well out laid as it is easy to understand and every milestone is appropriately budgeted for.", "q2r": 5, "assessor": "z_assessor_3109", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9404, "q0": "The proposer mentions the fact in Ghana that we can improve better. African Agriculture is late regarding blockchain technology information and payment system integration, especially in the Ghanaian Agricultural world. To solve this problem, the authors incorporate Ada payment systems into the agricultural world for easy, fast and secured transaction, fewer Transaction fees. They will use Ada coin, therefore increasing more adoption of Ada. The program contains 2 phases, first one is farmer to farmer transaction, second one is the market. In summary, this program addresses affectively the challenge and have appropriate target after solution. Thanks to these programs, the Cardano value will increase a lot and this model can be broaden in large scale. I give mark 5 for this criteria.", "q0r": 5, "q1": "I think this program is feasible. First, the authors brief clearly budget to run this project, including costs for venue/ conference Hall, Hotel Accommodation, Snack and Water for  participants, Lunch for participants and team, T shirts, Pull up banner, Transportation for logistics/ protocol, Marketing & Publicity, ADA Airdrop for participants, Incentives for Team. Second, the team members have good skill and experiences in organizing the event. They have experiences in the agribusiness value chain and agri-procurement services with 2 years of continuous engagement with farmers in the Agricultural sector. The team has been providing advisory services to farmers on good farming methods for yields. Therefore, they can connect easily with farmers and use media to propagate the program benefits. Besides, the authors consider carefully the challenges they may face out when running this project, they are the language barrier, the way to obtain Ada in the yoroi wallet and the fear of farmers when participating into the workshop they have little information. The solutions to manage such risks are proper. The project also mentions basis for evaluation after each stage. I totally agree with the proposer and evaluate mark 5 for this criteria.", "q1r": 5, "q2": "This proposal has clear schedule from beginning till completing the program. It takes 5 months to complete the important milestones: project launching, recruitment and training of CBAs, creation of a physical Agricultural input marketplace, organizing five farmer Training sessions and reporting. The key measurements of success to this program include: Mass adoption of Ada as a form of payment for goods and services in the Agricultural value chain; Farmers will be educated on the Cardano blockchain and secure ways they can use it for transaction; employment for people; Farmers will be privileged in buying goods at cool discounts. In general, this project has clear schedule, the problem solution is easy to understand and follow when implementation. If possible, the author should show the specific KPI for evaluation (i.e. the number of Ada adoption after the program, the increase number of people using wallet, etc.) so that the project can be more persuasive. I evaluate mark 5 for this criteria.", "q2r": 5, "assessor": "z_assessor_3052", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 8409, "q0": "A very complete explanation from the proposer on the adoption of the use of ADA as payment for products produced by farmers in Ghana. Of course, this answers the challenge in this category because it will increase the use of the cardano blockchain with ADA transactions by buyers to local farmers. Proposer seems to be focused on teaching farmers how to use the yoroi wallet, but it's a good idea to generally introduce the wallets that are now available for cardano and the advantages and disadvantages of each. The suggestion for the proposer is to also learn about one of the projects on cardano, namely https://indigoprotocol.io/ which hopefully can provide an idea of ​​how to turn real-world assets into tokens and can be exchanged, in this case agricultural products into tokens and make it easier to sell . To remove the language barrier, it's a good idea to also propose to the yoroi developer to open a translation contribution to the local language to make it easier to use the wallet.", "q0r": 4, "q1": "I think the explanation of the use of funds is very clear along with the timeline for the implementation of the proposal. The marketplace setup is only explained at a glance and hopefully the marketplace can be trusted and safe for transactions. Overall, a process to teach farmers about using the cardano blockchain especially the ADA transaction process and also the conversion process to fiat currency using an exchange available in Ghana. This process of sharing knowledge with farmers will certainly increase the adoption of the use of cardano among many people and collaboration with various communities. The working team have good experience and will certainly be able to give good explanations to the farmers about using cardano for payments.", "q1r": 4, "q2": "The explanation of the proposer on how to measure the progress of the project can be understood well. Especially explained in phase 1 and phase 2. I think it would be better if there was a report in the form of a blog or medium to provide progress on the work of this project and include all indicators in phase 1 and phase 2 so that they can be monitored in general. The success of this project has also been explained well, but it would be better if it was added, for example, how many transactions have been successfully carried out in the marketplace using ADA as payment because there is usually a regulation from the government regarding the currency accepted for payment in an area, in this case in Ghana.", "q2r": 4, "assessor": "z_assessor_2982", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11627, "q0": "The proposer and the team have placed the change idea to address the problems in the right challenge category on the CARDANO blockchain ecosystems. The proposal has also shown how much value this proposal will add to the Adoption and scaling up Cardano ADOPTION in Ghana and Africa beyond by using the platform to process transactions related to Agricultural were many Ghanaian are involved. The proposal key metrics to measure were to help to solve issues related to, the farmer, the unemployed, food security and poverty and the Cardano Community scaling up in Ghana relating to Agricultural are in line with challenge setting. The proposal has looked at scale to address future issues and challenges in this forms where Once Agricultural sector adopt or buy in by using Cardano ecosystems, this systems already have put in measures which this proposal will built on to bring the needed benefits and serve guide future challenges. The proposal component and implementation take a concept where sustainability is achieved by trainings that has long term goals and not short-term goals.", "q0r": 5, "q1": "The proposer with his team members have provided evidence of links and references with regard to the implementation of the proposal which are links and references related to their skills and experiences in relation to the proposal. The proposal has very well identified his team of members, their kind and manner that is important to the implementation of the proposal given their experience and their past works done. The proposal has a budget, it is broken down and funds are allocated to each items the proposal has broken the budget into. The proposal budget is reasonable because of the regions the proposal want to cover given the goals it has set to achieve. The proposal has outlined a timetable which contains it program and outlines for the various regions it will cover and complete the project. It also provides plan on how to implement the proposal, when, what is to be done and who and how the proposal will go through. The resources for the proposal implementation has also been very clearly described. Technical aspects of the proposal are also well articulated in the proposal. The risk in the proposal outlined, such language barrier, how to obtain ADA in yoroi wallet and participation risk, all this risk to proposal has solid solutions to it, which I believe when funds are made available to it implementation their solutions will help mitigate them.", "q1r": 5, "q2": "The information on the proposal has given a roadmap clearly in the proposal on time horizon on how it achievement can be met. The key metrics were outlined and it measures it progress by the, Mass adoption of Ada as a form of payment for goods and services in the Agricultural value chain, number of farmers will be educated on the Cardano blockchain and secure ways they can use it for transactions, the employment it create for people and farmers will be privileged in buying goods at cool discount. The proposer and the team have clearly described the target problem that can be measured against the proposed outcomes and has provided effective solutions to help address the problem and make success possible. The proposal has channels for updates to the community, Farmer in Africa especially in Ghana go through a lot and one of this problems is what is in the proposal and once a solutions of this nature is out many will take the advantage and opportunity on cardano ecosystems to see how it will possibly solve what they are going through there by adding value to the Cardano blockchain ecosystems in Ghana. ", "q2r": 5, "assessor": "z_assessor_3262", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8354, "q0": "Farmers are very important to the nation and its economy. The proposer has a very good and initiative idea of helping the farmers by digitizing the mode of payments and giving them discounts and helping them get good price but the only idea of understanding which needs to be considered here are if the farmers can understand how the blockchain works since most of the farmers are not educated they will find it very difficult to understand the concept of blockchain and cardano . The proposer has identified a real world problem and has also provided a solution to the problem faced by farmers but it is a very difficult task to convince the farmers to believe in this technology, education them would require a lot of time but in case this proposal gets implemented successfully then it will get more users to use ADA for transactions which in turn will add value to the cardano ecosystem. The key metrics have not been clearly mentioned by the proposer to support the success of the proposal or on how they will attract farmers to be interested in this idea. Hence i neither agree nor disagree with the effective addressing of the challenge", "q0r": 3, "q1": "The proposer does not seem to be well experienced for the proposal but they are trying to something for the betterment of the society which needs to be supported. The proposer has not provided sufficient links to support the proposal and has not provided technical information required to complete this proposal and the team member details have been listed. The budget for this propsoal seems to be fair and is outlined properly by providing breakup cost which is realistic and has given proper information on them and also offers a time table to complete the work which does not seem realistic as they need a lot of time to educate farmers in the first point about blockchain and for them to adapt this network and get used to it and hence i do not think it can be implemented in the projected time. The proposer needs to consider the challenges they will face during implementation of the proposal and re consider the time table for the implementation of the proposal.", "q1r": 3, "q2": "The proposer has not provided any information on how to audit the progress of the proposal as they need to provide something to evaluate the success of the proposal. The provided roadmap does not seem to be realistic and introducing a completely new transaction platform to the people who does not have any knowledge of it requires a lot of time for implementation and the success of the proposal cannot be guaranteed but it can be possible with more time and adaptability of the farmers to use this system. KPI's are not mentioned in this proposal which will support the success of the proposal.The proposer has addressed the problem correctly but requires more knowledge on implementing the same to make it successful.", "q2r": 2, "assessor": "z_assessor_2976", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7634, "q0": "The problem described in this proposal is closely aligned with the challenge. The proposal clearly provides a solution to the problem by incorporating Ada payment systems into the Agricultural systems of Ghana. Through consultations and  \nmeaningful meetings with farmers, they will be taken through workshops, online training sessions, and practical training sessions to learn about blockchain and cryptocurrency to transact their farming business. The farmers will be aided to start transacting business using the Yoroi Wallet and also would have onboarded more of these farmers into the Cardano ecosystem which is positive.\nThis I think is a game-changer, and will help to bridge the gap between the nonformal farming community and the formal institutions should this proposal be funded.\nThe proposal also captured key important metrics under the campaign brief by mentioning some of the participants of the key-value who will bring their knowledge on board the Cardano ecosystem. ", "q0r": 5, "q1": "The proposer has provided relevant links to members of the team who will help in the proper execution of the project if they are funded. They have provided great input as to how they will overcome impediments by employing community-based advisors to lead them into the communities as liaisons. \nMoreover, the proposal and the team from the links provided have the desired skills and experience to be able to execute the project should they be funded and that is highly commendable.\nThe proposal has done well by providing a detailed budget, broken into identifiable bits, and judiciously elaborated on what each unit is going to be used to execute the project should they be funded.\nBreaking every training session by regions, as in Upper East. UpperWest and etc are also excellent because projects like these need to be matched as units and not collective. The proposal also outlines the milestone by providing the duration with which the project will be funded. Potential risks and associated ways of mitigating them have also been clearly highlighted.\n", "q1r": 5, "q2": "The proposer and team have provided a clear outline on how to measure the progress of their project should they be funded. For instance, the monthly status documents will be communicated along the project cycle, and also the results from the proposal will be communicated to the community also through joined meetups by Cardano4Climate and WADA, and others. \nThe proposer has also indicated how their progress will be monitored and reported to the Cardano community through the Cardano4Climate and WADA as stated above. \n\n it is stated that farmers' mindset  will be continuously matched on what they have been trained on the Cardano blockchain and secure ways they can use it for transactions as they get onboarded into the ecosystem.", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 5234, "q0": "Using ADA in payment is also a way to help African Agriculture initially approach Blockchain technology. And this is also a solution to help develop Cardano in Africa to a wider range of people, instead of just being limited to those who are tech-savvy.\n\nYour solution is to introduce and train farmers about ADA, and help them can use Yoroi wallet to transfer and receive money. At the same time, creating a marketplace where farmers can exchange goods here with ADA, encourages participants to pay in ADA through 10-15% discount programs.\n\nThis is your pretty good approach, in addition to the risks you mentioned in the proposal like the Language barrier, converting their fiat currency to Ada, and Participation risk. Then I think there are some more risks that you need to consider when choosing ADA as a means of payment. Firstly, has Cryptocurrency been legalized in the countries you choose to implement this proposal? The second is that the price of ADA has a large fluctuation, so it will affect the value that farmers receive, so it is necessary to have a solution to this problem. Finally, the technology barrier, do the farmers have enough technical skills, or devices (smartphones) to be able to participate in this payment with ADA?", "q0r": 5, "q1": "Your proposal is expected to be implemented within 05 months, you don't have a year, but I guess the time is Sep 2022 - Jan 2023.\n\nYour plan has specific timelines, along with tasks to do and goals to achieve. However, most jobs only focus on training activities, and the specific content of each training session is not listed in detail. Training is one of the job of this proposal, in addition to other jobs such as communication, creating a marketplace, creating wallets, posting goods information to the marketplace, payment, and complaint settlement policies,...All of the above works need to be described in detail to make it can be assessed whether the proposal can be completed on time as committed or not.\n\nThe budget for this proposal is $35268, all costs are listed in detail and clearly. I agree with this budget and this budget is appropriate for the size of the proposal.\n\nThere are 05 members participating in this proposal with their experiences and personal information described in detail. However, all the members are not described as having any experience related to Cardano and ADA, so I recommend the team to have an advisor specializing in Cardano to be able to assist you in completing the project with the highest performance", "q1r": 4, "q2": "The indicators to measure the results of the project are described quite clearly and are consistent with this proposal. However, with a pure phrase 01 about training sessions, you need to add an important indicator, Number of farmer participants. At the same time, there need to be mechanisms to assess whether the participants in these training sessions really understand and apply it in practice, possibly through small tests.\n\nIn addition, to assess the success of the proposal, it is necessary to add specific numbers and metrics. For example, 100 farmers participate in training sessions, or 1000 transactions are done in ADA through the Yoroi wallet. Only when there are specific numbers will the community have information to evaluate whether the project is really trying to achieve those KPIs or not.", "q2r": 3, "assessor": "z_assessor_2678", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3863, "q0": "The idea of ​​​​the proposal has identified part of the problem to be solved for this challenge, but the scale of the project's impact is so large that we can extend it to many different areas. conditions are the same around the world. Agriculture in African countries as well as around the world needs to quickly involve the integration of a simple, transparent and efficient payment system of Blockchain and Cardano.\n\nThe solution of this idea is good, it identifies some problems of the challenge, besides the author of this idea argues logically, neatly, and creatively. The solution of using Ada coin in the Ada payment system in the world of Agriculture implemented in 2 stages is a useful solution for agriculture, local farmers as well as places with similar agriculture.\n\nIt's great that the idea of ​​this proposal presents so many risks when it is implemented in practice, and the idea's author has outlined solutions for all of them. That not only keeps the project on schedule but also helps the community manage risks from the project when it is put into practice, thereby considering whether to vote in favor of the project or not. with ideas. The impact of this proposal is enormous. Besides the risks and solutions of trading cryptocurrencies, and languages, the author needs to list more factors that will affect the progress of the project if it is funded.\n", "q0r": 5, "q1": "Great when a project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project is aiming for are also very specific and completely achievable. The work items are listed in detail by the author by time (month, hour), area, target audience when deployed, and how to deploy, I believe this is a good recommendation for the community. agriculture in Africa whether it is funded or not.\n\nThe project budget required less than 20% of the total funding of this challenge, compared to the information provided by the project, all expenditures for the project were clear and explained very clearly and transparently. White. The budget analysis is quite complete, the author has also warned against ADA price slippage at the time of proposal and disbursement.\n\nThe feasibility of this project is quite good when the human resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that it is completely suitable for the project. In addition, the members' identities are easily verified using the links listed above. The scheme is very clear, complete, and transparent. The author of this project is Mohammed Munir Zakaria- Team Leader, with associates Issah Nantogmah Alhassan- Graphics and IT, Sulemana Mohammed Ashraf- Logistics Supplies, Fuseini Mohammed- Organizer, Abukari Abdulai- Public Relations them, and with the support of WADA Ghana Hub, showing that this is an experienced team to carry out this project, the identity is also easily verified by a reputable identification link such as LinkedIn, ... to community Easy and practical identity verification co\n", "q1r": 5, "q2": "Project transparency is very good, this project provides KPIs for accomplishing project goals, all goals are easily measured thanks to the indicators provided by the project, and they are also easily tested in an implementation. The various reports that will be made available to the community through meetups hosted by Cardano4Climate and WADA are a clear way for the community to understand how the committed KPIs are being realized.\n\nThe ideas of this project have clearly defined success, although they have not been tested in practice, it is still a good idea. A good suggestion and the author can fully run his tests with a smaller model to check for himself if the performance numbers are up and the project is funded.\n\nBrand new idea information on Cardano platform never received any funding from Cardano ecosystem.\n", "q2r": 4, "assessor": "z_assessor_2489", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 2944, "q0": "This is a proposal to talk about using Ada coin, incorporating Ada payment system into the world of Agriculture because: easy, fast and safe transactions, low transaction fees to solve the problem of \"Agriculture in Europe\" Slow Africa is related to the integration of payment systems and blockchain technology, especially in the world of Ghana Agriculture.\" The group outlines the foreseeable risks, and the specific solutions for each of those risks when implemented.", "q0r": 5, "q1": "The group set out a specific roadmap expected to be completed in 5 months, with a detailed implementation plan for each month. The proposal requires a budget of $35268 with a detailed breakdown of the allocation, making it easy for the community to observe comments. Team members have a lot of experience and good skills to successfully implement the project.", "q1r": 5, "q2": "With the roadmap information, detailed analysis of the use of transparent capital, it is easy to check the progress of the project. This is a new proposal, but I see the vision of the project, if successful, will develop Ghana's agricultural economy in particular (African agriculture in general) strongly.", "q2r": 5, "assessor": "z_assessor_2365", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 2670, "q0": "The Proposal's problem is that African Agriculture is slow in terms of payment systems and Blockchain technology. Their solution is to use ADA to pay for agricultural products.\n\nThe proposed group says that the entire value-added chain is accompanied by an imbalance of power between buyers and sellers. This limits farmers' access to world markets. They also provide information with the paper \"[Source: Oxfam.org: https://oxfamilibrary.openrepository.com/bitstream/handle/10546/620596/dp-living-income-smallscale-farmers-151118-en.pdf ]\"\n\nIn addition, observations from a group of large agricultural companies. They introduced some limitations such as: Always losing money due to lack of cash; Expensive to collect and send; It can be stolen or misappropriated; Slow shipping\nThe proposed solution includes the following stages:\n- Peer-to-peer transactions between Farmers and Farmers. At this stage, Farmers are guided, trained, and raised awareness about blockchain, ADA, and how to use Yoroi wallet to trade...\n- Market: create an ecological system, farmers can use ADA to trade themselves. Each can create a store where farmers can buy and sell with ADA payments.\n\nIn the \"how would your proposed solution solve the challenge\" section, the Proposal also outlines how they would address the challenge as a Farmer; Unemployment; food security and poverty; Cardano community.\nAt the same time, they also gave 3 clear risks and solutions when implementing the project.\n\nI found this suggestion to be a perfect fit for the Challenge and I totally agree with it.", "q0r": 5, "q1": "The proposal has a clear roadmap with 5 months of implementation. They also offer pretty relevant monthly jobs such as:\nThe first month: Project launch, Recruiting, and training 10 CBAs (02 people/region * 5 regions in Ghana)\n2nd month: create 02 Stores in Agri that accept payment in ADA. The following months are training courses in different regions with the target of 100 farmers in each region participating.\n...\nDetailed and reasonable project budgets for all areas of training. The $4065 cost zone is pretty reasonable.\n\nThe capacity of the team is quite good. Mohammed Munir Zakaria is the Team Leader. He has experience in farming, has a clear profile link. There are also 4 other team members who have clear links and are able to execute the project well. In addition, it is supported by the local WADA team.\n\nThe team has continued to apply for funding in the following funds and wants to implement ADA payments integration in the agricultural value chain in Africa.\nFrom the above analysis. I agree with this proposal.", "q1r": 4, "q2": "The proposed team provided metrics to measure the progress of the project and divided it into two clear phases: such as the Status Document that is posted on a monthly basis; Distributed content including reports; Recall letters, bills of lading, and invoices; Transaction ID on transactions made with Yoroi wallet; Number of small-scale farmers expressing they are living a better life by using the payment system; Records of transactions performed by the proposed payment system. But there is no KPI clear in this section. However, the route has the number of farmers participating, the number of sharing sessions... I agree with this item.", "q2r": 4, "assessor": "z_assessor_2331", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 782, "q0": "Another great example of a fantastic cause being adopted and implemented on the Cardano blockchain! Yes, I am down with this and the object benefit to the very people keeping the African population alive through produce production is plapatable. I believe that your approach is sound and the various issues that you are attempting to solve is both challenging but vitally important. The risks could be a little more fleshed out and maybe some fuether detail aroud the solutions detailed. For example instead of \"Advertisement through radio and TV stations, and social media outlets to create awareness.\" maybe consider something like \"Advertisement through radio and TV stations, and social media outlets to create awareness and confidence throgh community leaders giving their support to the program and also having the same community leaders attending some workshops and related community events\"", "q0r": 5, "q1": "You have provided a wonderful amount of detail around your plan, timeline and key milestones as well as team members. The figures that you have provided are thorough and clear and the amount that you are requesting is very reasonable. The need for future funding is understandable and encouraged.", "q1r": 5, "q2": "I would've liked to see a little more detail around what success looks like including some success metrics.. only rough as I am acutely aware that this is a difficult element to predict. The project progress also could do with some rough metrics to ensure that the audience can easily understand what it is you are attempting through numbers. All in all a good proposal which I truly do hope gets funded.", "q2r": 4, "assessor": "z_assessor_2127", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 7889, "q0": "I strongly believe this proposal does address the Challenge of growing Africa and Cardano. This proposal would improve the agricultural economy framework in Africa and integrate Cardano as the settlement method; this will help the region flourish and will bring people into Cardano. From my understanding of commerce and it's affect on the surrounding populace, this should bring not only bring farmers and market vendors into cardano, but also their friends and family members. This would cause a ripple effect through word of mouth marketing due to the benefits cardano will bring to Africa. Due to the size and importance of the agricultural system in Africa, I strongly believe this proposal will be quite affective in the task of growing both Cardano and Africa. The proposal has easily identifiable metrics and goals outlined for this challenge, and has a clear plan on how these goals will be achieved. The goals that will have the biggest impact here are ending poverty and hunger within Africa; this will help Africa not only survive but also thrive. With this proposal Cardano and Africa will really grow together. ", "q0r": 5, "q1": "I strongly believe this proposal does address the Challenge of growing Africa and Cardano. This proposal would improve the agricultural economy framework in Africa and integrate Cardano as the settlement method; this will help the region flourish and will bring people into Cardano. From my understanding of commerce and it's affect on the surrounding populace, this should bring not only bring farmers and market vendors into cardano, but also their friends and family members. This would cause a ripple effect through word of mouth marketing due to the benefits cardano will bring to Africa. Due to the size and importance of the agricultural system in Africa, I strongly believe this proposal will be quite affective in the task of growing both Cardano and Africa. The proposal has easily identifiable metrics and goals outlined for this challenge, and has a clear plan on how these goals will be achieved. The goals that will have the biggest impact here are ending poverty and hunger within Africa. Those two goals are so important for this continent. With this proposal Cardano and Africa will really grow together. ", "q1r": 5, "q2": "From the information within the proposal, I can conclude the proposal provides me with sufficient information to asses the progress towards stated goals. The plan does have a clear roadmap as well as metrics which would allow an accurate and comprehensive audit to be carried out on the proposal as it progresses. The proposal has multiple social media channels where it will present it's monthly updates. WADA will also be involved in the process including the audit. This will provide an outside source working with the project which can provide an effective audit, as well as provide the proposal with guidance along the way.   Goals are numbered: 1,2,5,8,13, and 15. The reader will wonder if goals are missing. It's clear here the team condensed their goals, but this should be addressed by correctly numbering the goals or communicating why not all goals are listed. This is however just a minor detail and does not affect the audibility, there just needs to be a bit more clarity there. ", "q2r": 4, "assessor": "z_assessor_2933", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11643, "q0": "The PROPOSER has done a great job by placing it in its right challenge. The proposal team effectively addresses the challenge and it potential to bringing values to the Cardano ecosystem and African countries communities should they be funded.\n    The proposal did a great job by identified the challenge such as, Agriculture facing multiple challenge like it has to produce more food and fiber to feed a growing population with smaller rural labor face, etc and has done well by providing the precise solution related to Farmers, the unemployment, food  security and poverty and the Cardano community should they be funded and I strongly believe they will do a great job if they are funded to execute their project. The proposal team is also able to provide some important key metrics measure under the compaign brief indicating it's benefits to the Cardano ecosystem and African countries communities should they be funded to execute their project and I strongly believe they will do a great job should they be funded.", "q0r": 5, "q1": "The proposer is able to provide links and details to team members who will help in their project and I strongly believe with their relevant that, they have the Desired Skills and experience to carry out the execution of their project should they be funded.\n       Moreover, the proposal team has done well outlining the budget breakdown funds to how it be used should they be funded to execute their project which I strongly believe it's COMMENDABLE.\n       In view of these, the proposal team has done well by indicating some risk challenge that could prevent them from executing their project and able to navigate solution to overcome them should they be funded to execute their project.\n    Furthermore, the proposal team has done well by providing details plan including timeline of five months and key milestones such as project launch, Recruitment and training of CBAs, creating of a physical Agriculture input etc, to deliver their project should they be funded and I strongly believe they will do a good job if they are funded.", "q1r": 5, "q2": "The proposal team is able to describe their project progress and how it will measure to the Cardano ecosystem through monthly status document ,Wada website and platforms and amount of fermer who express their progress should they be funded to execute their project which I strongly believe it's COMMENDABLE.\n      Furthermore, the proposal team is able to indicate the success for their project will look like,such as, Mass adaption of Ada, Farmers educated on Cardano block chain and creating of employment should they be funded to execute their project which I think this will bring great impact to the communities in African countries and to Cardano ecosystem should they be funded to execute their project. With the key metrics, milestone, timeline and roadmap in the proposal proof that they will do a great job should they be funded.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "To incorporate Ada payment systems into the Agricultural world for;\n\nEasy Transactions\nFast and secured Transaction\nFewer Transaction fees\n\nUsing Ada coin.\nAnd also create more adoption of Ada", "experience": "We are a group of colleagues with experience in the agribusiness value chain and agri-procurement services with 2 years of continuous engagement with farmers in the Agricultural sector. The team has been providing advisory services to farmers on good farming methods for yields. "}