{"id": 419145, "author": "natdwamena", "title": "Ubuntu Informal Biz Credit DApp", "url": "https://cardano.ideascale.com/a/dtd/419145-48088", "category": 26600, "amount": 67950, "description": "Lack of access to financial credit is deepening the woes of informal businesses in Africa due to a lack of collateral. How can we provide credit to businesses in the informal sector?", "f6_no_assessments": 6, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 6122, "q0": "Africa's economy includes trade, industry and agriculture, and the continent's human resources. About 1.3 billion people live in 54 different countries in Africa (according to 2019 statistics). However, the lack of access to financial credit, which is a major difficulty for informal enterprises in Africa, is due to the lack of collateral. Therefore, the idea team proposes to apply smart contracts, without financial collateral while leveraging the Cardano blockchain. The idea of ​​the proposal is good, it solves the financial problems of informal enterprises in Africa and develops Cardano. Impact on the goal of the challenge posed. Propose a clear description, specific solution. The Cardano blockchain is secure and reduces the risks associated with traditional collaborative operations. With a smart contract developed on a daap that will encode traditional cooperative activities on the Blockchain. Blockchain technology works confidentially, transparently and securely between individuals in the informal sector. and pays in ADA, using yoroi wallet. The proposal is seen as the engine of economic activity in Africa. Applying smart contracts to cooperative organizations, businesses in the informal sector is the future of Cardano growth in Africa. Besides, the team has recognized the potential risks in the proposal and has many solutions, minimizing the risks when the proposal is implemented.", "q0r": 5, "q1": "In my opinion, the feasibility of the proposal is quite good. We know what will be done and are presented in great detail. The roadmap is divided into 4 phases, each phase is divided into weeks. and deployed in 16 weeks, that is 4 months. The work to be done in each stage is also analyzed in detail. It is very positive that the team provided several milestones right from the presentation of the roadmap. Show that the team has precise goals, knows what they will do, how they will do it, and that all work will be based on this goal. This is a great sign of reaching the ultimate goal of project success. As for the budget, the team requested $67,950, more than 10% of the challenge budget. and properly explained. We know what the budget will be allocated to. However, given the relatively high number, we need a more detailed explanation. The daap development example is $30,000. approximately 50% of the total proposed budget. 20,500 seed credit fund. more than 30% of the budget. It would be good to have a detailed budget table, transparent budget will add sustainability and credibility to the proposal. For the team budget is $1,550. However, we would like to know how much time they will spend on the project. Finally about the core members of the group. A very good thing here is that the group provides very clear information about the members, and a short text about them, and attached profile of each member, so that we have a clear understanding of the members. member. their history and work in the past and present. We know their identity, qualifications, skills and experience are suitable to take on the project. In which Nathaniel Dwamena is the CEO, a member of Wada has joined Catalyst from Foundation 7. and Christopher Aikins from Foundation 4. They are all competent, knowledgeable and knowledgeable people about Blockchain, the ecosystem. Good cardano. They will be the ones dedicated to completing the project and contributing to the development of the ecosystem. The plan of the proposal is good, but the budget needs to be explained in more detail. I will deduct 1 point from the budget here.", "q1r": 4, "q2": "The team's proposal is new and independent. three of the five team members also did not work at all on any previously funded projects in Catalyst. The budget explanation is current, but more details can be added, increasing transparency for the project. The project roadmap is presented by week (16 weeks) and it is explained what to expect during that time period. As for the audit, the team provided us with a lot of detail on the auditability, progress reports will be published monthly on the website, daap development will be documented in Github, and updates. Sponsorship updates, Discord impact, and lots of KPIs provided. These are obvious ways to see if the development of the proposal has been successful. Ultimately, all that the team has presented with enough information is provided to facilitate serious and ongoing monitoring and supervision of the project. If the project succeeds it will be a success of the team, growing informal businesses and the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 5, "ne": 2, "ng": 1, "nfo": 2, "vca_o": 1}, {"id": 8099, "q0": "One of the major challenges facing the informal sector in Africa is the lack of access to credit loans to grow their businesses. There are others to having business ideas which could accelerate the rate of development in their communities but don't have the means to start.\nThe lack of credit loans for the informal sector in Africa to expand their businesses is one of the main reasons Africa is not growing.\nThis proposal has outlined measures to solve this problem hindering the growth of Africa by providing the informal sector with credit dApp which will in turn increase the adoption of cardano in Africa.", "q0r": 5, "q1": "The proposer has elaborated the action plan well to the reader. phase by phase plans well detailed to the reader and the budget breakdown also well explained.\nThe milestones provided look promising and they are achievable within the time frame provided. The proposal also has a solid team going through their profile with their respective links which makes this proposal achievable due to their experiences.", "q1r": 5, "q2": "There are relevant links provided to the community to keep keep track the progress of the project.\nThe proposer has provided readers with KPIs   which the team will use to measure the progress of the project. The team has provided Discord link to provide funding updates, impact and progress report to the community for audit and transparency. ", "q2r": 5, "assessor": "z_assessor_2954", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12254, "q0": "I  agree on the fact that, this proposal identifies a problem in the challenge which is expected to be solved. **********************************\nI have no doubts that, in the long run adoption of the cardano blockchain by Africa, there is a need to tackle some problems facing its informal sector which form a larger component of the backbone of Africa's economies. ************************************************************************************************\n\n\n\nThe informal sector adoption of the cardano blockchain adds enormous benefit to the cardano ecosystem both in the short run and the long run. And i think that stimulus can be created using easier means of acquisition of credit facilities in the informal sector.*************************************************\n\n\nThe key metrics also provided, which is the ability to facilitate financial inclusion of the informal sector, in my opinion aligns very well with the target setting provided, however i think a detailed plan on the sustainability of this project would have been helpful. Inspite of this I think this proposal will make a good impact and provide the win win scenario for both the Cardano ecosystem and Africa development.\n\n", "q0r": 4, "q1": "I  agree that, this proposal is likely to be successfully implemented. I had a bit of doubt looking at the repayment of the cedit facility granted in Ada or its price value was nicely clarified in the comment section.\n\n\nNotwithstanding, the team also possess the requisite skills and experience to successfully implement the proposal within the stipulated time horizons provided. Only that going forward, the time horizons will have to be adjusted up as penetration moves in to the rural areas, considering the barriers likely to be faced.***************************************\nI  believe the team has the capacity to mitigate the challenges of low internet connectivity and levels of education.***********************\nHowever, the details with respect to the budget on development of dApp and seed fund would have provided more clarity, but i believe your answer provided in the comment section eases my doubt knowing that you have conducted your research in the informal sector well.", "q1r": 4, "q2": "I agree that, the information provided in this proposal is sufficient to evaluate its progress in achieving the desired objective.*****************************\nAs stated, I am of the view that, it is quite easier to evaluate  the KPIs given such as the number of wallets created for businesses within the stipulated time frame can be evaluated easily. And expectation on monthly progress  reports on them can easily be done on the website.*************************************\nAlso, With the problem clearly stated in mind, and the expected outcomes  provided in this proposal, the success or failure of this project, I think can be measured without any serious concerns.", "q2r": 4, "assessor": "z_assessor_3371", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13040, "q0": "Yes I do think they effectively address the challenge because they talked extensively about a major challenge Africa's infamous sector the unbank population of SME face.With serious issues with lack of credit history and to make it all worst access to financial credit facilities and tools .\nAlso they talked about language and they even brought solution of get locals familiar with the language and culture of the region with even a detail approach to work from urban areas into the rural areas with solution to the broader issue. So yes they have properly articulated the solution to the challenge ", "q0r": 5, "q1": "Well I would like to thank the team for the efforts made to make such fine proposal .\nYes I do think they might successful implement this proposal because \n1) I do think they have managed to identify the challenge quite well, which is lack of credit tools, lack of access to financial services to small business particularly those of woman. All this makes delivering the desire outcome feasible and shouldn't be very challenging moving forward.\n2)They seem to have a team with adequate,professionals with some level of experience from the information put forward by them. ", "q1r": 4, "q2": "Well yes I do think this proposal has demonstrated that it can be audit because they gave at different points of the development stages of the proposal keep metrics will be shown like\n1)how many smart contracts will be function on the dapps\n2 wallets will be created for the purpose of onboarding this also can be audited by any person to see active participants on the dapp \n3)And also they talked about period of completion of project and even when further to say they will show how many informal business are have being approved financial credit service with details of who are paying back too.\nSo I do think they have should level of audibility on this proposal.", "q2r": 4, "assessor": "z_assessor_3548", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 15045, "q0": "Yes, the proposal meets the challenge's objectives very well. The initiative will certainly benefit Africa a lot, as the idea is to invest in the economic sector by providing financial credit to companies in the informal sector. This would allow small entrepreneurs and those who do not have such a favorable context to flourish and carry out their commercial activities, which will directly increase the income and quality of life of those involved - and we know that the economic situation of the continent's inhabitants is often precarious, unfortunately. Smart contracts and various Cardano blockchain technologies will be used, as presented throughout the impact scope, we are explained how the relevant ecosystem technologies would be used in the idea. In other words, it is something that will promote the greater adoption of Cardano in Africa, which is generally the most important objective to be achieved in this challenge.", "q0r": 5, "q1": "The proposal roadmap is ok, in terms of time specification we have clear information on when what would happen. We know what activities would be necessary to carry out the project. However, in terms of detail, I would like to be informed in more depth about what each of these activities would be. Example: in phase A, how would the user research be done? The budget explanation part is unfortunately not good, the asking amount of 67,950 dollars is high, the parts that it is divided into are equally expensive, for example the development of the dApp that costs 30 thousand. How would the 30,000 be used? Finally, regarding the team, we have a lot of details about each member involved, we know their resumes, a good overview of their careers, we also have linkedin profiles. Providing this data allows us to have good trust in the team.", "q1r": 4, "q2": "The first part of the topic is fine, but the auditability of success could improve. About progress: We have several KPIs reported, such as the numbers of credit requests, credit facilitated/approved, and also the number of informal businesses repaying credit. We know where this information would go: github, discord, and site reports. Is perfect. But the final success is defined in a somewhat generic way, only repeating what is said in the impact, it is not informed how this would be understood and proven, how this scenario would become palpable for the Cardano community. In other words, how the practical impact of the project would affect our blockchain and everyone involved (as well as African entrepreneurs). It would take exact research to be done and demonstrated for all of us.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15057, "q0": "There are about 1.3 billion people (in 2019), living in 54 countries in Africa. However, there is a lack of access to financial credit due to lack of collateral. The proposal impacts the challenge posed and works towards the adoption of collateral-free smart contracts while leveraging the Cardano blockchain. Suggest a clear, specific description. Safe and risk-reducing Cardano blockchain, building Dapps that combine traditional cooperative operations in the form of smart contracts. Africa will become informal and pay with ADA value, using Yoroi wallet. Proposal to help African informal sector businesses provide credit without financial collateral. The proponent has posed risks and has solutions to reduce risks when the proposal is implemented. The group will also provide regular outreach activities and three annual events for outreach.", "q0r": 5, "q1": "The proponent provides information on the project plan to be conducted in 4 months. Proposal towards Dapp development and seed capital to provide credit to 40 informal enterprises. The project implementation roadmap is implemented in 4 phases. The tasks are clearly presented in each stage. One positive thing is that the proponent has also set important goals for the successful implementation of the project. Show that the proposer is capable, has a clear direction, knows what he will do and how to make the project successful.\nProposal asks for $67,950. accounted for more than 10% of the total challenge budget. However, in my opinion, it would be beneficial if the proponent could provide a more detailed budget table. Example: Dapp development of $30,000, representing more than 40% of the total proposed budget required; Seed Credit Fund - $20,500 represents more than 30% of the total budget... Since the value is sizable, we need more information, in order to better understand the value of the allocated budget. A transparent budget will increase the transparency of the proposal.\nFinally, about the team of team members. We are provided with group information with 5 members. The group provides each introductory text and attaches a link about each member. We know each member's identity, skills and experience are relevant to the job being done. Overall the proposed plan sheet is good, however the budget could add more details.", "q1r": 4, "q2": "Proponents provide integrated progress reports that will be published monthly on the site. Additionally, Dapp development will be documented in Github. Also, funding updates, impact, and progress reports on Discord are all transparent. The proposal provided a link so that we could easily check the project progress. indicators are clearly defined. If the project succeeds and develops in the right direction, it will help informal sector businesses in Africa expand their business. Specific roadmap, members with many skills and experience will spend a lot of time to implement the project on schedule. However, the budget needs to be clearer to make it easier to audit", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Use cooperative smart contracts to provide financial collateral-free credit to informal sector businesses in Africa while leveraging the Cardano blockchain.", "experience": "We have combined over 15 years of experience in Software Development (Plutus & Haskell inclusive), financial, marketing, research, and non-profit management. Active in Catalyst since Fund 7."}