{"id": 419876, "author": "adaku", "title": "CARDANO'S FIRST CONCERT IN AFRICA!", "url": "https://cardano.ideascale.com/a/dtd/419876-48088", "category": 26600, "amount": 57250, "description": "Blockchain/Web3 can be confusing to the average person so this is a barrier, but there are huge benefits for the youth in African to get involved with Project Catalyst/Cardano ecosystem. How? Music.", "f6_no_assessments": 7, "f6_rating": 3.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 3869, "q0": "The idea of ​​​​the proposal has identified part of the problem to be solved for this challenge, but the scale of the project's impact is so large that we can extend it to many different areas. conditions are the same around the world. Currently, in some places the common people still see Blockchain / Web 3 as a problem, which is a barrier in expanding the Cardano ecosystem in Africa.\n\nThe solution of this idea is good, it identifies a few problems of the challenge, besides the author of this idea argues in a logical, neat and creative way. rapidly spreading information throughout Africa. With ADA being the only way attendees can attend the concert, you have to create a wallet and know about storage and transactions, knowledge of Blockchain in general and cryptocurrency in particular.\n\n The description of this proposed idea does not measure risk in execution, I look forward to seeing the addition of risk management details in the next Fund if the idea is still live.\n", "q0r": 3, "q1": "The proposal to introduce unclear and detailed work implementation timelines compared with limited implementation resources will affect the project audit process. The proposal only estimates the time to complete the project and the goals achieved in general, the community needs a more detailed implementation plan corresponding to the implementation timeline, the author can refer to the Microsoft Project tool Management for more detailed and methodical support.\n\n The proposed project budget is less than 20% of the total budget of this challenge, compared to the information the proposal provides, some project expenditures need to be clarified if it is to be funded. A detailed budget should list hourly wages for workers in each locality, corresponding to the tasks of each person in the project team, the community needs to know, this helps to make the project transparent. better project. Compared to the information provided, it is a bit general and not yet a detailed budget.\n\nThe human resources to carry out this project have not been assigned specific jobs, however, the listed experiences are relevant to this project, although the identities of the members are difficult to verify clearly. In addition to the information of Dr. Adaku Jennifer Agwunobi as well as Daniel D. Lezu as a Cardano Supporter, I think the author would like to provide the specific names of the project's collaborators (if any), In addition, the author It is also necessary to provide more reputable identity verification links such as LinkedIn, Facebook, Twitter, Discord, etc. for easy and practical identity verification for the community.\n", "q1r": 3, "q2": "This project does not provide KPIs to accomplish project goals, idea creators please provide more complete project KPIs. Relying on Social Engagement is not a KPI to measure and track project progress. Based on the schedule that the author has provided, please provide the KPI corresponding to that timeline, how long will the project achieve the corresponding goals? Thus, the community will easily track the progress of the project.\n\nThe concept of this project has yet to be defined as a success, information from the project indicates that the concept is being worked on and initial testing has yielded the expected success. With 200 new wallets created and 5 cNFT purchased (VIP ticket) represents a good start for the project. However, how do we measure those newly created wallets after the effect of this initial CONCERT?\n\nBrand new idea information on Cardano platform never received any funding from Cardano ecosystem.\n", "q2r": 3, "assessor": "z_assessor_2489", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4396, "q0": "I was surprised by this recommendation because it was different from many of the suggestions I evaluated. That's the difference in content, the problem you raise is related to art, specifically music. Fascinating. The proposal to solve the goal set in the Challenge is Grow Africa, grow Cardano. Thus, Africa will be developed through music, created by bringing people together. Through music, people understand each other and form a community full of solidarity. Who knows, this community will help Africa grow and increase the Cardano ecosystem. Holding a concert based on Cardano blockchain technology directly increased the Cardano ecosystem. I know many authors with ideas for Africa's growth and development, and you are one of them. But you differ from them in that you develop Africa through music - and art that attracts the world. I very much welcome this interesting proposal and it has fascinated me from the very beginning of my research. Going forward, we develop Africa through music, increasing community cohesion and being very beneficial for the Cardano ecosystem. If you intend to scale up, is it a larger concert? Or will you host at more locations to bring people together? I believe that, once the community is engaged, many of the current and future challenges can be solved. I vote 5 stars.", "q0r": 5, "q1": "In terms of feasibility of the proposal: The proponent is someone who has extensive experience in the field of event organization, is a singer and musician, and is very suitable for the proposal related to music organization. The team members have been fully listed with numbers. However, I want the team to make their identity more transparent with links to social networks. Because this is the basis for the community to truly believe in the team. That is also my advice to increase the feasibility and prestige of the team. The budget has been broken down into logical categories with goals, quite easy to understand. I noticed a marketing and social media budget of $2500, would this be enough for a concert of this size? The budget list is quite tight and ensures logic. This increases the feasibility of the proposal. The plan and execution methods are the same. I have a question for the team, in case this proposal has not been approved by Catalyst, will the Team continue with the concert? In terms of resources needed to perform, I focus on human resources, specifically musicians and singers. So does the team have an appraisal process for musicians and singers? I'm sure those are people who are very popular with the public. Since it is an artistic proposal, specifically music, the technical aspect is not too complicated. However, I have a question, how do you use the Cardano blockchain specifically for concerts? Are you planning to create multiple wallets and NFTs? I support creating NFT, it's a very good way to promote the event. But is creating a wallet a technological barrier for those who do not know anything about information technology, and do not know anything about Cardano (mostly the elderly)? Therefore, to overcome this, I think that the team must have meticulous guidance on new technology for audiences who do not know anything about information technology as I mentioned above. When everyone knows and understands the Cardano blockchain technology, the event will have a huge effect on the social community, and that is the huge cohesion we expect. The risks you have mentioned are reasonable, I would like to add one more risk that is the psychology of the audience to like and support the concert or not? This is quite important because a concert cannot be held without an audience responding. I have a solution that the team can do a survey, and get everyone's opinion to see if they will respond to this concert? Based on the survey results, the team will decide whether to organize or not (save organizational resources in another location). If everyone responds enthusiastically, the team can consider putting the proposal and real life, gradually there will be regular, regular concerts to convey the Cardano ecosystem and affirmation. people's cohesion. At that time, the size of the organization can grow larger and larger. Overall, I appreciate the feasibility of the proposal. Just ask for feedback from the team that you should complete what is lacking for the proposal to have perfect feasibility. That's what I expected. I vote 4 stars.\n", "q1r": 4, "q2": "In the proposal, the team described the implementation process quite sequentially. This demonstrates the team's special interest in this proposal. I like this. Proposal implementation is sequential, making it easy for the community to evaluate and audit and trust the transparency of the proposal. I realize there is a noble meaning that the proposal wants to accomplish through the concert: It is to make Africa a better place, the author wants everyone to have a healthy and happy life, equal for everyone. Women and girls, sustainable economic growth, employment for all people of working age, equality of men and women, and especially the KPIs highlighted: proportion of young people aged 15 to 15 24 years old when no education, no job. This is a very important thing that we need to deal with. I understand the deep meaning of the concert, it is not just about solving mental problems for the people but behind it are other social problems that exist in Africa. These are also the goals of the 17 sustainable development goals mentioned by the United Nations. I have no idea how clear and understandable the problem description is, and the team has also come up with a satisfactory solution. I just want to comment on the proposed implementation milestone: If possible, please attach the milestone to the time, specifically associated with the months of the year so that the community can easily audit and also be more beautiful about it. presentation layout. In summary, I find transparency and audit quite clear. Finally, I quite understand the thoughts of the team members who send the message of a better life through the concert. It contains so many enthusiastic spirits, the desire and desire of the citizens to eat for their country and the whole of Africa.\n", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9826, "q0": "Cardano's First Concert In Africa! is an impressive proposal and pretty much ticks all the objectives of this challenge. This is a major project and could really be a breakthrough for Cardano in Africa. Music is indeed a way to connect people. and the love for music in Africa is massive, especially in the youth. I think what will even make this more interesting is having these concert across various university campuses across these two countries (Ghana & Nigeria), just a suggestion though. The plan is to present Cardano as an additional source of income that could really change their lives. Ghana & Nigeria have been stated as the countries to pilot this concert, and if successful, link up with other reps from the ecosystem from different countries to implement same and make it a movement!\nThis strategy is what most companies especially telcos use to launch themselves to the African market, and it almost works all the time, and that's the reason why I have more trust in this project.\nThe Team is well prepared and has a vast majority of experience. I recommend that the team put more effort into advertisement and social media marketing to make this truly successful. I also believe that, if the focus was shifted to hosting these events on university campuses it have the most realistic effect, than having it during the festive periods.", "q0r": 5, "q1": "The plan is well detailed with each step well documented. Though no specific times are given, the plan is simple to follow and track. Certain aspects could have been further explained, for example, how does the team plan to create the training resources, when will the training commence, what will be entailed in the social media advertisement, etc. The plan to also use ADA as a mode of payment for the recruited staff and purchasing of tickets could also help onboard more members to the community. \nThe budget is well structured, stated costs look realistic. The proposer fails to provide a plan on how they will mitigate, if additional funds for implementation of this project, are required. The team members are clearly stated, with a brief description of the experience of each member and their various social media handles given. The team looks competent enough to execute this project.\nWhat seems to be missing from this proposal is specific timelines for the completion of specific tasks, other than that, with a lot of collaboration with relevant people in the music industry and event organization, this should be a successful project if accepted.", "q1r": 3, "q2": "The main aim of this project is to create awareness of Cardano to the African population and introduce it as an additional source of income that could really impact lives, by engaging in the different opportunities in the Cardano community, and this is clearly stated as a key metric to measure success. The team clearly states what success will look like, which makes it easy to track.\nAfter recruiting all these members into the community, the team fails to elaborate on how they plan to follow them up, and help them develop through the community. There is no plan to mentor and guide these new members, so how will we know for sure if lives have been indeed impacted. I recommend that the team develop a tool or a community where new members recruited from these shows will be onboarded and keenly followed.\nThe team also fails to state how they plan to provide timely report to the catalyst community to help monitor progress. With a few tweaks here and there, this proposal will be greatly auditable.\n", "q2r": 3, "assessor": "z_assessor_3106", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 11129, "q0": "Music is undoubtedly a great tool in addressing societal happenings and to promote a cause and it has widely been seen as one. And this proposal is a very bold step approach to using music to promote the Cardano ecosystem and making it a go-to-choice among the African populace. Music brings a lot of people together and to have some popular Musicians onboard this project is a great call. However, some musicians pull crowds much more than others and the proposers could have mentioned names of some artists that they intend to bring onboard from Nigeria (Lagos) and Ghana (Accra) as this has more potential to add more weight to the proposal and ensure that the impact is maximized.", "q0r": 4, "q1": "The combined team experience looks solid and purposed and references to their personal achievements points to success orientation. More so, the presence of a Catalyst Platform manager with experience means there will be proper articulation of Cardano's objectives in project implementation. Timelines are well laid out even though a little more light on exact periods and dates would have given more room to track project implementation and their merits against timelines. In totality, the proposal is implementable by the team if funded.", "q1r": 4, "q2": "The proposal provides enough information to audit progress and success as it outlines the target audience and the expected numbers to be rolled unto the Cardano ecosystem as well as platforms on which to track progress. The proposal however fails to mention any Catalyst platform on which progress of the project will be made available which is also a major area to ensure more people pay attention to activities within the Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_3224", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 15023, "q0": "The proposal aims to spread knowledge about Cardano via organizing two concerts, one in Accra and one in Lagos.\nThe artists performing during the concert would be paid in ADA and CLAP.  \nThe proposer states that some webminars will be deployed together with the concert (about wallet creation for example), and some VIP tickets will be available in the form of cNFT. \nI can see the integration of ADA in the concert organization, it is not clear if the public will be involved DURING the concert, e.g. will be the concert include some breaks in which videos with Charles Hoskinson speaking, or will some songs be about cryptocurrency/Cardano ? I give the rating 4/5 because I see potential in this project, combining a concert organization with some of the capacity that Cardano can offer is new and inventive. ", "q0r": 4, "q1": "The proposer is a multidisciplined young entrepreneur, with a PhD on the wellbeing of young entrepreneurs, and two master degrees in marketing and health economics. She is also a singer and songwriter, so I believe she will be capable of delivering the challenge, however organizing a concert alone is (almost) impossible. I would have like to see some collaborators and some of the artists selected for the concert. \nEngagement with people potentially participating to the concert would start from the social media profile of the proposer, which counts 19k followers. \nI suggest you also create a dedicated website for the event and schedule a slot for the catalyst townhall. ", "q1r": 3, "q2": "The information shared are complete in terms of budget breakdown. The proposer asks for a budget of 57000 dollars.\n4000 dollars to pay 40 members of staff are not enough in my opinion. Stage installation, lights management, presenters, security staff, sound checkers might require skilled workers, hence, higher budget for this item.\nI don't see any item dedicated for free tickets, despite in the risk management section there is a mention about the need to sustain the people who could not participate due to lack of opportunities. \nRegarding the timeline, I don't see a clear timing with deadlines, e.g. how much time do you need to shoot a commercial, how long will the ticket sale will be.\nI can see the first concert is in december 2022, but the roadmap to reach the event is totally missing.", "q2r": 3, "assessor": "z_assessor_2215", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15050, "q0": "Unfortunately, I don't think this proposal is a good idea, as it is suggested to create a very expensive event (about 57 thousand dollars), where Cardano/Catalyst would be presented to Africans through music. Firstly, it is not clear how this presentation would be made, it is mentioned that content would be disseminated on social media such as instagram and tiktok, but what content would be addressed and in what way? How would blockchain knowledge be presented at the concert? It doesn't make much sense, in my view, it's not explained how these two things would merge harmonically and efficiently (the musical performances themselves and the instructions about Cardano). That is, the idea is mentioned but not well explained, as it would develop in practice. It is also confusing how the prior knowledge of the target audience would be done, how they would learn to buy tickets with a Cardano wallet if they don't know the cryptographic universe, how artists would be paid in Ada if they also didn't have a previous contact with our ecosystem. Unfortunately a lot of information gets confused and good confidence in the project impact is not conveyed.", "q0r": 1, "q1": "We don't really have a script. We know a few things that would need to be done, such as concert rehearsals, social media marketing, employee recruitment, etc. However: 1) no details are given about the activities 2) we don't have a temporal notion, a schedule with dates that explains how long each thing would last and in which months they would happen. That said, I don't think this part of the feasibility is adequate. The explanation of costs is also superficial. The whole is divided into parts that are not well explained. For example, what localized resources would be created in Ghana and Nigeria, how would content be disseminated on platforms, what exactly would the content be? How would the $5,000 be split for the event organizers' invitation, what would those organizers do, and how much would each earn? The presentation of those involved is the best part of the topic, as several details are said about each, relevant links are also provided where we can learn more about their work. But there is a lot to be improved here.", "q1r": 2, "q2": "Auditability of progress is not good. All that is suggested is tracking social media engagement, but much more would be needed. 1) understand how the project development phases would be, how the activities of the script would be carried out in practice, how the work routine of those involved would be 2) understand partial results beyond the online world, such as whether the concerts had the number of people expected and also how people used to learn about cryptographic world issues. Success is defined in a superficial way, we know that the objective is for the target audience to get to know Cardano and for young people to become PAs, so they have the opportunity to generate an income. But how can we more accurately understand the consequences of all this for Cardano, if the project contributed to the popularization of our blockchain and greater adoption? How will this data become known to our community members?", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15264, "q0": "\"Firstly, about the problem statement, the proposer basically briefed about the issue that Blockchain/Web3 can be a barrier for people, so they think music can help convey Cardano's lesson (I was convinced by this argument.) I think the problem is apparent and it's well-fit with the challenge. \nRegarding the project's solution, I think it's good and agree that music is a great way to spread messages and create change. However, it would be greater if the proposer described how the music could help and its role in a specific way. Because delivering academic knowledge such as Cardano through music is a new way, mixing these factors is quite difficult for us to imagine how it executes. And it is a very much OFFLINE solution once off instead of sustainable continual project for the promoting of Cardano for community.\nThe risks are not clearly defined and from what I understood, the team try to say it will be short-term format for participant's easiness to be engaged\"", "q0r": 4, "q1": "\"About the Feasibility section, I think this part would be more specific and achievable if the team divided the plan into many pieces with milestones and a clear timeline. In this proposal, they just list the task down, so it's slightly hard to understand what step they will do first and after. We only know one information of the show will be in December 2022, what is the steps to prepare for the 2 shows in 2 countries (Nigeria & Ghana)\n\nAdditionally, my concern is how they convince the artist to use the Cardano wallet and agree to be paid by ADA? And the content for this concert is not mentioned as they said that they would like to deliver Cardano knowledge via music but I don't see it showing in the plan (except the Live educational webinars are operated after)\n\nThe good point of this proposal is the great experienced team in music industry and pedagogy industry. There is a slight concern on the team who are more focused on technical skills\"", "q1r": 3, "q2": "\"With the question relating to measuring the progress, I recommend the proposer should base on their timeline and milestone, so they will have a clear way to measure it. For example, with phase 1 of the project, which KPIs have been completed and so on. In their answers, I think it has not mentioned measurement and the method they do. Regarding the success, I think it's ok when they can make 200 new wallets created, 5 NFTs purchased (VIP tickets). However, the \"\"Engagement on the hashtag #DrAdakuAndFriends\"\" should be estimated the spreading.\nIt seems like a one man show to track the measurable KPIs/OKRs in 3 different platforms of @DrAdaku. It would be great if the team can combine and share a dashboard summary to the community.,\"", "q2r": 3, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Music is a great way to bring people together, we will organise a concert in Lagos and Accra to educate people about Cardano in a compelling way, whilst they have a great time with music and food!", "experience": "Experience organising huge events as Social Secretary of Oxford University Africa Society. Singer/songwriter who has performed at several events in Nigeria + England. Featured on several African publications such as Punch, Vanguard, Guardian Nigeria etc. PhD. African ecosystem."}