{"id": 419889, "author": "angelanartey00", "title": "Inspiring Ladies Colloquim", "url": "https://cardano.ideascale.com/a/dtd/419889-48088", "category": 26600, "amount": 4456, "description": "Most young female youth are not aware of the Cardano blockchain technology and its opportunity in Africa.", "f6_no_assessments": 21, "f6_rating": 4.603174603174604, "videos": [], "media": [], "f6_assessments": [{"id": 13697, "q0": " To be honest, I enjoy this proposal so much that I have read it 3 times since the idea just tells my heart. Blockchain in general and Cardano in typical, is an innovation of the world. It takes time to grow and spread so that more people will understand how it changes our life in a positive way. It should be adopted by both men and women, however, due to some barriers many young females especially in Africa are not aware of the Cardano blockchain technology and its opportunity. For warning the problem we have stated, this proposal is suitable to be delved into to find an answer for Cardano adoption in Africa. I must say the solution we have for this is not outstanding yet realistic and highly applicable under our circumstance. It is to host educational events in universities in Ghana and invite speakers to educate ladies on the Cardano blockchain and its benefits. I believe that this solves the lack of female's knowledge and interest in blockchain (Cardano), support funds for building their ideas and be financially independent and not least, on a wider scale, more African countries know about the Cardano ecosystem, and gain many outstanding people to contribute to make value for it. Through that, more Ghana young ladies will find themselves interested in Cardano and contribute new ideas to Catalyst Funding, as I have mentioned before, this benefits them and the ecosystem as we are together moving forward. The proposed solution creates a new/right mindset and I have strong belief that the project can grow bigger in the future when African (Ghana) people are aware and understand about blockchain and Cardano as new knowledge always leads to new opportunities. On the other hand, there are always risks lying under the plan and we stated that “finding space to host events on Campus” is our risk in this situation. I agree with that obstacle and the way we solve it, which is connecting through a wide university network to find venue space, satisfied me. I just wonder if we can state the solution in a clearer manner, how exactly would we approach them and what we can trade off to convince them to allow us to use their venues? When we dig deeper into the risks, we will find a plan B for the risk or even figure out the other risks. The below are some that I have discovered. The bad reputation of blockchain due to Ponzi and scam cases affects young ladies' intention to join in the event. This does appear, we have lessons from previous cases. I suggest to run social campaigns to educate what is legit and what isn't. Moreover, running a social campaign helps us approach more females, not just within the universities’ ones. Besides, we are witnessing a mass financial  decline which can happen to any form and ADA is no exception.  ADA slippage can cause the shortage of fund, therefore I recommend that we have a reserve fund or transfer ADA to specific fiat when being funded. In conclusion, this includes some beside risks but it is a potential initiative and my rate for it is maximum.", "q0r": 5, "q1": "The proposal's script is not quite conventional, but in the end, what is necessary for us is to know with solidity how the development process of this project will take place. Firstly, the one-time events are hosted in 2 months happening right after being funded. However, it would be clearer to have a specific event’s number as it affects the way we break down budget and resources allocation. The timeline for the project is created following weeks, each week contains different tasks to do. In this way, we have a very solid view of what is to come and are able to understand the entire process very accurately. Regarding this part, I believe there is nothing to punctuate, it is perfect. However, I was wondering if we can explain the 7th-8th week task - Event day. I wasn’t clear with how many events would be hosted as I have stated above, it would affect our resources allocation and budget whether there are too many events or too few events happening in 2 weeks. So, I need an exact amount to evaluate the feasibility in a more particular manner. Besides, I’m also curious about the criterias we choose speakers and how many speakers are invited for each event. We stated “3 Keynote speakers” and I was thinking whether we organize 3 events, each speaks at one event, 3 speak together at events. The criterias and amount of speakers affect our events’ quality therefore I suggest we take it into consideration carefully. The budget is explained in a simple way, easy to imagine with expense for each task detailly based on the general roadmap. It accounts for 4.4% of  the total fund. With this percentage, I believe it is suitable compared to the scale and tasks included.   Beside that advantage, there is an unclear point if we don’t state the number of times each job is repeated in two months therefore I recommend we adjust the budget based on this: task - $/event x times. About the project team, there are 4 people involved. We have experience in CA and vCA, voter, and director in a female organization, all aspects relating to Cardano or blockchain will be assured to be clearly informed. We also have the base of IT, who I believe helps us with the technical problem occuring during the event. One of us is also a co-proposer for the other initiative relating to informing blockchain to people. This impresses me as it shows the commitment to the development of the Cardano ecosystem. We public our profile links like LinkedIn, twitter and have our own org website, which is transparent and a means to check the authenticity. In conclusion, the proposal is not bad in this part, but it needs to be better explored. \n", "q1r": 4, "q2": "From the auditability perspective, I find this proposal quite auditable. Based on the number of attendees, new people onboarding project catalyst, new project catalyst accounts created, people creating Yorio wallet, there will be a full image of success. Regardless, I expect a different measurement instead of new project catalyst accounts created, people creating Yorio wallet. These 2 measurements partly tell because they reflect a system-wide, not within the framework of this project anymore. Meanwhile, the reach and engagement on social media of the project, number of people watching records uploaded on YT reflect better the project. Using social listening tools to measure what participants talk about the events are a particular way to measure. On the other hand, I was wondering if it is uploaded to “http://www.ladiesnef.org/” which is inaccessible or if we have somewhere else to track. With those, I suggest we have our progress uploaded to Sheet or Miro, or more specifications about the proposed application and the figures to track the success are required to help the audit easily and also help the community to track its effectiveness, everyone can witness and trust more in our feasibility. Because there is no statement about checking progress therefore, I rate this part the least impressive one compared to the first 2 parts. Overall, I receive enough information with specific quantitative data to judge this is an impactful proposal.", "q2r": 3, "assessor": "z_assessor_3750", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1298, "q0": "The proposal aims to organize educational events focused on ladies in Ghana, with the goal to provide education regarding Cardano blockchain and its benefits. The proposer is describing the problem as in-proportional poor/wealth when comparing genders in Ghana, and that only 6% of rich, and 67% of poor are women. This is the base assumption that drives the proposer to make a change – and hopefully to provide education to women that could lead to decrease the gap between men and women. The meetings will be in a form of networking, on the topics “Cardano and its oppoturnities”, and regarding the content of these meetings -> educational content -> keynote speakers -> networking. Although it is a nice idea, it is not stated how these attendees will be selected – will it be for everyone, without any technical knowledge, or it will be aimed for students, or possibly women in business? It would be nice to see some examples, that it will be beneficial even for those who is having e.g. no internet access nor technical knowledge. Nevertheless, after the meetings, those that will show interest will be invited to African Town hall to foster relations, and possibly to form partnerships and eventually (I assume) end up making some proposals. From my perspective, education is the key, and it applies to all proposals. Once you decide to spread education, the impact can be very big, thus, I am convinced that it is aligned with the challenge goal. ", "q0r": 5, "q1": "Regarding the roadmap, the aim is to host one meeting within two months after the funding is received, and the funding is requested for two meetings, thus 4 months. The estimated time-schedule is divided per weeks, where we can see a pretty close detail such as 1st week – venue search + securing the venue, 2nd week – planning, 3rd week – team meeting etc, for one cycle (2 months),which I am finding logical and reasonable. The budget requested is 4 456 USD in total, and it is also broken down into identifiable items. The highest items are 600 for 3 speakers, 500 for team fees (organization), and venue 553. The team is currently consisting from 4 people, when we have a bio provided along with linked in/twitter profiles. Regarding their skills and experience, I find them pretty much sufficient for organizing an event. Most of them are already part of catalyst for some funds, and the proposal is created to satisfy assessor needs 😊.", "q1r": 5, "q2": "The problem (poverty gap between sex) and solution (provide education to female) is clearly defined, and metrics are aligned to follow the goal. Metrics that will be measured are number of attendees, number of people who will be on boarded to catalyst, and number of people who will create yorio wallet. I would also add a metric to actually assess, who will remain active member after few months after joining – by simply sending some questionnaire, whether the people will respond or no. The proposers will be also providing video recording from these meetings and uploaded to youtube channel.  Regarding the success of the proposal, it is to have at least 100 attendees on the first upcoming events. Next, it is stated that “most” of them will create catalyst accounts – so 50%+ from the attendance? And I agree, that what we want to see in the future – proposals that emerged due to these meetings. As a suggestion, it would be nice to create (and disclose) some public accessible channel  such as discord, twitter or telegram - for announcements and members tracking. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 12965, "q0": "The Proposal focus on empowering the women in Africa , By providing the education about the cardano ecosystem and it's benefits by hosting educational events which will help in empowering the women . These events would bring new minds to adopt the Cardano Blockchain and innovate to have a better and prosperous Ghana and Africa as a whole . By educating them gender equality and women empowerment is achieved .Therefore Inspiring Ladies Colloquium will be an event to educate, create awareness and sensitize ladies on the Opportunities available on the blockchain . This may help in employment of the girls which will lead to economic growth . The proposal has good goal to achieve but it would have been helpful by more information was given on the how goal is achieved from small scale to large scale . The idea to educate the women is top notch but their has to be proper breakdown of the plan like how this can be achieved Hope they come up with this other then that it's great .\n", "q0r": 5, "q1": "The proposal has mentioned the detailed plan including timeline and key milestones for delivering the proposal .The timeline of the proposal is breakdown into weeks which is gonna take 8 weeks , which includes that Venue searching , event planning etc. But it could have been bit elaborated which would have been easy to assess . The idea to empower women is good hope you include the elaborated timeline on further rounds . Budget breakdown is great very elaborated , which clearly explains the how funds are utilized. The team looks very experienced and\nHave addressed the proposal in great manner .The team members have been community advisor from long time And have a proper knowledge of how catalyst works . ", "q1r": 5, "q2": "The progress of the proposal is measured by\nNumber of attendees ,\nNumber of new people onboarding project catalyst \nNumber of new project catalyst accounts created\nHosting educational events will increase interest in Cardano among young Ladies in Ghana and onboard new potential to project catalyst. \nThese events would bring new minds to adopt the Cardano Block chain and innovate to have a better and prosperous Ghana and Africa as a whole. \nSuccess of the proposal is entirely dependent on the number of attendees adopting the catalyst .\nThe goal is achievable and a proper plan or approach will make the proposal great .", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12843, "q0": "This is a great proposal. Thinking about the women in the community and their welfare is very essential to ensuring a positive wide-scale of Cardano in some few years to come. There's a local phrase that means \"We use women to establish a town\". It is clear that if we seek to expand the wide-scale adoption of Cardano in the African region, we cannot do it without the inclusion of women. We are privileged to experience great job being done by some women like Mercy, Allison, etc and this indicates that if more women were empowered and given the chance, they will surely deliver good jobs and hence the need for a project like this to be funded by Catalyst.", "q0r": 5, "q1": "The details provided are clear. But hosting once within two months may not be enough for the women in the ecosystem. This is for the reason that, for them to really understand the Blockchain and get involved, it needs time and assistance for better results. if not, we will not get the change we want from the women in the ecosystem and it all boils down to zero. So hosting the event three times within two months will be a great idea. Having this budget will help do more for the women in the community for the successful implementation of the project. And the team for this project will really impact in the community per their experience and how they are willing to help the women in the community for them to understand the concept of  Blockchain.", "q1r": 4, "q2": "It is clearly stated how the community can track the progress of the project to know what is going on with the implementation. I realized that the website which would possibly be used to deliver reports to all community members but it's unfortunate that this proposal could not capture exactly when this website would be ready. For the inclusion of every other information, I agree with the auditability criterion of this proposal. ", "q2r": 4, "assessor": "z_assessor_3489", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12578, "q0": "The proponent identified a problem that needs to be addressed in challenging most young women who are unaware of Cardano blockchain technology and its opportunities in Africa. The way it will add value to the Cardano ecosystem is to educate women about the Opportunity in the Cardano ecosystem, followed by connecting attendees with refreshments. There will be incentives for those who wish to attend our networking event. Attendees will be taken to Africa town hall to learn more about Project Catalyst and how they can leverage their unique talents within the ecosystem. With the goal of educating, raising awareness and Educate women about Opportunities available on blockchain ecosystem. I believe the proposal can scale to solve future challenges as organizing educational events will increase interest. Go to Cardano of Young Ladies in Ghana and find new potential to create a catalyst. These events will bring new minds to apply Cardano Blockchain and innovate for a better and more prosperous Ghana and Africa as a whole. I completely agree with the impact of this proposal, I rate it 5* I believe it will effectively tackle the challenge.", "q0r": 5, "q1": "With the feasibility of this proposal I rate it very well. The proponent has provided sufficient information about the relevant skills and experience required to implement the proposal.(Gertrude Addotey: She has huge knowledge of event management (education center). light induction) and she is part of the Blockchain community Richmond Oppong: is a graphic designer with over 10 years of experience in logo design, print and poster design... He is the Community Advisor in the Catalyst 5, 6 and 7 funds, also the Veterans Community Advisor in the 7 fund... and with additional contributions from Awura Adjoa,Angela Okai-Nartey). Regarding the budget the proponent has clearly outlined and broken down into sections, with a total requested budget of $4,456 as follows: 3 keynote speakers: $600 per event,venue: $553 per event events, refreshments: $275 per event,marketing: $200 per event,ADA rewards: $100 per event,team fee: $500 per event.$2,228 per month x 2 months = $4,4560). The project will hold events once every 2 months. This will begin during the funding month. The proponent has established a realistic timetable for completing the work with clarity and detail(First week - Site Search & Security. Week 2 to 3 - Event Planning- for to week 7 and 8 of Event Day). The proponent weighed the challenges and risks associated with a successful implementation. I rate this project 5*, I believe it is very likely that this proposal will be successfully implemented.", "q1r": 5, "q2": "As I said in the feasibility of the project there is an implementation roadmap in 8 weeks with specific goals to be achieved according to each defined timeline. Bring Proposal Success Index : Success will be measured by the number of attendees. Our goal in the first few events was to have over 100 women, most of them create project catalyst accounts. Ideally, many future project catalyst proposals would be submitted by integrated attendees at these events. Clear, easy-to-understand description of the targeted issue of organizing educational events in universities in Ghana and inviting speakers to educate women about the Cardano blockchain and its benefits . I fully agree with this project and rate it 5*.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11673, "q0": "The proposer has done a great work by outlining key issues that effectively addresses the challenge.  Most young female youth are not aware of the of the cardano blockchain technology and its opportunities in Africa.  This effectively fits into the challenge.  Furthermore great work has been done by the proposer by outlining  how this problem can be curbed should their proposal be funded in that educational events would be organised in universities in Ghana to educate ladies on the cardano blockchain and its benefits. This I trust would go a long way to bring young ladies onto the cardano ecosystem and blockchain technology. Moreover,   very important key metrics have been outlined by the proposer such ad creating awareness of cardano  blockchain among young ladies and sensitising ladies on the opportunities available to blockchain ecosystem bringing adoption of cardano among young ladies. This align with the challenge settings under the campaign brief for grow Africa grow cardano.  The value this proposal would bring to cardano ecosystem would be enormous as many young ladies would learn and embarrassed  this great network and opportunities it presents and also more wallets would be created should they proposal be funded. ", "q0r": 5, "q1": "There must be plans gor for every great adventure and the proposer has done so well by outlining a detailed plan with a timeline of 2months in completing the proposal should it be funded fully.  Furthermore, the proposer has done well by stating a budget to work with as as as this proposal is concerned and providing a breakdown of the budget into identifiable items reasonable for achieving the objectives of the proposal if funded of which is commendable.  Relevant experience and skills required for the project has also been captured by the proposer. Moreover the proposer has carefully chosen team members that are well resourced to work on this proposal and make it a success should it be funded. Challenge that may hinder the success of the proposal if funded have also been fetched our by the proposer such as lack  space for carrying out activities necessary for the achievement of the set objectives and measures have been proposed on how to mitigate this which is highly commendable. ", "q1r": 5, "q2": "The proposer had captured that there would be recording of events,  speeches, and PowerPoint will be done to reach more participants which would be uploaded on their YouTube channel for public access.  The proposer also did a great job by providing key metrics to be measured such as \n1. Numbers  if attendees\n2.number of new people onboarding project catalyst \n3. Number of new projects catalyst accounts created.\n4.Number of people creating yoroi wallet. \nAnd  with this key metrics , success can be measured.  Goals were also stated under the heading how success would look like such been able to onboard about 100 ladies for the first few events if funded which is commendable.  ", "q2r": 5, "assessor": "z_assessor_3265", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 11649, "q0": "The PROPOSER has done a great job by placing it in its right challenge.the proposal effectively addresses the potential of bringing values to the community in the African countries (Ghana) and the Cardano ecosystem. The proposal also clearly provide the precise solution to the stated problem by indicating the purpose of the project proposal such as; inspiring ladies colloquium will be an event to educate, create awereness and sensitize ladies on the opportunities available on the block chain ecosystem and hosting educational event that will increase interest in the Cardano among young ladies in Ghana and onboard new potential to project Catalyst,etc should they be funded.\nTo add to these, the proposal is able to capture some important key metrics under the compaign brief such as , Number of of proposal offering solution to infrastructure and education, Number of African based user onboarded onto the Cardano (wallet and platform sign ups),etc , which will make impact into the Cardano ecosystem and African community should they be funded and I strongly believe they will do a great job if they are funded to execute their project.", "q0r": 5, "q1": "The proposer is able to give details plan including timeline and some key milestones to deliver their project such as; Hosting one time events within two 2 months which includes, planning event, Team meeting, invitation of speakers, logistics Arrangements, and event day. In view of these, the proposal is able to describe details of team members and provide links to them who will help in the execution of the project and I strongly believe they have the Desired Skills and experience to carry out the project should they be funded. \nFurthermore, the proposal team is able to provide details of breakdown budget of funds on how it will be used should they be funded which I strongly believe it's COMMENDABLE for them to get funding to execute their project. To add to these, the proposal is able to identify some risk challenge that could prevent them from executing their project such as , Issues that may arise would be finding space to host events on compus and they able to navigate solution to them such as, we will be able to get around these issue by making a advance approach for venue spece in the university compus should they be funded.", "q1r": 5, "q2": "The proposal team has done well by indicating measure to track their progress through some key metrics to look out for such as;, Number of addendee , Number of New people onboarding project catalyst account created and the number of people creating Yorio wallet should they be funded.\nFurthermore, proposal is able to tell how success will be measure by number of attendance and how their goal will be for the first few event would be to have over 100 ladies with most of them creating project catalyst should they be funded and I strongly believe they will do a great job if they are funded. The proposal is also honest to indicate that, they will not return to catalyst in late round for further funding since their project is for short term.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 11630, "q0": " The proposer and her team have done a marvelous job by placing THE PROPOSAL IN THE RIGHT challenge category in addressing the problem OF CARDANO ADOPTION IN AFRICA. The proposal has also elaborated well on the value this would bring to project catalyst on the CARDANO blockchain ecosystem in Ghana among Ghanaian ladies. The proposer has outlined what the goals of the proposal is and how this will impact the CARDANO blockchain ecosystems such educating ladies to create awareness, Onboard of new members precisely ladies and to develops their interests in the opportunities available in the CARDANO ecosystems as ITS key METRICS link to the goals.The proposal have also suggested future innovation that will scale up in the creation of innovations for the future challenges. \nThe proposer will need to indicate what the blueprint is in line with how to sustain the project when funded for the future because you can not just create awareness and develops ladies interest and leave it there there has to be a monitoring component to this proposal on the ladies it has ONBOARDED on project catalyst. I believe when funds are made available to this proposal young ladies in Ghana will get to know and gain access to the CARDANO blockchain ecosystems in Ghana.", "q0r": 5, "q1": "The proposer and her team have provided link and references to their skills and experiences in the proposal. The proposal has a team of educator, non-profit management and marketets among them and has listed four of them to help implement the proposal should it be funded. The proposer and her team has a break down on how funds will managed on the proposal and they have linked ink to identified events to be carried out, which are their are very realistic and achieve  the set goal. The proposal has a detailed plan on how the implementation will be from getting venues, speakers and  attendees. The proposer and her team have details on how resources will be allocated to the various aspects of the proposal implementation. The proposer has adequately identified the risk to the proposal implementation and has equally made some measures in the proposal to mitigate the risk. Which I believe will help in the risk management should this proposal be funded.", "q1r": 5, "q2": "The proposer and her team have outline how to measure the progress by the number of attendees, number of new members onboarding on the project catalyst, number of new project catalyst accounts created and the yori wallet creation as their key METRICS to measure the progress and success of the proposal . The proposal success will be measured by the number attendees for the first event with over 100 ladies onboarding on to the project catalyst, creating account and submitting new proposals for themselves. The proposer and her team have clearly explained the problem to target, how the outcome can be measured, it has also effectively provided a head way to which the solutions in the proposal can address the problems. The proposal also has in it channel for effective communication and updating the community on regular basis on progress and success. I believe if the proposal is rightly funded it will would open up more ladies participation in the CARDANO ecosystems in Ghana to help reduce the many burden they go through.", "q2r": 4, "assessor": "z_assessor_3262", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 10844, "q0": "This proposal is intended to introduce and encourage the development of Cardano blockchain technology in Africa. The proposed solution organizes events to showcase the opportunities in blockchain technology. It specifically targets women in Africa who are not treated fairly in the economy. The author also provides specific data to prove that women are the target audience of the project. Inspiring Ladies Colloquium is not only a place to educate and create awareness, but it also provides career opportunities and financial development for many women in Africa. ", "q0r": 5, "q1": "Information about team members is provided in great detail. We know your name, previous experience, and LinkedIn profile. In addition, the contents of the plan, and budget allocation are also presented quite basic, enough to know how the project will be implemented, and whether the cost is reasonable or not. So it conveys a lot of confidence in the ability to successfully execute the project. ", "q1r": 4, "q2": "This section provides indicators to measure project progress such as the Number of attendees, Number of new people onboarding project catalysts, Number of new project catalyst accounts created, and The number of people creating Yorio wallet. However, there is no specific number mentioned. I think it is necessary to give specific goals so that the community can easily monitor and evaluate. It would be great to have a report sheet. How many people attended the event? How many proposals in Project catalyst were submitted by the participants of this event? ", "q2r": 4, "assessor": "z_assessor_3196", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10790, "q0": "Even though women's worth has increased significantly worldwide, gender equality has always been a contentious topic. In certain nations, women still aren't able to compete on an equal footing with men, not to mention they can outperform them. Therefore, as a woman, I applaud your project to help African women rediscover their priceless values. You make a strong case for recreating the reality of female inequality in Africa to inspire the creation of a networking event that encourages participants to Cardano blockchain. I adore your concept since it creates a space for women's learning and development. Unquestionably, it addresses the challenge you submitted it in and its KPIs. However, I haven't seen you mention promoting the event or getting people to attend. Because, for example, the challenge of attracting an obsolete female audience to join this event or simply allow their children to participate perhaps should also be considered this project's risk. In my opinion, traditions are ingrained in their subconscious, so the event will be difficult to attract many participants if you do not have a reasonable way of promoting it.", "q0r": 4, "q1": "The proposal includes a schedule of activities for each week of the two-month project and a budget for each item. Your proposal contains all the necessary material but is not yet thorough enough to persuade investors. Instead of naming a week's activities with a few nouns, write them down in sentences that clarify what you're going to accomplish, how you will do it, and why. Furthermore, I note you mentioned speakers who will be speaking at the event, so I'd like you to name a few that you're hoping to invite. Finally, include a method for managing workload, so everyone understands how your team will manage work when members are working on many projects simultaneously. It will not be difficult for you to improve this proposal with a team that includes many talented people from various professions like yours.", "q1r": 4, "q2": "I believe the Auditability section can easily receive the greatest but also the lowest scores because it does not demand as much as the other two sections, but sometimes which is why many proposers make it overly vague. A substantial Auditability section will reflect the proposer team's seriousness to the project. Fortunately, your team did an excellent job bringing your concept to a satisfying conclusion. You provide sufficient essential measurements, where you will post project information, a particular vision for future success, and, most importantly, a specific quantitative number for your established target. What you present here may not be the best, but it was sufficient for me, and you deserve to earn this 5 stars rating.\n", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9792, "q0": "From being a woman in the Cardano community, I wholeheartedly endorse this idea both in terms of its practical significance and impact on the women's community. Similar to many countries promoting women's participation in blockchain technology, promoting women to have the opportunity to participate in the Cardano lazy network is full of humanity. Obviously, a program with professional speakers who understand the project will help inspire as well as provide opportunities for women here to be motivated to research and participate in the platform. To achieve high efficiency, of course, the program needs to be replicated further, organizing more events. If limited to this proposal, the approach is still limited, but at least it solves the problem it raised earlier. In summary, this is an encouraging project for women to understand more about its opportunities with Cardano in particular and blockchain in general so that more and more women also have the desire and capacity for this.", "q0r": 5, "q1": "With a relatively small scale, I believe this project is completely feasible. As for the project creators, I consider their experience as well as their abilities through the profiles they give, all of them are competent in their field, even in the area of ​​blockchain knowledge or cardano, or field of design for media publications or events. That can ensure a complete level of preparation for the event. One point of interest here is that the marketing plan for the project has not been specifically stated? Will they be able to attract the desired number of attendees? Moreover, the knowledge given needs to be carefully selected to make it easy for women to understand, especially if they want to approach ordinary women who do not have much knowledge about blockchain", "q1r": 5, "q2": "The time, cost allocation and KPIs of the project are presented in a coherent, reasonable and easy to understand manner. As a person who often has to do media events, I find it completely reasonable and quite detailed\nOne thing to note is that the project team is completely concerned with the KPI in terms of quantity and not on the quality. To evaluate this part of quality can be expressed by positive or negative feedback or questionnaires with data on the level of satisfaction of the participants after leaving.\nThis will be objective and the implementation team will also have the opportunity to learn from experience for the next time.", "q2r": 4, "assessor": "z_assessor_3096", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7836, "q0": "The Proposer wants to create awareness among young female youth about Cardano Blockchain Technology and its opportunities in Ghana/Africa and this addresses the Challenge. \nThe Proposer has made emphasis 2020 Statistical Data and Cultural practices which shows how females/women had been dumped under very low esteem and deprived their potentials in certain part of Ghana/Africa continent and has contributed to poverty of 67% in Ghana. \nThere, inspiring ladies colloquium as an event to educate, create awareness and sensitive ladies opportunities available on Cardano Blockchain Ecosystem.\nNetworking among attendees and on boarding yo the Africa Townhall to learn more about Project Catalyst will enable fem/women to know how to advance their talents in the Ecosystem. \nThese events will bring new minds among young females/women to adopt the Cardano Blockchain and innovate to have better and Proposerous Ghana and Africa as a whole. \nThe Proposer clearly stated risk factor that might arise and measure that will be put in place to make it a success identified.\nThis could also be addressed by getting a venue outside course where students can be picked from and to in order to deliver successfully. ", "q0r": 5, "q1": "Detailed background and profile of the  team to execute the task is much convincing of their indepth knowledge on Cardano Blockchain. \nPreparation stage on organising the event , to what goes into proposed budget of Usd4,456 are all stated.\nWeighing the Team knowledge and experience,  the description of the project and its coverage indicate, the Project will be implemented successfully .", "q1r": 5, "q2": "The Proposet has stated a well simplified metrics to measure how impactful  on Cardano Ecosystem,  video recordings to cover programme for reference etc.\nA clear correlation between project description and proposed budget indicate that, the sucess of the proposal is auditable. ", "q2r": 5, "assessor": "z_assessor_2927", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7798, "q0": "This is a very good idea to inspire young women in Africa through colloquiums. Awareness of the African people, especially women, about blockchain and Cardano is still at a relatively low level. Propose solutions by inviting female speakers who understand the project to inspire young women. Thereby giving them the opportunity to enter a potential new industry. The project also contributes to promoting Cardano's image stronger and deeper to young women in Africa, who can later take control of their destiny and change the Continent. In my opinion, to achieve the best effect, it should not stop at just a few Colloquiums, but should be deployed regularly and in many other places, to spread this spirit to more people in Africa", "q0r": 5, "q1": "Through the profiles of the project proponents, their knowledge and experience in both expertise and inspiration for young people are very good. These are also relatively minor events. So we can completely trust that they will do well on this project. The costs are also presented clearly and reasonably. The plan is also outlined so that everyone can visualize how the project team will implement. A small suggestion for the project writing team, can you elaborate a bit more on the expected content of the project, how the program conveys the message to the audience. Then your proposal will be more convincing. We also understand that organizing colloquiums is not difficult but to really inspire young women in Africa is not easy. And from inspiring to changing the lives of these people is even harder. Of course, to do things like that, we will need much bigger, longer-term projects than this. And projects like this one would be a good start.", "q1r": 5, "q2": "The project proponent has come up with a set of project KPIs. I think these criteria are reasonable to measure the quality of the colloquiums and the impact on the young women who participate afterwards. For example, the criteria of the number of wallets created, the number of people participating in Catalyst will measure the impact of the project. However, it would be better if the proposal outlines how the community could check the development of the project, which step in the plan are being implemented and how it has been done. I think there is also a need for more criteria for the feedback of the attendees. This is also a way to help the project get better and better.\n", "q2r": 4, "assessor": "z_assessor_2922", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7639, "q0": "The problem described in this proposal is closely aligned with the challenge.\nThe team has done a great job by putting the proposal at the right challenge. The problem identified within this challenge is lack of education of Cardano to ladies youth in Ghana, and the proposer suggest a workable solution which is to organize educational events in universities in Ghana and invite speakers to educate ladies on the Cardano blockchain and its benefits. \nThe benefits to Cardano with organising  these educational events is it will increase interest in Cardano among young Ladies in Ghana and onboard new potential to project catalyst. These events would bring new minds to adopt the Cardano Blockchain and train more people into the ecosystem. \nThe key metrics and goals of the proposal align with the outlined challenge settings. \nFurthermore, the proposal is able to scale to address future challenges which is, it will keep on getting more women on boarded into Cardano ecosystem through its educational initiative and the proposal clearly articulates a plan for the project's future sustainability.\n\n", "q0r": 5, "q1": "The proposer provides evidence involving references, and links of the team who are mainly going to help execute the project, also included their relevant skills and experience they all possess needed to implement the proposal if funded. \nMoreover, the proposal and team from the links provided have the desired skills and experience to be able to execute the project should they be funded and I think that is commendable to say the least. \nThe budget is outlined clearly and broken down properly. The budget is also reasonable to achieve the set goals and it offers a realistic timetable to complete the work.\nThe proposer has considered challenges and risks relevant to a successful implementation and how to mitigate them.\n", "q1r": 4, "q2": "They proposers have provided a roadmap with milestones and a clear time horizon for achievement. They will use the following to track their progress and success, such as, number of attendees, number of new people onboarding project catalyst, number of new project catalyst accounts created and the number of people creating Yoroi wallet.\nAlso, events will be recorded, the speakers' speeches, and PowerPoints will be recorded to reach more participants when uploaded to their YouTube channels which will be •\tan accessible public channel for delivering regular updates to the community for auditing progress.\nSuccess of the project would be measured by the number of attendees. The goals of their first few events will be to have over 100 ladies with most of them creating project catalyst accounts. Also, they are looking at many future project catalyst proposals coming out of these women who will be trained and empowered into the Cardano ecosystem. ", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6857, "q0": "It can be said that the Cardano Ecosystem continues to grow more closely to the Africa region has we have seen some good number of African participant being involve in Cardano activities how ever the rate of young girls from the African region who have being recorded to be involved in the Cardano actives and hence required program to be set up by Cardano to ensure the onboarding inclusion of these young girls. As we always say Cardano is an open source community that is available for anybody to join but not just anybody can join unless they have being educated and mentored. Young girls from the African region face this problem alot as they do not have access to computers all technical no how to connect with the Cardano community and even maneuver their way through hence their needs for project like this to locate ,onboard, and mentor this young girls to be a part of the Cardano community. The information provided clearly indicate that this proposal will be impactful if funded. Hence i strongly agree to the impact criterial of this proposal.", "q0r": 5, "q1": "The roadmap and the metrics of the proposal are clearly articulated and helps me to no when an activity is to be performed. What i feel is missing is the team not being to indicate exactly who will be taken care of ascertain activity at a time this makes it default for me to access weather there is going to be too much work load on a term member or not. This omission will also affect the feasibility of the proposal as i do not no what rate is assigned to a particular activate and who is taken that rate. The term as done a good job by identify some risk that are likely to headed the successful implementation of the project. The mitigation provided does not really convince me as connections can some times fail. A  better mitigation plan should be develop by the term to ensure a successful implementation. Ether ways i do agree that the term will be able to deliver successfully. I nether agree nor disagree that this proposal will be successfully implemented.", "q1r": 3, "q2": "The roadmap and metrics of this proposal gives a clear indication of what the community can track as far what project progress is involved. What i feel is missing is how the community can track these progress as the project website is not completely develop and there is no plans of it conclusion involve in the project plan. The term mentioned that a recorded version of the event will be posted on YouTube for further engagement, But refuse to provide a link to the YouTube channel. This makes it quite difficult for me to confirm and conclude that this proposal can be tracked by the community successfully. therefore I give it a score of three for auditability. ", "q2r": 3, "assessor": "z_assessor_2838", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5772, "q0": "The proposal is aligned to the challenge to onboard by educating young ladies to take advantage of the benefits of the catalysts and blockchain in general. Within the tech space in Africa only few ladies are seen innovating let alone blockchain. It means young women are far from understanding the blockchain and ongoing innovations and benefits. \n\nThe proposal has the tendency to create for young women in Africa the opportunities to leverage on to transform society while benefiting in the process. ", "q0r": 5, "q1": "The proposal has made available enough time to put the event together so as to have memorable events. This is a good approach to prepare for materials, hunt for good speakers who could simplify the blockchain and catalyst functional activities for success. \n\nThe budget is good and reasonable to match the events for the young women. The budget is also detailed displaying how each item would be funded. \n\nThe proposal has a young team but with much experience in the catalyst community engagement and as well as knowledge  in technology. This denote that the proposal would be implemented easily with success. ", "q1r": 5, "q2": "The proposal has KPIs that could inform the community to audit. It has also made it known of providing visual evidence so part of the proof work to make the more easier auditing. The information provided is therefore enough to monitor and evaluate success. \n\nSuccess is also measured with the attendant sheet and with expected number of them being active in the catalyst ecosystem. ", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5258, "q0": "The proposal is focusing on marginalized women in Ghana and empowering them by introducing them to blockchain and its opportunities. This they intend to do by hosting networking events. They have a clear agenda for the sequence of events in the networking session. The goal is to reach women who have no idea about blockchain and empowering them and this is definitely an impactful proposal to begin with. Since the focus is on a specific group, the proposal has the potential to create the impact it intends to. The risk involved states that the venue could be an issue. The mitigation strategy could have also considered multiple locations instead of counting on one. Since there is a separate budget is set aside for space, looking out for other venues within the budget would be better approach. Since its an IRL event (in real life) venue issues can hinder the whole plan.", "q0r": 5, "q1": "The timeline gives a weekly breakdown of how the team plans to execute the event. 6-7 weeks is dedicated to activities that will lead on to the event day. which would be in the 7th or 8th week (which is the end of 2 months). From the timeline, I understand that 2 months of planning will lead to one event at the end of it. But in the budget breakdown, the expenses are multiplied by 2 months. The breakdown listed is not a recurring expense but on a per-event basis. It is unclear if the proposal intends to host 2 events in 2 months because if that is the case then the timeline specified is inconsistent. The timeline and detailed plan also does not consider marketing plans for the event or how they intend to bring in their target audience or how they will create awareness about the event. There is a budget of $ 200 x 2 = $ 400 for marketing, hence a better explanation of how the marketing is planned would be great. The team details are clearly specified and they have the pre-requisites to pull off an event like this. They also have marketing and graphic designing expertise which is a strong point. It is refreshing to see students working towards a cause.", "q1r": 3, "q2": "The team intends to audit the success of their event(s) based on the number of attendees and people onboarded to project catalyst. They also state that video, and PowerPoints of the event will be shared. Since this is afirst-time attempt, including a feedback system would be better along with the number of people joining. I hope the proposer considers this in case they get funded for the proposal. Their goal of reaching 100 women is great, but mentioning their onboarding strategy to the project catalyst platform would have made it more clear to audit. ", "q2r": 3, "assessor": "z_assessor_2681", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3962, "q0": "I agree strongly to this proposal because looking at the percentage of ladies engaging in works or any other businesses that will generate them a good income is very low and I believe with this project being funded to be implemented will help Grow Africa and the cardano ecosystem because there’re soo many ladies that have good ideas but have no ways of bringing them into a reality. Secondly; the key metrics and goals of the proposal has been stated clearly because the locations as in Accra and Kumasi  where the event will be hosted are classified as two big cities of Ghana 🇬🇭 so am pretty sure bringing this project in existence will help inspire ladies of today to overcome the limited mindset their having that they can involve themselves in what most mens does.  The proposal will also address future challenges as well.", "q0r": 5, "q1": "The proposal has given out links with skills and Experience of team members needed for a successful implementation, budget breakdowns are will stated that sum up to 4,456 suitable enough to achieve the set goal’s with  good team members that plays major roll in the cardano community and project catalyst (ladies) that can  help in a good implementation.  The team has also stated that the wouldn’t be any further funding because this is a new project and they want to see the impacts it’s going to have on the community first. The proposal has described the necessary resources needed to implement the work if funded. Thanks 🙏🏽 ", "q1r": 5, "q2": "The ways to track their work if funded has been stated clearly as videos and recording Ms of the event and speeches from speakers will uploaded to our YouTube channel for others to view is another way of proving the success of the project. The key metrics a also good with well well understanding solutions that addresses the problem.", "q2r": 5, "assessor": "z_assessor_2500", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3394, "q0": "Being myself from Africa, I know and understand how the gender imbalance has an impact to the social and economic situation of Women in that continent.\nInitiate a project that intends to gather only women on an a specific issue as it's for this one, would be to get that group of population feel welcomed in the Cardano ecosystem, but also will find an environment where they could easily express their views with non judgement.\nAlso, the Woman plays a major role in the African society on the family level, but also community level. She's a principal actor to feed her family. So  by providing her an opportunity to improve her social and economical condition, this will impact directly her family and community.\nThe cardano ecosytem mission being also also to improve people social and economical conditions in Africa and other parts of the world.\nthrough this proposal, more women would join the Cardano ecosystem, learn more about the Blockchain and its benefits in their daily life et be ADA holders. This aligns with the objective of this challenge.", "q0r": 5, "q1": "3 out the 4 members of the Proposers team are already members of the project catalyst and have played various roles within the community. Having them during this funding cycle submit a proposal, it would be assumed they have tools on how to frame their funding application, and know how the process looks like.\nBased on my experience in project management' I have always noticed that combining the efforts strengthen an action and facilitate its success. In this regards I would like to see this initiative collaborate with another proposals that's is submitted in this same challenge  that intends to also serve the student community in Ghana (Accra and Kumasi). ''Ghana Youth Onboarding Outreach 2'' the team behind that proposal has already submitted a previous one which was funded , and project activities took place. They would have some takeaway and learnings they would be able to share with this team on such event planning and insight on outreach strategies.\t\nSuch event needs to much effort in outreach to potential participants, the team hasn't shared much information around that. Also, there have been mention of Speakers, but who will be those (their expertise, from which company, and have you connected with them already?)\nThe idea of having incentives and rewards is a good approach as it may help attract amore people to attend the event, meantime it'll tie them right from the first event to the Cardano community as they'll have to stake their ADA and open up Yoroi wallets.\nWhile being detailed, one section of the budget is not explicit enough about the ''Team fees''? to whom is this amount allocated to and for what?\nI'm giving a 4 stars to the feasibility section as I agree about the success with few clarifications raised above.\n\n\t\t\t\n\t\t\t\n", "q1r": 4, "q2": "Materials created wil lbe recorded and published on the YouTube channel to be created. So people would be able to access. The road map set in weeks and having to host only one event during this funding cycle, would help the follow up form the community. However, the website link shared in the proposal is not accessible yet (Coming soon), and nothing mentioned about when would it be live.\nThe KPI's presented are clear, but may be would have added also the number of people who would be playing some roles within the project catalysts as PA or VPA's.", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8907, "q0": "A society can never develop if women is restricted from her rights , so the  idea to educate women regarding the block chain is definitely great idea , where women from Ghana can reunite and develop a project with the help of catalyst funding will definitely be great deal to watch in the future, As developing projects will make them more confident towards cardano's project and can also initiate to use cardano as payment mode among them which will definitely boost usage of cardano. hence, this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The presented task has very high chances of being successful since it doesn't have any risks involved , it just needs venue to conduct the meeting and a good speaker to engaging with women ideas .\nThe proposer has even idea of creating wallets for women, where it will boost the idea of using ADA for women in Ghana, and will also bring confidence among the people related to block chain  projects , since the team has more than 10 years of experience, with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer has introduced his team and their expertise in each field in very detailed manner, and the team members have good idea to market about the project.\nThe team has been working in women development for very long time, the presented plan has detailed budget breaking idea and has the team has structured timeline to complete the project, with provided key indicators in the project , with minimal risk involved in project ,the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 13832, "q0": "Outreaching women in Ghana universities can be the first step in the ambitious challenge of Grow Africa, Grow Cardano. Educational events and colloquiums for introducing women in Ghana into Cardano blockchain technology and Cardano Catalyst Community are the key element for outboarding female african newcomers into our community. If female students can empower themselves with Cardano blockchain technology and its opportunities, women from a variety of backgrounds can empower themselves also. This liberating tool might be seen as a chain reaction of freedom. Female students who engage and onboard successfully on Cardano Catalyst might share their discovery with other women who didn’t have the chance to go to the University. After these events and colloquium, this team can design a strategy of engaging students in promoting Cardano Catalyst opportunities. They might find the language and way of getting closer to a wider female Ghana audience. This proposal effectively addresses the challenge. ", "q0r": 5, "q1": "Team has experience of venue organizing and having a female Ghana student is a guarantee of knowing the field in which they will be working. Experience seems to be enough to successfully implement the proposal although it seems to be lacking a social media communication strategy to ensure high attendance into the event. Without some sort of marketing strategy within Ghana Universities they might find their plans blown out by poor attendance. This weak point in regards to their key milestones can be easily fixed with some already experienced mentors in venues within the Cardano Catalyst Community. ", "q1r": 4, "q2": "Number of attendees, people onboarding Catalyst and Yori wallets created after the events will be sufficient to audit the success of the proposal once it’s finished but some communication channels are missing in order to share project progress within the Cardano Catalyst Community. Anyways, considering team members have strong connections and previous experiences within Cardano Community, it is to say there will be no hurdles at the time of auditing this brilliant proposal. It might be interesting as well, to gather quality information regardless Ghanian Women impressions, challenges and needs for the enrichment of our Community’s pool of ideas. ", "q2r": 4, "assessor": "z_assessor_3833", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Organize educational events in universities in Ghana and invite speakers to educate ladies on the Cardano blockchain and its benefits.", "experience": "We are a team of educators and Non-Profit Management and marketers with more than 10 years of experience."}