{"id": 420032, "author": "hakua1993", "title": "Africa Short Films with Cardano", "url": "https://cardano.ideascale.com/a/dtd/420032-48088", "category": 26600, "amount": 15960, "description": "How do we inspire the average person to align themselves with Cardano's mission while bringing clarity to what Cardano is doing in Africa.", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 10581, "q0": "“Africa Short Films with Cardano” is a good idea and meets the challenge “Grow Africa, Grow Cardano”. The proposal has brought out the content that is quite popular today, which is: \"How do we inspire the average person to align themselves with Cardano's mission while bringing clarity to what Cardano is doing in Africa.” In fact, Blockchain technology and the Cardano ecosystem are still new concepts for many people. The number of people who know and go deeply into Cardano is still not much, partly because they do not know where to start and do not fully grasp the effects and positive effects of the Cardano ecosystem, not everyone is patiently trying to research what blockchain is, leading to Cardano and Blockchain being unfamiliar to many people, limiting the development and scaling of Cardano. Therefore, in my opinion, it is reasonable and necessary to create a short film to provide basic and easy-to-understand information to inspire more people to know about Cardano. The solution proposed by the proponent I saw also identified the problems of the challenge, they prepared a detailed plan and clearly defined what the implementation solution would solve. They have set out the KPIs that need to be achieved in quite a detail in each different aspect. However, the content of KPIs I think should be mentioned and researched in-depth in the auditability, it would be more reasonable. To successfully implement the project, the proponent also anticipated the risks. Every risk has a solution to overcome.", "q0r": 4, "q1": "The proponent presented the implementation roadmap by breaking it down into milestones, namely divided into 4 phases. Each stage is defined with the implementation period and specific tasks and tasks of each stage. This makes it easy for everyone to track and control the progress and quality of each stage. Regarding the budget, the proponent presented how to allocate and use each of those budgets. The roadmap is divided into 4 phases, the proponent also divides the budget into 4 corresponding parts. I think this is very reasonable because it helps to evaluate the effectiveness of using the budget of each period, from which it can be adjusted to both ensure reasonable use of capital and avoid waste. In particular, the cost is also separated and calculated by the proponent according to specific and clear working hours. However, here the proposer only presents the budget for the first 2 phases, not yet for the 3rd and 4th stages. Besides, the total budget requested by the proponent above is $15,960, but through this budget presentation, this is only the cost for phase 1. I think that this part should be supplemented or adjusted by the proponent to avoid misunderstanding. Regarding the participating group, the proponent presented information about 3 members with different positions and positions. However, if possible, the proponent should add more information about the person's work experience, qualifications, and suitability for the job, or provide more information through the media social networks such as Youtube, Twitter, Facebook, LinkedIn, etc for people to conveniently access and search for information. That will help increase the reliability of the project.", "q1r": 4, "q2": "To measure project progress, the proponent will update Twitter/social media on the current progress of the project, which I find relatively clear and transparent. However, to increase auditability, if possible, the proponent should add more specific indicators or KPIs for easy monitoring and evaluation. The success of the project is also clearly defined through specific, detailed results. This proposal has been proposed in the previous fund but has not received funding. I find the positive impact of this proposal relatively large, benefiting both the newbies and the Cardano ecosystem. Therefore, I think this proposal will be finalized and funded soon.", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10791, "q0": "Cardano has progressed thanks to the effort of everyone's thoughts and creativity. Many educational projects have been offered to help promote Cardano to a broader audience, but the premise has resulted in monotony. As a result, new advertising methods emerged, with films about the Cardano blockchain serving as a notable example. I admire your team's innovation when it comes to blending the emotions and logic of the audience's brains to create the most spectacular movie content. You demonstrate sincerity and excitement for this project when you openly query its feasibility and then provide the best appropriate answer. Most proposals, in my experience, usually have the shortest response to the main risk of the three main concerns, but your proposal is different. It is not just long but also presented with all of your team's enthusiasm and aspirations. I applaud your initiative.\n\nThis, however, may have the opposite effect on investors because it appears that you are still unsure about the future of your idea. So, rather than writing too much in the main risk part, let's relocate this content to the solution introduction, but in a different approach - as if it's talking about what motivated you to make the film and why people should be interested in promoting Cardano through movies.\n\nGood content but misplaced will not be effective. That is the error you make for both the main risk and the addressing challenge. The KPIs you provide are specific to your project and should be in the Auditability section. The question requires you to describe the connection between your proposed solution and the stated challenge. Therefore, please use the challenge's KPIs.\n", "q0r": 4, "q1": "The plan and budget you give demonstrate your comprehensive preparation. There is a timeline with specific activities and appropriate cost levels. However, it is not precise enough to show the seriousness of your team. Why not attempt detailing them in short paragraphs instead of just writing a few nouns at each stage? This will assist your plan in becoming more detailed and professional. You could also provide a few lines of introduction about team members rather than just their names and jobs. Let's talk more about the members' blockchain experience so that investors can be confident in the quality of your movie.\n", "q1r": 3, "q2": "You inform everyone about where and how you will keep everyone up to date on the project's development. Project success is also defined in phases with particular results. However, as indicated in the Impact section, the text connected to the project's KPIs has been misplaced. They should be here, and you should get a 5 instead of a 4.\n", "q2r": 4, "assessor": "z_assessor_3193", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10984, "q0": "The proposal identifies problem that needs to be solved and clearly articulates how it will add value to the Cardano ecosystem. Film is always a strong tool to create awareness, create understanding and concept. This project will be beneficial and bring good value to make more people know about Cardano in Africa. The proposal is able to scale to address future challenges and the proposer will upload it in their youtube channel that can be easy to access and share to Cardano communities around the world. The key metrics and goals of the proposal align with the outlined challenge settings.", "q0r": 4, "q1": "The proposer provides evidence, like references and links for their previous project (it was great) and also their website. The team clearly has experience to make short movie. The budget is outlined clearly and broken down into identifiable items. In my opinion the cost for the phase one is very expensive. I hope that if this is funded, the proposer can adjust the budget for the second phase, so that it will be propose based on the realization budget in the phase one. The timetable is realistic to complete the work. The plan describes the resources necessary to implement the proposal. I think it is important to have some people at the IOHK to also involve in the project to make sure that the information that will be given in the proposal are reliable. The proposer also has considered challenges and risks relevant to a successful implementation of this project.", "q1r": 4, "q2": "The proposer need to add their social media link and also an accessible public channel like github to update the process of the movie making at phase 1. It is hard to track the progress for the phase one, because the movie won't be there yet by the end of the phase one. That's why the team need to have a regular update for the thing that they will do if this proposal is funded. This proposal has a clear roadmap with milestones and a time horizon for achievement. The metrics that define the success of the project are described very well and the measurements also very clear and measurable. I think this project could be a good one to raise awareness, introduce Cardano better and also bring big value to the ecosystem if the team can make this short movie very well.", "q2r": 4, "assessor": "z_assessor_3213", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12635, "q0": "Proposal fit the challenge. The mission of bringing Cardano to Africa is really important, but the big difficulty is how to make them curious, interested and want to learn about this ecosystem. And you are giving one of the very good methods to solve this problem. It's proving to them that people like them can easily access Cardano too.\nI don't have much knowledge about filmmaking, but I think the first thing that attracts a movie is its title. The title of the film needs to target the strong points of the people interested, making them very stimulating and the possibility of reaching them will be higher. I myself have always been attracted by the title of a movie, even if the movie is not very invested, but it explains my curiosity about the title of the movie. That's my opinion, I hope you don't take this part lightly, I think it's really useful.", "q0r": 5, "q1": "Thank you for providing a roadmap with actual timelines. I understand the amount of work the team takes on, but to be more complete, you should add which members will take on which stages of the work. I would have a better understanding of the group assignment. Thank you for providing detailed information and related links about membership. I have no comment on this part of the proposal. The required budget is in line with the scope of the project. I rate this part highly.", "q1r": 4, "q2": "Yes, a movie project like this you need to keep updated on the project progress and the easiest community surveys to follow. This helps the team work closely with the community and easily receive suggestions to improve the project as well as receive support. Thank you for showing me the success you expect and your perspective on this proposal. Since this is an early stage, some of your goals are reasonable. I have no requirements.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14499, "q0": "This proposal is very interesting and fits perfectly with the objectives of this challenge. The proposal addresses the Challenge's problem by creating a film to promote Cardano to people in Africa. The project has established particular KPIs and goals that correspond to the challenge settings, such as the number of people inside and outside the film industry who are aware of and understand more about Cardano, the number of filmmakers with whom the project will collaborate, and so on.\nThe proposal if it is successful, it will positively contribute to and motivate other filmmakers to create Cardano products.", "q0r": 5, "q1": "The proposal includes detailed plans, roadmaps for each stage, and milestones for completing various tasks. The budget is provided in detail, clearly, and for the overall project process. They have provided information on the team that will be working on the proposal as well as their experience in cinema and technology required to complete the project successfully. However, no social profile of the team members, such as LinkedIn profile links to validate their credibility was provided on the proposal. However, I was able to locate their Twitter link on their website. They have also evaluated potential issues and provided mitigation solutions. If funded, it is quite likely that the proposal will be carried out successfully.", "q1r": 4, "q2": "The team has proposed a plan, however specific milestones with timelines should be added. They have failed to present clear KPIs and Metrics to help in measuring the impact of their success. The given SDG and sub goal will also help in measuring the project's success. They have stated that progress updates will be issued on Twitter, but have not specified how frequently or when these updates will be released. The details provided for audibility are insufficient to evaluate the proposal's success and progress.", "q2r": 2, "assessor": "z_assessor_4060", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Create short films that follow a person in Africa that has problems Cardano can solve to spark people outside of Cardano's circle of influence while inspiring them to align with the mission.", "experience": "We have created one of the first large content gated ticket systems on the blockchain with the film \"A Failed Artist\" in 2 months with no external funding.\nFor more info check out https://www.afailedartist.com/\n15+ years combined experience in directing, filming, and editing."}