{"id": 420273, "author": "jerrybnj", "title": "Blockchain Education Masterclass", "url": "https://cardano.ideascale.com/a/dtd/420273-48088", "category": 26600, "amount": 26000, "description": "Education is key to adoption and use of a service. How can we educate students in Northern Ghana and beyond about Cardano Ecosystem and its benefits?", "f6_no_assessments": 21, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 4145, "q0": "Reaching out to university and high school students to educate them about Cardano and its opportunities is indeed one of the great initiatives to ensuring that Cardano is well-rooted in Africa as the 'challenge setting 'proposes to achieve. As the saying goes: \"Education is the key to success\", education would definitely be the only mechanism to aid in eliminating the preconceived idea of blockchain being a scam which is noted as one of the major reasons why the participation of the African region in blockchain-related activities is very low statistically comparing to the Western world. This has been a problem for centuries and I am glad to see a solution like this emerging gradually.\n\nWith regards to value addition to the Cardano ecosystem, I think this proposal has done a good articulation. What I feel is quite general and could be improved to increase scores is the use of the phrase \"Number of\" and \"Percentage of\". This creates the impression that the team isn't certain of what to expect from this project. Being more precise by using phrases like \"x% of\" would have helped the community's judgment on the impact while not holding them to the bar of providing specific figures.\n\nI see about 90% metric alignment from this proposal as far as the 'challenge setting' is concerned. The scope and metrics of this proposal cover not less than 5 of the 7 main KPIs of the challenge setting and thus indicating that the proposal is a good fit for this 'challenge setting'.\n\nAdoption has been a challenge in Africa and continues to remain a challenge due to the lack of comprehensive education. Years back, people regarded electricity as a demon creature and hence refrained from its usage and adoption until after some time where they received comprehensive education on what electricity is and why it's a great invention and not a 'demon' as they see it to be. Blockchain and as a matter of fact, Cardano has the same case here. One of the major future problems likely to be encountered would be adoption. However, since this proposal is to educate the university and high school students who are by far the immediate next nation leaders, I see the futuristic problems being addressed by it.\n\nThe proposer indicated that he might return to the Catalyst to request more funds to conduct another line of workshops like this if the need be. But of course, I think he will come back to Catalyst to request more to do more since there are not only 1,000 university and high school students in Northern Ghana for him to reach out to with this great initiative. Therefore, a clear plan on how this project would be sustainable in the future would have been great.\n\nWith regards to my humble submission stated above, I score the impact for this project 4 out of 5.", "q0r": 4, "q1": "From his Twitter feed, thanks to the link provided in this proposal, it is clear that Jeremiah Baani who is the proposer for this project is blockchain-enthused personnel. Some of his posts confirm his statement of having done this before in his project description and also his capability to deliver the role being assigned. However, little information was provided for Mustapha Yakubu who is listed as a team member in the proposal. The proposer only provided information on what role he will be playing which is good but no information on his relevant expertise with regards to that role can be found despite the link to his Twitter profile being provided. I thought I could get more relevant information from there as I did for Jeremiah but unfortunately the outcome was minimal. It is of course stated in his profile that he is an \"events and project manager\", and \"youth leader and advocate\" but no extra information like posts of activities to confirm.\nWada, on the other hand, is a great entity in the community of which if not for all, the majority of the community can attest to the great contributions they have brought to the scaling of Cardano as far as Africa is concerned for over a year now. Being assigned as the project overseer is something feasible as Wada has the capabilities. From the Wada website, I see about 23 team members listed of which Jeremiah and Mustapha are inclusive. This leaves me to believe that they are already part of the Wada force which has been delivering great contributions to the Cardano ecosystem and thus feasible to get the work done if funded. However, the proposer could have done even a better job by listing exactly who is or are going to take up the supervision role just so as to help us judge against the budget.\n\nAn amount of 26,000 USD being requested to execute this project is feasible in a general sense but the breakdown raises so many questions that should have been answered in the project description but were not and thus renders me skeptical. For instance, the proposer quotes an amount of 5,000 USD for the transportation, feeding, and accommodation of resource persons but now information has been provided on how many resource persons would be needed for successful implementation and where they will be traveling from. The absence of this information makes it hard to determine whether or not the allocation is feasible or not and hence proposer should consider including such information. Also, I am left with no option but to question the amount stated for the \"resource persons honorarium\" since I do not know exactly how many people are entitled to this amount of money (1,600 USD).\nThe rest of the budget breakdown looks okay for me except for the fact that the proposer could have provided more transparency by telling us how many quiz winners would be announced and what percentage of the 2,000 USD they will be receiving respectively.\n\nThe proposal, from my perspective, comes with a broad roadmap that fails to discuss exactly what would be done at what time, by whom, and even at what rate. It is only mentioned in the proposal that they intend to use 1-3 months for the project implementation but exactly what would be done in week 1 through to the last week remains unknown to the community. I advise that the proposer considers this, as it's very useful for progress tracking of the project despite the conductible plan provided in the proposal.\n\nThe proposer does well to address the risk of permission granted by institutions likely to be delayed but I think that may not be the only risk. Just so you know, students are quite skeptical with exposure to content they do not understand. In this regard, what is the plan to ensure that students (at least 1,000) as quoted in the proposal show up at the event to grab their share of the education?\n\nLastly, the proposer refuses to tell the community that he or any of his team members are involved in any other proposals in Fund9 but background research indicates that Wada is involved in not less than 5 different proposals in Fund 9.\n\nPer my submissions stated above, my score for the feasibility of this deduces to 3 as I remain skeptical.", "q1r": 3, "q2": "It is quite unfortunate that the proposal refused to capture exactly how the project's progress can be tracked by the community. From the proposal, there's a YouTube link attachment that leads to a CTEIL video titled \"Masterclass 2022 Lesson 1: Introduction To Blockchain\" which was presented by Jeremiah Baani. In his presentation, he made mention that he is the lead for that project, and for that, I was thinking he could use that channel as a public medium of reporting progress reports to the community since there's no plan of developing a YouTube channel or website to take care of that.\n\nThe proposal refuses to give a clear roadmap that details what needs to be done and at what time. As argued in my feasibility note, the information provided as a roadmap is only vague and thus has no milestones to measure as far as implementation is concerned. A clear roadmap like (x and x are to be done in week 1 with an expected outcome of y and y) would have been a great supplement to the proposal.\n\nAlthough the team has showcased a good level of understanding of the targeted problem and a solution that can be measured against the problem outcome, it is not enough to clear my doubts regarding auditability as most relevant questions were incorrectly answered in the proposal. This leaves my score at 3 out of 5. However, I wish to extend the best of wishes to the proposer and urge him not to give up if not funded but to pay attention to the PA feedback in order to help him put together a great proposal for subsequent iterations since the idea is superb!", "q2r": 3, "assessor": "z_assessor_2518", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 5545, "q0": "The idea is wonderful. Education is one of the effective means by which people can be well informed about Cardano blockchain. The proposal seeks to raise the awareness of university/college and high school students about Cardano blockchain and the opportunities available, and hence the proposal tackles the critical issues of the challenge setting. Grow Africa, Grow Cardano challenge seeks to expand the Cardano ecosystem in the African continent, with this proposal, that vision can be achieved in the long run. The value that cardano would derive from this project cannot be overlooked. It’s clear that the proposer/team seeks to shape students through the education to become competent Community Advisors (CAs), referrers, proposers and active community members in general, hence I believe that this would help increase the number of active participants in the various catalyst roles and also to ensure that participants are well informed on the roles they have taken up. All Project Catalyst roles require the necessary skills and training in order to provide constructive feedback to the entire ecosystem, the proposer is actually concerned with that, and that for me is a plus to cardano. I like the idea that the proposer seeks to help students create native wallets and consequently create new Ada holders because this would help to increase number of voters and hence would promote a fair representation and decision making in project catalyst. One of the key metrics of the proposal seeks to measure the number of students who attend the team’s cardano conferences: this for me is very necessary to ascertain the number of students/participants that have interest in the blockchain’s opportunities. \nAlso, the measurement of the percentage of students that become Community advisors and proposers are expedient to ensure valid assessments and brilliant projects respectively as far as project catalyst is concerned. There are other key metrics and all of them align with the challenge setting .\nGoing through the goals of the project, I see that they are in congruence with the challenge. \nA proposal of this nature has high chances of increasing the number of people who are currently in the cardano ecosystem.\n\nThe African continent is considered as deprived not because of the absence of good and excellent intellectuals but due to the fact that the African people are not exposed to golden opportunities like this: so with this proposal the African people can be well informed about cardano and contribute to benefit both the ecosystem and themselves.\nWith all these stated above, I believe this proposal is impactful.\n", "q0r": 5, "q1": "It’s clear that the proposer/team have been engaging in cardano blockchain education for sometime now considering the fact that evidence of their meetups with participants have been provided. They have provided links to prove they are members of WADA and also there is a video that supports the fact that the team have been embarking on blockchain education. With the above relevant experience, I believe that the team is well skilled and capable of implementing the project. Also the team to the proposal is not vague. The proposal has clearly stated the team members and their relevant experience. Members of the team are also members of WADA, and that for me shows they are the right team for the task. \nGoing through the budget, I realize that there is a great deal of clarity in it, the reason been that cost of every sub-item is clearly stated. However, I believe that the cost of “ transportation, feeding, accommodation of resource personnel” which is $5000 could have been cut down a bit so that it can create room for easy funding. All the same, considering the nature of the proposal, the budget stated is reasonable to cater for the expenses. The team intends to execute the project within 3 months which happens to fall within the time frame of the challenge, and also the time duration in this sense would give the team enough time to engage students in the targeted schools. \nWithin the 3 months, the team seeks to reach out to atleast 1000 tertiary and high students in northern Ghana through conferences/meetups. I believe this creates the impression of the possibility of reaching out to the stated number of students because organizing conferences and meetups where there is a mass attendance of students would really help the team realize the 1000 students they anticipate at the end of the conferences.\nThe team also expects to hold about 10 face-to-face community events when funded, this is great but however, I feel that more face-to-face meetups can be created within the 3 months life span of the project. This would help to accommodate for more participants. I also understand that the team would also have online session with students, probably that would cover up for the limited face-to-face meetups, though it’s not clearly stated as to the number of sessions that would be held online.\nCardano is written in Haskell. It’s great to see that the team would factor in preparing students to have interest in learning the coded language. Going through the proposal, it does not appear like participants/students would be taught Haskell by the team but rather the team would raise their awareness and those that have interest in learning the language can pursue to achieve that. That’s actually a great move.\nThe team have indicated a risk which is that there might be delay in approval of letters by school authorities to hold conferences. The management of the risk provided in the proposal is very efficient, because if letters are sent earlier before event start, it would help the team to be sure if permission is granted or otherwise and that will also prevent time wastage.\nAt this, I can say that considering information provided with regards to the project’s feasibility, I believe that the project is feasible.\n", "q1r": 4, "q2": "The roadmap presented in the proposal is quite comprehensive as it’s easy to know how the project activities would be carried out. As stated earlier, the team wishes to reach out to atleast 1000 students within 3 months and realize about 200 active participants, that for me is a clear milestone for this caliber of project. The time frame for the project as stated is expected to be 3 months: that’s stated clearly.\n\nGoing through the metrics, I believe the team wisely chose them. The proposal is geared towards educating students about Cardano and later on on-board them into the ecosystem; the metrics stated in the proposal are good to define its success.\nThe problem the team is communicating is that tertiary and high school students in northern Ghana are not aware of cardano blockchain so they are seeking to educate the students through conferences and meetups. With this, I think that there is clarity in the problem, solution and how the proposal is aligned with them. If the problem of students unawareness about the blockchain is tackled, then the proposed outcome of the proposal would be achieved. I would say that, the metrics/KPIs chosen are good indicators for evaluating the success of the project.\n\nThe solution provided in the proposal is clear and understandable. \nThe team has stated that WADA would play a supervisory role in the execution of the project. However, there are many other channels that the team can use to communicate the project’s progress to the community. Social media platforms like Facebook, Discord, WhatsApp, Telegram, Instagram, Twitter just to name but a few are good grounds where community members can monitor or track the implementation because almost every community member is on atleast one of these platforms. The team can factor in this in future proposals as it would create room for public accessibility.\nHaving stated all the above, I am confident that the proposal is auditable.", "q2r": 4, "assessor": "z_assessor_2713", "no_vca": 6, "ne": 5, "ng": 0, "nfo": 1, "vca_o": 2}, {"id": 461, "q0": "This proposal can be categorized as an onboarding effort for newbies. This is due to the materials they will be educating on, which are general information on Cardano and blockchain with an exception on the topic of Project Catalyst. As is, without considering the competing similar proposals, this would indeed instigate initial enquiries regarding on how to be more involved in most likely Project Catalyst.\n\nIt also is a offline or face-to-face event which is more effective than online events in numerous ways. First is the potential of having instantaneous connections with groups of individuals which can spark on-the-spot future collaboration. This is what typically happen when we are in social setting, there is a tendency to gravitate towards individuals we have connection with. Online meetings, prohibits that instantaneous connections, it takes numerous online meetings to achieve a mutual understanding. Though in the future, as we are more used to WFH, our social tendencies most likely will evolve and become more effective in communicating online.\n\nThe situation in Africa is that not all areas have the infrastructure to support a comprehensive online experience. Hence, events such as this proposal plays a significantly higher role in Africa.  ", "q0r": 4, "q1": "The credentials that would instill confidence on the users capability to deliver the intended materials effectively is limited. They did provide Twitter handles, but the content provided adds little value in clarifying their credentials.\n\nWhat is plentiful is documentation of prior events though is unclear what those event are about. Perhaps this is just a matter of not yet knowing the proper documentation needed.\n\nKnowing that WADA has a position as an overseer of this proposal, perhaps as they continue to work together, the quality of the proposal, the quality on the method of reporting and documentation will gradually increase. Based on only the materials provided and the intended end result they would be able to have this event. Whether it is effective waits to be seen.", "q1r": 4, "q2": "The information provided regarding auditability is disjointed. There is a lot they seek to achieve but it is not backed by proper roadmap/timeline planning and budget. For example ; the seek to educate 1000 students, but how will they approach these students? Where are these students? Another question that we validly ask is, there is a mentioning of training 200 participants, but how will they be trained? How will the Community Advisor (which is now Proposal Assessor) education materials be communicated? Where will this training take place? When will it take place?\n\nThere are many discrepancies that permeate also into the budget. It is very generalistic and also does not mirror the proposer intended program. Again taking example of this training, there is no mention of budget allocation for this training. In general there is limited budget allocation for the educational materials. When the proposal has the headline word \"education\" one would expect a focus on education.", "q2r": 3, "assessor": "z_assessor_2088", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 12930, "q0": "Organize online and in-person community events to educate youth high school and college students about the cardano ecosystem and its benefits. The problem of the proposal is suitable for the Challenge to build community among students and students. The proposal is likely to expand in the future with extensive development on schools that attract many students. Proposal to help students and students understand Blockchain and Cardano, attract people to join and expand Cardano community, train more developers. Organize training sessions and organize meetups and conferences using both online and face-to-face meetings. Spread awareness, education and knowledge about blockchain education, especially cardano, taking advantage of the potential that the ecosystem. The project's impact is reaching thousands of students in high schools and universities. There are content outlines about Blockchain, and Cardano. Proposals have reasonable and appropriate arguments. The time it takes for some organizations to approve letters for the event can also be a factor in delays. The author's solution was to send letters early and work with organizations to get event documents approved earlier before the event. Rating: 5", "q0r": 5, "q1": "\nOrganize a meeting course for 3 months. The timeline is quite reasonable. Reaching and educating at least 1000 university and secondary school students in targeted northern Ghana is in line with the plan. Train at least 200 of our participants to become community advisors. Host up to 10 or more live community events. Wada's supervision; a reputable organization in the ecosystem. Detailed implementation plan, no specific implementation timeline needs to be added, the number of events needs to have a specific plan. The proposed asking amount of $26000 approximately 6% of the total Challenge Budget is reasonable. The budget has a specific, transparent spending plan for: Create and print cardano educational materials, Internet packages for online masterclass, Rent Conference Space and utilities, Print T-shirts with cardano brand, Ada rewards for participants through quizzes. The budget table shows how much money is being spent. The proposal team consists of 2 members. There is detailed assignment of specific tasks for each member. The experience of the members is relevant to the job. Identify members on Twitter. No certifications or intellectual property. Rating: 4", "q1r": 4, "q2": "Project-based metrics: Number of students who attended the conference. Percentage of excellent proposals submitted by these students to address local issues in the community. Percentage of students who became referrer. Number of students who have successfully created cardano wallets etc. Indicators give easy check of project progress. KPIs that determine project success: Number of students in boarding and participation through the project's catalyst (active community mentor, proponent). Number of local developers who will start learning how to program in Haskell. Number of dapps by local developers. The success of the proposal is related to the goal of the Challenge. This is a brand new proposal. The proposal's KPIs determine the success of the project. If funded, it will return to funds because of the need to reach more university students to continue to access education, expand larger-scale projects. I rate: 4", "q2r": 4, "assessor": "z_assessor_3514", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12912, "q0": "The project aims to teach young people about blockchain technology, the cardano ecosystem, and its advantages. The proposal outlines a strategy for setting up interactive sessions with students both in-person and online to teach them about the cardano blockchain and how it may significantly better the lives of young adults in the nation and the continent at large. The project has a long-term intention to extend its reach beyond Ghana to include the entire continent", "q0r": 4, "q1": "The proposer has ample relevant knowledge and experience working as a tutor to properly execute the project with a relatively low likelihood of success since the project only proposes just one person would be responsible for the executing of the project. The proposal includes a scanty timeline and plan for the estimated completion of the project which is about 1-3 months. The proposal also puts forward a budget of about $26,000 for the execution of the project.", "q1r": 5, "q2": "Regular progress reports and the team's established roadmaps provide the community with opportunities to review the project. The proposal also outlines essential indicators to gauge the project's success, such as the number of students enrolled, the percentage of those who become active members, and outstanding suggestions made by these students to use the Cardano ecosystem to solve local problems. There is no stated deadline for completing the project's various phases. The delay in university and high school officials' approval to support the training of their students is the risk which is taken into account. ", "q2r": 4, "assessor": "z_assessor_3507", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12437, "q0": "The proposer and team has done a marvellous job by placing the proposal in the right challenge. The proposal therefore effectively addresses the challenge and has a potential of bringing value to the cardano ecosuystem. The proposer clearly provided a precise solution to the stated problem by organising series of community events both face-to-face and online bringing onboard the cardano ecosystem several participants. The proposal also captured very important key metrics under the campaign brief by mentioning some of the key values participants will bring to the cardano ecosystem such as number of people onboarded as proposal assessors, proposers, voters, referrers among others. This i think is game changing and will help spread education and awareness to a wider audience within Ghana should this proposal be funded.", "q0r": 5, "q1": "the proposer has provided relevant links to members of the team who will help in project execution. In addition, the proposer and team from the links provided have the desired skill and experience to be able to execute the project should they be funded and i think this is commendable. Furthermore, the proposer has done a great job by providing a detailed budget broken down into identifiable bits on how funds are going to be used to execute the project should they be funded. The proposer also outline the milestones, course structure and provided a timeline showing the duration with which the project will be executed.", "q1r": 5, "q2": "The proposer and team has provided clear outline on how to measure the progess of their project should they be funded. They have provided information on how success will look like should they be funded thus elaborating on some key milestones to look out for such as number PA's, proposers, referrers that are trained among others. The proposer has also indicated how their progress will be monitored and reported to the cardano community making reference to wada which i think is  reputable organization in the cardano ecosystem and will be able to guide the proposer and team execute the project successfully.", "q2r": 4, "assessor": "z_assessor_3415", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 12347, "q0": "The proposal addresses the challenge of blockchain adoption in Northern Ghana. This is line with Cardano's objectives and therefore adds value to the cardano eco-system. This will serve as an avenue to educate the youth in high schools and tertiary institutions on the future of blockchain and cryptocurrencies. This will be achieved through the organization of meetups and conferences. Despite the proposal's risk of sending letters early and work with institutions to get the documents for the events approved earlier before the event. The proposal can come out with a clear plan on how to get all on these institutions on board for the project. The proposal shows key metrics and goals that are aligned with the challenge setting. These key metrics provides number of students who have attended conferences, percentage of students that become active community advisers, and number of students that successfully creates active cardo wallets and participate to vote for proposals. I believe this proposal effectively addresses the challenge.", "q0r": 5, "q1": "I believe the proposal shows a clear budget and broken down into identifiable items for its implementation. The budget shows detailed cost items and hence resasonable to achieve them. The proposal, provides evidence of relevant skills and experience needed to implement the proposal. The team shows expertise in the area of blockchain and Information Communication Technology. This will facilitate the education and adoption of blockchain which is in line with project catalyst challenge settings. The proposal further, offers a realistic timetable to complete the work. The proposal plan is to reachout and educate atleast 1000 tertiary and high school students in northern Ghana through conferences/meetups that will be orgainized. Also, the plan  seeks to train 200 participants to become active community advisors (Proposal assessors) to be able to constructively review proposals on ideascale. I think if the proposal receives the necessary funding it is likey that the proposal will be implemented successfully.", "q1r": 5, "q2": "There is clarity of information which provides a roadmap with milestones and a clear time horizon for achievement. The proposal shows a 1-3 months period for it's implemented. In addition, it provides a clear understanable solution that addresses the adoption of blockchain in Northen Ghana. The proposal, intends to hold up to 10 or more face to face community events when funded. This will draw in more community participation when done.Furthermore, participants will become much more knowledgeable and aware about the opportunities cardano eco-system is offering to them and how they can bring on board their brilliant ideas for funding through project catalyst. The proposal when funded can achieve the stated solutions of the problem. The proposal provides sufficient information to assess the progress in attaining its stated goals ", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12078, "q0": "The \"Blockchain Education Masterclass\" proposal identified one issue in the challenge, and that issue was widespread. It presented a problem in the development of the Cardano community, the proposed problem that is most suitable for the challenge is suitable for developing the capacity of the young generation. The proposed idea is to organize online and in-person community events to educate young high school and college students about the cardano ecosystem and its benefits... Propose a problem statement one clearly and convincingly. . Problem Solving the Challenge Question How do we prepare Africa for a future of mass Cardano adoption? Then it has the potential to scale in the future. The proposal identified a risk in the implementation process and provided solutions to overcome all of those risks. You pointed out the risk that the time it takes for some organizations to approve mail for this event could also be a factor in delays. The proposed solution must be mailed early and work with the organizations to get event documents approved earlier before the event takes place. However, it is proposed to consider the risk of ADA's slippage that also has a direct impact on the success of the project, so an additional contingency plan is also needed. I rate 5 points", "q0r": 5, "q1": "A proposal that identifies the right goals, sets out the approaches, and determines the best way to achieve the goals will help you define in detail, in detail what to do, how to do it when, and by whom.. Proposal specifying implementation in 1-3 months. Reasonable timeline to reach and educate at least 1000 college and high school students in northern Ghana. Participants are much more knowledgeable and aware of the opportunities the cardano ecosystem is offering. Train at least 200 participants of the proposal to become community advisors and organize up to 10 or more in-person community events. These are specific and very workable numbers. The transparent inspection and monitoring specific to Wada - https://wada.org .: Wada will monitor the progress of the project and provide support for the project to continue operating ... etc . $26000 is about 6% of the total Challenge Budget. The budget has a specific, transparent spending plan for the following tasks: Create and print cardano educational materials, Internet packages for online masterclass, Rent Conference Space and utilities, Print available T-shirts cardano brand, Ada rewards for participants through quizzes. No additional contingency budget is proposed. The team to implement the proposal consists of 2 members. There is detailed assignment of specific tasks for each member. The member's experience is relevant to the job as one member is a highly skilled IT professional and blockchain educator who over the years has trained over 1000 young students across Ghana in cardano blockchain field and opportunities gained through the support of Wada and other Ecosystems as well as Internet Calculator.. Identify members on Tiwtter. No certifications or intellectual property. I rate 4 points", "q1r": 4, "q2": "Proposals provide KPIs, making it easy to accurately quantify a proposal's effectiveness and easily test it. It is proposed that there are many measurement indicators to understand and assess whether the project is successful or not through the number of students who attended the conference; Percentage of students who become active community counselors; Percentage of excellent proposals submitted by these students to address local issues in the community;Percent of students who became recommenders; Percentage of students who became proponents.;Number of students who successfully created a native cardano wallet and participated in voting on proposals. Local developers learn Haskell with the long-term goal of developing dapps. Easily check project progress. .Achievements There will be a mass of students in boarding and participation through the project's catalyst (active community mentor, proponent). There will be local developers who will start learning how to program in Haskell. Will start to see the creation of dapps by our local developers in the long term. The success of the proposal is related to the goal of the Challenge. Although the proposal does not have a test product, it is completely new. If funded, will return to the following funds. Because of the need to reach more university students to continue to access education..Moreover the project's goal is to align with the United Nations Sustainable Development Goals SDG Goal 4 Quality education Ensure quality, equitable, inclusive education that promotes lifelong learning opportunities for all. If sponsored the proposal is in the top 10 of voting challenge. I rate: 4 points.", "q2r": 4, "assessor": "z_assessor_3353", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12056, "q0": "\nThis is a wonderful idea.\nCardano can better expand in Africa with this project. I think this is one way we can get the youth to develop interest in Cardano ecosystem. This will help the youth to get more experience and get involved in the Cardano ecosystem as well \nThis is one project that will offer young men and young ladies link opportunity in the Cardona ecosystems to the acquire knowledgelearnt, And once knowledge is acquired theiris that room fordevelopment and take off ofthe cardona environment by this young menand women.\nThe idea is very prefect for what the challenge ask for . I found it very interesting that this project is also aimed at the growth of the youth , I don't remember having seen other proposals that catered to this portion of the population , education almost 1,000 students that is massively relevant for the blockchain education . When this project happens successfully , it would be a good gateway for new members to the Cardano ecosystem, maybe even students are educated on blockchain parents will be interested in learning a little about our blockchain, it would also certainly increase the number of tokens being minted and ada being traded , so I believe the project would benefit the Cardano ecosystem in different ways, aligning perfectly with this challenge", "q0r": 5, "q1": "I agree that this project seems very important. Blockchain can help benefits The youth . sending  letters early and working  with institutions to get document for the event approved earlier before the event is also a smart step . \nReaching out to educate at least 1000 tertiary and high school students in northern Ghana through conferences / meetups that will be organized is a good idea . Timing is correct. Numbers are good and I think the can do it . This  team is certainly qualified to carry out this project very good,we know who they are, their names, the briefed us of their backgrounds and history of their previous experiences already and also their LinkedIn profiles.I think we can get to know each of them in detailed . It would be good if the authors  show great interest in taking care of the usability part of the platform.To look into the benefits of the project, by making us comfortable of any fraud activities. how would this publicity? Because he made mention of only tertiary and high schools. This is a very  big project, so it needs a lot of publicity to reach the public.All though the organization of the entire project is good . the author made it clear on how everything is going to work on a given of time . Which is good because making sure everything goes to plan within every step is very necessary. This is a good project and it shows how everything is planned. ", "q1r": 4, "q2": "I think this is a project that could be improved by having  meetups meetings to assist with the delivery and ensure the project is in line . At this stage reporting back is very little detailed in the proposal pertaining on the project,however there is a great interest in Cardano and this would present opportunites for exchanging ideas and inspiring more interesting projects such as this throughout our Environment. \nThe KPI's and milestones are clear and measurable. He also explained how everything is going to carry on and every single detail about what’s going to happen. I think with the help of cardano accessing up their work with a small team so we can get feedback or updates from them time to time will be a very good ideals. ", "q2r": 4, "assessor": "z_assessor_3344", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11676, "q0": "The proposer and the team have really done a great work because the proposal fits very well in the challenge. The proposer and team have been able to elaborate on the impact this proposal would bring to the African continent as long as the block chain ecosystem is concern and has also stated clearly how the intend to achieve their objectives by creating much awareness of the cardano ecosystem through face-to-face meetings and also online meetings and I believe if this proposal is funded, it would go a long way to bring much alot on the cardano ecosystem because awareness brings adoption to everything. The proposer and team have also done a great work by outlining clearly the key metrics which fits well in the challenge and I believe if this project is funded it would perform exploits to the cardano ecosystem. Furthermore, the proposer and team have been able to scale up challenges the proposal might encounter and has also done very well by outlining how the intend to resolve this challenges which is just so amazing.  So I believe if this proposal receive the required funding, it would produce massive results to the cardano ecosystem.", "q0r": 5, "q1": "I must again say that the proposer and team have done so well.  They have been able to offer a realistic time period to complete the work of which I believe if funded would be achievable. The proposer and team have also been able to provide a budget for this proposal and a clear budget breakdown which is applaudable and reasonable to achieve the goals of the proposal. Furthermore the proposer have also been able to provide every detail about team members needed to execute this work and has even provided platforms for verification such as the wada platform where all team members can be found. I think if this proposal is given the required funding, it would be well executed which would be a plus to the cardano ecosystem. ", "q1r": 5, "q2": "The proposer has outlined a  road map and a clear time horizon for the achievement of set objectives (1-3 months). Furthermore, well thought out by metric were provided by the proposer for the success of the project.  The proposer did this by outlining how by the leadership and supervision of wada, an organisation under the cardano ecosystem goals would be achieved. So I believe if the project receives the necessary funding , it would achieve it goals. Furthermore the proposer has also done a great job by outlining how success would like if the project receives funding.  How that would be mass on boarding and participation of students through project catalyst and also  how local developers would start learning how to program in Haskell.  The success is just so beautiful and I think this project should receive the required funding. ", "q2r": 5, "assessor": "z_assessor_3265", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 11650, "q0": "The team has done a great job by glancing the proposal in the right challenge.the proposal therefore effectively address the challenge and has a potential of bringing value to the Cardano ecosystem. The proposal clearly provide a precise solution to the started problem by organizing series of community event both online and face to face bring onboard the Cardano ecosystem several participation. The proposal also capture very important key metrics under the campaign by mentioning some of the key metrics of number of proposal offering solution to understructure and education concerns to the Cardano ecosystem in Africa and to country as a whole. Therefore I strongly believe they will do a great job if funding.", "q0r": 5, "q1": "The proposal has provide relevance links to members to the team who will help or work in the project execution. Furthermore, the proposal team and the links has a desire skill and experience to be able to execute the project should they be funded and I think this is commerciabl. To add to this, the proposal has done great well by breaking down into Identifiable on how funding are going to be used to execute the project should they be funded. The proposal also outline the milestone course structure and provided a timeline showing the duration with which the project will be executed and I strongly believe they will do a great job should they be funded.", "q1r": 5, "q2": "The team also provide a clear outline on how to measure the progress of their project should they be funding, they have provide interaction on how success will look like should they be funding, thus indicating on some key milestone to look out for, such as number of P A trained, Number of voters and referral that are from and among other. So the proposal has indicated how their progress will be monitored and reported to the Cardano community making reference to WADA which I think is a replicable in the Cardano ecosystem and will be able to able to guide the proposal and team execution the project successful.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11631, "q0": "The proposer and his team members have done a great job, the proposal is rightly placed on the correct challenge category, it addresses the challenges in that category, and has also clearly shown potential solutions in addressing challenges in the Cardona ecosystems by training the youth online, face-to-face and meetups that are directed to creating awareness and impact positively on cardano in Africa. The proposal also highlights on the key metrics on the campaign brief which is bringing in more excellent proposals, active community Advivers, referers, more cardano wallets creation, proposal assessors among others. I believe when this is funded will open up the awareness and increases the participation of Ghana in the Cardona ecosystems. \n", "q0r": 5, "q1": "The proposer and his team have provided links that are shows clearly their ability in carrying out the proposal with the needed skills and experiences. It budget for the proposal is also broken down and itemized into identifyable area where the funds will be utilized, the budget is  relatively reasonable to achieve the needed goals set. Also the proposer has outlined a period of 1 to 3month within which they intend to use for the project,reach out to at least 1000 to be trained and at least 200 becoming active community Advisors . It has also a team that has been put in place and a plan of holding 10 face to face community events should the proposal be funded to work on it. The proposer has considered the risk with regard to the implementation and has provided a realistic solution to the risk. ", "q1r": 5, "q2": "The proposer and his team has outlined how the progress and success of the proposal can be measured in the Cardona ecosystems through one of Cardona own WADA group that will assist and support in the proposal progress, successes and implementation. The proposer has has identified the target problem and has come up with massive education and awareness creation to solve this. This WADA organization can be trusted to deliver the needed technical support through leadership and supervision. The proposer has shown how success can be measured through some key metrics such, mass on-boarding of students and participation in theproject catalyst as active community advisors, proposers, some emerging as local developers who will start learning how to program in Haskell and the creation of dapps by our local developers in the long term in Africa when this proposal get the needed funds. There are all indications that this proposal stand to bring value in the Cardona ecosystems in Africa.", "q2r": 5, "assessor": "z_assessor_3262", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11605, "q0": "Having gone through the proposal I think the proposer and his team deserve a big applause for they have done a yeoman's job by identifying the challenges of how to address the African issue of lagging behind in cardano. The proposer and his team have been able to lay out ways of getting the youth and the tertiary students onboarded on cardano by organising face to face and online meetings in order to train the youth and tertiary students on the prospects of cardano. In addition the proposer and his team also brought on key metrics to show they really understand what they are about and some of such key metrics are the number of people onboarded, proposers, voters and many others. And therefore I say that this proposal if funded will yield needed results for Africa and the cardano community.", "q0r": 5, "q1": "Given the experience of the proposer and his team it is feasible that this program would be a success, the proposer is endowed with much experience as well as his team members he also took his time to provide links for his team members who will help in the execution of this project if funded. The proposer and his team also took their time to present a budget of which they broke it down into bits for easy understanding as to how they Intend  carrying out this project. The proposer with his experience as a member of other blockchain business example wada as indicated gives him more understanding on cadano ecosystem. I therefore agree that this project if funded will enable him and his team carry out this challenges successfully.", "q1r": 5, "q2": "This proposal will easily be auditable  since the proposer is a member of wada which is also a member of the cardano ecosystem with a reputable background in blockchain business. Wada Being a reputable organisation will monitor the implementation of this project and see to it that every resource provided over here or funded to this projects is used judiciously.\nIn addition the vast majority of high school students and tertiary students who will be on boarded as proposers, voters, proposal assessors will also be a way of auditability since the people trained will be easily available and identify and would also contribute their quota to the expansion of the cardano ecosystem in Africa.", "q2r": 5, "assessor": "z_assessor_3260", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11191, "q0": "I agree that that needs to be more education on blockchain technology.  This is especially true in Africa.  There are so many benefits to these people that they don't even realize.  I would also like to see these videos available to more than just the students of the class.  I think this proposal helps to solve the issue on a small scale, but it is needed and therefore worthy of funding.  As on-line learning can be a bit dry, I'm glad to see there are face-to-face meetups as well.  Meetups will create more excitement and help foster relationships and learning.  Maybe these meetups can also focus on setting up Cardano wallets for all students.", "q0r": 5, "q1": "The lead describes himself as a blockchain educator and an IT professional.  It would be helpful to me if we knew what his educational background is.  Does he have any degrees in these fields?  The time frame of 1 month seems low, it seems that a timeframe of 3 months or more is more likely.  It will take a lot of time to show 200 students how they can become CA's.  Budget wise, it might be a little steep for the proposal.  On line education cost doesn't seem that it would be a large cost.  The meetups are where there would be some costs accrued.", "q1r": 4, "q2": "They are relying on Wada to oversee the project and provide support.  There are key metrics that can be measured to determine the success of the project.  Some of these include the number of students attending, the amount that become active CA's, the amount that become proposers etc.", "q2r": 4, "assessor": "z_assessor_3230", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 10034, "q0": "The author raises the issue of organizing online and in-person community events to educate young high school and college students about the cardano ecosystem and cardano's benefits. The issue reflects the situation in Africa, especially Ghana, and universities and secondary schools in North Ghana need to have access to Cardano. . The solution creates events to allow people to share experiences, learn about Blockchain and Cardano, and find the right talent. The main objective of the proposal is in line with the challenging settings at F9 and solves the stated problem. Community events for students, high school students in Ghana have impact on the process of learning blockchain knowledge, students have potential in the development of Cardano, they can be developers providing projects for the ecosystem. Participating in events is also an opportunity for students to add new concepts to blockchain. More specifically, both the author, who has been a lecturer and blockchain advocate for many years, has organized a series of online classes to introduce education on blockchain. This has a big impact on students, students who build trust and see job opportunities for the future with Blockchain and Cardano. Students, who are future developers, are ambitious and will make a great contribution to Cardano. The risk the author poses about sending event-organizing letters and having a more proactive solution than sending the letter so that the event takes place on time. We have an opinion on the proposal: Implementing a proposal that may be affected by the covid-19 outbreak, participants may not be able to meet in person, the author needs a solution to increase the number of online encounters if this happens. Another financial risk is that an increase and decrease in ADA can affect the implementation plan, to minimize this risk the author can recommend an additional 5% (about $1300) of contingency funding.\nI rated: 4\n", "q0r": 4, "q1": "The implementation plan details, with specific objectives: Reaching and educating at least 1000 university and secondary students in northern Ghana in 3 months, Training at least 200 participants to become active community advisors. The implementation plan is in line with the proposed solution and is feasible. We saw the contents of the event: The evolution of money, cryptocurrencies, Cardano Blockchain (History, founder, etc.) , What makes Cardano unique, Cardano the use case, etc. Cardano's Africa strategy and opportunities for young people through the Project's catalyst, etc. Almost all of this content has provided students with an amount of knowledge to start with Cardano. However, the specific timelines for organizing events have not been given by the author, we would like the author to have specific plans to hold many live events during the month, online events are conducted weekly? Implementing the proposal is Jeremiah Baani, who is a teacher and has studied Blockchain and Cardano for many years, co-working by Mohammed Mustapha Yakubu. Members do have the full information on their Twitter feed. More than that, Wada's wedsite we see Jeremiah Baani being supported by an experienced community that helps the plan be implemented. The offered amount of $26,000 is less than 10% of the funding for the installed challenge is in line with the proposal. The budget analysis is detailed for each category, which is impressive given that there is $4,500 for cardano-branded advertising T-shirts and $2,000 in ADA rewards for participants in the questions.\nI rated: 4\n", "q1r": 4, "q2": "The implementation roadmap of the proposal does not have specific timelines, the author commits to the implementation of the supervision of Wada (prestigious organization in the cardano ecosystem). We have opinions on reports that need to be made regularly, providing specific information about event organization and event content. The content of the report has a measurement index that the author stated: the number of students attending, students becoming active community advisors, etc. We believe that under Wada's supervision there will be appropriate reports that identify the work being completed on schedule. Indicators/KPIs determine the success of the proposal as appropriate, when the proposal is completed we can see the number of students participating in Cardano, there are developers learning haskell programming, developers contributing Dapps and projects to Cardano.\nI rated: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7837, "q0": "The aim of the Proposer is to send Cardano Ecosystem to the doorstep of the people in the Northern part of Ghana by educating Tertiary and High school students about Cardano Ecosystem and its benefits by organising online, face to face, meetup community events. \nThis,  I believe defines the problem to Challenge. Through this education, targeting Tertiary and High school students to capture the hearts and minds of the youth to utilise their potentials will impact significantly to the fundamental of Cardano blockchain and its uses \nKey metrics set or stated is align with the challenge through record keep under the supervision of Wanda. \nRisk factor that might be associated with the challenge is identified and a solution to prevent future reoccurrence is boldly highlighted. \nInformation provided and assessed,  shows that, the Proposal is impactful and sustainable. ", "q0r": 5, "q1": "Audio attached and number trained by the Proposer indicate the capability and experience acquired to implement the Project successfully. \nAgain, with the aid of Wanda as part of the Team, it clearly shows, the project is highly deliverable. \n\nTraining duration of 1-3mths with course areas to be covered are stated.\nBudget proposed is mentioned and breakdown well detailed \nLooking at the budget n the scope of students to cover, it's reasonably justifiable ", "q1r": 5, "q2": "The Proposer provided a very strong tool measure the progress of the proposal as, through the supervision and leadership of WADA monitor and transits execution and what success can measured here by , massive on boarding and participation of students in project Catalyst, emergency of local developers who start learning how to program haskell etc.\nAbove information provided is sufficient  to audit the proposal.", "q2r": 5, "assessor": "z_assessor_2927", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7641, "q0": "The problem described in this proposal is closely aligned with the challenge.\nThe team has done a great job by putting the proposal at the right challenge. A problem within the challenge which needs to be solved through this proposal borders on educating marginalized parts of Africa that is not developed and need Cardano to upscale to reaching these parts of the world. \nThe key metrics and goals of the proposal align with the outlined challenge settings and the proposal seeks to add value to the Cardano ecosystem through the organization of both online and face to face events that will bring onboard these parts of the continent onto the Cardano ecosystem. \nThe proposal is able to scale to address future challenges through constant education and training and the proposal clearly articulates a plan for the project's future sustainability.\n", "q0r": 5, "q1": "The proposer provides evidence and relevant skills and experience needed to implement the proposal through providing the type and number of team members required to implement the proposal.\nMoreover, the proposal and team from the links provided have the desired skills and experience to be able to execute the project should they be funded. \nThe budget is clearly outlined and broken down into identifiable items and the budget is reasonable to achieve the set goals.\nThe proposal offers a realistic timetable to complete the work and the proposal provides a sensible plan for implementing the project. \nAnd, the proposer has considered the challenges and risks relevant to a successful implementation and how to mitigate them.\n\n", "q1r": 4, "q2": "The proposer has showed a roadmap with milestones and a clear time horizon for achievement. That is, by highlighting the fact that, through the leadership and supervision of Wada which is a reputable organization in the cardano ecosystem the project will be executed successfully with the implementation. This is my worry, because I know WADA has devleoped the Cardano ecosystem and successfully managed projects, even being an associate with WADA the proposer should be able to tell us how it will implement it successfully. Also the proposer has showed us a well-thought out Metrics/KPIs that define the success of the proposal which includes \na mass on-boarding of students and participation through project catalyst, active community advisors, proposers etc, availability of  local developers who will start learning how to program in Haskell, and many others. \nThe accessible public channel for delivering regular updates to the community for auditing progress will be through WADA. ", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7392, "q0": "The idea in this proposal is a brilliant one which aims at creating awareness of the cardano blockchain and also encourage mass adoption of it on the African continent. This evidently matches with the goals of the challenge. Educating tertiary students in northern Ghana on cardano is a great step in drawing students attention to the cardano blockchain and project catalyst. When their attentions are drawn,they get to utilize the opportunities on the Blockchain,this is where new member onboarding comes in,we will have a good number of these students taking part in roles such as proposal assessors, referrers, veteran proposer assessors and consequently having a lot of innovative ideas on catalyst needing funding to solve problems in communities for the betterment of Ghana and Africa as a whole and this will mean mass adoption of cardano in Africa and as such I believe this proposal addresses the challenge.", "q0r": 4, "q1": "Firstly, the team involved here is undeniably qualified to manage this project. The author currently has an ongoing online class which focuses on the cardano blockchain and this to me is yielding positive results and this is an evidence that,he is capable of handling a project of this nature.\nThe proposer also provided a brief description of himself and his team,their experiences,their links and social media handles where we get to know them more intimately. I got to know the author will be collaborating with wada as part of the team and we all know wada to be a reputable organization in our cardano community. They have turned numerous innovative ideas into successful projects and I believe with wada,this project is likely to scale if funded.\nFor the budget,they have a reasonable amount due to the number of people they intend to reach out to and educate. The budget also has a clear breakdown of items and specific amounts allocated to each item.\nThe only weakness I see in this proposal in terms of feasibility is the timeline the team plans to use in implementing this project,even though,the author plans to use 1-3months in achieving the metrics of this project, the author did not put the project into phases. For example,what's happens in month one,what activities would be undertaken in month 1,2 and 3, but that is not seen in the proposal. Apart from this, I believe this proposal is likely to be implemented in a way if funded.", "q1r": 4, "q2": "For auditability,the author did not give us clear milestones in delivering this project,the key metrics are just a few, not enough to be able to audit this project by the community. The delivery dates are not clearly stated too. Nevertheless,we have wada here,as the project supervisor and I believe with the leadership and supervision of wada which we all know have worked on numerous funded proposals, hopefully we get to audit the progress of this project through them if it is likely  funded.", "q2r": 3, "assessor": "z_assessor_2890", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2022, "q0": "The proposal’s objective is to increase awareness and knowledge about blockchain and its opportunities, mainly cardano ecosystem, among Northern Ghanaian students. The proposer aims to achieve this by organizing online and face to face events and meetups.\n\n\nThis proposal success will adds value to ADA and African ecosystem by increasing the adoption and knowledge of ADA in Ghana and, moreover, it might increase the opportunities that African students have to grown on life quality affecting their community as a whole, aligning with this challenge.\n\n\nThe metrics and goals stated by the proposer also have lots in common with this challenge, aiming the participation of the students into the catalyst community.\n\nThe proposal is able to scale, since there is a growing number of contents, projects and needs, which can be a part of the proposed content to lecture. However, the plan to continue with this project depends on future funds, which is not a good plan. The proposal does not include a way to monetize this project in order to continue. To tackle this, there is a budget allocation to creating t-shirts. Maybe selling these shirts and creating more stuffs to sell might be a solution.\n", "q0r": 4, "q1": "There are some important point to address here:\n1 – Roadmap: unfortunately there is a lack of information in this part. The proposal’s states that the intention is to complete the project in 1 to 3 months, not giving a precise indication. Another point to observe is that there is no time division of doings, meaning that there is no clear indication of which tasks should be done, how long it will take to accomplish them and not when it’ll be done. \n\n2 – Budget: It is not very clear and needs to add more derailment. i) creating and printing customized materials: which materials, how many, the average costs, how many students it’ll attend etc. ii) transportation, feeding and accommodation: who are the resource persons? How many places are you intending to go? How long it’ll be the accommodations available? How many classes it’ll attend? \nAnyways, I’ve put some examples here, however the rest of budget allocation are the same, therefore it would be good to add more details on that point.\n\n3 – Team: Since there is a WADA participation, which has experienced people, this part is addressed.\n\n4 – Self funding/Scalability: The proposal doesn’t give a solution to scale and continue this project in the future, besides the next fund. However, since the education is a continuing necessity, it is important monetize this project in order to keep it going. Therefore, a possible solution is charging for the shirts and other stuffs that it’ll be created (since there is a budget allocation for this) and use this money to the project. Another solution is create an identity and seek for partnership and sponsors.\n\nBy the points addressed above shows that there are some lacks in this proposal that must be addressed in order to be successful implemented.\n", "q1r": 3, "q2": "The KPIs and metrics are good to measure the progress and success.\n\nThere are some points that we should pay attention to:\n1 – roadmap: Since there is not a real roadmap to follow, the auditability is quite prejudiced.\n2 – Channel: There was not provided a channel to follow the progress and accompanied the classes and meetings. Therefore, it would be good to include a channel to follow every step.\n3 – material: since the proposal states that it’ll create materials to help the meeting and disclosure to students, it might be interesting to have the catalyst community to co-create. It’ll be enhance the chances to be well adopted.\n\n\nThat being said, there are some points to add in this proposal in order to make it more auditable. The way it was proposed, we, voters and community members, are passively waiting the full release or just believing that the meetings and everything is happening.\n\n", "q2r": 2, "assessor": "z_assessor_2298", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13573, "q0": "The proposal effectively addresses the challenge by organising both online and face-to-face community event to educate young tertiary and high school students on cardano ecosystem and its benefits. The proposal clearly articulate how it will add value to the cardano ecosystem by educating students on cardano ecosystem to be proposers, proposal assessors, referrers etc . The proposal also identifies the problem within the challenge which is the time it might take for some institutions to approve letters for the events might delay the estimated time of the proposer for the events .", "q0r": 5, "q1": "The proposal is highly likely to be implemented successfully because the plan and the events is possible due to being simple yet a very good and cost effective plan put forward for the challenge .The proposer has broken down the lump sum into bits which is very reasonable. The proposer has planned to reach out and educate at least 1000 tertiary and high school students in northern Ghana through conferences / meetups that will be organized which will contribute greatly into the adoption of Africa by cardano. All links and references provided shows that the proposer and his team has the required experience to undertake this project. The proposal has clearly stated the risk involved  which can lead to a possible delay and how to curb the situation by sending letters to institutions earlier. The proposal is very good and if successfully implemented will go a long way to improve the overall speed of adopting Africa by cardano ecosystem. ", "q1r": 5, "q2": " The proposer stated that due to the  massive education and awareness , there will be mass on-boarding of students and participation through project catalyst (active community advisors, proposers and through leadership and supervision of Wada; a reputable organization in the cardano ecosystem this project will be executed  successfully. Wada will track the progress and the results of the project therefore the information provided is sufficient to audit the progress and the success of the proposal. ", "q2r": 4, "assessor": "z_assessor_3696", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13834, "q0": "Educating Northern Ghanian highschool and tertiary students in blockchain technology and Cardano Catalyst project effectively address the challenge of enhancing African social and economic opportunities and Cardano Catalyst Community. Having online masterclasses and face to face meetups will awake Cardano Catalyst awareness of their potential and opportunities in young Northern Ghanian students. Empowering them with education and technology tools will definitely enhance their communities and engage newcomers into our Community. This project will help transform Africa into a Cardano adoption leader. Focusing on high schools and tertiary ensure a future Cardano aware working force and a more empowered youth. This will certainly help Northern Ghana social and economic develop and enhancement.  ", "q0r": 5, "q1": "Having Wada mentoring and overseeing this first team proposal is a guarantee that they will be successfully implementing their key milestones. Although there is no marketing and outreaching detailed strategy in this proposal presentation, this team experience in blockchain teaching in Ghana is a guarantee of deep field knowledgment. Alliances with educational centers and schools seems to be the key element for the correct functioning of this proposal and even if it is not shared in this presentation this team seems to know what to do. This is a weak point this team might fix in further steps of their proposal development. Educational content and budget breakdown is consistent. ", "q1r": 4, "q2": "Having WADA to mentor the auditability process is a guarantee that this team will further develop a more detailed auditability strategy. Even so, this might be a weak point in their proposal and would need further corrections in order to be lined with Catalysts timelines and rules. A Communication channel might be developed between this team and the whole Catalyst community in order to share their numbers as they very well describe. Numbers of attendees, local developers and dapps will emerge in the long-term and will be enough to audit the success of the proposal. Some information to audit the process of the proposal might be needed to fund this excellent proposal of this very committed and professional team. \n", "q2r": 3, "assessor": "z_assessor_3833", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Organize both online and face-to-face community events to educate young tertiary and high school students about cardano ecosystem and its benefits.", "experience": "As a skilled IT professional and blockchain educator over the past years I have educated over 1000 young students across Ghana in the area of cardano blockchain and the opportunities available through the support of Wada and other Ecosystems as well such as Internet Computer."}