{"id": 420496, "author": "cerpofficial", "title": "Cardano ERP - Grow Africa", "url": "https://cardano.ideascale.com/a/dtd/420496-48088", "category": 26600, "amount": 23700, "description": "Cardano needs more developers from Africa participating in Emurgo Academy training and developing enterprise-grade products on the Cardano blockchain.", "f6_no_assessments": 7, "f6_rating": 2.7142857142857144, "videos": [], "media": [], "f6_assessments": [{"id": 2429, "q0": "We realize that the objective of the challenge in question is to promote the development of the African continent through the use of Cardano technologies. Thus, we were able to find a certain alignment of the project with this challenge. But it seems that the proposal would be better suited to the challenge if funding was being requested for the construction of a more lasting project that went beyond the momentary transmission of specific knowledge. In fact, the knowledge that developers will acquire will allow the construction of other projects aimed at Africa, but if the budget were destined to build a business more locally related to Africa, it seems that the impact would be greater, as Cardano would gain greater visibility.", "q0r": 2, "q1": "We see a reasonably simple organization in relation to the execution of the project, which is consistent with what was planned, since basically the proposal consists of the realization of the course by the developers. But in relation to the budget being requested, once again it is worth mentioning that this amount would perhaps be better used to build a company or business in which we could see longevity more easily. But in fact, the professionals involved in the project have experience in the area of the proposal and it is also possible to see fruits to the African continent with the realization of this course by the developers. So, we can say that the project has a certain feasibility of execution.", "q1r": 3, "q2": "We realized that more details could have been provided in relation to the perception of success, as well as the ways chosen for the evolution of the project to be monitored. Regarding the perception of success, it seems interesting that more characteristics were described about a scenario in which the developers gained knowledge through the course. In this context, it could have been mentioned, for example, their greater productivity when participating in projects related to Cardano. As for a possible metric to monitor the project's evolution, a satisfaction survey could be carried out with the developers throughout the course, in order to collect feedback and understand if the content has been properly assimilated.", "q2r": 2, "assessor": "z_assessor_2306", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 9052, "q0": "There is a phrase I have heard, that more good is done by spending more time with fewer people. This proposal would largely impact three experienced African developers.  It would pay to train them on Cardano. This training would be instrumental in getting them plugged into our ecosystem. It would help them to develop projects, and perhaps submit proposals for the next fund themselves. This is the sort of micro-good that can have ripple effects that improve the macro scale dramatically. This is why I am giving this a score of 5. ", "q0r": 5, "q1": "This proposal has identified three qualified developers who are willing to give up their current income to receive training in exchange for funds from this proposal. The training is from Emurgo Academy which already exists and has a track record of developing people to work on Cardano. The three devs to receive funding have CV’s posted and currently have the skills to complete the training successfully. This is an ideal proposal for this challenge. The time frame is short, the budget is appropriate, and the impact is large.", "q1r": 5, "q2": "Ideally, the KPI’s being measured by the team would be reported in their monthly reports. The audit is simple, did three developers complete the Emurgo Academy. This is verifiable and easily definable. There should be no issues auditing this. The proposal is clear and effective at growing Africa to grow Cardano.", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 9246, "q0": "The presentation of the problem consists of a brief and clear statement about the shortage of developers in Africa.\n\nBased on this premise, the proposed solution meets, in a way, the problem in question. It is important to highlight that part of the delivery the author considers the implementation of an ERP project for Cardano. However, this complement to the proposal loses a little of its initial objective.\n\nThe proposal ends up not focusing on the scale development of new developers nor on the development of the system itself. Given the reduced number of trained developers, future scale gains are limited, in addition to the uncertainty in their commitment to executing the project after training. It would be interesting to see how, in fact, the training effort can reverberate in high value for the community.", "q0r": 3, "q1": "In principle, the author will not be responsible for conducting the training of developers, the focus of the proposal, so his experience does not directly contribute to the success of the project. Analyzing the author's other proposals for fund 9, it is possible to see that he has extensive experience with ERP systems, which is part of the continuation of this proposal in question.\n\nSomething that was curated by him was the selection of developers and their CVs presented on the attached website. An interesting piece of information would be to tell more about the selection of these people to participate in the training.\n\nDealing with a specific proposal to enroll 3 developers in a course, the timeline and budget are very straightforward and were presented clearly.\n\nAn important point that could be better explored is the potential risks. According to the author, no risks are expected. In this case, I would recommend considering at least risks related to the success of the training process, meeting deadlines, meeting quality requirements and discontinuing developers in the project. The author even mentions that he does not consider this last risk, but in fact it can only be 100% mitigated if there is a contract protecting the interests, which was not mentioned.", "q1r": 3, "q2": "The proposal did not consider ways to favor the audit of the project's progress, nor of the monitoring by the community. This would be an important improvement for the author to consider.\n\nThe indicator defined is about the training of the 3 developers, which is fair considering the proposed solution, but very simple considering the dimension of the problem. It would be interesting to see the author indicating metrics that point to the unfolding of the project, generating value for the community.\n\nFinally, the proposal does not have a consistent solution to the problem it is challenging. In order for this proposal to have real meaning and relevance, it must be analyzed together with the other proposals of the author in fund 9. These proposals alone are partial resolutions.", "q2r": 2, "assessor": "z_assessor_3035", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9829, "q0": "The general idea of this proposal looks interesting, the proposer talks about identifying African developers and enrolling them in an Emurgo training academy, to enhance their capacity, to later help the catalyst community. My problem is, that the proposer fails to elaborate how the problem statement helps solve any of the aims of this challenge. The proposal is limited in information on how the team plans to execute this project, The proposal also fails to provide any verifiable experience of the team members, it also fails elaborate on how impactful the project will be to the community after its completion. The proposer also fails to cite any setbacks they could encounter if funded, citing, that they don't see any potential setback after funding seems unrealistic. Overall I don't think this proposal conveys enough confidence of success should it be funded", "q0r": 3, "q1": "There is no definitive plan stated here, the proposer fails to provide clear timeframes to help track the progress of work. The proposer claims to have already identified the developers, what is left is just the funds to start enrollment. But fails to give us precise timelines for when this enrollment will be done, when they will be completed, and how we track progress after completion of the training. All this information is missing from the roadmap. \nThe budget lacks detailed breakdowns, the proposer just provides us with two lump sums with no detailed breakdown as to how these monies would be used. The overall plan seems confusing to implement, or maybe because the whole proposal lacks a detailed explanation, I find it less feasible.", "q1r": 2, "q2": "Just as I have previously stated above, this section also lacks information. No relevant KPIs are stated, and the proposer fails to show us how we will be able to track progress and measure the success of this project. There is no given timeline as to when this project will start and finish, and no roadmap as to how reporting will be done to the community. The proposer needs to refine this proposal, maybe provide us with a detailed roadmap, state specific timelines, provide relevant KPIs and milestones, add the verifiable experience of team members, and provide a detailed breakdown of the budget.\n", "q2r": 1, "assessor": "z_assessor_3106", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11193, "q0": "I do not agree.  They are only looking at working with 3 developers.  This proposal is missing some key information.  I cant rate it any higher until the missing information is included.  It also seems that if the developers were really interested in Cardano, that they could put in a few hours of learning each week to meet their goals while still working their normal job.  10 hours a week would have the training completed in 20 weeks.", "q0r": 2, "q1": "The links given are insufficient for me to score any higher on this proposal.  They need to list the developers names.  The second link is a bad link.  The first link shows some credentials of the developers, but no names.  We need to know everything up front to grant a proposal, not the other way around.", "q1r": 2, "q2": "The only metric being used to audit is successful completion of the training.  I'm wondering if successful completion means that they will have scored high enough to be able to work as well.  there are too many missing variables again in this section.  I need more ways to audit.  There needs to be more metrics.  Names of developers, weekly progress updates, quiz scores, test scores, satisfaction with the class, and if they actually go on to do work on Cardano.", "q2r": 2, "assessor": "z_assessor_3230", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13727, "q0": "The proposal is aligned with two of the presented KPI's in the challenge: \n- Number of African developers onboarded in 2022;\n- Local impact (measurable through user activity and reach).\nIn addition, the possibility for the project to scale is high and this scalability would also be aligned with others KPI's, such as:\n- Number of new Africa-based users onboarded onto Cardano (wallets, platform sign-ups).\nMoreover, as it was presented in the team's website, the training of these professionals would be used in the development of a Cardano ERP, which would bring a great value to the blockchain and the Cardano Ecosystem.  The training would be provided by Emurgo, a well know and expert institution in blockchain and Cardano technologies. \nHowever, I found a bit confusing when the proposer puts the budget as an answer to one of the \"Impact\" questions. In this space should be a clear and object solution to the existing problem suggested by the challenge.  \n", "q0r": 3, "q1": "Considering the team's experience and the work they have been doing along the years, I see this is project has a high chance of success. And, observing the areas of work, I see the content of training could be very well absorbed by the players. \nThe timeline provided is consistent with the proposal, but I missed the dates/expected delivery (e.g. week 1; week 2, etc) of each activity. \nThe budget is coherent, once the developers need to be enrolled in the course and, considering they need a 100% focus, a stipend will de provided. The stipend makes sense, considering the developer's area and market of work. \nThe team states that there are o risks concerning the project, but here I think risks such as the physical well being of the developers, as well as any other risk compromising the value of the stipend (number of hours spent) or the non conclusion of the course should be taken into consideration. \n", "q1r": 4, "q2": "The community can audit the project by seeing if the tree developers really concluded the course. \nOne point here I would suggest to the team as important to see the progress and the effects of the course, is sowing on the report what these developers are doing in order to build the ERP (Test of a MVP to add value to the Cardano Ecosystem). This should be an important milestone as well. \nI missed here a clear delivery date, a essencial audition mark. \nEven so, I still think this project was clear in it's development. ", "q2r": 4, "assessor": "z_assessor_3768", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13778, "q0": "The proposal has not demonstrated a clear consideration for the need of cardano developers in Africa. It lacks a clear identification of the urgency in a social and economic perspective and how providing an ERP system will solve the challenge of growing the cardano ecosystem. It does not give a reason or propose an added value that the ERP system and its beneficiaries will bring to the project.\nQuestions that need answers include:\n1.\tWhy an ERP system might be the right approach to growing African participation in the cardano ecosystem.\n2.\tWhat are the future impacted number of participants the initial proposed developers of 3 will deliver to build the ecosystem?\n3.\t A missing identification of risks and mitigation measures to alleviate such challenges from a political, social, economic or technological perspective shows the proposal team hasn’t analyzed the African region appropriately. These missing PEST challenges and mitigation measures could greatly impact the execution of the training program.\n4.\tWill 3 developers be all that is needed to solve the challenge of growing the African Cardano ecosystem through an ERP? With no further talent requirements by the proposers and the ecosystem they want to build.\nIn terms of measuring impact, the proposed solution hasn’t taken into proper consideration the impact measurement criteria in the cardano community. No information provided as to how this proposal should be judged using the 3 stipulated clauses of impact, feasibility or auditability.\nThere is also no continued assessment or project monitoring beyond the training period which I find quite odd. This is probably one of the weak areas the proposal addresses. \nFrom my personal experience running hackathons, developer events and training programs, no single training leads to an effective implementation and achievement of a goal. It has to be continuous to achieve its impact. \n\nAnother approach at solving the impact, feasibility and auditability measurement criteria in the cardano community will be for the proposers of this solution to look at SDG/ESG measurement using the IRIS+ system developed by the Global Impact Investing Network. There are several benchmarks and formulas which have been developed to track the impact of technology solutions delivered around the World.  https://iris.thegiin.org/\n", "q0r": 2, "q1": "Though this team possess the capabilities needed to deliver this training. They lack some expertise or knowledge in terms of project management. They were able to ascertain the duration some processes may take, but a missing consideration in their timeline construction includes the time given for their proposal submission and assessment by cardano PA’s and vPA’s. \nThis is a clear oversight on their planning abilities and should be reconsidered for inclusion in the timeline structure. Other areas I find missing is the outline of what success means to the proposers either through performance, process or cost – benefit ratios. \nAlso, the proposers didn’t consider any risk and mitigation measures which proves my point to question the team management abilities to deliver. This shows that their team is filled with technically proficient personnel and missing a project manager or someone capable to write a business feasibility plan.\n This team are likely to encounter unforeseen challenges that will hinder the implementation. They should consider hiring a team member with proficiency in business planning/project management skills and then reapply to Fund10 to stand a better chance. \nThey should also reconsider their impact assessment advantage either through the impact, feasibility and auditability metrics in the cardano community or using the proposed IRIS+ system from GIIN, I mentioned earlier. \n\n", "q1r": 2, "q2": "The information provided is not enough to give an audit on the progress and success of this proposal. I find that the proposers are more interested in building an ERP system rather than thinking of the future impact such a system will provide.\nA deeper needs assessment should be conducted with considerations into the Political, Economic, Social and Technological climate in Africa. It is widely known that most of the issues in Africa are sometimes farther than just proposing a software solution without investing the pest indicators earlier mentioned. \n", "q2r": 1, "assessor": "z_assessor_3800", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "The requested funds will be used to cover Emurgo Academy training fees for experienced developers residing within Africa.", "experience": "Please see core team CVs at our linked website.\nNote: Our African team developers have asked that their CVs not be published pending receipt of funding."}