{"id": 421063, "author": "kidus", "title": "WeCare: Unlocking Human Finance", "url": "https://cardano.ideascale.com/a/dtd/421063-48088", "category": 26600, "amount": 84465, "description": "The global non profit industry has brought millions out of poverty,but has also been prone to corruption. The lack of traceability and transparency has made the industry unsustainable.", "f6_no_assessments": 7, "f6_rating": 2.7142857142857144, "videos": [], "media": [], "f6_assessments": [{"id": 1073, "q0": "The team wants to develop a donations platform targeting Ethiopia, built on top of Cardano, that due to the nature of blockchain will be completely transparent. As such it will lead to a drastic decrease in fraud and corruption from the organisations’ side and possibly to greater involvement in helping those in need from the donor’s side.\nThe proposal has identified the weak spots of the current system, both in the case of non-profit agencies, as well as the potential donors and provide solutions on how to combat them.\nThe solution is clearly described, starting from how the money will be donated to how the platoform-specific token will be burnt after the donation is sent.\nThe fact that the team has also considered educating the public in regards to cryptocurrencies and blockchain is a plus. On top of that, they have carefully considered the situation of the people from Ethiopia regarding their lack of access to smartphones and have accounted for that by creating specific hotlines to disseminate information.\nGiven the details provided, I find that not only does the proposal fit well into the challenge criteria, but it could potentially have a positive impact on both the Cardano ecosystem and the donations sector, as well.", "q0r": 5, "q1": "The team has unfortunately not managed to provide us with a detailed plan for delivery. The letters TBD are the only provided answer, no other document has been attached, and as such, I deduce that they must not have had the time to complete it. And while I feel it’s a shame, I also consider that they have the opportunity to apply in a future fund, as most of the proposal is by now completed, with only some adjustments left, where feedback can be incorporated.\nRegarding the budget, while I am not sure if it’s finished, I will add that there is also some information missing. Having an hourly rate and a number of hours for each task is a much better option for providing a clear picture of the budget allocation. It helps anyone reading the proposal assess if the budget is well calculated and if the hours needed are reasonable. Also, the amounts should be converted into USD for simplicity.\nThe team description is also not finalised. While we have the name of one of the proposers and her previous skills and involvement in Project Catalyst, there is no LinkedIn profile or any other link provided, that would enable us to verify her skills. And while in the intro section, several other team members were named, they do not appear in this answer at all.\nConsidering the unfinished state of this section I will rate it a 2.", "q1r": 2, "q2": "I feel like the project progress question has been focused entirely on the educational side of the proposal, that from my understanding, plays only a minor role in the development of the platform, while the main focus of the proposal, building the donations platform, has been entirely excluded.\nThe success definition question has a reasonable answer, though for the purpose of a proposal audit, having some realistic metrics attached brings a lot more clarity and helps the community in assessing its favourable outcome.\nWhile somewhat on the correct path, the auditing answer would also need to be revisited, as such, especially considering the lack of progress tracking, I will rate this section a 3.", "q2r": 3, "assessor": "z_assessor_2192", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 2993, "q0": "Within the US $471.44 Billion was given to charities in 2020 alone. That is a 5.1% increase compared to the previous year. It is estimated that 84% of Millennials give to charity, donating an annual average of $481 across 3.3 organizations. Offering a transparent and accountable platform that donors can track and confirm their funds are going to the causes they support would be a game-changer. In addition, the volume and people who will interact with the platform and the exposure, it will bring to the Cardano ecosystem are worth nothing.  However, the only issue I can see is a focus on Ethiopia. There are other African countries desperately in need of such service. Is the plan to expand and offer the same to countries like South Sudan or sub-Saharan regions? And how would you achieve this with their limited internet infrastructure?\nAlso, I see you have plans of partnering with FairWay to get the Atala prism verified credential for KYC and Emurgo for the traceability solution this is a great way to reduce scammy imposters and increase credibility on your platform all the while maintaining a key Cardano ethos philosophy of Decentralisation. \n", "q0r": 4, "q1": "There is no clear developer experience that will show the ability of the Wecare team to accomplish this endeavour. Furthermore, within the\"Summarize your relevant experience\" you did mention a team indicating two or more people however, only one name Mearaf Tadewos is provided with no link to any professional account on LinkedIn or Twitter. Secondly, there's nowhere I can find that states your intention for hiring more people should you be funded. \nThe image shared under budget breakdown did not add the currency value. Is it going to be in dollars/Ada or the Ethiopian Birr? This coupled with the fact that eleven people are working on this project based on the image shared but not a clear breakdown of their expertise, combined work experience of details doesn't paint a clear picture of how you plan on building to achieve the goal of building this platform.\nCoupled with the above reasons and the fact that there's no clear timetable or roadmap as to when you plan to launch or what has been accomplished already, the question is how do you become sustainable when your platform wouldn't be taking any transaction fees?\n", "q1r": 2, "q2": "In the link provided to Github, there is no content. It will prove difficult to track the progress when no there's no Github repository to view the progress of the work. That said, having an increasing number of verified and authenticated good reputable NGOs on the platform is a good key indicator that the platform is achieving what it set out to do.\nIs there any whitepaper, video or link that proposes the mechanism in the burn & mint process of the T-ETB token be tracked? Will it be done algorithmically or you will have to incentives arbitrage services?  \nGoing through the proposal I can't find any Metrics/KPIs that will be implemented so that the community can track the progress of the work, coupled with the lack of any social media links established or plans to establish", "q2r": 2, "assessor": "z_assessor_2381", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4059, "q0": "This proposal addresses a very pertinent problem there is in Africa that is the misuse and corruption involved in donations to NGOs. Unfortunately, the number of typos in the proposal decreases its quality and its value. The main idea is to use blockchain technology and the Cardano ecosystem to create a platform to provide transparency and traceability to the process of donating. That would be an innovation to tackle a unique challenge faced by the continent (other places face this problem as well but in Africa it is more notorious due to the need of the continent to receive external help). However, they have not explored sufficiently the characteristics that would make this platform stand out and how exactly they would use blockchain technology to leverage all these desired features. The only interesting part where something related is mentioned is when they claim donations would be traceable and donator could set conditions on how the money donated is spent. Nonetheless, it is not explained how exactly donors will be able to trace their donations and how these conditions will be put in place and which conditions will be possible. When talking about recipients it is also claimed they will be given complete KYC but again how this will be implemented remains a mystery. In the section to describe how to track the progress it is said educational campaigns will be launched which both elopes the goal of the project and does not provide any KPIs to track progress.", "q0r": 2, "q1": "The feasibility of this project is very low. In the detailed plan section, there is a \"TBD\" which shows the lack of commitment of the team with this proposal. No roadmap is provided and the budget breakdown presented is an image with a resolution so low it can't be read. The only experience described by the proposal is of one person, Mearaf Tadewos, but no evidence at all is given to support what is claimed. They could have provided a LinkedIn page describing his past experiences and skills for instance. Also, no timetable is given so we have no clue how long the project will take to be concluded. Finally, I believe for this project it is vital to explain technical aspects such as how they intend to give the donations traceability and transparency, and how they plan to set the conditions in place in the smart contracts. The feasibility of theses implementations is crucial for the feasibility of the project as a whole.", "q1r": 1, "q2": "Again, auditability is very poor for this proposal because the team has provided no roadmap, no milestones and no timetable. They mention some things that could be used as metrics such as number of NGOs listed in their platform, and number and frequency of donations, but they could have formalized it in form of KPIs. Additionally, they could have stated which numbers they expect for theses KPIs and how much is necessary for them to consider the project a success. The idea of the solution could work and be effective, but the proposal does not provide a clear and understandable description of it. Finally, the proposer does not present any public channel to regularly update the community regarding the progress of the implementation.", "q2r": 1, "assessor": "z_assessor_2513", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4115, "q0": "This solution merges education to build trust in an environment that is ripe for innovation and stands to benefit from one of blockchains most advertised features - transparency.  In line with the Grow Africa, Grow Cardano Challenge, blockchain solutions which facilitate the non-profit ease of doing business may very well be a building block to delivering on some of the key metrics in that challenge, such as onboarding users and developing local partnerships, and offering solutions to education concerns.\n\nThe proposer's idea is to work with a certifying body to verity certain agencies through a KYC process, effectively building a database to authenticate a vetted list of organizations which can then connect with new donors and receive funds to a Direct Deposit software product.  This approach aims to overcoming compliance challenges that prevent funds delivery to impactful projects, and to avoid common scams which are rampant on social media.\n\nThis is a massive global problem which extends even beyond Africa, and solving it could help to deliver meaningful results.  However my neutral position on this proposal stems from my inability to make a clear distinction between the volume of education vs tech effort which will be required to implement change - i.e. not understanding what kind of education or partnerships might be needed  in order to convince the government to adopt this solution.  I'm also not convinced that building a tech solution is the correct approach, since the authentication initiative could be easily integrated into an existing wallet framework.", "q0r": 3, "q1": "One of the main challenges for this project may come in the form of implementation.  More specifically, a World Bank report from 2017 indicates that around 40% of Ethiopian adults use banks or other similar financial institutions.  A Digital 2022 report on datareportal.com clarifies however that only 25% of Ethiopians have access to the internet, a base requirement for blockchain solutions and potentially an enormous barrier to implementation of new systems aimed adding transparency to the aid and development market.\n\nTechnology aside, this proposal states that a significant amount of funds will be purposed towards educating the public to build trust.  However, the team description consists of only one software developer and no detailed plan to develop or deliver that educational initiative.  In the attachment image containing a budget breakdown, there are additional team member names listed as recurring cost items, but no additional details of those people are provided that could help to evaluate their suitability for this project.  Further, the total expense anticipated for marketing is only around 25% of the total project budget, which seems low compared to the importance the proposer placed on education.\n\nFinally, the cost breakdown is clearly distributed across a 9 month timeline, with 4 core team members identified by first name and an additional 7 roles to be filled.  The proposer states that the funds requested are sufficient to bring this project to fruition, after which the project will sustain itself without the need for follow-on funding.  However the financial plan includes no details of anticipated income which could facilitate a sustainable organization after the 9 month period.  Additional details on how that sustainability may be realized would be helpful to determine if the feasibility aligns with the proposals plan.", "q1r": 3, "q2": "The key auditability metrics proposed for this project are 1) social media education campaign response - measured through impressions and comments, 2) educational institution engagement - measured through survey responses, and 3) NGO onboarding - measured by frequency and size of donations.\n\nThe primary shortcoming of these metrics is that there are no goals or other ways to evaluate what kind of impact might be necessary to delivery an impact in the market.  For example, how big is the location NGO donation market now, and will this project aim to grow the size of that market or simply capture a percentage of the existing market size?  And in the future, how to measure the success or failures of the WeCare Direct Deposit system since the commercial model is not clearly exposed in this proposal?\n\nIt's good that the proposer plans to use a Github account to track progress on development work, promoting the spirit of open-source!", "q2r": 3, "assessor": "z_assessor_2517", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4610, "q0": "\nIt seems to me that the proposal addresses an important problem in the continent, the lack of traceability and transparency in the donation industry, really this is a problem that affects several industries, I have to say that the nature of the cardano blockchain offers interesting properties such as immutability, distribution and chronological record of transactions that make them of much interest to many of the traditional systems. The platform as a solution is practical and well understood, I could not identify how the traceability module would work or the need for the ETB token, I have experience in traceability systems for the agri-food industry and well in this case what is needed to track are the donations, I can understand that the ETB token will represent these donations and serve to identify and differentiate them from any payment in ADA. I understand the concept but it seems to me that the procedure is not well explained.\n\nOne idea would be to mint these ETB tokens and the donor could buy it and then send it to the wallets of those who receive the donation, once this is done, the recipients can redeem these tokens by fiat directly to their bank accounts. It seems to me that this is how it would work but it is not quite explicit, doing this would improve the proposal quite a bit. \n\nGiven that the problem is big and the solution is simple, plus the team has taken into account the challenges that could impede the implementation or adoption of the platform, it seems to me that if these challenges are overcome efficiently then the proposal has the ability to add value to the cardano ecosystem, especially in the area of building trust in the technology, this is a fundamental pillar that in the future could allow the adoption of other solutions and make the learning curve for the user faster.\n\nA strong point of the proposal is to create these education campaigns for user onboarding, most proposals focused on people outside the ecosystem and technology in general do not take into account this challenge that is certainly more important than for example the development of the platform itself, so that part seemed very good to me and the fact that they have designated a part of the budget for this is good.\n\nThe metrics are aligned with the challenge because if they are addressing problems that prevent the adoption of cardano, it has the objective of creating new wallets in the ecosystem also the simplicity of the solution is easy to understand for the end user which reduces the friction in the adoption this is thanks to the fact that the platform is for donations, it would be more complicated in an investment platform for example, they leverage well of partnerships with NGOs that have very good reputation, if implemented correctly the proposal would have a great impact.\n", "q0r": 5, "q1": "At the beginning of the proposal the proposer talks about a team of individuals who have relevant skills and experiences in different sectors, I can think that those individuals are the ones named in the budget breakdown, besides being named the proposer does not add links, evidence or references of the team members, it is important to explain what each one is going to be in charge of what previous experience they have in those tasks or in the cardano ecosystem.\n\nA major problem in the proposal is that it does not have a detailed plan, I want to believe that it was a mistake when uploading the proposal, but without that detailed plan I can not determine what tasks will be carried out, who will execute them, what are the resources needed to do it and if the plan has reasonable time horizons, technical aspects of the proposal, basically without that detailed plan I can not determine the feasibility of the proposal, I can only evaluate the team of which I already mentioned that there is a lack of references and evaluate the budget, since there is no detailed plan is complicated to understand the budget breakdown. \n\nAs for the budget the truth is that it is very high compared to the available funds, we are talking about almost 20%, probably the costs are reasonable so my recommendation would be to divide the proposal into phases and thus ask for less in several funds, since the proposal comprises 9 months it could be divided into 2 or 3 phases. The proposal makes sense and may seem feasible but without a detailed plan and more references from the team, it is not possible to determine the feasibility of implementation.\n", "q1r": 3, "q2": "Again we face the same problem, to evaluate the auditability I am really evaluating if the information provided is sufficient to audit the progress and success of the proposal, as the proposal lacks a detailed plan or roadmap, it is impossible to identify milestones that can be met as the implementation progresses, it is true that describes how the user reception will be measured, how familiar they are with the technology and if they understand the benefits of the platform, that part is excellent and serves to audit the implementation of the proposal, It is true that you describe how you are going to measure the user's reception, how familiar they are with the technology and if they understand the benefits of the platform, that part is excellent and serves to audit the implementation of the proposal, but milestones are needed during the development phase as well, be more explicit especially related to time horizons, for example, a milestone could be feedback received by users after launching the first prototype and put a date that you plan to launch the prototype. Detail how these education campaigns will be carried out, be clear about important milestones such as the use of DIDs or the integration of the traceability solution, these are milestones that seem fundamental to success but it is not specified if they are part of the proposal or are in the future.\n\nThe truth is that again to evaluate the auditability is complicated in the absence of all these issues and especially a roadmap with milestones and dates for implementation. \n", "q2r": 2, "assessor": "z_assessor_2575", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8260, "q0": "The fact that the non-profit industry has unchecked room for corruption is very clear. The fact blockchain technology has the means to combat this is also clear. This proposal seeks to address these facts. The idea of converting donated funds to a minted token on the Cardano blockchain thus offering transparency to the process for donors, agencies, and recipients is valuable and inventive. \n\nThat there is the intent to educate more members of the community is valuable and that part alone qualifies it to address the challenge.\nWith that said, I would like aspects of this idea as it pertains to Cardano to be explained in more detail. That you plan to use Cardano to mint the T-EBT token is clear but you haven't explained how this brings more users to the Cardano space. As I understand it, the donor's funds get converted to this token. Does the donor hold the token in a non-custodial wallet or does your organization hold the tokens and disperse them on the donor's behalf?  These are important details that need to be addressed. As you can see one of these options brings the donor into the space, and the other keeps them behind the fence. \n\nIt is not so clear at the moment once this proposal is broken down to its details to what degree it actually seeks to meet the challenge at hand. It is a great idea and I see much potential in it. \n", "q0r": 3, "q1": "The feasibility of this proposal in its current form is questionable for the following reasons:\n\nMearaf Tadewos is the only person listed on the team that will work on this project. This seems quite unlikely for a project of this scope and highly unfeasible if this is the case. Furthermore, in the relevant experience field, the following has been quoted\"Our team includes a blockchain developer, fintech expert, medical doctor & an economist.\"\n\nThis makes more sense but why are these professionals not listed as team members and what function will they play in the development of this project? \n\nLastly, the budget documentation is extremely vague.  What is also interesting is that in the budget I see 4 names listed on the payroll as CEO, COO, CFO, and CTO. I Have to assume that this is part of your team that was not listed in the proposal. These are crucial oversights that need to be addressed in order for voters to have a clear understanding of the project and the management of the funds requested. I strongly advise that your budget documentation be revised to improve the overall feasibility of this proposal.\n\n", "q1r": 2, "q2": "\"Please provide a detailed plan, including a timeline and key milestones for delivering your proposal.\"\nAnswer\nTBD\n\nVoters cannot work with TBD especially when your fund request is roughly 84,000 USD. There needs to be succinct clarity of at least the intention of how you plan to reach the goal of completion and within what timeframe.\n\nI suggest that you break this project into smaller projects with more manageable fund requests and clearer targets. The idea is great and much needed but the overall scope needs to be refined and the added value to the Cardano ecosystem in relation to its goals in Africa needs to be more finely defined and expressed.", "q2r": 1, "assessor": "z_assessor_2970", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 12098, "q0": "The proposal has a great idea and is very focused on explaining and justifying it. The proposer offers a detailed and extensive well written explanation of the problem and an overview of the solution that seems based on solid knowledge and research about the topic. The proposer explains very well how his idea could make a difference, enumerating for each involved participant (non profit agencies, donors, recipients) the added value that the project could bring. Furthermore, the proposal has a noble goal, and by integrating Cardano’s technology it could be a great showcase for Cardano as a way of bringing such valuable ideas to practice.\nHowever, it seems to me that the proposal would be much more appealing if the same focus and detailing given in the Impact step would be applied to the feasibility and auditability as well, which I will elaborate in the next topics.", "q0r": 5, "q1": "First, the proposer describes his relevant experience, which sounds very solid and aligned with the project’s needs, but would be nice if he had provided links for verification, such as his Linkedin profile. The only relevant link provided is a github page in which there is no public information shared.\nSecond, the proposal would benefit if the proposer had identified and detailed the other team members that will assist him on the project. There isn’t any mention of other participants besides the proposer himself in the text, though in the budget detailing there are a CEO, a COO and a CFO nominated. \nThird, the proposal offers a detailed budget, which seems well thought out, but there is no transparency in how the money will be spent. There isn’t any detailed plan or timeline to justify the budget breakdown. \nFinally, it is also not clear which are each team member’s assignments and responsibilities.", "q1r": 2, "q2": "The proposal elaborates a brief timeline in this session, but much more as a way to justify the main metrics that will be tracked and measured than a structured plan. The metrics, though, seem consistent with the project’s goals. Again, much effort is given in the elaboration of the text, but the proposal would be much more appealing if the proposer exposed more concrete and transparent ways of sharing the measurements taken during the course of the project, like links to online public pages where the metrics could be verified such as online sheets or boards, and showing an intent of sharing a closing report on the final results and main learning and feedback. Finally, it is a very good idea with a very well research and context explanation, but the proposal lacks structure, planning and transparency.", "q2r": 3, "assessor": "z_assessor_3361", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "By utilizing the power of the Cardano blockchain, WeCare will disrupt the inefficiencies & corruption in the nonprofit industry, and empower recipients of aid by providing transparency & traceability.", "experience": "Our team is composed of individuals that have the relevant skills and experiences to lead this project. Our team includes a blockchain developer, fintech expert, medical doctor & an economist. We have a well rounded perspective on the problem; enabling us to make a great product."}