{"id": 421074, "author": "mucu", "title": "Cardano For Ugandan Universities", "url": "https://cardano.ideascale.com/a/dtd/421074-48088", "category": 26600, "amount": 18000, "description": "Blockchain projects are ideal for final year university projects, this requires an open source platform and Cardano should be our choice.", "f6_no_assessments": 11, "f6_rating": 3.8787878787878785, "videos": [], "media": [], "f6_assessments": [{"id": 11780, "q0": "Quite obviously, this idea is linked to the challenge setting. This proposal has appeared in Fund 8, has not been funded, and continues to be submitted by the authors at Fund 9. However, the content of the idea and the impact of the solution in the new proposal is almost unchanged compared to the old proposal at Fund 8. The content of the solution according to the group argues is “the first Cardano-based initiative in Uganda”. To address the question of the challenge, the authors pursue the solution, building Cardano Research Clubs at major Ugandan Universities. The target audience is university and college students (focusing on final year students). The form of activities of these clubs is conference events, meeting face-to-face every month on the campus of the University. According to the team's argument, this is the ideal audience to choose Cardano as a platform for learning, researching and developing blockchain-based projects. Personally, I have always been interested in the story of popularizing Cardano education in Africa. Why? Africa in general and Uganda in particular, there is huge potential for large-scale adoption of our Cardano ecosystem. According to a survey by Chainalysis, in 2021 Africa ranks third in the “Top 20 Global Crypto Adoption Index” (https://markets.businessinsider.com/news/currencies/crypto-adoption-africa) -surged-1200-avoided-banks-exchanges-chainalysis-2021-9). I personally did a little research and found the potential to popularize Cardano among university students in Uganda is huge. In Uganda, there are more than 30 universities including public universities, and private universities, not counting other degree-granting institutions. The number of current students is more than 110000 people and the annual number of graduates is 30000 people. In particular, Makerere University in Kampala (one of the universities proposed by the authors) is ranked 1 in the top 5 universities in Africa with a concentration of about 30% - 40% of the total number of students. students in Ugandan universities. Uganda has a comparative advantage in East Africa due to its good curriculum, low tuition fees compared to the region, and English as the primary language of instruction. This has attracted a large number of students from East Africa to move to Uganda to study, including Tanzania, Burundi, South Sudan, and Congo. What does this mean? If the authors' proposal is approved by the community, our Cardano ecosystem will reach young, tech-savvy people not only limited to Uganda in particular but also in East Africa in general. From there, the proposal can help spread the research and application of Cardano in the East African community faster. Regarding the risk of preventing success, in my opinion, the team needs to consider the risk that the market's price fluctuations may affect the budget (because the capital is allocated in ADA). I rate 3 points for this proposed impact, deducted -2 point because the team did not update more information when submitting it at Fund 9.", "q0r": 3, "q1": "The project implementation progress and budget are also kept unchanged by the author as in the previous funding round. Specifically, all activities will take place in 6 months, including 2 phases: Phase 1 (first 3 months) to establish research clubs in 6 Universities in Uganda. Phase 2 (last 3 months), meeting once a month with the participation of representatives of clubs. The 6th month will be the Cardano Hackathon in Kampala. Honestly, I was personally looking forward to a more detailed and innovative blueprint than what the team showed in the previous funding round. For example, regarding the promotion plan for the establishment of Cardano clubs, it is necessary to calculate the number of participating members. Will these clubs operate independently or jointly under the management of the project development team? I would also like to know more about the activities to link clubs, and share information and materials? I also suggest that the authors should clarify more about the picture of Universities in Uganda and what is the reason for the priority group choosing this list. The information related to the event topic has not been mentioned by the group. I propose the following: each month will select a discussion topic, and conduct a Q&A based on questions of interest to the community. In addition, I would also like the authors to clarify more on how scheduling monthly meetings will happen. Detailed information about the meeting schedule should be shared on the website, or on social networks: Twitter, Youtube... so that the community can follow and support the event. The budget items of this proposal are also unchanged from the previous Fund. The team still lacks an explanation of the attached unit price and quantity. For example, for meetings in the area: the cost of renting a place of $200 needs to clarify how many square meters the hall has, and how many people can accommodate. Similarly, the $600 refreshment cost to serve how many people are expected to attend the event? I also recommend that the authors dedicate a portion of their budget to reward Cardano with knowledge-challenging minigames at each meetup event. If not, the authors should add to the proposal to engage students at each event. Regarding the team, no link is provided so that the community can verify the skills and experience of the proponent. Therefore, I made 2 deductions: - 1 point for lack of reference link to team profile, -1 point for lack of detailed unit price budget. My rating is 3.", "q1r": 3, "q2": "The only bright point of the new proposal is that the team has added KPIs to measure success compared to the old proposal. Specifically: there will be at least 4 Cardano Clubs established in 4 schools (out of a total of 6 schools selected), there will be 4 groups submitting proposals on Catalyst, and 500 Twitter followers of the clubs. In addition, I also suggested that the team add more KPI metrics related to the initiative product category. This section covers the number of software and computer science students that will be working on their final year projects on Cardano. So, what is the expected number of these innovative products? Overall, I appreciate the team's effort when it comes to adding new proposal renewal success metrics. My score is 5.", "q2r": 5, "assessor": "z_assessor_3279", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2025, "q0": "This proposal’s idea is to push the development of blockchain based innovations in Uganda, using ADA environment to do it. The proposal intends to bring on-board the creativity and will of the software engineers from the major Ugandan universities.\n\nThe success stated aligns with this challenge since it will bring more users to ADA community and, besides that, will start an environmental change in the Ugandan community, fomenting innovation and creating opportunities to students.\n\nMoreover, if it’s implemented successfully, the scalability of this proposal might be outsourced because the students could manage the hubs inside their universities. Here in Brazil we have the JEC (Junior Enterprise Concept) which are actual enterprises, controlled by the students, which works inside of universities. Therefore, this blockchain solution might become a JEC focused in using blockchain to solve industry/community problems. \n\nUnfortunately, there is no further explanation about the proposal’s sustainability besides the catalyst funds. \n", "q0r": 4, "q1": "To evaluate the feasibility, we can focus on the following points:\n1 – roadmap: The presented roadmap is quite general, informing the time (3 months) to finish a task. Therefore, in order to make the proposal easier to follow, the tasks should be subdivided into smaller ones and, preferentially, indicating how long each one of this would take.\n\n2 – methodology: It does not contain the information about how the proposed tasks will be accomplished. To exemplify, it was stated that in the first 3 months it’ll be done 6 events in the major public universities. However, it’s improbable that it may be accomplish without a previous university’s dean authorization. That being said, it’s lacking a further explanation on the methodology behind the tasks.\n\n3 – budget:  General budget, needing further explanation. Exemplifying: was asked USD 900 to hackathon advertisement, however which tools will be used to spend this amount?  Allocated a budget to transport costs but how many people, to where, etc? Therefore, the proposal would gain in transparence if these detailing were added.\n\n4 – self-funding/scalability: The proposal itself needs funding to continue promoting hackathons and maintain its operation as a whole. Moreover, to grow to other universities or schools, will be the need of financial resources. However, were not provided a plan to do it. An interesting mechanism to adopt is to incentivize the students to open a JEC (Junior Enterprise Concept) in the universities to start using ADA blockchain as a solution to some problems. It might scale to other universities without the need of involvement of the proposer itself.\n\n5 – team: The team has all the knowledge it needs to start running this proposal (and was provided links proving their knowledge).\n\n6 – risk management: There were pointed some risks and mitigation actions, however there is a major risk which is no being allowed to enter in the universities. Therefore, the mitigation action is to allocate more budget in marketing in order to call the students to attend to the meetings online or in other physical places.\n\nThat being said, to have a successful implementation, there is a need to add more details in some points. \n\n", "q1r": 3, "q2": "To allow the audit of a proposal, we need to focus on:\n1 – roadmap and milestones: Since the whole roadmap is general, there is not milestones to follow and to know what to expect in a defined time. Therefore, it makes hard to know what to expect and when to expect.\n\n2 – own channel: It was provided a link to this project, which is good in order to follow its development. \n\n3 – Metrics and KPI: it was not provided the metrics and KPIs, however it was provided the success view. It would be good to measure the # student attendance, # universities joining, # final projects using blockchain, # students onboarding on catalyst (easily during this proposal). More than that, could be also added a survey to know if the students are continuing with their university hub of study.\n\nTherefore, there are methods to audit, however it lacks some information.\n", "q2r": 3, "assessor": "z_assessor_2298", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4146, "q0": "Establishing clubs in the universities to ensure that Cardano is the open-source ecosystem being used by Ugandan students to develop Blockchain projects is a promising project as far as impact is concerned. \n\nThe proposed solution in this proposal clearly identifies the problem of education and onboarding in the 'challenge setting'. The detailed description of the problem allows me to accept that the proposing team understands the problem clearly and thus knows how to tackle it effectively.\n\nThis proposal align with the 'challenge setting' but I am failing to understand why the proposal team could not justify why they think their proposal aligns with the Grow Africa, Grow Cardano challenge setting. I say this because there's a complete repetition of content from the \"Please describe your solution\" section instead of taking the time to tell the community exactly why their proposal aligns with the challenge setting under the \"Please describe how your proposed solution will address the challenge that you have submitted it in.\". The team could have done a better job by being precise about this question just so the community isn't confused.\n\nHowever, I do agree with the impact of this proposal and hence my score of 4.", "q0r": 4, "q1": "The proposer knows in an identifiable manner, the type and number of teams needed to aid successful implementation. From the links provided for team members, I can attest to the teams' experience as the quoted experience of team members in the proposal is reflected on their various profiles through the links provided. Also, the team already has a nice functional website which indicates that they have been doing this already. I took 3 minutes to watch the YouTube video attached to the proposal but unfortunately, I couldn't really grasp the understanding due to how the speaker was expressing his delivery. I do not know exactly what the problem might have been. Maybe, the accents were too deep for me to clearly hear what he was saying. \n\nThe budget of the proposer looks convincing. Simple research on google indicates that a trip from Kiwatule to Mbarara covers about 341km and is worth 118 USD. Per my research, if the team should start their trip from Kiwatule where Kyambogo University is located to the other regions, then a budget of 200 USD is feasible. For the rest of the budget, it is reasonable to help achieve the set deliverables.\n\nFor the project timeline, it is clear that duration of six months would be needed for implementation. Out of the six months, the proposer does well to communicate to the community exactly what would be done in the first 3 months and the last 3 months. With this initiative, the community can track the progress of the project with regard to activities. Unfortunately, the team is unable to tell the community how they can track the project's progress. A YouTube and website link is being provided but no referencing was made as to which one would be used to report progress to the community. \n\nI agree with the feasibility criteria of this proposal.", "q1r": 4, "q2": "The proposer indicates that the establishment of student clubs in the chosen universities would be a sign of success for this project. This indication is essential to the challenge but I feel it will be an extra hurdle for the community as far as auditing is concerned. This is because the proposer refused to announce in the proposal which medium the community can use to track the progress and achievements of the project. \n\nFor a clear problem that has been identified in the challenge, a clear solution has been provided by the proposer. Educating Ugandans to establish a blockchain hub is likely to graduate into a whole community that will be capable of ensuring the wide-scaling of Cardano in that region.\n\nAs the auditability of the proposal answers some of the questions associated with the auditability criteria, I am not 100% sure that this proposal can be audited successfully.", "q2r": 4, "assessor": "z_assessor_2518", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 4213, "q0": "The \"Cardano for Ugandan Universities\" proposal addresses the challenge Grow Africa, Grow Cardano by building Cardano study clubs in the major Ugandan Universities to onboard learning devs on Cardano. Comparing with other states of East Africa (Tanzania and Kenya), Uganda still lags in blockchain innovation. The blockchain club in Uganda will explore the connection point with the pre-existing ecosystem on Cardano (Wada) to help the local devs to access the necessary resources on building on Cardano and this should help to drive Cardano adoption among Ugandan devs community. They will reach out to local devs (in the college and universities) through meetups, workshops and hackathons within the next 6 months. They have foreseen the risk of carrying out this project is the manpower to walk through the relevant tutorials with the students. The proposal has high potential to scale as the study clubs and communities can flourish among young generations and drive Cardano adoption within Uganda. ", "q0r": 5, "q1": "Given the detailed plan layout, the project first 3 months will be spent on launching study clubs in the 6 major universities and the meetups in the next 3 months will attract the representatives from these universities. They will invite the existing devs from Wada and organize a hackathon at the final month 6. They have their set venue and timeline. The detailed cost breakdown for organizing meetups and hackathon is provided increasing the likelihood that the tasks will be carried out according to the plan. Thanks for the full info on team members of people who are very involved within Ugandan community, this project is in good hand and I am very confident that the team can complete this project successfully given the budget and timeline. ", "q1r": 5, "q2": "It is evident that there should be University cardano study group in these 6 major universities as the initial indicator of success. Other measures of success is quality engagement within the local communities and the students decide to execute their final year projects on Cardano. The team has concrete KPIs that they set to achive (4 university clubs, 4 groups pitching ideas, 500 local social twitter followers). The team should consider having their own report channel of progress for this project (bi-weekly meetings, after townhall meetings or submitting a report during these 6 months to show that the team has met its milestones and on course to finish the project.", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4894, "q0": "The proposers want to set up Cardano Study Groups in the universities in Uganda to help the students working on their final year university projects.  This proposal is answering the call from the Uganda education authorities' encouragement of step-up innovation: \"University students must have final year projects to showcase their craftsmanship in innovation.\n\nThe proposers, calling themselves Blockchain Club of Uganda, shall take initiative to introduce Cardano to the software engineering students. They will outreach them through meetups, workshops and Hackathon. \n\nThe proposers think that the proposal would be able to bring student software engineers and would-be developers into the Cardano ecosystem and bring about positive global change.\n\nThis as I see it, the proposal will surely get some students upon completing their studies to board onto the Cardano Blockchain and contribute to it. It will attract more developers. \n\nI therefore strongly agree to that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposers plan to organise 6 events in 6 universities around Uganda in the first three months. At the same time, they will set up study clubs or groups in these universities.\n\nIn the next three months they will hold meetups, one per month. In these meetups they will showcase the student's knowledge in Cardano and will also invite Cardano established developers, WADA,  to join in the meetups virtually.\n\nIn the final, the 6th month they will hold the Hackathon.\n\nThe budget requested is 18000 USD broken down by events and detailed by rent, advertisement, refreshment, incentives and honorarium etc \n\nThe Blockchain Club of Uganda has 4 members involved in this proposal. They have 5 years involvement in the Blockchain development and experience. \n\nThis proposal is driven by the need to equip final year students with in-depth knowledge in Blockchain for them to showcase innovation. The proposers have identified the best possible methods with reasonable budget to achieve this end. I therefore strongly agree that it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposers look at success as formation of 4 clubs in 4 universities, 4 groups pitching their ideas in the catalyst and attracting 500 followers on Twitter. Although they did not set the time for achievement, their project is 6 months.\n\nI however am not clear how they would report their progress (e.g. number of students attended, number of established developers invited and on screen chatting with the students and so on) over the 6 months, and through what channel they will do their reporting. \n\nWith the observations above, I tend to agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2631", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5778, "q0": "This proposal aligned to the campaign brief and it objectives by adoption through Onboarding Africa's development is important for the community so Africans would not be passive beneficiaries but active one that contributes immensely in the cardano ecosystem.  This is because, smart contracts on the cardano blockchain built local developers and students would be adopted by users in Africa and that would be a great strategy to deepen adoption. \nThe team's solution is vivid that, the target group is the tertiary students who have fresh brains to learn new things to be onboarded to  to be developers. ", "q0r": 5, "q1": "The team have experience with software developers as part but a detailed information about each member should have been provided to further probe their competence. \nThe team has listed the names of the universities where the events would take place. From the milestone, there would be a series of events and finally climaxed with hackathon training. The total number of student participants is also not stated.  It is therefore important to show a detailed plan of events for the two activities. This was not seen in the plan of action.\n\nThe budget is also not detailed enough for the community to know why those funds are allocated for the exceptions. For example, the team should have explained what goes into logistics , how many speakers would benefit from the honorarium and how many would be selected to participate in the Hackathon training. These detailed were not provided in the budget to justify what the sum requested is important. ", "q1r": 2, "q2": "The team has a metric on the number of campus clubs to establish, number of technically minded developers creating smart contract, and number of followers on social media handles. This is key to help the community to conduct the evaluation on the successful implementation of the proposal. \n\nHow success means has provided expected outcomes which are impressive to help in auditing \n\nThe number of estimated attendees as an important KPI was not provided and should the proposal win funding such a KPI should be made available. ", "q2r": 4, "assessor": "z_assessor_2749", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7426, "q0": "Proposal with the goal of building Cardano research clubs at major universities in Uganda, Africa should be perfectly suited to the Challenge.\nProposing to present the solution shaking hands with software engineers and students, this is a really wise move. They are objects with deep knowledge, understanding of the network. If the project is successful, I believe that blockchain will be a lever for Uganda to develop together with neighboring countries.\nRegarding the [IMPACT] Please describe how your proposed solution will solve the Challenge you submitted, you should not copy the solution section. In this section, I can suggest the following: propose as a solution to scale up the application of Cardano in Uganda in particular and Africa in general. The purpose of the proposal is to attract and train young human resources, blockchain accessibility, practical application of Cardano in life, everyone will know and use it.\nRegarding risks, the proposal lists problems but does not offer solutions to solve or minimize difficulties. For example, we will create a program of instruction tailored to each audience, committed to long-term support and development orientation for them. Avoid the risk that they are not motivated to absorb blockchain technology and the Cardano ecosystem. As for the 2 developers who are only capable of working 20 hours per month, help them with funding if they need it by proposing more budget and convincing them to be Uganda's leaders in blockchain. This part I can only rate 3\n", "q0r": 3, "q1": "The proposal plans to plan in 6 months, organize 6 events at 6 universities and 3 meetings in different regions. I think you should describe the process in more detail. For example, the date of meeting with the principal or school administrators to present the proposal, the date to start mobilizing students to participate, the start date of training, the date of the Hackathon event, etc. As for the detailed budget, it is quite suitable combined, the total cost is $ 18,000, fully listed by you\nThe team has 4 members, the main expertise in blockchain, this is your strength. However, if you are looking to expand and introduce Cardano to a wider audience, I think you should contact an additional consultant specializing in event planning and marketing. Everything will be more efficient and professional\nAs for [FEASIBILITY] If you are funds, will you return to Catalyst in a later round for further funding? Please explain why / why not. This section is for you to present the financial capacity, after being funded, can the project be automatically maintained or not? If yes, very good. If not, please state why\nI can only give 3 points on this part\n", "q1r": 3, "q2": "You should list the KPIs specifically. After reading I can understand there are 2 KPIs which are the number of universities and the number of final year students doing projects on Cardano. These two indicators are intuitive and easy to quantify. In addition, I would like to suggest a few more indicators such as regional meetups, Hackathon, established clubs. The more relevant KPIs, the more impact the proposal will have. And it is recommended to provide a specific link to update the development progress, helping the community to follow.\nAs for [AUDITABILITY] Please provide information on whether this proposal is a continuation of a previously funded project in Catalyst or an entirely new one, you should only answer Yes/No. In this case, the answer is No, because in the previous fund, the project was not disbursed\nUnfortunately in this section I can only rate 2 points, you meet very few necessary criteria\n", "q2r": 2, "assessor": "z_assessor_2893", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8473, "q0": "Cardano For Ugandan Universities is an excellent initiative for expanding the Cardano user base in Uganda and beyond Africa.  By organizing sharing sessions and building Cardano research clubs at major Ugandan universities for year-end students, proposal can help students quickly gain knowledge about Cardano and introduce it to developers. Students will get to know cardano is a blockchain platform for innovators with tools necessary to create possibility for all and bring about positive global change.\nIn this suggestion, the authors suggest that Cardano should serve as the open source platform to facilitate the onboarding of new users and increase the cryptocurrency's popularity. Although local developers, and notably those currently enrolled in schools of higher learning, are the intended audience, I believe the proposal's overall objective is to get software engineers to use the Cardano Dev Ecosystem. That alone makes me agree that this idea successfully handles the challenge since it satisfies the Catalyst Fund's aims of speeding up the developer and app ecosystem and training a set of people eager and competent to make contributions to the ecosystem.", "q0r": 5, "q1": "It is commendable that the implementation of the 6-month project has a fairly detailed plan. The method in which it was presented is both well planned and gets to the point quickly. Proposers have already identified 6 universities to organize the events.   The budget is quite specific and may be broken down into two categories: hackathons and regional meetups. I have no reason to doubt that it is possible to accomplish the objectives that have been stated.\n\nNevertheless, certain facts ought to be presented in a more comprehensive manner. To begin, the proposal includes links to each core team member's Twitter and Github accounts. However, it should also give more background information, such as what these individuals have previously accomplished, in order to properly evaluate their experience. Second, some potential risks that might arise have been outlined; nonetheless, the proposer should provide a solution to deal with these issues. If these risks aren't mitigated, they can't be prevented from occurring, which implies that project execution will be slowed down. Providing strategies for mitigating risks in order to ensure that the project can still be carried out if the worst case scenario occurs. Last but not least, a marketing plan should also be mentioned because, given the length of the campaign, marketing will be of the utmost importance.", "q1r": 4, "q2": "The road map is quite specific, with precise milestones and an established time frame. The KPIs offered are solid indicators of reaching the targeted result, and I have confidence that the initial success of this initiative is having university Cardano study groups formed up in at least 6 major institutions. Both the problem to be solved and its intended audience are made crystal clear. I think the offered method is a good one that will effectively address the issue.\nOne thing I would recommend is making the data or completed activities public so that everyone can keep better track of them.", "q2r": 5, "assessor": "z_assessor_2985", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9414, "q0": "This proposal Cardano for Ugandan Universities is a project that the proposer sees as a challenge in the universities especially for final years who are preparing to do their project work. The proposer thinks blockchain project is ideal for final year project since its a open source platform and Cardano should be a choice. The challenge i see is that not much students in Uganda especially those in the universities have heard about the Cardano community and therefore the proposer will use this opportunity to create awareness about the Cardano community and that of the blockchain through their project work. This problem of awareness creation of the Cardano community i really support because a lot of people will get to know about Cardano and all the benefits associated to it . Especially for students who are into emerging technology development. There is a positive impart to the community because a lot of people will get to know about Cardano ecosystem , the blockchain and also about the crypto wallet (ADA). The KPIs used will mainly be setting up club meetings in these 4 universities in Uganda for more education. This i think is not enough at this level for awareness creation and even when study groups are added to it. This proposal will somehow address future challenges but may not benefit all since sensitization will  not start from the earlier stage.", "q0r": 2, "q1": "The proposer and his team members have been in the advocacy business for blockchain for the past 5 years and so they believe they can use that same experience to champion this project. But i do not think this experience is enough to champion this project in the sense that there must be massive sensitization which is much more than only advocacy and setting of study groups among final year students. it must start from scratch. The proposers shared a link which talked more of the blockchain club of Uganda . The link explains their core mandate which is  building on blockchain, blockchain education and the green pearl. This they have in partnership with NEAR another sister company. They also shared a youtube attachment which also throws more light on the project. These link and attachment are quite relevant to the proposal. This team is made up of 5 members with their budget of UDS 18000, the proposer provided details of what each member can do with their credentials in a link form. With such qualities, i believe they can do much more than just advocacy. The budget provided is to me on a higher side because for 6 month duration , i suggest some of the items on the budget should not be considered. An item like Refreshments $600  and Swag 30*12 = $360 plus Bandwidth equipment $140. These should be scrapped to make the budget more reasonable.\nRegional Meetups\nLogistics\nVenue Rent $200\nBanners $200\nRefreshments $600  \nTransport Costs $100\nHonorarium $400\nSub total $1500\nFor the 6 University meetups 6*1500 = $9000\nRegional Meetups 3*1500 = $4500\nHackathon\nVenue Rent for three days 300*3 = $900\nFacilitation $1000\nSwag 30*12 = $360\nBandwidth equipment $140\nAdvertising $900\nParticipants’ incentives $1200\nSub Total $4500\nGrand Total\n$9000+$4500+$4500\n= $18000\nThey also provided a detailed plan as to how they will implement this project successfully. In the first 3 month, the implementation of the project would be launched in 6 major universities across Uganda. Clubs would be formed in theses universities\n500 local social following on twitter will have been realised this is to get everyone involved and to have a lot of followers.", "q1r": 3, "q2": "The proposers will use 6 months to embark on this project.\nSix(6) technical events in 6 universities around Uganda. These universities shall be Makerere University, Kyambogo University, Mbarara University of Science and Technology, Gulu University, Busitem University and Uganda Christian University\nThey shall also set up clubs and study groups to start the education.\nThe KPIs used would mainly be social media, study groups and club meetings among final year university students. I think that more should be done and also this should start at early levels of life not at the final year stage. To some extent, the KPIs used are good but more like radio, T.V, tracts and intense advertisements should be added to what the proposers have already in mind. The community can track the progress of this proposal once a lot of people have been absorbed into it and its yielding results.", "q2r": 3, "assessor": "z_assessor_3057", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1}, {"id": 11806, "q0": "In my opinion, the Cardano For Ugandan Universities proposal is a good and promising proposal, completely in line with the goal of the challenge with the desire to replicate, develop and apply Cardano on a large scale in 2022 and the future not far from Africa in general and Uganda in particular.\nI find the proposed solution is also very different, highly practical compared to other proposals with the same challenge when choosing a student audience to approach, deploy and spread this project. The building of Cardano Research Clubs at major Ugandan Universities to integrate and develop learning on Cardano as a platform for blockchain-based projects.\nFrom my own research, I agree with the problem that the authors emphasized in their proposal, Uganda is still slow in blockchain-related innovation. Cardano was not yet known and brought to life by the people of Uganda. As I said above, it's smart for the team to recommend targeting local developers as well as people still studying in colleges and universities. This is mostly a young workforce, they have wisdom, knowledge, are eager to learn, explore new things, access to new technology quickly. For this reason, if I were to score the proposal, I would give it 4 points, as the proposal has met most of the measures of the challenge presented.\n", "q0r": 4, "q1": "The project's progress has given specific month-to-month timelines, however I see this progress if the project team adds more detail to numerically measure the information the estimated outcome will be achieved of each event by month will help the project have a more detailed view.\nI found the project budget to be $18000 which is 3.6% of the total project budget, which is a perfectly reasonable amount for this project in Uganda. However, this amount does not really explain the cost items in detail so I find it unclear.\nRegarding the feasibility of the project, I see that the authors have made two very important points that the project will have to solve, which are the measurement indicators, the achieved results of the project as well as the difficulties the challenge that the project team will have to overcome.\nRegarding the difficulties and challenges of the project, I see that the project team has raised the foreseeable difficulties when implementing this project, in my opinion when setting out the difficulties and challenges, the project team The project should always provide methods to overcome and overcome these challenges and difficulties. When solving these 2 big problems, I firmly believe that this will be a very potential project.\nAccording to my research, the project team consists of a team of young members, they are all knowledgeable and enthusiastic people who have been involved in the blockchain market for many years. They are people working at prestigious units, their voices have a certain influence on the majority, openly and transparently about their identities, positions they are holding as well as the units they are working for. They have their own youtube channel to verify their activities. Therefore, they are fully capable of implementing this proposal.\nI will give the proposal feasibility 3 points reason -2 points about the planning and budget are not detailed.\n", "q1r": 3, "q2": "Regarding the project's audit, the team makes plans and breaks down the items for each event by month, the division to manage the budget is completely reasonable. However, in my personal opinion, I think this part of the budget needs to be more detailed. For example, because the project team already has a roadmap, a monthly project implementation plan, the budget should also be divided into details for monthly events, which events need to be allocated more, which events need to be allocated less budget. Especially after each event, it is necessary to re-evaluate the effectiveness between the use of the budget and the results achieved in order to have a plan to adjust the budget source appropriately.\nThe project's measurement KPIs have also been provided by the author group with specific information as well as indicators to evaluate the success of the project, that is, at least 4 Cardano University Clubs will be established in 4 months Uganda's major public university, at least 4 groups will pitch their ideas on Cardano and 500 local social followers on twitter will be realized. These indicators for me are detailed, complete and completely achievable by the author team.\nI know this proposal has been included from fund 8 but has not been funded, in this fund 9, the authors have adjusted, revised and supplemented in more detail for the project, more suitable to the conditions and situation reality in Uganda with specific project success metrics. I will give 4 points for the transparency of the project and hope this will be a project to help deploy Blockchain applications in agricultural production in particular and promote the development of the Ugandan economy in particular shared.\n", "q2r": 4, "assessor": "z_assessor_3281", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12844, "q0": "Good project to embark on, having taught about your country to help improve their technology and blockchain as a whole. Even though I agree that this proposal will be impactful, I think with such a challenge in the country, it will require constant workshops and seminars for the local people and the university students. Training and workshop must be organized every week for a better understanding of how Blockchain and Cardano will impact their lives in the country. The more workshops and seminars are the more students and the local people get interested and are willing to cooperate. Doing this will greatly improve and impact their life.", "q0r": 4, "q1": "Continuous seminars will greatly help the students acquire more. The budget plan is detailed and will help implement this project. Good use of the money and a great team with experience in technology to help in project implementation. The plan provided is conductible as every other given information under this criterion in this proposal makes me convinced that the solution proposed to the identified problem can indeed be implemented.", "q1r": 5, "q2": "Apart from setting up groups on various campuses, and tracking the project, needs an update from an individual on every campus by holding online meetings or through E-mail. This will greatly help track the success and progress of the project.", "q2r": 5, "assessor": "z_assessor_3489", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Build Cardano Study Clubs in the major Ugandan Universities to onboard learning devs on Cardano as a platform for blockchain based projects.", "experience": "Blockchain Project management for 5 years with a tested team of community builders, blockchain local devs and blockchain advocacy in the country with a dream of bridging the technology gap in on the region."}