{"id": 421197, "author": "raz", "title": "Africa Stakepool Alliance", "url": "https://cardano.ideascale.com/a/dtd/421197-48088", "category": 26600, "amount": 36910, "description": "Africa is the world's youngest continent with 60% of the population below 25 years old. A Stakepool Alliance supporting single SPOs in Africa to promote decentralization of the network is lacking.", "f6_no_assessments": 10, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 464, "q0": "This proposer will in the future have a role in creating and promoting independence for African based project from Catalyst. By accompanying this alliance with existing prominent individuals and entities from the Cardano communities it will further help in building their credentials. For one aspect of a SPO, which is a compelling mission to drive delegation, credentials plays a huge role for it provides trust for any potential delegators.\n\nWith a strong and healthy alliance of stake pools across Africa, their combined strength and potential SPO rewards can further fuel African based project without the help from Catalyst. It is a win-win solution that requires patience from the general Cardano ecosystem, for setting up a SPO is no simple task.\n\nWe all know, or for those involved in the larger Cardano community, that single SPO's are suffering and have been continuously closing. The one weapon that promotes Cardano and is the so-called beacon of liberation is slowly falling into a broken promise for it is untrue the unofficial slogan, \"anyone can operate a stake pool\".", "q0r": 5, "q1": "Both the core and support team are all seasoned veterans of the Catalyst community, where each have built their own strong reputation by delivering on their own funded proposals. We have the people behind SAMON SPO, where one of the founders are part of Catalyst Circle. We have Yoram, the individual that has connected Seedstars with Project Catalyst to launch their own funding efforts. We have Evans from Tanzania, a consistent contributor and translator for the African Town Hall.  And so many other reputable and trustworthy individuals.\n\nIn terms of their formulated plan, of that was mentioned, the importance of matchmaking SPO's with potential delegators is what would the core effect that SPO's would really appreciate. To achieve that, the proposers seek to first formulate various best practices for the potential SPO's to follow. Some form of building credentials which indeed is important. For as mentioned, having strong credentials is key to build trust and entice delegation.", "q1r": 5, "q2": "Their KPI's or roadmap is sequential and it builds upon one another and is broken down into monthly targets, 3 month target, 6 month target and even a yearly target. Their intended output is also stated though not ambitious more of an intention. Meaning that there are no definite numbers to be reached. Which in regards towards the end goal of a SPO, which is delegation, target numbers are crucial for a SPO to receive rewards the would need a healthy delegation of 500K to 1 million ADA.\n\nIt would have been more direct if the road map started from a simpler target, such as achieving delegation of 500K and broken down to into various steps to achieve that simpler target. Indeed it would ambitious for this is their first iteration, but it would make sense if the approach were as suggested above.\n\nThough the most important concepts here would be ; importance of Africa as the greater strategy of Cardano, importance of formulating financial independence of the African Cardano community through stake pool operations, importance of experimenting to find the best practices to achieve a high performing SPO. The three mindset above would be the overriding factor of any shortcomings of this proposal.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 2517, "q0": "Given the present time of uncertainty surrounding the regulation concerning Crypto Currencies, the need of the decentralization is being felt by everyone. The role of a stake pool operator in a proof of stake Blockchain like Cardano is most important in this regard. But given the recent trends of ISPOs for securing funding for the projects, the small stake pool operators have been struggling to get enough delegation to be able to produce blocks and hence remain profitable. Many stake pool operators have to stop operating due to becoming unprofitable for not getting enough delegation.\nTo overcome this challenge many small stake pool operator alliances like CSPA( Cardano Single Stake Pool Alliance), Ardana Stake pool alliance etc have been created. It has been seen that due to the collective efforts of all these stake pools, they are able to bring the delegation to these pools and hence helped in the decentralization of the Cardano.\nThe proposal is planning to create such an alliance specific to Africa continent. Given the emphasis put by Cardano on Africa, there is very genuine requirement for such an alliance in the region. This will not only help all these small stake pool operators to work collectively to achieve the decentralization goals of Cardano and remain profitable by collective efforts of marketing but it will also help in adoption of Cardano in the continent. We have seen that stake pool operators are the ambassadors of Cardano and many of them have are conducting great initiatives like providing clean drinking water, tree plantation, providing food and charity to name a few. Creating such a alliance in the Africa will help these small pool operators and create a positive impact regarding Cardano in Africa with their collective efforts. This perfectly aligns with the objectives of the fund challenge. \nOnly concern is that there have already been some proposals funded though Catalyst for creating such alliances in Africa but we are yet to see a large scale alliance seeing the light of the day. But they have mentioned that they will work with some of these previous successful funds to create such an alliance and I am hopeful that we will be able to see it being successful in the near future.\n", "q0r": 4, "q1": "The project is divided into stages spanning to 3 months from September to November and includes working with existing proposals who are working on this kind of initiate, establishing a panel to evaluate such efforts and ultimately enroll large number of stake pools to Africa stake pool alliance. The proposal also includes developing a software tools, dashboards and data management to support all member SPOs. The team consists of around 10 people who are part of Africa Stake pool community and are running their existing stake pools. \nThe team is requesting the budget of $36910 to achieve this initiative and breakup of the cost shows that the amount is reasonable. It is also worth noting that $10000 will be spent to just incentives the SPOs which is very good initiative for bootstrapping this alliance. \nGiven the experience of the team and adequate funding being provided, the proposal will be feasible to implement and will be very true to the objective of the Challenge.\nOnly concern would be the fragmentation of the such efforts as there are already some proposals to create such communities in the African continent. I request the team to bring all such members on board to have a broad and impactful alliance which will be beneficial to all involved and ultimately be very good for Cardano\n", "q1r": 4, "q2": "The project is already developing a website and all the progress of this proposal will be posted regularly on the website. They will also create a google sheet for SPOs to apply to be included in to the alliance and this sheet will be publicly viewable. Given that these are existing stake pool operators and most of them have a good community following, the regular updates regarding this initiative will also be posted to the their communities via their social media channels. All this will make monitoring and auditability of the project very easy. Only concern is that their website is not yet live and in case the website launch is delayed due to some unforeseeable events, it will become hard to monitor the progress. In case they are not able to secure the funding, I would request them to launch their website before the next proposal or at least have some alternate ways to share the progress with the community.\nIn the end, I would like to add that this initiate will be very helpful on all fronts be it the decentralization, adoption of Cardano or the welfare of the local communities in the Africa. I wish the team all the best.\n", "q2r": 4, "assessor": "z_assessor_2312", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3210, "q0": "The proposal brings a lot of information to justify their solution and why it fits in the challenge, and it’s fair to say that it do fits well in the challenge and also promotes the expansion of Cardano, which are positive scores in the proposal. It is also scalable and the proposers already have some plan for it, which is really good to see.  However, they could also have presented information in a more precise way, starting from the problem statement, where the provide a fact (population in Africa is young) that does not necessarily have to do with the lack of SPOs or decentralization. Presenting a strong and clear connection between the problem statement and the solution would improve the proposal and also it’s chance to get more votes. Furthermore, it could also explore some facts about how many active SPOs there are in Africa, how is the “market” for it, how decentralized it is – some basic information that is much more relevant considering the scope of the proposal.", "q0r": 4, "q1": "The proposal does not raise many concerns in terms of its feasibility, as the team has offered evidence of experience, and have also considered a good range of risks that may impact the execution. The budget is also well presented, except for the part of the incentives to be distributed. As this item of the budget responds for about 1/4 of the total, it would be really relevant for the community to understand the details of this incentive distribution – which are also not explained in the other parts of the proposal. All the rest is well presented, therefore I agree that the proposal is feasible. ", "q1r": 4, "q2": "The roadmap is clear and reasonable considering the deliverables on the proposal. There are also metrics related to the proposal that allow the community to audit it – the information will be shared publicly. The proposal also has a good view of success and the outcomes are well established. For all these reasons, a score of 5 in this item is fair.  ", "q2r": 5, "assessor": "z_assessor_2409", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 3402, "q0": "Promote Cardano in Africa is one the objectives of this challenge. An objective that may be met through an initiative like the creation of the Africa stakepool Alliance, which will bring together individual pools, and attract those who intend to stake.\nThis initiative aligns with this challenge and may be scalable as the goal of the Proposers is to expand it to as many pools as possible so they could collaborate and be part of the Alliance\n", "q0r": 5, "q1": "The initiators of this proposal are all involved already in the project Catalyst and some have already been running stakepool, which shows their experience in this, based on which they found the necessity and need of creating an alliance of stakepool.\nThe list and Linkedin and other sources of information about the proposers are provided, except about Mr. Josh F.\nFor the budget, the $6000 allocated to the resources are not detailed in various listed sections.\nThe Africa continent represents a region of the world where such initiative may be succeful since the majority of the population is young, but also where the web.3, blockchain may be a solution to a variety of challenges faced by the African population in different areas (finances, infrastructure, health, education...)\nWorking together through an alliance will increase the potential of the network and would help attracts more people to the ecosystem, and through the social media platform created, be able to onboard new stake pools and individuals ADA holders.\nI find the potentially successful, however it would have been interesting to read a clear promotion strategy plan as that may be a very important stage within the implementation process of this current proposal.\n", "q1r": 4, "q2": "As a new initiative, the proposers team plan to create an Alliance Website, Social media channels, and develop external Communication materials such as an Impact Investor Pack through which the community would follow the progress and assess it. Also, a list of KPI's has been detailed with important elements like the number of stakepool operators, number of new partnerships...", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal. Indeed here is a link to the wada website where you can find a link to Josh's LinkedIn page: https://www.wada.org/about-us/"}, {"id": 5781, "q0": "Hosting a decentralized stake pool owned by the African community is very important for cardano and blockchain expansion, adoption and integration in Africa. This is very crucial for cardano to grow and maintain its dominance on the continent. \nThe proposal is addressing the challenge and have diagnosed an important problem with a well thought out solution - Africa Stake Pool Alliance. ", "q0r": 5, "q1": "Collaboration is important to grow the cardano catalyst ecosystem and with a proposal of this nature, strong partnership is more important than ensure consistency and benefits. The proposal has detailed timelines and activities to be taken. These activities looks well coordinated and has a vision for progress and success.\n\nThe detailed budget shows clear usage of the funds to undertake the implementation of the proposal. The budget is very much reasonable even with a huge proposal. This shows the team has cost effective plans in place for success.\n\nThe team has the experience in the catalyst ecosystem and very much diversified. The team members are strategically distributed to form the alliance for successful implementation for result. ", "q1r": 5, "q2": "The KPIs are realistic and measurable to ease auditing. The drive to have more local stake pools to join the alliance is important and a key indicator to help the community to evaluate the proposal. \n\nThe KPIs also well stated and the expected outcomes can be audited. ", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 7372, "q0": "Geographically, Africa is the second largest continent in the world. In terms of population, Africa has the second largest population in the world. About 1.4 billion people (in 2021). Occupying 17.52% of the world's population, is the youngest continent in the world with 60% of the population under 25 years old. However, there is a lack of a Stakepool Alliance supporting single SPOs in Africa to promote network decentralization. The author has come up with a solution: Develop the African Stakepool Alliance, an open access database and framework for knowledge exchange, facilitation, and the growing impact of SPOs. Proposal impact the challenge, and are described in rich detail. Specific and well explained solutions. Besides, the author has provided a chart of global population distribution, youtube, link profiles, so that we can better understand what is presented. In the last part, the author has recognized the possible risks. At the same time, along with these risks, the author has positive solutions to minimize difficulties and obstacles, to implement the project, to bring the project to success.", "q0r": 5, "q1": "Information provided by the author. The proposed team will work with teams that have received funding from Catalyst and support from the Cardano community: Community project supporting SPOs; Strengthening Stake Pools in Africa. The project will be implemented in 3 months, the work to be done is presented in detail. At the same time, the author has a medium-term vision for 6 months and a long-term vision for 12 months. A very positive thing is that the author has provided KPI here, proving that the author has good competence, knows what he will do, how to achieve success, complete the goals in the project. Besides that. The author also provides links where we can learn more about collaborative teams and how team members manage workloads. The detailed roadmap explained by the author increases the success power of the project. Next is the budget. The proposal requires a budget of $36,910. Less than 10% of total challenge budget. In my opinion, this is a reasonable budget range and well presented. We know each budget, how it will be used, and to what purpose it will be allocated. The budget is clearly presented, increasing the credibility and sustainability of the project. Finally, about the team of team members. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides documents about each member and attaches links so that we know more about the history and experiences of the members to which the proposal is presented. Overall, the plan of the proposal is very good, the budget is transparent and the members are all skilled and experienced, which increases the feasibility of the proposal. Proposal is highly feasible.", "q1r": 5, "q2": "The author provides us with indicators, to measure the successful progress of the project. As the author provided information, M&E involved everyone from the start to the end of the pilot project. Information is publicly accessible, shared via the website and on an open-access, publicly viewable sheet. Number of registrations for the African SPO Alliance, listed in the open access database (google sheet). In my opinion, all information provided is satisfactory and established. We know the goals to be expected and the benefits it will bring to the community and the Cardano ecosystem. At the same time, detailed roadmap, team members have enough skills and experience to successfully complete the project on schedule. The budget is explained transparently, creating favorable conditions for the audit. About the final product is what is expected, the success of the project. The proposal to facilitate the substantial inflow and diversion of ADA, as well as stakeholder funding, outside the former Cardano ecosystem, was proposed by the African Stakepool Alliance. Create change that can spur positive action with the help of a decentralized network. Proposal has good testability.", "q2r": 5, "assessor": "z_assessor_2888", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7738, "q0": "They have the best concept, in my opinion, for this CHALLENGE. They want to create the Africa Stakepool Alliance, an open-access knowledge-sharing platform that will facilitate and boost the impact of mission-driven SPOs operating in Africa and the diaspora.", "q0r": 5, "q1": "I believe this plan will be done successfully since the participants is a 200+ team of active Cardano community members. Single Pool Operators, Cardano AIM team (SDG Proposer Tool, SDG Search Tool). Globally diverse multidisciplinary team of professionals: Catalyst, sustainability and impact research. Fund 5,6,7,8 winners. \n", "q1r": 5, "q2": "The project's general objective and trajectory are pretty clear from the information on their website, which is fairly extensive in its information. The most crucial aspect of this proposal is that it will work to include all interested ecosystem members and SPOs in the group of \"founding members\" in order to create the groundwork and continue progress on a shared goal of creating a better world for everyone, not just those in Africa.", "q2r": 5, "assessor": "z_assessor_2916", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 10305, "q0": "This proposal will facilitate the exchange of information between policymakers and industry experts. purposes of impacting and providing a wide range of services such as education, funding positive social and environmental initiatives, and helping to lift communities from poverty to prosperity through economic security. economic, financial and digital and upskilling.\n Thus perfectly addressing the brief challenge of lobbying for a favorable legislation Stakepool Alliance supporting single SPOs in Africa to promote network decentralization\n. By establishing their organization an open access database and framework for knowledge exchange, facilitate + the growing impact of mission-driven SPOs operating in Africa and communities.\n they will have combined access and shared resources to deliver a clear, coherent and understandable proposal that could become future legislators. The only thing I'm missing is a detailed strategy on how they want to influence policymakers. Therefore, I evaluate the proposal", "q0r": 4, "q1": "The proposed team has all the necessary experience Bridging the gap between the Cardano ecosystem of single miners, the world of impact investing and will be the delegators.\n for successful implementation of this proposal Accelerate progress towards a fair and sustainable world supported by the African Stakepool Alliance.\n. They have already begun the process of achieving status and are working alongside a reputable law firm. An Alliance collaborates, combines, and shares resources to deliver a clear, coherent, and understandable proposition for multi-stakeholder groups. continue this project To drive change where it is needed most and to ensure that finances are optimally used for maximum positive impact, accurate and reliable data is needed to drive make informed decisions\nThe presented timeline seems realistic and logical.\nOur proposed issue seeks to catalyze, nurture and encourage the growing interest among architects and entrepreneurs of the future in blockchain and related technologies in the digital economy. I find the required budget to be reasonable, transparent, correct in terms of expenses, capable and experienced team.", "q1r": 4, "q2": "The Proposal Team provides a roadmap and blueprint for how they aim to deliver the project innovative ways to support the causes and drivers of the mission, and return their investment. through Cardano's innovative Proof of Stake model, will be targeted to participate in the Cardano ecosystem. Budget analysis is sufficient and seems realistic. Their plan to share progress through social media channels and their website will ensure an easy way to check their progress. further transparency,\nThe project evaluation metrics are high, clearly practical and creative, suitable for the challenge and the whole challenge and the whole proposal I hope you good luck", "q2r": 4, "assessor": "z_assessor_3171", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal but it appears that there may be some confusion as you mention about the challenge of lobbying for favourable legislation in your notes for impact, but this proposal is not for such a challenge nor is this challenge even in this Fund 9, hence we haven't outlined our strategy to influence policy makers. For feasability and auditability no reasons are given as to why it isn't a 5 star rating."}, {"id": 11399, "q0": "A stake pool is a reliable server node that holds and maintains the combined stake of various stakeholders in a single entity. Stake pools use the Cardano node to validate how the pool interacts with the network and are responsible for transaction processing and block production. A stake pool operator is assigned responsibility for setting up and keeping stake pool running and monitoring the node.By developing Africa Stakepool Alliance framework for knowledge exchange and open access database facilitating and increasing impact of mission driven SPOs operating in Africa . This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The proposal has a detailed plan with a roadmap including establishment of panel SPOs to verify security, configuration and ensuring candidate stake pools following best practices. Also establishing panel project peers to evaluate and determine proof of soul for community projects and best practices around waliet management and margin allocation between stake pools and projects. The budget is outlined clearly and broken down into idenfiable items. The people working with the project have an active  cardano community member working to drive ecosystem to positive impact process which is very interesting. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by measuring number of new Africa based single Stakepool operators that are created with the help of Africa Stakepool Alliance and number of existing Africa based single Stakepool operators joining the alliance. Catalyst funding and cardano community support proposal has enabled the team to have resources and capacity to direct focused efforts which facilitate significant inflow and redirection of ADA stakeholders were external to cardano ecosystem before preposition of Africa Stakepool Alliance which is a great step to success. All decentralised network impact oriented sectors and SPOs are aligned by common values and connected by their passion. This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 11655, "q0": "The describe proposal has done a great job by placing it in its right challenge, the proposal team effectively addresses the challenge and has the potential of bringing values to communities in African countries and to Cardano ecosystem if they are granted funds to execute their project.\n       The proposal team clearly provide a precise solution to the stated problem by indicating , formalities and development a framework for the African stakepool Alliance with the support of Catalyst proposal and Cardano community, developing the African stakepool Alliance will enable,equip and empower population across the world youngest and 2nd most populated continent so as The cremation and formalization of this framework and Alliance will open up New path for stakepool and impact investers from the world largest monthly if they are granted funds to execute their project and I strongly believe they will do a great job should they be funded.\n   The proposal team also capture some important key metrics measures under the compaign brief indicating the benefits it will bring to communities in African countries and to Cardano ecosystem if they are funded and I strongly believe they will do a great job should they be funded.", "q0r": 5, "q1": "The proposer is able to provide details and relevant links to the team members who will help in the execution of the project which is recommendeble for them and I strongly believe they have the Desired Skills and experience to carry out their project should they be funded\n        Moreover the proposal team has done well by outlining the budget breakdown funds to how it will be used which I strongly believe is commendable for them.\n      To add to these the proposal team is able to identify some risk challenge that could prevent them from executing their project such as;  Working at this project managing and existing workload, working in a decentralized team, working in a space with legal and financial uncertainty and currency exchange volatility , and are able to navigate solution to overcome the risk challenge should they be granted funds to execute their project which I strongly believe they will do a great job should they be funded.\n      Furthermore the proposal team is able to provide details plan including timeline and key milestones such as, the deliverables and KPIs like, Onboarding process how to guide A-Z African, Telegram managed channel for African SPOs and community support, Open access database of African SPOs/African based and these supporting African with mission drive care to deliver their project should they be granted funds to execute their project and I strongly believe they will do a wonderful job if they are funded.", "q1r": 5, "q2": "The proposal team is able to describe their project progress and how it will measure to the Cardano ecosystem through Participation monitory and evaluation from bringing to the end of the pinat project,they will measure and have signs ups using Google form/shalts and have publicly via the website, Number of signs ups that meet our creating for the African SPO Alliance to become listed in their open access database should they be funded to execute their project.\n      Furthermore, the proposal is able to indicate how their success for their project will look like such as the direst focused effacts that facilities a significant inflow and redirection of Ada which is now flowing forward and been stoked with single pool operating in Africa and part of the world that were originally marketed as the key beneficial of Cardano ambition and grand vision of Charles Hoskinson is a dairy reality for million more people across Africa and the diaspora should they be funded to execute their project and I strongly believe they will do a great job if they are funded.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Develop the Africa Stakepool Alliance, open access database and framework for knowledge exchange, facilitating + increasing impact of mission driven SPOs operating in Africa and the diaspora.", "experience": "200+ team of active Cardano community members. Single Pool Operators, Cardano AIM team (SDG Proposer Tool, SDG Search Tool). Globally diverse multidisciplinary team of professionals: Catalyst, sustainability and impact research. Fund 5,6,7,8 winners. "}