{"id": 421169, "author": "innocentnor", "title": "Opportunity Summit", "url": "https://cardano.ideascale.com/a/dtd/421169-48088", "category": 26600, "amount": 3950, "description": "Tertiary students in Ghana remain unware of the potential and opportunities of blockchain technology. Therefore, how can we educate and onboard them into the Cardano ecosystem?", "f6_no_assessments": 11, "f6_rating": 4.7272727272727275, "videos": [], "media": [], "f6_assessments": [{"id": 5780, "q0": "The proposal is addressing the objectives of the challenge to scale up, create awareness and adoption of cardano in Africa. With a clear target group of tertiary students, they are the young elites and very curious to learn, embrace and participate in new ideas that has the potential create opportunities for them. The tertiary institutions are where computer science and IT are taught and this could be possible to onboard developers, cryptocurrency analysts, proposers, stakcepool operators. \n\nThe proposal has made it clear to educate tertiary students through collaboration and partnerships to organize a mammoth gathering to onboard into the catalyst ecosystem.", "q0r": 5, "q1": "The team has the experience to mobilize students and have consistently done that. With this experience the team would be able to put together this events successfully. The team lead is also familiar with catalyst activities and knows how important education programs are to the community for on boarding, adoption and development of Dapps on the cardano blockchain. \nThe team has demonstrated and have put together a working plan with schedules that are detailed and simplified for implementation. The timelines have the details of each activity for before, during and after the event to deepen the impact of the outreach. \n\nThe budget is very simple and detailed, showing clear disbursement of funds for a successful implementation of the proposal. ", "q1r": 5, "q2": "The proposal has KPIs that are measurable to evaluate the progress and success of the proposal. These metrics as shown with outcomes including 150 participants and 50 active YouTube followers are realities and achievable. This would make auditing quite simple for the community. The team also made it known that they will work on feedbacks after the first event to improve in the next events and that could mean the events could attract more attendees to learn to expand the catalyst community. The community will be able to audit for success and failure in each event. ", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6137, "q0": "The Republic of Ghana is a country in West Africa. Population 31.07 million people (in 2020). 53.0% of the population (in 2019) uses the internet. However, University students in Ghana are still not aware of the potential and opportunities of Blockchain technology. Therefore, suggest the idea of ​​educating them and bringing them into the Cardano ecosystem? Organize educational events between universities in Ghana. The proposal is good and completely in line with the goal of the challenge. Here, the goal of the proposal is to educate and introduce Ghanaian university students into the Cardano ecosystem, spreading knowledge about Cardano to a wide audience, more specifically Ghanaian university students. I see this as a positive. The proponent, in addition to explaining what needs to be done, provides a lot of detail on what will be done. The proposal introduced, described the project and, most specifically, the Implementation Strategy: The plan was to organize two groups of events, one in person and one online. In addition, the proposed team recognized the main challenges as difficulty in marketing the program to our target audience to allow more people to learn about blockchain technology. Second: the general lack of motivation for students to participate in events can be another challenge. At the same time, along with those challenges, the team has specific solutions to minimize the difficulties that the proposal will face when it is implemented.", "q0r": 5, "q1": "The proposal includes a detailed roadmap with a timetable for each milestone. The project timeline is analyzed in 4 phases and post-event... The proposal provided very detailed information about when the project will be implemented: Phase 1: Planning, team & tooling phase - 1 week after funding (September). Phase 2: after 2 weeks of funding (September). Phase 3: Marketing and Advertising - 3 weeks (September to October). Phase 4 (October). Post-event - 1 week. and finally the Second Campus Event – ​​Last Week in November. At the same time, the tasks are arranged and explained in detail. We know what work will be done to complete the project. Along with those jobs are the members who are full of skills, experience and have written presentations about each member. We know their identities, roles and capabilities. However, it would be nice to suggest to provide some specific links so that we can learn more about their background, work history, increase confidence in the team's abilities, for what the team has presented. about them. Finally, the budget. The proposal requires $3,950. This is a pretty low budget for the team's proposal. In my opinion, the team needs more budget so that the proposal can be implemented and completed in a sustainable way. The budgets allocated to each job are explained reasonably and accurately. Overall, we know what will be done, the budget is transparent and the team is skilled and experienced, all of which will be put together to complete the project well.", "q1r": 5, "q2": "The proposal provides us with a lot of milestones: Number of attendees, students on board, newly created cardano wallet accounts, etc. At the same time, the proposal team also provides many key metrics, making it easy to We can easily, measure the progress of the project. On the other hand, a very positive thing is, Create a cardano social media community (WhatsApp, Telegram and YouTube) with 50 active followers, and will make this report available to cardano social media channels. In addition, the team will also make the report available on official social media channels and the proposed team's online pages. The proposal is new, but from the plan board shows the expertise and active effort of the proposed team. The detailed roadmap according to each milestone helps investors to easily check the successful progress of the project. Besides, the team with professional skills and transparent detailed budget in the proposal strengthens confidence in the success of the project. In other words, it is a good audit ability, providing enough information to monitor the project seriously and continuously.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7393, "q0": "This proposal matches very well with the goals of the challenge which focuses on mass adoption of cardano in Africa. The idea here is a brilliant one which aims at educating and onboarding tertiary students into the cardano ecosystem. The plan is to organize educational outreach events which will serve as a platform for students to be educated on the opportunities available in the cardano ecosystem,this idea to me ,is a way of creating awareness and drawing more youths in Africa (Ghana) into the cardano community which solves the problem of the challenge. These events will also help youths identify and explore opportunities in the cardano blockchain which in the long run will help curb the unemployment rates in Africa especially in Ghana where graduate unemployment is very high. This proposal has four main goals it hopes to achieve and I believe these goals dialogue very well with the key metrics of the challenge. I stongly believe if this project is funded,at the end of it all,we get to have new members in catalyst as PAs,VPAs,voters and also have students putting their innovative ideas into proposals to seek for funding to solve problems in their various communities in Africa. This project will go a long way to spread cardano in Africa and as such,this proposal addresses the challenge effectively.", "q0r": 5, "q1": "From the description presented to us in the proposal,I believe the team has some level of experience and are very much familiar with the cardano community especially the author. Despite the fact that,the author provided us a link to their organization (young Africans for opportunities) and their previous opportunity summit hosted,it would have been more appropriate if the author provided us with more personal links like their emails, LinkedIns, Facebook, telegram and twitter handles for us to get to know them more intimately and personally.\nThe budget is quite rational to me,it makes sense to me,it is very clear to us what goods and services they author will be needing and intends to purchase.\nLastly, the timeline in delivering this project is well planned and the author gave us specific dates. The timeline is divided into phases and under each phase,we know what activities will take place and in which month they will take place. I believe there is clarity in the expression of the timeline and I think this proposal is feasible enough.", "q1r": 4, "q2": "This part of the proposal is outright. The proposer provided us with enough information to assess it's auditability. The author stated that,reports of the project will be made available to the community through the cardano social media platforms ( telegram and discord) and I am sure this is a direct way for the community to closely monitor the progress of this project. The key metrics are clearly stated and are measurable,they are not soo exaggerating and I believe they are achievable. The key performance indicators stated in the proposal are very clear ways of measuring the success of this project and in essence, this proposal can very much be audited.", "q2r": 4, "assessor": "z_assessor_2890", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7645, "q0": "The problem described in this proposal is closely aligned with the challenge.\nThe team has done a great job by putting the proposal at the right challenge. The solution provided to the challenge is to organize educational events across universities in Ghana with the aim of educating and onboarding tertiary students into the cardano ecosystem. Also, the key metrics and goals of the proposal align with the outlined challenge. And, the proposal is able to scale to address future challenges which involves organizing several outreach events to establish an active Cardano community in the various Universities in Ghana. The commencement of this long-term goal will focus on the student communities in the country, with the University of Professional Studies being their starting point.\nAnd finally, the proposal clearly articulates a plan for the project's future sustainability. ", "q0r": 5, "q1": "The proposer has provided relevant links to members of the team who will help in the  execution of the project. Moreover, the proposer and team from the links provided have the requisite skills and experience to be able to execute the project should they be funded and I think this is commendable.\nThe proposer knows, in an identifiable manner, the type and number of team members required to implement the proposal which is a three member team with facilitators. \nThe budget is outlined clearly and broken down into identifiable items. The budget is reasonable to achieve the set goals if they are funded.\nThe proposal offers a realistic timetable to complete the work. The proposal provides a sensible plan for implementation of the project considering every risks with mitigating solutions to each risks which is astute. ", "q1r": 4, "q2": "The proposers will leverage on the expertise of the Cardano community members in the blockchain space through partnership with community members for the success of the project. Moreover, Milestone to be looked at involves; the number of people who attend the event, the number of students on boarded onto the Cardano ecosystem, the number of students willing to be campus representatives for the newly constituted Cardano community amongst others. \nThe Metrics includes; at least 100 attendees. at least 50 active people on boarded into the Cardano community, create Cardano wallet accounts for at least 50 students, and create a Cardano social media community WhatsApp, Telegram and YouTube with 50 active followers etc. \nAnd, through the creation of these social media groups there will be an accessible public channel for delivering regular updates to the community for auditing progress.\n\n·      ", "q2r": 5, "assessor": "z_assessor_2908", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7838, "q0": "The aim of the Proposer is to create awareness of the potential and opportunities of blockchain technology across Universities in Ghana, to educate and onboard Tertiary students .\nIn achieving this goal, the Proposer intended to introduce educational outreach programmes that will provide the platform to educate students communities in Ghana on blockchain technology and to facilitate Onboarding of students. \nThis will provide the foundation to scale up growth of Cardano in Africa, making Cardano a formidable force in in the blockchain space in Africa. \nConsidering the large population of Universities students in Ghana, with UPSA alone of about 14,000 students, the Proposer intend to partner with Young Africa for Opportunity (YAFO) , a community with vast experience in the Blockchain Ecosystem to introduce quarterly programme dubbed, Opportunity summit , aiming to enable young Africans especially, students and entrepreneurs to identify and explore the opportunities available to them in the advent of the adoption of blockchain in various industries.\nThis programme will again enable Africans to gain much attention, huge potential and significant impact through the adoption of Cardano blockchain. \nMain challenges such as difficulties in  sending messages across to targeted audiences and lack of general incentives for massive participation by students. \nBase on these facts provided, I believe strongly the proposal addresses the Challenge. ", "q0r": 5, "q1": "The Proposer plan is to host two sets of events, in person event and on-line event.  These two main events are planned to be rolled out in five phases and details of each phase is clearly presented. \nTotal budget of $3,950 proposed has been broken down into details for easy assessibility and justification..\n\nDetailed profiles of the two member Team (Barbra Ofosu & Innocent Norvinu) to bring to the success of the project are stated showcasing their level of knowledge and experiences. Am by this, convince that, the implementation of the proposal is very high.", "q1r": 5, "q2": "Clearly defined metrics to track progress of project are mentioned and to list few are, atleast , 50 onboard students out of 100 attendees,  50 yoroi new accounts to be opened,  proper records of all events on reliable social media like Youtube, telegram etc.\nWhat we should expect or look out for as sucess were also stated.\nFor instance,  more PA and Developers will be onboarded into Cardano blockchain,  more innovative ideas to contribute value to Cardano etc.\nInformation provided denotes to me, transparency and accountability will be demonstrated.\n", "q2r": 5, "assessor": "z_assessor_2927", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8922, "q0": "Still there is lack of students around the world who are unaware of cardano eco system, and even people are afraid to use the cardao Wallets , this not only affects cardano eco system it also hindrance the students talent, where the students idea to convert it into a project , will be remained as idea forever. Hence to overcome such situation in Ghana,\nThe idea of conducting educational events across universities in Ghana will be of great help ,where proposer wants to discuss with universities students related to History of money and blockchain, Cardano blockchain, Creation of Cardano wallet, Cardano staking\nCardano project catalyst and the various roles. So this will surely help university students of Ghana to participate in block chain development project. Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Conducting a summit will never be difficult task in colleges , where it just needs one good speaker who can attract all the audiences and engage them to his idea , so this task can be taken by proposer himself as he has  15 years experience in educating students through seminars and symposium, nonprofit management, research and Marketing, the proposer has even proven experience where he has been Fund 7 and Fund 8 Community Advisors and proposer with one funded project. So with the immense experience of the proposer and topics to cover ready  plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has described the proposed solution in very detailed manner and also has described which are the main topics that will be discussed in the seminar to make cardano block chain more efficient in student's mind, the audit has provided clear explanation on how the solution provided effectively tackles the challenge and how can the student's of Ghana can utilize the opportunities provided by block chain.\nThe audit has presented well structured timeline to complete the project and it also  contains detailed mannered budget breaking idea to complete the project by using funds more efficiently. Hence with the efficient key metrics and milestone provided the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 11131, "q0": "It is an undeniable fact that Africa presents itself as the next fertile grounds for the growth and expansion of the blockchain technology which Cardano plays an active role in and equally undeniable that a greater percentage of the populace have little knowledge of the power of Blockchain and how it can be harnessed to address the many challenges the continent faces. This proposal is well crafted to ensure, especially, the young population is rolled unto the technology with Cardano as the platform which goes further to expand the Cardano ecosystem in Africa and so I do agree that this proposal fits perfectly in this challeng.", "q0r": 5, "q1": "Having onboard the team a member who has already presented a proposal that has been funded, its prudent to say that his experience alongside the other team member would together make the implementation of the proposal feasible. There are also clearly defined timelines for proposal implementation and also stated budgetary allocations.\n\n However, more light could have been thrown on the handling of the implementation of the previous proposal of the team member who acquired project funding in Fund 8 as this would give more weight to their ability on this proposal. \n\nAlso, the proposal fails to address the budget breakdown of the second phase of implementation as it would definitely require some pockets if expenses even though it is an online session. A further breakdown on how much of the $500 for Team Cost would go into materials, logistics, coordinates, and organization, would have further given clarity on why such items must be funded and as to if their individual costs are viable for funding. \n\nIn all, I neither agree nor disagree that the implementation likelihood has been spelt out enough to make it a success.", "q1r": 3, "q2": "The proposal milestones and key metrics are clearly spelt out and presents a clear path as to how success and progress of the proposal can be measured if funded. Also, the proposal throws light on future engagements of the ideas presented and the scalability of the success of this proposal if funded.", "q2r": 5, "assessor": "z_assessor_3224", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11682, "q0": "\nThe proposer has done a great work. The proposal clearly addresses the challenge. The proposer has been able to identify a problem and has provided concise solutions to the problem. Many tertiary students are actually unaware of the blockchain technology and its opportunities and hence are not onboarded and so the proposer had outlined how the intend to organise summits in various universities in Ghana dubbed opportunity summit with the University for professional studies which has approximately a population of 14000 and creating awareness about the blockchain technology and getting them on boarded. This clearly articulates the mass benefits this would bring to the cardano ecosystem as many would be onboarded on the cardano community and the blockchain technology. Furthermore The key metrics of this particular proposal such as more members onboarded, creation of new wallets, and others stated by the proposer outlines well with the challenge settings which I believe if founded would be of great impact to the cardano ecosystem. Future challenges such unemployment as been addressed by the proposal as the cardano blockchain presents countless opportunities where one can work without depending on government work. I therefore commedia the funding of this great project for the great future of cardano in Africa. ", "q0r": 5, "q1": "The main goal of the project is promote cardano adoption in Africa which is aligned with the key metrics under the campaign brief.  The proposer has also provided a detailed plan on how the project would be carried out and has divided it into portions achievable which the trust the project will not fail if implemented.  Experiences have also be outlined to make the proposal a success if funded such face to face education and also online tuition adopting many to the cardano ecosystem.  A proposal would fail if a budget has not been laid out for it but in this case the proposer has done so well by outlining comprehensively  the budget needed for the program and a breakdown of cost into fragments reasonable to be attained. Furthermore the proposer has also carefully selected team members  Innocent Norvinu who is a resource person in terms of the financial world and can manage funds so the project doesn't fail. Other well resource persons were taken for the interest of this project. A time line has been attached to the project for the accomplishment of the project for the growth and adoption of cardano blockchain in Ghana and to the other ends of the world. ", "q1r": 5, "q2": "The proposer has provided indecies to measure the success of the project of which the proposer has done a great work by providing numerical figures under the key metrics to be used in measuring success of which I trust with this information provided,  the project can be successfully audited. How success gor the project will look like has also been outlined which aligns accurately to the key goal of this work  , creating awareness of cardano blockchain technology its potentials and opportunities in Ghana and Africa in general. With this information provided, I believe the project can be audited and should be funded fully. ", "q2r": 5, "assessor": "z_assessor_3265", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 12434, "q0": "The proposal addresses clearly the challenges which it intended to solve. Over 99.4% of graduates are not even aware of the existence of Blockchain technology, it importance, and how best to use as a market tool. The creation of awareness on Cardano blockchain technology, its potentials and opportunities among student and the working populace is the best way to go. Students are best fit to propagate the cardano blockchain technology to world. After completion of school, they get into the working community and teaches their fellow colleagues who have no or little knowledge on cardano blockchain technology. Also, as stated, the summit will also integrate the students into the blockchain community thereby expanding the community. The inclusion of establishing an active Cardano community in most of the universities in Ghana is a win/win for the Cardano community since it will be part and parcel of every student who get admitted into these university to understand what it really entails. ", "q0r": 5, "q1": "Per the resume and experience of the planners and how best they were able to secure a previous fund, I see this to be a continuation and will be best if granted the opportunity once again to continue a good work. Also, since the partners involve in this project completed different institution, accessing space in the university will not be a problem since they already has a good rapport. The plan of executing the project is on point, the goal which is to boost the presence of the Cardano blockchain in Africa, facilitate and promote more innovative ideas in the Cardano ecosystem to enable the adoption of blockchain in Ghana through diversification has been well outlined. The clarification of details show how serious they are with their work and if been given the nod will do a great service to the Cardano community. ", "q1r": 5, "q2": "The project is a gold standard in regards to audibility. I think the team were transparent and well organized. The audibility and clarity of the proposal shows how brave and knowledgeable they are in executing the task if the mandate is given\nSince this proposal has both a short and long term vision to achieve, the progress will be huge and can be monitored on the Cardano community. The creation of awareness on the Cardano blockchain technology is the best way to go in my opinion. \n", "q2r": 5, "assessor": "z_assessor_3411", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13575, "q0": "The proposer has done a very good job with the proposal. To ensure the the progress of the spread and colonization of cardano blockchain within Africa fully, educating tertiary students to spread awareness is required. This proposal resonate with the challenge setting as educational events dubbed with opportunity summit are organized across tertiary institutions in Ghana about the blockchain to increase the rate of adoption. The proposal plan on reaching out to businesses, entrepreneurs and individuals , introducing more PAs, vPAs etc to ensure the projects sustainability. The metrics and the key of the proposal align with the outlined challenge setting under \"grow Africa, grow cardano \" .", "q0r": 5, "q1": "The proposal has a clearly defined plan to be implemented in September. The budget of the proposal is reasonable to achieve the set goals and it is also broken down into identifiable resources and logistics. The proposer and his team has the experience and relevant skills required to implement this proposal however there are absence of links to justify the involvement of the proposer with wada. The proposal describe accurately the type and the number of team members to undertake the project successfully. ", "q1r": 4, "q2": "The success of the proposal will be measured with the number of of attendees,  number of students on boarded into cardano etc . There is also a report and feedback given to the community to assess and track the progress of the project. The proposal will be onboarding more students, businessmen and women, developers etc to contribute to the success of the proposal. The proposal is very well thought however without recording the events to be posted online to arouse the interest of netizens to engage in cardano blockchain will produce a small scale success. The information provided is sufficient to audit the progress and the success of the proposal. ", "q2r": 4, "assessor": "z_assessor_3696", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 13840, "q0": "Designing and hosting physical and online venues specially targeted to tertiary and university students might be the very first successful step in order to outreach and spread awareness towards Cardano blockchain technology in Ghanian student communities. Establishing Cardano representatives from the personal events will guarantee the outreach strategy keeps and enhances its growth. The educational asset of this proposal is to highlight. Getting Ghanian students to know basic Cardano and blockchain technology and Catalyst funding opportunities will give them a powerful tool and might inspire them into designing their own proposals and engage them into entrepreneurism. As Ghana suffers from big unempleyment hurdles this kind can help into the development of communities and be a real life changer. Summits and events this proposal aims to fund are certainly lined with Cardano Catalyst needs and challenges and will effectively address them.", "q0r": 5, "q1": "Considering this proposal is the continuation of their already funded and successful proposal in Fund 8 and that team members already know Catalyst dynamics and timelines, it is highly likely this proposal will be implemented successfully. It is to highlight this team engaging with the long-term challenges towards African and Cardano challenges and needs. Having Wada members in their team is a guarantee of their transparency and commitment. Key milestones and timelines are clear and detailed. Budget breakdown is consistent. Having a marketing strategy ensures events will achieve their outreach goal. ", "q1r": 4, "q2": "Knowing that this team is already well acquainted with Catalyst dynamics and rules and that they have already set up communication channels with the whole of the community is a guarantee that the auditability process will be easy and simple. Key numbers they presented for a sufficient audition might not be enough to audit the progress and the success of the proposal. It might be also interesting for a correct audition to face the process with some quality feedback surveys and one to one interviews with Ghanian students. In order for the community to get to know Ghanian students' impressions, challenges and needs, this kind of quality data might be much more profitable than just plain numbers. To achieve our outreach strategy as a community we need to address African hurdles in getting to know blockchain technology and how can we overcome them.", "q2r": 4, "assessor": "z_assessor_3833", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Organize educational events across universities in Ghana, dubbed Opportunity summit with the aim of educating and onboarding tertiary students into the cardano ecosystem", "experience": "Combined 15 years experience in educating students through seminars and symposium, nonprofit management, research and Marketing. And with partnership with Young Africans for Opportunities—YAFO.\nFund 7 and Fund 8 Community Advisors and proposer with one funded project."}