{"id": 421944, "author": "ebuckle", "title": "Building resilient youth", "url": "https://cardano.ideascale.com/a/dtd/421944-48088", "category": 26600, "amount": 20000, "description": "Youth leaders are not equipped with the tools to deal with the complexity of climate change, emerging economies, and endemic barriers.", "f6_no_assessments": 9, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 2436, "q0": "Taking into account the objective of the proposal to create a platform that connects young leaders to people with relevant knowledge, in order to create solutions that involve blockchain, we believe that the project fits the challenge properly. However, we also see that the project's objectives are quite ambitious, given the broad scope of action that it plans to achieve. With this, the question arises whether it will be able to be well established and achieve the desired visibility. We have that maybe the budget being requested is not enough.", "q0r": 3, "q1": "We were able to find well-structured actions in the project timeline, with simpler activities that gradually evolve. It is also interesting to note how marketing and results calculation actions are considered over time. We also see that the professionals involved have good technical skills, which converge with the objectives of the project. In addition, we noticed that their CVs were made available so that the experiences could be proven. But as mentioned before, it seems the amount of capital required would not be enough to establish such a platform with the desired degree of connection. In fact, the total amount described in the budget details differs from the one initially indicated, here we have $29,000 and $20,000 was previously requested. A possible suggestion would be to readjust the momentary objectives of the project to, in principle, aim at a lower impact with a greater structuring of concepts and ideas.", "q1r": 3, "q2": "Regarding the ways chosen for the project's evolution to be observed, relevant parameters were indicated, which help to measure the number of projects and people impacted. Which, consequently, helps us to understand the scope of action of this proposal. However, as considerable amplitude is expected, a greater indication, in the perception of success of this proposal, of numerical targets would be nice. In this context, it could be defined, for example, an expected number of projects that benefited from mentorships and established connections.", "q2r": 3, "assessor": "z_assessor_2306", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4065, "q0": "This is a nice and well-intentioned proposal but it has weak ties to Cardano. It seems the team is trying to use Project Catalyst to leverage an already existing project that originally had nothing to do with Cardano by adding some slight touches of Cardano in the proposal. Indeed, there are some intersections in the subjects discussed such as impact investing and sustainability, but they don't go much beyond that. The goals of the campaign are to spread knowledge and adoption of Cardano in Africa, to increase the number of African projects seeded, to increase the percentage of contribution in the project catalyst coming from Africa-based members and to promote innovations that will tackle unique challenges faced by the continent. On the other hand, the main goal of the team's plan is to organize a peer-to-peer coaching to provide global connections and advice to the youth leaders, which not necessarily involve Cardano and not necessarily addresses any of the goals previously mentioned.", "q0r": 2, "q1": "The team described in composed of Antoinette, Bianca and Elise. All of the three are co-founders of SHE Changes Climate and have relevant experiences which are supported by evidence provided in the LinkedIn links in the proposal. The budget is broken down into reasonable and identifiable items and the amounts requested for each are sensible given the project duration and number of people involved. However, the total amount in the budget don't match with the requested funds in the beginning of the proposal. Also, the timetable described is realistic and the total duration estimated of the project is six months. Additionally, the plan described is sensible and conductible, they explain what they will be doing every month or so. Finally, the proposer has discussed three major risks the project faces and also how they intend to mitigate them. They are the risk of not delivering what they have promised, the risk of the targeted people not wanting to mentor the youth and the risk of not reaching the desired outcome. For the last one, for example, their solution is to build a network of supportive, innovative climate solutions.", "q1r": 4, "q2": "The team didn't highlight the milestones of each stage of the plan, but have provided good explanations of what will be done at each phase. It's not a big fault but as a suggestion to enhance the proposal I would add explicit milestones in the plan. For instance, in the October phase they could have defined a milestone of reaching one million people through social media summing all of their platforms, and the announcement of at least three relevant high-level speakers. Additionally, in the metrics they could have defined more precise KPIs. They used local impact and local partnerships formed as suggested in the campaign, but the impact referred in this case is user activity in the Cardano ecosystem which is something the proposal neglects. The same goes for local partnership, they don't really explain what Cardano-related partnerships they could foment. Finally, they have not clearly provided a public channel to update the community about their progress.", "q2r": 2, "assessor": "z_assessor_2513", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1}, {"id": 5248, "q0": "This proposal is quite meaningful when you want to educate young people about climate change, and emerging economies, and endemic barriers. These are urgent problems of society and need a lot of young people to join hands to solve these problems.\n\nHowever, this is a challenge called \"Grow Africa, Grow Cardano\" with the purpose of developing the Cardano community in Africa, but Cardano's role in your proposal is quite obscure. Generally described as having the participation of Cardano leaders to connect between African youth and crypto, specifically those Cardano leaders are Yoram Ben-Zvi, Dzhuliana Nikolova, and Mercy A. Fordwoo.\n\nIn order for your proposal can create more impact and be able to \"Go Cardano\", you need to clearly state what the activities with Cardano Leaders, what topics, and who is the specific audience, for example, Information technology students can be potential entrepreneurs using Cardano's technology to solve problems such as climate change, emerging economies, and endemic barriers.", "q0r": 4, "q1": "Your proposal is expected to be implemented within 06 months, but you don't put the year, but I think you want to mention the time from Jun-Dec 2022. But this time is still not convincing because The evaluation time for this proposal is already July 2022 and if your proposal is funded, it will also be the end of Aug 2022. So your way of allocating time for this project in my opinion is not appropriate and convincing.\n\nThe implementation plan of this proposal is still quite general. In order for the plan to be trackable and controllable, it is necessary to describe in more detail the work items to be done, the time required to complete them, and the results needed to measure each of those tasks . The above things have not been mentioned in the proposal, so it is difficult to assess whether the project can be implemented in practice or not.\n\nYour proposed budget for this project is $20,000, but in the detailed budget description, it is $29,000. Therefore, it is difficult to assess whether your budget figure is reasonable or not, even though the details of each type of cost by each work item has been mentioned in the proposal.\n\nYour group has all 03 members involved, described as having a lot of experience in social activities such as climate change and Sustainability. The above experience is relevant for this project. However, you need to provide more information about Cardano leaders such as Yoram Ben-Zvi, Dzhuliana Nikolova, and Mercy A. Fordwoo, to make sure these people really understand Cardano and have a good reputation in the community.", "q1r": 3, "q2": "Your proposal is specialized in education and communication so the performance indicators will be mainly related to this area, but with the indicators you are referring to, it needs to be more specific, and measurable. For example, Number of Youth connected with leaders in relevant fields, or Number of Networking sessions,...\n\nTo evaluate the success of this proposal, you have said that it will reach over 154 million reach across platforms, which is a rather large number compared to the scale of this project. And because your implementation plan is not written in detail, it is difficult for the community to assess whether the above number is reasonable or not.", "q2r": 3, "assessor": "z_assessor_2678", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6146, "q0": "Africa is the second most populous and second largest continent in the world. With 1.3 billion people (in 2018, about 17% of the world population). The climate is equatorial, tropical wet, tropical monsoon, semi-arid climate (semi-desert and steppe), desert climate (super-arid and arid), and highland subtropical climate . Youth leaders are not equipped with the tools to deal with the complexities of climate change, emerging economies and endemic barriers. This proposal will host peer coaching to provide global connections, tools and advice. Cardano leaders have an important role to play in the relationship between African youth and crypto. Proposal to affect consciousness. Ecosystem not only aims to promote technological leap, but also to establish other positive impacts with this planet, such as: environment, education, economy, gender equality, etc. .. all for the sake of people, communities, developed societies and developed ecosystems. I think the proposal was detailed and richly described. Impact on challenge. Proposal to affect consciousness. Besides, the author of the proposal also recognizes the possible risks. At the same time, there are solutions to minimize risks when the proposal is implemented.", "q0r": 5, "q1": "Regarding the plan of the proposal, the author provides us with background information to evaluate this section. The first is about the route. The proponent states the goals to be achieved in 6 months. To build relationships and implement strategies to help mentor sustainability. There is a problem here, the author provides information is planning for 6 months.  The roadmap in each month is still presented by the author very specifically for each job to be done. We know what work will be done to get to the end result of the project. Besides that. The group presented about the team members very professionally. We know the members are all people with the right skills and experience to do the work on the project. Also, the author provides written representations of each member and attaches a link to tell us more about the history and experiences of the members the proposal presents. Increase confidence in the success of the project. Finally, the cost is explained in detail by the author. The proposal requires a $20,000 budget. With the following objectives: Efforts to build long-term community; The preparation team for the closing meeting, and some other work… was explained in detail about each budget for each task to be performed in the project. This is a pretty reasonable budget. However, for the explanation of the budgets in each job, it was $29,000. So, what is the exact budget of the proposal. As far as the explanation is exactly 29,000 dollars. There is an important question here, is the required budget and the explanation are completely mismatched? The budget is one of the central issues of the proposal when it is funded, demonstrating transparency for the proposal. Overall, the proposal has a very good plan, detailed roadmap, transparent budget and experienced team, which increases the probability of the project's success. Dueon and the required budget and non-consensus explanation, I lack confidence in the feasibility of this project.", "q1r": 3, "q2": "The team proposes to provide us with the Delivered Product, the process will be public and the community has high visibility of the results. And Key Indicators so we can easily measure the successful progress of the project. About the end product is what is expected, is the success of the project. However, we lack precise identification, the requested budget and the explanation are not matched, we are concerned for the audit to be intermittent and transparent.", "q2r": 3, "assessor": "z_assessor_2786", "no_vca": 5, "ne": 2, "ng": 1, "nfo": 2, "vca_o": 1}, {"id": 6938, "q0": "This proposal has a high probability of success and impact because mentorship especially for students who have the energy to make a positive change in the world like those in Africa. There are so many amazing driven and passionate people there and this team has secured partnership and mentorship themselves from people in the community like Yoram, Mercy, and Dhzuliana who are known Catalyst members and contributors. I am extremely glad that they were able to get them onboard because with their advice and focus on impact and driving change this proposal is more likely to succeed than not. I like how they already have hubs of students across South Africa and won awards for their work indicating that they already have demonstrated impact. For the budget the impact will be massive especially when executed with prudence and efficiency. As a community we should help them and also keep them honest about this proposals impact. Good luck team!", "q0r": 5, "q1": "SHE Changes Climate is a team of women who have done this type of work for a while and are truly passionate about helping youth across Africa to drive change towards a better future and towards positive climate actions. One is a tedX speaker and all are local to the communities they serve. This is extremely important because success rate is double likely when the founders are close to the users and when the founders and leaders themselves know the challenges first hand. The plan and budget are clear and broken down to individual months and items which makes me believe the team has put some decent thought into planning this out. The team itself has a lot of experience with NGOs and seem to have partnerships in place to help them make this a successful proposal. Beyond that there isn't much to smirk at.", "q1r": 5, "q2": "The auditability of the project is planned but not as clear and transparent as it could be. The proposer mentions \"Over 154 million reach across platforms\nIn an event last year we received a vast about of media coverage from The BBC (Newsnight, Women’s Hour), FT, Forbes, Vogue, Marie-Claire, and many other global media outlets. This year we will build the same connections and much more.\" Yet their social networks are not heavily followed including their YouTube channel that at the time of this review have less than 200 subscribers and the video although very nice had only 1k views. I believe this is a hyped up number of ghost views which I would not advertise without solid conversion rates OR that indeed the team has manages the achieve this number is impressions but the conversion to subscriptions or community membership is miniscule meaning the marketing although good at brining awareness doesn't actually resolve into meaningful relationships and impact for the business, project, and for the people they are trying to help. This can be overcome by focusing on true bottoms up approach instead of going to the BBCs of the world and splatter and market a product that doesn't stick. My suggestion is as students and success stories emerge to really tell the story of the people who were helped, people naturally gravitate towards success. Other metrics are fine. I wish the proposers added more options for publishing the metrics and milestones to the community proactively instead of just hey here is what we will track and perhaps we will add them to the monthly reports.", "q2r": 3, "assessor": "z_assessor_2855", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9249, "q0": "The proposal presents a clear and concise description of the problem it intends to address. In addition, the author made an excellent correlation between the problems that the challenge indicates as a need for a solution and how her proposal helps in some relevant points.\n\nSomething relevant highlighted by the author was to clarify how young people will receive their mentorships and will be able to extract value from the COP27 event, consequently they will be able to contribute to the Cardano community in Africa. Clearly this is a strategy that has the potential to generate value for the community.\n\nAn improvement worth considering would be to exemplify how initiatives similar to this one have already generated scalable results. This would add value to the proposal by making the success stories tangible and would certainly increase the impact of the solution.", "q0r": 5, "q1": "As for the competence of the team in the development of the project, there is no doubt that favorable conditions exist, considering that the authors are the founders of the event in question.\n\nAn improvement to be considered would be the appointment of a focal team that will be focused on developing the interests of the youth who will be mentored throughout the event program.\n\nAs well as the script and the required skills were presented with exemplary clarity, we could also see who is responsible for developing the approach with young people during the event, as the creators of the event will have several other commitments and will probably not be the team responsible for operationalizing the proposal.\n\nFinally, the risks indicated are quite realistic and coherent. Strong indication that the author has experience in this field and is prepared to deal with adversity.", "q1r": 4, "q2": "The proposal clearly contains what milestones it intends to achieve, how it can be monitored and what indicators of success we can expect.\n\nThis presentation indicates the level of transparency and visibility that we can expect in project implementation. Good point for the authors.\n\nJust to improve the proposal, it would be interesting to see additional links to the tools used to track the progress of the project. Attachments with the content of the event were available, but it would also be interesting to see more information directly related to the purpose of the proposal.", "q2r": 4, "assessor": "z_assessor_3035", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 11741, "q0": "This proposal tells us that the problem is that leaders in Africa aren't equipped with the tools to deal with climate change, emerging economies and endemic barriers. But this challenge is to develop Africa, develop Cardano, so this proposal is perfectly suitable for investment and development. In this project African youth are exposed to senior leaders so they can learn from these people who are at the forefront of their fields. They offer discussion solutions to the challenges facing Africa and the Global South. The key elements of the project mentioned by the proposed team are COP27, SCC these are important factors in connecting with young people to push the projects forward. There is nothing left to criticize, the solutions from the proposed team are too obvious.\nThe group also outlined the risks of this project and the solutions to those risks. However, these disarmaments are just showing the community that they will do those jobs, not giving the final result that the risk will be completely resolved.\n", "q0r": 5, "q1": "The group showed the community each specific job and the work to be done according to a process within a certain timeline. However, I do not think it is reasonable, compared to the given time frame of 6 months to complete the project, the detailed plan takes place within 8 months. This took longer than expected to complete the project.\nThere was an error in the budget calculation for this project. It exceeded the budget requested by the team. The excess number is not a small number, so the project can be implemented or not. Should the community put their trust in this project to succeed? The team should reduce costs and should give an exact figure, not an approximation because it represents transparency.\nThe participants in the project were reviewed by the team and selected qualified people. They have pointed out the character and capacity of the people involved in the construction of the project. Not only that, they can also indicate their LinkedIn so that we can track and understand that person's information, which is very convincing to the community. I agree that if we are funded we will continue to work even further and scale up even more.", "q1r": 3, "q2": "The proposal identifies the goals that must be achieved to make the project successful, which are the products after the project implementation. The group showed the community that the event was open to the public. The indicators are given clearly and completely, consistent with the above disarmament, suitable for this challenge.\nThere is no denying the success of the project because the team has shown this success as a definition. When the proposal is funded, the results will be apparent, with youth leaders given the tools to help them navigate the complexities of climate change, negotiations, and global engagement.", "q2r": 5, "assessor": "z_assessor_3273", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12100, "q0": "This proposal presents a very good idea much in line with the challenges goals. The project aims to promote a connection of young activists and leaders with well established leaders from a diverse range of fields, including from Cardano, in the COP27 and Women Leaders Climate Summit, to be held in Egypt. That would be a great opportunity to engage a very special and promising group of young leaders and present to them challenges aligned with the Cardano Community such as sustainability, diversity, Africa growth, as well as knowledge to address them, including solutions based in the Cardano’s Community and technology. Finally, despite being a 24 hour event, the impact and network building, that also will be fomented during the months previous the event, could lead to long-lasting connections between young and influential leaders and the Cardano Community.", "q0r": 5, "q1": "The proposal details and offers links to verify the team members experiences and works in the field, which is very important. Additionally, the team members seem very experienced, skilled and capable for the Community-building and Summit team preparation. There is a budget breaking down alongside a detailed timeline which is very useful to evaluate the estimated resources and schedule proposed. Also, the proposal provides relevant links to video content and web pages detailing the project and the different initiatives encompassed by it. At last, it has the potential to be a long-lasting project, as it could run for other Funds and continue to bring connection between young leaders and Cardano.", "q1r": 5, "q2": "As exposed in the proposal, the event is public and the Cardano Community can attend, participate and verify the results of the project. Additionally, as enumerated in the budget breaking down, it is planned to be delivered a closing results report. The target success is very much in line with the challenge goals as stated in the proposal that the focus of the event and therefore of the conversations to be held in it are: Sustainably from an African perspective as well as the role of technology and blockchain as the future of sustainable finance. Finally, it seems to me that the deliverables and key metrics are straightforward and easy to measure and can verify for the success of the event.", "q2r": 5, "assessor": "z_assessor_3361", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12356, "q0": "The proposal tackles the problem that aligns with project catalyst objectives. The proposal addresses the need for youth empowerment programs. The idea of building a resilient youth on the Africa continent to tackle the issue of the need of youth empowerment programs is an area of interest to many and youths. This is happens to be in alighnment with Cardano's challenge settings. I'm am not clear with details of this proposal in relation with the stated problem. There are number of stakeholders mentioned which I think shows how the team is willing to involve the needed people to achieve its objectives. The  proposal seeks to connect youth leaders to champion many topics of concern on global issues. The  proposal provides a platform for the youth to be educated on cardano's goals and the adoption of blockchain and cryptocurrency in Africa. The proposal provided key performance indicators in addressing the problem.", "q0r": 5, "q1": "There is clear information provided on the team members in this proposal. This shows a well established team with experience in their area of expertise. The budget gives a detailed list of items which is broken down into cost. However i'm not too sure about the details of the budget. I think with the kind of activities that will be run in this project in a period of 6 months seems to be an overstated budget cost. The proposal provides a laid down plan with a schedule of activities and how it intends to achieve its goals. The proposal considers some challenges and risk which needs to be addressed if the project is to be implemented. There are suggestions given on how these risks can be hindered that is stated in the proposal. I believe to mitigate these risk, well informed programs should be organized to capture the youth. This will help bring the youth together, and hence lead mentorship on technology, cryptocurrency and blockchain which is line with cardano's objectives.", "q1r": 4, "q2": "The proposal has provided the necessary information for the project if it to be implemented. I believe there is clear roadmap of how this proposal will be implemented. There is a clear timelime of activities which intends to use a period of 6 months to achieve is stated goals and objectives. Furthermore the proposal has provided activities to track the progress of the project. Also, there are key metrics and key performance indicators that have been stated. The proposal if receives the necessary funding will be implemented.", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "This proposal will organise peer-to-peer coaching to provide global connections, tools, and advice. Cardano leaders have a critical role in the relationship between African youth and crypto.", "experience": "30+ years of experience in climate and sustainability, building global networks, foundations, and environmental conservation. The last two years of SCC have reached 154 million impressions and political traction with the COP27 Presidency."}