{"id": 422022, "author": "tevosaks", "title": "Proposal Writing Service", "url": "https://cardano.ideascale.com/a/dtd/422022-48088", "category": 26600, "amount": 6600, "description": "New proposers may lack the knowledge and clarity to start writing compelling proposals.", "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 466, "q0": "This proposal is essential, for there are too many proposers that are in love with their idea. Because of this, best practices is disregarded. Numerous proposals either over express their intent, making it almost unreadable or under state their intent which then categorizes it as an incomplete proposal.\n\nYes, this proposal might not directly answer the Challenge Setting but it will have an effect down the road. For its main goal is to create quality proposals together with proposers which then increases the likelihood of receiving favourable reviews from Proposal Assessors. This in return enhances the proposals chance of receiving votes. Whatever the proposals topic may be.\n\nWriting advanced and effective proposals based on the Catalyst guidelines is difficult, let alone for newbies, let alone for those who are not adept in the English language. This proposal seeks to address this core issue that is floating in various other communities that do not have English as their main communication tool.", "q0r": 5, "q1": "The proposer has been continuously funded for a similar proposal but differs in the intent. Their other proposal seeks to educate while this proposal seeks to create together with the proposer the intended proposal. Seeing that the difference is in the process and not in the teaching and knowing that they have been successfully delivering on their Mini Proposal Workshops, there is little doubt they will also succeed in this adapted version. ", "q1r": 5, "q2": "Staying true to their expertise, this proposal is structured systematically and concise. You have a clear understanding of what their conceptual and numeric goal is. Which is to create 2 (two) proposals with ratings of 4 to 4,2. It's very straightforward and makes the work of a Proposal Assessor easier.\n\nHow they calculate their budget is also exact, for they use work hours over general lump sum values, which I highly appreciate. Which then is multiplied by an hourly rate. Very easy system to audit, again a testament to their skills and experience. This very proposal format is the potential format of their future users/participants.", "q2r": 5, "assessor": "z_assessor_2088", "no_vca": 14, "ne": 0, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 1313, "q0": "The problem perceived by proposers is when a newcomers are proposing and drafting their proposal, they might not fit directly to the Catalyst “standard” and it might lack the clarity. The solution is to provide a face to face sessions with the aim to understand the proposal, collect all the required information and then prepare a draft. Next, the refinement procedure occurs, where another session is scheduled to improve parts that are required to be improved. As stated in the proposal, the goal would be to proposals that are not too technical or educational, and will be easily comprehended by assessors. Another barrier when making a proposal can be a language, and this service will also is tackling this challenge. I personally see a very large impact on this proposal, because I have seen many proposals already which would definitely benefit from such a service. So both the proposer and the community would be prospering, when ideas would be prepared in a more understandable manner. ", "q0r": 5, "q1": "The plan is to start offering the service three weeks before the next fund (F10) and to accept proposal submission for review/or to schedule sessions. The next step is to collect all the information and draft the first version of the proposal. As the final step, the refinement comes to place and the proposal will be submitted. The estimated time spent on these tasks is 165 hours, per 40 USD which gives the total budget 6600 USD for two proposals. Despite a very good detail is provided on the tasks to be performed, I think it will vary from a proposal to proposal, from a client to a client, but I get that it is an estimation that is currently making sense. The team is consisting from 3 people, where we have their bio and linked in profiles provided. Their expertise matches the required expertise, as well as this proposal itself is a proof, that they can create a logically constructed proposal, which will be the final outcome of their work later on. ", "q1r": 5, "q2": "The problem (not clear proposals) solution (provide proposal writing service) is clear and KPIs are organized logically so we can track the progress – via the feedback, as mentioned, which will be public. Another way to track the progress will be recorded meetings and process of each proposal will be possible to find on dework space and Miro board on the Swarm Dework. Another metric to track the success of the proposal will be actually filed proposals that were submitted, and the overall satisfaction of their clients would be above 4 points out of 5. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2702, "q0": "This is another proposal by Tevo Saks, a Catalyst veteran, this time with the aim of obtaining funds for a team of writers that can help inexperienced proposers in future funds with how they should write their proposal (mostly aimed at people from Africa).\nIt’s a very straightforward idea: many people do not have good English, or do not have experience writing proposals, even if they have a good idea. It’s a shame when something good for the ecosystem gets lost because it doesn’t meet the criteria we set, so what Tevo and his team proposes is to have a few people funded that will help write good proposals for those who require this service.\nAs risks, Tevo identified the fact that the language barrier between the writer and the proposer can lead to misunderstandings (this will be mitigated by reviewing the proposal together after it is written) and that proposers may not have all the necessary information to build the proposal in the first place. To mitigate this, the team will come up with a set of guiding questions.\nI fully agree that this proposal effectively addresses the Grow Africa, Grow Cardano challenge. Score: 5.", "q0r": 5, "q1": "Tevo has had many funded proposals in the past, some of which were similar to this one. As a result, he has a very detailed plan on how this will be done, an estimation of how much time a writer should spend with each proposer and a total number of estimated hours for the requested budget of only 6600 USD. The team will be composed of Tevo himself, Tonis, a freelance writer and Caue, the founder and manager of the LATAM Catalyst school. All the members have verifiable Linkedin profiles and have a good reputation in Catalyst.\nI am fully convinced that this proposal is highly likely to be implemented successfully. Score: 5.", "q1r": 5, "q2": "The project’s progress will be tracked via feedback from the proposers which will be made public and posted on a dedicated Miro board. Next, it will also be visible through its results: the draft proposals created by this team and visible in Ideascale.\nThe success will be measured by asking several important questions: how many proposals got funded and had a score of over 4.2? how many proposers rate this service (the goal being to get a rating of over 4)?. Additionally, the team has set a goal of having at least 2 approved proposals in Fund 10 and at least 4 in Fund 11.\nI am fully confident that this proposal will be easy to audit by the community, as Tevo always makes sure to post all the necessary information for his projects. Good luck! Score: 5.", "q2r": 5, "assessor": "z_assessor_2335", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3408, "q0": "The project catalyst is an opportunity for people to put their ideas into actions with the support from the community, and funding from the project.\nBut this may be a challenge for many people who join the catalyst community as they don't have relevant skills in proposal writing, which is needed to transform ideas in actions written down and be understood by readers (PA's and Voters).\nProviding a support for Proposers would help a lot people acquire the knowledge around grant writing, but also increase numbers of Catalyst members who would be willing to become Proposers.\nThis proposal may be scalable and global as it can attract more people from within the community but new one's who won't hesitate to join knowing they'll benefit from a support to be proposers.\nThis aligns with the challenge objective.", "q0r": 5, "q1": "The idea presented through this proposal seems simple, clear and responding to a need from the community.\nThe team of proposers if formed mainly with people who already are part of the Catalyst School. We would assume they have different  technics to use to teach a lesson to people (participants), which is needed in such an initiative, as people will join to learn on how to write a grant application.\nThe timeframe is reasonable while the budget is well established and detailed.\nIf a grant writing guiding is also created at the end of this project, it would be another tool to be used by those who can't join the in person sessions.\noverall this proposal has a potential to be successful and my rating is of a 5 star.\n", "q1r": 5, "q2": "The proposers team plan on publishing all the proposal related information on the Miro page, so the community can follow the progress, while the feedback (survey results) from participants will also be published there.\nThe risk pointed out by Proposers is a misunderstanding the Proposers, that's why they are favoring the face to face to mitigate this. But I would also see another risk if a Proposers present a idea which is more technical and out of the Proposers team expertise and experience. This may also be a challenge and I would like to learn more on how the team is proposing to mitigate this in such situation. \n", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5080, "q0": "This proposal could have a good amount of impact, but it is not Africa-specific at all. There are no common languages, no common cultures, and no specific outreach to African communities. The proposal says: “This service is suitable for everyone, especially those, who are not well versed in the English language, in the Catalyst community. The service makes the project ideas and goals easier for the community advisors to comprehend.” (Quoted from the proposals’ proposed solution section.) In my mind, the focus is too much on integration into Catalyst’s state of being, than on the African soon-to-be-proposers. The challenge setting defines success like this: “Practical innovations offered on tackling the unique challenges faced by the continent. A clear roadmap that points to increased adoption.” This proposal is a good idea, but not suitable for this challenge.", "q0r": 2, "q1": "This proposal is feasible in terms of who will work on it, and stuff relating to this is listed and understandable. But the feasibility lacks very much with outreach and “marketing” – it seems like it will be up to the potential proposers to “find out about that service”. They should not need to be engaged already to access this service, that would not suit the needs they have. Yes, they can deliver this proposal – but I wonder whether this will only benefit a handful of proposers that are already in Catalyst and randomly know about this proposal.", "q1r": 3, "q2": "There are a lot of efforts planned to make stuff public. But where does it get collected? A Miro board is in my opinion not the best option to make it a central point, since they are not searchable. Stuff has to be linked in an accessible way, not in a way that one has to search through everything to find a resource. In this way, what you also prevent, is people just finding the source (because they have to know about it in order to maybe be motivated to find it). You’d totally need a proper and non-confusing “accessible public channel for delivering regular updates to the community for auditing progress” (as quoted from the PA-Guide).", "q2r": 3, "assessor": "z_assessor_2670", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "\"I would agree that the proposal I do not bring out any specific partnerships with African groups, but it's under this challenge to target an African audience.\n\nThe proposers are the people who are bringing in their innovation and this proposal will help to write them out.\n\nYour feasibility score does not match the rationale.\nYou give an impact opinion under the feasibility section, although you are right that proposers have to find this service, as a member of Catalyst Swarm and School I have a very wide reach due to our partnership with WADA.\n\nAnd in the audibility section, the fact you don't like transparency through Miro Boards and Dework has nothing to do with the fact it's not auditable.\nThis proposal shows you how I have done it in past on other proposals as a reference to google sheet documentation.\""}, {"id": 6475, "q0": "There is a clear challenge we face in the funding process where proposers don't know how to write a good proposal. With this idea, members of the Catalyst School will help teach those that want to submit a proposal. There are lots of great ideas in the Cardano community, but they may not be able to convey their idea because of lack of writing skills or even a language barrier. This proposal will have the ability to have a global effect on the ecosystem by allowing more ideas to be made and giving more people the ability to receive funds for their great ideas. If successful, this will benefit Cardano by bringing more ideas into the community and promoting building. This innovation leads to an effective proposal that addresses a specific problem we face in the funding process. Any proposal that has a focus on education of the community is going to be very important if in the hands of the right people. In this case, the proposal is suggested by members of the Catalyst School. This will likely increase the desire for people to support this fund as it promotes education in the community. It has the potential of helping a lot of people share their ideas and fell included. For these reasons, I give this section 5 stars.", "q0r": 5, "q1": "The team at the Catalyst school are very devoted and strive to educate all users. They have experience with the funding process and will be the best candidates to teach new proposers how to create a convincing proposal that will add utility to the Cardano ecosystem. The team has lots of experience with the funding process which increases the likelihood that this proposal will be implemented successfully if funded. They have a detailed roadmap that suggest everything that will be included in this writing service. The detailed plan gives specific dates and times that they will begin and start this writing service. This increases the ability to be held accountable by the community. This is great because it will increase the demand for the team to complete this project and start assisting new proposers in the funding process. There is a detailed budget breakdown that details exactly where the potential funds will be allocated and how that will help them to achieve their goal of improving the writing of proposals for many proposers. The proposal has identified certain risks that could be prevalent, and ways to mitigate those. This is important because in a proposal it is important to have a plan for every potential scenario. In this case, there is a lot of information provided and increases the likelihood of implementing their proposal successfully. For these reasons, I give this section 5 stars.", "q1r": 5, "q2": "The proposal includes a lot of information while remaining concise and to the point. This allows readers of this proposal to understand the vision of the proposal and give insight. This proposal is written well and provides details that can lead to the success of the proposal. A principle that is extremely important when measuring progress of a proposal is the inclusion of the community. By including the community into these proposals and allowing others to share their ideas and thoughts, there is more room for improvement, and it allows for the principle of accountability to be measured. This is crucial to the success of a proposal because it will help ensure that the creators of this proposal will ensure that they reach their guidelines and make sure that this writing service becomes a reality. This is enhanced when there are members that look forward to learning more about this proposal and how it can benefit them individually. It is also important that the team remains transparent with their progress and that they include constant updates detailing their current progress. I believe that this team will likely implement these two important factors which helps audit the progress and success of this proposal. For these reasons, I give this section 5 stars. I believe that it can help future catalyst funds and will lead to more accurate proposals and allow more people to convey their ideas which promotes innovation and building.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "This service will provide a face-on-face Project Catalyst Proposal Writing Service, that will help to produce a starting draft proposal for the proposers.", "experience": "Our small team has combined experience in meeting coordination and facilitation, general formal writing, translation, and experience in the Catalyst community."}