{"id": 422005, "author": "raz", "title": "Marketing Training for African SPOs", "url": "https://cardano.ideascale.com/a/dtd/422005-48088", "category": 26600, "amount": 8000, "description": "It's challenging being a Stake Pool Operator (SPO) let alone the 1st SPO in a country. On top of technical skills, SPOs need entrepreneurial, marketing, and managerial skills to operate sustainably.", "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"id": 3103, "q0": "In Africa being a Pool Operator has been a challenge and a challenge for the Cardano ecosystem. But to spread to the African community about the development of new pools requires the unremitting efforts of several pool operators. This proposal solved a problem of the challenge of providing educational and marketing solutions for pool operators, exposing thousands of students to the Cardano ecosystem in pool creation and pool operation. professionally.\nIt is also a challenge to help pool operators in Africa acquire the capacity, technical, business, marketing and management skills to operate sustainably. Due to internet disruptions to pool operations, frequent power outages, low commitments for staking ADA to pools, and the Cardano community pose little risk to the proposal. But the proposal offers a solution to overcome those risks by working with 3 internet service providers for each operating Pool to ensure a smooth transmission line, using solar panels to help stabilize the power source, improve the commitment of organizations in contributing a large amount of ADA in the Pools so that the block explosion in the Pools is regular and regular, the student unions will produce promotional videos for the pool on youtube to grow the Cardano community in Africa.\nFor the above reasons, this proposal has effectively addressed the challenge posed.", "q0r": 5, "q1": "This Proposal writer has experience in running Pool, Educator in Universities, Developer of Plutus and Certified Emugo Foundations of Blockchain, Cardano community member actively working to promote ecosystem attitude towards positive impact purposes, co-founder of A Samsudin Brothers Projeck, co-founder of ADA Sustainability, environmental and social impact project manager The Art Suite. They have been funded in Funds 5,6,7,8 and continue to apply for some more proposals at Fund 9.\nThe budget of the proposal is very clear, detailed and reasonable with $8,000 to fund training for Pool operators, pool operators, and project management costs. Thereby expanding the Cardano network in the African market.\nI see the proponent has made very clear arguments about the risks in the implementation process and measures to limit the risks when implementing to make the project successful.", "q1r": 5, "q2": "It is proposed to provide a roadmap, a detailed plan with the beginning of capacity building and training for each SPO employee to use the resources of the Wada network, to operate the Pool with local pool operators through train.\nMeasuring project success among stakeholders outside the Cardano ecosystem and pool operators thanks to the Stakepool alliance in Africa, the increase in the number of new staking proxies per SPO, and the total the amount in ADA increases when participating in staking with each SPO. Therefore, the information provided is sufficient to assess the progress and success of the proposal.\nRelying on the support of Catalyst funding and the Cardano community, the proposal will enable the team with the resources and capacity to direct the focused efforts that facilitate significant ADA capital inflows and diversions. capital from both Cardano community stakeholders and outsiders to the Cardano ecosystem in light of the marketing efforts of newly trained SPOs and support from the Stakepool Africa consortium.\nThe success of the proposal is also reflected in the goal of sustainable development, ensuring the quality of inclusive and equitable education and promoting lifelong learning opportunities for all; building resilient infrastructure, promoting sustainable inclusive industrialization; reduce inequality between countries, between Africa and the rest of the world.", "q2r": 5, "assessor": "z_assessor_2397", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 3407, "q0": "Expanding the Stakepool hubs is a great way to onboard and drive interest about cardano to newcomers to the ecosystem.\nAfrica being one of the target region for expansion of Cardano, setting stakepool in that continent would help more Africans to learn, to get informed and test staking and benefit from the rewards.\nThose stake pools operators need knowledge in different aspects, and this proposal plans on offering training to SPOs in entrepreneurship, social media, marketing + managerial skills.\nThese skills are needed in order for the SPO team to perform its duties better on various levels and different capacities.\nBeing new and some of few cardano SPO hubs in Africa, it's important to have those be strong enough as they'll in the future support other SPO's to get established. And that strength should be in various fields, as a lot of skills are needed to manage such organisation. \nFrom the perspective of how this proposal has been presented, I find it being aligned with the challenge objectives as it's an answer to: offering solutions to infrastructure and education concerns, but also to onboarded onto Cardano (wallets, platform sign-ups) new users from Africa.", "q0r": 5, "q1": "The proposers team has been involved in the catalyst project since Fund cycle 5, with a number of successful grant applications, including the one that helped implement the SPO in Goma, DR-Congo, which is the mother to this one.\nThis proposal being a add-on to the work which is already going on, shows that it has been an issue identified by the team in order to facilitate the work. And that gives it a big chance of success.\nThe budget breakdown is clear and focus toward funding the training of the SPO team to improve their skills in various skills.\nThe timeframe is reasonable and a clear roadmap pertaining the plan implemention.\n", "q1r": 5, "q2": "The community would be following the implementation progress through the SPO website (http://gomapool.com/).\nOutcomes and indicators are defined, but I wouldl llike to see 2 more KPI',s mentioned, which are:\n- the number of SPOs staff trained in entrepreneurship, social media, marketing + managerial skills;\n- Feedback from participants about the training", "q2r": 4, "assessor": "z_assessor_2458", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5249, "q0": "The Stake Pool Operator (SPO) plays an extremely important role in the development of the Cardano Blockchain. However, in order to operate a Pool, it takes a lot of factors from machine configuration, and technical level to Marketing activities to attract cryptocurrency investors to delegate their ADA number to the pool to help the pool get more profitable and more sustainable.\n\nThe solution of this proposal is to connect SPOs operators at DRC Ivory Coast to train them on how to create Youtube videos, and manage channels and promote their operations on social media + more. So that these people can  have better results such as increase number of delegators, ADA amount,...in their staking pools.\n\n\nHowever, the language problem in the current Cardano documents is mostly English, so you need to consider translating these documents into the local language to help these students can fully absorb the knowledge in training sessions.", "q0r": 5, "q1": "The implementation time for this proposal is not clearly written, however, I guess you will do it within 3 months and divided into 2 phases. Phase 1 is from Sep-Oct 2022 and phase 2 will be Nov 2022. However, the works in each phase are not described specifically, there is no corresponding completion time and results to be achieved for each phase. What is each job? Therefore, it is difficult for the community to assess the implementation of this proposal.\n\nOne of the main purposes of this proposal is to give the SPOs marketing skills, so I do not see any plan mentioned in this proposal. In my experience, you can put an example marketing plan you will use for training.\n\nBudget of the proposal is $8,000 including 03 main types of costs: Training costs, Stipend, Project Management/admin. This part of the cost is quite general, so the $8000 figure you use is not very convincing. You need to further break down these costs to make it easier for the community to assess.\n\nThere are 03 members participating in this proposal, but only Razali (Raz) is provided with the most complete information about experience and capacity. To make this proposal more reliable, you should clearly describe the information of each individual participating in the project, based on that information, the community can evaluate the members with appropriate competencies to implement this proposal or not.", "q1r": 3, "q2": "This is a purely education and communication proposition, so performance metrics need to be relevant to this area. The metrics you use like number of partnerships, Number of new delegators, total amount in ADA (and in $USD) are staked with each SPO. However, these indicators are not enough, the most important thing, in my opinion, is Number of people trained in marketing topics, because these are the values ​​that you will bring to the community help they can run successful marketing campaign and after that can make Cardano become more known.\n\nIn addition, to evaluate the success of the project, you must add specific numbers to the indicators mentioned above, such as 50 people trained, 10 partnerships, ... From these numbers, the community can assess that the project has spent enough resources to achieve the KPIs as committed.", "q2r": 4, "assessor": "z_assessor_2678", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal. In response to your comments for Feasability, you will perhaps have noticed that our team is made up of members of wada. So given the track record of wada, in addition to our collaborations to date and track records, you can arrive at the conclusion that the necessary competencies are already in place with our existing team and network."}, {"id": 6473, "q0": "Becoming a SPO on Cardano is very important. It promotes decentralization and brings value to the blockchain. This is even more important for small single pool operators throughout the world. However, the problem addressed in this proposal is that there is a lack of education for how to become a SPO and especially the marketing aspect behind it. There needs to be a large involvement of people so that a specific SPO can start minting blocks and benefiting the blockchain. Overtime, this proposal could influence the current challenge of individuals that would love to become a SPO but lack the means or education to do so. It is more expensive to create learning tutorials in Africa. This fund will allow them to create more education videos to share with the community in Africa. Thus, leading to an increased amount of SPOs in Africa. Education is extremely important on Cardano and will lead to a more decentralized global blockchain. For these reasons, I give this section 5 stars. ", "q0r": 5, "q1": "It is important in a proposal to include the information of the team or individual that submits the proposal. This allows for the community to hold them accountable to what they propose to accomplish through this funding process. It appears that Raz has a lot of experience in the ecosystem and is a part of lots of other innovative projects on Cardano. This will likely support the success of this proposal. There will be a greater deal of accountability implemented and these other projects and communities will ensure that this is completed. There is a detailed roadmap that suggests how the proposals intends to be implemented. This comes with specific dates of completion and shows all of the current ideas that will lead to the success of this proposal. By having this timeframe, it will allow for those to hold them accountable to this proposal. It also indicates that there has been discussion and a vision on how this proposal will look when completed. The detailed budget breakdown also gives specifics in regards to where the potential funds will be given, and how that will be necessary to fulfil the needs and requirements of this proposal. The team should remain open to ideas and suggestions as it will help the team come up with new ideas that could also benefit the training for new African SPOs. For these reasons, I give this section 4 out of 5 stars.", "q1r": 4, "q2": "There are several things that are incredibly important when considering the potential success of a proposal. One of those things being transparency from the team. When a team is open with their current progress and gives the community updates, it shows that they are willing to make adjustments if necessary but keeping the community up to date is very important. This allows for the second important principle. That is accountability and auditability. When the community is engaged in the idea of a proposal, there is more room for accountability to take place. Given that the team has provided specific details for the roadmap and budget breakdown. These are two areas that can be accounted for because there is a specific timeframe of completion. This Market Training for African SPOs can become important for all SPOs because it promotes education and decentralization in a global standpoint. For these reasons, I give this section 4 out of 5 stars.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9250, "q0": "The author has clearly presented the problem he intends to tackle. He used relevant information to contextualize the problem, bringing macro indicators, estimating future data and, above all, connecting the local context to the opportunity for community expansion.\n\nRegarding the solution, he followed the problem very consistently and we can clearly understand how it will create value for the community.\n\nSomething interesting to point out is that the proposed solution meets the challenge in something that can be considered fundamental, fostering the education and formation of a group that will propagate Cardano Blockchain to more and more potential stakeholders. This way it also meets the scalability requirements.", "q0r": 5, "q1": "Possibly one of the strengths of the proposal is the extensive number of references that the author has added to the content of the proposal. From their professional experiences to the history of previous projects with the community. Such clarity and background convey security in the execution of the proposal.\n\nIn addition, the author indicated other participants who are involved, also presenting their references.\n\nRegarding the action plan and budget, the proposal contains a succinct but efficient breakdown of the journey and the main costs involved.\n\nA point of improvement in the proposal that can greatly enrich the evolution of the project is the review of the risks involved. The author could have better explored some of the challenges that were part of the proposed solution context. In addition to the difficulties of connecting to the internet and engaging the public, I believe that other barriers have caused similar initiatives to fail. And no one better than the author to better explore these risks", "q1r": 4, "q2": "The author indicated good indicators for monitoring project progress. A point of improvement would be to indicate how this monitoring will be done. This will help the community to also track progress.\n\nOne way here would be to break down the proposed roadmap and long-term milestones into more detailed stages of deliveries. As well as indicating a tool that will be able to follow the document that the author has shared about the history of projects that he has been involved in. Undoubtedly, this document demonstrates a solid structure, but it would be interesting to see the construction of this with the proposal in question.", "q2r": 3, "assessor": "z_assessor_3035", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Capacity building enabling pioneering SPOs in DRC + Ivory Coast to operate sustainably with training and support from network partners in entrepreneurship, social media, marketing + managerial skills.", "experience": "GOMA SPO, highly engaged Cardano + Catalyst veterans funded in Fund 5,6,7,8, experienced educators in schools + universities, researchers, social entrepreneurs, business development, wada, Plutus Developer, Emurgo Foundations of Blockchain with Cardano Overview Certified. "}