{"id": 422155, "author": "drainslordy", "title": "CARDANO TO THE EYES OF AFRICA", "url": "https://cardano.ideascale.com/a/dtd/422155-48088", "category": 26600, "amount": 25000, "description": "PROBLEM:\nTHE CARDANO TO THE EYES OF AFRICA IS NOT SEEN AS OTHER PROJECT AND AS ITS ECOSYSTEM IS NOT AS MUCH USE AROUND. THIS IS PRACTICALLY MEANS THAT DUE TO LOW EXPOSURE AND EXPERIENCE.", "f6_no_assessments": 9, "f6_rating": 1.4814814814814814, "videos": [], "media": [], "f6_assessments": [{"id": 4489, "q0": "When communicating your vision and ideals to the community, it is in my opinion very important to step back a little from what you already know and the vision that you already see, and communicate clearly from the very beginning what you want to achieve and how you believe the world should change. It is important that the listener is captured from the very beginning and step by step, and that the vision is communicated as a gradual and sensible one. This is especially true if the listener is not one person, but a large audience like the ADA voters that these Catalyst proposals are intended for. In my humble opinion, the proposers do not follow these steps and \"shout\" (in capital letters) how passionate they are and that they want to increase awareness of Cardano in Africa. This is a passion we all share, but we need to know what makes this proposal stand out against others. We need to know which countries and neighborhoods this proposal targets, what kind of demographic or businesses would benefit and how the number of Cardano users, Cardano wallet, people's incomes or people's quality of life would be increased or improved by the work of each proposal. The challenge brief for Grow Africa, Grow Cardano has evolved over the last several funds where it has been a fixture, and it is no longer sufficient to just seed potential Cardano businesses that are located in Africa, but do so with a clear vision and high return on intent. When I read this proposal, I do not understand which steps the proposers plan to take if they get funded, what the funds are going to buy to have an effect on the project's success, and I therefore think that the impact for Cardano might not be as high as with others proposers who provide detailed links to their online profiles and a detailed business plan to instill confidence in the community that they can \"get the job done\". Although I feel the passion of the proposers, Project Catalyst is also a commercial enterprise, and we need to manage our Treasury ADA carefully to preserve their value in order to have impact not only today but also in the future. I highly encourage the proposers to read more about business plan writing, and possibly attend an incubator (like Ariob?), accelerator, or training program to that end. In its current form, I cannot agree that this proposal effectively addresses the challenge, which focuses on Growth as much as it focuses on Africa. I believe that this is mainly a communication thing and encourage the proposers to keep at it until their proposal clearly communicates what they are trying to achieve, have a budget, KPIs and defined goals.", "q0r": 2, "q1": "Without breakdown or itemization of the budget, milestones or timeline, and a clearly defined business plan, course of action and goals, this project is unlikely to be implemented successfully. While I do not doubt that the proposers have good intentions and may be highly effective in bringing attention to Cardano in Africa, I would need to see a lot more details to recommend this proposals for the voters' approval. This is not about \"being good with words\" but about communicating a course of action so the distribution of funds can be targeted to areas where the are most needed and the risk of the entirety of ADA disbursed kept at an acceptable level.\nThe proposers present the names of the team, but it would have been great to get a link to the blog of the \"blog man\" and maybe see resumes, profiles, statements, even clippings of local newspapers demonstrating the work of the proposers so far would have been awesome to see.", "q1r": 2, "q2": "Unfortunately, there is absolutely nothing provided in terms of quantitative performance metrics, timelines, targeted demographic, testing or validating ideas - it is not even clear what the product or service of this proposal are. I assume that the proposers plan to \"spread the word\" about Cardano to their social media and face-to-face contacts, but in order to assess whether this is worthwhile for the 25,000 USD requested, the voters would need to assess the likely impact, for example by looking at the current number of contacts, existing evidence of previous work, what the goals of the project are and how they can be communicated.", "q2r": 1, "assessor": "z_assessor_2554", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5100, "q0": "This is a $25,000 fund request without any substance. Someone may explain it as language differences, but there is no development or verifiable detail. The proposal somehow is going to raise awareness of Cardano but does not describe how, provide detail or a plan. The proposer does not explain any experience that is understandable. \nMy Assessment is a 1 - strongly disagree it meets the objectives of the Challenge.", "q0r": 1, "q1": "The proposal does not provide any understandable experience for this project. I think on certain Proposal that voters should be presented with the actual writing, so “ FROM MY PERSONAL IDEALS.\nTAKING CARDANO TO THE EYES OF AFRICA DOWN TO ALL LOCAL AREAS ESPECIALLY THOSE WITH LESS PRIVILEGE TO ENGAGE.”. This is the concept as written and what is expected to be assessed. There is no way to verify any of the team members listed. The section for the detailed budget is-“ MOST PEOPLE GET HEAR ABOUT THE PROJECT BUT HAVE NO IDEA WHAT IS IT BUT BY PERFORMING A FACE TO FACE TEACHING TO ENSURE MORE UNDERSTANDING.”. \n———————————————————————————————————————————\nMy rating of this proposal is a one star. ", "q1r": 1, "q2": "Other than some written words which make no sense to the question of Audit there is no information. I will not insult the readers by copying and pasting the Pap. It is non-sensicle. My Assessment of this audit section is a one star. ", "q2r": 1, "assessor": "z_assessor_2671", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9660, "q0": "Although the problem identified is very broad, several issues related to the objectives of the challenge can be found in the identified problem, mainly the identification of the low exposure of Cardano in the African continent and the lack of knowledge on the part of its population. However, the proposed solution is very general, lacking precision and does not comprehensively address the problem. It has very little development, almost null.", "q0r": 2, "q1": "There is no relevant information on the people involved in this project and no relevant links on who will perform the tasks. There are no details about the budget requested. In general, there is a poor upload of data to the Ideascale form. The feasibility is almost inexistent.", "q1r": 1, "q2": "As a domino effect, it is almost unfeasible to measure the auditability of something that has no explanation as to how it will be carried out. Door-to-door service can be effective but needs a detailed and necessary plan, which is not found in the present proposal.  ", "q2r": 1, "assessor": "z_assessor_3079", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 12231, "q0": "The project proposal presents the problem of low exposure and experience about blockchain technology and Cardano in the Africa. In addition to this, the proposer proposes to conduct face to face meeting as to introduce and promote blockchain technology and Cardano to the public. In the beginning, I think this is good idea but, the activities that the team would conduct is door to door services which I think, this is not effective way to introduce and market the blockchain and Cardano. The team should find another way such as provide education to the public by conducting seminar or workshop for few times (according to the budget that propose) about blockchain and cardano. This will be effective way to introduce it. On the other hand, no relevant experiences information provided that relate to the project. therefore, I disagree that the proposal does not address the challenge", "q0r": 3, "q1": "The proposer has not provided any information about the plan, no timeline and milestone. Instead, the proposer provides brainstorming of his/her idea. While there is no information about the plan, the proposer stated the people who engage in the project but, I lack assurance that they proper person to in charge the project since no clear the activities. Furthermore, no budget information provided. I suggest the proposer should state effective way to introduce blockchain and Cardano to the public thus, the budget can be set up. Given unclear information, I disagree the proposal will be implemented successfully ", "q1r": 3, "q2": "There are no metrics or KPIs, nor is a description of the success of the project clearly articulated. As no clear plan is provided regarding what the funds would be spent on, it is rather difficult to imaging auditing the progress and success. In conclusion, the idea of proposer with his team is interesting but lacks the information how to execute the idea.", "q2r": 3, "assessor": "z_assessor_3367", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 15062, "q0": "The proposal is entirely generic. What will be done here? All I could extract from the impact of this project is that the objective is to bring Cardano to “the eyes of Africa”, to bring knowledge about our blockchain to people of different origins and social levels. But it is not said how this would be done – what content would be addressed? I believe that initially basic concepts such as what blockchain, what is Cardano, what are cryptocurrencies and etc. How will this be publicized? Social media like instagram, tiktok, telegram? Traditional media like TV and radio? Or will there be face-to-face events, such as workshops and lectures? Who are these people that we seek to reach, specifically? From which country, how will they be contacted? Unfortunately, many things are missing to be sure that the project will be valid, that it will achieve the objectives of the challenge of benefiting Africa and Cardano at the same time. That said, unfortunately, this proposal deserves a minimum score in terms of impact.", "q0r": 1, "q1": "The proposal is totally unfeasible, we have no information on any of the 3 topics. In script: we don't know what would happen, how and when. It would be essential for proponents to explain the phases of project development, ideally, dividing the whole into months and citing in detail which activities would be carried out in each. The way the information is said here, we have an extremely abstract view of what would happen in the practical process of realizing the idea. There is no information on how the $25,000 would be used. How would they be distributed, how would those involved in the project be paid, how much money would be allocated to the creation of content, for their dissemination, if there would be financial incentives for people to have more engagement with this idea, especially those who are unaware of the cryptographic world . We also don't know anything about the team, we only know their names and roles. But not 1) what activities they would do; 2) what are your professional CVs; 3) how they have experience with Cardano, if any.", "q1r": 1, "q2": "It is not possible to monitor progress as we do not know what will be done, or how or when. The bidders also do not provide any metrics or KPIs that could serve as a partial result to be verified. It would be necessary for the script to be improved so that we would have solid material to be followed up, progressively. It is also essential that those involved make reports periodically and send them to the Cardano community, for example by telegram or discord, which are communication channels that are already widely used by us. These reports should contain direct information about what was done in the month, both in terms of tasks and partial results. The final success is summed up in bringing Cardano to the attention of people of different classes in Africa. But it is not explained how this would be understood, how people learned about our blockchain and how they would be using the acquired knowledge. Whether they would be getting involved with projects, with Catalyst, acquiring Ada, making digital wallets. It is not possible for us to understand how the final scenario would be monitored and reported to our community.", "q2r": 1, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15231, "q0": "The problem statement is written in an incomprehensible way.\n\nThis proposal is a draft and there is no clear description of the objective, only a vague notion of bringing knowledge about Cardano to African communities.\n\nThere are no metrics/KPIs or any concrete information to indicate impact on the challenge.\n\nI would recommend that the proposer watch Catalyst School workshops and tutorials on YouTube for more information on how to structure a proposal.", "q0r": 1, "q1": "There is mention of three people on the team, but no details on their expertise and sources to check qualifications. It is unclear why Dor Garbash's profile is included in this proposal, Dor is one of the most important people in the development of Catalyst and has a great reputation in the community but in the proposal description there is no mention that he is part of the team, so why was he included in the proposal profile?\n\nThis proposal presents only vague and imprecise ideas, there is no plan, budget breakdown or any element that guides as to the feasibility of this proposal.\n\nAs I mentioned in my impact rationale, I recommend that the team seek support from the Catalyst School or through Catalyst's Discord and Telegram channels to create a new proposal.", "q1r": 1, "q2": "This proposal is a draft. There is no information to assess auditability. No metrics/KPIs, no roadmap, no milestones and the definition of success is vague.\n\nI will not extend my rationale because it makes no sense, the recommendations for the proposer are present in the impact and auditability rationales.", "q2r": 1, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15254, "q0": "Impact \nThe proposal sees Cardano as different from other projects and its ecosystem is of no much use. This is because of its low exposure and experience. The proposal considers it's important to ensure the project is well known and used in the local areas of Africa. This can be done by 'facial action and real activities'. It suggests 'take Cardano to the eyes of Africa down to all local areas especially those with less privilege to engage'. \n\nThe proposer thinks that introducing to the Africans with all levels of education to support its economic growth would meet and answer the Challenge. \n\nAs for risks, the proposal thinks that the people in local areas have difficulty trusting an unknown company. \n\nThe proposer's experience is creating large awareness and step by step for eazy understanding. \n\nThe requested budget is 25000 (5% of the total campaign fund allocation) \n\nThe way I read this proposal is that Cardano is not well known at all levels of the African people. Unless I got it wrong, the eyes of Africa means the people of Africa. The suggestion is to bring Cardano into projects that are known and are of use. The phrase 'facial action and real activities' is not defined but I take it to mean that Cardano should be presented to the people and it can be used. \n\nIntroducing Africans with all levels of education to support its economic growth is the objective of the campaign to increase adoption. \n\nUnfortunately the proposal has not specifically laid out its solution clearly as to how to tackle the problem of unknown Cardano, build trust and exhibit Cardano as a project that can help grow the Africans economy. \n\nBecause the proposed solution is not clear, even though the Challenge is partly addressed, I would settle for a 3 that I neither agree nor disagree that this proposal effectively addresses the challenge. \n", "q0r": 3, "q1": "Feasibility \nThe plan proposed is of 3 steps :\nEnsure that the low level areas are involved \nBring hope to Africa \nProvide all form of eazy understanding \n\nBudget 25000 USD representing 5% of total fund allocated for this campaign. \n\nTeam members \nBlog man who makes large exposure \nThe project moderator \nProject Admin. \n\nThey will return for further funding if it's successful exposing Cardano to the 'eyes of Africa'. \n\nI see that the plan presented is too general and is difficult to understand. Like questions I have to ask, what are the things we need to do  to get the low level areas to involve? What are the things we got to do to provide eazy understanding, explaining? Cartooning? \n\nI do not find any reference of the team members to understand their capability and ability. \n\nBecause of the ambiguity of the plan, the budget amount being 5% of the fund allocation is unreasonable. \n\nWith that, I strongly disagree that it is highly likely this proposal will be implemented successfully.", "q1r": 1, "q2": "Auditability \nFor tracking project progress:\nThe proposal says to put the project on track is to make it success, and they are 'taking door to door service' to show 'we practice what we are preaching' \n\nThe proposal thinks that the success is to take Cardano to the 'face of Africa', not just the high level educated but also to the less privileged. \n\nI have difficulty understanding the proposed project progress tracking and the statement of how the success would look like.  Because the detailed plan is not specified and clear, the project progress tracking is superfluous. \n\nWith that I strongly disagree that the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 1, "assessor": "z_assessor_2631", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15263, "q0": "This proposal is about the purpose of growing Africa and Cardano - also the main objective of this challenge. However, I don't see a detailed description of the problem that the team is seeing and wants to solve. That said, the solution the team gives lacks granular information and doesn't help us imagine what the project can do for the community in reality. As a part of the Cardano community, we suggest the proposer tell more about: \n- The problem they are seeing and would like to make something change. \n- The solution or the product they build can help to solve the problem above.\n- About the risk, the team should include the backup plan facing the risk, not just list it down.", "q0r": 2, "q1": "The same with the previous part, the information about the team is not provided. It would be great if they updated more about their relevant experience with the project and the linkedin profile,... Because the job title is not enough. The detailed plan doesn't indicate the specific timeline, mark and achievement. It's very hard for us if we fund for the project that cannot describe what they use the budget for,... This proposal needs more.", "q1r": 2, "q2": "In Auditability section, the way to measure the progress is not clear enough, and no metric is mentioned here. So, the questions about what a successful project looks like are also general. Moreover, There is many mistakes typo of a poorly written part with all capitalized letter and NO KPI/OKRs to be measured at which platform to be tracked. This will make the proposal  is no clue tracked in case getting fund", "q2r": 1, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15310, "q0": "Proposal starts from a confusing and vague problem statement and proposes a very generic solution. For instance, it talks about creating awareness but doesnt explain how this would going to be done, what audiences or countries to be target, how it will communicate and promote engagement. This would be key to assess if solution does addresss the problem.\nRisk part is not properly done as there's no mitigation strategy. \nAll in all, its a vague proposal, with ver little information provided, with the problem not well explained and neither the solution. It's hard to assesss its impact so my rate will be 1, even though there's some challenge alignment as it targets Africa Cardano .growth", "q0r": 1, "q1": "The proposal has no timeline or roadmap whatsover. Instead, it provides only some generic final project goals that are not so clear how it will be assessed once project is done.\nNo budget breakdown is provided either. For the budget part, it just says that face to face meeting will be carried out but it has no connection with the value requested.\nThe team has 3 people and their roles are mentioned but it should be provided details on these people background, exerience, education, links to work as reference. Without this, its hard to validate if they have the expertise to run this.\nMy rate will be 1 as rhe information provided were far from convicing on the feasbility of this proposal.", "q1r": 1, "q2": "As theres no timeline, no milestones is mentioned. Also, propsoer doesnt provide any tangible metric or kpi that would help to assess its success. it just provides general final goals but they are not measurable whatsover. They should be converted in some indicator with a target that community can assess later on if the objectives were achieved (one prossible direction is via surveys but using an adequate methodology).\nMy rate will be 1 again as nothing that can help audit this project is provided.\n\n", "q2r": 1, "assessor": "z_assessor_2461", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "WHAT IS IMPORTANT TO ENSURE THAT THE PROJECT IS WELL KNOWN AND USE IN THE LOCAL AREAS OF AFRICA THIS CAN BE DONE BY FACIAL ACTION AND REAL ACTIVITIES.", "experience": ": CREATING LARGE AWARENESS.\n:STEP BY STEP FOR EAZY UNDERSTANDING."}