{"id": 422231, "author": "binetangom", "title": "TECH-E", "url": "https://cardano.ideascale.com/a/dtd/422231-48088", "category": 26600, "amount": 45000, "description": "Nelson Mandela “Education is the most powerful weapon which you can use to change the world”\nAfrica lacks skilled blockchain developers. It necessity today to train developers to meet these challenges", "f6_no_assessments": 6, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"id": 3874, "q0": "A great idea, it identifies many of the problems that need to be solved in this challenge, it covers almost all of the problems the challenge poses, it can expand rapidly and large to many other places, they can also solve problems that arise in the future, this is a very good proposition, it brings great development value to the Cardano ecosystem. I would like to see this project again in the next Foundation if this proposal is not Funded in this Fund. Not only in Africa but other regions of the world need skilled Blockchain developers, which is one of the dilemmas in the field.\n\nThe solution of this idea is good, it identifies a few problems of the challenge, and the author of this idea argues in a logical, neat, and creative way. The solution creates schools for ethics. Creativity is a long-term step, not only raising the level of expertise for future generations but also a sustainable and long-term solution. With TECH-E and its first trial in Senegal with free educational programs, it is anticipated to benefit the Blockchain market here and in Africa in the future.\n\nThe project has a detailed description of some implementation risks, in addition to some suggested solutions by the author to overcome them, but the community needs to be informed for more solutions to these problems. . That risk if the Scheme is funded. On the other hand, funding risk, or more precisely financial risk is just one of the general areas of the project when it is funded to deploy, the author needs to list more than other risks such as personnel risks. (long-term with the project or quit), The French support staff is not a risk, and should be listed in the list of personnel needed to implement the project. solutions to limit these risks and those risks.\n", "q0r": 4, "q1": "The proposal to introduce unclear and detailed work implementation timelines compared with limited implementation resources will affect the project audit process. The proposal only estimates the time to complete the project and the goals achieved in general, the community needs a more detailed implementation plan corresponding to the implementation timeline, the author can refer to the Microsoft Project tool Management for more detailed and methodical support.\n6 months of implementation is not a long time, so the author considers dividing the implementation progress by week.\n\nThe proposed project budget is less than 20% of the total budget of this challenge, compared to the information the proposal provides, some project expenditures need to be clarified if it is to be funded. Example: 25 Calculator: $250 * 10 = $6250 - This one I find no logic in the math formula. ?!. Therefore, the author needs to check and revise to suit the necessary funding to implement the project.\n\nHuman resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that they are completely suitable for the project. However, the identities of the members are also difficult to verify. clear. The author of this project is Bineta NGOM providing a reputable identity verification link like LinkedIn, ... for the community to verify identity easily and practically, partner Ousmane Ndome: Developer, YouTuber I also need to provide that information, besides Youtube channel information, I can't identify anything else. Also, I wonder, with such a project, is it possible to load the entire workload with 2 people, if there are collaborators in the project, please provide information on the topic of co-export.\n", "q1r": 3, "q2": "Project transparency is very good, this project provides KPIs for accomplishing project goals, all goals are easily measured thanks to the indicators provided by the project, and they are also easily tested in an implementation. With 150 students at the beginning, 40 students, and 5 people completing the training, ... this is one of the metrics that are very easy to measure and check through a Youtube channel page.\n\nThe ideas of this project have not been proven successful, and have not been tested in practice, but it is a good idea. In my opinion, this project succeeds when the community sees how many students are trained to master blockchain development and how many students can build innovative applications on Cardano, not the general population. such as: \"increasing the number of Blockchain developers so that they can in turn train other young people\"\n\nBrand new idea information on Cardano platform never received any funding from Cardano ecosystem.\n", "q2r": 3, "assessor": "z_assessor_2489", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7436, "q0": "Solution with the desire to create a blockchain school to train young people in Senegal, an African country. Help them access smart contract knowledge, deploy applications on Cardano. Based on the above 2 things, the project is completely suitable for the Challenge\nBlockchain is a new technology to the world, this is an opportunity for African countries to grasp, approach and develop in parallel with countries in other continents. The project understands this and wants through the project to present blockchain knowledge to the younger generation. With the above orientation, the project should detail the process of developing training content, reference sources, operating structure, standards for faculty recruitment, local laws on blockchain education, etc. is at the core of building sustainable schools, educating students and creating a thriving community.\nAs for the risk that French is the main language in Senegal, I completely agree with the mitigation option, the Cardano community is really strong and diverse. Regarding the operational cost risk, the project proposes to offer the course in English for a fee, which is not really feasible, because at risk 1, English is a barrier, the number of participants will not much. I would like to add the following option: the project considers that it should not build a physics school, can ask for support from universities and high schools with available facilities, computers, and networks. Thereby converting construction costs into operating costs. Optimizing team strength. I rate this part 4 points\n", "q0r": 4, "q1": "The blueprint is sketchy, the community doesn't have enough data to confirm. It is recommended to list specific steps, such as knowledge synthesis, reference sources, teacher selection criteria, curriculum promotion, site search, equipment procurement, selection students, training process, contests if any... Accompanied by an estimate of the number of labor hours needed to complete, making the project more intuitive.\nThe detailed budget is quite complete in terms of construction and procurement. However, as mentioned in the above sections, the project should spend the expenses on realizing the content of learning and training the team. That helps good teaching quality, which is the premise for sustainable development. As for refreshments, I think it should be converted into another more effective cost, in the sense that it is a personal expense. The total application fund is 45,000 which is 9% of the whole challenge, this is a large number that, when used appropriately, produces great results.\nThe team has 2 members, in my opinion, it is quite thin to complete the project, there are many stages that need diverse expertise, such as school construction, learning content design, recruitment, training, academic advisors. training, operation, marketing, etc. Although the project is expected to recruit human resources, all have not had a specific plan, and the community does not have enough data to evaluate. I rate this part 3 points\n", "q1r": 3, "q2": "The project indicators presented include the number of inputs, the number of teaching, the number of completions, and the number of projects. All indicators are easy to quantify, highly intuitive. Those are the indicators that evaluate the completed results. It is necessary to add indicators in the construction process such as the number of training teachers, the number of built lectures, the teaching process, the classroom image and the equipment... These indicators make the project easy reporting in the process of operation, and easy for the community to monitor and evaluate. The project please present the specific link to the youtube channel.\nThe success of the project helps young Senegalese have a proper blockchain access environment, fully updated knowledge, and strengthen the Cardano community. Hopefully the successful project will help replicate it to many countries throughout Africa. I rate this section 5 points\n", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9832, "q0": "The idea of this project is much aligned with the objectives of this project. Tech-E is going to be a locally based Senegalese technology school that will train people especially the under privileged and girls on blockchain technology (with Cardano being the face of the program) and how it can impact their lives and the lives of others in Africa. The goal is to have a future generation of inspired developers with insightful ideas to impact the catalyst community. The proposer also talks about how language has been a barrier in previous programs since Senegal is a French-speaking country and most of the training materials are in English but the plan this time around is to link with people in the ecosystem to assist in the delivery of the program. The team also plans to have paid English courses for their members to enhance their capacity to deliver content in English.\nWhat makes this proposal different and interesting from other proposals with similar ideas is how the focus will be on the underprivileged and mainly, girls.", "q0r": 4, "q1": "According to the plan, the project will spread over six months, with the activity for each month stated. However, each activity still lacks details. Month one to three(1-3) lacks clarity. Month one deals with \"Prospecting for the loan of schools\", the team fails elaborate on how this process will be done. Month two also deals with \"Student recruitment\", since the main focus of the project is centered on the underprivileged, and girls, it would have been ideal to know how this selection process would be carried out.\nThe budget is properly laid out and detailed. I still recommend that the community provides an expert to verify the figures. The team also has the right qualifications and experience to carry out the project. Information on each member is provided along with their social handles for easy traceability. The team plans to also recruit temporary members with knowledge in blockchain especially Cardano, to help in the teaching process. \nWith a little more details on the plan, the team would be ready to go.", "q1r": 4, "q2": "The KPI's stated are very realistic, simple, and measuring. The target number is 150 students, and provisions have been made to include the consent of the parents to help increase attendance. The team also plans to have ten new projects developed by the students at the end of the three months course. The plan to create a youtube channel to share tutorials and training courses will be helpful in tracking progress. In all, this project looks auditable.", "q2r": 4, "assessor": "z_assessor_3106", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12649, "q0": "The proposal fits the challenge setting. The problem you posed is reasonable, the countries that are behind in most technology have the opportunity to catch up, which is to have access to new technologies such as blockchain. The vision of blockchain is revolutionary for the world and its early mastery will greatly accelerate the development.\nI think the proponent needs to be more specific about the educational strategy that the project will adopt. Because the difficulty is budget, you need to come up with a process or plan on how to optimize the budget as much as possible, it helps me believe in the quality of education more, especially Free courses will face a lot of difficulties leading to reduced quality. I think the most useful solution to this problem is to raise the self-study spirit of students, nothing is effective and simple by making them really interested and passionate about Blockchain. This can be done by increasing the frequency of exchange sessions between students, encouraging research on Blockchain's revolutionary articles, and continuously giving examples of its application during training. You could invite some of the experts who have had considerable success and in-depth knowledge to share their views on the field. Or organize small events like NFT creation, this activity will be very effective in getting acquainted with Blockchain. Promote students' creativity and curiosity. You will focus on collecting and finalizing materials for the students to use.\nI hope you will listen to some of my comments above. And hope you will come up with a clear and complete educational method.", "q0r": 4, "q1": "Thank you for providing the necessary information of project members and proof of their experience. But about the project's roadmap, it seems that it is incomplete and quite superficial, I still do not understand the details of the tasks assigned in each stage of the roadmap. Hope you will detail this part, so I can compare with the project's manpower to see if it is suitable or not. If possible, you should also include which experts will be involved in what work so that the assignment of the group is clear. Regarding the budget, I have no comment, I think the requested budget is appropriate for the project scope.", "q1r": 4, "q2": "The proposer has outlined the method by which the community can track the progress of the project. Tutorials, courses, KPIs will be presented via the Youtube channel, which is quite accessible. But I would like the proposer to come up with some specific KPIs to help me understand what metrics are published as meeting or exceeding targets. These can be short-term or long-term goals of this project. Such as the number of students interested in this program, the amount of positive feedback, the number of activities organized, the number of lectures taught, the number of students meeting the program's targets, etc. you expect in the future.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 15042, "q0": "The Idea of Training more Blockchain Developers in Africa\nFit into this Challenge to grow Africa but the Impact would have been more if the focus was\nCardano Blockchain. Blockchain Development requires some level of technical expertise and Cardano requires a unique skill set. Increasing the number of Cardano based Developers in Africa will increase new members in the ecosystem .\nI am concerned that the solution is for Children and girls which is good in all intentions but we also know that writing a plutus smart contract and running a cardano node require existing software development Skills which i doubt the children will have.\n\nI would suggest the Team take the existing course content in the ecosystem , Learn it first and replicate it in Senegal.\n\nFor that i give 3.\n", "q0r": 3, "q1": "The proposal plan includes selecting 5 public school for the Training, which begs the questions\nDoes the public school have facilities to run a typical cardano node?\nDo the students have access to Laptops to sustain the knowledge?\nThe Plan clearly shows a feasibility in a Basic ICT Training Program but for a Complex \nBlockchain Development Training that plan might need to include\nPartnering with an Existing IT company and focusing on the Junior and Intermediate Developers in Senegal instead of school children.\nThere is a detailed Budget well defined.\n\nThe Team seem to lack experienced in Cardano Blockchain Development,\nNo previous experience in Cardano mentioned General Blockchain knowledge only.\nHiring of a Cardano Expert is mentioned which is great to complement the team efforts, this in my opinion increases the Feasibility a bit. \nNo members of the team are currently working on another project which also means they will have the time to focus and deliver on this project.\nOverall , I am neutral on Feasibility\n\n", "q1r": 3, "q2": "This proposal will be difficult to track the progress, the team mentioned that they will create a new youtube channel to share the tutorials and courses.\nI would love to see the course content and how it was developed.\nIf there is any way for the community to track similar training from the team that would be helpful\nWhat success would look like in 1, 3 and 6 months is not clear , there is a mention that after 3 months, the team will increase the number of blockchain developers.\nBut it would be better to quantify it. How many new cardano developers in 3 months?\n\n\n\n\n", "q2r": 2, "assessor": "z_assessor_2439", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15067, "q0": "In theory, the proposal clearly aligns with the objectives of the challenge, but in practice this is still abstract. Free courses will be created to introduce Cardano and its technologies to Senegalese children. However, we don't have many details on how this would happen. What would the courses be like, what would the curriculum be like? How will such complex knowledge become easy for the target audience, who are very young people and who probably have never had prior contact with blockchain? How will people be motivated to study about a subject that is so unknown, how will they be able to understand the functioning, the opportunities and all the advantages of participating in the Cardano community? In my view, we only know the basics of what would be done, and that's bad; even if the proponent already has a company that deals with cryptocurrencies and has a partnership with the WADA group, well established in the community, more detail would be needed.", "q0r": 2, "q1": "The script is very superficial. We know what would happen each month, but not how such activities would be carried out. For example in month 2, the focus would be on recruiting students. How would this be done? How would contact be established? How would the children's parents agree to the classes, since there is often so much prejudice and stigma above the cryptographic world, due to misinformation? How would the classes be launched, would they all be in person, what topics would be covered in each class? The budget division is also not very satisfactory. For example, 5 thousand dollars would be destined for the promotion of the project, but nothing is explained about the marketing campaign, how it would happen, why would it need such an investment... What would be the necessary office equipment and which together would cost 1500 dollars? Unfortunately the team presentation is also not very ideal. We know little about those involved, they have no previous experience with Cardano; in addition, other people would still be hired (ideally, they would all be defined and presented).", "q1r": 2, "q2": "This is the best topic of the proposal, but it still needs to be deepened. Regarding progress, partial results are explained, how the courses themselves will be monitored, for example: the attendance of students, the knowledge obtained, etc. It is said that the KPIs will be presented through social media channels, in general my only suggestion would be, really, that we have knowledge not only about the course, but also about the pre-production of it, the process of creating the classes, the work of the professionals involved, the dissemination part, etc. And finally about the final results, what is said is generic. We need more specific details to truly understand how this project had an impact on local people and how this was beneficially reflected in our ecosystem. This would require a deeper study and that all the data obtained be passed on to the community, for example, it could be through the same media channels of the partial results.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We create school to train young people for free priori children (and girls) from scratch but also developers so that they master blockchain development and can build innovative applications on cardano", "experience": "I started in crypto since April 2017 and I understood very early the usefulness cryptos and blockchain for Africans\n5 years I've been doing meetups to introduce Senegalese cryptos. I own the first company in Senegal that accepted cryptos as a means of payment."}