{"id": 422366, "author": "maps2go", "title": "TiDi Nation - Grow Africa", "url": "https://cardano.ideascale.com/a/dtd/422366-48088", "category": 26600, "amount": 80000, "description": "There's a lack of access to resources and education for African student athletes, artists and creatives on monetization, entrepreneurship, and ownership.", "f6_no_assessments": 5, "f6_rating": 3.866666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3875, "q0": "A great idea, it identifies many of the problems that need to be solved in this challenge, it covers almost all of the problems the challenge poses, it can expand rapidly and large to many other places , they can also solve problems that arise in the future, this is a very good proposition, it brings great development value to the Cardano ecosystem. I would like to see this project again in the next Foundation if this proposal is not Funded in this Fund. Not only athletes, artists or creators (especially young student-age creatives around the world) but any social influence need access to resources. resources to monetize ownership, this is a matter of promoting respect for the exclusive value of creative works. The impact of this project is quite large,\n\nThe solution of this proposed idea is excellent, it identifies almost all the problems that need to be solved in this challenge, and the author's argument through the description is logical and clear. clear and complete. The solutions proposed by TiDi Nation are innovative and actionable as they provide education on blockchain industry, cryptocurrency, decentralized finance, NFT and monetization positions on Project Catalyst through channels. Influential, they identify target customers like Gen-Z and Millennials as Market Influencers, as well as have impressive companions like Diaspora Africans and current/former NCAA Division 1 and professional soccer/soccer players, HBCU (Black Colleges and Universities in American History) began with the Danish Technical College in South Carolina.\nColleges and Universities in West Africa and the Caribbean, But Youth Clubs, Professional Organizations and National Teams.\n\nThe project highlights some risks in implementation, which will help the community to manage the risks if Funded, in addition, the feasibility of the idea will be better if the author comes up with a solution. to overcome those risks when it occurs. On the other hand, funding risk, or more precisely, financial risk is just one of the general areas of the project when it is funded to deploy, the author needs to list more than other risks such as human risk. risk (is there any basis to affirm that the project participants will go all the way, is there any commitment contract or legal covenant?), macro risk Due to political instability is very common In Africa, the factors affecting the project implementation schedule are considered as risks and need solutions to limit those risks.\n", "q0r": 4, "q1": "Great when a project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project is aiming for are also very specific and completely achievable. With a 10-week TiDi Nation 2022-2023-based 16-week Roadmap, the proposal's roadmap, if funded, is a truly impressive one. A project implementation plan is detailed and broken down to specific dates that correspond to the project actions achieved, making it easy for the project to be checked for progress if it is funded. . I believe in the science of this route.\n\nThe proposed project budget is less than 20% of the total budget of this challenge, compared to the information the proposal provides, some project expenditures need to be clarified if it is to be funded. A detailed budget should list hourly wages for workers in each locality, corresponding to the tasks of each person in the project team, the community needs to know, this helps to make the project transparent. better project. Compared to the information provided, it is a bit general and not yet a detailed budget.\n\n Human resources to implement this project have been assigned specific jobs for each item, the experience of the members shows that they are completely suitable for the project. However, the identities of the members are also difficult to verify. clear. The author of this project is Onyemachi (Machi) Provost - Machi is currently a College Football Coach and has a lot of experience in the Metaverse, along with his associates Troy Rohr - Involved in traditional form Internet and Television social media from the early days, Kendall Reyes - An educator both academically and in the world of football brings an amazing skill set and serves as the Team Editor-in-Chief, Shaquille ( AJ) Salandy - Current student-athlete at Howard University is an invaluable member of the team, Paul Martin - similar to Kendall is an Educator and has many years of classroom experience alongside knowledge. Has a background in marketing and graphic design, and Andy Salandy, former Dean of Life Sciences, College, Professional Athlete and Soccer Coach, shows this is a rich team experience. Experience in implementing this project, however, the author please provide more reputable identity verification links such as LinkedIn, Facebook, Twitter, Discord,… for easy and practical identity verification community. \n", "q1r": 4, "q2": "Project transparency is very good, this project provides KPIs for accomplishing project goals, all goals are easily measured thanks to the indicators provided by the project, and they are also easily tested in an implementation. Metrics like Social Media numbers for likes, views, engagement, and followers of the project or other information provided by the author are fully verifiable once the project is live.\n\nThe scheme has clearly defined success, the information from the scheme shows what is being done and how it is being done and testing has achieved considerable initial success which is amazing. Https://www.tidisports.com, https://www.habtamutibebe.com, or https://tidiapparel.com/ show the actual tests that the TiDi team is running even with sponsorship. or not, I hope TiDi's team stays with Catalyst, because this is not just another Catalyst proposition, it's a movement in Africa.\n\nBrand new idea information on Cardano platform never received any funding from Cardano ecosystem.\n", "q2r": 5, "assessor": "z_assessor_2489", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6151, "q0": "African student athletes, artists and creators lack access to resources and education. The team proposed the idea of ​​applying Tidi Nation to educate and teach them how to make money using the Cardano ecosystem. The proposal is good and matches the goal of the challenge. Here, the team is aiming to help African artists, athletes..., educate and teach them how to make money using the Cardano ecosystem. The proposal was described in great detail and richly. We know what the purpose of creating this content is. The author has presented us with many problems that are being solved; access reason, performance, production, results... The team will do that through live and virtual workshops, educating Project Catalyst for young developers and innovators, Using social media: Twitter, Discord, Instagram, Reddit, YouTube; ... besides, the author recognized the risks the proposal would face as cardano community-based funding, marketing and consulting, blockchain developers behind as well as placements and strategic partnership relations. However, the author's solution is not positive.", "q0r": 4, "q1": "The author has made a very specific plan. About the route. The author has analyzed the work to be done for many months. From September to December 2022. and thereafter, detailed milestones are divided by quarter and the work is allocated in a reasonable and professional manner. (4 quarters in 2023). we see that the main author of the idea, has almost gone to work. This conveys a lot of confidence in the author's involvement in the project. We know the work to be done, where, in space and time. Next is the budget. The proposal asks for $80,000. Less than 20% of the total challenge budget was set. In my opinion, the required value is quite reasonable given the complexity and time nature of the project. The author has provided a very detailed budget table. The budget is broken down and allocated to each very specific job, estimated hourly, for each job. Finally about the core members of the group. The group has 6 members, and each member is given a short text to introduce them. We know the members are all people with the right skills and experience to do the work on the project. It would be great if the author provides affiliate links of the members, so that we can know more about the history and experiences of the members that the proposal presents. Overall, the plan of the proposal is very good, the budget is transparent and the members are all skilled and experienced, which increases the feasibility of the proposal.", "q1r": 5, "q2": "TiDi Nation (TN) KPIs can be defined: impressions, cost effectiveness and customer return rate. The author provides us with good data to evaluate the proposal. I think, in fact, this is a good way to check the progress and success of the project. About the final product is the expectation, the success of the project. We know what it takes to get to the end result. The proposal has a detailed roadmap, a deeply explained budget, increased transparency of the proposal, and ease of auditing. In general, our wallet has a lot of information provided. Auditability is good. Impact on the challenge is to grow the African community and the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7437, "q0": "The African continent is the birthplace of the world's top athletes, with extraordinary physical backgrounds. The project of training, supporting African athletes to access resources from Catalyst should be a perfect fit for the Challenge\nThe listing project will support athletes, artists, and creators, which are three very large audiences. After researching referral links, I found TiDi Nation (TN) is a professional athlete training environment, I think you should focus on this segment first, it is definitely an advantage for you, is the premise to develop other arrays. Can the proposal better describe how to support athletes to access blockchain in general and Catalyst in particular? Since athletes are mostly focused on training, understanding other areas will be affected. Not to mention most of them lack background knowledge about computers, finance… And that is also a risk of the project. I really admire the goal of the project, it has a great impact, however, if the project focuses specifically on an athlete segment, I think the possibility of success is more feasible, I can only Can give 3 points in this part\n", "q0r": 3, "q1": "The detailed project budget sheet says 16 weeks, but the part of the plan I see lasts from Q2/2022 to Q4/2023, is there any confusion here?\nThe processes are listed by you in detail, specific to each job. Corresponding to that is a detailed budget table, with a total estimate of $80,000 ~ 16% of the total Challenge budget, which is not a small number. I think you should divide the project into several stages to apply for funding, while ensuring the work is focused, maximizing capacity, the possibility of approval will be higher. For example, complete training athletes, get useful results, then continue training artists and creators. As for the cost, I have a question. Why is the hourly salary of the delivery team higher than the R&D& manager salary? Looking forward to your answer\nThe team has 6 main members, diverse in areas as proposed presented. But I don't see any members specializing in Cardano, is there any need to seek more advisors from that array? The project please provide the social network links of each member so that the community can check and interact. I rate this part 3 points\n", "q1r": 3, "q2": "The suggested KPIs listed I see fit, but where will they be updated? Please specify for the community to follow easily. I would also like to add two other KPIs, the number of Catalyst projects created by athletes and the number of projects funded. These are two extremely important indicators, assessing the success of the project as the initial orientation. The success of the project will help athletes optimize their capabilities and the Cardano ecosystem will expand. Hope my contributions will help the project. I rate this part 4 points", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10798, "q0": "TiDi nation stands out among the numerous blockchain educational development concepts I have encountered for its tight organization and layout. By remaining focused on the challenge's purpose, you have examined the difficulties this project can tackle and laid the groundwork for the TiDi nation system. You've prepared a training path for young athletes and new innovators by making specific videos and courses available for various disciplines. After identifying a possible audience, you show the project execution procedure and include renowned individuals who will work with your team in the future. Your plan addresses the difficulty by spreading blockchain knowledge and increasing Cardano membership. It also assists young people in Africa in identifying the potential development environment suitable for them in the electronic money information ocean. However, because you stated the numerous major dangers the project might encounter, you should write a few more lines to explain how you would mitigate them, rather than simply saying in broad terms that your team will work diligently once the sponsorship is secured.\n", "q0r": 5, "q1": "You continue to do well in demonstrating the project's feasibility, much like a great introduction to the solution. In addition to the specific plan for the project's 16 weeks, you include a roadmap for the activities TiDi Nation aims to develop in 2023. It is clear that the 4 months your team requires budget money is to create the TiDi nation's skeleton and facilitate the deliverables that the proposal specified in the Impact section is realized. I admire your team's extensive preparation as well as your excellent orientation. Thanks to your team's talented and experienced professionals from several sectors (information technology, education, sports, marketing, graphic design, etc.), I believe you have enough ability to persuade investors that your idea will undoubtedly provide student-athletes with the most effective and high-quality educational programs.\n", "q1r": 5, "q2": "This proposal already contains two well-organized sections, thus it's difficult not to do the same in the final one. You offer thorough information about the project's key performance indicators (KPIs). The depiction of the project's success becomes more transparent and more credible as a result. Your skilled team demonstrates determination and seriousness when expecting TiDi Nation to become a movement rather than just an idea or notion. I wish you all the best in your endeavors, and let us work together to make Cardano a more wealthy place in the future.\n", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11622, "q0": "The proposal is not really  addressing\nThe challenge. The proposer and the team is seeking to create the awareness of their own platform which is TiDi Nation by accessing the funds of Cardano ecosystem to do so.  The proposal has also not showed how these student-athletes will be able to assess Cardano ecosystem. The proposal has not also state any of the key metrics for the Grow Africa Grow Cardano challenge in their proposal. \nIt is true that many athletes do not have the right mentors to educate them on how to use their talents and skills to improve their lives but they are being exploited by their managers and others especially in Africa but the proposal lacks  the solutions to solve that issue .", "q0r": 2, "q1": "As stated earlier it is not likely for this proposal to be implemented successfully. This is because the proposer and The team simple have  personal who have knowledge on how to coach young ones in sports arena but not in the block chains technology most especially the Cardano ecosystem and the benefits it’s having for the young African who has talent in sports and arts .", "q1r": 2, "q2": "In 2022, with the information provided, the team has not provided information as how they are going to execute the proposal but has highlighted that the project has a long them goal of 2023 and beyond. Therefore I think when this is funded you might not be able to see the success of the project in 2022 which fund 9 is more concern of to increase adoption by The continent Africa.", "q2r": 2, "assessor": "z_assessor_3261", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "TiDi Nation (TN) KPIs can be identified: impression, cost effective, and customer life-time return. TN will on-board, educate and teach student athletes how to monetize using the Cardano ecosystem.", "experience": "The team is comprised of educators, former/current college soccer players, coaches, and enthusiasts. With a collective knowledge of 60+ years of coaching, mentor-ship, and leadership experience we aim to provide access, resource, and support to African student athletes."}