{"id": 422565, "author": "jpg.store", "title": "African Ambassador for CNFTs", "url": "https://cardano.ideascale.com/a/dtd/422565-48088", "category": 26600, "amount": 40000, "description": "NFTs on Cardano have seen an uptick in trading volume over the past few months, though as per our analytics most of our traffic tends to originate from North America. ", "f6_no_assessments": 8, "f6_rating": 3.916666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 697, "q0": "The proposal is looking to find african artists and creators to onboard them into Cardano's NFT ecosystem, acting as an ambassador of Cardano (although I'm not certain if it'll represent CF or it'll directly work for JPG store, being the latter the most probably IMO). \nI think getting into the grounds of Africa as a Cardano/JPG ambassador for NFT into Cardano can be really impactful for generating and raising more awareness about Cardano's ecosystem, and their inherent purpose of connecting the unconnected developing countries, where Africa is one of the main focus points for this purpose. ", "q0r": 5, "q1": "The main problem - whic it's mentioned in the risk possiblity part - is finding the right fit canditate for this role. So it's kind of complicated to assess how this ambassador will execute his/her role, given that we know nothing about his/her experience and track record. It'll be good to know at least some candidates, or better know who'll be this person.\nAlso, they don't present a detailed breakdown plan, with the activities that the Cardano NFT Ambassador will execute. It'll be good to know more about this.\nLastly, they've mentioned that for executing the proposal they'll only need a one-time funding. However, they don't explain form where they'll be bringing the money to continue paying this Cardano NFT ambassador once the 6-month period is finished. I'd suggest to clarify if the person in such role would be fired, or would continue being hired as a JPG/CF representative of Cardano in Africa.", "q1r": 3, "q2": "I somewhat agree with the information provided to being sufficiently auditable. However, it'll be good to add some KPIs indicators, such as numbers of african artists onboarded, successful projects deployed on cardano from native africans, regions or number of countries onboarded, number of collaborations with local projects within and outside of Cardano's african ecosystem, etc.\n", "q2r": 4, "assessor": "z_assessor_2121", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1090, "q0": "Through this proposal, the number 1 marketplace on Cardano in terms of sales volume, JPGStore, is asking for funding for hiring an on-the-ground African ambassador for NFTs. The main task of the ambassador would be to locate artists and creators from the African territories and onboard them to NFTs.\nWhat is unclear though, as there is not much more information provided throughout the proposal, is what other steps JPGStore will take to ensure that the artists and creators will gain exposure and potential success? As an NFT artist on Cardano since last year, I know that half of the work starts after artists mint their NFTs. For example, there is another NFT marketplace on Cardano, developed by EMURGO. The marketplace, called Fibo, has been vetting and onboarding, African artists, on their platform, and has been promoting their art through all their official channels. Yet, I do not see an appeal or even a subject of discussion around this subject throughout the Cardano NFT community. As such, how will JPGStore address this issue? Or will their onboarding stop at the moment the artists will be minting their NFTs?\nWhile I see potential in this proposal, given the lack of details surrounding its primary objective, I cannot accurately assess its impact and suitability in the challenge metrics.", "q0r": 3, "q1": "The detailed plan and timeline describe in one single sentence, that the project will revolve around the duties of the ambassador over a period of 6 months. However, what those duties are, has not been explained. For this type of proposals it’s important to have an accurate description of tasks, even if it’s incomplete, to help us, the community, assess the implementation steps. For example, how will the ambassador find and contact the artists? Will he travel to different locations? Will he be searching online? Will he announce in a public (online) place that he’s looking for artists?\nThe budget has not been broken down, is very short and without any details. The description states that the budget of $40000 will be used to pay the salary of the ambassador for 6 months, as the team views that such a person would need to be paid with an annual salary of $80000. I do not know how the team has come up with this amount, while I understand that they want to compensate their ambassador highly, the annual salary on the African continent ranges from $1000 to $25000. Even if the intention is to pay someone well, they could still get at least 2 people hired as ambassadors from the requested amount and that might translate into a much wider reach across the continent. But since there are no other details on this subject either, I cannot properly assess the budget’s feasibility.\nThe ambassador remains to be hired after the proposal is funded, therefore no name or description could have been provided. But, what could have been provided, as I’m sure the team has already thought about this, is what kind of skills does the person need to have in order to be accepted for this task? And how much influence will that person have on the entire endeavour?\nGiven all the missing information in all fields of the feasibility section, I cannot accurately assess the proposal’s implementation.", "q1r": 3, "q2": "The onboarded number of artists and creators is definitely one of the most important factors to track for the project’s progress. Perhaps, though, some metrics regarding how many artists have been contacted and how many of those have accepted to join the NFT space would also be an interesting metric, both for the progress of the proposal but, also, as an important data point for the NFT ecosystem.\nWhile the success definition sounds very good, it has unfortunately no palpable accomplishments. For instance, as a continuation of the sentence provided, that mentions having an NFT ecosystem where African artists thrive, a minimum number of artists to have financial success after their onboarding operation is what I mean by palpable. The number doesn’t need to be high, it needs to be realistic, so that is up to the proposers to decide.\nConsidering the data provided, I rate the auditability section a 4.", "q2r": 4, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 4156, "q0": "Whilst the concept and idea of using an ambassador to lure more people in Africa towards using NFT's on Cardano there are some flaws to the the proposal is presented. Not enough information is given on why it should happen and how that will draw more people in Africa towards Cardano. There is also no way to prove how they will get people to join on either.", "q0r": 3, "q1": "The proposer/s plan is lacking some details when it comes to their timeline and budget breakdown. No information is given to how the $40 000 will be spent and what it will be spent on. The proposer/s also states that it will be $80 000 a year for the payment of their ambassador but their budget is $40 000. Their timeline also lacks key milestones and more details to when each step will happen. ", "q1r": 1, "q2": "It will be hard to audit the success and progress of this proposal as there is no real way to measure it. The proposer/s way of tracking the progress is by the addition of more talent in Cardano which will take a long time to show and can't be proven either. They do have a good set goal in mind to make Africa represented in Cardano and to get the addition of African creators as well.", "q2r": 2, "assessor": "z_assessor_2521", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 4230, "q0": "The \"African Ambassador for CNFTs\" proposal address the challenge \"Grow Africa, Grow Cardano\" objective very well by hiring and training on-ground ambassador for Cardano NFTs in Africa. The ambassador will  seek out local artist and creators within African territories and onboarding them to NFTs space. This will boost Cardano NFT adoption in Africa. The ambassador will act as the connecting person between artists and facilitators who bring cultural diversity to Cardano. The risk in this project implementation is finding the right ambassador who possesses the right blend between technical and artistic skill with community building experience to scale this project impact. With the direct experience as ambassador myself, I understand the importance of this role in promoting the protocol. The fair and transparent incentive structure is significant for this role and should be added in this proposal. The ambassador role impact should not be underestimated as this person could increase the protocol visibility and building rapports among community members if the jpg.store strategy is well communicated and implemented rightly.", "q0r": 5, "q1": "Upon secure funding, jpg,store will look for internal hire to perform this ambassador duties for the first 6 months to gain momentum in the community and the total budget of $40,000 is calculated from the pro-rate of salary bracket for this role at $80,000/year.  It's a one-time proposal and they are unlikely to seek further funding round. The proposal will get its full ranking in the feasibility if they would identify who is the C-level executive that would be interviewing for this role. I find it quite surprising that the person who fill this role normally would enjoy a lot of interaction with the local community and not from the candidate selection in top-down style. The proposer team should reconsider the approach in candidate selection. I believe that it is highly likely that jpg.store would locate the right ambassador to fill this role and for them to achieve their milestones within the required timeframe. They might need to fine-tune the approach and provided the clearer milestones (monthly milestone) for this ambassador role to measure if the ambassador duties are on track to make impact to the community. ", "q1r": 4, "q2": "Jpg.store views the onboarding of new talent and maintaining good relations with their communities as their KPIs of this proposal. Since this is a catalyst funding, the jpg.store could report back regularly the progress of their CNFTs promotion via the ambassadors on their public channel so the community wouldn't lose sight on this proposal success. The selected ambassador could do story telling to share their experience with wider Cardano community audience upon fulfilling their 6 months role. Should the jpg.store team include the monthly milestones in this proposal and indicate how they want to report back to the community on their progress, it will achieve a better ranking in auditability. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5865, "q0": "With this proposal, they want to address one of the challenge's most pressing issues. The majority of African artists are unaware of blockchain technology and the opportunities it presents. A Cardano ambassador with extensive knowledge of NFTs and Blockchain technology will be a fantastic solution to this situation.\nThe result will be that the majority of African artists will learn about the NFT marketplace, post their creative works there, and be able to sell and profit from them. Since it's a Cardano marketplace, artists who sign up automatically use the Cardano Blockchain and coin and participate in the Cardano ecosystem (ADA).\nThe ecosystem will see a rise in participation, and creators will be compensated for their work. As indicated by the proposers the Cardano marketplace will also have diverse cultures represented through art work and creations.", "q0r": 4, "q1": "The proposers indicate that the ambassador will work for 6 months educating and onboarding African artists. There is no specific plan laid out for the ambassadors work. They indicate that interviews will be done to recruit the ambassador. The amount requested is ok because they indicate it will be for incentivizing the ambassador. \nThe proposers provide links to their profiles and also a link to the market place and evidence.\nThey indicate that they will not come back for further funding because it will be done once.\nI think the proposers could've given a plan for the ambassadors activities, which country/countries in Africa the ambassador will work and how long he spends on one country. \nI think if a detailed plan is given, this proposal is a great one and will be implemented successfully. ", "q1r": 4, "q2": "The proposers have indicated that progress will be measured by onboarding of new talent. May be they should be more specific and have a target of artists they seek to onboard. This will be more measurable. The success metric is good and can be used to audit the completion of this project. \nI am giving 3 because there are no milestones with timelines. The budget is not well broken down. ", "q2r": 3, "assessor": "z_assessor_2754", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6493, "q0": "For this specific challenge setting of \"Grow Africa, Grow Cardano\" I can see this proposal being very beneficial. The team at Jpg.Store shares how most of their traffic comes from the USA. If we plan on growing Cardano in Africa, NFT's can be a big part of that. Especially CNFT's will utility that can help financially. Their plan is to hire an on-ground ambassador that will go and spread the news of JPG.Store and Cardano NFT's. The idea of this is to spark interest in African people and introduce many to the idea of NFT's and Cardano. Especially for those that have the interest, but don't have the means to do so. I think this will benefit the challenge setting, and overtime will increase engagement in the Cardano ecosystem around the world. This will have a global impact. For these reasons, I give this section 4 out of 5 stars.", "q0r": 4, "q1": "The team at Jpg.store has a lot of experience. They have been an early influencer in the CNFT community, and it has grown a lot over the past several months. There is a detailed roadmap that describes exactly what the team plans on accomplishing by hiring an on-ground ambassador. These funds will be given to the ambassador that is promoting their project and diversity in the CNFT space. The risk would be finding the right person that will likely be successful as an ambassador. I would suggest the team looks into finding several worthy candidates so if they are funded, they can start the process quickly. With the ever-growing community that supports Jpg.Store, I am to believe that they will be held accountable for this proposal. They have a detailed budget breakdwon that shows where the requested funds will go. If they select the right candidate for this position, there will be an increase in the CNFT space and will grow Africa, grow Cardano. For these reasons, I give this section 5 stars.", "q1r": 5, "q2": "The proposal includes a roadmap that articulates what will happen if funded. They plan to hire an ambassador as soon as funds are received. As I stated before, I think it would be important to have several potential candidates that could fulfil the requested position. Once this is taken care of, it will be a near perfect proposal. I would also suggest posting the details of this proposal on social media, so that the community can see exactly what the proposed idea is. This will ensure that if this proposal is funded, the community will be aware and will be able to check up on the progress of the candidate in Africa. The community would be able to see new innovation and more cultural diversity to the CNFT space. Having a monthly update could potentially be something important as well. To monitor the progress and to recognize how beneficial the proposal has been and will give better suggestions in the future for other proposals or ideas that the team has. For these reasons. I give this section 4 stars. ", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11406, "q0": "Cardano is a proof -of -stake blockchain founded on peer reviewed research and developed through evidence based methods. It combines pioneering technologies to provide unparalleled security and sustainability to decentralised applications systems and societies. Current hype surrounding NFTs can consider developing own NFT on Cardano blockchain. As NFTs on Cardano have trading volume over few months hiring training on ground ambassador for cardano NFTs in Africa can find artists and creators within African territories and onboard them to NFTs. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The proposal has provided detailed plan including timeline and key milestones. The proposer knows an identifiable manner , the type and number of required to implement the proposal. The budget is outlined clearly and broken down into idenfiable items and is reasonable to achieve set goals. It offers a realistic timetable to complete the work and provides a sensible and conductible plan for implementation that shows not only what is being done but also how. The people working with the proposal will be hired once the funding while C level executives are individuals for this position. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The metrics provided clearly align with proposal goal and timeline and surely address the challenge requirements. The budget is brokendown clearly and is reasonably achievable. The action plan is quite nice and doable. The proposers idea is unique and by funding community can expect during the project implementation. The proposer has provided enough past experience in CNFTs and plan clearly explains all technical aspects from architecture and technology be used. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 11493, "q0": "The high adoption of the NFT trade on the Cardano trading platform is a great way to venture into the huge market that Africa can provide for this ecosystem. With the motive being to fuel adoptions in Africa as well as driving sustainability that derive the innovations of blockchain, I believe this project is set on achieving this initiative for the Cardano ecosystem growth. For a successful integration, I believe it is very commendable that the project is focusing on the arts and NFT trades. Africa for a while now has been making waves not only in its music genre but in the creation of digital arts and the rise of digital trades in the blockchain ecosystem. I believe this is a step in the right direction to onboard as many artists and collectors as possible to improve the diversities borne in Africa. If Cardano can spearhead this movement, it stands to gain credibility as an African community lead and an ecosystem that drives sustainability in Africa. Not only can artists and blockchain enthusiasts benefit from the long term monetary benefits in the NFT ecosystem, but cardano drive to integrate working ideas can be beneficial to Africans onboarded in other aspects of the blockchain ecosystem. Creating a much better economic value for Africans and changing the level of progressiveness in the continent. I strongly agree that the proposal identifies a problem that can influence the adoption of cardano’s blockchain technologies. \n\n", "q0r": 5, "q1": "Given that the team is in collaboration with jpg.store, an NFT platform focused solely on the trade activities in the cardano ecosystem, is a strong basis of trust for the project. I believe a collaboration like this could only yield results that would impact the cardano community. The proposal addresses this phase as a recruiting stage for the Cardano NFT Africa representative, however very little information is provided on the duties as a representative in the art industry in Africa. Perhaps a roadmap for operation in the indicated 6months salary ask in funding for the representative, would have provided a clear scope on what to expect, the targeted counties/artists onboarded etc. during its implementation. Also no known metric was mentioned in the proposal to track the overall progress by community members. However, looking at the team behind the initiative and their success rate, I strongly agree with the successful implementation of the proposal. \n\n", "q1r": 5, "q2": "The proposal makes no mention of a medium the community can use to connect with the project post-funding. The deliverable for the project however remains that there is the need for an African representative; placed in position that educates artists and collectors, while inviting them to trade on the cardano NFT platform; jpg.store. Despite the lack of detailed road maps to achieve this project, I believe it is a collaboration that does improve the adoption of cardano blockchain technology and others. I agree that this project can be successfully implemented regardless of the shortness in auditability. It's a 4 out of 5 for auditability. \n", "q2r": 4, "assessor": "z_assessor_3252", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We want to hire and train an on-ground ambassador for Cardano NFTs in Africa. This person’s main task would be to find artists & creators within African territories and onboard them to NFTs.", "experience": "The team at JPG launched the marketplace in the second week of November 2021. Since then JPG has pushed to create a user driven marketplace servicing all NFTs on Cardano."}