{"id": 422744, "author": "nebiyus", "title": "East Africa Cardano Innovation Hub", "url": "https://cardano.ideascale.com/a/dtd/422744-48088", "category": 26600, "amount": 28400, "description": "The absence of a Coordination Hub and a space for Cardano enthusiasts to collaborate, it is limiting the growth of Cardano in East Africa", "f6_no_assessments": 5, "f6_rating": 4.2666666666666675, "videos": [], "media": [], "f6_assessments": [{"id": 9418, "q0": "The proposal East Africa Cardano Hub is a proposal that seeks to address a challenge in the East African side of the globe and the community as a a whole. The proposer addresses this challenge because there is the realization of creating the awareness about the Cardano Community in East Africa, Ethiopia to be précised. Because of the absence of coordination Hub and space for Cardano enthusiast, the proposer believes by creating a hub it will bring collaboration which will link to growth in the community. This the proposer believes will allow people to meet both virtually and physically to shear ideas, seek for talent and shear experience and by that doing people will get to know more of the Cardano community. There is a challenge to be solved here being that a lot of people do not know about the Cardano community in Africa and for that matter the entire globe. In other to add growth and create awareness about the Cardano community and its benefits, hence the establishment of the Hub starting from East Africa. This will bring massive growth to the Cardano community because the proposer is aiming at organizing programs and creating office space where people can meet both virtually and physically to address issues about entrepreneurship, Education, and freelancers to foster the development of Cardano products in East Africa. The KPIs indicators shared in this proposal matches the one in the challenge being that he proposer talks of Co-working area where members will meet both virtually and physically to shear ideas on in depth understanding of the technologies of entrepreneurs, Cardano developers and students meet ups. To be a member is free but something small must be paid to get access to such meetings. Also the proposer talks of self service area where members can bring their own snacks whiles working or buy drinks at a low cost in the cafe. There will also be a kitchen where members can warm their food. There will also be a platform for sharing. This is where the proposer talks of Endubis hub where those in the creative arts industry will display their work on a physical board for everyone to view. This will be on a professional level because it will talk about members in the community, their competencies, projects they are currently working on, the kind of support they could need, job offers among others. This board is also referred to by the proposer as the citizen board in the hub where The citizen board is the formal space that ties the network together. It is where you find out what people are working on and how you can help. It's where you find out whom to ask for what. This proposal will address future challenge. This is so because when this hub or space is created, it will help with the growth of the Cardano community in East Africa and the entire globe. Members will know where to go and to whom they must enquire from regarding every field. Also there will be the virtual space for the large community to follow.", "q0r": 5, "q1": "This proposal is highly likely to be implemented successfully because of the quality of members the proposer is bringing on board, one of the risk the proposer identified is the hub turning into a shared working space and for that matter, quality membership is assured to check this.\nBased on experience from an ongoing funded project like \"student Ambassador Program\" and \"Cardano Networking Events\", there will be a collaboration when it comes to recruitments in order to mitigate the risk of turning the hub into a shared working space. This i believe will help with the implementation of the project successfully.\nTeam members on this projects are 4 namely;\nHub Manager - Bezawit\nRecruitment head - Nebiyu\nCommunity Builder - TBA\nPartnership Manager - TBA\nTimeline outlined for this project is 6 month and the proposer has clearly outlined how he and his team members will clearly out his budget as well concerning how the implementation will go successfully; The project is aiming to use a fund of USD 28400\n1. 6 months Rent+utilities: 10,000\n2. Furnishing/renovation: 5,600\n3. Marketing: 500\n4. Events for community members: 1000\n5. Office Equipment: 2000\n6. Staff Salary: 4000\n7. Creation of a Virtual Platform: 500\n8. Business meetups: 1000\n9. Motivational Speakers and Trainers: 2000\n10. Assistance in MVP development for projects: 1500\n11. Business Licence/registration: 300\nlooking at the timeline of the project that has been outlined by the proposer, there would not be the need to request for extra fund.\nBetween October 2022 - November 2022: The proposer talks of minor renovations and  small community consultation meetings.\nBetween November 2022 - December 2022: There will finishing ups of the hub to determine what works and what does not work, what must be changed. Members would be invited to the hub to be introduced to how the place works and how the community wall works with its interpretations.\nJanuary 2023 and on: Work kick starts from this timeline onwards. Hub will be officially be functional .\nSince East Africa (Ethiopia) is an English speaking county it will be advisable if the proposal can translate this project into other African languages so that everyone in the Cardano community can benefit.\nTechnologies used in this project is the virtual aspect and since now we leave in a virtual community, i think its very beneficial to the Cardano community. There will be an awareness to this projects because the proposer and his team members have already a funded projects which they will collaborate in terms of sharing ideas and seeking for information which will help implement this project successfully. \n", "q1r": 5, "q2": "The proposal  clearly provided his timeline for achieving the success of this.30 members for the physical space\n200 members for the virtual space\n10 projects/products started by the community members\nPartnership with at least 2 hubs in East Africa\n1000 people reached through promotion within east Africa.\n The KPIs used in this proposal makes sense in a way that the proposer has clearly indicated how the success of it will look like\n3 months: Bi-Weekly events with 20+ participants; 30 newbies to Cardano; 10 members\n6 months: Weekly Virtual meetups 30+ participants;100 newbies to Cardano;\n12 months: Self-sustaining Hub, through investor funding for access to talent\nSince this is entirely a new project East Africa Cardano Innovation Hub, it aims to end poverty everywhere in the community, ensure equitable education for all and Promote sustained, inclusive, and sustainable economic growth, full and productive employment, and decent work for all. The proposer provided a LinkedIn link which will help community members to connect to each other and by doing that, members can keep track of the project. The other link provided is not too relevant to the project. Once the hub is established there is the believe it will help spread the news about the great Cardano Community.", "q2r": 4, "assessor": "z_assessor_3057", "no_vca": 2, "ne": 2, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 3413, "q0": "A physical space where cardano lovers can meet to share experience, to learn from each other, to get information arounnd cardano, to do research around the ecosystem, and to meet blockchain lovers is what's behind this proposal idea.\nThis is an exciting idea as it would create an opportunity to expand cardano and to allow new people to onboard into the project catalyst and be as active as they may be.\nAfrica being one of the target region for Cardano, an extra physical infrastructure built or installed, is a big addition to the ecosystem implementation.\nThe East Africa Cardano Innovation Hub is an initiative that is aligned with the challenge objectives and fit with the catalyst priorities.\nAn based on this, I rate it with a 5 star.", "q0r": 5, "q1": "Opening a Hub in Addis-Ababa is a great idea submitted by the proposers team in the perspective of expanding cardano influence in Africa. And the success of such initiative would be very beneficial to the entire cardano African in general, and those in Addis-Ababa in particular.\nNevertheless all the benefit that could come out of this initiative, it's still need to be successful, and that's why based on what is presented in the proposal, there are prerequisites, including the experience and expertise of the proposals teams, which unfortunately it's not shown in the proposal. There's no any social media links that would allow readers to learn more about the proposers.\nAbout the budget, there's a breakdown of it, but some lines are not self explanatory. When talking about salary, it would be better to know how this is divided among how pay staff at which pay rate. \nAs a physical space that has to be maintained, there should be a sustainability plan to make sure the project will be viable in the long run. And one of the sustainability aspects for such initiative, is the rent cost. The budget plan for a 7 months cost, but nothing is revealed about how this will be paid after that period of time.\nThis may make any evaluator to doubt about the viability and avoid funding this initiative, even though it' can be a great success if well done.\nFor that I rate it with 3 star.", "q1r": 3, "q2": "A physical infrastructure is easy to see and testify its operationality, but the catalyst community is all over the world and has the right to follow the success of any projects funded under it. But no follow up mechanism has been revealed by the proposers team.\nI think it would be of a big interest for readers of this proposal to also learn projection on the number of new people who join the catalyst community, the number of active members who play some roles in the catalyst. Since, the Hub would be visited by various types of people and some may want to get involved.\nThe team has given some elements on what would be measured to track the project implementation, but missing the how this will be done.", "q2r": 3, "assessor": "z_assessor_2458", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5069, "q0": "This is what I expected to see in this challenge. Making a physical space for learning and collaboration is right on target for growing Cardano in Africa. Face to face engagement is proven to be the best way to teach new people about Cardano and blockchain. It is such new and unusual technology that adoption is best spread when people can see enthusiasm in others. The tools are also new and unusual looking, so individual training is best. \n\nMany potential new adopters in Ethiopia are likely people who do not have computers or workspace. This proposal addresses those concerns as well. \n\n", "q0r": 5, "q1": "It is difficult to address the experience of the proposers. The main organizer does have experience bringing people together. This experience is from running a hostel which positions itself as a nonstop party. Getting young people to parties is generally not a difficult task so we do not learn much from that regarding the ability to run a space for education and professional work. \n\nThe plan looks very doable for people with organizing experience. This is some evidence that the proposers do understand the task at hand. The detailed plan is very convincing that the proposal can be implemented successfully.\n\n ", "q1r": 4, "q2": "The KPIs for the first six months are very clear and objective. the Cardano community can be confident that there is a workable matrix of goals and milestones to track.\n\nThe audibility section is tight and focuses on achievable goals. Accomplishments will be very easy to compare to the measures of success listed. \n\nThe attention to detail in the SDG section is impressive. The proposers appear to really understand the power of growing Cardano in Africa, as well as the challenges. By providing KPIs for the SDGs we get a very confident feeling about the ability to audit the progress and success of this project.", "q2r": 5, "assessor": "z_assessor_2669", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8476, "q0": "I really like how the purpose of the idea is to construct a Coordination Hub for Cardano enthusiasts in Ethiopia so that they can work together and share information with other people in the Cardano community there. The hub, which will be hosted by experienced Cardano teams, will be vital in boosting understanding of Cardano in particular as well as blockchain in general among a wide variety of Ethiopian classes, including students, developers, and business owners. In addition to this, Proposer offers an unique feature in the form of a board of polaroid photographs that features users' personal profiles and the areas of knowledge in which they excel. This feature is intended to inspire members to support and engage with one another.\nHowever, there is a fairly clear overview of the hub by itself, but there isn't all that much of a clear overview of the virtual space; therefore, I would appreciate some additional clarification regarding that subject. In addition, I believe there should be more information about the current situation of blockchain understanding in Addis Ababa, so that we can better understand the reason why this location will be a suitable place to organize the hub. This will allow us to better understand why this location will be a suitable place to organize the event.\nIn general, this plan does an effective job of addressing the problem, and it seems very evident to me that it might potentially address future problems throughout Africa as well.", "q0r": 4, "q1": "The plan contains a basic schedule of activities that will be carried out throughout the course of the upcoming six months. However, I n order to evaluate the plan in relation to the proposed budget, more specific information regarding the marketing campaign, the primary content of meetups, staff recruiting data, etc. should be included in the plan.\nThe proposer only provides a linkedin profile for the manager, in which it is not entirely obvious how much expertise he has in blockchain technology or marketing rather than in running a co-working space. The proposer does not particularly refer to any experienced Cardano members, whose cooperation would be vital in contributing to the operation of a Cardano innovation hub. This does not provide sufficient information about the abilities and experience that are required to properly execute this task.\nTo summarize, the idea lacks the information necessary to be considered practically viable.", "q1r": 3, "q2": "The innovation hub's progress can be adequately audited thanks to the specific key performance indicators that are outlined in the proposal. In addition, the proposal outlines what the successful completion of this project would look like after three, six, or twelve months.\nI would add one extra statistic to watch, and that would be the ratio of good to negative comments following the event. This might be a reliable source for judging whether or not the audience is interested in the idea of the meetups, as well as whether or not they comprehend the approach. In addition, I believe that making the community aware of the progress being made by posting a report on it every month would be a valuable addition.", "q2r": 4, "assessor": "z_assessor_2985", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9413, "q0": "The Proposal mentions the absence of a Coordination Hub and a space for Cardano enthusiasts to collaborate, leading to the limit of Cardano development in East Africa. To solve the problem, a Hub is designed for collaboration and allowing people to share experiences, learn from one another and outsource or seek talent. The proposer aims at 3 target groups that the Innovation Hub wants to attract, and through these groups, he hopes to make East Africa a leader in Cardano Adoption. Three target groups include: students of creative and tech schools; the aspiring blockchain entrepreneur and the freelancer. The proposal therefore addresses the challenges effectively, describes clearly the solution. Through Cardano Hub, the Cardano value surely increases and the Cardano community will therefore broaden widely. I evaluate mark 5 for this criteria.", "q0r": 5, "q1": "Through the description of the proposal, I can see the particular KPIs for evaluation for short and long terms. In the period of 12 months, the success will be evaluated by the particular result after 3 months, 6 months and 12 months. For long term, the proposer has goals and sub goals, these surely helps reader have good overview of the whole project. For the participant competence, I wish to have further information besides the list that he is organizing a Cardano Community in Ethiopia (such as main activities, what the writer gains after a specific time, etc.). For budget, it is described logically. The proposer could have more persuasive impact by showing the numeric calculation of each item. Regarding the risk, the proposer understands that it is necessary to ensure the membership quality. To solve this problem, he will be focusing on recruitment for the first quarter. This will be conducted in collaboration with ongoing funded project \"student Ambassador Program\" and \"Cardano Networking Events\". I agree with the writer but if possible, he should consider what would happen if he cannot ask for sponsor after 12 months, he should have detail plan for attraction. I give mark 4 for this criteria.", "q1r": 4, "q2": "This proposal has good schedule and clear time for completion. Each KPI is easy to understand and follow. The problem solution is easy to understand, through the way he organizes the Hub. The Hub is organized in layers, including: Open Space (in the ground area for the public), Co-working Area (open for members), Self Service area and Platform for Sharing. I evaluate mark 5 for this criteria.", "q2r": 5, "assessor": "z_assessor_3052", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "A Hub designed for collaboration; to allow people to share experiences, learn from one another and outsource or seek talent.", "experience": "\ncurrently running a co-working/living space\nCardano Community Organizer in Ethiopia\n\nhttps://www.linkedin.com/in/nebiyu-sultan-30775446"}