{"id": 422842, "author": "bd", "title": "Cardano Youth Ambassadors", "url": "https://cardano.ideascale.com/a/dtd/422842-48088", "category": 26600, "amount": 50000, "description": "Youth in Africa is unaware of Cardano, the blockchain, and the potential to use its application for social impact and a more decentralized future.", "f6_no_assessments": 11, "f6_rating": 4.878787878787879, "videos": [], "media": [], "f6_assessments": [{"id": 7653, "q0": "The problem described in this proposal is closely aligned with the challenge.\nThe team has done a great job by putting the proposal at the right challenge. The proposal clearly provides precise solutions to the problem of the challenge. Goodwall’s proposal is to continuously develop an educational program about blockchain and its applications for social impact targeting youth all over Africa. Goodwall runs educational programs to over 2M youth on its platform this is  something which is already imparting the lives of Africans and it is commendable. \nThe key metrics and goals of the proposal align with the outlined challenge settings. Furthermore, the proposal is able to scale to address future challenges such as  empower youth in Africa who are keen to learn about blockchain applications, create opportunities, and advocate for its use for a more decentralized future. Through the creation of these meaningful events online they are able to bring onboard many youth in Africa on the Cardano ecosystem. The proposal clearly articulates a plan for the project's future sustainability. That is, it will select 5 ambassadors per theme a total of 20, create 1 million impressions, organize 30,000 engagements, take 1,000 video entries, and take participant feedback to know whether they are very positive towards Cardano and blockchain. ", "q0r": 5, "q1": "The proposer has provided relevant links to members of the team who will help in project execution. The proposer provides evidence and references, links, web addresses etc including other projects the team are working on and they all have the relevant skills and experience needed to implement the proposal. \nThe proposal has done well by providing a detailed budget, broken into identifiable bits and how they are going to be used to execute it should they be funded. \nThe proposer has identified the type and number of team members required to implement the proposal which speaks volumes about their credentials. \nThe proposal also offers a realistic timetable to complete the work. They proposal goes further to provide a sensible and conductible plan for implementation. And finally, the proposer has considered challenges and risks relevant to a successful implementation and how to mitigate them should they be funded.\n", "q1r": 5, "q2": "They have provided a roadmap with milestones and a clear time horizon for achievement. That is to select 5 ambassadors per theme a total of 20, secondly create 1 million impressions and 30,000 engagements. Further create 1,000 video entries, and ensure participant feedback is taken. Goodwall according to their writings works in full transparency and will provide extensive reports based on the projects and objectives. They have also provided a well-thought out Metrics/KPIs.  There is also a clear understandable description of the targeted problem which is youth engagement in Cardano.  The solution will be to engage more youth in the Goodwall platform which has over 2M people to work together and address the problem.  An accessible public channel for delivering regular updates to the community for auditing progress an also be accessed on their platform which will be shared on the Cardano ecosystem with everyone. \n\n", "q2r": 5, "assessor": "z_assessor_2908", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 471, "q0": "This proposal accelerates the connectivity of the African students and its youth to other students and youth around the world. Through Goodwall, Africans can have equal opportunities and access to education, scholarships and internships globally. Now with this current proposal, Goodwall seeks to provide guidance to the African youth to become catalyst of further Cardano adoption by being ambassadors. Ambassadors that coordinate with other youth ambassadors worldwide and through various other impact driven channels created by Goodwalls mix of youth community and core management. This will foster continuous and even perhaps endless onboarding of the youth across Africa.", "q0r": 5, "q1": "The Goodwall team has successfully built a thriving app encompassing various regions, universities and institutions around the world. With a community of around 2,5 million students worldwide, with numerous scholarships and internships available on the app is a testament of their proven onboarding model.\n\nA development of their initial onboarding model is by having a hackathon to identify the most influential African youth to spread the word of Cardano. WIth the keyword here being development from it's tried and tested winning empowerment model.\n\nThere is little doubt, the amazing team of Goodwall will continue their amazing success not only in the formulation of their apps but also their success as a winning funded proposer.", "q1r": 5, "q2": "In terms of their roadmap it is very thorough, could have been even more detailed though by going per week or have an even more specific milestones. But as is, one can easily imagine what happens during the duration estimated.\n\nBudget wise though is very generalistic, it only consists of ; a topic, what action will be taken and what amount is allocated. There is no specifics and metrics of each allocation. For example there is a mentioning of digital marketing plan, but not given specifics what are those digital marketing. This happen through their budget section, it's as if the Goodwall team is asking us to trust in their established reputation. This though is not a good example for other proposals. It allows for complacency for newbies. Word of wisdom to Goodwall team to please adhere to the writing standard of Catalyst School.\n\nBesides that discrepancy, other metrics are clearly stated but some metrics are not known how will these be reported. Although, they did explain this in their previous funded proposal with a very detailed reporting format. Again, Goodwall has allowed just a tad bit of complacency to creep in. Continuation and refinement of their first submitted and funded proposal would probably be the best practice for future proposals.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 3414, "q0": "Youth ambassadors that will be trained and exposed to the cardano ecosystem, they would really be able to play that role of ambbassadors. \nBy executing this project, it'll empower youth in Africa who are keen to learn about blockchain applications and opportunities and advocate for its use for a more decentralized future.\nThat's why my rate is 5 star", "q0r": 5, "q1": "The experience acquired by the proposers team from the previous application submitted in Fund-8 and funded, will help them work on this one. And they would use the outcomes of the previous to adjust the current one.\nOnce trained and exposed to the Cardano ecosystem on a regular basis, the Youth Ambassadors will play the role of spokesperson.  \nThey consider this application as a phase 2 of the other one submitted in the previous funding cycle. The focus in placed on regular challenges, with bi-weekly meeting during the entire duration of the project implementation.\nThe breakdown of the budget is detailed but I found the budget cost a bit high for such activities, meanwhile nothing is shared about the bi-weekly meeting facilitators, even if these come from the team proposers, it should be explained in the proposal.\nThe timeframe is reasonable.\nInitiated by Good wall, this project ha chances to be successful as a lot of people with various knowledge may support and help the implementation process", "q1r": 5, "q2": "The Goodwall is a big organization working with youth online on various topics. Their website will be used for follow up of progress by the community. KPI's are detailed and clear\npotential risks are mitigated with reasonable ideas.\nMy rating on this is 5.", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5070, "q0": "This addresses all the goals of the challenge. By reaching out to the youth of Africa and giving them the tools to interact with Cardano and each other the proposal sets up a program to grow Cardano in Africa.\n\nThe population in Africa is very young. Like young people everywhere, Africans use their mobile phones a lot, and that is increasing. This proposal takes a mobile-first approach to teaching youth. \n\nThe many approaches - networking, partnership development and media outreach targets young Africans where they are, using the tools they are familiar with. This is a very broad plan that addresses most, if not all, of the goals of the challenge.", "q0r": 5, "q1": "This is really an extension of ongoing programs. The current programs boast millions of users so it seems very likely this will succeed on all it's goals.\n\nThere is a large team working on this. The team has a variety of relevant experience. The team also has the invaluable experience of working together and being successful. \n\nThe proposal lists seven risks. Each one is addressed in detail. this seems to be a benefit of experience both of working in the field and running successful Catalyst proposals. This shows exceptional understanding of the what's involved and gives a high level of confidence.", "q1r": 5, "q2": "The timeline and goals are all very clearly presented. The objective measures such as number of new users, numbers of media posts, etc. provide a ready framework for the public to audit the progress and success. \n\nThe proposal has three very clear categories to measure success. Impressions, showing viewership of content; engagements to track growth through interactions and challenge entries which will indicate deep involvement with Cardano. This tracking of challenge entries really stands out as a way to highlight long-term engagement with Cardano.", "q2r": 5, "assessor": "z_assessor_2669", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6154, "q0": "Africa is the second most populous and second largest continent in the world. Africa's economy encompasses the continent's trade, industry, agriculture, and human resources. However, young Africans do not know about Cardano, Blockchain and the potential use of the application. Goodwall runs educational programs for more than two million youth across 150+ countries and is developing an educational program on Blockchain followed by a Hackathon to identify Cardano Youth Ambassadors. The vision of the proposal is to be the starting point for young people around the world who are looking to start their Blockchain journey. This solution will empower youth in Africa who want to learn about Blockchain opportunities and applications. Also advocating its use for a more decentralized future. Propose detailed description and solution of impact with the challenge posed. In addition, the team recognized many risks and had solutions for each risk, minimizing difficulties and obstacles when the proposal was implemented.", "q0r": 5, "q1": "The proposal has a clear plan. The detailed roadmap includes five steps: Survey; SM assets and co-branded content; challenge on Goodwall ; Hackathons ; and finally the virtual event. The steps are explained by the group in detail for each task to be performed, and are distributed by weeks. We know what needs to be done and how, and in what time frame. Next is the budget. The proposal asks for $50,000, representing 10% of the total challenge budget. My opinion. The required budget is appropriate for all activities in the project to be carried out. The team provided a budget table with the budgets broken down for each job in a coherent way. All is clear here. Finally, about the team of members involved in the project. We went to the link provided, and we found everything we wanted to find out. We know the identity, role, duties, skills and experience of all members with CV link. Proposal has perfect plan, transparent budget and skilled team, increasing the feasibility of the proposal.", "q1r": 5, "q2": "The auditability of the proposal is very good. The team cares a lot about this part of the proposal. The team gave us a lot of information: the five main program goals and three key indicators. We know what to expect. About the final product that is what is expected to be the success of this project. Information is complete and satisfactory is established here. Clear roadmap, detailed budget and transparency. Team members are people with sufficient skills and experience. All workable and transparent. Overall it's good auditability. Easily measure the progress and success of your proposal. Proposal to impact the challenge, achieve the goals of African youth development and develop Africa and the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7883, "q0": "The proposal address an major problem of youth in Africa is unaware of cardano , the block chain and the potential to use the application for social impact the proposer came with the excellent solution i.e goodwall it is an professional development platform which will help to educate youth about cardano and block chain accross countries by conducting some educational programs. It is for social impact targeting youth all over Africa , it is being funded by cardano and they made a group for youth and regular communication Between goodwall and post regularly about cardano in those channels about block chain for digital I'd , wallet, certificate as such and they also made available to access educational content , video, session to African youth, Who are interested and case study for youth and the challenge the proposed solution will be address with key objectivea are also mentioned clearly and the proposer is also aware about the risk involved in the proposal they also has required action plan to overcome from this risk and each and every point are explained in detail so they are very passionate about this proposal .", "q0r": 5, "q1": "The proposal comes out with an detailed and eloborated plan and which includes the key milestones that the team plan to achieve. The proposer mentions that how the survey went and for how many weeks they have expounded in detail about the African youths .how the participate ,how many of them learned block chain for how long this have been shown limpidly and about the final virtual event ,hackathon to incubate ideas ,one challenge on goodwall to shortlist 10 youth per theme and also they provided us with a detailed budget breakdown how they manage the fund and how they segregate their fund to the different programs or department,  they have clearly or systematically stated all the fund segregation and the total fund needed or total budget breakdown is $ 50,000 and also they provided detailed information about the members who will be working in this project in a impressive manner they provided us with a CV of a workers too they assured us that to return to catalyst in a later round for further funding with a great Ideas and they aim to continue applying in next funds or proposal they are the members who are pellcidly identified by there work experience they put together to make this idea into a reality is very trustworthy. The member carry a lot of experience and skills from there previous year of working in other proposals and they also worked in an other proposals in this funds this shows the passion and future plan for this proposal.", "q1r": 5, "q2": "The proposal along with its wonderfully laid out game plan also comes with excellent ideas  regardless of how unique and interesting it is there are proper materic to measure a project progress they stated that this are transparent and provides extensive reports based on the project and objectives and this are specifically shown all the key objectives and key indicators about this project proposal and there are proper materic to the sucess of this project they are clear with there survey and program which ever they made will leads to the sucess and the youth will be aware about the cardano in Africa and the ambassador for it they educated the youth about cardano they set up live dashboard to reach there target and they are expecting 300 new people being interested in cardano and they are entirely new one for the proposal so , they should be more careful in this project SDG rating is also clearly stated in this proposal by the proposer", "q2r": 4, "assessor": "z_assessor_2930", "no_vca": 6, "ne": 2, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 8420, "q0": "The proposer wrote this proposal with a very clear description of what will be done which will certainly foster interest in the younger generation about blockchain, especially cardano. This program will produce a lot of content with 4 hackathon themes and will make ambassadors as representatives to promote cardano more broadly in Africa. All risks that may arise are also explained with mitigation solutions. My suggestion is that at the end of this program, all content can be uploaded on the YouTube channel's goodwall so that it can be spread more widely and can be monetized for further program continuity.", "q0r": 5, "q1": "The plans drawn up have a very detailed timeline, including the use of funds and the working team. It can be seen in the permalink that the composition of the team is complete with their respective work experiences. Even though the team has other proposals in this fund9 but I believe if this proposal is accepted then the team certainly has good time management to implement all these proposals and complete them well, especially with previous experience with the received fund8.", "q1r": 5, "q2": "I see that the audit process to measure the success rate of this program is indicated by clear key objectives and key indicators. The success of this program will also be assessed through the 3 aspects mentioned in the proposal. If at the end of the program all the content produced is posted on a youtube channel that can be accessed more widely, it will certainly show the success of this program and also show the selected ambassadors through messages on social media and local, national, international media in Africa.", "q2r": 4, "assessor": "z_assessor_2982", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8964, "q0": "As there are lot of places in Africa where people are unaware of cardano eco system, Even then Godwall has been promoting project catalyst through its map, the project wants to make use of this app and conduct a survey , later set a challenge for 4 different themes and find 10 candidates per theme and later conduct hackathon to find the youth ambassadors which is definitely i great idea, where it will provide opportunity to any member to be a Youth Ambassador with 100% transparency , by this it can create awareness among the  people related to cardano ,Hence this idea effectively addresses the challenge.\n", "q0r": 5, "q1": "The plan presented doesn't involve any risk in it , where this will be marketed through Godwall App so that maximum number of people will participate in it, later setting up a challenge and setting up a hackathon can also be achieved without any risks, and finding the results and announcing the youth Ambassador can also be achieved without any barrier , hence to make a cardano youth ambassador in a efficient way , this one of the best idea, where it involves great transparency in the process, Godwall has 2 funded projects from fund 8, hence with experience in blockchain development, and with Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposed solution has clear goal to achieve for selecting cardano youth ambassador, the audit has mentioned clear steps on how the process goes on from creating awareness, and conducting challenges, hackathon and announcing the cardano youth members. the audit even contains on how they have got funding from their previous projects.\nThe audit has detailed budget breaking idea on how to utilize the funds efficiently, it even contains timeline of the project which involves each and every steps to complete the project, with great key indicators to create impression over 1 mn people, and minimal risk involved in the project, The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11410, "q0": "Cardano is one of the few cryptocurrencies aiming to serve underdeveloped nations. Cardano can penetrate the African market for betterment of society. It can be used to build smart contracts , create decentralised applications and protocols. In addition, the ability to send and receive funds instantly for minimal fees, has many applications in the world of business and finance. The cardano blockchain will provide IDs for the students and can track student performance in African country schools. Africa has been fertile ground for crypto experimentation yet the youth in Africa is unaware of its potential to use its application for social impact. A huge community of African youth and developing educational program is made to identify cardano youth ambassadors in Africa. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The proposer has provided plan including SM assets and co-branded content, survey to understand how much youth learned about the blockchain with educational program fund, hackerthon to incubate ideas. The survey includes defining themes and designing ads and promotion of survey and it's analysis which occurs in 6-8 weeks. Assets has ideation to promotion upto 4weeks and challenge ideation and final virtual events. The budget breakdown is given clearly under different programmes like designing, partnership development, creating program material and promotion so on. The team working with this project have good experience. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The metrics provided clearly align with proposal goal and timeline, it surely address the challenge requirements. The roadmap given is doable and achievable. The objectives has 5 ambassador per theme and participant feedback towards cardano and blockchain. African youth are very good learners of digital skills in very enthusiastic way. The success of this project has very high chances . The budget plan is well described. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 11684, "q0": "The proposer has done so well by outlining key issues that addresses the challenge.  Africa youth are not aware of cardano and blockchain and the divers opportunities it presents for social impact and a more decentralised life. So the proposer has done so well by proposing solutions to combat this challenge. Furthermore , if this proposal is funded, more youth would briefed about cardano and blockchain services and its benefits helping them to take advantage of every opportunity it presents and also live a more decentralised life. Moreover engaging Goodwall platform which has about 2M+ followers and making sure cardano materials and blockchain services can be assessed through it is a plus to cardano and blockchain technology as many youth would be onboarded from different nations in Africa. The key metrics of the proposal also aligns perfectly with the outlined challenge settings which is a great work done by the proposer and I believe should be funded and implemented. ", "q0r": 5, "q1": "Every proposal needs a very good plan to make it work.  And so the proposer has done so well by outlining a very brilliant plan in carrying out the proposal if funded.  Furthermore , a timeline has been stipulated by the proposer and attached to the plan to measure the progress of the proposal.  Moreover, Every relevant skills and experiences needed for the successful implementation of the proposal has been given such as engaging goodwall in executing this proposal.  Also the proposer has done a great job by outlining a detailed budget and providing a breakdown of the budget into identifiable items reasonable for achieving the objectives of the proposal.  Furthermore,  the proposer has done well by carefully choosing the most resourced team members for the benefit of this project. Some risk challenges has also been identified by the proposer such fake news,  lack of engagement, budgeting issues of which predetermined solutions have been outlined by the proposer redeing the proposal a must win funded fully. ", "q1r": 5, "q2": "Goodwall which is the main platform to engage for the interest of this particular proposal which  is a very transparent platform and open for public view.  And so the proposer has done a great work by outlining indicators and key metrics by which the progress and success of the proposal can be measured. This is a great initiative which can be able to help fully with the auditing phase of this wonderful proposal. The proposer also did well by providing a time horizon by which success can be measured.  Furthermore,  the targeted problem was the unawareness of cardano and blockchain among Africa youth and the opportunities it presents in solving social problems and living a more decentralised life of which the outcome of this proposal stated under the heading how success would look like clearly addresses the challenge. For example about 300 new African youth applying on cardano and catalyst ", "q2r": 5, "assessor": "z_assessor_3265", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 13863, "q0": "Launching Youth Cardano Ambassadors is a bold and groundbreaking proposal that will certainly help Cardano Catalyst outreach a potential wide range of newcomers. Having an identified role model, young students might find it easier to engage in Cardano blockchain technology. It might also help us fight the general reluctance usually blockchain technology produces in the wide audience. As this technology appears to be alienated from the real world, having real people is always an excellent asset. Profiting from Goodwall’s close relation and dialogue with youth, the community will have an excellent opportunity of engaging new proactive members. Empowering African youth through block chain technology and Cardano Catalyst opportunities within our community is one the biggest challenges in order to help the growing Cardano Community throughout Africa. These empowered youngsters will have the opportunity of changing their communities and promote real social and economic transformation. This proposal effectively addresses the challenge. ", "q0r": 5, "q1": "Relaying in Goodwall’s wide experience in connecting Youth and their consistent plan and budget breakdown it is highly likely this proposal will be successfully implemented. Key milestone presented in this proposal is super detailed and efficient. Having a previous survey before launching their Hackathon to make sure that content will be correctly targeted and a strong marketing strategy is a guarantee this proposal will be a total success. Having already funded and successful proposals is a guarantee this team knows Catalyst dynamics and timelines. This team knows what they are talking about.\n", "q1r": 5, "q2": "Community will be expecting Goodwall’s extensive reports in order to audit their progress and success, although in this proposal there are no specified communication channels within the Cardano Catalyst Community. This might be a weak point to be fixed if this proposal is to be funded. Nevertheless, live dashboards might be super efficient in order to share with Cardano numbers and survey results and considering the already successful work they are doing within Cardano Catalyst it is to expect this lacking information be shared with us rapidly and easily. ", "q2r": 4, "assessor": "z_assessor_3833", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Goodwall has a huge community of African Youth and is developing an educational program about blockchain, which will be followed by a hackathon to identify Cardano Youth Ambassadors in Africa.", "experience": "Goodwall runs educational programs to over 2M youth on its platform. For example, the #TransformingEducation program is currently giving youth the opportunity to become a UNICEF Youth Ambassador and had over 1,000 video entries from youth all over Africa in only one week."}