{"id": 422980, "author": "oscarbahatimuk", "title": "support for education", "url": "https://cardano.ideascale.com/a/dtd/422980-48088", "category": 26600, "amount": 59525, "description": "Nort kivu is one of provinces of DRCongo,to the east. It has an area of 5948km2. It is made up to 6 administratives . For more than decades; this province has been the victim of several atrocities", "f6_no_assessments": 9, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"id": 3880, "q0": "The idea of ​​the proposal has identified a part of the problem that needs to be solved for this challenge, but the scale of the impact of the project is huge, we can extend it to many different areas. conditions are the same around the world. The problem of violent acts, of violence has always been a big problem in the world, especially since it has existed in African countries for centuries, such problems need to be discovered. on every corner of the world and DCCongo's Nort Kivu is no exception, IOG and Cardano are very focused on solving problems like these in Africa, a continent that is at the heart of Catalyst and Cardano.\n\nThe solution of this idea is good, it identifies a few problems of the challenge, and the author of this idea argues in a logical, neat, and creative way. Taking good care of the young generation by way of genuine education, and transparency is a good solution to reduce violence problems in the future. Funding sent directly to select parents in the form of cryptocurrency is a smart and innovative idea. The project has a detailed description of some of the risks when implementing, in addition to some solutions proposed by the author and the idea for overcoming them, but the community needs to be informed of more solutions for these problems. That risk if the Funded scheme.\n\nThe risks of local political instability are a big risk to carrying out any project involving people in the real world, you can seek advice when contacting IOG directly. for advice on how to implement the project to limit such micro risks.\n", "q0r": 4, "q1": "The proposal to introduce unclear and detailed work implementation timelines compared with limited implementation resources will affect the project audit process. The proposal only estimates the time to complete the project and the goals achieved in general, the community needs a more detailed implementation plan corresponding to the implementation timeline, the author can refer to the Microsoft Project tool Management for more detailed and methodical support.\n\nThe proposed project budget is less than 20% of the total budget of this challenge, compared to the information the proposal provides, some project expenditures need to be clarified if it is to be funded. A detailed budget should list hourly wages for workers in each locality, corresponding to the tasks of each person in the project team, the community needs to know, this helps to make the project transparent. better project. Compared to the information provided, it is a bit general and not yet a detailed budget.\n\nHuman resources to implement this project have been assigned specific jobs for each item, the experience of the members shows that they are completely suitable for the project. However, the identities of the members are also difficult to verify. clear. The author of this project Bahqti Mukiga with collaborator SENZIBERA shows that this is an experienced team to carry out this project, however, the author is kindly requested to provide additional links for credit verification. such as LinkedIn, Facebook, Twitter, Discord, ... for the community to verify identity easily and practically.\n", "q1r": 3, "q2": "This project does not provide KPIs to accomplish project goals, idea creators please provide more complete project KPIs. Based on the schedule that the author has provided, please provide the KPI corresponding to that timeline, how long will the project achieve the corresponding goals? Thus, the community will easily track the progress of the project.\n\nThe ideas of this project have clearly defined success, although they have not been tested in practice, it is still a good idea. A good suggestion and the author can totally run the test with a smaller model by himself to check for himself if the performance numbers are achievable and the project is funded. The author proposes to focus on answering the question. This Idea Question: Please provide information on whether this proposal is a continuation of a previously funded project in Catalyst or an entirely new project. In my opinion, this is probably a completely new idea on the Cardano platform, which has never received any funding from the Cardano ecosystem.\n", "q2r": 2, "assessor": "z_assessor_2489", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8282, "q0": "I think the idea can have a huge impact on the DRC, and the impact on the beneficiaries would be unmeasurable. However, it is a very difficult project in a sensitive environment and I believe there are more risks involved than the one mentioned. For example, is internet and cellphone access widespread so people would use Cardano as currency? Do the beneficiaries have the adequate educational level to be properly educated on blockchain? How to avoid people lying about being victims of violence to get the benefit? While I really like the overall idea, I think it demands a deep development before it is put into practice because of its complexity.", "q0r": 3, "q1": "I like how there are clear deliverables, but I think there could be a more detailed roadmap, explaining how these deliverables will be completed. From the information provided, it's hard to judge if it is possible to successfully complete the project. A step-by-step, information about each activity, would help me understand that. As for the budget, it seems complete, but I wonder if the school fees are based on a previous study, or if they are an estimate. I also wish there were more information on the proposers, especially their background on Project Catalyst", "q1r": 2, "q2": "I like how there will be constant visits to monitor the projects. I would have liked to see some more KPIs to track the progress. I think the deliverables mentioned in the milestones sections would be good starting points, but I think the project could have more data-driven metrics.", "q2r": 2, "assessor": "z_assessor_2971", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9420, "q0": "The deficiency in this problem statement by the proposer is that fact that in one of the province in DR Congo which is made up of 6 administrative regions,(Nort Kivu) there has been many atrocities and for that matter it has deprived a lot of school going age children to be in school. This has happened to families as well and so for this reason the Support for Education is being proposed. There is a challenge to be solved here because if these atrocities and harm caused to families care preventing children of school going age not to be in school, this this challenge must be addressed and supported. Thankfully, the proposer is aiming at introducing this in the Cardano Community and also aiming at  registering the affected children in Cardano system to create a reliable database which the proposer believes will bring relief and other benefits. This i believe will add value to the Cardano ecosystem in various ways because children of school going age will find help in ways that can help them have vocation education and other TLMS (Teaching and Learning Materials) which will aid in their education. This will also make the Cardano ecosystem happy. The KPIs used are not much but the proposer hopes that, once project kick start, much would be achieved. This project will address future challenges if proper monitoring and evaluations are done which the proposer has stressed more on to make it work even in the future .", "q0r": 4, "q1": "There are no links and supportive document supporting this project but the proposer has demonstrated how successful this project has been implemented. Isdrgl is already a higher development with vocation of secondary education graduate which has placed more than 2740 graduate into the job market. This means that the project is already producing result in the community. The project is made up of about 4 team members with each one having a background in different fields which they believe will help in implementing the project well. One holds a degree in development science, the other degree in project planning with an experience in Mushroom cultivation etc. The budget is clearly laid out how it will be carried out with fund of USD 59525 is granted. A period of 6 months would be used.\nThe proposer presented clearly how he will utilize the fund in this for\n1. environmental scan to have a contact with political authority $ 1500\n2. .identification and beneficiaries selection with transport  includes $  5500\n3. training on the project   philosophy  3500 :$ \n4. school fees support for 205 students    30750 $ \n5. school bad  and  other supplies $ 5075\n6.  staff salary   8400 :$ \n .office suplies 2800$ \nThis budget is reasonable to carry out his project because TLMs and Tuition fees of 205 children will be catered for. The proposer intends to apply for more funds when the need arises.\nThe proposer talks of database they will get from the government in other for them to keep track of the population since it is a war ton area. However, the proposer does not talk of the means of communication(Language) by which it will use to engage the community. English may also be part of the communication mode.\nAwareness is being created in the community by rising people who are victims of war ,hunger and other calamity ,and the opportunity ADA is  promoting which is opportunity for the proposer in securing the wallet of the African ,reason of grow Africa, Grow Cardano.\n", "q1r": 4, "q2": "The proposer believes that in a mater of 6 month, this will be implemented successfully. This is because there has already been job provision for over 8740 graduates and also tuition fees and other TLMs (Teaching and Learning materials) have been provided.\nThe proposer stressed more on Monitoring and Evaluation and also regular visit that(KPIs) to define the success of this project. This makes sense because consistent monitoring will help implement this project well. The proposer believes that regular videos on Youtube and highlights of proceedings will help keep track and success of the this project Support for Education.", "q2r": 4, "assessor": "z_assessor_3057", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10155, "q0": "Even though the proposal is partially aligned with the goals of the challenge, which is the joint growth of Cardano together with Africa in order to address one of the main concerns of the continent, namely education, in my opinion the proposal should be further developed so that the proposed actions achieve the intended effect. First of all, in the problem statement we only find some general data on how the province of North Kivu is composed, stating as a problem that they have been victims of atrocities. Although this information serves to give us some context, this problem is beyond our reach to solve. I would suggest adding in the articulation of the problem, what are the effects of the situation reported and its influence on education, which is really the problem that I understand is intended to be addressed in the proposal. Further, I would have liked a more detailed explanation of the differentiating factors provided from the adoption of the Cardano ecosystem and its sustainability. This is because, at present, I only observe the project team's intention to use it as a cryptocurrency through a traditional method of receiving funds. While this would increase wallet activity, there is much more potential in Cardano to exploit with this proposal.\nTherefore, I would like to suggest that the author provide us with more details of the 12 listening sessions they plan to conduct on the use of Cardano. If the content of such trainings is of high impact and has the potential to engage people into our ecosystem, then it would add value to the proposal.\nFinally, for the purposes of introducing another example of the potential that could be leveraged to maximize the impact of this proposal, I would like to mention the possibility of using solutions that allow you to have verifiable data of the 205 children and families benefited, with governance and/or digital identities built on Cardano, such as Atala PRISM (https://atalaprism.io/). Thus, we would not only be guaranteeing the use of ADA but also contributing to the scalability of the use of the ecosystem in Africa.", "q0r": 3, "q1": "In order to better understand the project team, I would like to request links or detailed references to their experience with concrete examples of their most significant accomplishments, which would help us to endorse that they possess the necessary skills to successfully complete this proposal. For example, they refer to Apolinnaire SENZIBERA and indicate that he has a lot of experience in mushroom culture. An individual's definition of \"many years of experience\" may vary from 5 years to 25 years or more for another. So, my recommendation is to be as specific as possible. Also, in one part of the proposal they mention that a social supervisor will make visits to validate that the planned activities are being carried out. However, we do not know who this person is and what is his/her relevant experience for this function.\nRegarding the budget, it is recommended to detail the line items and break it down into clearly identifiable elements. For example, $8400 is allocated for Staff Salary and it would be advisable to identify who is part of that staff and to break down the pay rate of each one of them, in order to know if it is in accordance with their responsibilities. Regarding the $5500 for identification and beneficiary selection, I would suggest to identify the individuals who will be performing the identification and what the amount will be for each, as well as how many people will be traveling and how many trips there will be, so that we can estimate their unit cost. Following these guidelines with all the concepts of the budget, besides making it auditable, facilitates the understanding of the scope, and will help the team to monitor the cash flow once they obtain the funds.\nFinally, I see the need for the proposer to describe in more depth the tasks that compose the solution that is being proposed. For example, the proposer indicates that they will conduct 12 training sessions on the operation of blockchain cardano systems for beneficiaries and their parents for 205 families. Then, please comment on what is the agenda for these trainings, if they are already prepared or need to be created. If the material is not ready, how much time and resources will be needed to develop it, who will deliver the sessions and what is their relevant experience, what will be the duration of such activity, if they already have the appropriate location with capacity for the target number of people, if there is a cost for such location, among others. \nUntil we can have more details of the execution plan of the proposal and its budget, I strongly disagree the project is feasible.", "q1r": 1, "q2": "Although the proponent describes the results that are expected to be achieved in a 6-month period, in order to be successful it must be clarified what are the milestones that will help us identify at any time during those 6 months, whether the project is on track or not. For example, they plan to conduct 12 training sessions on the operation of blockchain cardano systems for beneficiaries and their parents for 205 families. So, my recommendation would be to break down these 12 training sessions into a schedule for those 6 months, for example: 4 sessions by month #2, 4 sessions by month #4 and 4 sessions by month #6. That way, if 2 months have already passed and only 1 session has been completed, we will know that we are behind schedule, and corrective actions can be taken in time. Then, it is necessary to accompany the plan with specific KPIs that also alert us of any deviation, as well as serve to let the community know the progress of the proposal to encourage its replication at other locations. An example of KPIs could be: the number of attendees to the training sessions (to measure the engagement rate), the number of applicants to the program (to determine the target and potential population in future cycles), the number of schools enrolled in the program (to measure the reach), among others. In conclusion, the proponent should work on the above mentioned points in order to be able to assess the progress of the proposal in attaining its stated goals.", "q2r": 2, "assessor": "z_assessor_3161", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11412, "q0": "The issuance of academic certification is heavily centralized. If diplomas, degree or other credentials are damaged or lost, the re issue process is often costly and issuing institution might no longer exist. Sharing these credentials achievements are traditionally issued in physical form which makes it almost impossible to share when and where needed. Atala PRISM is an ID and credentials solution built on Cardano blockchain which simplifies process by enabling individuals to instantly share verifiable credentials. Nort kivu has been a victim for several atrocities,by implementing school care project for children in cardano system help them . This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The proposal has a detailed plan of 6 months includes individual listening sessions with families and civil society who are victims of atrocities be children from families victims selected and kits are distributed to beneficiary children from displaced victim families. The project has provided detailed budget breakdown which is reasonable to achieve set goals. The people working with the proposal has a lead and member of accademy within ISDR and holds a degree development science and member weman equal chances. The proposal offers a realistic timetable to complete the work and provides sensible and conductible plan for implementation. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by monitoring and evaluating performance of activities in field and supervising activities organised by social supervisor in order to see planned activities running smoothly. Follow up will be carried out where the team will be available to give each situation happen at feald for good coordination to reduce risk. The proposal clearly explains technical aspects like architecture, language and technologies if they are crucial for implementation and has considered challenges and risks relevant to a successful implementation. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 11745, "q0": "The proposal to support the education of children in the North kivu province of DRCongo, to the east, is well-deserved because they have been victims of a number of atrocities so they need help and care. By setting up a network and registering them in the cardano system to have a reliable and reliable database, it will help them reduce the non-existent situation they are going through.\nThe solutions offered by the project can completely solve this challenge. The support not only through schools but also through social and local agencies, the review and screening of children who need support is 100% accurate and complete. Parents are the direct beneficiaries of the benefits, so they are not concerned about corruption or mutilation from local authoritie\nThe proposal has raised an important issue that requires the influence of the government of this country, we cannot fight the difficulties here alone, but must have their cooperation.", "q0r": 4, "q1": "The proposal has given the results achieved in a certain period but has not yet given the specific work to do in those months, so should the community put their trust in the project or not? Should we draw up a detailed plan for each month more, how many field operations control sessions. How many visits by the organization to the families of the victims.\nThe budget is broken down by purpose quite clearly and this shows the community that the project is very transparent but the person working on this project needs to be given a fuller profile of the project support team to demonstrate that the cost is worth it. And if I return to Catalyst in the next round I am sure not only me but the whole community will support this project until it succeeds. Since there are now many organizations that organize donations to support disadvantaged individuals and families, transparent projects like this will be more interested and supported by them.", "q1r": 3, "q2": "Here, I have not seen a KPI to achieve specific results, when scanning the identification code and finding out exactly how much the beneficiary gets. In order to avoid the risk situation, it is very necessary and reasonable to closely monitor the activities.\nCreating a video that captures the results and work processes will be the success of the project. It will be widely disseminated and create trust in the community to gain support and approval from the community. This is a new proposal so there is a lot of experience for the managererience for the manager", "q2r": 4, "assessor": "z_assessor_3273", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11868, "q0": "This project aims to provide a solution to the problem faced by Nort Kivu, one of the provinces in the east of DR Congo with an area of 5948 km2 and 6 administrations. For more than decades, this province has been the victim of various atrocities that have a traumatic effect on the affected children. The proposal aims to ensure through a school care project that affected children are registered in the cardano system in a reliable database in order to help them further. This will certainly add value to the cardano ecosystem.ISDR-GL is a higher development institution with a vocation to train secondary school graduates. It has already produced and placed more than 8,740 graduates in the workforce who are thriving with proven experiences. Students have a test field, library, laboratory.The proposal clearly outlines how they will identify and select those in need, based on established criteria.It should be noted that each payment is dependent on opening an individual wallet and the currency will be released in crypto monaie and therefore to ADA for its promotion. It also describes the authorities with which close cooperation will take place and how and when reports will be made, as well as the expected results. This project can certainly be successful.", "q0r": 4, "q1": "The team members of this project are clearly reflected in this proposal namely Bahqti Mukiga Oscar, head and member of the academy within ISDR-GL, who holds a degree in development sciences and is a member of “Women for Equal Opportunities”.Apolinnaire SENZIBERA is also a member of this project and has a lot of experience in mashroom culture and obtained a diploma in project planning.They have enough relevant experience and skills to implement this proposal.The budget is divided into recognizable items but could be even more detailed. How many hours are included for training. Office supplies: which ones? What is included in the school fees support? $30750 for 205 students is $150 per student. It would be interesting to work out further details.The expected results are described in great detail over 6 months and seem realistic to me.There is a sensible and feasible implementation plan in place whereby there will be a permanent control/monitoring/evaluation of the implementation of the activities on the ground, including weekly visits to the guidance to ensure that the planned activities run smoothly. By going on site and following a strict follow-up, the risks have been considered to make this project a success.", "q1r": 4, "q2": "A roadmap is available stating the targets for 6 months. Between the period from August to January, several useful goals will be achieved. It is good that weekly visits are organized to the supervision of the activities. It is also good that YouTube videos are regularly updated to show the evolution of the activities. The submitter has provided a clear description of the problem. There is a need for registration for young people who need help. By creating a network via the Cardano ecosystem, a reliable solution will be provided.", "q2r": 5, "assessor": "z_assessor_3308", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12238, "q0": "Honestly, this proposal dialogues with the unclear goal of the challenge. From beginning until the end of the proposal does not state clearly what the proposer intends to. The proposer should state clear objective what he and his team want to do. For example, provide short course about blockchain technology for student and create workshop and seminar about blockchain technology and Cardano for student and for public.  Since the proposer join with isdrgl as higher institution development, that would be easy to implement it. given unclear information, I do not think, the proposal does not address the challenge.", "q0r": 3, "q1": "The proposer provides the information about the plan but, still unclear what the proposer would like to do especially in carrying Blockchain and Cardano in the project. the plan should inline with the objective the proposal. for example, due to we are going to create short course and provide workshop and seminar, therefore, month 1, we are hiring the tutor who understand about blockchain technology. Month 2, we are select the people who worth to participate in the course. Month 3, Class begin and distribute the material during class session etc. thus from this, the proposer can set up and breakdown the budget. Because unclear information given, I do not think proposal will be implemented successfully ", "q1r": 3, "q2": "Speaking about auditability, both of measurement and how will be measured are unclear. I think, this is because unclear of the objective on how blockchain cardano fits with this proposal. Perhaps the proposer can take for what I suggest above with the example that I have give for your perusal. Further, can be determine the measurement to measure success of the proposal. As for now, I do not think the information given is sufficient to audit the progress and the success of the proposal", "q2r": 3, "assessor": "z_assessor_3367", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13043, "q0": "Well Yes and no to and extern this proposal those meet aspects of the challenge as it sets out to address introducing cardano to new willing group who wish to build on they network,however on boarding part this proposal has not properly spell that part out.I couldn't find any where in this proposal where it talked about onboarding users and building tools ( a dapp) which might be use by it's community.its talks about support for education but this proposal could not properly articulate which segment of the population it wishes to provide educational support is it for teenagers,adults also is it secondary, primary of higher education it wish to give this support to", "q0r": 3, "q1": "Yes I do think this proposal given the plan presented here might be successful implemented in that they have show they know what is the challenge and have made relevant partnership with government institute who have a track record of delivering productive adults with skills which will add value to their community and given our support and the benefits block chain tech has to offer especially with the card and community behind them. \n2) Also they talked about have 12 sessions with the 205 participants of the program and have to have meetings with their family this further puts cardano at the hearts of fracture community bartered by evils of war this might just be a strong glow to this people in this dark hours .", "q1r": 4, "q2": "Well yes I do think the team who presented this proposal have being able to give some details about audit metrics like \nThey gave a name of a government training and development institution which they partner with for this proposal .And also they talked about starting a YouTube Channel which will be dedicated to given step by step update on development of the projects even with time line and project completed base on thier milestone. But also I would have love to see more audit metrics like how participation is being measure how to improve where it's lacking how to improve such data will also be good in taking in to audit account success of it.", "q2r": 4, "assessor": "z_assessor_3548", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Considering the above traumatic effected We believe that by implementing the school care project for children affected registering them in the cardano system for a reliable and database can relieve,", "experience": "isdrgl is an higher institution of developement with vocation of trainning secondary education graduates , it has allready produced and place on the job market more 8740graduates who are doingwell with proven experiences .studenty have an experimental fields,library,laboratory "}