{"id": 423070, "author": "bolaji", "title": "Ada NFT Marketplace for the unsung", "url": "https://cardano.ideascale.com/a/dtd/423070-48088", "category": 26600, "amount": 30000, "description": "Unsung creatives are challenged with counterfeits, inadequate artwork provenance, extended time to market and inadequate financial services.", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 1095, "q0": "The proposers have started building a marketplace based on the Ethereum 721 standard, called Nifty Row - I find the name to be too similar to another marketplace on Ethereum, called Nifty Gateway - and have decided now to build it on Cardano, reason unspecified. The marketplace will be geared towards African artists, however, I’m unclear if it will be exclusive to them, or if they will only be more highlighted than others. At the same time, the team will also be establishing a DAO complete with its own token and DeFi services (credit, savings, staking, insurance).\nI get the feeling that the marketplace was being built for other blockchains, and the change towards building on Cardano came sudden and the vision and development have not been properly adjusted to it (the wallet connector asks for a Metamask and not a Cardano wallet, and not even the developers seem to have the needed knowledge, as described later in the proposal “Trained blockchain developers who should be able assume the development roles for the project after 2 to 3 weeks of training”, an ambiguous statement which makes me question the feasibility of the entire project). I’m also unsure if the development for other blockchains will continue and the marketplace will operate cross-chain, or if the development done so far will be entirely ditched in favour of the Cardano ecosystem. \nMore than half of the impact section is focused on the marketing strategy, influencer contacting, networking, events etc. that usually come after building a product. Considering the complexity of the proposal, I would have needed a lot more information regarding all the services to be developed and their integrations with one another.\nConsidering the tasks to be completed, I find the risks foreseen to be too general, and geared only towards a board subject, namely the legal matters in Nigeria, while the development side has been completely passed over.\nOverall, I find myself having too many unanswered questions regarding the proposal, as such, I cannot accurately judge its impact on the Cardano Ecosystem and as such, I advise the proposers to resubmit the proposal in a future fund with more details regarding their intended work.", "q0r": 2, "q1": "The detailed plan is very light on details. There are four main stages of implementation presented, over a period of 16 weeks, however, there is no further breakdown of what every stage would entail. Let’s take the first step “Weeks 1-4:   Development/Integration of feature-complete marketplace on Ada”. What are the features that will be available on the marketplace? Buying and selling seem obvious. Will bidding be available as well? What currencies will be accepted? What options does a user have to view his NFTs? And many, many more, that are all part of the user stories the team should have already drafted.\nThe budget is also only loosely described. It’s divided into three main categories, all equal to one another, namely $10000, regardless if it’s for the development of an entire marketplace or for community engagement. There is no total of hours given or an hourly rate per task. Since it’s unclear at what stage the development is, and what exactly needs to be built, my opinion is that the budget cannot be well judged.\nThe team members have provided us with all the information regarding their names, past experience and LinkedIn profiles.\nUnfortunately, as good as this part of the section may be, the other two are too incomplete to consider the entire section as being successfully implementable.", "q1r": 2, "q2": "The project progress question has not been answered. Perhaps it was unclear to the proposers what it was about. They have provided us with answers that are pertinent to the second question of the auditability section, namely the success definition, than how the proposal advances and each step is completed. The answers revolve around community engagement, high user adoption and increased number of transactions on the Cardano blockchain, that as I’ve said, are related to the success of the project, and not its development.\nI will try to rephrase the question modelled on the details provided in this proposal. \nIf we take the first step of the detailed plan “Development/Integration of feature-complete marketplace on Ada”, then the question is, how will the team be monitoring the progress of this first step, and equally important, how can the Cardano Community independently verify it as well? The answer can be a lot of things, a lot of people choose Github for development progress, but it can be whatever the team is comfortable working with.\nRegarding the success question, I fail to see the connection between an NFT marketplace and bringing people to Catalyst. While that might sound good, if taken out of context, but the purpose of the question is to have some metrics of success directly reported to the specific project.\nSome of the other answers provided seem more directly related to the proposal, but since the team’s plan covers so many areas that haven’t been properly described in the previous sections, it’s hard to approximate how well defined the success definitions are.", "q2r": 2, "assessor": "z_assessor_2192", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "On Impact / Alignment  the assessor fails to appreciate the obvious fact that been an Africa NFT marketplace supporting Ada/Cardana will have a positive Impact on Grow Africa/Grow Cardano which is the goal of the challenge.  Assessor  incorrectly suggest that the team does not have the needed knowledge while ignoring the fact that the currently developed Marketplace with ERC721 contract can easily be deployed on the Cardano KEVM which is a  Solidity/Ethereum compatible and interoperable platform.\n\nOn Feasibility, the assessor raises questions on standard functionality for marketplace that are already featured in the MVP which is demonstrable on the demo/test website provided https://www.niftyrow.io  and also verifiable on the smart contract on github https://github.com/bolajinr/niftyrow.  Also, assessor also  asked what currencies will be accepted, a question with an obvious answer relating to the blockchains to be supported including Ada for Cardano and other like BNB for BSC, Matic for Polygon, One for Harmony, and ETH via Aurora.\nDespite the high level for the main stages of implementation the assessor negatively implies the proposal is highly inadequate in providing information for the implementation and suggest a full detailed Gant chart style project plan is required. The assessor also claims that the status of project is unclear after the proposal highlights having already built a MVP with the need to integrate and deploy on Cardano.\n\nOn Auditability, the assessor fails to rightfully acknowledge that a Development/Integration of feature-complete marketplace on Ada is a major criteria for auditing the success of the project.  The assessor also tries to downplay the point that Ada led  community activity based on the project  leading to higher Cardano adoption is not a strong point by suggesting that Cardona will not be able to verify an increase in community members and other activities which is data will be publicly available.   He or She also fails to recognize the fact that the DAO  may also proposal other initiative to project catalysts."}, {"id": 3930, "q0": "The issue being not so well known creatives are facing the issue of counterfeits, no proper financial services and taking more time to reach market. The proposer wants to resolve this by creating a cardano NFT Marketplace with a Decentralized autonomous organization which would less reduce counterfeiting, good artwork provenance, faster time to reach market and also provides accessibility to the DeFi. This will be helpful to grow CNFT market and help to improve cardano ecosystem. this does address the issue", "q0r": 5, "q1": "As per the proposal the proposer and their team already have the experience of building a NFT marketplace on Ethereum these skills and experience would be sufficient to implement the proposal successfully. The proposal does consist of a clear plan and timeline. It would be hard to say if the budget demanded is justified without a complete budget breakdown. The proposer has considered all possible risks that will effect implementation of the proposal. Therefore there is a possibility that the proposal will be implemented successfully ", "q1r": 4, "q2": "The proposer has given a complete milestones to achieve with a timeline that would help to measure implementation of the proposal. The proposer had given details regarding success of the proposal and how to measure the same. The given Sustainable Development Goals will also be helpful for auditing of the proposal. A clear budget breakdown would have also been helpful for the auditors to track the progress. based of details given it is safe to say the progress and the success of the proposal can be audited.", "q2r": 4, "assessor": "z_assessor_2496", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 4427, "q0": "With impact, the proposal addresses the goal set out in the Challenge of helping Africa and Cardano grow together. Ada NFT Marketplace with DAO helps Africa grow by curbing counterfeiting, ensuring the provenance of artworks, etc... Of course, this proposal helps Africa grow indirectly by directly contributing to Africa's growth. maintain a strong economy. As for the Cardano ecosystem, it has directly added value because the high-tech techniques (creation of NFTs, smart contracts) are applied directly on the Cardano blockchain. We understand the ongoing problem in Africa is that unmanufactured advertisements are challenged with counterfeiting, inadequate artwork provenance, and extended time to market. It also affects financial services by rendering financial services inadequate. I endorse the team's idea of ​​impact. Especially with the impact on counterfeit goods that have existed for a long time, I see very few proposals in the world to mention and solve this problem. Since then, we find that the impact of the proposal is difficult to clear (with the product being Ada NFT), I think that if the proposal is well implemented, it is completely possible to scale up and solve the challenge in Vietnam. Future. Because more than anywhere else, Africa is in dire need of proposals like this to contribute to improving the actual situation, then the economic growth of the continent - a continent considered still poverty and backwardness compared to the rest of the world. I vote 5 stars for the impact of the recommendation.", "q0r": 5, "q1": "I see that the proponent has full experience in technology, project management, architecture, etc... All of them have many years of experience. In particular, the team has enterprise software engineers and publishers in charge of issues related to art history. Such a situation of personnel is very consistent with the proposed team mentioned above. Moreover, the team has fully presented the links of the social network (Linkedin). These clarify the feasibility of the proposal and the credibility of the team in the community. I highly recommend that you make your identity clear to the community. Regarding the detailed analysis budget, it seems a bit sketchy given the amount of work done corresponding to the amount attached. To further demonstrate the feasibility of the proposal, I recommend that the team list more clearly all the cost-related tasks that the team must do to propose a reality. This is an equally vital factor to prove the feasibility of the proposal. That is my advice. For example the detailed cost of the Ada mainnet test, the amount required to conduct the workshop, the amount required to organize the competitions, etc...) I can temporarily accept the way the team has planned. plan and implementation. Regarding the human resources needed to implement the proposal, I must recognize that the main members are professionals in their field with rich experience over the years, however, the team can be divided into two groups. Share more about the members hiding behind to do the same work with you? This is also an equally important factor for the success of the proposal to become a reality, and also creates more credibility and trust from the community for the team. I would like to ask more that with such complicated tasks to be done if the current members are not qualified to complete (especially technical issues), the team intends to hire more specialists. family? I think it is good to hire more experts because then we will have the opportunity to interact with the best people in the world in the field they are in charge of, thereby learning more knowledge and working skills of them. surname. I noticed that none of the main members made other proposals in parallel with this proposal in Fund 9, which is a favorable condition for members to fully focus their time and energy on implementing this proposal. I am very happy to know this. With the challenges and risks associated with the implementation: Obstacles from the bank's side are limited to providing services to cryptocurrency companies, along with the accompanying solutions. I think this is a legal and governmental issue, so the team must do thorough research before implementing the proposal to ensure that when the proposal is implemented, there are no obstacles. from the bank. Dong, I believe that in a country like Nigeria - the third-largest crypto community in the world - then sooner or later the team will overcome issues related to legal and government, central banks to turn this proposal into reality. When it does, it will benefit the entire country of Nigeria and eventually Africa. I vote 4 stars.", "q1r": 4, "q2": "One of the conditions for demonstrating the transparency of the proposal is the roadmap and milestones. In the timelines, the team has classified by week, this way of classifying the timeline is acceptable. However, to confirm the transparency of the proposal, I would like to suggest that the team can divide the roadmap of milestones associated with specific months of a year, or weeks of specific months (January, February, etc...this is just an example) so that the community and PA can easily conduct a review on the transparency and calculate the score of the proposal. Some proposals have divided the milestones in this way and have received a great response from the community. The team clearly described the problem in the proposal, and clearly stated the solution that needed to be taken to put the proposal into practice. I very much agree with this. I approve of the team providing key performance indicators to measure performance (KPI). This is an important factor to demonstrate the transparency of the proposal. It's a pity that I haven't seen the key metrics yet. The team can arrange to add more key metrics, contributing to confirming the auditability and making it easier for the community to rely on it for audits. Here are some of my contributions to the transparency and auditability of the proposal. The team can refer to it as a positive contribution. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14513, "q0": "They are going to create an NFT marketplace to attract more artists to the Cardano blockchain. This dApp will try to address some of the current issues that artists are facing with regard to financial services, art forgery, and provenance. If this dApp is successful, it will attract a lot of customers and artists to the Cardano blockchain. This dApp will be more scalable and resilient to new challenges as a result of the additional DAO capability. The main indicators are in line with the difficulty of getting new users to use dApps on Cardano.", "q0r": 5, "q1": "To increase the chances of a successful implementation project, the proposers have provided all the information required. The team is one of the key aspects of a successful execution. Along with listing the team members' expertise and talents, the proposers also included links to their linkedin accounts. The budget does make sense and is arranged properly. The budget has been broken down by the proposer. The proposers have also set a timeline of 26 weeks for the delivery of the nifty row dao. In order for this project to be successful, it has all the information required.", "q1r": 5, "q2": "The proposal is auditable since it includes the information required to monitor its development. The proposal includes a timeline with milestones. But I recommend improving the timeline and including possible launch dates. The proponents of the proposal have added metrics like the number of users three months after launch. The KPIs for this project have been well-defined, in my opinion, by the proposers. This project focuses on African artist that is what makes it unique from other NFT marketplaces. Altogether the info provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 15084, "q0": "Yes, the proposal is very well aligned with the objectives of the challenge. The idea is to create a marketplace to combat the counterfeiting of artwork by unknown artists, also facilitate access to DeFi and launch products faster in the consumer market. Dubbed Nifty Row NFT, the platform would aim to empower African art communities. I confess that at first I thought the project was extremely profitable for Cardano, but I couldn't understand why it would be designed explicitly for Africa, but it is clear in the marketing part of the explanation that the proponents have high connections with African influencers, so that the target audience would be the native population of the continent. With the project, many early-career artists will benefit and will likely become active members of our community, bringing super useful artistic workforce to integrate project teams that help consolidate our blockchain.", "q0r": 5, "q1": "The project is viable, but I would like to make small suggestions. The script is good, but could be more detailed. It would be great if we had more details about the activities, the time division is very good (in weeks), the intervals are short, so that we understand well what would happen and when. But how, it still leaves a little to be desired our understanding. The budget breakdown is not very detailed either, how would the $10,000 for the “Full Feature Market Development/Integration in Ada” be used? It would be important to have more explanations about each part, since the values of each are high. The team presentation part is great, we know in detail who the team members are, they are given a lot of information about their resumes, they seem qualified enough to run the project successfully and with ease.", "q1r": 4, "q2": "Progress monitoring is a bit confusing. Proponents tell us some ways in which the project would be followed up, yet these are not so easily measurable results. These are partial success scenarios, but it would be more interesting if specific KPIs were plotted for each “X” period of time; this would facilitate our understanding of more tangible data to be conquered. On the final success, a lot of information is given, for example the creation of a “complete NFT market adopted by the community with support for Ada for minting, auctioning and bidding/buying NFTs” and also the increase of “collaborations between communities of digital artists with communities of physical artists”. I suggest that some numerical data be included – for example how many artists are expected to reach with the project; and also that the communication channel with the Cardano community becomes clearer (Telegram? Twitter? Townhall?).", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Ada NFT Marketplace with a DAO can facilitate reduced counterfeiting, better artwork provenance and access to DeFi and faster time to market", "experience": "Team has already developed the NFT marketplace MVP based on Ethereum 721 token standard (https://www.niftyrow.io/demo (or .com/app)) with smart contract deployed and verified on BSC, Harmony, Polygon, Aurora. Also, a fractional investment in NFTs for the Nigerian Stock Exchange."}