{"id": 423076, "author": "reneebill", "title": "Supply dustbin cans in universities", "url": "https://cardano.ideascale.com/a/dtd/423076-48088", "category": 26600, "amount": 20000, "description": "Due to time these details will be given in the comments ", "f6_no_assessments": 6, "f6_rating": 1.4444444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 7397, "q0": "I believe the proposer has a very innovative idea here,but then there is not soo much written in this proposal for one to assess it's impact on cardano and how it brings Cardano to spotlight in Africa.\nFirst of all,the writer did not give us a problem statement for us to ascertain if it matches what the challenge is looking for. Nonetheless,the writer provided a solution and I want to believe this is where the whole idea in this proposal comes from. I think the idea in this proposal is, supplying dustbins to universities whiles in the process creating awareness about cardano to the students,I find this idea interesting but unfortunately,the writer did not put soo much effort in drafting this proposal, why am I saying this? The proposer did not even give us a hint to the country this project is supposed to take place,how the proposer plans to design these dustbins to represent cardano in order to create awareness and how this proposed solution will be able to measure the key metrics of the challenge. This proposal will have addressed this challenge if the writer provided the required information and reasons to justify the proposed solution in the proposal. Sadly, the idea in this proposal is a brilliant one but does not even have it's goals it hopes to achieve which in turn will measure the key metrics of this challenge and as such it does not address this challenge effectively. There is soo much work to be done in this proposal to make it yield good outcomes. I will advise the author to come out with a much better,well written proposal with the same brilliant idea and hopefully submit it in the next fund for this challenge.\n", "q0r": 2, "q1": "As I said earlier,there is no required information for us to assess this proposal. The proposer did not provide a timeline for delivering this project which means there are no specific dates. We do not even have information on the duration of this project,thus the number of months, weeks, the proposer intends to use in delivering this project.\nThe only thing assessible in terms of feasibility in this proposal is the amount requested which is $20000. We donot know the number of dustbins the proposer plans to supply and the number of universities to be supplied to. The proposer did not draw a budget for us to know the items the amount requested will cater for. Is it only dustbins the proposer intends to purchase with the $20000? I presume there should be the cardano logo on those dustbins in order to bring out the desired effect and won't designing that logo on the dustbins come with a cost? There is no cost breakdown to ascertain all these.\nWill the writer be working alone or with a team? There is no information concerning that and there are no descriptions of either the proposer or  any team member for us to get to know their experience level and whether they are familiar with the cardano ecosystem. Also there are no relevant social media links presented for us to know the proposer and maybe the team in more details. There is not soo much information presented to us, for us to be sure this project is likely to be implemented and as such this proposal is not feasible.", "q1r": 1, "q2": "There is also no information provided here to assess the auditability of this project. The proposer did not state the milestones hoped to be achieved. There are no key performance indicators to guide us on how success of the project will look like and also no key metrics stated to measure the project's success and progress. How will the community audit this project? The writer did not give us a clue on how the project can be tracked by the community. I feel this proposal lacks alot of important information for us to assume its impact and effectiveness. I believe this proposal needs much information to make it complete and I advise the proposer to seek some assistance from proposers in the community on how to go about it and I am sure if the required information is provided in this proposal,it will be suitable,complete and ready for the next fund for this same challenge and hopefully,it will get positive feedbacks.With that said,this proposal is not auditable.", "q2r": 1, "assessor": "z_assessor_2890", "no_vca": 7, "ne": 4, "ng": 2, "nfo": 1, "vca_o": 2}, {"id": 5817, "q0": "As the title of the proposal says, it is quite simple project. Provide the dustbin cans in universities with Cardano logo and link to the webpage so that students can learn about the Cardano community while also taking care of the environment. It is related to Tanzania, and University which is not mentioned by name. All the information is mentioned in the comments by proposer, there isn't any information besides that so it makes it difficult to assess the proposal. \nI would like to see more from the proposer, not just in the comments but in the overall proposal, to explain in more details how this would be implemented.", "q0r": 2, "q1": "Unfortunately there is little to no information to go, there is no explanation who is behind the project or experience related to make this proposal happen. It is extremely simple project, provide dustbins to the university so it doesn't require a lot of experience or knowledge. But it is difficult to approve budget with so many unknowns, there is no guarantee that project would be implemented.. ", "q1r": 2, "q2": "It would be difficult to audit the success of the proposal, as it is not explained in full detail. In comments proposer says that it would take 8 weeks to produce dustbin cans and place them on the university. The idea is that students would see the Cardano logo and webpage on the dustbin and so start to be interested in the community, but it is difficult to say if this would work. ", "q2r": 2, "assessor": "z_assessor_2752", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 6508, "q0": "There is not a lot of information given in this proposal. There is a lack of proposal details and also a lack of a challenge. I would suggest providing more information so that proposers can have a better understanding of what this proposal strives to achieve. For now. I give this section 1 out of 5 stars.", "q0r": 1, "q1": "There is no experience given and there is a huge lack of description throughout the proposal. I would suggest including experience and a description of how Supply dustbin cans in universities will benefit the Cardano ecosystem. For now. I give this section 1 out of 5 stars until more information is given. ", "q1r": 1, "q2": "Once again. There is a lack of information which makes it difficult to audit the potential success of the proposal. Currently there is no correlation on how Supply dustbin cans in universities will benefit the cardano ecosytem and has nothing to do with the fund challenge setting. I would suggest providing a lot more information so that this proposal can be taken seriously and considered for funding. This section of the proposa receives a 1 out of 5 stars. ", "q2r": 1, "assessor": "z_assessor_2817", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 13578, "q0": "Donating bins to the universities and creating awareness on cardano ecosystem is a very good idea however the proposal does not identify any problem within the challenge which needs to be solved. There is no stated facts in the proposal which addresses the challenge effectively. The proposal does not address future challenges and the proposal does not contain key metrics and goals which align with the outlined challenge system. Therefore the proposal does not effectively addresses the challenge. ", "q0r": 3, "q1": "The idea of the proposal is good however there no links , references and statements in the proposal that shows that the proposer is experienced in handling projects. There is no information on the description of the project and the possible risks associated with the project . Since there is no actual plan to embark this project , it is not likely this proposal will be implemented. ", "q1r": 1, "q2": "The proposal is does not have any monitoring agent or any team to help embark on this project .\nTracking the progress and the success is quite difficult depending on the proposer's proposal. That is the main reason why i strongly disagree that the information provided is sufficient to audit the progress and the success of the proposal. ", "q2r": 1, "assessor": "z_assessor_3696", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 13898, "q0": "This proposal is seriously lacking detail as it appears the proposers ran out of time and labelled each section “due to time these details will be given in the comments.’ Below there is a single comment with five sentences explaining that the proposer wants $20,000 funding to place trash/rubbish bins in African universities. The loose connection to Cardano is that the bins will have the logo, website and details about Cardano for students to check them out. While tempted to score this proposal only 1 star for impact, I am rating it 2 stars because if it was planned correctly this proposal actually could have some impact. Having lived in Tanzania for 4 years, I was constantly aware of the state of trash/rubbish around the city and countryside. If, and only if the proposal was fully developed, with a small marketing campaign and proper disposal of the waste afterwards with ongoing funding could truly ‘hype’ up Cardano and encourage brilliant young minds in Africa to join the community. Sadly, the proposal does not have any of these possible details as will be explained in the feasibility and auditability sections.", "q0r": 2, "q1": "There are simply no details or explanations given for the feasibility of this project. No timeline for implementation, no location of where the bins will be placed, and no biographical information about the proposal submitted. Even more concerning is the lack of financial planning, a fixed sum of $20,000 with no breakdown of the bin construction costs, no staffing costs and no costs listed for the Cardano specific branding. The final and most disastrous oversight I feel is the lack of accountability for where the trash/rubbish is going after it is collected in the bins. From living in Tanzania for 4 years, in most areas there is simply no government rubbish collection, it is a private service that companies and households pay for. When the trash piles up in these lovely new Cardano bins and money is not planned for the hiring of a disposal company, it is going to reflect negatively on Cardano for the lack of oversight and possibly cause more harm than good to its reputation.\nFor the total lack of details and planning information I rate this proposal 1 star for feasibility.\n", "q1r": 1, "q2": "This proposal does not have any information to be able to audit is satisfactorily. It has no details regarding a timeline with milestones or KPI. The proposers did not go into details about the number of bins, where they will be placed or how they will measure the success and adoption of Cardano following the branding. There is no mention of financial accountability and no public access to the development process. There is simply nothing to state how the proposers will measure the success of their endeavours.\nDue to lack of information, this proposal is rated 1 star for accountability.\n", "q2r": 1, "assessor": "z_assessor_3840", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14143, "q0": "I rated this section two stars for a few different reasons. The overall idea sounds fun, and I see where they are going with it, however, there was a big part that lead me to disagree with this proposal. I get the idea to put the Cardano logo onto trashcans to help prevent littering and promote Cardano at the same time. However, in contrast, I think that any person who hasn't heard of Cardano or doesn't know much about it is instantly going to think that Cardano is simply a trashcan company. Definitely far off from what Cardano really is. If this proposal were to be funded, I suggest putting more than just the Cardano logo on the trash bins, but try to include something that shows how Cardano is a currency, and perhaps a QR code that people can scan to learn more about what Cardano is and what it does. I also gave this a low rating due to the lack of detail and information. Almost every category stated that the information would be in the comments, but I don't feel that the comments covered much other than the overall problem. I think that there are other proposals that deserve getting to get the funding money.", "q0r": 2, "q1": "As I slightly touched on above, this proposal is lacking a lot of important information, making it difficult to believe that the plans will be implemented successfully. There are no credentials about a team of people, who will be designing the trash bins, how the money will be distributed, what schools will have these bins, or most importantly, a timeline. These are important details that need to be touched on in order for this proposal to be more successful. Many of the sections that say \"Due to time these details will be given in the comments\" do not have answers in the comments. For someone asking for 20,000 USD, it would be wise to spend more time working on the proposal and not wait till the last minute to throw it together. By doing so, the plan sounds very untrustworthy, and I don't believe it should be granted the funding being asked for.", "q1r": 1, "q2": "Again, there isn't enough information provided for the progress and success of the proposal to be audited. There is a severe lack of details that leads to a lot of questions unanswered. It would be nice to see some type of roadmap or milestones at least to have an idea of how long it would take to design and implement the thought-out plans. There are no clearly defined delivery dates, and no way to hold the proposer accountable for when the bins would be completed. There isn't too much left to say for this one other than, that there simply isn't enough information written to give this proposal a good rating.", "q2r": 1, "assessor": "z_assessor_3915", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Submitting dustbin cans for universities especially government universities so that to help them in keeping environments clean and same time to create awareness of cardano to them", "experience": "Due to time these details will be given in the comments "}