{"id": 423204, "author": "sandralvproject", "title": "Cooperative dApp", "url": "https://cardano.ideascale.com/a/dtd/423204-48088", "category": 26600, "amount": 300000, "description": "Cooperatives and NGO's in Africa have for decades suffered from corruption and financial injustice. Only 1% of members receive the majority of the money. There is a lack of transparency and trust.", "f6_no_assessments": 14, "f6_rating": 2.0714285714285716, "videos": [], "media": [], "f6_assessments": [{"id": 2640, "q0": "The problem of corruption in Africa is well known but to solve it really takes a lot of effort, not only in public terms but more precisely in terms of people, Blockchain will help to make information transparent, and data and resources are distributed.\nAn application that does this on Cardano will make developed and developing countries pay more attention to Cardano\nHowever, implementing the technology platform requires a lot of resources and applications, going from the starting point of providing money down to cooperative funds, community groups, and even the people.\nTo do this, it is necessary to have a more detailed, specific, and sustainable plan, on how to plan to expand in the future.\nHere is the new proposal with general ideas but not specific and detailed directions", "q0r": 1, "q1": "The project has not highlighted information that shows it is feasible at present\nCompletely missing documents, links to specific references about the sources of documents, problems to be solved, and related factors to make the proposal clearer.\nThe number of main members participating in the project is mentioned, but there is absolutely no endorsement information, referral links, or related images and videos.\nIn addition, it is also necessary to introduce working experience, blockchain experience, experience, and work done in the project's implementation.\nIn addition to the main Core team, the human resources involved in the project also need to be calculated to allocate a reasonable budget\nThe budget needs to be broken down into specific items that can be phased, month by month with specific amounts for human resources as well as related work items.\nIn order for the project to be successful, a clear roadmap and roadmap are very important to avoid people not knowing what to do or doing overlapping and inappropriate tasks.\nThe allocation can be into 3, 6, 12, or 24 months. Also need the necessary items to be completed each month\nThe technical aspects and risks are poorly presented, not really underlining the importance of how this will impact and help the project.", "q1r": 1, "q2": "Auditing and checking progress is essential for proposals, both to track progress and disburse capital and for the community to follow and support the project.\nHowever, here the above things are described in a very general way, more qualitative than quantitative, and a clear plan and measure.\nProposal to include: Specific roadmap, milestones to be achieved, time to get there, solutions offered, and finally a public channel for everyone to access to check project progress", "q2r": 1, "assessor": "z_assessor_2325", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3651, "q0": "The problem statement from this proposal is the corruption and injustice present in cooperatives and NGO’s from Africa. Their proposed solution is to develop a dApp (decentralized application) with a transparent payment system in which transactions only go through when accepted by other members in the cooperative. This solution already describes an available feature in blockchain technology and Cardano, which is a multi-signature wallet. Different people have a key for the wallet, in this case the treasury of a NGO or cooperative, to be able to send a transaction the majority or the number decided during the creation of the multi-sig, will have to sign the transaction otherwise it can’t be broadcasted. Therefore there’s no need to develop an additional dApp to do the same thing it can done natively with Cardano.", "q0r": 2, "q1": "This proposal is asking for funding amounting to 60% of the total funds allocated to Grow Africa, Grow Cardano challenge. This on itself is not a red flag, but in this case how the funds will be spent is not described in detail. 200K for dApp development and 100k for salaries and travel. How many hours are needed to have the MVP, alpha and beta versions of this dApp? How many developers will be needed? Which skill sets? In the team description there is only one person as developer with no links to LinkedIn, GitHub or  personal portfolio of previous work done in dApp development. More information is also needed on how the 100k will be spent, whose salaries will be payed? How many hours will be dedicated to this project? The rest of team members should also provide context and information about their roles in this project.\nThe detailed plan including timeline and key milestones is too vague and short for a project of this magnitude. The possible candidates should already have been identified before asking for funding. It’s not clear the country has been decided either, giving Uganda and Ethiopia as candidates. I imagine they have their own challenges and nuances to consider. There’s no timeline specified for the development of the dApp either, this is very important information that is needed to analyze the feasibility of the proposal.\nThe company behind this proposal is called In4Resilience based in Sweden. Their website doesn’t contain any meaningful information or proof of past work done in Africa or with NGOs. Their LinkedIn page was created only two months ago and have only two employees and seven followers. These are all red flags in my opinion.", "q1r": 1, "q2": "The proposal lacks any real KPI or measurement methodology to analyze the progress and success of the project. “Solving corruption and increased financial justice” are too broad terms to be used for auditing progress. There has to be clear and concise milestone to be achieved in a certain amount of time. For example, having the Minimum Viable Product (MVP) ready in three months, develop a funnel with clear stages to analyze the quantity and quality of the NGOs interested in this potential dApp. Conduct certain amount of interviews with NGOs, in a certain amount of time to determine if your solution is needed as a first step. In general, I do not agree that this proposal is easily auditable through the information provided, I cannot see direct ways to evaluate the process or the results based on what was presented to us.", "q2r": 1, "assessor": "z_assessor_2465", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 3882, "q0": "The idea of ​​the proposal has identified a part of the problem that needs to be solved for this challenge, but the scale of the impact of the project is huge, we can extend it to many different areas. conditions are the same around the world. Corruption is inherently a big and long-standing problem, it is like an incurable disease happening all over the world, especially in poor and developing countries. The author has put a lot of effort into putting this issue into the proposal for this fund.\n\nThe solution of this idea is good, it identifies a few problems of the challenge, and the author of this idea argues in a logical, neat, and creative way. Blockchain technology in general, Cardano in particular is a good solution to transparent all transactions, and payment apps for cooperatives are a good solution to the problem of corruption in Africa.\n\nThe project has a detailed description of some of the risks when implementing, in addition to some solutions proposed by the author the idea for overcoming them, but the community needs to be informed of more solutions for these problems. That risk if the Funded scheme. In the process of implementing dApp, what are the risks that the project encounters affecting the progress of the project? the community needs more than listing risks and solutions for them, to help the project run properly its progress.\n", "q0r": 3, "q1": "The proposed idea does not define a timetable for completing the work, I hope the author will add it at the next fund. A cooperative in Uganda or Ethiopia would be used as a pilot project and the proposed milestones are reasonable, but it is not yet a blueprint, based on similar milestones. to the actual and achieved milestones.\n\nThe proposed project budget has exceeded 50% of the total funding budget for this challenge, which, compared to the proposal information provided, does not properly account for some of the project expenditures of funds. Given the $300,000 budget requirement compared to the $500,000 total budget for this challenge, I think the author needs to list more expenses, be as specific as possible, refer to multiple representations in Catalyst, or have You can contact IOG to ask them for more reasonable advice. A detailed budget should list the hourly payment of labor in each locality, corresponding to the duties of each person in the project team, the community needs to know it, which helps the transparency of the project. better project.\n\nHuman resources to carry out this project have not been assigned specific jobs, however, the listed experiences are suitable for this project, although the identities of the members are difficult to verify clearly. The author of this project is sandralvproject, with collaborators Karl Erik Johansson, Sandra Larsson, Billy Wideling, Sara Taxes, and Thomas, who, based on the skills listed above, indicate that this is an experienced team of project implementations. However, the author please provide additional links to identify reputable identities such as LinkedIn, Facebook, Twitter, and Discord, ... for the community to verify identity easily and practically.\n", "q1r": 2, "q2": "This project does not provide KPIs to complete the project's goals, the author of the idea please provide more complete project KPI metrics. Where and how will KPIs in measuring success in tackling corruption and promoting financial justice in cooperatives and NGOs be examined? The ideas of this project have clearly defined success, although they have not been tested in practice, it is still a good idea. Completely new idea information on the Cardano platform, which has never received any funding from the Cardano ecosystem.\n", "q2r": 3, "assessor": "z_assessor_2489", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 4158, "q0": "This proposal has a really good idea behind it, equality in pay for non government organisations. Whilst it may be a good topic it doesn't really have much detail on how its using Cardano and expanding adoption of ADA to Africa. Their request of $300 000 is 60% of the whole challenge budget and this proposal  hasn't given us enough detail on why they should have such a large proportion.", "q0r": 1, "q1": "Although this plan has nothing to do with Cardano itself, the proposer/s have done an average job with the planning of it. The plan isn't actually quite detailed and only explains what they are going to do and not how they will actually do it. They don't say how they will develop their app just that they will. ", "q1r": 1, "q2": "It will be hard to audit the success of this proposal as their only way to measure it is by the proposal succeeding  and there is no real way to track that. There are also no milestones that could help to measure the success as well. Something like showing how many people they are expected to join by certain dates would be a good addition to the plan.", "q2r": 1, "assessor": "z_assessor_2521", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"id": 4903, "q0": "The proposal wants to develop a dApp as a means of curbing financial malpractice. The dApp is a payment system by which a transaction can be passed only upon all members' acceptance of the payment. The proposal may face the corruption at play to stop the dApp development. To mitigate, it suggests using smart contracts and a third payment system where members get notice of intended transactions so that they can sign in to agree upon.\n\nI see the real-world solution being impacted upon the use of Cardano Blockchain, and if successful, it helps to increase the number of alternative usage of the Blockchain and may develop its growth. This is in line with the challenge priorities.  This is a practical use of Cardano built on the needs for solving problems affecting Africa. And with this I see it fit into the campaign.\n\nAlthough I see it has impacts on the ecosystem, I am not sure what's meant by a third party payment system for use to circumvent corruption within the co-operative. I am also not clear about the authorisation of developing this dApp for use in the co-operative. Although I do not have the jurisdiction for this assessment as regards the authorisation, I do not wish that the dApp being put to waste as a result if approval is not obtained.\n\nDespite that observation, I agree that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "I do not understand the detailed plan that is laid out. I do not understand the meaning of \"get members on board\" although I can understand using one co-operative as a pilot project. As for  \"Develop dApp for their needs\", I would have thought that the need is common to all the co-operatives and therefore  it's one dApp that serves all. The plan so laid out does not state the time frames of the project. I would like to see more details of the budget as well, as the two broad categories of cost is giving me an impression that it caters for a long term project, not just for the pilot project itself but for all other cooperatives and NGOs. \n\nWith the observations above, I have some reservations and therefore I disagree that it is highly likely this proposal will be implemented successfully.", "q1r": 2, "q2": "I am not clear about the project's progress reporting as stated. I thought it was talking about how success is viewed as opposed to the project status. It does not state the channel for progress reporting either.\n\nI find it vague about the success being stated. The way I see it, a transparent and fair payment system reflects on the financial reporting of the cooperatives in which every transaction is accounted for and may result in the increases in cash reserves and assets. That coincidentally is similar to the answer in the project's progress section. Nonetheless, as I see it, the success from Cardano perspective, is the number of cooperatives and NGOs onboarded to use of the dApp and the number of cooperative members involved in the use and getting to know Cardano is the ideal result.  \n\nBecause of the above, I disagree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 2, "assessor": "z_assessor_2631", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 5108, "q0": "The proposal is a $300,000 request from someone who identifies as an agroforesty specialist to develop a transparent payment Dapp for NGOs and Coops. The reason given is lack of trust and transparency.\n-----------------------------------------------------------\nThe lack carries through this entire proposal, unfortunately. There are two links to an organization that lists two employees, - one the proposer. The  organization is listed in LinkedIn as a farming concern from Stockholm and has 7 followers. The Catalyst Proposal info is also extremely limited and not-transparent.\n--------------------------------------------------\nAside from the lack of Doxx info which will follow this in the Feasibility section, this proposal for a Smart Contract multi-sig wallet payment Dapp could be for anywhere and has nothing to do with the challenge and there was no reasonable attempt to answer  how it meets the Challenge. It does not!\n------------------------------------------------------\nMy assessment of this proposal is a 1 star- I strongly disagree that it meets the objectives laid out in the Challenge.", "q0r": 1, "q1": "One of the first items I look for in assessing a project, investment, company, etc  is who is the team and who is the team leader and what are their strengths. The proposer is listed as having a degree in Agroforestry. There is no mention of any tech experience and there was no method I found to Doxx the two individuals listed in the link to the company. There are other names listed but without recourse. \n_______________________________________________________\nThe budget is simple - $200,000 for Dapp development and $100,000 for salary and travel. Period. I would suggest to all proposers - details matter. The detail of the  timeline is about as detailed as the budget and does not have any timeframes. Suggestion to all proposers - voters and PAs like the details, especially about how and when a project is going to take place, oh, and also how the money will be carefully spent and accounted for - all in a transparent way.\n-------------------------------------------------------\nMy assessment of this proposal due in most part to the lack of information, detail, background documentation and lack of transparency is a 1 star - strongly disagree this will be implemented.", "q1r": 1, "q2": "An audit of progress and success requires some measurable item or items, often termed milestones or KPIs. These allow the community to understand how the funds invested in your project are being used. A $300,000 request for funding is not budget dust so a resonable assessor should expect some type of accounting for how and where the money was going to be spent and a methodology and how to verify that spend.\n\n------------------------------------------------------\nThere is really nothing offered in this proposal as a way to audit the progress or success. My assessment is a 1 star - highly disagree there are milestones, KPIs or an identifiable measurement of success.", "q2r": 1, "assessor": "z_assessor_2671", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5518, "q0": "The submitted proposal is directed toward eradicating one of the biggest problems that hinder the prosperity of any NGO and their initiatives which is corruption. There are several instances where the funders and charities have found that their funds are not getting utilized as expected and later they would not try attending any other fundraisers making a lot of deserving initiatives never see the light. Thus a dApp to ensure the smooth functioning of an NGO and systematic dispersal of collected funds would be highly effective. However, the corruption inside the cooperative the author proposes could be an area of concern. But if the author is intending to use a third-party payment app to resolve this issue, then I don't see the need for such huge funds for the development of the app. Hence the author might have to take this into consideration going forward. Apart from the very brief solution, there isn't much information to assess the kind of lives this could be impacting and how exactly the dApp will be standardized and marketed across the community to make sure some NGOs start using it.", "q0r": 4, "q1": "The proposal is kept to a minimum by the proposer. As a result, it may be difficult for readers and members of the community to comprehend how the team plans to approach the challenge. It isn't any better because the action plan and milestones are lacking. Despite making up only approximately 7-8% of the total, the desired amount still seems excessive. A thorough budget breakdown could have been more appropriate. Additionally, there is no other information available regarding the makeup of the team assigned to work on this concept, except for their names. Considering that the proposal is coming from a newcomer who hasn't been a part of any other proposal from the previous or this round, makes it all the more difficult to assume the chances of successful implementation. The costly dApp creation cannot be overstated enough especially if third-party payment services are leveraged. The community as a whole will undoubtedly rejoice if such a new notion succeeds, but given the available information, it is difficult to draw firm conclusions regarding that outcome.", "q1r": 1, "q2": "As a reader, I assume nobody can really tell where this project is going because there are so many important details that are still missing. Again, this suggestion is not being helped by the lack of information about the preceding study or foundational work. Additionally, the monitoring process is made difficult by the absence of the success criteria and KPIs that the auditors may utilize. There is no way to conclude if the milestones and final goals of the proposal meet the challenge's expectations. Even though a large chunk of the fund is allocated for the dApp creation, there is not enough emphasis on the way the community can track the development process of the same. My suggestion to the author and his/her team would be to go back to the drawing board and break the entire proposal into respectable chunks and raise funds for each of them through multiple rounds as the community might find it easy and profuse in seeing agile development stages as proof for further funds. Also, a detailed action plan with sensible milestones at regular intervals will make the tracking also simple and exciting.", "q2r": 1, "assessor": "z_assessor_2704", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 6836, "q0": "Africa is plagued with numerous forms of financial corruption and irregularities when it come to funds disbursement and payments. Most ssytems of payment are centralized and subject to manipulations and lacks transparency. The proposer carefully identify these problem and intends to provide a solution that leverages the smart contract capability of Cardano. The proposer seeks to build a payment DApp for cooperatives,  NGOs and enterpreneurs in Africa where all payments will be onchain. The payment system will have suites of features some of which will grant recipients the option and liberty to accept/reject a certain payment option, team should also consider to enable multisig capability where a certain number of people have to collectively sign a particular transaction before it goes onchain. These will ensure transparency, openness and collective consensus in all monetary/financial transaction and decision. This is made possible through blockchains due to their distributed open ledgers. These will automatically give users the needed and required right over their payment systems/options. These perhaps aligns with the challenge category.", "q0r": 4, "q1": "The proposer provides some notable milestones but no specific timeline was provided for achieving those milestones and that is confusing. The proposal lacks a more realistic timetable to complete the work and there's not much implementation plan that shows how the project will be implemented/accomplished.\nI also find the budget vague although the requested budget amount is fair enough. The proposer highlights just two items in the overall budget breakdown (DApp development: $20k and Salaries and travel: $10k). A proper breakdown of how the above amount is arrived at will better inform the catalyst community.\nTeams details is provided with their various roles in the project (perhaps some links to team members social/employment public profiles will be good incase of future proposals).", "q1r": 3, "q2": "The metric used to measure the progress is solely dependent on how successful the DApp development is and how target organisations and businesses adopt the payment system. The team however considers these project a success when they have a working product with all functional features that ensures transparent and fair payment alongside maximum support for enterpreneurs and businesses. I think team should consider open sourcing their code, as these will improve trust from the community.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 7583, "q0": "This proposal plans to address an issue with corruption and control in NGO sector in Africa. Overall, NGO is an important sector that can have a direct impact on African societies and will help to promote Cardano in Africa. It would be great to have more details from proposer on which types of NGOs will be in scope of this proposal and if there are any organisations that already agree in principle to participate or expressed an interest in this proposal", "q0r": 4, "q1": "Based on the information provided it's very difficult to assess if proposal is feasible or not - first of all there is no definition of functionality that is being built, what users will be able to do. It is stated that project will follow trial and error approach, but at least some sort of blueprint is required to evaluate what has to be delivered. Secondly, just a high-level budget is provided for app development and salaries and travel, with no milestones, no indication of hours to be spent, rate per hour or specific skill-sets required. The amount requested equals to 60% of funds allocated to this category. There's no LinkedIn profiles of members, nor I can see any links to GitHub showing any development experience of team members in this area, which also makes it difficult to assess feasibility. ", "q1r": 2, "q2": "KPIs provided are very long-term and generic, like end all poverty in all its forms everywhere - I don't think that such a KPI can be achieved solely by this proposal. I would expect more specific KPIs, like number of partner NGOs on-boarded, number of wallets / users, maybe processed amount and other metrics linked to Cardano usage. I also expect to see a roadmap, showing how and when interim development goals will be achieved and what these goals are. If travel to Africa is budgeted then when it will happen and why (e.g. participating in a conference etc.)", "q2r": 2, "assessor": "z_assessor_2905", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 8287, "q0": "I think this idea is very interesting and could have a big impact on Cardano. However, I think it could be a little more developed. I would have liked to see specifics about the dApp. I also believe there are more risks than the one mentioned. For example, if the quota each person will receive is negotiable, shouldn't it be considered power relations, where the one with the most money will get to decide? Another risk is the possibility will resist a new payment method, when they could stick to the traditional ones they already know.", "q0r": 3, "q1": "In my opinion, there isn't enough information to judge the project's feasibility. The milestones are a good starting point. but there isn't a clear timeline, with how long each step would take. There could also be more information about each step. For example, for the first milestone \" Get members on board\", I would like to know how this will be achieved if there is a marketing strategy if there are some stakeholders mapped out. The same thing for the budget: I would like more information on how they came up with these numbers, so I think the project could benefit from the more detailed budget. Regarding the team members, I would have liked more information about their background and some links to check their revious experience.", "q1r": 2, "q2": "While this is a very valid goal, I think there should be some metrics to define what a successful project is like. How many people should be using the dApp by the end of the project? How will they measure the decrease in corruption? I also think there should be some KPIs to help track the project while it is happening.", "q2r": 2, "assessor": "z_assessor_2971", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 12703, "q0": "I think the proposal addresses the challenge. The proposal talks on a way of tackling corruption and financial injustice in Africa, using a Dapp.\nIt is known that, corruption in Africa has always been a major problem mostly among NGOs, cooperatives, and among government authorities causing many people to leave in poverty because they are not paid for their work. So, I can clearly say that this proposal addresses the objective laid out in the challenge which will permit each and every one to end exactly what he or she deserves through a dAPP, thereby reducing the rate of corruption.\n", "q0r": 4, "q1": "I personally don’t think this proposal will successfully implanted. Yes, it’s true there is an experienced team which has been working on programs like this one but the information which the team has given is not really convincing. For instance, the timeline and key milestone for delivering this proposal is just stated, they didn’t say the time like number of months which they will use. Moreover, I think the fund demanded is much and the team didn’t clearly break down the budget.", "q1r": 2, "q2": "The information provided for me is not sufficient to audit the progress and success of the proposal. Presence of experienced team yes, but the timeline or milestone is not clearly explained, risk involved is not convincing enough, furthermore the budget breakdown is not convincing at all. Also, for the details of the people who will work on the project they talk about universities in Uganda but at least they should mention names of the universities because I don’t think they will work with all universities in Uganda from the beginning.", "q2r": 2, "assessor": "z_assessor_3457", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12802, "q0": "The problem is stated clear. NOGs aren´t transparent, there are often problems with corruption or the money isn´t used efficiently. This should be solved by a dApp where transactions will be frozen until members have confirmed the transaction. This should provide transparency and fairness. \nI see some problems in the concept which lower the impact because the dApp isn´t outline for real world usecases. Every transaction must be accepted. This is a problem because it takes time to accept these and in the real world there will be many small transactions where the time expense surpasses the usability of the transparency. Secondly the acceptors are in the cooperative/ NGO therefore they could accept corrupt transactions by working together. So it doesn´t solve the corruption problem efficiently. \nOverall the idea is great and brings a new usecase to the Cardano ecosystem but it´s not adapted for the real world. It from the current outline it would just be to expensive and laborious for the use in the real world. Therefore I don´t think that it will bring many new users to Cardano in its current form. I give 2 stars because the idea is good but there are obvious problems with the concept. Please revise the proposal and address the named problem. I see potential in this Idea. ", "q0r": 2, "q1": "The team has provided a list of people who work on the project but there isn´t any proof of their skill. The website of the team (Johansson and Larsson) looks good but is just the basic. Therefore there is not proof of the blockchain development skills. Please provide additional infos on your experience and skills for example by linking you LinkedIn profile or providing some previous work from the developers. \nThe plan is just described roughly. Please provide some more infos, when do you want to develop the dApp, how, is there an outline for the development etc. \nThe budget is described very short. Please provide more infos like how much are the salaries, where do you travel (whats exactly the plan), do you have an development plan and how much money flows into different developmentparts like connection with the blockchain, smart contract writing, coding an good and easy usable frontend etc. \nThere are many informations missing therefore I give one star. ", "q1r": 1, "q2": "There are no KPIs and metrics to measure the success for the project. Please provide some like Number of NGO cooperations, Number of transactions, and an evaluation whether this has made them more efficient. Also the roadmap isn´t clear. \nThe stated problem is clearly defined and their goal clearly solves it. \nIn conclusion I give 2 stars because the overall goal is clear but there are no metric to measure the success. ", "q2r": 2, "assessor": "z_assessor_3472", "no_vca": 12, "ne": 2, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 13760, "q0": "The project aims to solve an important problem faced by cooperatives and non-governmental organizations in Africa. It is desired to develop a payment dApp based on the principle of transparency and trust. Thus, a fair payment system will be offered against corruption. But even if it is a suitable offer for Grow Africa, I have doubts about its suitability for Grow Cardano targets. There is no information about how this offer will benefit in bringing Africa to Cardano.\n\nIn addition, corruption was cited as the main risk that could hinder the successful realization of the project, and a notification that all its members would receive via a third-party payment system to accept the transaction once an agreement was reached. There is no guidance here on how to achieve an agreement and how to proceed in case of no agreement. The fact that not all members come to a common agreement also seems to be a risk.\n", "q0r": 2, "q1": "Plan stages are specified under 4 main headings, but no information is given about the project delivery time. It was stated that it would start with a pilot cooperative in Uganda and Ethiopia, but there was no link or information about this cooperative. It may be a lack of advertising to announce this project to more cooperatives and non-governmental organizations. Information on whether there will be a study on this and how to follow the path is not included.\n\nAny link, etc., about Karl Erik Johansson, Sandra Larsson, Billy Wideling, Sara Taxen, Thomas, who will work on the project, in order to obtain the necessary information and competence of the project. does not exist. I would also like to see information transparency in a proposal submitted with the principle of transparency. The same is true for universities and cooperatives in Uganda. There is not enough information about which cooperatives and universities they are and how they will contribute to the project. \n\nFor the budget requested for the proposal, 200,000 dApp development and 100,000 salary/travel phrases do not seem sufficient for the mentioned transparency.\n", "q1r": 3, "q2": "There are almost no details on how this proposal will be audited. It is mentioned here that success in solving the problem of corruption and growing financial justice within cooperatives and NGOs will be measured by progress, but it is not clearly stated how to monitor whether this corruption is resolved or not. Through which channels and what path will we be able to see the success of the solution of this problem? How will we be able to observe the payments made to the members and the increase in resources? No information is available about these.No information is available about these.\n\nA very general statement was made about the success of the project: “Success is finding a payment system that is transparent and fair, supports entrepreneurship and increases livelihoods.” There is no information in the project about supporting entrepreneurship mentioned here and the explanation is very inadequate. How many members will the project reach, how many cooperatives will this 'intended' success be achieved? \n\nDetails are very lacking, this could be a viable project if fixed.\n", "q2r": 1, "assessor": "z_assessor_3781", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14061, "q0": "It is proposed to create an anti-referential dApp in which all users must consent to a transaction made by one member. The plan adheres to the Grow Africa, Grow Cardano principle. This section contains an unnamed program and business that will be developing it. This suggestion, in my opinion, is fairly excellent but requires more documentation information.", "q0r": 4, "q1": "I don't rate this category highly The qualifications and experience of the team members are not described in any detail. These members cannot be identified by any connection. The use of the funds is explicit and legally binding. is not assigned a deadline to finish the task, and the well-well-koscience, language, and technology do not have a destination. Don't think about the formula and take a chance on appearance.", "q1r": 2, "q2": "Without detailed measures or KPIs, the proposal doesn't specify how they would offer progress reports if financed. In this part, I would want to see a straightforward and concise roadmap. There isn't a public outlet to inform the neighborhood about developments.", "q2r": 1, "assessor": "z_assessor_3888", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "We are looking to develop a payment dApp for cooperatives & NGO's in Africa, with a transparent payment system where transactions only goes trough when accepted by other members in the cooperative.", "experience": "Karl Johansson holds a degree in agroforestry from SLU, has worked in Africa for decades solving similar problems, we have cooperatives, NGO's, universities, governments and institutions who wish to join us in the development of this project."}