{"id": 366896, "author": "", "title": "Marketplace for tokenized property", "url": "https://cardano.ideascale.com/a/dtd/366896-48088", "category": 26115, "amount": 40000, "description": "Home buyers/sellers should be the two parties involved in a transfer. However, 10% of sale price is 3rd party profit. Research links: \\[1\\]", "f6_no_assessments": 2, "f6_rating": 2.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is very solid, the comments above have been addressed. Networking is key here for sure.", "q0r": 5, "q1": "With technical expertise on the logistics and legal side also being taken care of I think this project will be very successful", "q1r": 4, "q2": "Did have a lot of information but some additional information was needed.", "q2r": 4, "assessor": "z_assessor_264", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The proposal does not address the problem. The problem is that real estate transfers have have losses associated with middlemen. The proposal does not involve the legal transfer of real estate, which accrues those buyers and sellers fees. Instead the proposal is geared toward their FLIP token, which is attempting to address crowdsourcing real estate investments. This proposal seems to be conflating two problems in the Real Estate space.", "q0r": 2, "q1": "I have two major concerns with the proposal. The first is the oracle problem. For partial ownership of a real estate venture, one would need to provide information on two things, the current renovation status, and current market status. For redeeming a FLIP token, one would need to know both. I see no plan for providing either of those pieces of information. Nor can I imagine a way of providing a status of the property renovations in a decentralized way. The second issue is that the FLIP token, seems to fit the definition of an unregistered security. It is a financial contract with the expectation of profits, based on the actions of Chosen Homes Network providing those renovations on the properties. I think if one is going to operate in this space in the US, they would need to provide a plan for financial regulation.", "q1r": 1, "q2": "Many of the auditable timeline thresholds are meaningless. For example, if the proposal is requesting 40k in ADA, most of the staking goals could be reached simply by distributing that ADA across 50 wallets and all of them delegating to the chosen pool. Additionally, some metrics are either vague or could already be met. Consider the metric, \"Established 10 functioning partnerships with brokers & contractors.\" That is vague, in that it doesn't define functioning, nor does it define whether it could be 10 partnerships all with contractors. Secondly, as someone who has flipped homes in the past, having 10 partnerships with contractors is very easy to establish, and the proposers could have that metric met already. Thus, that metric acting as a measure of progress could be misleading.", "q2r": 1, "assessor": "z_assessor_601", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "Create a marketplace for buying/selling and **investing** in real estate via Title & Deed NFTs to remove profiting 3rd parties.", "experience": "Team has 5 yrs of real estate experience, built a solid base for the project, and dedicated to restructuring the unfair R.E system. \\[1\\]"}