{"id": 367072, "author": "", "title": "Cardano NFT Idea Patenting", "url": "https://cardano.ideascale.com/a/dtd/367072-48088", "category": 26115, "amount": 1, "description": "Traditional patents and copyrights are currently expensive, difficult to get, and hard to enforce on a worldwide scale.", "f6_no_assessments": 3, "f6_rating": 2.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is a call to action for the developers and community. The proposal is full of information and describes various methods to use NFTs, however, as it is a call to action and effectively \"not a project\" - it is difficult for me to say if the proposal addressed the challenge. ", "q0r": 3, "q1": "I like the ideas presented, however, the proposal is a  \"call to action\" and thus not a project (as reflected by the $1 budget). This specific proposal will not be implemented but the ideas presented might be imlemented by other teams.", "q1r": 3, "q2": "The proposal is a call to action that will not be implemented as a project, thus there will be no need to audit the proposal.  ", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The problem identified clearly addresses the challenge. There were over 250000 patent applications in the US in 2019 meaning that this could be a fairly large use case for the Cardano blockchain. Combine this with the number of peer reviews as the author suggests and there are several million blockchain interactions through this application alone. \r\n", "q0r": 5, "q1": "The experience of the individual presenting the plan is solid and the paper is clearly written but there are no external references to him. It would be great if he could point some of his other work. It would also be good see if there is a team supporting him as there is a lot of research that has been suggested as part of the proposal.  ", "q1r": 2, "q2": "There is a timeline presented that could be more detailed, currently it is only in broad outline phases. It would be great if the costs involved are made clearer. Further the amount applied for is only $1 which would not allow him to build a team around this idea. ", "q2r": 1, "assessor": "z_assessor_466", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement is definitely falls under the scope of the challenge since the proposer just ideate his way to solve/build an business model over NFT on Cardano and i personally love the idea of integrating NFT with IP.  However the proposer didn't explain whether his NFT would be some just as an utility or a token where someone invests and the process that he want it to be as. Since this is just some ideation it is really hard to assess the impact on cardano ecosystem by implementing this idea. Given the facts i can neither agree nor disagree  that this proposal will be able to effectively address the challenge", "q0r": 3, "q1": "Since the proposer is just presenting his idea it is very hard to check the feasibility and the proposer himself doesn't have any relevant experience in this field. Proposer doesn't have any team or any idea of how many members are required in each team to implement the idea. Since the proposer just want to present his idea to the community he didn't outline any actual or feasible budget details. The goals are very vague but the idea is pretty good. There is no particular roadmap or any specific timetable or plan on how to achieve this goal. The proposer doesn't have any idea of legal obligations of integrating NFT's with IP since IP is definitively a security perspective issue to the country/world. Even if the hurdles with the government is solved there is not specific details on how a company will be trusting your platform to transfer over a specific amount of money for any transaction into crypto market. With all the above reasons I disagree with the proposal as a implementable idea.", "q1r": 2, "q2": "I know that this is just a idea of a business model but since there is no specific details of roadmap, KPIs/metrics, and no defined or specific structured solution on overall challenge i would strongly disagree that this proposal will be able to be auditable with the given information.", "q2r": 2, "assessor": "z_assessor_537", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Use NFTs on Cardano to simplify the patent process, reduce costs, and create a unified searchable NFT patent library.", "experience": "Mechanical Engineer with experience in product design"}