{"id": 367253, "author": "", "title": "NFT for Real estate and Land", "url": "https://cardano.ideascale.com/a/dtd/367253-48088", "category": 26115, "amount": 45110, "description": "There is a critical issue in the real estate business; tax evasion, fraud in share companies and corruption in investment land allotment", "f6_no_assessments": 4, "f6_rating": 3.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "I think the proposals is innovative and provides a interesting use of NFTs if implemented properly. \r\nHowever, I think most of the value of this proposal relies on the integration with local governments and l would have like a section on how this proposals addresses the problems there in more detail (ie. how this helps with tax evasion given privacy concerns? how are taxes evaded now which will be harder to do with NFTs?).\r\n\r\nIn addition, a lot of the specifics of this proposal are tailored to the local community and market this proposal is made for and I lack some context to judge it.  The catalyst community is spread around the globe and I can only judge this based on what I think is the situation in Ethiopia / Addis Abeba, and I'm reasonably sure it's quite different from where I live. As a suggestion, some resources that explain the current situation in the local market could help in understanding the proposal better.\r\n\r\nAnyway, taking into account the innovative idea and similar initiatives that could stem from the project if implemented correctly, I will give this proposal a 4.", "q0r": 4, "q1": "The plan is described reasonably in detail and the experience listed is relevant. As a developer myself, the technical plan seems a bit tight on timelines but otherwise decently laid out.\r\n\r\nThere are a bit of inconsistencies though, which are not deal breakers per se, but I would like resolved before giving a final decision (or for next time):\r\n* The budget mentions EC2 graviton p2.xlarge instances. However the listed instance type, p2.xlarge, is not based on Graviton and is actually an instance with an attached gpu, which I don't understand why is used in this setting (nor the plan explains it) and is considerably more expensive than a standard compute instance.\r\n* The partitioned budget does not add up to the total value. I redid my counts a few times and they add up to ~85500$, which is around 6k$ more than the total of 79510$ listed in the proposal\r\n\r\nIn addition, I think the proposal, and the budget, are a bit too focused on the technical implementation of the project. While I trust them to deliver the technical platform, I think this has little to no value if there are no connections and adoptions by local government.\r\nLooking at how the budget is split, and counting in the \"marketing/relations\" budget the following items:\r\n*  marketing 3k$\r\n* legal consultant 1.5k$\r\n* miscellaneous 2k$\r\n* business consultant 1.5k$\r\nwe get that the budget allocated to \"marketing/relations\" is less than 10% of the general budget (using 85500$ as the total value).\r\nAccording to Deloitte, companies in the Tech Software / Consumer Services usually spend around 15% percent of their budget in marketing alone, and this percentage is even bigger for typical startups (around 20% according to lola.com)\r\n\r\nTL;DR The technical plan seems decent to me (a developer), but the business / marketing / relations plan is lacking and could impair the whole project if not executed properly and I would have like more attention on this. Maybe you can iterate from here and re-submit the proposal on the next fund. If this concern is addressed, I would be happy to give an higher rating.", "q1r": 2, "q2": "There some success metrics listed, but a  good part of them are a bit vague in my opinion. Take for example \r\n* [...]\r\n* Meeting client expectation\r\n* Good user experience\r\n\r\nMaybe we could tweak those a bit to make them more easily auditable like \r\n* Meeting client expectation: define client stories and requirements with an initial panel of customers and share it with the community\r\n* Good user experience: user rating of the companion app on the play store is above 3.5 / 5\r\nso that we eliminate subjective opinions", "q2r": 3, "assessor": "z_assessor_131", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposal's problem statement and solution are aligned with the challenge objectives. By tokenizing property ownership, it will give a new utility use case for CNFT , thus adding value to Cardano. The potential to create recurring use as well as to scale the project to address future challenges are also promising. I also believe that this project will be the 'proof-of-concept' for fighting corruption which will give a huge impact on Cardano. However the proposal did not mention the project will be open source or not. It will be more beneficial for it to be open sourced and be used by other nations.", "q0r": 4, "q1": "The proposer provided verifiable credentials of the team members with evidence of skills and experience to execute the project. Furthermore, the proposal presented the manpower and resources needed with detail budget breakdown of the costs needed to successfully implement the project. Moreover, with a project as ambitious as this, the budget asked for is reasonable. This proposal also provided a plan if additional funding is required. In addition, this proposal already considered the risks and challenges relevant to to successful implementation. However there is a few questions regarding driving down the cost for buyers, can you present the details on how much cost is expected to be reduced when using your system? And also regarding your revenue model, who will receive all those fee? How much is the fee? ", "q1r": 3, "q2": "This proposal provided a clear roadmap with timeline and explanation of what and how it is being done. However there is no method of reporting presented. List down where the community can keep track of the progress", "q2r": 3, "assessor": "z_assessor_357", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Creating a platform and using NFTs to represent asset ownership addresses the challenge brief of creating business models with NFT's at the core. Minting and using NFTs to tokenize assets will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. I would like the team to redefine the problem statement and solution, as written at the moment it is unclear how NFTs will form the solution to the problem presented (tax evasion, corruption).", "q0r": 4, "q1": "Using NFTs to show prove of asset ownership is a good idea. However the proposal requires further development to ensure successful implementation. The team can expand on the type and number of team members required to implement the proposal, what are the responsibilities and deliverables of each member. I would like the team to provide a deeper explanation about the architecture and language for the implementation of the back end of the product– servers, hosting, support etc. ", "q1r": 3, "q2": "The proposal has a minimal roadmap and budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond single line entries and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "There's enough in this proposal to make a valid case to start such a venture. However, it may benefit the voter to know the project is intended for Addis Ababa as the starting point within the first sentences. That may lend this proposal a measure of viability, enough for the peruser to read on. Real Estate as NFTs will be difficult to achieve in countries where there are established & thriving property markets tied to government regulated economies, but in countries like Ethiopia, there may be scope for such a market to develop. And this proposal may fill a void. ", "q0r": 3, "q1": "The proposers' credentials present on-the-ground experience in Addis Ababa including a team member in the infrastructure industry. A relatively good plan has been laid out on a month-scale including the types of expertise needed and the allocation of resources for the efforts. There seems to be careful consideration of each step required in the journey and the kinds of relationships needed with local authorities in order to gain acceptance and traction. That said, it seems this proposal is very much in a nascent stage. There may be greater chances for success had the local government office been approached already and perhaps secure an MOU. This solution will not gain ground without govt cooperation, and the risk is having this proposal approved only to be met with rejection by the authorities. Had first contact been made and presented here, I would have given it a relatively higher score.", "q1r": 3, "q2": "This proposal paints a clear picture of both quantitative and qualitative aspects of the project that it would be easily auditable. Expenses are aligned to roles and the required DApp and business developments. There are clear definitions of levels of successes and the fact they are presented in a linear timeline could provide a check of how things are going and adjust as necessary, something which the proposal also stated. The fact a total project amount is defined and that funding from Catalyst is not 100% of what's required suggests other sources of funding is at hand. It would have been good if this was further explained, but should this project be successful, there is nothing stopping the proposers to return to future Catalyst funds to seek additional amounts. Good luck.", "q2r": 4, "assessor": "z_assessor_42", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}], "solution": "A niche NFT marketplace, where tokens represent the physical assets of land and houses in real estate and where people buy and sell.", "experience": "A Full-Stack & Mobile App Eng, tested Plutus playground, B.SC in Computer Science, 4.5 years, key connections, solidity smart-contracts."}