{"id": 368444, "author": "", "title": "Explorie the next NFT platform", "url": "https://cardano.ideascale.com/a/dtd/368444-48088", "category": 26115, "amount": 70000, "description": "1: NFTs often have little real life utility other than speculative gains. \n\n2: Businesses are struggling during & after the pandemic.", "f6_no_assessments": 1, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Creating a NFT platform for businesses addresses the challenge brief of creating business models with NFT's at the core. Businesses minting and selling NFTs will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. \r\nI would like the team to refine the problem statement and solution, at the moment the two read disconnected from each other (Problem= Busineses lack of knowledge to use NFTs for marketing, Solution = our platform to educate and provide framework for business to use NFTs). \r\n", "q0r": 4, "q1": "I like the idea but the proposal requires further development to ensure successful implementation. I would want to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to expand on the plan to go to market and acquire customers for the platform.", "q1r": 3, "q2": "The proposal has a high level roadmap and budget.  I would like to see the team further develop and define Key Performance Indicators (KPI's) for the project, then connect the KPIs to the milestones on the project roadmap. The budget is mainly allocated for the payment of labor (salaries). – I would like the team to connect the KPI's and roadmap milestones to the labor spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the labor spending. I would like the team to connect the KPI's and roadmap milestones to the budget, in this way you can track performance and spending over a timeline.  As the project stands at the moment, I feel the project will be difficult to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "Platform where businesses can use NFTs as marketing tool. They can issue geo-tagged NFT vouchers in Explorie, allowing consumers to collect.", "experience": "The team consist of 6 member. Four developers and two business/marketing strategist."}