{"id": 368889, "author": "", "title": "NFT Real Estate", "url": "https://cardano.ideascale.com/a/dtd/368889-48088", "category": 26115, "amount": 10000, "description": "We have to be able to use ada as a currency or it may loose its value.", "f6_no_assessments": 5, "f6_rating": 1.4666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Perhaps adding more research on this would have added more value to the proposal. Since there is not much information available in the proposal it remains highly abstract. Would love to see more improvement in the proposal in further rounds.", "q0r": 4, "q1": "It would have been great to have some experience related to the proposal like any links to the previous proposal or any social presence. Also would suggest adding a detailed plan of how this proposal would be implemented, how to get support from local authorities to get authenticity to property NFT's created.", "q1r": 1, "q2": "Fund break-down for execution, the timeline seems missing, Also suggest to include the challenges faced and how it will be overcome, how the project will be sustained in the future.", "q2r": 1, "assessor": "z_assessor_208", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is very short and lacks detail, however, tokenizing real estate as an NFT addresses the challenge brief of creating business models with NFT's at the core. Minting and selling NFTs on the platform will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. However, the problem statement and solution presented are disconnected, I would like the team to rework the problem statement and solution to clearly demonstrate how NFTs will be at the core of their business model.", "q0r": 3, "q1": "It is a good idea but I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to further expand on the plan to go to market. – how will the team recruit users for the platform. ", "q1r": 2, "q2": "The proposal has no roadmap and single line budget. I would like to see the team develop Key Performance Indicators (KPI's) (tokinize 10 properties by month 3) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Draft proposal. The problem description doesn't make and the solution description is vague.\r\nThere is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The proposer has certainly identified a valid use case and problem that could be addressed by NFT's. They have not at this stage articulated enough examples of how this proposal will create a meaningful impact to the Cardano ecosystem and this needs to be fleshed out further to warrant community buy in.  ", "q0r": 2, "q1": "The proposer describes themself as a dreamer and that simply is not enough of a qualifying statement to give the community insight to the potential talent and experience of the proposer. Needs further work to this section to be assessed on its merit. ", "q1r": 1, "q2": "Certainly a valid idea is presented in this proposal but lacking in information required to assess this proposal higher. I would strongly recommend that the proposer seek out similar proposals and engage with those teams to help build a stronger proposal that is budgeted and meets KPI metrics.  ", "q2r": 1, "assessor": "z_assessor_53", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I am an active member of the Cardano community and I have 7 years of experience delivering software projects as a QA. \r\nThe problem statement has nothing to do with the Challenge, in my opinion, which is about increasing the utility of Cardano, not the price of ADA.\r\nThe solution, although it sounds interesting and there may be something I'm missing (I am not a developer nor a real-estate agent). but I do not see how property can be sold as an NFT. In the detailed plan it's specified that people would purchase NFT representations of a condo and then suggests they could either move in or rent it out. This does not make any sense to me.\r\nDue to the above mentioned reasons and the fact that I can see no metrics for success mentioned anywhere, nor details about who will implement these smart contracts, I strongly disagree this proposal effectively addresses the challenge.\r\nFor the proposal to receive a higher score, it should reformulate its problem statement to fit the challenge. The proposer also needs to give more details about how these smart contracts will be created and how exactly they would work. Measures of success also need to be added.", "q0r": 1, "q1": "I do not think this proposal has any chance of being implemented successfully. Here is my assessment:\r\n- The proposer has not provided any details about himself whatsoever and I cannot count \"Dreamer\" as relevant experience here\r\n- The proposer has been a member of Project Catalyst only since the 22nd of August, 2021\r\n- I cannot find any previous contributions of the proposer to the Cardano ecosystem\r\n- There are no details in the proposal about who will do what, when and how\r\n- The budget is very large and there is no justification on how it is intended to be used\r\n- Between 22 and 25 August, the proposer has created 7 separate proposals, all suffering from the same issues as this one. This leads me to suspect that the proposals were created en masse in the hopes of gaming the system and obtaining some funds. I apologize if I am wrong.\r\nTo make this proposal feasible, the proposer needs to provide more information about himself, about the people who will help him and as mentioned earlier, to identify a problem pertaining to this challenge and come up with a solution to match.", "q1r": 1, "q2": "I cannot find any information at all that explains how the progress and success of the proposal would be tracked, if it were to be funded.\r\nAs such, I completely disagree that the proposal is auditable.\r\nIn order for this to be fixed, the proposer needs to provide a clear roadmap describing what will be done when and how, with specific milestones and a time-horizon for the implementation. Along with this, key progress indicators also have to be mentioned.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 9, "ne": 6, "ng": 2, "nfo": 1, "vca_o": 2}], "solution": "Create smart contracts that allow property to be sold as NFT's.", "experience": "Dreamer"}