{"id": 369475, "author": "", "title": "Bidpool.xyz - NFT Governance Tokens", "url": "https://cardano.ideascale.com/a/dtd/369475-48088", "category": 26115, "amount": 32256, "description": "There is no service enabling multiple parties to jointly buy/own NFTs. Current options are expensive, complex, and lack a governance system.", "f6_no_assessments": 5, "f6_rating": 1.4, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal highlighted a problem of co-owning NFTs but the solution to the proposal is generic and did not offer details on how this will be executed and the benefit to Cardano.\r\nI disagree.", "q0r": 2, "q1": "The proposal presented verifiable experience with links but failed to present an implementation plan.\r\nA justification for the requested fund and its cost  breakdown wasn't provided.\r\nI disagree.", "q1r": 2, "q2": "the proposal did not provide Sufficient information that will help in auditing the progress and success of the proposal.\r\nI strongly disagree.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "I think this is a very cool idea. I think it is original, as I have not seen this anywhere prior. I think that empowering groups of people to be able to bid for NFTs together will be appealing to a lot of smaller investors that might not be able to afford something on their own. I also like that you created a website to show off your project. \r\n\r\nAn issue that I see with the proposal that I think you should work on, is there is a lack of details. The idea is great, and I think that it addresses the challenge extremely well, but you do not have any details other than the general concept. You did provide a link to your website that explains a bit more, but requiring people to go to other websites to get the info might not be the best idea for potential voters. Also, while there is a little more information on the website, it still does not have sufficient details to properly assess it. ", "q0r": 3, "q1": "I like that you made a funny statement with your relevant experience, but it seems like the all purpose dev is the only direct relevant experience. The NFT collector and economist might have some skills that they can add, but its a bit unclear to the readers exactly what that might be. You have a little more information on the website, but its the same issue of not having enough info in the actual proposal for the voters. \r\n\r\nGoing back to my comments above, I think this is a great idea, but there is not enough information in the proposal to be able to determine if it could be successfully implemented or not. Having a great idea is not the same thing as having a plan to execute it. Voters will want to see all the details of exactly what you plan to do to bring this to market, what your timeline and milestones would be, how me measure success of this project, etc. ", "q1r": 1, "q2": "This is the same issue as above. There is not enough information provided to audit against. There are no milestones given, KPIs, or even a definition of what success would look like for us to audit against. I would strongly consider thinking all of these areas through and listing them out, as they are things that people will want to know about your project. \r\n\r\nSo again, love the idea and would like to see this come to Cardano. But the only thing we could audit against here is if if a complete tool exists. ", "q2r": 1, "assessor": "z_assessor_347", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is very short and limited in detail, thus it is hard to judge if the proposal will effectively address the challenge presented. I would like the team to expand on the mechanics behind a DAO per NFT and explain in more detail how NFTS will be at the core of the business model presented.", "q0r": 2, "q1": "Although the team provided a link to github I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 2, "q2": "The proposal has no roadmap and single line budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "Draft proposal. The problem description is reasonable, but I recommend including more information about the problem.\r\nThere is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is one of five proposals of the proposer that does not fulfill any formal requirements while asking for large sums of funds. Please do not vote for this.", "q0r": 1, "q1": "No plan and no proof of experience are presented at all", "q1r": 1, "q2": "No key metrics, no plan and no explanation for the budget is given. This proposal cannot be audited", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Build a tool to enable trustless parties to jointly own NFTs while leveraging the governance features of Cardano native assets. DAO per NFT.", "experience": "An NFT collector, an all-purpose dev, and an economist walk into a bar... we don't really know the punchline here but maybe one of you will."}