{"id": 369628, "author": "", "title": "Hup | hearth up", "url": "https://cardano.ideascale.com/a/dtd/369628-48088", "category": 26115, "amount": 20000, "description": "Enviromental and social collapse that make young generation unable to think with serenity about their future. No work. No Hope.We are Tired", "f6_no_assessments": 10, "f6_rating": 1.4666666666666668, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem statement of this proposal is out of scope for this challenge and the solution does not align with the NFT business model as it did not make any attempt to address NFT based business solution.\r\n\r\ni strongly disagree.", "q0r": 1, "q1": "The proposal provided verifiable link to given experience but lack any implementation plan and cost breakdown.\r\nI disagree", "q1r": 2, "q2": "The proposal did not provide sufficient information to audit the progress and success of proposal solution.\r\nI disagree", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Whilst the issue of social and environmental collapse is a pressing issue, the problem statement did little to articulate the cost of the problem, nor its desired outcome of your proposed solution. There is also a lack of supporting evidence, which could be in the form of published articles, analysis of statistics etc. The problem statement fails to adequately identify how it plans to address the challenge", "q0r": 2, "q1": "Little information is available about the team or the proposer and a recommendation would be to include appropriate details including information on recent projects etc.\r\nA detailed plan in required and I recommend setting key deliverable for defined stages in the project. Due to the lack of detailed plan and adequate budget breakdown, it is not possible to adequately assess feasibility.", "q1r": 2, "q2": "The proposal does not provide clear KPI and metrices and the lack of a clearly defined roadmap, will make the measuring of KPIs, which have not been provided, impossible. The proposer should also consider the risks and challenges associated with the project as these have not been addressed.", "q2r": 1, "assessor": "z_assessor_345", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement does not correlate clearly with the challenge. The solution does give a hint as to what the proposer want to do, which is creating a card game which I assume is based on the trading of NFTs. It does not clarify or give details about how this card game is supposed to build 'solution of trust'. It is also unclear if the proposer is asking for funds solely for crowdsourcing, or if it is for the development of the platform. I would like to have a problem statement that is connected in a more focused way to areas where Cardano is directly involved, rather than the entirety of the young generation. ", "q0r": 1, "q1": "In order to make this proposal more likely to be assessed properly, I would've liked to see a detailed budget plan with allocations to different parts of the development. Another suggestion would be that the development teams (and the proposers) expertise and experience could be verified through some credible websites or LinkedIn profile pages. There is a website provided, but it is made in Spanish only making it hard to comprehend for an English speaker like myself. Without a more detailed plan and explanation/exploration of what the proposer wants to achieve with the project (and how they mean to do it), it is very hard seeing this project being implemented successfully. ", "q1r": 1, "q2": "There is no roadmap provided in the proposal, and no mention of measurements of success. The closest I can find is that they want to make a fundraising campaign next year. This type of information is integral to a proposal. It is important for the community to be able to follow these stages of development, in a transparent way. What does the proposer want to achieve, and how are they planning to do it? During what timeframe? Long term/short term? What statistics or data can we measure during the process in order for us to know if we're on the right track? Is there any risks and challenges that we face that might jeopardize or change the development in any way? And how would we deal with it? These are questions that I would have liked to see answers for in this proposal, in order for it to be assessed fairly.", "q2r": 1, "assessor": "z_assessor_349", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The proposal does not demonstrate how NFTs is at the core of the business model, nor how the proposal will attract users to the Cardano ecosystem. I want the team to rework the problem statement, at the moment it only broad and unclear (Is the problem depressed youth?) and similarly the solution to the problem can be explained clearly. ", "q0r": 2, "q1": "The team provided a link to a website, but I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or a similar site to provide additional detail/evidence about the teamwork history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member, this allows the team to judge whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to expand on the plan to go to market and acquire users for the platform.", "q1r": 2, "q2": "The proposal has no roadmap and one line budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project based on a monthly timetable (75 users of prototype game by month 4, sign up 4000 users by month 9), and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The problem presented is very broad and abstract, I recommend establishing a focus and presenting a solution within the scope of the challenge.\r\nThere is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\nThe young generation is unable to think with serenity about their future, due to hopelessness and apathy. \r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\nThis does not show connection to NFT business models\r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nNo\r\n \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\n No\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\n No\r\n\r\nCan the proposal scale to address future challenges?\r\n \r\nNo", "q0r": 1, "q1": "\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nNo team members or links are given\r\n \r\nAre these links sufficient?\r\n No\r\n \r\nHave you the CA visited these links and contacted the relevant people?\r\nNothing to visit\r\n \r\n\r\n\r\nHave you been able to assess their level of competence?\r\n No\r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\n No\r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nNo\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nNo\r\n \r\n\r\nIS budget reasonable to achieve the set goals?\r\nNo way to determine\r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\n No\r\n\r\nHave you verified this plan?\r\n No\r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\n No\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nNo\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\n No\r\n \r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\n No\r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo ", "q1r": 1, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nNo\r\n\r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nNo\r\n \r\n\r\nIs there a clear understandable description of the targeted problem?\r\nNo\r\n \r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nNo\r\n\r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\n No\r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNo\r\n\r\nAre there contingency plans in place for various outcomes?\r\n No\r\n\r\nThere is nothing in this proposal to make a determination how this is linked to this challenge. Since there is no budget other than a single value given, no break down, also no metrics, I cannot recommend this proposal.\r\n", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 7, "ne": 2, "ng": 2, "nfo": 3, "vca_o": 1}, {"q0": "The problem statement resonates but there is no clear link between the problem statement and the use of NFTs. It would be great if the proposer could explain a little more about the game, the link between NFTs and how trust is built. ", "q0r": 2, "q1": "There is a website associated with the game proposed but it is unclear who is involved in the team and what skills they have to be able to complete a project. It would be great if the team was listed on the website on in the proposal. ", "q1r": 1, "q2": "It would be good to see a breakdown of the budget, a timeline and an estimate of the number of users that the games is expected to have. ", "q2r": 1, "assessor": "z_assessor_466", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "While NFTs are generally a good fit for card-base gaming, the proposal does not provide detail on how the game will use NFTs to meet the goal. ", "q0r": 2, "q1": "It would help if the background of the creative talent and developers were listed in the project. It isn't clear what the size or experience of the team is.", "q1r": 2, "q2": "A phased approach, such as an initial release with limited features and a goal of active users, or NFTs in play would make the proposal more measurable. ", "q2r": 2, "assessor": "z_assessor_502", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is quite generic and this includes the problem and solution. It does not really identify a frameable problem but more of a worldwide theme. Therefore, it is difficult to really know what specifically will be addressed and how it will be solved by this proposal. I like the think small concept reminds me of the iconic environmental text Small is beautiful by Ernst Shumacher but then we need an example of how this proposal will work on a small issue that has the the capacity to be replicated worldwide to make a difference. ", "q0r": 3, "q1": "The website link provided looks interesting and I could certainly see a good idea that can be further developed. There is no real way to measure the experience of the team or assess whom the team actually may be. These things are crucial elements of any proposal to verify authenticity of the team. The plan is to make a card game but few details to explain why this is a great idea. Perhaps this is a good proposal for future funds once a team has been established and the solution fleshed out a little further. I would recommend collaborations within the community and perhaps a more focussed problem and solution. ", "q1r": 2, "q2": "The Hup website looks promising but even there I could not find any real detail or information to give me greater confidence about the team or the direction it would use Catalyst funds. Like I said there is a hint of promising idea but no metrics/KPI's that can be audited and as such no way to value the impact such a proposal may have on the Cardano ecosystem. I do hope the team expand this idea and reapply in future funding rounds.  ", "q2r": 1, "assessor": "z_assessor_53", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Problem statement is general and confusing, I do not understand what is the problem to be solved. The proposer does not explain how NFTs can be a part of a solution, except mentioning a basic crowdsourcing service. Based on this information, I consider that this proposal does not properly address the challenge.", "q0r": 1, "q1": "The proposal does not describe the technical solution based on NFTs, nor does it list the relevant skills needed to complete the development. It is only mentioned that a prototype is currently being developed. I advise the proposer to resubmit this project in a coming Catalyst Fund with many more details on the technical solution, roadmaps, development team. \r\nBased on the provided information, I score the feasibility grade at 1.\r\n", "q1r": 1, "q2": "No information is provided on the project roadmap or milestones. No metrics are given to enable project monitoring by the challenge team and the community. The proposer might take a closer look to the challenge brief to elaborate its project description.", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}], "solution": "A card game that allow to trust the fundraising process and help sustainable reality: Crowdfunding + crowdsourcing = solution of trust", "experience": "Digital consultancy, fundraising, graphic, storytelling, pm development, video editing, artist management."}