{"id": 369901, "author": "", "title": "Certified Qualifications via NFTs", "url": "https://cardano.ideascale.com/a/dtd/369901-48088", "category": 26115, "amount": 10000, "description": "When recruiting, we accept people's history, experience & quals. We may crosscheck these, but the process is slow & open to corruption.", "f6_no_assessments": 3, "f6_rating": 2.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Creating a platform and using NFTs to represent qualifications addresses the challenge brief of creating business models with NFT's at the core. Minting and using NFTs to tokenize qualifications will increase the use and number of NFTs on Cardano, thus increasing utility and providing value to the ecosystem. ", "q0r": 4, "q1": "I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 2, "q2": "The proposal has a minimal roadmap and budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "Has the problem needing to be solved been identified and articulated?\r\n Yes When recruiting, we accept people's history, experience & quals. We may crosscheck these, but the process is slow & open to corruption.\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\n Yes since it uses NFTs for validation\r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nYes, in the area of recruiting and academia. \r\n \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\n Yes but its only given for the first stage. \r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\n Yes but its only given for the first stage. \r\n\r\nCan the proposal scale to address future challenges?\r\n Yes\r\n", "q0r": 3, "q1": "\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\n \r\nNone are given\r\n\r\nAre these links sufficient?\r\nNo \r\n \r\nHave you the CA visited these links and contacted the relevant people?\r\nNo \r\n\r\n\r\nHave you been able to assess their level of competence?\r\nNo \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nNo \r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nNo\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nNo. Outcomes to be expected have been broken down.\r\n \r\n\r\nIS budget reasonable to achieve the set goals?\r\nCannot say since there are no budget components\r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\n No\r\n\r\nHave you verified this plan?\r\nNo \r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nNo \r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nNo\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nNo \r\n \r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\n No\r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo ", "q1r": 2, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nYes there is\r\n\r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nOUtcomes are specified. No metrics\r\n \r\n\r\nIs there a clear understandable description of the targeted problem?\r\nYes\r\n \r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nYes\r\n\r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNo \r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNo plan\r\n\r\nAre there contingency plans in place for various outcomes?\r\nNo \r\n\r\nSince there is no budget, no profiles of team members, no links, and several other areas to be improved, I cannot recommend this proposal at this time.\r\n", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 8, "ne": 3, "ng": 2, "nfo": 3, "vca_o": 1}, {"q0": "Certification of qualifications is clearly a nascent use case of NFTs. This proposal is for an initial 3 months of research to build prototypes and develop a customer aquisition plan, but does not include a working product. ", "q0r": 4, "q1": "The proposers did not provide specific credentials or experience beyond 'decades of experience delivering innovation.' This initial phase of the project has modest goals, but i question the ability of the team to deliver future phases of the project or achieve widespread adoption.", "q1r": 3, "q2": "The phase 0 has a budget of 10K and its deliverables are proofs of concept and a user acquisition strategy. delivery of these should be easy to confirm or dis confirm. ", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Imagine a universal system-agnostic way to provide validated certifications, qualifications and work experience using NFTs.", "experience": "We are a team with decades of experience in delivering innovation to business through the use of digital solutions."}