{"id": 370178, "author": "", "title": "Verifiable Game Achievement NFT", "url": "https://cardano.ideascale.com/a/dtd/370178-48088", "category": 26115, "amount": 60000, "description": "Games have shown great potential for people to engage. But there is high friction for the creative to publish their game and make a living.", "f6_no_assessments": 3, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "Making an ecosystem for game developers which is governed by smart contracts that help game devs to raise money based on their will address the challenge", "q0r": 5, "q1": "The proposer has mentioned experience on blockchain and Plutus which will be helpful to build the platform and they have present steps to make the platform hence this proposal will be completed successfully ", "q1r": 5, "q2": "The proposal consists of a detailed timeline and fund requirement details this should be enough to track the success of the proposal. Therefore it should be enough to audit the progress of the proposal", "q2r": 5, "assessor": "z_assessor_317", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "The proposal highlighted a problem and offered a solution , however the solution will require more research and details of how it will be executed considering i am a game developer ( https://play.google.com/store/apps/details?id=com.sourcecard.whotfire) and understand the importance of this solution to the game developer community especially mobile game developers who will have to sacrifice a portion of their sales to companies like apple or google using in-app purchases.\r\nIt will be helpful if the platforms such games can be hosted and technologies since some of the medium to play those games will be on proprietary hardware like console(closely guarded) or mobile(Apple policies).\r\n\r\nI neither agree nor disagree.\r\n", "q0r": 3, "q1": "The proposal unfortunately did not provide verifiable links of given experience and there is no implementation plan with associated timelines provided.\r\nConsidering the above, i disagree.", "q1r": 2, "q2": "Sufficient information to audit progress and success of the proposal was not provided.\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "While the idea has merit, the proposal is not detailed enough to be considered a valid business model. ", "q0r": 3, "q1": "The proposer is a plutus pioneer with development experience, but i see obstacles to the success of this proposal. 1) 60k for an nft platform for puzzle games that dont exist yet seems excessive 2) the tokenomics seem simplistic and dont make economic sense 3) the success metrics seem unrealistic 4) more advanced platforms like playermint are already in the space. ", "q1r": 3, "q2": "The proposal would be easier to audit if the detailed plan was more specific about the proposed features of the platform. The current  seems to be presenting ideas that haven't been rigorously examined on a technical level.  There may be ambiguity as to weather the proposal was executed sucessfully or not. ", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "An ecosystem of devs and players governed by smart contracts.\n\nThe player can buy coins bound to the game when they achieve certain levels.", "experience": "Followed Plutus pioneer program\n\n6 years experience at Google building software\n\nParticipated blockchain development (part time) since 2018"}