{"id": 370142, "author": "", "title": "Tech Town Cardano", "url": "https://cardano.ideascale.com/a/dtd/370142-48088", "category": 26115, "amount": 50000, "description": "\"Show me Cardano!\"\n\nThere is no site for showcasing products and DApps developers can build on Cardano and offer them to potential investors", "f6_no_assessments": 3, "f6_rating": 2.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Attracting people to the Cardano ecosystem through virtual real estate is a good idea and will deliver value to the ecosystem, however, I would like the team to rework the problem statement and solution to demonstrate how NFTs will be at the core of the business model proposed.  ", "q0r": 3, "q1": "I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 2, "q2": "The proposal has a draft roadmap with no dates attached and single line budget. I would like to see the team develop Key Performance Indicators (KPI's)(sign up 10 developers by month 1) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "By proposing a kind of Metaverse for Caradano NFTs, the goal of this Challenge is hit. As can be seen from other ecosystems, there is great potential for virtual platforms connected to NFTs and the blockchain. ", "q0r": 4, "q1": "This question is a bit more difficult to answer because this is a very large project and the experience of the project participants or the development team is not described. Certainly, the implementation of the well thought-out ideas requires some development experience and time. Maybe the focus should be set on the completion of the white paper and the roadmap in a first step and the implementation should be requested in more detail in the next funding.", "q1r": 3, "q2": "The roadmap is available in draft form. From this, it is possible to derive which rough milestones are planned and what can be expected when these are reached.  Nevertheless, it is somewhat difficult to follow the entire project, since not all ideas have been definitively described yet. However, it is possible to track whether the composition of a development team and the completion of the white paper are successful.", "q2r": 3, "assessor": "z_assessor_557", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "I understand your proposal to be a fun and lively living 3d representation of a crypto business directory. Investors will pay money in order to secure virtual land which serves as advertising space in order to promote and sell their goods and/or services to other tech town participants, or casual browsers.\r\n\r\nI'm clear on what you pay for (i.e. a plot or virtual land), but not clear on the value that this gives the purchaser unless the whole of tech town becomes a central hub for Cardano project discovery, and the plot location is tied to something of value.\r\n\r\nThis is certainly possible, but I can't see the business model that generates value for the users. i.e. If the real estate becomes popular what makes the NFT valuable to another purchaser that drives the secondary market, or indeed generates value in that particular plot of land as opposed to the empty plot next door.\r\n\r\nIs  the assumption that certain areas would become a hive of activity and are therefore assumed to be \"hot zipcodes\"? This concept only works in real life as there are inherent travel constraints that do not exist in the virtual world.", "q0r": 3, "q1": "As the plan is presented, I cannot see what value a virtual plot of land provides that is feeds into a business model that grows.\r\n\r\nI can see why people might purchase a plot NFT, but even if this remains popular, the size of the town then becomes too large to serve it's original purpose (i.e. to find goods and services easily) when compared to a 2d webpage.\r\n\r\nI can see the fun in buying plots of land, but I cannot see a sustainable NFT business model.", "q1r": 2, "q2": "The size and active users of Tech Town can be measured on the blockchain which are directly related to it's popularity, which to me is a good indicator of progress being made, and it's success.", "q2r": 4, "assessor": "z_assessor_584", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}], "solution": "A virtual real estate platform that cultivates and showcases the robust talent and real life utility within the Cardano ecosystem.", "experience": "Crypto currency enthusiasts.\n\nEconomics, philosophy, art/music business background."}