{"id": 384987, "author": "cargofe2", "title": "Study and Pilot in Colombia", "url": "https://cardano.ideascale.com/a/dtd/384987-48088", "category": 26235, "amount": 5000, "description": "Колумбия в сфере криптовалют, разрабатывает пилот финансового органа, который повлияет на будущее Cardano в этой стране", "funded": 1, "upvotes": 40137061, "downvotes": 19022659, "votes_result": 21114402, "votes_cast": 276, "f6_no_assessments": 4, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Это предложение провести тщательный анализ результатов 1-летней регулятивной песочницы, принятой органом финансового надзора Колумбии в отношении внедрения криптовалют, интересно и вполне осуществимо. Однако, учитывая, что цели задачи направлены на создание среды законов, более благоприятных или менее вредных для криптовалютного пространства, с акцентом на PoS и особенности Cardano, я считаю, что будущая итерация этого предложения должна быть сосредоточена на лоббировании и сетевом аспекте задачи, Вместо того чтобы останавливаться на анализе экспериментов регуляторов, из которого спустя несколько месяцев после начала тестов можно понять, что самым значительным результатом является то, что финансовые учреждения и криптовалютные платформы могут поддерживать альянсы и работать без конфликтов, в отличие от того, что происходило в Колумбии в прошлом. Следует также отметить, что, согласно имеющейся информации на испанском языке, SFC одобрила только 4 криптовалюты для использования в паре с колумбийским песо в рамках этого пилотного проекта/регуляторной песочницы: биткоин, ethereum, litecoin и bitcoin cash, что означает, что ни Cardano, ни криптовалюта PoS не будут участвовать в пилоте, при одновременном отсутствии доказательств, полученных в ходе пилота, для регуляторных последствий, которые обязательно повлечет за собой спецификация PoS в отличие от PoW.", "q0r": 2, "q1": "Команда явно очень компетентна и имеет необходимый опыт работы в государственном секторе Колумбии, уже привлечена консалтинговая фирма для разработки описанного анализа, а бюджет четко указан и разбит на части. Тем не менее, похоже, что их основной фокус - это территориальный/земельный реестр, без какого-либо подтвержденного опыта в криптовалютном секторе или в сообществе Cardano до Fund7; я бы настоятельно рекомендовал включить эту информацию в будущую итерацию проекта. Хотя предложенный конечный документ, несомненно, является выполнимым для команды, нет четких KPI, учитывающих лоббирование или налаживание связей; я бы предложил в качестве потенциальных показателей количество интервью, которые необходимо провести, уточнение государственных органов, в которые необходимо обратиться (например, тех, которые войдут в состав оценочного комитета, таких как Президиум Республики, SFC, Superintendencia de Sociedades и Unidad de Información y Análisis Financiero, среди прочих), и т.д.", "q1r": 3, "q2": "Представленная информация показывает, что в конце установленного 3-месячного периода будет подготовлен краткий продукт, который продемонстрирует успех предложения. Однако, как указано выше, нет четких KPI, которые можно было бы измерить или проверить ход выполнения анализа и отчета. В этом случае я бы рекомендовал разбить анализ на результаты, которые можно использовать в качестве ежемесячного показателя достигнутого прогресса, будь то независимые главы (например, относительно предыдущего регулирования или позиции SFC по отношению к криптоэкономике, альянсов, участвующих в регулятивной песочнице, и послужного списка их членов по отношению к криптовалютам и т.д.) или, как указано выше, количество проведенных интервью с их записями/выводами, которые могут быть использованы в качестве результатов для аудита.", "q2r": 2, "assessor": "z_assessor_787", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposing team has filed 2 proposals that are complementary. By performing analytic research on what the Colombian government is intending to impose as legislation, the informational chart from the other proposal can be updated to conformity. By doing this, the chances of successfully influencing legislative decisions rises significanlty. Such an analytical documenbt could hold great value for future ventures in the cryptographic sphere on Colombian territory. ", "q0r": 5, "q1": "The proposal authors have relevant experience in the fields of law and government in Colombia and have provided evidence of this experience. By intending on making their research open-source, they are in a position of potentially helping a lot of projects. This increases feasibility significantly as cooperations will be desirable. ", "q1r": 5, "q2": "The proposal has a complete set of auditables. There is a clear roadmap with funding breakdown, definition of succes after 3/6/12 months, risk analysis and concrete prospected release date in place along with measurable KPIs. Very good work. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 25, "ne": 4, "ng": 18, "nfo": 3, "vca_o": 1}, {"q0": "This is a proposal on researching and piloting the application of electronic money in real life to see how it is received by citizens in Colombia. The proponent has legal experience in Colombia. The project is needed at the present time, raising public awareness about blockchain technology and cryptocurrencies in the countries.", "q0r": 4, "q1": "Researching the community response as well as building a legal framework, a technology foundation for bringing cryptocurrency to life is absolutely necessary, and completely feasible at this stage of blockchain's development.", "q1r": 4, "q2": "After the process is completed, the results of the research will be made public, and recommendations for next steps to raise awareness and practical application of cryptocurrencies will be made. This is a necessary stepping stone, supporting the serious implementation of cryptocurrencies into life.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "Great idea. However, the proposal does not give a clear indication of the campaign that would enable favorable regulation. I would be glad if the team create a framework to serve as a reference point for favorable legislation in Columbia.", "q0r": 4, "q1": "This team has experience lawyers and individuals in the public sector to achieve their goals. After reading the proposal, I am not getting a detailed plan and focus outcome for the project. I think the team should make their strategy clearer. What kind of specific benefit is the proposal aiming to measure.", "q1r": 3, "q2": "There should be detailed activities for which the budget would be used. Also, the proposal should show how activities would be documented. This would be helpful for tracking and auditing.", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Мы изучим проводимый эксперимент и получим необходимую информацию для определения возможных последствий.", "experience": "Пятнадцатилетний опыт работы в государственном секторе Колумбии в таких структурах, как Национальный департамент планирования."}