{"id": 381423, "author": "ranket", "title": "On line local Area shopping by ADA", "url": "https://cardano.ideascale.com/a/dtd/381423-48088", "category": 26238, "amount": 5000, "description": "非加密货币公民的使用案例是很重要的。  为了理解Cardano的价值，我们必须强调Cardano项目的好处。", "funded": 2, "upvotes": 110549650, "downvotes": 10201775, "votes_result": 100347875, "votes_cast": 326, "f6_no_assessments": 5, "f6_rating": 2.8, "videos": [], "media": [], "f6_assessments": [{"q0": "I think this proposal would fit better in a challenge with a broader usecase. The aspect of \"connecting or building a community\" is not very obvious in this challenge. It might result in japanese business owners learning about crypto payment options, tho, but the proposal does not include information about educating and connecting the retailers, that would like to offer their goods with the option of payment in ADA. ", "q0r": 3, "q1": "I think this proposal does not provide enough information to assess feasability. The team mention the obvious risks that are involved when paying with crypto, which is important when talking about small regional businesses accepting crypto payments. But they don´t provide any solution on how to educate or deal with those risks, which would be the most important usecase - educating people and business owners about payment options. There is no mention of the technical side to set this up, which would be important to mention and to let us - as a community - know, that the proposing team is very knowledgable in how they navigate the crypto payment field. The proposing team does not provide enough information on their skills, it would be important to understand their experience in community management, in retail payment options and in maybe tax and local crypto and finance laws. I´m not quite sure if some of the relevant information got lost in translation, tho. But with this proposal, there is general important information missing related to feasability. So, in a nutshell, I think it would be great to get small business owners of a region together and help them to figure out how to have crypto payment options and how to set this up, what the risks and the benefits are and to generelly educate and support them to accept ADA. But the proposal moreso wants to experiment with a payment options - and for this idea the provided information lacks clarification on how the team wants to actually do this process.\r\n", "q1r": 3, "q2": "While the requested budget is humble, the auditability could be very high, but the proposal does not contain enough information on how the community would be able to track the process of this project. It would be great to add a github or any other repository. The proposing team provided not enough relevant information to understand, how the ADA-rewards for customers will be planned and what the funding will be allocated to. I find it a good idea, tho, to evaluate the user experience by asking community members.", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 23, "ne": 10, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "It is unclear what the proposal is about. In the solution, we get a hint of discounts on online shopping by ADA but the proposer does not explain what he means by this. How can the proposer give discounts on online shopping? What we get out of the proposal is that the proposer plans on making local online shopping in selective regions of Japan by encouraging local distributors to accept ADA payments. I am missing the connection on how this will help attract the Japanese community to the Catalyst project.", "q0r": 2, "q1": "We know little about the proposer. He claims to already support project Catalyst and project Kittamu, but that's all we're told. By providing some background information about these claims this would already be a whole different scenario. How are they supporting Catalyst, what was/is their role in Kittamu? Regretfully, we do not get details on the team. We have not been given who the members are, what their function is in the proposal, and how they can contribute to the proposal. This makes it hard to envision what the proposers are skilled at. We are also not presented with a budget outlining to identify where the funding would be used for. I don't see how this proposal will help connect the Japanese community to Catalyst, townhall, IdeaScale,...", "q1r": 2, "q2": "Unfortunately, we are not provided with enough information concerning auditability. This means we don't have an obvious idea of how the proposer is suggesting to implement his idea. I can see the proposer is clearly motivated to help the Japanese community but what about the impact of this. The KPI's that are presented are not really KPI's but more a vague roadmap. How will the proposer convince local sellers to cooperate with this proposal? We don't see a reference in the proposal that the proposer is adequate for this.  ", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "I see how it can help local vendors expand their business if people could pay with ADA. I miss the link to how this proposal could increase the Catalyst community.", "q0r": 3, "q1": "How does the submitter help project Catalyst? He write that he already supported this in the past, but I can't find any further information about this. Who are the members of this team and what background do they have to make this project a success? The budget has not been worked out properly and so we do not have any insight into the use of the financial resources. Again, I miss the point on how the proposal can increase and connect the Japanese community with Catalyst.", "q1r": 2, "q2": "It is not yet clear how the proposer will implement his idea. He can certainly develop this further into a good plan. The roadmap is rather simple and therefore not really verifiable. He can also give more details here. Has he already thought about how he will motivate the local traders to participate, will they also benefit from this?", "q2r": 2, "assessor": "z_assessor_667", "no_vca": 18, "ne": 0, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "The problem statement and the solution talk about how the Japanese community need to understand crypto and use Cardano to benefit the community at large.\r\nThe proposer and team talk about how they will educate Japanese community to use ADA in trading. The proposal seeks to promote on line shopping through block chain and cut down on the challenges of transportation challenges in the Japanese community where travelling long distance to shop is a problem. The impact is clearly spelt out that as they promote the use of ADA in payment, more people would be interested in ADA and the higher the rate of ADA will be.", "q0r": 4, "q1": "The proposal team is linked with the Kittamu project which won Fund6 funding and they are a team of experts who can carry out the project successfully.\r\nThe plan is feasible because they mentioned that they will contact retailers at Yoshinogawa City, Prefecture and Japan and surrounding area who are related to the Kittamu project and target small scale retailers at the individual store level to get them involved. They mentioned that they will promote the Cardano community ADA holders to promote the use of ADA. The plan is quite laudable.", "q1r": 4, "q2": "The time span given and broken down from 3 months to 12 months with different schedules make it auditable. The budget is also reasonable for the purpose given. ", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 17, "ne": 2, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This proposal supports the development of the Cardano community in the larger Japanese context. ", "q0r": 5, "q1": "There are significant commercial obstacles to the success of this project, it is unclear based on this proposal if the team has either the requisite skill or understanding of what will be necessary for success.", "q1r": 2, "q2": "It is likely the intent of the Brief's parameters may not currently translate well into Japanese,  however without detailed operationally defined interim steps to achieving this goal:\" 6month Find cooperate distributors and start experiment selling.\" the information provided is not sufficient for the community to determine either progress or success.", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}], "solution": "催化剂公司支持的ADA网络购物的特别折扣将促进ADA持有人购物和活跃当地地区经济。", "experience": "会员已经支持了几个催化剂基金，包括地方政府项目Kittamu，这促进了当地公民的便利。"}