{"id": 367151, "author": "", "title": "Design & Sim of Voting Influence", "url": "https://cardano.ideascale.com/a/dtd/367151-48088", "category": 26104, "amount": 50000, "description": "Blockchain DAOs, including Catalyst, are governed by one coin - one vote policy which is susceptible to oligarchic control.", "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=28875"], "media": [], "f6_assessments": [{"q0": "This proposal addresses the optimization of our CATALYST Voting and funding system. Major part of this is research-based work as well as designing and simulating such improved voting systems. \r\n\r\nThis touches the very core of our journey towards VOLTAIRE and is therefore for sure a proposal of high impact. I would have liked to see a more detailed explanation, if and how the proposer team plans to work together with IOHK experts for avoiding overlapping efforts. ", "q0r": 4, "q1": "The team behind this proposal is undoubtfully highly qualified. There is  good background material added for outlining their field of expertiese and their impressive experience. \r\n\r\nIn order to make this substantial investment a success, I would have liked to see a better explanation of the aligned with the work done at IOHK/IOG. A lack iof alignment could jeopardize the likelihood of success, even though great expertise is at work here. ", "q1r": 4, "q2": "The proposer team has outlined, how they want to approach this rather big topic step-by-step. \r\n\r\nAs a CA I did not really find a comprehensive way of how to audit the progress of this proposal, other than kind of trusting that experts from the proposal team will get together with experts from IOHK/IOG (somehow) and implement this all together. Again, i would have liked to find more description about how this implementation is planned (otherwise this project might easily just add new research - which is good - but lack practical deployment).", "q2r": 4, "assessor": "z_assessor_101", "no_vca": 27, "ne": 14, "ng": 13, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seeks to perform heavy research into governance alternatives outside of the \"one coin-one vote\" paradigm.  This will help to understand alternatives for developing how governance could be managed.  This proposal is limited in the fact that it's research driven and would need an additional effort to take the research to drive a decision on making a change and then a subsequent change management plan.", "q0r": 4, "q1": "The team is fully qualified with academic researchers and PhDs to perform the analysis and simulation on the various alternatives to be investigated.  Understanding everyone on the team and equipment/hardware needs would be important to know any other dependencies for completing the work.  That bit of detail as well as what resources outside of the proposal team would need to be contracted would help make it clear.", "q1r": 4, "q2": "The proposal has outlined some major milestones and deliverables, but more detailed milestones would help to track and monitor the proposal at a more frequent interval to track the project more regularly.", "q2r": 4, "assessor": "z_assessor_13", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Addresses a key shortcoming of traditional voting mechanisms, with which it is virtually inevitable that the \"rich get richer and the poor get poorer\" because decisions are effectively made, consciously or otherwise, that benefit those in already dominant positions.  The timeline and schedule are consistent with the challenge to improve distributed decision making with the next two rounds.", "q0r": 5, "q1": "The proposing team has an excellent and complementary set of experiences and skills that are directly relevant to the proposed work, and a proven track record of working together.", "q1r": 5, "q2": "The stated milestones are somewhat vague, which will make it a little difficult to assess whether the proposal has been implemented successfully.  For example, I would prefer to see a little more specifics around the artifacts to be produced at each milestone, their purpose, and what successful completion will enable.  That said, I believe it will be possible to provide compelling evidence assuming the project proceeds as planned and hoped.", "q2r": 4, "assessor": "z_assessor_499", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Design and simulate voting algorithms that increase the diversity of voting influence and provides flexibility in the project funding level.", "experience": "The Photrek team is conducting analysis on voting protocols with a Fund 4 award. WADA is developing West Africa's blockchain expertise."}