{"id": 367771, "author": "", "title": "Consenz: A Virtual Parliament App", "url": "https://cardano.ideascale.com/a/dtd/367771-48088", "category": 26104, "amount": 25000, "description": "Discussions regarding the future of Cardano & Catalyst are spread around many platforms and are disconnected from the voting process.", "f6_no_assessments": 5, "f6_rating": 4.2666666666666675, "videos": ["https://www.youtube.com/watch?v=AOkwc67dddE", "https://www.youtube.com/watch?v=mMRxVLBUtHY&start=8202"], "media": [], "f6_assessments": [{"q0": "Leading innovation in large companies for many years, I agree with the issue adressed by this proposal: How to avoid NOISE without killing discussions and how to focus on getting to high-quality decisions. This could be intersting for many topics discussed within CATALYST and CATALYST CIRCLE. \r\n\r\nWhat I am a bit worried about here is that the proposal is mainly about developing a TOOL. I would have preferred to first focus on the shaping theory, process and people who are supposed to use this tool (together with similar proposals) Otherwise a tool might be developed, which at the end does not fit into the CATALYST way-of-working.", "q0r": 4, "q1": "Working through the proposal, I can definitely see that the proposer and his team have many years of experience with the topic of distribiuted decision making. Considering that it makes sense to just develop an APP (see my concerns raised above), the team is definitely likely to succeed. I would nevertheless strongly suggest to join forces with other similar proposals for avoiding to create a number of competing APPs. For the feasibility of such a CATALYST voting APP I also consider it as cruicial, that the proposer team is closely aligned with the CATALYST community. Some extra thoughts: Would this be presented in the dAPP challenge (APPs for public use), my concerns would for sure be less relevant. ", "q1r": 3, "q2": "The auditability in direction of successfully creating a dAPP is defintely there. My practical experience tells me that if this dAPP is created for helping the CATALYST community, we need to make sure that important steps regarding theory alignment, process integration and user-adoption are taken, before it makes sense to develop any dAPP. If this is not solidly secured together with the CATALYST Community, the proposed metrics for success measurement (% of Fund 8 and Fund 9 voters using the tool) might not be relevant. ", "q2r": 3, "assessor": "z_assessor_101", "no_vca": 28, "ne": 13, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "Very nice proposal, adressing the challenge of the campaign. A tool like this could have been used, for instance, to ellaboarate the CA guidelines document made available in F6 via telegram.\r\n\r\nAs suggestions, It would be nice to make the voting (and weight) system transparent to users and notification feedbacks to everyone regarding the final result on the modification suggestion. Also, more details could have been added here on the gamification and Delegation layers. What do they intend to do and how would they work?\r\n\r\nIt would also be interesting to know how the MVP and the final product will be developed and validated. Will there be pariticipation of the Cardano community to collect feedbacks on the features or it will be solely internal?\r\n\r\nIn addition, there could be a communication plan to better engage with the community and make people use as much as possible, specially influent stakeholders in the community, who propose documentations and guidelines.\r\n\r\nLast, it could be clearer the next steps, after the project is fully completed and funded. \r\nIs there any intention to monetize it and make it self-funded? If so, how? ads? freemium subscriptions? If theres fee for usage i would certainly create barries and likely lead to a low adoption", "q0r": 5, "q1": "The team seems nearly capable of developing the app with the resources they already have. My only concern here is in the last step where there's an integration with Cardano smart contracts as I couldnt find any experience in the team with that. \r\nHowever, if this is not yet a capability of the team it could be developed until this phase is reached or subcontracted (hence, only -1/2 start in the rate)\r\n\r\nThe plan is sensible but missing the final deliverable here, after \" Integration with Cardano smart contracts\" - it could be clearer whether 1st version of the final product will be ready after this or if extra steps, to be funded in future funds, will be necessary.\r\nRegarding the costs, the project looks quite expensive (for instance, 500 USD for a explanatory video seems a lot) but the costs breakdown are transparent. (-1/2 start in the rate)", "q1r": 4, "q2": "There are clear metrics with increasing targets and good milestones in project schedule.\r\n\r\nAs suggestions, I'd add a risk analysis exploring the risk of people not knowing how to use the app, poor communication about it (leading to low adoption), competition with other potential similar apps (how to differentiate?)", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "Kudos to the proposing team for configuring the Consenz demo to Catalyst specifics as this made it easier to understand the mechanism and end-goals of the project. It certainly matches the challenge setting and could potentially serve as a driver for Cardano's goals of instituting one of the largest DAOs in the industry. After having experienced the federated model of Telegram and even to an extent, Discord, it is easy to get lost or miss out on conversations. A member may be halfway around the world and may be unavailable at the time critical discussions are occurring and see outcomes already resolved or the topic had been superseded by another when they eventually log on. Its certainly my experience being in the CA channel in Telegram. The presentation on Consenz makes determination even more democratic and free from the binds of time and of displacement. And its voting aspect could open up greater participation from members who may not be so quick to voice their opinions or are not so overwhelming as other personalities. ", "q0r": 4, "q1": "The proposer's credentials perfectly match the challenge given previous experience in grassroots decision-making ventures particularly the government funded Open Committee. This lends credibility to this proposal and increases its chances for success. The team and participants also seem to have the right background to drive its quarterly road map to success. It is comforting to note that Its Q1 and Q2 goals have already been met which adds to the credibility of their claims. From a Catalyst point of view, its success metrics should it be funded, deployed and utilised by our Project, seem realistic. We have seen the organic growth in Catalyst participation in 2021 and the expectations from Fund 8 & 9 in terms of voter exposure and on-boarding are achievable. I would argue that given the number of wallets now voting and Catalyst's growing prominence, we may well surpass the numbers aimed at by this proposal. Overall, there is a good likelihood for success should this proposal get the nod from our voters.", "q1r": 4, "q2": "There's enough information presented to make this project auditable. Besides GitHub which is open to the public for scrutiny and the Consenz demo, the team has laid out a road map of developments with budgets aligned against outputs. Where I would ask for clarity is on the integration with the Cardano blockchain slated for Q2 2022. This development does not seem to be represented in the Cost Breakdown, which focuses on the front-end and UI. It has not been made clear if further funding will be sought to achieve any of the 2022 road map items. Nonetheless, the amount being requested, if primarily to be used to complete the 2021 build, is relatively small in comparison to other projects of the same scale. It should have been clearer in the document. Nonetheless, good luck to the team.", "q2r": 4, "assessor": "z_assessor_42", "no_vca": 8, "ne": 8, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "as far as I understood, the current discussions are divided into multiple platforms or channels, and the purpose of this solution is to create a dedicated place for the discussion of proposals. \r\n\r\nI find it as a good proposal because it can help to bring more people together, and therefore provide a wider range of information spread. \r\n\r\nNevertheless, I find there a risk where voters might not be so willing to transfer, and the solution might be left behind.\r\n\r\nBut from the idea and plan perspective, a very good proposal, the git repository is detailed, and the idea is effectively addressing the challenge. \r\n\r\nAlso, I find there is an overlap with the catalyst circle. \r\n\r\n\"The Circle exists to fulfill four key goals:\r\n\r\nTo facilitate communication between the different functional groups\"", "q0r": 4, "q1": "their product is already running, detailed description of team is provided. I am strongly convinced that they can deliver the product. \r\n\r\nBut it would be nice to have linked-in profiles, to increase the verification and validate the data provided, on a higher level.", "q1r": 5, "q2": "detailed key metrics are provided, which can result in good audibility of the proposal. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The proposal has a very promising idea that relating governance and decision making process which can be made very inclusive and effectively community driven. I am convinced that this proposal can revolutionised the decision making process and making it a more decentralised approach.", "q0r": 4, "q1": "I think that the proposal has well detailed roster of team's relevant experiences and capabilities in addition to other collaborations. Also showcasing use cas scenario is a big advantage. However the proposal should have mentioned the likely risk factors that might affect the success of the project and plans to mitigate them nonetheless, am convinced that the team can effectively deliver this project.", "q1r": 5, "q2": "The proposal has effectively explained how the success of this project will look like. However the success metrics could be more elaborate by including the no. of approved decision or problem challenges solved using this process by the community.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "A decision-making tool that provides a way to create community-driven solutions by integrating continuous voting with discussion features.", "experience": "10 years of research & experiment in decentralized decision making. 6 years as a projects manager. 3 years of building consenz prototype."}