{"id": 369099, "author": "", "title": "Catalyst QA Automation scripts", "url": "https://cardano.ideascale.com/a/dtd/369099-48088", "category": 26104, "amount": 3650, "description": "The Catalyst QA stage changes every Fund according to the will of the community. Time and energy is needed to keep it up-to-date.", "f6_no_assessments": 4, "f6_rating": 4.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Knowing about the importance of not only developing, but also 'Application Lifecycle Managing' and maintaining any kind of software tools, I think this is of high practical importance. Since this is proposed as one of more modules of the community-driven AIM approach, adoption and user acceptance is highly secured. ", "q0r": 5, "q1": "Behind this proposal is a member of the AIM team, which is the team driving the voter-tool, CA-tool, vCA-Tool and the Community Landing Page. Due to the fact that most parts of this development was already completed and the funding is mainly about improvements and maintenance, there is a very high feasibilioty that the goals can be reached", "q1r": 5, "q2": "A bit unconventional is the approach of this proposal, asking for retrospective funding of tool-developments (done during fund 4 & 5). Since this ask comes from a well-integrated core-contributor, closely linked with the CATALYST team, I support this move - also because the asked amount is rather small and very reasonable. In the future a suggest to avoid asking for retrospective funding.", "q2r": 4, "assessor": "z_assessor_101", "no_vca": 21, "ne": 8, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The problem description and solution make sense and are within the scope of the challenge.\r\n\r\nThe work that has been developed by AIM, and in this particular case the scripts, has been essential for the decision-making process in Catalyst. The proposer has carried out the work voluntarily in the last Funds and the results shown are very positive, the metrics and KPIs described as reference indicate an extremely positive impact.\r\n\r\nScripts have been important to maintain the standard of quality in decision making for CAs, vCAs and proposers.", "q0r": 5, "q1": "The proposer demonstrates experience and full capacity to develop the proposal as he has carried out this work in the last funds and has shown positive results for the community. There are details about the proposer's qualifications and sources (respository).\r\n\r\nA reasonable plan was presented. There is a very detailed and reasonable budget breakdown. The budget will be allocated to cover current project costs (already under development/developed) and for updates during the year.\r\n\r\nThere is an elaborate rationale explaining the details of the process.\r\n\r\nThe information presented indicates complete feasibility conditions and the fact that the scripts have already been working in the last Funds is a good indicator.", "q1r": 5, "q2": "There is clarity in the problem, solution and alignment of both with this challenge is evident.\r\n\r\nRelevant metrics and KPIs were defined.\r\n\r\nI believe that the excerpt \"New features that will come in Fund 5\" must have a typo, as we are getting to Fund6.\r\n\r\nScripts will be updated to Fund6 based on changes in the rewards model, as well as a new master file optimized for proposers and any other updates that may occur.", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "very well prepared proposal, providing all the details required for the CA assessment. It definitely address the challenge, but red and yellow card system was reworked/removed, if I am not mistaken? this needs to be addressed, but given the description of the team, I believe they are up to date, so the possible alternative will be suggested. The question remains, whether this should be marked with low score of proposal efficiency, because it might be outdated, or with high, given the assumption, that we can rely on the team.  ", "q0r": 5, "q1": "the team is already providing their service via catalyst fund, and relevant experience is stated. Also, there is a git link which increases the creditability of the proposer.", "q1r": 5, "q2": "if the implementation will be successful, we ca verify if via use.  Also the progress can be tracked via the shared git link.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "Clearly addresses the challenge, as it's about maintaining scripts without which the current CA/vCA system couldn't function. The scripts are clearly enabling people to take part in decision making, and improving the quality of the decisions made. Win. Also, an admirably accessible explanation of the work.", "q0r": 5, "q1": "Seems pretty indisputable, since the majority of the funds requested are for work that has already been done and successfully used. Budget and timescales seem fair too.", "q1r": 5, "q2": "It's good that the proposal team have included quite a few useful KPIs to enable us to see how useful the past work has been. The list of new features  that were implemented in fund 5 is useful to help audit progress. It would have been interesting to see a similar list of new features that will be implemented for this fund (fund 6) so we have a sense of  what's changing - but possibly that's not been finally decided yet? But overall, very clearly auditable.", "q2r": 5, "assessor": "z_assessor_540", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Maintain scripts that automate the QA process and allow the filtering of CAs' ratings and assessments that do not comply with the guidelines", "experience": "AIM members are the team behind the voter-tool, CA-tool, vCA-Tool and the Community Landing Page. Developers, designers and data experts."}