{"id": 369775, "author": "", "title": "Testing MyVoice MVP in Catalyst", "url": "https://cardano.ideascale.com/a/dtd/369775-48088", "category": 26104, "amount": 10000, "description": "Catalyst needs a place to test \"reputation profiles\" before implementation", "f6_no_assessments": 3, "f6_rating": 1.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal raises some issues that do need to be solved, however it does not show how it would provide these solutions.", "q0r": 1, "q1": "No plan has been provided on what is being delivered thus it is unlikely a successful implementation will result. Please clearly outline what this proposal would deliver and when.", "q1r": 1, "q2": "There are no clear deliverables or timelines thus is is not possible to audit the success or progress of this proposal.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "If I have understood correctly, the aim is to increase the work done by CAs by creating reputation profiles. TBH I do not really feel a large improvement here. Right now, my assessment will be evaluated by each proposer, and then by vCAs. \r\n\r\nExample:\r\n\r\n1. I have no reputation profile - if I assess incorrectly, both the proposer and vCA will remove/filter my assessment\r\n2. I have a reputation profile - my assessment still needs to be verified by vCA and proposer\r\n\r\nand the risk I see is - by having a positive reputation profile, people can be biased - Oh, look, he is a good one, it must be true! - contrarily, having a negative reputation profile - Oh, look, he is giving bad assessments, so I need to be more skeptical about his assessment!\r\n\r\nI apologize if I understood incorrectly. \r\n\r\n", "q0r": 2, "q1": "I did not find any information about the proposer, except this part:\r\n\r\nSpent last year studying and building Civic Technology to develop engagement and encourage citizens to act for the public good.\r\n\r\nwhich is vague. ", "q1r": 1, "q2": "I believe that progress. such as it is, can be recorded, some KPIs were provided, although, it would be very problematic to evaluate, how much having a reputation profile \"increases\" or \"decreases\" the decision making.\r\n\r\nProgress can be audited for sure.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is not clear in its targeted solution to the various problems and challenges found in distributed decision making.\r\n\r\nAs a project manager, I understand that having clarity of a problem is key to having clarity of goal. This proposal brings up many diverse challenges without, a) actually defining them well, or b) indicating how MyVoice or PPBL training indicated in the budget breakdown will specifically help to solve them. \r\n\r\nGiven the lack of clarity around the KPIs it is unlikely that this project will have a true impact on the issues with Distributed decision making in its current form. ", "q0r": 1, "q1": "While the writer may have a generally relevant idea, I do not see this a feasible proposal for addressing the challenges faced in Distributed decision making in its current form. \r\n\r\nIs this possibly a money grab?\r\n\r\nAs a project manager and developer, I have a few issues I would point out to voters:\r\n\r\nNo team or individual is identified. There is no proof of proposer's ability to execute - LinkedIn, GitHub, and GitLab are not linked at all in the proposal and when searching the Git repositories nothing comes up for MyVoice. Following the link to MyVoice (itsmyvoice.org) there is no information on the developer team or project details either. \r\n\r\nThere is a reference to Gimbalabs as a tandem development path but no sign of collaboration could be found on the Gimbalabs GitLabs, GitHub or even Discord server. \r\n\r\nThere are many statements about the issues faced by the Catalyst community for decentralized decision making, but no clear indication for how the proposal will actually solve them. \r\n\r\nWhen looking at the KPIs there is no clarity around what timeframe will be implemented.\r\n\r\nWhen looking at the budget there is a reference to PPBL with no explanation of what that is (Personalized Project-Based Learning is the only thing I can imagine fitting there). This topic is not mentioned anywhere else in the proposal. \r\n\r\nFor these reasons I can only give one star to this proposal in its current form. \r\n", "q1r": 1, "q2": "Given the lack of clarity around the problems, there is a lack of clarity resulting around the solutions to them. \r\n\r\nThis puts the proposal at a distinct disadvantage in its ability to set KPIs or timeframes. \r\n\r\nAs a project manager I have found that a project that lacks clarity, will lack accountability. \r\n\r\nI am ranking this segment of the assessment as a one due to this lack of transparent definitions of success.\r\n", "q2r": 1, "assessor": "z_assessor_613", "no_vca": 9, "ne": 5, "ng": 3, "nfo": 1, "vca_o": 2}], "solution": "Test Case: MyVoice can be used to test for elements of what a profile should include. Creating digital identity while maintaining anonymity", "experience": "Spent last year studying and building Civic Technology to develop engagement and encourage citizens to act for the public good."}