{"id": 370141, "author": "", "title": "Cardano Catalyst TV", "url": "https://cardano.ideascale.com/a/dtd/370141-48088", "category": 26104, "amount": 4000, "description": "Voters do not have time to read all the proposals worth voting for and proposers do not have much credibility and reputable to reach voters.", "f6_no_assessments": 8, "f6_rating": 3.958333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal adresses a well-known issue: The Community Advisors and especially also the voters don't  have the time to read through hundreds of proposals. Catalyst TV aims to provide very short video-clips (90 sec interviews) and a place to browse through current proposals. Having access to such video-clips is definitely highly impactfull. \r\n\r\nMy concern is here that the outlined format (with personal interviews) might be a limiting factor. Maybe the version now chosen for CARDANO SUMMIT is more feasible ? I would also suggest that the CATALYST Community makes sure that such video clips are produced in a globally useable way.", "q0r": 4, "q1": "I honestly tried to find out more about the background of the proposer, Mie Tran, but the attached links brought me nowhere. It would have been very helpful to attach a sample of such a 90 seconds interview video, just to show that there are the skills for doing this important job for the global CATALYST Community. Knowing that Mie Tran is part of the Eastern Townhall team is helpful, but also on that video I could not identify her (maybe my fault). \r\n\r\nBased on the material available in the proposal, I can unfortunately not really judge the likelihood of success of this proposal. A pity, since the very idea is certainly important and touching a real need.", "q1r": 3, "q2": "There is a list of activities for each video and for the associated costs per video. For the asked 4,000 USD, 50 videos are planned. \r\n\r\nWhat I could not find is how the proposer plans to handle the peak-load when soon close to 1.000 proposals are posted. It would have been helpful to get an idea, how this can grow with the CATALYST progress over time.\r\n\r\nHow would the team grow ?\r\nHow does CTALYST TV want to develop along the road ?", "q2r": 3, "assessor": "z_assessor_101", "no_vca": 22, "ne": 13, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "This proposal addresses the challenge. It really becomes more important that non speaking english countries become more aware of what is happening in the biggest decentralized blockchain dao in the world. If we want to reach every corner of our world there should help and incentives to have quality translations of what is happening in cardano ideascale. Maybe I'm wrong but I cant find in this proposal if this includes embeded youtube captions but I think it would also be very nice to see translations in the town hall videos in Asia-Pacific languages when the videos are released in youtube. It also be a good thing to arrange some kind collaboration with adapulse to deliver news and content in Asia-Pacific languages, that would be great", "q0r": 4, "q1": "Since the proposal creator is someone that already belongs to the community it will be very likely that he will deliver and work towards this goal of deliver good content and translations to the Asia-Pacific area. The teaching background is also a plus", "q1r": 4, "q2": "one of the channel doesnt have viewers or content and the other only has under 30 subscribers at the time of this assessment. It would be great to gather more viewers and make this channels more visible in social media like twitter, telegram and others.", "q2r": 3, "assessor": "z_assessor_427", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Sure I strongly agree that this proposal properly addresses the challenge. Hence I strongly agree. Since the problem requiring rectified because of the subsequent incentives.                          \r\n*The problem lucking to be answer have been pinpoint \r\n\r\n*The proposal tips in the breadth of the challenge brief.\r\n\r\n*The proposal clearly exhibits how it will add value to the Cardano ecosystem.\r\n\r\n*Main act suggests have been indicated clearly \r\n\r\n*The proposal scales to address future challenge\r\n", "q0r": 5, "q1": "I agree the proposer provided evidence references links, of relevant skills and experience needed to implement the proposal, links are sufficient but not active contacted to relevant people , budget have been outlined clearly and broken down into identifiable items that is for how many interviews approximately, awesome very much needed and reasonably price to achieve the set goals, given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 4, "q2": "I need agree nor disagree for the information provided is insufficient to audit the progress and the success of the proposal.\r\nThe proposal doesn't have roadmap with milestones and a time horizon for achievement. But clearly have a well proper planned risk management solution.", "q2r": 3, "assessor": "z_assessor_528", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "this proposal can do so much! People nowadays rather listen than read, therefore the information which can be spread via interviews can have a large impact. \r\n\r\nAn overlap with \r\n\r\nhttps://cardano.ideascale.com/a/dtd/Stake-Pool-Operators-Video-Series/369284-48088\r\n\r\nwhere I would suggest to join forces, create some sort of Cardano community channel, where \r\n1. joint forces = higher efficiency, and a larger likelihood of the success\r\n2. shaping the content based on the views, rather than focusing strictly on one type of \"news\"\r\n\r\nI believe that the intersection of SPO and proposers' videos can have a larger impact. ", "q0r": 5, "q1": "not much was stated, but just that the proposer is a moderator and interpreter of Vietnam ET. It can definitely be implemented based on the plan, but the experience is questionable. But by time, it can be improved. But I keep slight reservation.", "q1r": 4, "q2": "detailed information for auditing was provided. + relevant KPIs", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "The problem that's been identified is an important one – voters really don't have time to read all the proposals – but I doubt that using 3-minute TV interviews is the best way to address this.\r\nIt's widely understood that for most humans in most languages, reading is roughly twice as fast as listening, provided you're reading in a language you are competent in. (Literate English-speakers can certainly easily read a proposal sufficiently to get an overview of it, in about 90 seconds; so having to watch a 3 minute video would be actually *slower*, and would make the problem of \"not enough time\" worse.) Making videos can address all sorts of exclusions, actually – language barriers, low literacy, visual impairment, dyslexia – but not really lack of time, so it's a pity the proposer has focused on that. Maybe if they recast the proposal a bit, and talked about using videos to address *different* barriers?  Cos the *actual* barrier here seems to be that many people in Catalyst are having to read proposals in a language (English) that they're not skilled in. OK, this proposal does address this language barrier in a way, by suggesting translating these videos into several languages – but  if the problem really is lack of time, then surely a more effective approach would be to spend the effort on translating the *written* proposals, so that speakers of Vietnamese, Japanese and Korean can assess written proposals with the same ease and speed that English-speakers can. \r\n\r\nThe other problem with videos in addressing this challenge is that videos bring in all sorts of unwanted variables when trying to assess a proposal. Does the interviewer understand all the issues in the proposal, and are they asking appropriate questions? Is the proposer confident, skilled at being interviewed, and do they have a media-friendly personality? If not, their proposal might still be great – but people might be put off from even looking at it, purely because they lack media skills. In short, it feels like this proposal doesn't actually increase distributed decision making – it just replaces one set of exclusions and barriers  with another. Perhaps this could be addressed if the proposal included a little bit of training for proposers, to help them present well – but that would be a whole different proposal.\r\n\r\nAlso, the proposal suggests creating 50 of these interviews. In this current funding round, there are 800-ish proposals – how will the team select who gets an interview? I'd like to see some info about how they will choose, to assess if this really addresses the challenge. If this proposal is arguing  (and it does seem to be doing so) that these interviews will make a massive difference in helping a project to reach people, and in eventually determining what gets funded, then it *really* matters who gets that opportunity, and what the selection mechanism is, and that should be detailed in the proposal if it is going to address the challenge effectively. If on the other hand it doesn't really matter who gets an interview and who doesn't, because it doesn't really help proposers  or voters much, then why do interviews at all?\r\n", "q0r": 3, "q1": "I'd like to see more information about the teams who will produce the interviews. The proposal mentions that there will be a separate team for each challenge – first, that's a *lot* of people, so is there sufficient capacity? And second, I'd like to know more about them, particularly the interviewers – I'd like to get a sense of whether they will be knowledgeable about the particular field that each challenge covers., and also able to communicate that knowledge to the audience. Interviewing is a *huge* skill ! and I'd like to know if the team has that skill, because if they don't, the proposal won't be implemented successfully and won't achieve its aims. \r\n\r\nAlso I'd like it to be clearer whether these interviews will be recorded live in a 'no-edit' way, or whether there will be any editing and production involved. These things are time-consuming, so it makes a big difference to how implement-able the proposal is.\r\n\r\nOverall, I don't think there's quite enough information to assess whether the proposal could be successfully implemented – but I've decided to score it 4 rather than 3, because I think it would be OK for the proposer to try it out, have a go, and learn from the experience. I think it's an important barrier that this proposal is trying to address – and really, we only learn whether these ideas work by trying them in practice. \r\n", "q1r": 4, "q2": "I think auditability here is pretty good. Clearly the community will be able to audit whether the videos have been made, and how far people are engaging with them, sharing them, etc. which all gives a good sense of whether the videos are a success.\r\n\r\nThe \"success \" of qualittaive proposals like this, which \"make XYZ easier\", are never easy to audit precisely, but I think their use of qualitiative data on social media will give a pretty solid idea of whether the project has succeeded.\r\n\r\n\r\n\r\n", "q2r": 4, "assessor": "z_assessor_540", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The idea of supporting decision making with the help of the audiovisual channel is very good and addresses the described challenge. The proposals are thus made easier to understand and the proposer's motivation becomes more tangible. Since we are in a development environment, where not every proposer has the same good communication skills, care must be taken to prevent good ideas or projects from being rejected due to somewhat poor communication skills or a certain fear of the camera. But I think this can be well managed by an experienced interviewer. ", "q0r": 4, "q1": "I am convinced that this proposal can be successfully implemented due to the existing experience in moderation and the passion for Cardano. ", "q1r": 5, "q2": "The progress of this proposal can be easily followed via the Youtube channel. KPIs have also been defined, which make the successful implementation measurable.", "q2r": 5, "assessor": "z_assessor_557", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This is a great idea. Most people are not really familiar with reading long texts, especially texts that contains technical terms. Sometimes,  you can start reading and by the time you get to the bottom of it, you've already lost hold of the information you grabbed from the beginning especially when it contains too many technical terms and vocabularies. This problem isn't only with voters but with everyone who makes use of the Project Catalyst. \r\nIt would be great to have 90 seconds video which literally provides enough accurate information about a particular proposal as Community Advisors and Voters can have more time to themselves for making researches before touching these proposals either in the assessment stage or voting stage.\r\nThis solution is perfectly in line with the problem statement and I can feel the impact it would have on the community. Great idea.", "q0r": 3, "q1": "A workable plan has been laid out in the proposal.\r\nA reasonable budget has been provided and well clarified.\r\nA verifiable link to some works the proposal has been involved in is provided, I've personally verified and the link works. \r\nA verifiable team has not been provided which is why I'm giving it this score. As it stands now, it occurs to me that the proposer only intends to hire workers for sessions and not to build a team. Somehow, it's a good idea because  team members could fail and work can't progress but with the hiring procedure, you just need to have your money ready and workers are available for hiring. But, the cons here is that there may be quality variations in end products and must be taken into consideration. \r\nAlso, the hiring procedure comes with a risk of budget overflow but it's not addressed. \r\nHowever,  if there's an existing team, I think it would've been fair to provide the Community with their details and evidence of work if available just to raise the level of trust.", "q1r": 4, "q2": "The information provided is enough to enable auditing the progress and the success of the proposal.\r\nA YouTube channel has already been created and the link to it has been provided in the proposal. I've clicked the link and it works which means that the Project Catalyst can use it to track record of this project.\r\nProvided KPIs are also well outlined to help the auditing stage of the proposal.", "q2r": 5, "assessor": "z_assessor_565", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "I strongly agree that the proposal effectively addresses the challenge because  of the following rationales:\r\n1. The problem needing to be solved has been identified and articulated.\r\n2. The proposal falls within the scope of the challenge brief.\r\n3. The proposal shows clearly how it will add value to the Cardano Ecosystem.\r\n4. Key Performance Indicators have been stated clearly.\r\n5. The proposal scales to address future challenges.", "q0r": 5, "q1": "I neither agree nor disagree that given experience and plan presented, it is highly likely this proposal will be successfully implemented due to the the following rationales:\r\n1. The proposer knows in an identifiable manner, the number and type of team members needed to ensure successful implementation of the proposal.\r\n2. Budget has been outlined clearly into identifiable items.\r\n3. Budget is reasonable.\r\n\r\nBut:\r\n1. The links provided by the proposer as evidence to relevant skills and experience needed to implement the proposal is not sufficient.\r\n2. I visited the links provided but couldn't contact the relevant people needed for the successful implementation of the proposal.", "q1r": 3, "q2": "I neither agree nor disagree that the information provided is sufficient to audit the progress and the success of the proposal because of the the following rationales:\r\n1. There's a clear understandable description of the targeted problem.\r\n2. There's a clear understandable solution to the targeted problem.\r\n3. There are clearly defined KPIs that define the success of the proposal.\r\n\r\nBut:\r\n1. There's no clear roadmap with milestones and time horizons for achievement.\r\n2. The proposer has not identified possible hurdles, challenges or difficulties and how she intends to handle them.", "q2r": 3, "assessor": "z_assessor_69", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "A 3-minute conversation with Cardano Catalyst TV is the fastest means to approach viewers to give general insights and increase reputation.", "experience": "I am a moderator and interpreter of Vietnam Townhall of Eastern TownHall. I am passionate about Cardano and what it can bring."}