{"id": 384366, "author": "swong", "title": "Unlock Equity in poor communities", "url": "https://cardano.ideascale.com/a/dtd/384366-48088", "category": 26257, "amount": 500000, "description": "Como Cardano pode ajudar a desbloquear a equidade oculta em comunidades pobres e trazer mais pessoas para a economia digital?", "funded": 0, "upvotes": 26040904, "downvotes": 24146983, "votes_result": 1893921, "votes_cast": 208, "f6_no_assessments": 3, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe proposer raises a valid problem of that a noticeable proportion of the population does not have access to banking services, which is a great case for blockchain adoption. Despite that, this proposal does not clearly support any of the strategic goals of Fund 8: grow the number of contributors, turn cardano into open source project, grow the dev and app ecosystem. \r\n\r\nIn addition, the proposal would be stronger if it:\r\n1) provided an overview of the most needed banking use cases for implementation and the readiness of the regulatory environment.\r\n2) provided a justification why it is a higher-ROI task for the community to develop banking use cases outside of the broader challenge of growing apps and integrations.\r\n\r\nI have made the following deductions:\r\n- 2 points for not directly supporting any of the Fund8 strategic objectives.\r\n- 1 point for not explaining why constraining the impact to a subset of use cases will have a higher ROI for the community.\r\nMy rating is 2.\r\n\r\n\r\n", "q0r": 2, "q1": "The Catalyst community has definitely people experience with developing innovative blockchain applications.\r\n\r\nAt the same time, solving the problem of access to banking services is not only a technological but also a regulatory problem: the banking industry is often strictly regulated. So, small teams of developers are not well positioned for success.\r\n\r\nThis proposal would be much stronger, if it provided an analysis of regulatory jurisdictions, which are favourable to rapid adoption of blockchain services. Without such analysis, it's not clear if any noticeable impact can achieved in the short term..\r\n\r\nIn addition, the budget of $500k seems inadequeate given the massive size of the problem. To increase the feasiblity of the ideas, it can be worth to reformulate it as a challenge to regulatory justisdictions and create compliance checklists to help development teams in future to make better decisions.\r\n\r\nOut of my experience as someone who worked on GovTech projects in Germany, solving compliance and regulatory acceptance problems takes years, so it's not something that can be overlooked.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of overview of regulatory blockers.\r\n- 1 point for the lack of explanation why the requsted funding can lead to a noticeable progress with the set problem.\r\n- 1 point for the proposer/challenge team out of just one person, limiting the advice and support for participants in this challeging area.\r\nMy rating is 2.", "q1r": 2, "q2": "The proposed metrics than can capture some progress towards its solution (the number of users affected, the number of partnering cases).\r\n\r\nAt the same time, those metrics do not provide a clear understranding of the progress and impact, such as:\r\n1) the % of people without access to banking system who use the Cardano-based solution.\r\n2) The satisfaction of users with the solutions in comparison with alternatives.\r\n3) The number of regulatory environments (countries) that have officially welcomed/recognized the proposed solutions.\r\n4) The share of transactions in Cardano coming from banking use cases.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of full tracking of the impact on cardano ecosystem.\r\n- 1 point for the lack of metrics to evaluate the user satisfaction and the competitiveness of the created solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 22, "ne": 5, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The challenge focuses on bringing poor people to Cardano ecosystem however it could improve on how poor people can contribute to the Cardano ecosystem to fully align with the Cardano mission. In an attention economy, even poor people can meaningfully contribute which is indirectly alluded to in the \"learn-to-earn\" question. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "Unlocking hidden equity in poor communities is a difficult but important challenge that will require cutting edge DeFi solutions. To make the challenge excellent: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "Key metrics are acceptable but could be improved such as measuring the number of actual people onboarded instead of \"potential people impacted\" and transaction volumes in poor communities. To make the challenge excellent: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 18, "ne": 1, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "The purpose of this challenge -bringing more equity, specifically coming from poor communities- cannot bring a large impact on Cardano's mission. As stated by the challenge brief, DeFi does not lack dollars.", "q0r": 2, "q1": "The definition of the challenge is very wide \"unlock equity\". Guiding question are broad. Proposals made to answer this challenge may lack focus. For these reasons, I think that voters will not be engaged by this challenge.", "q1r": 2, "q2": "The key metrics described by the challenge team are very generic \"number of potential people impacted\", and will be difficult to actually estimate.", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 20, "ne": 2, "ng": 12, "nfo": 6, "vca_o": 1}], "importance": "Enquanto estamos pulando para Defi, GameFi e NFTs, grande parte do mundo ainda está fechada fora do sistema bancário.", "success": "Casos de uso significativo e viável no desbloqueio da equidade para o mundo em desenvolvimento."}