{"id": 382577, "author": "gabrielaxel", "title": "Global Change Mgmt Operating System", "url": "https://cardano.ideascale.com/a/dtd/382577-48088", "category": 26249, "amount": 280000, "description": "Os sistemas de governança existentes não apóiam ações construtivas coordenadas em larga escala que tragam recursos e soluções para os problemas mundiais.", "funded": 0, "upvotes": 16673936, "downvotes": 24146770, "votes_result": 7472834, "votes_cast": 108, "f6_no_assessments": 5, "f6_rating": 2.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "The Campaign Brief describes the direction this proposal should go \"Dapp proposals should cover foundational Registry solutions\" and gives some domains that can benefit from the usefulness of the DApps.\r\n\r\nThe solution is described in a generally speaking matter, and it's difficult for an outsider in which domain the deliverable will fit well. (\"(...) to support collaborative international development, solutions implementation, & resource delivery.\" - area of the development should be identified, it reads like \"something good for all\" and it has no viable meaning).\r\n\r\nThe proposal, as it looks, doesn't fit into the challenge objectives.", "q0r": 1, "q1": "The proposal lacks in providing relevant information about the team members, their experience and about what is to be done and how. It looks more like a concept that as a working product. The proposer should identify all the necessary resources for the implementation of the project.\r\n\r\nThe requested budget represents almost 50% of the entire campaign budget and is not broken down into identifiable items and most import, there are no actions described in support for the provisioned spending. The proposer should present a sensible and conductible plan for implementation and a timetable to complete the work.\r\n\r\nThe proposer is not aware of any challenges and risks relevant to a successful implementation.", "q1r": 2, "q2": "There are no KPIs/metrics defined to define the success of the project (how many potential users will be onboard in the first stages of the development? ho do you measure the users' interest? etc.)\r\nThe proposal, as it is presented, doesn't look like a feasible project and is highly unlikely to succeed.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 20, "ne": 4, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "This proposal seeks to solve the problem of large-scale global coordination by a global change management operating system which partially aligns with the challenge goals but is not a foundational registry solution listed in the challenge. \r\nThe proposal does a good job of articulating how the solution scales to address future challenges.\r\nThe proposal could be improved by articulating the value to Cardano ecosystem, providing key metrics and goals that more closely align with the challenge and either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of evidence of experience (linkedin profile). \r\nThe proposal's feasibility could be improved by team composition, breaking down the budget, showing the budget is reasonable by providing details, realistic timetable and plan, resources required, detailed technical explanation of the solution and a challenges and risks section.  The proposal is incomplete and lacking details as indicated by the \"* MORE DETAIL COMING SOON. *\" comment in the proposal.", "q1r": 3, "q2": "The proposal includes a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem (website).\r\nTo improve the proposal include a roadmap, milestones, time horizon, metrics/KPIs to measure proposal success.\r\n", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 19, "ne": 0, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "This proposal did address a problem within the challenge. As it appears, the proposer wants to create a fair world, but the execution part of it is lacking. The proposer should add some missing information such as key metrics and goals of this proposal, as well as the description of the value for the ecosystem.\r\n", "q0r": 2, "q1": "I don't have a positive note on the feasibility of this proposal because there is not enough information to track its progress. The proposer should add information such as linkedin profile, the number of team members needed, the budget breakdown and a timetable to complete the work. These details can improve the proposal and give it more chances of being funded in next rounds.", "q1r": 2, "q2": "Based on the amount of information missing, this proposal is not easy to audit. The proposer should add a roadmap with milestones that will help track its progress. I also suggest to the proposer to add metrics and KPIs that define success. Furthermore a clear understandable description of the problem and the solution will improve the quality of this proposal.", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is too vague to effectively address the challenge. It is unclear what the deliverable would be and how it would be valuable within the context of the Brief.", "q0r": 2, "q1": "This is a large concept without clear indications that the team will grow beyond the author. In this assessor's opinion, this project is too large and intricate for one person.", "q1r": 2, "q2": "Information provided is not sufficient to audit the progress or success of the proposal because it contains no definition of success or progress.", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 20, "ne": 0, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "Interesting idea. SME idea to me is something that is missing out in the world's development. This would increase participation, coordination, and cooperation for developments projects that can fit into each other.", "q0r": 5, "q1": "More information is needed on the feasibility of the proposal. Metrics for success and KPIs. Also, consider building partnerships within the community for making this idea actualize.  ", "q1r": 3, "q2": "A breakdown of the budget would be helpful. Also, the proposal should show how it intend to document activities as well.", "q2r": 2, "assessor": "z_assessor_727", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "Um sistema de coleta de informações projetado para apoiar o desenvolvimento internacional colaborativo, a implementação de soluções e a entrega de recursos.", "experience": "PhD em cognição humana e ética da cadeia de bloqueio/AI, trabalhou com a SingularityNET, criou novas abordagens de governança, associou-se à WSS (em anexo)."}