{"id": 384301, "author": "njsteele", "title": "Corruption discovery + remediation", "url": "https://cardano.ideascale.com/a/dtd/384301-48088", "category": 26249, "amount": 62046, "description": "A corrupção é a força mais destrutiva no governo. Ela pode quebrar governos novos e em desenvolvimento, apesar de todos os outros esforços.", "funded": 1, "upvotes": 59968851, "downvotes": 4928753, "votes_result": 55040098, "votes_cast": 152, "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"q0": "A proposta apresentada é direcionada para erradicar um dos maiores problemas que impedem a prosperidade de qualquer país, que é a corrupção. A solução proposta para o desenvolvimento de uma plataforma descentralizada para a bandeira anônima da corrupção é única. Além disso, a equipe se propõe a envolver muitas entidades locais e voluntários através de campanhas e eventos que certamente tornarão o Cardano popular entre a multidão e também aumentarão a resistência do ecossistema. Entretanto, o manifesto não faz nenhuma menção aos dados demográficos que pretende atingir ou como a equipe se propõe a mitigar a corrupção em caso de bandeiras bem sucedidas por parte dos usuários. Como o plano inclui o fato de tornar a aplicação independente das autoridades governamentais, a credibilidade da aplicação aumenta entre a população. Assim, eu classificaria o impacto 4 em 5 como alguns detalhes mais finos de quão eficaz a aplicação pode ser e como a equipe planeja alavancar a cadeia Cardano está faltando.", "q0r": 4, "q1": "A equipe já realizou um trabalho considerável na direção da solução proposta e também fornece à comunidade sua repartição orçamentária detalhada e também sua definição de sucesso. Entretanto, a proposta carece de informações em outras seções. A proposta não fornece o sabor da equipe que trabalharia sobre isso e a experiência que eles trariam consigo. Apesar de mencionar que a aplicação será desenvolvida, a proposta não inclui detalhes técnicos sobre o mesmo. Os marcos, embora pareçam de natureza prática, o proponente não mencionou os desafios que se encontram em seu caminho e como eles planejam mitigá-los.\r\nAlém da definição de sucesso trimestral, não há outro plano de jogo detalhado passo a passo disponível para os leitores. Com todos estes fatos, acredito que uma quantidade moderada de detalhes é necessária para ganhar a confiança da comunidade para financiar seu empreendimento.", "q1r": 3, "q2": "Acredito que não há informações suficientes disponíveis para que os auditores possam fazer derivações conclusivas a respeito do sucesso da proposta. O proponente inicialmente planeja desenvolver a aplicação sem alavancar a cadeia Cardano e tem planos de mudar-se para o ecossistema somente após 6 meses. Os detalhes e métricas do público-alvo ausentes tornam a proposta ainda mais incompleta por natureza. O proponente, embora tenha grande experiência na idéia que ele propõe, os detalhes da equipe que falta tornam a proposta menos confiável. Nenhum KPI distinto está disponível para os auditores rastrearem quantos usuários se registram no Dapp e volumes de transações e quão efetivamente o pedido é recebido e utilizado, o que é um dos principais critérios da campanha. Embora seja bastante compreensível que a idéia ainda esteja em seus estágios preliminares, um pouco mais de especificações sobre a aplicação proposta e os números para acompanhar seu uso e sucesso ajudará a auditoria facilmente e também ajudará a comunidade a acompanhar sua eficácia.", "q2r": 3, "assessor": "z_assessor_751", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of discovering corruption in organizations and governments by an application facilitating anonymous crowd-source organized campaigns which partially aligns with the challenge goal but is not a foundational registry solution listed in the challenge.\r\nThe proposal does a good job of articulating the value to Cardano and articulating how the solution scales to address future challenges.\r\nThe proposal could be improved by providing key metrics and goals that more closely align with the challenge and either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of experience (linkedin profile in the comments section), team composition, budget is broken down and reasonable, additional funding plan, realistic timetable and plan, resources required, \r\nThe proposal's feasibility could be improved by a more detailed technical explanation of the solution and including a challenges and risks section. The $9K budget to have grant writers submit a grant request seems like it might be a potentially questionable use of Cardano funds for some community voters.", "q1r": 4, "q2": "The proposal includes a roadmap, milestones, time horizon,, clear understandable description of the targeted problem, and a clear understandable solution that addresses the problem.\r\nTo improve the proposal include metrics/KPIs to measure proposal success.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "The proposal does not effectively address the challenge, while coordinating anti-corruption activities are laudable and important, they are not the stated goal and intent of the Brief: \"Dapp proposals should cover foundational Registry solutions, namely:\r\n\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"", "q0r": 2, "q1": "The proposer is competent and has a good handle on the material. The proposer is affiliated with a top US university. Go Owls!", "q1r": 4, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, auditable, and time fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 16, "ne": 0, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "Great idea and detailed proposal. I did love to see that the proposal commences from a specific region. I think this is great and addresses the challenge. This would generate more community engagement and the name and shame component would tackle corruption.", "q0r": 5, "q1": "Excellent to experience. I like the commitment of the team lead. This Dapp is practical and the NGOs set up to secure funding would help the longevity of the idea. ", "q1r": 5, "q2": "Detailed but breakdown. The proposal has shown commitment to transparency and openness. The Dapp and its campaigns are people-driven. This is great.", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "735 / 5000\r\nResultados de traducción\r\nThis proposal impacts the center of the challenge, working on the most complex problem that exists in the construction of nations. The thing that destroys them: Corruption. One of the clearest reasons to explain the problem of poverty. In this way it raises a problem that clearly must be solved. It is also clearly observed how this proposal would add value to the Cardano ecosystem, since it is an instrument in all aspects of the proposal. Work, smart contracts, identity secrecy, protection among other relevant aspects. I have the feeling that you could have given us more information. Perhaps more work needs to be done on the challenge metrics to ensure its total adequacy. ", "q0r": 4, "q1": "The proposal is interesting and important, however the most difficult thing is its implementation. I am Latin American and I know first-hand the problems of corruption. In this regard, I consider that the proponent did not provide sufficient evidence of his abilities to implement the proposal, apart from being a very relevant academic project at a prestigious university. Iguylamente is not clear the team that will develop the proposal, because there are some external payments that are not clear in its development. Although there are identifiable elements in the budget, this aspect could be improved. The budget is reasonable to complete the work, however it would be good to have the best-developed profiles that allow them to be supported. The timetable is a bit optimistic, however it is achievable if properly incorporated into the university's programs. By the way, it is not clear what role university students will play. I think the proponent could have shown more about the project and maybe reserved. The technical processes must be explained more thoroughly, especially because of their cost.", "q1r": 3, "q2": "This is a roadmap for achievement, but for a technical process it is necessary to strengthen it. The metrics could have been strengthened to more clearly define the success of the proposal. On the other hand, if there is a clear and understandable description of the objective problem and it is adequately addressed, perhaps we expect more information given the academic origin of the proposal.", "q2r": 3, "assessor": "z_assessor_778", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Permitir a sinalização anônima, a eleição, organização e direção de campanhas para erradicar a corrupção através de tarefas organizadas por multidões.", "experience": "Diretor de tecnologia na Temple U's Ctr. para pesquisa em saúde pública e direito, trabalhando com a ONU e outras universidades sobre política e corrupção."}