{"id": 385029, "author": "mmahut", "title": "Open Data Public Notary", "url": "https://cardano.ideascale.com/a/dtd/385029-48088", "category": 26249, "amount": 20800, "description": "Governos de todo o mundo produzem muitos dados, mas é problemático garantir sua integridade a tempo.", "funded": 2, "upvotes": 128811209, "downvotes": 1447659, "votes_result": 127363550, "votes_cast": 386, "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is a solution that falls within the scope of the challenge.\r\n\r\nThe proposal adds value to the Cardano ecosystem, in the form of more users of Cardano ecosystem, however it is not clearly articulated in the proposal\r\n\r\nThe goals of the project are clearly defined and align with the challenge. There is a single performance metric provided. \r\n\r\nHow scalability will be achieved is not addressed in the proposal.\r\n\r\nTo improve the proposal: better articulate how the proposal adds value to the Cardano ecosystem, provide more metrics, include a scalability section.", "q0r": 4, "q1": "The proposer provides evidence of relevant skills and experience needed to implement the proposal.\r\nThe proposer does identify the type and number of team members required to implement the proposal.\r\nThe budget is clearly broken down into identifiable items. \r\nThe budget is reasonable to achieve the set goals.\r\nThe proposal has a timetable to complete the work.\r\nThe proposal does not explain technical aspects of the implementation.\r\nThe proposal does not include challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: explain technical aspects of proposal, include a challenges and risks section, information could be formatted better to make information easier to read.", "q1r": 4, "q2": "The proposal does include a roadmap with milestones and a time horizon for achievement. \r\nThe proposal does provide a single metric/KPI that defines the success of the proposal. \r\nThe proposal provides a clear understandable description of the targeted problem.\r\nThe proposal provides a clear understandable solution that addresses the problem.\r\nTo improve the proposal: provide more metrics/KPIs that measure progress, format the roadmap with milestones and a time horizon better so it is easier to read ", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This is effectively a signature and timestamping service usable for any electronic document. This is more a tool than an application-specific Dapp, but it could be a key part of a national digital infrastructure or a DAO infrastructure. Therefore, I strongly agree that it fits the challenge brief.", "q0r": 5, "q1": "The team is extremely highly experienced including through delivery of Blockfrost.io. There appears to be little or doubt that the team has the ability to deliver this application. The budget for doing so is reasonable and the plan is clear.", "q1r": 5, "q2": "I agree with the proposal that the main KPI is the number of stamped documents. It's a somewhat bold call to go with only one KPI, but it seems to be the right one in this case.", "q2r": 5, "assessor": "z_assessor_495", "no_vca": 20, "ne": 1, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "Building a public notary tool on the Cardano Blockchain that enables citizens to upload their documents and have unique signatures is a service that could lead to widespread adoption of Cardano in other governmental institutions. And the fact that the team has taken care to implement it gradually, at the Supreme Court of the Czech Republic, thus developing  a potential future implementation in the rest of the European Union.", "q0r": 5, "q1": "The team has provided all the necessary information to verify their previous works, as well as the status updates for their previous funded proposal, thus building trust that the community can trust their expertise again. The plan is well described, even someone with very little technical background can be able to understand what they’re trying to achieve. I have no doubt they will be able to successfully implement this proposal as well.", "q1r": 5, "q2": "The budget is very well detailed, the deliverables are comprehensible and easy to follow, the KPIs are succint, but sufficient. What would have been important to mention, though, is what risks could the team encounter during this process, especially since it’s very much dependent on a governmental institution. ", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 22, "ne": 4, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "Denotarious.io é uma solução de armazenamento de carimbos de prova de existência, que podem ser utilizados pelos cidadãos e seu governo, em Cardano.", "experience": "Somos uma equipe de desenvolvedores OG Cardano e jornalistas de dados, por favor, leia nossa proposta para mais informações, incluindo um FAQ da comunidade."}