{"id": 383283, "author": "shirogat", "title": "Skill up Vulnerable Youth", "url": "https://cardano.ideascale.com/a/dtd/383283-48088", "category": 26244, "amount": 30000, "description": "由于缺乏必要的技能，肯尼亚的青年，特别是受教育程度较低的青年，就业前景不佳。", "funded": 0, "upvotes": 14739958, "downvotes": 21150859, "votes_result": 6410901, "votes_cast": 99, "f6_no_assessments": 5, "f6_rating": 2.2, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal addresses a key socioeconomic issue confronting Kenyan youth, specifically the section of the population that is less educated and has few opportunities to enter the labor market. It is proposed to address this problem by offering a program to educate 300 young people aged 18 to 29. It is stated that the project will be carried out with the assistance of three partner organizations. I must admit that, while this suggestion aims a noble goal, I am unable to identify a direct link between it and what is required in this challenge. Although there is no section outlining the metrics of success, it is known that the important milestone and metric here is that the 300 young people successfully complete the training program; nevertheless, there is no indication of the community-building activities that will be done.\r\n", "q0r": 2, "q1": "A brief description of the proponent's skills and experience is presented, but no references are provided for verification. In this case, both the content and experience of those who will deliver the training program's courses are relevant, and it is proposed that they will count with three organizations as partners, iHub, @iLabAfrica, and vls; however, no reference to the contact persons representing these organizations is provided. The budget is divided into three distinct items; however, in order to conduct a thorough examination, much more information is required. I've included a list of questions that I recommend you answer for future Catalyst cycles. How many training hours are planned? What are the teachers' hourly rates? How much does the rental site cost each day? Are there any refreshments necessary? How many people will be participating in the program's support? What would their role be?\r\n", "q1r": 2, "q2": "It is not possible to complete a comprehensive evaluation of this area due to the lack of data. So, here are some suggestions for the proponent to consider for future Catalyst cycles. (1) A roadmap that identifies key milestones and schedule information is essential. (2) Success measures are extremely important in this situation, such as \"XX young graduates.\"\r\n", "q2r": 1, "assessor": "z_assessor_130", "no_vca": 20, "ne": 7, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The issue being Youth in Kenya not having enough education and required skills which reduces chances of getting hired. The proposer wants to provide programming skills to 300 youth in available digital hubs. This proposal does addresses the issue but it will be a short solution not long term.", "q0r": 4, "q1": "Based on the information given the proposer has enough experience to implement the proposal and they have given a rough plan and have mentioned requirement 10000 Trainers, 10000 Venues Hubs and 10000 Operations logistics but it not clear why these many resources will be needed to train 300 youth so, a detailed explanation could have provided a clarity on requirement of such a huge resources and training only 300 youth will be a short term solution considering all these things it's highly unlikely this proposal will be implemented successfully", "q1r": 2, "q2": "The proposer has provided key performance metric it would have helped a lot to audit if they have given a complete roadmaps with timeline, detailed fund breakdown and definition of success of required months without these it's not enough to track the progress and the success of the proposal", "q2r": 2, "assessor": "z_assessor_419", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This proposal has great potential as it identifies successfully the problem within the challenge. Nevertheless, the proposer didn't provide enough information and details about the execution of the product. Creating hubs in Africa to teach programming skills to youngsters is great and can add massive value to the cardano ecosystem. I suggest  the proposer find a way to include the introduction of the cardano network to the potential students. I would also suggest to the proposer to add key metrics and goals that align with the challenge. I think that the idea is great and all the proposer has to do is better structuring the proposal and adding the information required to increase its chance of being funded.", "q0r": 2, "q1": "Even though the idea is good, this proposal lacks the details necessary to be feasible. I suggest to the proposer to add the evidence of the skills and experience necessary to carry out this project. This can be a linkedin profile or other resources. I would also add the informations about the team and all the resources needed to complete the project. The proposer should also add a roadmap, a timetable and clearly explain the project in detail as well as a broken down budget. To sum it up, I suggest to the proposer to add challenges and risks that they may face upon a successful implementation of the project. At its current state, this project is not feasible because a lot of information is missing.", "q1r": 2, "q2": "This project is missing the information needed to be successfully auditable. I think that the proposer should add details such as a roadmap, milestones and metrics and KPIs. Adding this information and a clear description of the solution will likely make this proposal more auditable in the future. ", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This is a proposal towards training about 300 young people in a poor country in terms of programming programs and programming languages on the cardano platform. Being the necessary activity at this stage helps the cardano platform to have more applications coming.", "q0r": 4, "q1": "The idea is good, but the content is too sketchy, not showing the enthusiasm and responsibility of the working group. The working group needs to talk in more detail about how to design the course effectively, how to recruit students, how to communicate with young people and how to guide their careers in the long term.", "q1r": 3, "q2": "Projects can check learning outcomes and progress through videos of classes, built-in curriculum, and personal opinions of learners after taking the course.", "q2r": 3, "assessor": "z_assessor_648", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "This proposal addresses the challenge, since it wants to create a hub of underprivileged young Kenya people and offer programming skills so that they can find jobs. However, the target community remains general to assess its impact to Cardano. I suggest at least the proposer should add a demographic analysis, instead of Kenya in general.", "q0r": 2, "q1": "I can't find any reference about the proposer's profile, skills and experience. Training 300 students is huge and needs a team. This proposal doesn't have a timeline as well. Budget needs to be broken down. \r\nI strongly disagree that this proposal can be implemented successfully.", "q1r": 1, "q2": "This proposal lacks of roadmap, milestones, key metrics to success. It doesn't provide me enough information to audit.", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}], "solution": "在现有的数字中心向300名18至29岁的青年提供编程技能。", "experience": "超过20年的培训和教育工作，接触培训师和ICT专业人士"}