{"id": 383475, "author": "twomin", "title": "2MinReview by Voice for Busy Voters", "url": "https://cardano.ideascale.com/a/dtd/383475-48088", "category": 26244, "amount": 12000, "description": "对于忙碌的选民来说，要抓住越来越多的提案信息，影响Cardano社区的发展，是一个挑战。", "funded": 1, "upvotes": 30215831, "downvotes": 22262799, "votes_result": 7953032, "votes_cast": 132, "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "这个提议很有意思，它的想法是用英语制作短视频/播客，总结每个资助基金的25%的提案。作者认为需要这样一个项目的理由是，有很多很多的提案，人们一般没有时间去关注所有的内容，有这样的内容总结会促进对催化剂的参与，因为人们会有一个更实际的方式去了解它们。，至少是一部分，在这里所做的事情。我同意这个想法，我认为这确实是非常有益的，而且可能符合挑战赛的一些目标，比如为Cardano社区带来新的参与者，新的开发者等，形成新的中心，但我不认为它考虑到了非英语使用者民主化的目标。我认为他们会使更多讲英语的普通观众民主化地访问Cardano，从区块链初学者到更有经验的人，因为这样的内容会被访问。因此，我相信挑战中所要求的部分影响。如果这个想法被带到其他语言上，那将是非常不可思议的，也就是说，用葡萄牙语、西班牙语、意大利语、日语、越南语来创建简短的视听内容，总结/解释来自资助基金的一些提案。这样一来，是的，我相信这将对我们在这里的目标一针见血。", "q0r": 3, "q1": "参与项目的团队传达了很多安全感；他们用项目的很大一部分来解释他们是谁，个人，他们的名字，职能，到目前为止他们所做的一点事情，还提供了他们个人网页的链接，在那里我们可以更亲密地了解他们。我认为成员的介绍很完美，对我来说，这是解释谁参与的最好方式。剧本也是以一种模范的方式起草的，我们知道要完成的任务是什么，以形成一个整体（非常详细，他们包括各种数字数据，便于理解步骤），也知道目标是什么，同样用数字来说明他们打算实现什么，没有误差。在此基础上，该团队关注的是，作为一个结论，项目的预期影响和可行性是什么。关于预算，他们附上一个表格，详细说明将做什么，做什么数量，以及做多少，再次留下一个完善的理解，并以完整和准确的方式提供信息。", "q1r": 5, "q2": "正如同一位作者所解释的那样，该项目非常容易监测，因为他们有非常具体的目标，预算通过所附表格非常详细，内容可以通过youtube监测，而且工作已经在下一个基金中开始。因此，我相信现在的工作是由社区来做这个可审计性。我们可以选出一些成员来监督项目的进展，并通过我们的各种沟通渠道（市政厅、迪斯科等）向社区提供反馈。我相信在这部分提案中没有太多可批评/打分的地方，一切都很完美。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "I believe this proposal is well suited to the objectives of the challenge. The proposal presents a very real problem that a lot of people are interested in Cardano but do not have the time to learn, making it difficult to grasp the increasing number of proposals, affecting the development of Cardano. Cardano community\r\nThe solution was to produce short-term videos and podcasts in English containing analyzed information for the proposed 25% in each Catalyst Fund. A clear and understandable solution was provided as per the proposal to clearly describe the problem targeted.", "q0r": 5, "q1": "We can easily check the group information based on the links the recommendation has provided. The proposed team consists of 3 members with experience in the Blockchain field and also accompanies Catalyst projects from Fund 4. At the same time, Duc Tiger is also the founder of Tiger View team, one of the core groups of the company. . Vietnam in the Cardano ecosystem. Besides, the team has also been funded in Fund 6, so I have full confidence that they can complete this proposal.\r\nWithout a doubt, the team of proponents has the right skill set, is highly motivated and is strongly committed to the Cardano ecosystem. With the experience of the CA and VCA teams, they easily realize the difficulty when voters have to absorb too many petitions while not having much time to evaluate them all. Take this suggestion as a matter of course. It saves voters a lot of time filtering out unworkable proposals. I believe that with the experience and planning presented here, it is very likely that this proposal will be successfully implemented\r\nInterestingly, the proposal's authors explain the idea by presenting the obstacles they will face next.", "q1r": 5, "q2": "Due to the properties of this proposal, no timeline is broken down. As stated, the proposed team will start work from the start of the Fund 8 and Fund 9 proposal. It takes about 2 months for them to complete 250 videos in Fund 8 and 2 months to complete 250 videos in Fund 9. .\r\nThe proposal is feasible because it has very specific goals, has key indicators, KPIs and timelines, and is easy to track and evaluate. The given budget of $12,000 is reasonable enough and it makes me completely agree that the team is competent enough to tackle the challenge.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 16, "ne": 4, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "I think this proposal makes a lot of sense, but not in this exact shape. Even as a CA, I find it impossible to stay up-to-date with most of the proposals in Project Catalyst. Having 2 minute videos, if properly done, would be of great benefit to the Cardano voters and community. Yet, at this iteration, I feel like the proposal could be very detrimental to the Catalyst experiment, due to the fact that it will make a selection of 250 proposals to be reviewed. That in itself is an influence on the voters and could become problematic for the entire eco-system. The only way to solve this would be to have either all proposals reviewed, or none. ", "q0r": 2, "q1": "The team’s experience confirms their aptitude towards delivering such a great task, the video for their proposal has also demonstrated the quality that we are to expect from each video. Yet what I didn’t find in their plan, is how will all those videos and articles be reviewed before publishing? Will there be a core team who will be reviewing them, will they review each other, and if so, how will they be able to verify and incentivise the quality of the videos?", "q1r": 3, "q2": "The proposal is well divided and contains all the needed information for its proper evaluation. The budget is well detailed, the KPIs are well explained, the roadmap is sound and comprehensive,  as such I can safely say that the proposal has clearly verifiable goals.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 22, "ne": 3, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "In my opinion, the proposal is not well aligned with the challenge setting of onboarding new people and community hubs to the global Cardano ecosystem, particularly in the non-English speaking world. \n\nThat does not mean that I think this proposal will not have an impact. I think it is a good proposal, for many people the information written in Catalyst proposals is difficult to digest. Especially when voting, when a large amount of proposals should be evaluated. Having summaries in video form would be helpful. \n\nI believe this should be done with all proposals though, and not only 25% of them, as this will introduce a selection bias from the video creators. Therefore, I would prefer if they requested a larger budget so they could do this with 100% of Catalyst proposals before the voting period starts. ", "q0r": 2, "q1": "The video example provided shows that they can create a simple and easy to understand video explaining a proposal in 2 minutes. \n\nThe budget requested per video created seems low to me, which could affect the quality of the videos. For example, 2 dollars for editing per video, I don't know how feasible that is in the long term without affecting the quality.\n\nIt is good that the proposers are experienced in Catalyst, and reviewing proposals. The proposers seem committed and capable of following through on their promise to the community.", "q1r": 4, "q2": "The proposers have stated quite clearly what they will do with the funds, and how many video reviews they will create per funding round. This part of the project should be easy to assess for the community.\n\nThey have included some KPIs for watch time per video, I wish they also included some KPIs for how many viewers they hope to attract. And also elaborated further how they will make the videos accessible to more people, and let people know about them. There is little point in creating these videos if they have very few viewers.\n\nI believe it will also be difficult for the community to assess the quality of the videos, and whether they actually solve the problem of explaining proposals in a way that is easier to understand than the original proposal text.", "q2r": 3, "assessor": "z_assessor_73", "no_vca": 23, "ne": 5, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "This proposition could increase knowledge about our ecosystem alongside the perspective of wider adoption and participation, as it would make the process more inclusive. For example, people suffering from blindness would be able to be part of the community and be more involved in the decision-making process. The only flaw is that you can't do it for the majority of the good quality proposals, only a few, because there are just too many of them. This is why I can't give the perfect score !", "q0r": 4, "q1": "The team is known among the Catalyst community, they've already been funded once, during fund 6, one of them is running a stake pool [TIGER Pool] and being a community advisor for Catalyst. All of their social media channels and a Linkdn profile are set for more transparency, inspiring me confidence in the team.\n\nThe team have already made available a youtube video, as an example of their work, down the comment section: (https://www.youtube.com/watch?v=5Yagm40Wny8). The video is easy to understand and well made, but the robotic voice could be annoying for many people, including me. I kindly suggest recording them with real voices.\n\nThe budget is well detailed inside the google doc, alongside the plan. Everything looks reasonable.\n\n", "q1r": 5, "q2": "The roadmap is ok, pretty well explained, and spread over the duration of fund 8 and 9. Key metrics and KPIs are easy to track: Average view duration; New Subscribers...\nThey acknowledged some risks to the challenge, although there are not many of those.\n\nThe milestones could have been more detailed, accompanied by dates, but I'm not sure that it is essential for this kind of proposal, anyway.", "q2r": 5, "assessor": "z_assessor_146", "no_vca": 24, "ne": 3, "ng": 20, "nfo": 1, "vca_o": 1}], "solution": "制作2分钟的英文短视频和播客，包含每个催化剂基金中25%的提案的分析信息。", "experience": "2Min Review团队由CA、vCA、社区建设者、研究人员和视频制作者组成。"}