{"id": 383417, "author": "carlhenryglobal", "title": "Cardano Worldwide Community Hubs", "url": "https://cardano.ideascale.com/a/dtd/383417-48088", "category": 26244, "amount": 9636, "description": "世界上有许多人一直在询问关于Cardano & Catalyst的详细信息，而不是英语。", "funded": 2, "upvotes": 67721768, "downvotes": 3358357, "votes_result": 64363411, "votes_cast": 154, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=14046"], "media": [], "f6_assessments": [{"q0": "与在挑战赛下提交的许多其他想法相比，该提案具有全球视野。全球讲英语的人口只有大约20%。挖掘其他80%的人口，当然有很大的潜力，这将是一个巨大的任务。在上述提案中，这个问题的陈述得到了一个漂亮的解决方案，即为非英语国家的人提供了一个多语言平台，让他们了解Cardano和区块链的情况。同样的 \"Beta \"版本的存在为社区提供了更多的信心。这个建议可能会导致更多的人对Cardano链做出贡献，反过来推动其在全球的发展。非英语成员对网络的注入需要立即关注，而这个提议似乎在相当程度上可以做到这一点。这个平台可以将企业和开发者聚集在一起，在全球范围内滋生大量的新合作和关系。", "q0r": 5, "q1": "该提案有一个详细的行动计划，而且已经提供的 \"Beta \"版本可以为该团队提供所需的社区信任。3个月和6个月结束时的里程碑和成功定义似乎并没有高估，而且可以看出这个团队有必要的技能，以推动这个提案走向一个富有成效的目的地。要求的资金似乎也是公正的，并没有消耗总资金的很大一部分，这为更多的提案提供了资金。提到在F8期间需要更多的资金，这表明该提案有长期的计划，并希望采取阶段性的措施，这必须得到赞扬。", "q1r": 5, "q2": "尽管该倡议很好，但定义明确的指标使其更加引人入胜。提议者明确提到了可衡量的关键绩效指标，如入驻企业的增加，打开ADA钱包的人的增加，引入生态系统的开发者数量。这些指标是跟踪该平台的接受度及其影响的基本指标。除此以外，6个月的关键绩效指标希望加入1000多个成员，60多个中心和更多的成员，这将是审计人员考虑的明确的成功指标。一个新的代币 \"GERO \"的引入，使交易更加顺利。因此，所提供的关键绩效指标是丰富的，适合于对实施和整体成功的监测。", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 19, "ne": 13, "ng": 5, "nfo": 1, "vca_o": 2, "reply": "Dear CA 751, Thank you for reviewing our proposal, much appreciate. Best regards, Carl, Lisa & Dave"}, {"q0": "I agree that this proposal effectively addresses the challenge because it aims to build a huge hub with 60 languages translated for non-speaking English users. Its goal is to be the single resource for Cardano and Catalyst information delivered in a multilingual interface. ", "q0r": 5, "q1": "- Since the solution was written using AI to translate 60 languages, I can't find any specific AI technology will be used in the proposal. \r\n- $2000 for hiring people translate the website into 60 languages is practically low. \r\n- The proposal should give some more exposure of sources to collect information about Cardano/ Catalyst to translate from.\r\n", "q1r": 3, "q2": "Roadmap with milestones is the best part of this proposal since it's clear and detailed.\r\nKey metrics to measure success haven't been filled. \r\nKPIs after 6 months launching 60 language-hub with just 4 members/ hub is a humble figures. \r\nTherefore, I think the team should work more on the proposal. ", "q2r": 3, "assessor": "z_assessor_836", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1, "reply": "Hello CA 836, Thank you for reviewing our proposal, may I explain that the \"AI\" (Automatic Translations) work thoughout the website/platform. So the entire platform can be accessed by 60+ Language Speakers. The 60 human translated pages, will be single landing pages for each language, in the first phase we will only human translate 60 pages only. The sources of information are being published on the platform. Regarding the 6 month target, we believe it is better \"to under promise & over deliver\", best regards, Carl Henry"}, {"q0": "This proposal is extremely well presented and align with multiple aspects of the challenge: Increased participation from Technical, non-technical people individuals aswell as  companies/organised groups. The Beta version of the platform should be a great confidence builder for voters. Demonstrating a truly global platform with translation in multiple languages. The proposer has gone above an beyond what one would normally see from a prototype. ", "q0r": 5, "q1": "A relative modest budget ($9636) has been requested taken in context of the overall challenge fund ($350k) & compared to other proposals in this challenge. The commitment shown by the proposer to date develops trust and the very detailed budget breakdown look reasonable (I validated the translator costs and timelines against fiverr.com). Named resources have been identified although these are not verifiable, ideally the proposer could have added linkedin profiles to the budget lines. The proposal also provides a vision of the future , ie a DAO, supported by it own native token. This will be part of a Fund 8 proposal.\nI can see the hub becoming a great resource for non-technical individual and business. My only feedback to the proposer would be to put some focus on onboarding developers and understanding what they actually want or need from this service.", "q1r": 4, "q2": "The timelines provided are sensible (as described in feasibility note) therefore the auditability of the deliverables is straightforward, ie build the website with translation and pathways for the 3 target groups.\nMeasuring the value this service adds to the ecosystem could do with some further work. The proposal has a target of onboarding 1000+ new members in 6 months. This should be achievable based on the outreach the proposer seems to have. Breaking this down and providing targets for each of the 3 target groups would have made the metric more specific and the proposer could then have explained how they will market to each of these groups.    ", "q2r": 4, "assessor": "z_assessor_45", "no_vca": 22, "ne": 10, "ng": 12, "nfo": 0, "vca_o": 1}], "solution": "我们已经建立了一个 \"测试版 \"多语言平台，具有人工智能和实时翻译的多种功能，以连接所有社区中心和Cardano。", "experience": "该框架的建立，以及20多年来使用PHP、CSS、HTML、多媒体、AI建立商业网站，运行多达50人的开发团队。"}