{"id": 384839, "author": "catsper", "title": "Infinity Financial Operating System", "url": "https://cardano.ideascale.com/a/dtd/384839-48088", "category": 26243, "amount": 24000, "description": "Las simples transacciones cotidianas en el espacio defi son difíciles y hacen poco atractivo el envío/recepción de pagos para particulares y empresas.", "funded": 2, "upvotes": 84641357, "downvotes": 7968031, "votes_result": 76673326, "votes_cast": 170, "f6_no_assessments": 3, "f6_rating": 3.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer does not exactly make clear what the benefit of their proposed financial OS will be to the Cardano ecosystem or how it will interact with the layers mentioned. Also, the project does not perfectly match the challenge it was posted in and would have fit much better in boosting Cardanos DeFi. In general, the contents could be explained more clearly and not just in bullet points. Feedback: Try making the contents of your proposal more clear and tell us how they interact with the challenge.", "q0r": 3, "q1": "The proposer does not provide any verifiable personal information, so it will be difficult to say whether they are up to the challenge and have the neccessary skills. They also disclose they still need to hire developers for the project. However the budget has only been presented as a lump sum assumed to be enough to pay those devs, no working hours per step or hourly rates have been presented to go along with it. In general, no detailed implementation plan has been presented, but only a roadmap with some milestones. Technical details have been presented briefly and some resources that will be used (with a very brief explanation of how they are used however. Overall, the proposal would still need some more relatable detail planning that shows step by step what is achieved and how, in more detail than it is now presented. Feedback: make a more detailed plan for every implementation step and try breaking each of these steps down into budget points and define requirements for them. Also, link some examples of work you have already done.", "q1r": 3, "q2": "A problem and solution statement is presented, the solution statement however is still a bit lacking, as the bullet points of the solution are only very brief. A roadmap and timeline is presented that provides some auditable items (it is also called KPIs bout does not really have concrete KPIs in it). Feedback: present some quantifiable metrics if possible", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 19, "ne": 4, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The idea of paying by a device (phone) by scanning a qr code: nowadays, people are paying with their phones or watches on a national scale without fees. Using overseas transactions = these are not so expensive, except ETH fees. \r\n\r\nRegarding crypto contactless payments when you do not care what currency they accept or not = so if they do not accept, which currency you will use to pay? I guess you will end up paying only with stablecoins, or I could not come up with a solution to this. Imagine you will want to pay with Cardano and they do not accept Cardano, how this would occur? Would it be transformed to some stable coin right in the moment of payment? \r\n\r\nMaybe I did not understand the proposal, but for me, there are some questions that need to be addressed first, and I am not sure if this would have that large impact, because first, you need to have people who want to pay with crypto, and possibly stores to accept it. \r\n\r\nWhat is the difference between crypto.com and bnb cards which you can load to your phone and pay by phone? \r\n\r\nAlso, QR code is not used everywhere.\r\n\r\nI get the idea, I am just a bit skeptical. \r\n\r\nRating given 3.", "q0r": 3, "q1": "Relevant experience is stated, yet the proposer states that they will hire two full-time devs - it seems like they are not hired yet.\r\n\r\nThe roadmap seems reasonable\r\n\r\nRating given 3.", "q1r": 3, "q2": "I am convinced that the proposal can be audited, yet more information would be nice to see in this matter.\r\n\r\nSome points from the roadmap can be used for auditing or stated KPIs.\r\n\r\nI think that the progress can be monitored and also the final outcome, yet it would be nice to have it stated explicitly on what metrics.\r\n\r\nRating given 3.", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "I think this proposal effectively spreads the use of Cardano as a payments layer and implements a sort of hybrid lightning network type of approach. This proposed network will run along side stakepool operators nodes and SPOs will receive fees for running it.\r\n\r\nI do think that this proposal does indeed effectively address the challenge category.", "q0r": 5, "q1": "Unfortunately in this critera I do think this proposal falls short, the team has not opted to include and background information about the team, or company, and no social media profiles, and no technical expertise about who's behind the project. I would need a little more information about the team behind, and the developers you plan to hire, but I feel like you still have a cohesive and sensible plan for this proposal.", "q1r": 4, "q2": "The roadmap is clear and detailed with realistic milestones and proper KPIs. I feel that given the work the team has done laying out the KPIs for this proposal that this proposal will be very auditable ", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 20, "ne": 3, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "Un sistema operativo financiero (FOS) denominado Infinity, como infraestructura de capa 1.5, que utiliza tecnologías de escalado de capa 2 y de núcleo de capa 1", "experience": "SPO, desarrollador de Smart Contract & Defi, doctor en física matemática, informático, investigador de Blockchain"}