{"id": 401390, "author": "koome", "title": "Tinypesa", "url": "https://cardano.ideascale.com/a/dtd/401390-48088", "category": 26442, "amount": 250000, "description": "https://tinypesa.com was developed less than 6 months ago to facilitate free transactions within East Africa and facilitate transactions.", "funded": 1, "upvotes": 23730337, "downvotes": 15234298, "votes_result": 8496039, "votes_cast": 88, "f6_no_assessments": 6, "f6_rating": 3.3888888888888893, "videos": [], "media": [], "f6_assessments": [{"id": 1743, "q0": "The proposal wants to achieve a KIC process based on the Blockchain blockchain and built on the Cardano ecosystem. Based on Blockchain infrastructure for African business and financial development. Clear solution. However, the impact is not high for Cardano development in Africa. It will be difficult before the risks are mentioned in the proposal, but there is no positive solution for the risks when implementing the project.", "q0r": 3, "q1": "The group has the strength of team members with full skills and experience to implement the project. However, the proposal should provide a detailed roadmap of what will be developed. The only information that allows tracking the progress of the proposal is 12 months, but does not explain the scope and what is to be done. I hope to have a detailed budget breakdown by time period. Example: Annual Software Engineer - $85,000... how many members, time and salary will be paid to them.", "q1r": 2, "q2": "Without KPIs and milestones, it will be difficult to measure project success. The proposed budget is 100% of the total challenge budget, but the explanation is rather brief compared to a large request budget. The budget is not divided and explained in a reasonable and transparent manner for a project with a relatively high budget. A brand new proposal will be the first step that requires a lot of enthusiasm and positivity on the part of the team to complete the project.", "q2r": 2, "assessor": "z_assessor_1409", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3454, "q0": "Proposer is quite clear about  the idea of building a payment system for businesses to easily participate in the Blockchain market. This is not a bad idea and it can solve the time consuming problem of signing up for an online payment business wallet. However, the team can provide more information about how the application works through an example so that the voter will see it more intuitive. It is also quite reasonable to introduce risks and a way to solve the problem has also been mentioned.", "q0r": 5, "q1": "Proposer has only given an estimated time for the project, but has not given a detailed plan for each part. For example, for 'building one or both blockchain technologies based on KYC', the founders should have a more detailed plan for this part so that voters can clearly see the implementation plan of the project. how. In addition, the section 'a detailed budget breakdown' is also poorly written. Proposer should add details for a more specific spending plan for the large chunks you've outlined. On the contrary, the information part of the project participants is quite well written, has the necessary information for the voters to refer to.", "q1r": 3, "q2": "The 'auditability' section is well written, voters can track project parameters on Github, which shows clarity and transparency for the project. In addition, the founder has also come up with a number that shows the actual destination for the project. This is a pretty good point. But if the founder can add KPIs/Key metrics to make it easier for voters to compare the results with the intended goal, this proposal will be better.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4123, "q0": "This proposal  team suggest create a payments platform instant and convenient via API without transaction cost, facilitate the simplest and most convenient payment execution, and avoid bureaucratic problems. I think this is a very potential project to develop the Cardano ecosystem.\nThe proposal highlights the inherent feature of the project, which is to create a free trading platform for users. The target audience of the project is also clearly stated as businesses and developers. The project also promises to bring influence to the whole of East Africa by being the first to adopt social fintech.\nThe project has oriented the results to be achieved in a specific way. The achievements are explained in great detail how it affects the ecosystem. It also shows that this project completely matches the key metric of the challenge.\nThe proposers have anticipated some of the challenges that will be encountered when implementing the project, that is, the investment is not enough to balance the implementation of both target areas. But the team also planned to face the anticipated challenge in order to minimize the negative impact on the project implementation.", "q0r": 5, "q1": "The project converges managers with extensive experience and deep background knowledge in management fields. This creates confidence that the project implemented by these managers will bring desirable results for the Cardano ecosystem.\nHowever, the proposal only provides a summary of the project development roadmap. We need a more detailed roadmap. The project should also have a realistic timeline for completing the given tasks in a logical manner. For example, how many milestones is the project divided into? How long does each milestone last? Is it a short, medium, or long term project? What items will each project period produce? The items to be completed should also be described in detail in order to evaluate the completion of the milestone.\nThe proposers have created a preliminary budget plan. The plan is presented in terms of the most basic costs initially estimated. If possible, plan a budget in more detail, detailing the activities to be spent, the number of people needed, and the amount of money to be paid for. The more detailed the roadmap and budget plan, the more potential the project brings.", "q1r": 4, "q2": "Proposers want to reset the milestones. That is very welcome. If possible, specify clearly quantifiable indicators that can be easily tracked and audited by the community as the project progresses.\nProposal team also clearly identified the success of the project. The information provided is very clear and easy to understand. I believe this project will have great potential and will be taken seriously. The community will easily track the progress of the project after this project is funded.", "q2r": 5, "assessor": "z_assessor_1709", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5553, "q0": "After reading the proposal it still isn’t very clear what the link between Cardano and the payments platform Tinypesa is. The problem statement is formulated like a general introduction to the platform, the solution is also a continuation to the introduction, the description of the proposal is undetailed, talks about the payment platform and how it solves some problems, and mentions blockchain and Cardano only in regards to KYC and issuance of smart contracts and tokens, but there is no clear description of how that will be used. The platform has been launched 6 months ago, but it doesn’t seem to have been developed with blockchain technology, or especially Cardano Blockchain technology in mind. As it stands now, I cannot evaluate the impact the proposal can have.", "q0r": 2, "q1": "In the detailed plan section there’s mention of a partnership with another company to help the team move faster, but there is no more info besides that, regarding the development plan and how it will turn out, what steps will be implemented and in what order - no timeline.\nThe budget is superficially broken down, there are no number of hours estimated, no number of team members needed mentioned, it is hard to assess how this numbers can be accurate.\nWhile they do mention the team members, and have taken the time to write a short description for each one, they have provided no links to any team profile members or any outside source that would attest their skills.", "q1r": 2, "q2": "The team mentions some rough ideas on how the progress of their project can be measured, but there is no clarity on that (GitHub, maybe sprint milestones, maybe a timeline that will perhaps be on discord). Success is somewhat well described, though it is not clear on what period of time it will be measured on, 1600 businesses using their platform with KYC and smart contracts can happen in a couple of months, or years, so having had a specific timeframe presented, would have given a good perspective in assessing the project’s positive outcome. ", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6095, "q0": "Tinypesa looks like a solid project with a goal to provide single link checkouts for smaller merchants or however these links is used.The  link is integrated into mpesa (Which is very common in Kenya) via mobile phone number and this is achieved by a solid KYC(Know your customer).This will definitely improve the knowledge and use of Cardano especially in payments and the impact of this proposal cannot be understated if implemented well.\nI will be giving this proposal a 5 star for impact as if implemented, it will benefit cardano and the African community using it..", "q0r": 5, "q1": "I feel the provided plan should have been separated  and more details would have been added with associated timelines.\nThe cost breakdown is not detailed enough and the requested amount is too much considering the proposal is requesting for the whole funds without considering other projects to be funded in this category.\nI will encourage the team to look at sample proposal of previous funds as a reference template(https://drive.google.com/file/d/193GZulHuk0zhpTrMiLhcNC4OeEMoRyIa/view) to help guide the team in writing their proposals.\nThe team can boost the chance of their proposal being funded if they break the implementation of the proposal into several phases/funds which can be applied if you hit various milestones.\nFinally, even though the team was listed with their qualifications, a verifiable link was not provided for all the team members but Chweya.\nConsidering the above , i can neither agree nor disagree that. this team is capable of completing the proposal.I am giving 3 stars.", "q1r": 3, "q2": "The team have a github for development to be tracked and a discord link will be provided so cardano community members can independently follow the execution of the proposals.\nI have nothing much to say .I am giving this section a 5 star according to CA assessment guidelines as the proposal presented all the required information to audit the progress of this proposal.\n", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8179, "q0": "I think this proposal is a good idea, suitable for the requirements of the challenge. Proposal to address the issue of facilitation of free trade in the East Africa region and facilitate transactions through Tinypesa. Tinypesa has been established for 6 months, is in the testing phase, I go to https://tinypesa.com/ for reference and am satisfied with its friendly interface, easy to understand presentation. The solution offered is that Tinypesa builds a payment platform on top of Telco's mobile wallet infrastructure, facilitating free transactions for users. If the proposal is successful, it will firstly help blockchain technology play a central role in future integrations, and second, grow by releasing smart codes and smart contracts to customers. want to sell products. their products using Tinypesa's value-added services. The solution that has been described and explained is well suited to the challenge. The proposal identified the challenges and risks associated with being successful, but the risk-taking approach didn't convince me much because it showed me its accessibility wasn't very good.", "q0r": 4, "q1": "The advantage of this proposal is that there is already a launch build beta available. However, it will be difficult for the community to track the progress of the project because\n1. The proposal only \"estimated\" the time to reach the stated goal of 12 months and they are trying to shorten the time.\n2. The requested budget of $250,000 makes up the entire challenge's budget, but the budget has not been broken down into easy-to-check items such as an annual software engineer cost of $85k How much does it cost for people, how much is the other cost. 50k $? Since the cost required for the proposal is huge, I recommend asking for a smaller initial amount to make it easier to fund. For example, instead of the proposed 9 fund asking for a 250k/12 month fund, you should split it into $62,500 per fund (3 months). If fund9 is funded and the proposal is properly executed, it will also be easier to apply for funds in subsequent funds. It's also easier for the community to check your recommendations\n3. The project team consists of 8 members with a number of experiences and fields of activity. It is more persuasive to provide sufficient evidence of the relevant skills and experience required to recommend references or links.", "q1r": 2, "q2": "As pointed out, the probability of evaluating the proposal is low, as it does not show the roadmap with development plan, detailed explanation of each step, milestones and delivery of each part, progress and some a way for the community to measure the success of a proposition, such as metrics and KPIs. It would be better if you suggest to provide a link to the project's Github page.\nSince this is a completely new proposal, it is possible that the project presented is not really good. If this proposal is not funded, I hope you will continue it with follow-up funds because I think the proposal is good but poorly presented.", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Tinypesa is instant & convenient for developers via our API and businesses to collect money via online mediums at no transaction cost.", "experience": "Our team comprises of 7 software engineers, 1 front end engineer, 4 Back-end engineers and 1 embedded systems engineer. My experience as co-founder & CEO has been as a back-end developer and product manager. The CTO & co-founder is also a full stack software engineer."}