{"id": 401713, "author": "felixweber", "title": "Catalyst Africa Town Hall (CATH)", "url": "https://cardano.ideascale.com/a/dtd/401713-48088", "category": 26442, "amount": 9800, "description": "Cardano Community in Africa needs space to connect with project catalysts and be able to engage, network and discuss within the ecosystem.", "funded": 2, "upvotes": 76748670, "downvotes": 3258511, "votes_result": 73490159, "votes_cast": 341, "f6_no_assessments": 25, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 477, "q0": "Idea is in line with the general challenge for the fund since it seeks to ultimately provide the needed avenue for Africans to express themselves the best way they can and this always draws more people to bring what they have. Having the sense of community makes it attractive to others to also want to join aiding in growing Cardano. This proposal seems to find provide the solution of increasing the participants by increasing the number of African communities interested in Cardano Community. As it has already been in session and the there are already  positive reports, I am of the opinion and also agree that with more of such events,  more ideas and more project would be birthed. Inspite of all this, it is clear that the challenges of power outages and unstable internet would be the only issues to deal with.", "q0r": 5, "q1": "The structure of the events seems to be a very simple and achievable one. Wouldn’t take a lot to get that to happen from the duration to the gathering of the people. The budget allocation requested for is also within range and is well presented. The team presented seems to be a solid team with Cardano and Catalyst at heart based on the well presented profiles.", "q1r": 5, "q2": "Adequate information is given on where to find the events and also how to track the events. KPIs are also well laid out as to what to measure to determine the progression or retrogression of the project. \nI would like that they stated what the various numbers under “What does success for this project look like?’’ mean", "q2r": 4, "assessor": "z_assessor_1169", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4280, "q0": "The proposer has given a pretty detailed introduction about the team's solution. They also said that the solution would increase the number of African communities interested in the Cardano Community to grow which seems to aligned with the main spirit of the challenge. They have explained a lot about the aim of the solution. However, not giving the specific numbers might be one of the missings to check if it's aligned with the challenge's key metrics or not. They have foreseen the possible risks in the future and showed us that they have preparation for those problems.", "q0r": 4, "q1": "The detailed plan was expressed in the proposal and so was the budget breakdown. We can see what activities that they were going to do when they started the project. The information of the team members who were required to complete the project was provided in this section of the proposal. The proposer has listed out the names, together with short introduction about them and working experience. ", "q1r": 5, "q2": "About the method the team would use to measure the progress of the project, we can see that they have provided us a Google Drive folder in which they said they would upload some information related to the project. So if you want to check out how they would be doing, this is an effective channel to check. In addition, we can see that they have mentioned some key metrics which aligned with the challenge's key metrics in the section of what the success look like to the team. I think this is a good point of the proposal. However, I'm not sure if they should put this kind of information in this section or they should mention it earlier in the Impact or Feasibility section. One more thing I think they should've done is to tell if this is an entirely new project or it belongs to a previously funded one.", "q2r": 4, "assessor": "z_assessor_1714", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10030, "q0": "This proposal is focused on reaching new CA's and engagement in Catalyst for different languages (arabic Swahili and french) the funding will allow the group members of 10 people to meet weekly for event planning and engagement in the local community. \nAfrica's population has challenges around electricty and internet connectivity. This group will support to overcome these challenges by offering a space with electricity and internet to go over the various benefits of catalyst and the cardano ecosystem. \nThis proposal will bring a positive impact to cardano and catalyst", "q0r": 4, "q1": "The group of 10 members for this project show a good background of various catalyst fund events. They have participated in the cardano ecosystem and are well versed in the local language in Africa (several swahihli arabic french). They also intend to propose local meeting of 30 people or more to form community engagement. The targets set are very achievable and can bring a positive outcome. \nThe budget requested for the amount of work proposed is very fair even on the low side. Providing translated documents will be a key factor in this project.\nThe project is planned for a 6 month period which is great, however since it is mainly focused on catalyst I would advise to match the timeline with the catalyst cycles of Poropasa/Assessment/voting. It seems within a 6 month period 2 full cycles can be matched. ", "q1r": 5, "q2": "Some of the members of the proposal have shared their linkedin account and there are many that have good experience in the CA catalyst role. \nIn addition the townhall meeting and online meetings can be posted publicly to validate the number of attendance and summary. Finally the translated documents would also be a key KPI to track for the success of the project. \nThere are several factors to help define the success of the proposal. However to go align with the Grow africa space they mention a 10% growth in CA enrolement in Africa. I wonder if it is a KPI that can be tracked easily and secondly if this KPI is in direct relation to the effort of this project alone. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9100, "q0": "Africa really needs more education and knowledge to be part of the blockchain revolution. With is this, space is needed to create the environment to nurture and train minds and skill to join the ecosystem. This comes with work, creating inclusive space, time and resources. The proposal is fully meeting the challenge that, Africa should not be left behind in the new technology revolution", "q0r": 5, "q1": "The team is demonstrating a high level professional wealth of experience in the cardano ecosystem and very organized. \nThe budget is reasonable, detailed and have also put in place a simple to follow comprehensive sustainability plans of action even without winning this funding. This is a great commitment to ensure Africa is not left behind. \nThe proposal is activity based and have clear timelines of the action plan. This implies, the proposal will be implemented successfully ", "q1r": 5, "q2": "The proposal has well improved KPIs and looks there has been ongoing activities to grow Africa's with interest results, This shows, success is expected.\n\nWith the metrics provided, it will be easier to evaluate the project at any given time.\n", "q2r": 5, "assessor": "z_assessor_719", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9023, "q0": "Considering the problem described in this proposal, there is alignment with the challenge setting as it provides an approach to growing Cardano in Africa, a critical summary of the challenge. TownHalls are effective spaces wherecardano/catalyst workshops are held, having one in Africa is a big win for the ecosystem. The goal presented, which is creating an appropriate platform where African communities can easily interact and communicate within themselves is a pain issue in this challenge and hence there is an alignment.", "q0r": 5, "q1": "With the information about the team and relevant experience provided, I am confident that the team is well equipped to implement the project. The budget is well presented and I believe the budget is reasonable to achieve the set goals. However, I can’t find the grand total of the budget (probably hidden somewhere). In as much as the budget is broken down I will also advise that there is an inclusion of the grand total.\nThe plan is comprehensive and the timetable is also clear and definite as we can tell the commencement and completion of the project. The challenges and risks are factored in, that’s brilliant.", "q1r": 4, "q2": "The roadmap is detailed and the milestones and time horizon are clearly stated. I believe the metrics/KPIs were wisely chosen and are good indicators of the desired outcome and evaluators of the success of the proposal. However, there is no clarity in number of the various metrics/KPIs, I will therefore advise that clarity is made to this in future proposals. There is clarity in the description of the problem, the solution and how the problem will be tackled, and that for me is good to have them included.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8955, "q0": "This is certainly a great idea, it is about to level up the Catalyst Africa Town Halls (both in quality and format) and level up a flatform for the Town Hall. In my opinion, the proposal is impactful completely because it fits very well with the challenge, to continue “seed and grow Cardano in Africa in 2022”. It will also add a lot of value to Cardano system by: increasing meaningful participation in Project Catalyst among all stakeholders from Africa, increasing voter-proposer interaction, onboarding and integrating new African people into Project Catalyst, and helping keeping the Africa community together. \nMoreover, the proposal is well written, in a succinct, clear and understandable way with information fulfilling, also risks which are relevant to the proposal’s successful implementation, are considered as well as the risks solutions, especially the team has already started the activities for the CATH even though this proposal would be funded or not,  it helps readers see better about the enthusiasm, devotion and wonderful effort of the team toward Catalyst project and Cardano ecosystem. \n", "q0r": 5, "q1": "The plan which is set up very clear and is written very well, allow us to understand which activities need to do, what expected number of event’s participants, what numbers of the community need to measure.\nThe proposal with all of team members are active fulltime Catalyst Community members: they are Catalyst Swarm co-founder, Idea Fest host, Challenge Team members, Challenge Team Moderator, CAs, vCAs, voter with rich experience and skills relevant to organizing and hosting Catalyst events. Some of the social links which are included tell us more details about them, who they are, how to connect them, ect.\nAbout the financial amount, I think $9800 is quite fair and understandable and it is broken down in details as we can see how the money asked would be use. In addition, the description of the solution is very reliable clearly with list of activities need to be done, and the proposal is in the collaboration as well as have a direct support of a committed team and partnership (Catalyst Community Members, Catalyst Swarm, Catalyst School and Wada). All of them make the proposal is fully feasible.", "q1r": 5, "q2": "I can say the proposers have a very well preparation for the propsal’s transparency in public as we have the recording of the first CATH included (1 hour 2 mins long), and we can see how the success of the proposal will be. All of the progress will be tracked with Youtube links as the authors state: it will be uploaded elsewhere. We are looking forward to seeing where it is, because videos of the Town Hall are always necessary for busy people who want to join but their time does not allow.\n\n", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7684, "q0": "Town Halls are essential gathering area for people in the nearest community to congregate and spark that initial journey into Cardano. Will it always be the main congregation point? Perhaps not and that is not the point. Town Halls point are to be safe haven to learn, ask, make mistakes and collaborate. Eventually what usually happens after a Town Hall, are social forks, where numerous community based entities pops-up. Without funding, the Town Hall can indeed function, but not effectively and not humanely. Efforts of the participants of a Town Hall should be compensated. Those who operate a Town Hall are faced by tedious day-to-day education and engagement of the community till it reaches an infliction point, where the community runs and grow the Town Hall autonomously, the seed of a DAO. Where founders can slowly disappear into the background and build other things. Catalyst Africa Town Hall is essential in growing Cardano in Africa. It should have happen earlier to be honest.", "q0r": 5, "q1": "The people involved are also the people involved in Catalyst School and then some. The most notable addition, to my understanding is Mercy. One of the OG's of the Cardano community. I remember her well and her passion to systematically setup WADA. From 1 (one) proposal to 8 (eight) proposals and counting. Many of which have been funded and continuously be funded. Continuously being the keyword. This shows by having her in the team, the plan that this team has formulated will achieve it's goals. Add to that, the other members who are also actively involved in the Cardano community, who are also funded proposers themselves, I see Catalyst Africa Town Hall indeed being the catalyst of Cardano.\n\nWhat is discerning though is their budget. It bothers me. I repeat, it bothers me, when quality people need to low ball themselves to receive funding. It's as if no one understands how to valuate people accordingly to the value they will deliver, to contributing to the mission of Cardano in uplifting people, to the long term goal of mass adoption of Cardano. I repeat, we are not capitalist that seeks to find the cheapest most impactful proposal that is. Which I believe is still a continuing trend. Perhaps when the teams actions results in hard facts and data, then can the team ask for more budget. Though that is not ideal, for the reputation that the team members have already built.", "q1r": 5, "q2": "There are 2 (two) deliverables from this proposal. One being bi-weekly Town Hall and one being translation of various documents into 3 (three) languages. The bi-weekly Town Hall will be and has been recorded by the team. They have provided a temporary repository in the form of a Google Drive folder. What is unclear though is what document they will translate into? Although I have no doubt they will be quality documents regarding Cardano and Project Catalyst, for the sake of auditability, it would have been great to have some details. Please take note, they are also setting up a Discord, Telegram, Facebook and various other platforms, which can also be used to track engagement and growth, which is a definite value added for the team in assisting the auditability of this project.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6960, "q0": "Personal relations and skills to the topic:\nI do not claim to know a lot about cultures in african countries or about the mindset nor will I generalize what is in my opinion best for anyone on that continent in my assessments. What I can say is that I know catalyst, the community around it and the good actors within it quite well, because I have spent many hours on here, and I know how a good proposal is supposed to look like from my general professional and political project management experience.\nThe forum format of the localized townhalls have proven to give people from certain common backgrounds a safe space to develop ideas and build networks with each other and have helped newcomers to benefit of the skills of more experienced people in the past. Thus they are a very powerful catalyst for new projects and can only be beneficial if organized by the right people (which in this case they clearly are). Some of the recent discussions within some catalyst groups that have contained enviousness, prejudice against african countries and tried to delegitimize the entire challenge have shown that exactly this kind of proposal fostering self-organization is what is just needed within this challenge. Just like the other localized townhalls, it will definetely add a lot of value to Catalyst and the Cardano ecosystem. By bringing together people, it will help a lot with scaling and this also matches the outlined challenge setting very well.", "q0r": 5, "q1": "Having project management experience \nin both professional and political environments, I know what is improtant for a solid implementation plan of a project. Also, due to a past activity as a treasurer, also in the political field, I know how good budgeting works. Thus I feel very confident to be able to give meaningful input on both budget and implementation plan of this proposal. Felix Weber and the Catalyst swarm, just as Mercy and WADA, are a really active and vital part of the Catalyst community. Without a doubt they will be able to successfully enact this proposal. The proposers know and already define the type and number of team members required to implement the proposal and basically have already set up their team. \nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals. A very positive factor is that the proposers already work for free on the proposal without having any funding assurances yet.\nThe proposal offers a realistic timetable to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and shows a lot of details which makes clear that it has been well thought through. This is without a doubt a perfect example of a good, feasible proposal.", "q1r": 5, "q2": "My past experience in catalyst and my professional experience in project management of engineering projects give me the skills to successfully identify auditable projects. The proposal has a roadmap and very clearly defined, detailed deliverables. The proposaers are known and transparent about themselves and their past work. Clear success factors have been defined and will make the proposal easy to Audit. The problem and solution statements are very clear and put the proposal into a defined context for good auditing.\n", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6858, "q0": "Get more people join the Cardano catalyst  allows an increase interest to the Cardano ecosystem and as stated in the proposal the organization plays a role of guidance and support to different proposals related to increasing the Cardano into the Africa continent. As that it's aligned with the challenge.\nThe target of 10% of funding per cycle may always be increased as the fund cycles go on", "q0r": 5, "q1": "The team seems to be strong enough as formed by people who have been involved with the Catalyst for a long time; and who have also various backgrounds, which is a asset for the success of a such proposal.\nThe budget is detailed but some items are not explained, example of the attendance cost. Is it an honorarium/reward, pay or incentive for participants to the planning meetings?\nThe $2000 would be allocated as administration fees and Zoom subscription cost?\nBased on the proposals experience in the blockchain and the catalyst project, this proposal has a chance to be successful.\nI'm questioning it wouldn't be possible to plan for an hybrid system, online for people who have access to the digital equipment (Phone, computer, electricity, Internet connection), and also in person somewhere in Africa as a pilot stage?", "q1r": 5, "q2": "The indicators are defined and may be reachable. As the sessions as scheduled regularly on a certain period of time, it may be easy for evaluation for proposers , but also the community may follow the expansion and execution of the current at the beginning of the next funding cycle.\nAccess to electricity, Internet connection are major challenges, but also the initiators would mention the access to computer, or lack of financial means to coverthe cost of service in a Cyber café, that are still common in Africa for access to the Internet.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5170, "q0": "Creating and growing/improving an African-focused Town hall is directly in line with the challenge objectives. This gives Cardano Africa community members an opportunity to network directly which in turn may lead to more Cardano Africa activity. Also, this is a chance for prospect Cardano community members to be influenced by seeing examples of people who closely resemble them - which may not be the case in the existing town hall meetings.", "q0r": 5, "q1": "The team has already successfully held a pilot CATH, is well experienced, has the support of established groups in the Cardano ecosystem, and has a reasonable budget. In theory, this idea has good scaling opportunities as meetings are held online and so all that is required is an internet connection and access to a phone or computer. However, as the proposer outlined, in some regions (within Nigeria for example) power is inconsistent and unreliable. Perhaps solutions to this can be addressed by the proposer or a collaborator in Fund 9 e.g. holding viewing events in centers with dependable power and thus internet throughout the meeting. ", "q1r": 4, "q2": "A roadmap is clearly defined and local impact and reach can be measured via CATH attendance.", "q2r": 5, "assessor": "z_assessor_1888", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4870, "q0": "Yes this proposal definitely effectively address the challenge. The problem with contries like africa is that they dont have that much resourses avilbale to learn and understand with the trending techs like nfts, cryptos, cardano etc. the aim of this proposal is to increase the quality of information accessible to individuals on the continent using various medium with multiple language and translation they will help them to understand and learn about cardano, catalyst, community and much more. They can participate in various activity and then will definitely scale and expand catalyst in aftrica .", "q0r": 5, "q1": "Yes The team seems very experience having supported and mentored by Catalyst Swarm, WADA Ghana, CAs, vCAs, Ideafest members. That will be really helpful to implement this proposal successfully. Also the plan seems wonderful including Bi-Weekly CATH online event,  zoom meetings, monthly review meeting with having translation and multiple language support.\n\n", "q1r": 5, "q2": "Yes they have provided very clear cut roadmap and informative plan to audit the entire process. Also the budget seems very clear and reasonable with having very experience team members and community members support.", "q2r": 5, "assessor": "z_assessor_1792", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4846, "q0": "In this proposal, the team want to create space for the Africa Cardano Community to connect with the other communities to engage and network within the ecosystem. Their aim is to get more individuals on board, more projects to build on Cardano and build a larger market for the continent. The project is focused on creating a positive collaboration that will help to propel the Cardano ecosystem faster in Africa. ; also to level up the catalyst Africa Town Hall. \nThe main risks according to the proposer are frequent power cuts and unstable internet, but the proposer provided solutions as a standby generator and having a committed hos site respectively.\nI rate this section 5 because it is detailed and the impact on Africa onboarding is awesome.", "q0r": 5, "q1": "The plan has details as having a bi-weekly online events, targeting minimum of 30 persons per event; translation of documents into various languages and others. \nThe budget breakdown is clear and showing costs of activities outlined in the proposal for quick auditing.\nThe team has 9 people who are CAs, vCAs , experienced people of blockchain knowledge and event organizers from Wada. They are capable of delivering successfully. So I rate them 4. ", "q1r": 5, "q2": "Their online events will be recorded on discord and telegram channels which will be visible to all- Wada website, Catalyst Swarm, Catalyst School. \nSuccess can be seen in the number of participants at each meeting, number of new communities coming on board and number of proposals submitted for the Africa community members and others in the proposal. It is a new proposal. The details are enough for successful auditing so I give 5 rating.", "q2r": 5, "assessor": "z_assessor_1785", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4124, "q0": "The proposal team is aware that Africa needs space to connect with project catalysts and discuss within the ecosystem. The solution to this problem is to create a platform that welcomes the people of Africa and makes it simple to use through communication and interaction. I very much welcome this idea of the group.\nRegarding the solution, the proposers have detailed the solution to the problem but have not highlighted the features and benefits of the project as well as the main activities of the project. I also wonder how this project will affect the potential audience that the project is targeting. These important details are not clear when stated in the Solution section. Please provide more technical details or highlight the function of the project using case studies as examples.\nThe potential target audience of the project is the African community with the aim of attracting to the Cardano ecosystem and expanding the African market. This goal is completely consistent with the key metrics of the challenge. Purposes are divided into two parts\n1. Upgrade a platform to increase the quality of information\n2. Upgrade the Catalyst Africa Town Halls\nThese contents are described in detail by each part and each stage.\nThe challenges that the project will face during implementation have also been thought about by the team. Those are small challenges and the team has also foreseen appropriate solutions when these incidents occur.\n", "q0r": 5, "q1": "The team leading the project implementation includes experienced members and the knowledge they have will be the source of capital for the project to develop. Profiles of these managers are also provided very transparently allowing viewers to track their activities in advance. This builds trust for the development of the project.\nHowever, the roadmap of the plan is not really full of information as expected. The proposers should divide the plan into milestones with a reasonable implementation timeline. At the same time, it should also be more detailed with the requirements to complete each work item. Please provide more detail on the language and technology aspects needed to implement the project.\nThe project has estimated the positions and the number of personnel needed to implement the project. Along with that, a list of items to spend is also calculated. The plan sets a reasonable budget for the project and is presented in an easy-to-grasp bulleted way. In general, the proposal also shows that the plan that the team comes up with will probably be in line with the proposed goal.", "q1r": 4, "q2": "The proposers must present clear quantitative indicators to monitor the progress of the project. Based on these indicators, the community can track project progress. It can be the number of users the project will attract, the time it takes to complete parts of the project or the amount of traffic the project is aiming for... Be more specific in these numbers to show the success of the project. project when it is completed. Instead of linking to the record, specify these metrics in the proposal.\nVisualize when the project is successful, what criteria it has met. What are the requirements for the product that the project delivers from the milestones?\nBe specific with these details to show that the team is serious about setting goals and completing the project and to be able to easily assess if it aligns with the blueprint.", "q2r": 4, "assessor": "z_assessor_1709", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 799, "q0": "Catalyst Africa Town Hall is a great initiative to support and grow the Cardano African community. Through attending and studying at the Catalyst Africa Town Hall, I realized that developing the Catalyst Africa Town Hall is a very necessary job. It will help connect the Cardano community in Africa and what's even better is that it will help more new people join the Cardano community through learning at Catalyst Afica Town Hall programs. This is completely in line with Cardano's Africa development goals.", "q0r": 5, "q1": "I have attended many Easter Town Hall shows. I believe that with the experience of Felix Weber with Afia Owusu and other members you will do very well in this proposal. The possible risks that will make this proposal unsuccessful and the way you handle it we fully agree. My small contribution is that the meetings you can record to upload to video sharing platforms such as Youtube, Tiktok, etc. will help those who miss the meeting have the opportunity to study at any time. .", "q1r": 4, "q2": "The route you have given is very reasonable. However, you need more details about the cost of $3000 for document translation and $2000 for administrative expenses. You guys can make these expenses more transparent, I believe the community will appreciate it much more. In addition, you also need to be more specific about the number of participants in each meeting, the number of community participants or the number of proposals that will be available in the next Fun. This will make it easier for the community to measure and evaluate the effectiveness of your activities.", "q2r": 4, "assessor": "z_assessor_1213", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3553, "q0": "The focus of this proposal is getting more traction towards the catalyst community targeting people who speak Arabic English and Swahili. Having meetings with at least 10 participants \nOne of the challenges is electricity outages and so they are looking to provide a space where they can control this varient. ", "q0r": 4, "q1": "The participants have created simple steps that are easy to implement. The project doesn’t ride on a single effort it depends on a group effort with members that are well experienced in the catalyst community. The proposers came up with a solution to overcome any linguistic barrier. The budget is suitable for a project of this size and the goals are achievable", "q1r": 5, "q2": "They mentioned YouTube videos of the meetings and a telegram group. This is useful but very time consuming to try to follow up on.  I would suggest a space online where they can share their meeting minutes clearly without having to go through the complete chante on telegram or the videos on youtube", "q2r": 3, "assessor": "z_assessor_1660", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 3455, "q0": "First, the proposer explaine the idea for the project quite well, stating the purpose of the project and how the project could deal with the challenge. This shows how the project impacts the Cardano platform. In addition, the proposal also has a pretty good risk/challenge section, stating the challenges the project encounters as well as how to solve it, but the founder should provide more detailed solutions.", "q0r": 4, "q1": "Proposal only has a plan outline but does not provide a detailed timeline for each of those tasks. This will make it difficult for voters to clearly see the steps to implement the plan as well as the deadline of each plan. The team should also add details to the items in the 'a detailed budget breakdown' section to clarify the budget. The information of the group members is also quite well written, some people have enough information, but there are also some people who do not have information, need to be added.", "q1r": 3, "q2": "The team has provided the link of the project so that voters can easily track the progress of the work. In addition, the founder has provided criteria to evaluate the success of the project, but has not yet given the target numbers for the project. Founders can add more because they will help the voter see clear goals for the project.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 3229, "q0": "The proposal is aligned to the challenge. It demonstrates a real need of leveling up Catalyst African Town Hall (CATH), to increase its coverage and content scope to serve the African people irrespective of color and language. The objectives and outcome of the proposal are defined. The information in the proposal reveals that the proposal is intended to bring about local and global impact in enriching Cardano’s Ecosystem, participation, idealizing and address local/community needs. The proposal has high potential for scalability.  This proposal seeks to make Cardano known across Africa.", "q0r": 4, "q1": "The team information provided is sufficient for the kind of work. The proposed approaches, strategies and activities are reasonable. The time frame is defined, the budget is explained and risks taken into consideration. The expected outcome surpasses the risks anticipated. ", "q1r": 4, "q2": "The KPIs, roadmap, milestones and delivery dates are defined. The information provided in this proposal is in alignment with key metrics of the challenge and it is sufficient to audit the progress and success of the proposal. ", "q2r": 4, "assessor": "z_assessor_1629", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 3052, "q0": "good proposal. the proposal strongly aligns to the challenge. this proposal also clearly articulates how it will add value to cardano ecosystem . the establishment of an open and inclusive space for the community to present ideas, connect and meet with each other to share vision and ambitions is a plus to a succeeful execution of the project which i find encouraging. the goals and metrics of this proposal are in alignment with the challenge, so to me this proposal is promising and has a good future to add to the cardano ecosystem in africa. As for the challenges spelt out that wouldnt be a problem if the project receives adequate funding, i therfore agree to the proposal and find it good.", "q0r": 5, "q1": "with regards to the information provided about the team and with various internet links i strongly believe that the team  is adequately up too the task and when funded it will take cardano to another positive level in Africa, am impressed on how the budget has been broken down into indentifiable parts  and shows that team knows what they are about, and the budget is totally fine with the kind of project this proposal seeks to attain, this is a plus and impressive, keep it up for next proposals. \n in all i find this proposal loudable , thumbs up to the team. more power for next  proposals", "q1r": 5, "q2": "in line with this proposal the time horizon , the milestone  and roadmap are totally comprehensive not forgetin the key indicators . this proposal is a good one and i personally have higher hopes and believe in this prposal, it is obvious that the team is ready for action , when supported this project will bring cardano to the african people closely. good prosal, bravo.", "q2r": 5, "assessor": "z_assessor_1603", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2927, "q0": "Yes, challenge is effectively addressed.\nA common goal for Africa in uniting, indepth knowledge about the continent, breaking language barrier through diversity inclusion will be achieved easily. \nAside these, other socio-economic issues facing Africa members can be addressed timely.", "q0r": 5, "q1": "Witnessing the 1st CATH & what to be implemented, intensive & frequent CATH will take place which will drastically increase membership in Africa.\nSecondly,  listed supporting Team, indicate of a highly knowledgeable & solid Team who had pass through most of ranking in Cardano ecosystem.\nA justifiable budget break & project time frame is stated", "q1r": 5, "q2": "As stated, the 1st CATH is held on the 4th of March and participants records is available to be accessed.\nIt's clearly stated its targeted members,  that's those who joined within 6 months.\n", "q2r": 5, "assessor": "z_assessor_1591", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2881, "q0": "Great idea! Very important for the Cardano African eco-system to enable communication and collaboration as well as support and accountability. \n\nOne thing that I'd suggest is to reconsider the acronym as this is such a positive idea and you don't want to be associated with something potentially sad (google \"Cath lab\"). Perhaps PCATH may be better? I know it's just a slight change but it's more specific which could be useful too for future SEO.\n\nI love how they made reference to challenges such as frequent power (electricity) outages within the continent with regards to participating members, and mentioning that the host will be supported by a standby power. Most proposals in the 'Grow Africa, Grow Cardano' challenge do not seem to acknowledge this main risk. As well as, unstable internet connection from individual participants which they mentioned too and said they would resolved with a dedicated network from the host site. This gives me confidence that they truly know they target audience and have thought about this thoroughly - very well done.", "q0r": 5, "q1": "Their plan is very detailed and coherent. I really like that they plan to have breakout rooms in Breakout rooms in English, French, Arabic, Swahili and other Local languages to account for some of the languages spoken in African countries. This ensures inclusivity for those who may feel more comfortable communicating in one of these languages. \n\nIt is also great that they have created platforms (e.g. discord, Facebook) answered by their members in retrospective languages too. \n\nThe proposal team is very strong and according to the comments on the proposal, several people from the Project Catalyst community are interested in joining the proposal, I can imagine this growing with each round. Additionally, many of their team members, namely Nana and Afia have been part of the Project Catalyst community for a while either as CA's, vCA's and proposers. ", "q1r": 5, "q2": "The proposal states that regular surveys will be conducted in each community to count the number of voters, proposers and experts in each of the regions. This is very useful for data and for audit-ability. They have also already had 2 town halls to date March 4th and March 18th, and their town halls are recorded too. Currently in a google drive folder but they have plans to post elsewhere too. \n\nOverall, I am confident in their abilities to carry out their plans, they have already started and their team is very strong. Great job!\n", "q2r": 5, "assessor": "z_assessor_1586", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2439, "q0": "Catalyst Africa Town Hall is a community-led initiative intended at spreading Cardano across Africa and supporting the growth of a truly global economy and society. The objective is to create a platform that will increase the quality of information available to people across Africa, hence encouraging more individuals to participate. As more individuals join up, more projects are anticipated to emerge. More Cardano-based projects will open up a broader market for the continent, contributing in the development of the Cardano ecosystem in Africa, which is the challenge's aim. The solution will increase the number of African communities interested in the Cardano Community. There will be an increase in the quality of Project Catalyst initiatives, as well as the number of contributors and those interested in blockchain technology. Because participants will learn how to utilize the technology, as well as the community, to meet local concerns, this proposal clearly exhibits Cardano tech use-case solutions. Hence This proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer is one who knows the kind and number of team members needed to carry out the plan especially with the addition of a bilingual member to her team, and gives a budget that is broken down into pieces, and acceptable in order to meet the established objectives. The proposal also includes a realistic timeframe for completing the work, as well as a clear and actionable implementation strategy that demonstrates what is being done and how it is being done. The proposer has stated that the proposal has already started this and will continue to do so whether or not this funding is gained which is laudable. The proposer is committed to expanding cardano awareness whether or not it’s been funded. The proposer has considered the challenges that may arise during implementation and suggested possible solutions, thus problem solution listed has a high chance being implemented successfully", "q1r": 5, "q2": "The proposal includes a roadmap with milestones and a time frame for completion, as well as metrics and key performance indicators (KPIs) that define the proposal's success. The proposal includes a clear explanation of the targeted problem, as well as a solution that solves the problem in a comparable manner. Since this project has already started and there are already videos of it and a considerable number of participants it would be easier to audit. Thus, the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 2379, "q0": "This proposal fully meets what the challenge asks for, as it intends to produce translated documents of Town Halls for Africa to Arabic, French, Swahili, bringing the main news from the Cardano ecosystem to Africa in a practical and quick way. I thought it was an extremely good idea, in my view, it would be perfect to be done in all those languages! Because as a first fund Catalyst participant, I can assure you that I suffer from this ailment, I can't keep up with all the other Town Halls very well, mainly because they are not often in English. I can only imagine that the African situation is similar if language is the primary barrier to entry, which makes this idea very useful, keeping up with major ecosystem updates is something every member of the community should do, and certainly this proposal will make this more possible for the Africans. Another positive point I found here was that the authors have already done a successful CATH townhall and have partnerships with SWARM and other townhalls, which demonstrates that they have competence and experience with our ecosystem and with Catalyst, and it is also very useful that they already have a site created where this new content could be introduced.", "q0r": 5, "q1": "The project team proves to be very well prepared to carry it out, because they provide a small individual description of who they are, which is summed up by their contacts on social networks, making real the possibility of making direct contact and getting to know them better, and also the fact that they are connected to other teams already funded in previous funds. In relation to the budget, I believe that the level of detail here was high, and with that, satisfactory. We know what each part of the project will cost, and regarding variable costs, they are very well calculated, broken down, and explained so that we can understand exactly what would happen here. So I think the only thing I would suggest would be a little more detail in the phases and what they are already doing. I love that they already had the town hall and the vibe in it. I actually attended the Africa Town Hall today and it went extremely well and achieved the attendee goal that they set to accomplish.", "q1r": 5, "q2": "I found it interesting how concerned the team is with audibility. They are not only careful to pass on information that would help the rest of the community to monitor the progress of the project, but they drew up an arbitrability plan in which they would monitor the project's growth, according to the number of town hall attendees, voters, proposals, members onboarded, and so on. That way, all we would need to do is have access to such information as well, which they would generate weekly, but could present to us monthly, or every 2 months, for example. I believe that monitoring this project is relatively simple, compared to other proposals, and has already been very well supported by the team itself. The KPIs and Metrics are very clear cut and measurable by their nature.", "q2r": 5, "assessor": "z_assessor_1484", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2364, "q0": "This proposal suits the challenge setting. The is a huge opportunity to bring together Africans in the community with resources to educate the community with the increase in the quality of information accessible to individuals on the continent. The Cardano community in Africa will grow with this. This proposal also goes on to lay out the problem of individuals with unstable internet connections and explains how to solve it by a dedicated network on the host site to further help curb this problem.", "q0r": 5, "q1": "The proposers have experience and have their solutions in detail stated alongside broken down budgets. The proposal is highly likely to be carried out with success.", "q1r": 5, "q2": "The feasibility section of this project lays out the plan and activities of this project. They expect to see a number of Africans participating and out of these CAs coming out of there. Links will be shared to aid members to track the project progress. Also, the number of viewerships being received by every single meeting would help the team articulate when and where to increase marketing efforts. These activities can be reviewed and it shows what the success progress looks like. Looking at the metrics of the proposals in line with the activities of the proposal the progress and success can be measured with the metrics of the project.", "q2r": 5, "assessor": "z_assessor_1478", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 1212, "q0": "Reading the proposal, the problem statement tells us that Africa needs to connect and collaborate and the solution of setting up the Africa Town Hall clearly addresses the challenge. This is a very laudable idea. The impact according to the proposal is get Africans and the Diaspora in the Cardano community to connect, share common ideas and focus on Africa to solve Africa issues. The impact according to the proposal is to bring more Africans to the Cardano ecosystem. The platform is a place to onboard safely new members in Africa. \nThe proposer mentioned challenges as frequent power cut and unstable internet, but provided solution that there will be a generator on standby and also boost the wifi. The challenge is ell addressed so I have given 4 star rating.", "q0r": 4, "q1": "The plan in the proposal is detailed showing weekly meetings of the team to create content for 3 months from March to May 2022. They will have biweekly on-line events targeting 30 persons minimum per event, and have breakout rooms in English, French, Swahili, Arabic, etc. and translations in the languages. \nThe budget breakdown shows costs of the activities and well broken down to audit. \nThe team is made up of WADA experts in CA, vCA and blockchain experts, Felix Weber who is Town Hall expert. This team can implement the proposal successfully so I gave 4.", "q1r": 4, "q2": "It is stated in the proposal that the first meeting was held on 4th March 2022 and the recorded version can be found on Catalyst School channel and Wada website.\nThe success can be measured by the number of participants of each meeting, number of new communities coming on board, number of proposals submitted by Africa community members and number of CAs, vCAs coming out of Africa. This detail deserves 4 star.\n", "q2r": 4, "assessor": "z_assessor_1315", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10487, "q0": "The idea about creating and hosting a Catalyst Africa Town Hall is a great and worth commending. I am impressed about this idea because I know the proposers have done a great job explaining how they intend to address the challenge faced in bringing Cardano to the door steps of all and sundry in Africa. The solution they proposed will increase the number of African communities interested in the Cardano Community to grow. You can see that there will be an increase in the quality of Project Catalyst projects, increase in the number of contributors and increase in the number of individuals interested in blockchain. This will help achieve the aim of the project by levelling up a platform to increase the quality of information accessible to individuals on the continent. \nI love the way they coordinated their thoughts and how they intend to achieve massive results when given funding. \n", "q0r": 5, "q1": "I am excited about the level of work the proposers have done. They have been consistent with their plans and arguments. They have also been able to provide and more convincing problem statement as well as provide an encouraging solution that can help solve the challenge.\nFrom the proposal, it is also worth noting the depth of experiences presented by the proposers, I believe it is highly likely that the proposal will be implemented\nsuccessfully. Nev\n\n\n\n\nHowever, I also believe that the team has designed a very tight schedule, in particular, to\nachieve this Catalyst Africa Town Hall across the target areas. Considering the complexities that exist in getting permission to travel in the case of in person conferences. I think they could provide an additional information on how they can navigate through. Furthermore, in this proposal, the team should provide a more specific milestones for \nthe number of months they intend to implement the project when supported. On a whole, I believe this is a great and impressive proposal that can be successfully implemented given the deep experiences and qualifications of the team. ", "q1r": 5, "q2": "The information provided is rich in content and worth the task. I am sure they proposers will give a good job in executing the project when given the opportunity. There is a clear clarity in the description of the problem, the solution and how the proposal is aligned with them. There is an unbiased presentation of the various team members. I love how they all bring something new to the table. They all have specific skill sets. I am impressed that they will be able to scale up this project in the near future.\nThe roadmap is very well designed, there are milestones that make auditing the proposal possible and even much more easier.", "q2r": 5, "assessor": "z_assessor_925", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Cardano Community in Africa needs space to connect with project catalysts and be able to engage, network and discuss within the ecosystem.", "experience": "Will be supported and mentored by Catalyst Swarm, WADA Ghana, CAs, vCAs, Ideafest members, Challenge team members with the goal to support the emergence of an independent CATH Team."}