{"id": 401905, "author": "ht", "title": "Cardano based data collection tool", "url": "https://cardano.ideascale.com/a/dtd/401905-48088", "category": 26442, "amount": 140000, "description": "Because of politics and capacity, statistics in Africa are inaccurate. This creates erroneous policy designs resulting in economic crises.", "funded": 1, "upvotes": 25909681, "downvotes": 14831921, "votes_result": 11077760, "votes_cast": 91, "f6_no_assessments": 4, "f6_rating": 3.583333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7433, "q0": "I found this proposal very interesting and extremely relevant. It differs from most of the proposals found in this challenge, because most of the ideas are about introducing the cryptographic universe to the African population, instructing them, providing free courses, scholarships, etc. I think this is very important, as we know that blockchain is still a relatively unknown technology for most people on the continent, being more popular in the United States and Europe, for example. However, it is necessary that we have proposals of a more technical nature, with more specific objectives, as is the example of this one. The idea is to create a platform that works with the issue of data provision/access, with a lot of quality and security, where users (whether individuals, public or private organizations) have a lot of control over what is accessible and what is blocked. in relation to your data. I found that the way the application was explained was very accessible. In other words, we were able to clearly understand how the activities of this platform would work: they can be done in mobile applications or on the web, users would have two ways to provide their data specifically for a certain category (the so-called spontaneous submission of data) or by creating a form that can be viewed upon request... Anyway, everything that says about what would be done and what the user experience would be like is very clear to the proposal's readers. With this, I can clearly visualize the results of the project, which would be to create an “accessible and reliable way of collecting, curating and sharing data”. The proponent says that this issue of data sharing and research in relation to this is one of the most important and targeted issues in the development of the African continent, according to the African Union, so the project would work with a key issue, very relevant to the locality. With this, we can conclude that the proposal would have a high impact for the African continent, benefiting it, since it would address one of the main current demands there, clearly achieving the objectives of the challenge of promoting African economic and social development. And in relation to how all this could benefit Cardano, from what I understand all the data would be recorded on our blockchain, smart contracts would be made, to access some parts of the application (such as the data of someone/some company that they chose to keep the blocked information) people would have to make payments in Ada and etc. To conclude my opinion, I think that this proposal would have a very positive impact on our ecosystem and meets the objectives of the challenge very well. \n", "q0r": 5, "q1": "Unfortunately, that part of the proposal is not as good as the impact. Starting with the script, we know what tasks will be performed and how many weeks on average they would take to complete. However, I think the detail here should be more in-depth, so that we have a more solid understanding of the development process for this application. I will give an example: in addition to how many weeks each activity will last, the proponent could have placed us on when it would start (in which month) and when it would end. For example, in the case of “Technical Recruitment Team = 6 weeks”, would this start to be developed in May and end in June? If he had explained this issue of temporality better, at what time of year each thing would develop, I think we would have a better understanding of how long the project would take as a whole. It is also unclear whether each task would be done uniquely and when finished the team would move on to the next one or if some activities could be worked on at the same time, by the same or different people. Regarding the explanation of the budget, a very high amount of 140k USD is requested, I think that due to the complexity of the project this amount of money may even be necessary, but it is not understood very well why. This amount is divided into two parts, the first being the team salary and the contract fee. How much would go to wages, and how much would go to fees? In terms of salaries, how would this be shared across the entire team? Would everyone involved receive the same amount, or some less and some more, depending on their training and previous professional experience? How long will each professional work on the project? What will your work routine be like, would each one work every working day, and for how many hours? If this information had been provided, we would have had a better understanding of how the money would be used for the salary issue. As it is presented to us, this data is still a bit abstract. The value of 35k would be used for various things that involve distribution, again reinforcement: it would be interesting to know how much would go to one of the aforementioned parts: “Server and Database, Token Release, Promotion, Release”. Now speaking of the team, we know what kind of professionals would be working here, but we don't know details about them. In fact, we don't have information that allows us to know this team in a basic way, because we don't know their names, we don't know their professional resume, how they got involved with the Cardano ecosystem, we don't have social media profiles like linkedin, where we could get to know them in practice... We don't know who these experienced iCog Labs developers are. Therefore, I think that the feasibility of the proposal has a lot to improve and deserves to be reviewed. \n", "q1r": 2, "q2": "Project auditability is good, although not perfect. We can work here on two sides: that of the development process and that of the final results. Regarding the development process, it is said that progress would be made available in an online project management tool, such as Trello, for example, in addition to github. If these platforms are constantly updated and freely accessible so that any member of the Cardano community can access them at any time, I think the auditability of the process will be well ensured. Regarding the final results, we know what the specific objectives are for a period of time considered shorter and a longer one. It is positive how this information is passed on, as it generates a very solid view of what is desired as a result of this project. However, I would like to make a few more suggestions. The objectives are the complete development of the application, in addition to some quantitative goals such as more than five thousand users in the first year, more than a thousand spontaneous data submission entries and so on. Indeed, it is necessary for us to have knowledge of these numerical facets, but I also think it is important that we know what the qualitative impact of the whole thing was. It would be nice if the proponent, together with some key members of the team, could establish contact with some recurring users of the application to analyze if everything is working properly, for them to carry out general research in order to understand if the issue of data access , once a major problem for the target audience, is being performed satisfactorily. Whether this facet of African development is indeed being improved and has been significantly boosted through this project. This information would need to be collected by the team and provided to the rest of the Cardano community, either through the apps already used to monitor the process or through different means such as synchronous meetings in Town Hall, for example. With this, I believe that the proponent's suggestions on how to audit the project would be increased and we could be more confident about the final impact of this investment. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Thank you for the feedback. On the Feasibility part, you asked why I didn't include dates. “Technical Recruitment Team = 6 weeks”, would this start to be developed in May and end in June? Well, when you work on proposals, of projects which have not started, you will always use weeks. Because the actual starting date is not defined. In our case, for example, we didn't started the project. Yes we have been thinking about this for too long but we didn't. We will start when we have the budget. So Week 1, w2, w3 is how you plan the time. If we got the budget in May 1, then 6 week means June 14.\n\nSecond, tasks are done simultaneously if the time line is the same. In our case for example \n\nRecruiting Technical Team= 6 weeks\nDesign and system Arctecture= 4 weeks\nMVP= 40 weeks\n\nThese means the whole time period is 40 week. Out of this the first 6 week is team recruiting, then comes design and system Arctecture etc. Yeah I agree I should added further breakdown like Back end development, front end, Database, etc. But all these and further details are under MVP. \n\nSalary is for permanent team members while contract is for one time. Amount cannot be the same and it varies depending on specific skill, experience etc. \n\nLast, the cost is high because this is a real commercial product which involves lots of features. The scope is very wide. In truth, if you go to software companies and ask for the price (using this proposal), you will get minimum quarter a million and max 1 million. This is a huge project. \n\nThank you for your comment."}, {"id": 3456, "q0": "For 'impact' section , all information about the solution dealing with the challenge, in other words, the project are given quite clearly. As you can see, the feature and functions of the project are indicated exhaustively. Moreover, team also explains two features of the project significantly in order to voters have a comprehensive vision to this proposal. It is a good point of this proposal. And then, the team also show the way this project solving the problem and all members expose the risks or challeanges when starting the project, but having the solution for this risk. It show their consciencous attitude to this proposal.", "q0r": 5, "q1": "The team gives us the outline, the time for doing this jobs and the main deliverables also. It leads to a chance that the voters follow the project easier. However, the team should give more detailed plans for this proposal, for example, they can narrow down what 'Design and system Arctecture' part is integrated in, this detail will have positive effects on the voters. The part 'a detailed budget breakdown' is quite strecky, proposer should give voters more information as well to ensure that proposal will be clear as soon as posible. On the same way, the team should give names, education levels or experience of core members at least in the last part, but its position.", "q1r": 3, "q2": "This section is quite good, the clear predicted statistic for 'success for this project' give this proposal plus point due to the useful information. It give a specific goal of the project. However, in my opinion, giving KPIs/Key metrics will help this proposal better because the detail in KPIs/Key metrics equals the standards for success of the project.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5557, "q0": "The proposer wants to build a sort of “matchmaking” platform for data collection, where a user in need of some specific data posts a job-like request, that other users can provide and be rewarded with ADA.\nHowever, there is the option of having that data locked for a certain amount of ADA, to which anyone wishing to access that data will have to pay that amount to be able to obtain it.\nBlockchain is permissionless, web3 is open and decentralised, locked information is against all this. I’m in doubt whether to consider the proposal as having a positive impact on the whole blockchain space. There are so many other options to building an open and transparent data collection, as after all, it’s on the blockchain.", "q0r": 3, "q1": "The timeline is detailed and easy to follow, the main deliverables are also well designed. The budget, however, is not broken down into segments, there are only 2 amounts defined, $105000 for tech team salary and $35000 for distribution, but there is no amount of hours needed for development, no price per hour, nothing that can help assess its feasibility.\nThere is a team member list, described as “are going to be provided by iCog Labs which has seasoned developers with the indicated role”, but there are no names and social profiles attached for any kind of verification.\nBecause of the lack of all the info, I cannot assess whether the team is skilled enough or the budget is realistic enough to have the proposal implemented.", "q1r": 2, "q2": "For progress evaluation the proposer has mentioned the softwares Jira and Trello, where the team can manually input the progress they are doing. They will also be having a think tank group of university students to test the sprint results, but there is no mention of where those results will be published. \nThe success of the proposal is well defined, the tasks are on point and sensible.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8181, "q0": "I like the idea of this proposal, according to the proponent that the economic crisis in Africa was caused by faulty policy designs caused by its inaccurate statistics. The solution given is also clear and very well provided as per the suggestion to describe the targeted problem. If this proposal is successfully implemented, it will greatly help Africa in data collection. Community Sourcing Statistics is what Africa needs.\nThe proposal considered the challenges and risks associated with successful implementation.", "q0r": 5, "q1": "Regarding the project development team that will be provided by iCog Labs, these are experienced developers with assigned roles, so I am confident that with this team, the project will be successfully implemented.\nOn the blueprint and timeline for resolution: This proposal provides a road map with a timeline, however, no verifiable timeline and within the funding period , a poorly defined delivery requirement interval. Besides, the cost explanation is not convincing. I agree that this is a big project, it takes a lot of capital to make it, but the budget requires $140,000 more than 50% of the challenge's funding which only 2 lines of explanation will put the community in a predicament. audit difficulty. I understand that asking for such a large budget will make your project run more smoothly, but the budget required here for a salary and 2 year contract is quite long. I recommend you require less capital by shortening this period to 3 months or 6 months. Then, based on the results of this project, you can continue to apply for capital in the following funds that will convince the community.", "q1r": 3, "q2": "Measure progress and develop projects: use project management software (JIRA or Trello) in addition to Github. Project success is also clearly described, suggesting measurable outcomes in the short and long term. However, it would be helpful to suggest if delivery and schedule were broken down further to make it easier to track progress. To further improve the proposal, I suggest to outline important information such as roadmap, estimated key activities in 3,6.9 months and budget allocation details.\nPlease provide information on whether this proposal is a continuation of a previously funded project in Catalyst or an entirely new project: this is a brand new proposal.", "q2r": 3, "assessor": "z_assessor_654", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Create a data collection system fashioned after crowdsourcing that uses Cardano for data quality ranking and rewarding contributors.", "experience": "I am the co-founder of a tech company in Ethiopia that has been in the business of AI R&D for the last ten years. We had developed several AI tools used in data analysis. We have added blockchain technology for data collection tools in the health and media sector since 2019."}