{"id": 402006, "author": "josko.sestan", "title": "ADAxie Eternity in Africa", "url": "https://cardano.ideascale.com/a/dtd/402006-48088", "category": 26442, "amount": 33000, "description": "Bring the Axie Infinity success to Cardano enriching the African Continent through Play2Earn Gaming. Utilise Cardano to pivot to Learn2Earn.", "funded": 0, "upvotes": 23061904, "downvotes": 12821419, "votes_result": 10240485, "votes_cast": 80, "f6_no_assessments": 6, "f6_rating": 2.722222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 7434, "q0": "I liked the idea, but I identified serious problems here. Starting with the name of the project, which makes an analogy with the game Axie Infinity, which was a great boom in recent times, seen as a fun way to profit from cryptocurrencies and thus generate extra income. I don't think it's interesting for us to associate Cardano with the project of an Ethereum-based game, I don't think that would be done with good eyes. The impression that gives me is that we would be trying to take advantage of the fame achieved by this other project in the cryptographic world, when in reality I think it's better that we create our own identity, our mark on the world. The idea itself is a good one, it consists of learning about math in a fun and engaging way while getting rewards in cryptocurrencies. However, this idea should have been better explained. What would the game be like in practice? Why would it be built especially for an African audience? Would it be available in native mainland languages? What would be the teaching methodology? How would the games be? Would it be an online game? How could we prove that players actually learned math and the other things the game seeks to teach? What would the rewards be like? Would the player have to make an initial investment, as in the case of Axie Infinity? There are many doubts that remain, and I cannot see clearly how this proposal could benefit the African continent (since it is not explained how the game would be aimed at this audience) and also help to expand the Cardano ecosystem (by fact that the idea is not well explained, we do not know which technologies of our blockchain would be present here and etc). Anyway, in general, I think the intention is good and can be quite profitable, but in practice I am not sure about the impact of this proposal, due to the questions raised so far. \n", "q0r": 2, "q1": "The viability of the game is very low, unfortunately. Starting with the fact that we don't have a script. We only have the goals to be achieved annually. Most of the proposals that I have evaluated so far in this fund measure the temporality of their timelines by quarter, which I already thought was a very long time. Who will say for years... I would like at least the year 2022 to be well detailed. We know the goal is to “design and implement the project framework for deliverables”, but what tasks are required to achieve this? It would be necessary for the proponent to explain what would be done monthly, which steps would be carried out, detailing how the design and implementation of the game would take place. Unfortunately, the script is too abstract, not allowing us to have a reasonable view of the process. Regarding the budget, the amount requested, according to the proponent, would be enough just to start the game, this is very worrying because we don't know what its total value would be, for example. It would also be necessary for him to detail how the 33k would be used, in which parts it would be divided, how much each professional involved in the project would earn, in short, why do we need this amount to start this project? Unfortunately, we also cannot believe if the funding requested is fair and compatible with the project, because we hardly know what is to come and we also don't know how this money would be subdivided and used. And finally, we are not introduced to any team, we are told that here would be an initial team that would later partner with the WADA group, already famous here at Catalyst for promoting proposals in the Africa challenge, always present in the background. We would need to know exactly who these people are, their names, a brief resume of what they have done so far, how they relate to the Cardano ecosystem, their roles in the project, their linkedin profiles... In this way, we would have a solid knowledge about who we're dealing with. So, I'm going to give the minimum grade for the feasibility of this proposal, because there is no well-planned roadmap, there is no explanation of the budget and there is no presentation from the team, the things we would need to understand in this topic. \n", "q1r": 1, "q2": "According to the proponent, progress will be measured by “the number of daily participants at all community meeting points”. What meeting points are these? I think that this statistic is not enough to accurately measure whether the project development process is adequate. We would first need to have a roadmap, and based on it, establish direct contact with the team and verify that each phase was being carried out as planned. If the work routines were being fulfilled and if the partial results were being achieved. Regarding the final goal, the proponent says that the plan is to have millions of young people playing ADAxie Eternity, however, this goal is quite ambitious and difficult to measure. It would be interesting to think about aspects closer to us, such as if the game has brought new members to the Cardano community, if it is in fact bringing a new source of income to Africans, if it is helping them to learn mathematics, so if the education is improving organically in the chosen location... Anyway, I think it would be necessary for us to elaborate more tangible goals, let's say, than the idea of ​​having millions of players. That may even happen, but until then, we have small achievements to measure as well. It is necessary for the Cardano community to have contact with the game's team, through video calls, online platforms such as Notion, Miro or google docs, for example, in short, some way to establish this bridge. In this way, I believe that the auditability of the game would be much better done, I consider that the monitoring suggested by the proponent is superficial and does not meet well what we would need to know, both in terms of auditing the process and the final results. \n", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2440, "q0": "•\tThe goal of the 'Grow Africa, Grow Cardano' competition is to raise Cardano awareness and knowledge in Africa. This concept aims to provide a source of revenue for African countries by rewarding participants with cryptocurrency in addition to the money they make in real life. Cardano is the finest blockchain, and the proposer agrees that his idea would be effective in moving millions of underprivileged Africans out of poverty and into a sustainable and rewarding Cardano Eco System, making Cardano the Gamers' Choice of Blockchains. When you're a part of a community, you get some insulation eventually, and how much more Cardano which is the finest community there is.", "q0r": 5, "q1": "The proposer has the relevant skills needed to carry out the plan with the indicated budget which is reasonable to execute the plan. The team proposed show clear signs of capability. The proposal has a clear implementation strategy and indicates some challenges that could be faced during the implementation process. Thus, Given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "•\tThe proposal offers enough information to audit and evaluate the project's progress toward its stated goals, since it elaborates the implementation techniques and success measurement criteria, thanks to the well-developed material from the effect and feasibility categories.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 3119, "q0": "This proposal aligns well with the main objective of the challenge, because it aims to provide an option for African peoples to supplement their income through a play2earn game.  \n\nAxie Infinity game is listed as the inspiration for the proposal’s Cardano-based equivalent.  Axie Infinity has been covered regularly in both crypto and occasionally non-crypto media, generally credited with making a positive impact by providing a means of supplementing players income, particularly in the Philippines where it turned into a relatively lucrative phenomenon.  \nIt should be noted that knowledge of the long-term sustainability of Axie Infinity’s game economics is limited to Dec 2019 onward.  This is the date the alpha of the game was released in Dec 2019.\n\nA successful Cardano equivalent of Axie Infinity would be expected to similarly benefit players, at least over a similar time period.\n\nThe proposal states the learn2earn concept is similar to a crypto reward system used by education centric website Brilliant.org.  However no link was provided of this activity by Brilliant.org.  I web searched Brilliant.org and cryptocurrency but was unable to find any crypto learn2earn mechanic offered by the business.  If sustainable and successful learn2earn systems exist, links should be provided in order to gauge the viability of this idea in relation to meeting the grow Africa challenge.", "q0r": 4, "q1": "The proposer does not list any direct, in-house expertise in any game or Cardano development, rather relying on future contracts with external groups to assemble a team with the necessary expertise. \nThe proposer aims to procure the services of a recognized and established producer of NFT’s (Afrixx) to develop the game characters.  Provided Afrixx is in agreement with this work (not specified in the proposal) the NFT component is likely to be completed.  Afrixx have a track record of successfully releasing NFTs.\n\nThe proposal mentions onboarding the West Africa Decentralized Alliance (WADA) for game development, but gives no specifics on the groups expertise or track record in game development.  Also to consider, play2earn games require varied expertise in such areas as economics in order to balance a sustainable in-game economy.\n\nThe proposal mentions transitioning from play2learn to learn2earn.  It is difficult to understand from the proposal how this would work successfully as both systems would be fundamentally different.  A transition is likely to alienate users who enjoy playing the game and have no desire to turn it into learning time. Learn2earn would likely require a completely separate ‘game’.  If the goal is to develop multiple games, beyond the original “ADAxie Eternity”, the proposal should make this more clear.\n\nThe financial budget is not broken down by specific use.  How much of this budget will be spent on web development vs NFT development vs initial game development?", "q1r": 2, "q2": "The proposal provides a very broad roadmap ending in 2030, but is very light on target dates for the funds being currently applied for.  No month, or quarter-year for website development completion, NFT completion, core team onboarding, game development (alpha / beta) is provided.  Only whole years are listed with broad descriptions.\nThe proposal aims to ensure free primary and secondary education while listing a KPI of success being the proportion of young people, up to lower primary level, achieving a minimum proficiency level in reading and mathematics.\nGiven most nations have public schools, it would be difficult to identify the success of this KPI from people learning via public school vs the game’s learn2earn.\nA clearer list of immediate KPI’s are needed, relating to the initial funding applied for in this proposal.\n\nTargets and KPI’s are omitted for the play2earn functionality of the game.  These should be added.", "q2r": 2, "assessor": "z_assessor_1614", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3457, "q0": "In the impact section ,the proposer presented the idea as well as how to implement the project in a general way. In addition, the proposal also presented the relevance and impact on the Cardano exchange. However, in the second part, the proposer presented a rather sketchy presentation. The team can add how the game works or features to make it better understood instead of just saying 'Cardano becomes Gamers' choice for Blockchains!'. In addition, for the risk part, the group has only given the risks but has not yet had an appropriate solution. Proposer should give more information.", "q0r": 4, "q1": "When the 'feasibility' section is looking at, this proposal is lacking a lot of information, even the information provided shows sketchy. First, the timeline is too far away, and the outline is not clear enough for the voter to visualize the steps to implement the plan. The founder should add detailed activities for each year of the plan. In addition, the section 'a detailed budget breakdown' is presented so general that the voter does not know the direction of the cash flow, this should be changed. Moreover, the 'team members information' section should be given more attention, if the team has not completed the members, the proposer can introduce the existing members even just one person.", "q1r": 2, "q2": "Similar to the 'feasibility' part, the 'auditability' part is also ínignificantly written. 'Auditability' shows the outlook after the project is selected and operational, so predictive metrics are always of paramount interest. But that is not shown too much in this proposal. Proposer can consider adding statistic goals to improve the proposal further", "q2r": 2, "assessor": "z_assessor_1652", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4281, "q0": "The proposer has provided some information about the project which is a Learn2Earn game. They have briefly mentioned some features of the game. However if they could bring out some guides of how to play the game it might be better. When describing how their proposed solution would address the challenge, I did not see them showing any KPIs or key metrics to check if they are aligned with the challenge's key metrics. About the possible risks, they did not mention anything but instead they showed that they would do everything to build a strong startup. ", "q0r": 3, "q1": "It can be seen from the proposal is that they have prepared plan till the year of 2030. That is a pretty long term goal. However they have just given a budget of Researching and Designing to create a Business Plan which is to be presented at next Funding round. They did not show the detailed budget breakdown of the project they were writing proposal for. About the team members, they just mentioned some positions relating to the project, not giving any specific name.", "q1r": 3, "q2": "About how to measure the progress, they would just use the number of Daily Participants across all community gathering points. The proposal should have mentioned more number than that, readers will know about method they use to track the process. What the success look like was expressed. One more thing, I still need them to clarify if this is a whole new project or it belongs to a funded one before.", "q2r": 2, "assessor": "z_assessor_1714", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4486, "q0": "This project's concept  is quite intriguing, and it will partially correlate with our challenge setting. This project, as a learntoearn initiative, will both promote user participation in the Cardano ecosystem and have a beneficial influence on African nations by assisting users in learning information and skills that can be implemented in their daily lives. We will require you to do a more in-depth analysis of the project's features, such as what topics are the lessons? What is the NFT rate received after each level of the lesson? Do we create groups for users to exchange knowledge? Etc. You need to clarify more about the KPIs that the project wants to achieve, thereby making a prediction about the project's impact on the Cardano ecosystem clearly and with evidence. As for providing risks and solutions, we will need you to make predictions about possible technical, communication or organizational difficulties. Attached are the solutions you can think of and provide to solve those problems convincingly.", "q0r": 2, "q1": "You already have long-term plans, but we'll need to know what to do in detail. You need to clearly state what the steps must be completed in each specific phase, and how you plan to do it. For example, what model do you plan to design the game according to? What programming language will be used? What are the KPIs and targets to be achieved in each stage? How will you execute the marketing campaign? By what channels? Etc. In the same way as above, the proposed budget will have to be reasonable and accompany each task The budget must be broken down and clearly presented for each stage of the project. For example, how much is the budget paid to programmers? How many people is that budget for? For how many working hours? What is the advertising budget? How will it be used? And so on. Information about team members must also be provided. Since there's only one person right now, you have to specify how many more people you need to hire, and what skills or experience will they need to fit the project? How long do you plan to take to find enough people for this project? After that, you need to specify basic information about team members such as experience, skills, projects they have been involved in, etc. You can also provide more LinkedIn profiles for us to easily verify members. By providing all of the above information, we will be able to assess whether your plan can address your goals.", "q1r": 2, "q2": "First of all, we'll need you to provide clarity and detail on how ca we track the project, for example: any tools or websites where you publish reports on project progress, expenditures and follow-up plans. Besides, difficulties encountered during project implementation should also be recorded, you can find solutions by yourself or get consulted by the community. Secondly, The success of this project lies not only in the number of users, but also in the number of loyal users, the practicalization of learned knowledge in order to improve the quality of life, thereby raising awareness of the benefits of this project and also benefits of joining the Cardano ecosystem. The number of NFTs earned is also part of the success of the project to increase income for Africa nations. In conclusion, by providing all of the above information will help us ensure the seriousness of your goals for this project.", "q2r": 2, "assessor": "z_assessor_1726", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create a source of income for African nations to reward players with Cryptocurrency supplementing the income players earn in real life.", "experience": "An entrepreneur who formalised his business experience with a Post Graduate Diploma in Business Studies, my main qualification is running a business. I have wanted to help 3rd world countries create wealth and banking for the unbanked."}