{"id": 403662, "author": "jerrybnj", "title": "Mass Cardano Education for Students", "url": "https://cardano.ideascale.com/a/dtd/403662-48088", "category": 26442, "amount": 26000, "description": "Education is key to adoption and use of a service. How can we educate students in Northern Ghana about Cardano Ecosystem and its benefits?", "funded": 1, "upvotes": 37671813, "downvotes": 13435301, "votes_result": 24236512, "votes_cast": 158, "f6_no_assessments": 10, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2368, "q0": "This proposal effectively addresses the challenge setting. It takes into consideration the problem identifies and how to take care of it. There is a clear explanation of the problem setting and the solution to this has been clearly explained. The problem that may arise as a result of the proposal has been stated and a solution to mitigate it has been put in place. This effectively improves the number of people in the Cardano community and the ecosystem in considering there will be the training of proposers, community advisers, and in their interest voters and many other. This proposal however does not consider the collaboration with the African Catalyst School and the Catalyst School in general. ", "q0r": 4, "q1": "There is a clear and detailed breakdown of the budget of this proposal. It takes into consideration 8 items necessary for the project when funded. Even though not very detailed in explanation, it looks reasonable. The only item that may seem over estimated is the printing of Cardano branded T-shirts. Amounts should be revised.\nThe road map is not detailed. It can be made to go a long distance but is short. This to  me is not reasonable. \nThere is much experience for this proposal also. \nThe Proposers should consider collaboration with Catalyst school and The African Catalyst School to reduce the cost of resource persons invited to teach. \nAside this, and given their experience and plan presented, the propposal is likely to be implement to succcess.", "q1r": 4, "q2": "There is a clear metric to track the progress and the achievement of the proposal when started. it has a clear definition of what should be expected and what they consider to be a success. \nThere is no way to know how many proposal, community adivers and developers they expect to come out of this project. There is no system of survey to measure how the student will like this and if they will want more since theeducating should be perpertual and not one time in the north.", "q2r": 3, "assessor": "z_assessor_1478", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2441, "q0": "The 'Grow Africa, Grow Cardano' challenge aims to increase Cardano awareness and understanding in Africa, therefore holding community events to educate roughly 2,000 tertiary and high school students in northern Ghana about cardano and its benefits would assist to achieve this goal. The principles of the Cardano blockchain and its use cases will have a big influence on the African even as they leverage the potentials the Cardano ecosystem is bringing to their doorstep, thanks to enormous awareness creation and education in Africa, particularly among the youth. Hence this proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer is a skilled IT expert, lecturer, and blockchain educator who has trained over 500 young students in the field of cardano blockchain and the potential accessible via Wada's assistance over the last years and has the requisite ability to carry out the proposal. The team members required to carry out the proposal have been identified by the proposer. A realistic schedule for finishing the work is also included in the proposal, as well as a clear and actionable implementation plan that indicates what is being done and how it is being done. The proposer has considered the difficulties that may develop during implementation and has proposed potential solutions. As a result, the issue solution suggested has a good possibility of being adopted.", "q1r": 5, "q2": "The key indicators for measuring the progress as well as the success metrics are clearly stated and are understandable and achievable. The proposal includes a time frame for completion and also includes a clear explanation of the targeted problem, as well as a solution that solves the problem in a comparable manner. Thus, the information provided is sufficient to audit the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 2599, "q0": "The problem stated in the proposal aligns with the challenge. This is a well thought proposal for the youthto be educated in blockchain and crytocurrencies. Most folks in Africa thinks blockchain and crytocurrencies issues are scam and therefore the solution to the problem stated in the proposal which is educating 2000 tertiary and high school students will go a long way to enlighten them and clear that misconception. This in the long run will help attract more individuals into cardano blockchain through project catalyst when they learn about the opportunities available in the cardano ecosystem.", "q0r": 4, "q1": "Given the experience presented,I believe it is very likely that this proposal will be implemented. But then with their timeline (1-3months) and the number of people they want to educate,it might stretch the timeline,they will need more than 3 months to educate over 2,000 individuals.\nAgain,the team provided a sample content outline to be covered during the conferences they will hold,this only shows how serious the team is towards implementing their project if this proposal is funded.\nLastly,I believe the amount requested in the budget is reasonable. The budget breakdown explains how the money will be spent and again,any risk which will hinder the success of the project when funded will be curbed In time as stated in the proposal.", "q1r": 4, "q2": "Firtly, the information provided about wada which is a reputable organization in the cardano ecosystem is a prove that the progress of the project if funded will monitored appropriately since wada will lead and supervise the project.\nThere is also clarity in the description of the problem stated in the proposal,the solution to the problem and how it aligns with the challenge. The metrics were well chosen and I believe they are good indicators for evaluating success of the project as the outputs will clearly indicate the number of individuals participating in the conferences which will be organized by the team, output in the sense that if there are majority of people who attended the conference joining cardano,a good number of them  becoming community advicers on ideascale,a good number of them also bringing ideas to form proposals then success would have been measured. ", "q2r": 4, "assessor": "z_assessor_1537", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3053, "q0": "This proposal actually aligns with the challenge and measures on how to address the challenge are being clearly spelt out. Find it very brilliant how this proposal seeks to organize students from the university and senior high schools, being able to reach out to about 2000 students would be something huge for the cardano ecosystem and the plan to get some of these students to become Community advisors in reviewing proposals is impressive and has the high opportunity of scaling  high in the future in the cardano ecosystem. This proposal looks promising for the future. ", "q0r": 5, "q1": "The presence of team members of about 2 is totally in order, with this kind of project in its nature the addition of many team members will not really be necessary, so I think the number of team members for this project is in order. With the provision of links to the proposal is also appreciating and makes everything this proposal seeks to achieve clear and not vague.  And regarding experience of members makes this project achievable since experience counts, I appreciate  the fact the time line ,roadmap for the project execution has been added to the proposal, a good proposal always includes these , I appreciate that addition, and also the addition of the budget and breaking it into smaller components for easy comprehension and clarity is also very impressive, well done to the team for these additions. \nthe budget for this project is totally understanding.  Well done. ", "q1r": 5, "q2": "The inclusion of key metrics or key performance indicators is commendable and the clarity on how success would be looking like in this proposal is brilliant and worth commending, I appreciate the fact that the team included the challenges they would face in the execution of the project, this prompts them on how to plan ahead of time and to provide timely solutions to the challenges they may face. In all this proposal is promising and when funded would bring the awareness of cardano to a large number of the Ghanaian youth since learning is continuous they also pass the information on cardano to friends, neighbors and all people closer to them and by so doing the awareness of cardano scales higher, good and promising proposal ", "q2r": 5, "assessor": "z_assessor_1603", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3099, "q0": "The intention is to inform the youth about Cardano and its advantages. For example, people are familiar with the concept of Cardano from an early age. They will tackle this by informing about 2000 schools in Ghana. If these information sessions could take place every year, Cardano would no longer be unknown to the population. The proposal may have an impact on the Cardano ecosystem in the longer term. They are now starting with 2000 schools in Ghana, in the long term it may be possible to expand to other areas in Africa. The main problem identified in the proposal is the delay factor. Arrangements must be made long enough in advance for the sessions to take place. It is good that statistics are included to measure the impact. It would be helpful to publish the statistics publicly on social media platforms (number of students, students becoming active community advisors). The sessions should inform the students about the possibilities that Cardano has. This creates a consciousness.", "q0r": 5, "q1": "Jeremiah Baani has already started this project without getting any funding in Fund7. He gets support from the Wada team. His relevant experience and skills are hard to trace on his twitter. A timetable is included which includes 1-3 months to achieve the objectives. It will certainly be feasible to involve 1000 students. It is good that the information that will be treated is present (evolution of money, blockchain technology,…). There is a budget that includes the costs. I think the budget to have T-shirts printed with Cardano is very high (4500 dollars). It is good to provide rewards for the participants to motivate them. In order to complete the project properly, the delay factor must be taken into account. Some documents can be approved with a delay. The advantage is that this project is already underway. Only additional financing is required.", "q1r": 4, "q2": "The proposal states that the KPIs of each funded Wada proposal will be included. It would be useful to include these factors in the proposal. The timetable lists a number of goals to be achieved (200 CAs, reaching 1000 students). There are rewards to motivate people for this project. It would be good to do some sort of test at the end to see if people understand the content. In this way it can be checked whether the information is understandable for the young people. At the moment there is too much ignorance about Cardano in Africa. This proposal gives young people the opportunity to discover Cardano very early. The chance that this will make young people more likely to choose their study choice towards technology is greater.", "q2r": 4, "assessor": "z_assessor_1606", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4524, "q0": "As the goal of the challenge is to seed and grow Cardano in Africa, this proposal fulfils the challenge setting. I like the fact that the Northern part of Ghana will be benefiting from this initiative because they make up the minority and so are often left out when such opportunities are provided. The return in investment to the Cardano community will be very great if this plan is executed perfectly. So, the proposer would really have to put much effort than usual in this. Overall, this proposal effectively addresses the challenge.", "q0r": 4, "q1": "The content for education is relevant and beneficial. Though the team members have the right skills and experience to work on the project, I feel the time period allocation to executing the plan should be reconsidered to at least 3 months instead of just 1-3 months. That would give them the adequate time to ensure they get a higher return than what they are investing.", "q1r": 3, "q2": "The proposer seems to have interchanged the answers of the question (Please describe how your proposed solution will address the challenge?)  with that of (Please describe how you will measure the progress and the development of the project) and so he should recheck it and make the necessary corrections. Nevertheless, the metrics presented are clear enough to be used to audit the progress and success of the proposal.", "q2r": 4, "assessor": "z_assessor_1744", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4849, "q0": "In this proposal, the team is focusing on educating about 2000 tertiary and high school students in Northern Ghana about Cardano and its benefits. \nThe impact is that some percentage of students will become active community advisors, percentage of brilliant proposals submitted by these students to solve local problems in their communities; students that become referrers, students that become proposers, students that successfully create native Cardano wallets and participate to vote for proposals. \nThe main risk cited by the proposer is that institutions may not approve letters for the events promptly and might cause a delay. Solution provided by the proposer is to send letters quite early to the institutions. The details here address the change effectively and therefore I rate it 4.", "q0r": 4, "q1": "The plan detailed states that they will use 3 months to implement the proposal. They will reach out and educate at least 1000 students in the Northern part of Ghana through conferences / meetups. Participants will become ore knowledgeable and aware about opportunities that the Cardano ecosystem offers. \nThe budget breakdown is comprehensive and costs are seen in different categories as transport, publicity, printing of branded t shirts, etc. \nThe team of two experienced blockchain teachers mentioned as Mustapha and Jeremiah are Cardano Blockchain experts with Wada Ghana and they can successfully implement the program.\nThis is a new proposal. I give a rating of 4 .", "q1r": 4, "q2": "During the progress of work, the proposer has  indicated that they will draw on the leadership and supervision of Wada Ghana towards successful implementation.\nSuccess is seen in the mass onboarding of students an participation through project catalyst- CAs , Proposers, Voters. There will emerge local developers who will start learning how to program in Haskell. . With these detailed information, I rate this part 4. \nThis proposal can have a significant impact on the lives of the people in the area so I recommend it for funding for a good job.", "q2r": 4, "assessor": "z_assessor_1786", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6000, "q0": "This proposal is in line with the challenge setting. The proposer would work to reach out to over 2000 students in Northern Ghana to introduce them to cardano and the ecosystem. By doing so, students would be encouraged to participate in catalyst in whatever capacity they see fit, whether it be as proposers or community advisors. Meetups and conferences will be held to get the attention of the students, which I think can have a big impact on the future of cardano in Africa. Getting students interested in cardano from a younger age can inspire them to work towards making an impact on the ecosystem and their own communities. If the proposer reaches out to higher education students, then they will be likely to get involved with cardano sooner because they may have some technical knowledge that can be channeled towards developing catalyst proposals. I see this proposal checking all of the boxes for the challenge setting. (score given: 5)", "q0r": 5, "q1": "Given the information provided, I think that the proposal will be successfully implemented. The proposers have the necessary skills to make this proposal come to life. For example, they have skills in IT services, lecturing, and blockchain education. All of these skills will be necessary to teach students in northern Ghana. With regards to the roadmap, I think that it is easy enough to follow. The proposers will use 1-3 months for the entire project, which includes reaching out to schools, teaching at least 1000 students, and training at least 200 students how to be community advisors. The proposal team plans to host 15 community events. I think that this number is pretty ambitious, but is achievable in the timeframe given. It would have been nice to see more of a detailed timeline, but I understand that the details haven’t been finalized because the proposers will reach out to the schools after being funded. The proposers did acknowledge that the schools might not get back to them in a timely manner, which could affect the progress of the proposal. However, they did also mention that they will reach out to the schools first, which should hopefully limit this issue. With regards to the budget, the proposers have provided a well thought-out list of costs that will be covered by the funding requested. It is very easy for me to see what funds are going where, which gives me confidence that the proposers understand what they will be doing. (score given: 4)", "q1r": 4, "q2": "Given the information provided, I think that this proposal can be auditable, but it is lacking some key information. The proposers mentioned that they will have supervision from Wada, a well-known proposer group in this space, who frequently provide good reporting for auditability. Additionally, the metrics of success include mass on-boarding of students who will participate in catalyst, the number of local developers who learn Haskell, and the creation of dapps by those local developers. These are all very good goals, but I would also encourage the proposer to have some additional quantitative KPIs. For example, how many students who get involved with catalyst after attending a session would constitute success? How many developers? Unless the proposers maintain contact with the schools or students and can conduct some sort of retrospective survey, I imagine that it would be hard to check up on each participant to see whether they are involved with catalyst or not. My last question is, how will this information be shared with the cardano community? Is there a plan in place to present a post-completion report? What platform will be used? In the future, the proposers could address these questions to greatly strengthen the proposal. Even though this proposal is backed by Wada, more information could be provided for voters to better understand this proposal from an auditability perspective. Since I have so many questions regarding potential improvements to auditability, I can’t say for certain whether the proposal will be fully auditable in its current form. (score given: 3)", "q2r": 3, "assessor": "z_assessor_310", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6928, "q0": "The youth are pillars of every nations development and the target for a mass education for tertiary and high school students on cardano and catalyst is very essential especially for the people of the northern regional part of Ghana and the cardano community. I duly support this course.", "q0r": 5, "q1": "The proposer in his capacity has already been able to educate about 500 individuals and with his experience as a seasoned lecturer/teacher and other team members can be able to achieve the said goals of training and educating about 1000-2000 more students having given funding. Also the requested budget to get work done is reasonable to be considered.", "q1r": 5, "q2": "A reputable body[wada] its Leadership and supervision stated in this proposal will see to it that the work is well done. Excerpts shown of previous successful training events also shows how efficient this project would be carried out.", "q2r": 5, "assessor": "z_assessor_497", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 10489, "q0": "This is a very good and timely proposal. I believe the greatest challenge facing most young people in this part of Africa is nothing than ignorance and misinformation. Some young people have fallen for scammers and fraud activities in trying to be adventurous. And so they seem to be reluctant about the need to get unto the Blockchain and it's attached benefits. This proposal will be a panecea  to this long held myth. The way to go is education. That is why I think the proposers were able to actually identify the right solution to the problem of ignorance about Blockchain and Cardano for that matter. Education is key to adoption and use of a service as far as Cardano is concerned. The proposers solution of educating students in Northern Ghana about Cardand it's Ecosystem and its benefits is one that is not only laudable but in the right direction. This will also be scaled up in other regions of the implementing country.", "q0r": 5, "q1": "This is one proposal I am inspired about because of the experiences of the proposers. Their experiences shows they are capable and have also partnered with WADA for several other activities that involves Mass Education of people about the Cardano ecosystem. The can see from their plan that it does not offer any technical difficulty or oppositions, I think this is because their concept or proposal is more focused on offering the right education of students in Northern Ghana. And so when this students are properly educated they can help broadcast across to all about hoe Cardano work and the opportunities that exist.\ncurating information/data on a website. I however suggest you bring in specifics with the timing of the implementation of your proposal. Create definite timelines along side the various activities.\n\nAlso, as they raised the timing for some institutions to respond to their letters as a major concern, I suggest you work with the Metropolitan Director of the Ghana Education Service to ensure they give you approval before you move to deal with the schools. It will be much easier this way and help remove the issue of delay.\nIn conclusion I think the proposers have a good plan and a proposal that when they are assisted will help implement and be successful. I therefore score them 5.", "q1r": 5, "q2": "With this problem I see there is much understanding in the  manner the proposers stated their problem, and further went ahead to provide their  solutions and how effectively their proposal is associated with them.\nThe roadmap however need to be more specific with definite timelines though is it's stated the proposal will be implemented with 1 to 3 months. There are also Key Performance Indicators that I think will make auditing the proposal much more possible and effective.", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Organize community events to educate about 2,000 tertiary and high school students in northern Ghana about cardano and its benefits.", "experience": "As a skilled IT professional, Lecturer and a blockchain educator over the past years I have educated over 500 young students in the area of cardano blockchain and the opportunities available through the support of Wada."}