{"id": 404579, "author": "ja10", "title": "Accel. Train the Trainer Africa MVP", "url": "https://cardano.ideascale.com/a/dtd/404579-48088", "category": 26442, "amount": 33800, "description": "There is a lack of support infrastructure for developers in Africa to create sustainable purpose-led businesses. ", "funded": 0, "upvotes": 17926530, "downvotes": 13954109, "votes_result": 3972421, "votes_cast": 93, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=25312"], "media": [], "f6_assessments": [{"id": 3110, "q0": "The idea of ​​training coaches for the implementation of projects seems to us to be quite relevant, given the enormous challenges that make up a grandiose project such as the social development of a community, where numerous factors such as geographic, social, political, cultural, etc., that make of each region a specific universe to be explored in a sustainable way. I find it interesting that the candidate himself exposes his personal goals, as a way of evaluating the possible engagement in a collective project, since his personal motivation will be a decisive factor for his success in a collective project. We know that the success of a class in any type of learning is essentially influenced by the motivation and donation of the teacher in each subject. Well, whoever applies to work on a particular project can himself provide information about his own abilities, advising project managers in choosing the best role to be given to him, according to his profile, which he himself can better define. I also consider it interesting that there is an initial online training, which allows people who may not be locally so close, to collaborate with the structuring of a project for the community, because sometimes people who are geographically distant have ideas to add, when they were already idealizing sustainable solutions and proposals for solving common problems in different regions of the same country, but with similar difficulties. And nothing more natural than the search for partners that have more experienced members to train new trainers for projects based on blockchain technology, aiming at the structured formation of technology knowledge in the implementation of developer projects. And when it is proposed: “Participants will be invited to observe an existing acceleration program before going through the program”, one can see the intention that the participant starts the work already carrying some baggage by observing how an acceleration program works. development. They can acquire the ability to leverage learning by observing the experience of others on a similar and earlier project to adapt their successful tools (in addition to avoiding those that notably did not achieve their goals) in order to achieve more solid and faster implementation of your proposition. Another interesting idea is that these people who will be trained for the development of a project in a given region, can be used to develop similar projects in regions that have different general conditions from the one where the initial project was implemented, and even in other countries, as the accumulation of experience will give you the ability to promote the necessary adaptations for the best use of the development idea, in each location of your new implementation. In addition, these trainers will be able to solidify those interested in participating in the projects, the fundamentals of work based on blockchain technology.", "q0r": 5, "q1": "Although the project's construction stages have been well established, and the distribution of resources for each one is coherent, the deadline stipulated for each one seems a little short, considering the complexity of each stage. The most appropriate solution seems to them to be to extend the hours dedicated to each project a little more, without, however, generating more burden for meeting the objectives. Perhaps a 25-30% increase in the proposed time for each step is better suited to meeting the schedule. As for the quality of the team, what seems to us is that the group is solid, made up of people who have years of experience working in similar areas, who can really do what they set out to do. The experience reported by each member of the team seems to us to be quite satisfactory in relation to the purpose of the work, mixing members with decades of experience in this type of work with younger and evidently qualified members regarding the proposed work. As it is not the first proposal of the group, which has already had a previous project financed, within the same line of work, we consider it quite positive that they already bring a background to the development of the new project, which is an extension of a previous work, through which they have certainly gained some experience in the sense of training coaches in development projects. In addition, the fact that they have already presented a previous proposal, within the same perspective of working with blockchain technology, enables them to promote the development of the project that meets the interests of the Cardano community. One way to improve reliability in the team would be to associate a link to the conference with the information collected, such as platforms for curricular presentation and professional experience, such as LinkedIn. The distribution of resources for each stage seems to us to be coherent and proportional to the degree of technical knowledge that must be fairly remunerated, for the composition of each phase of the work. The detailing of the stages is well done, leaving only the considerations about the hours allocated for each one of them, in the development phase of the project itself. The phases are well established and linked to the objective to be achieved.", "q1r": 3, "q2": "This is a phase that seems to us to be easy to apply, for what the project proposes. Once the number of trainers reached is monitored; the number of projects they will be able to manage; from the number of people attracted and effectively involved in the projects they manage, and from the measurement of the results obtained, such as goals for each project, the monitoring of results seems to us to be quite reliable in terms of auditability. The proposal made to record results obtained in the short, medium and long term seems to us to be very clear and easy to follow, where the team already demonstrates the means by which they can be verified and monitored. The proposal to leave room for follow-up and suggestions from other members outside the team, for ideas arising from the community and also from the IOG project coordinators, for the improvement of processes in the improvement of the project, leaving open the possibility of modifications such as additions that bring gains to the functioning of the process, it also increases the reliability of the project, as it exposes the intention of constant improvement of the initial project, with the members being attentive to the innovations that can be added along the way. The proposal for the possibility of adaptations throughout the development of the project, without renouncing the solid foundations necessary to achieve the objectives, indicates a very positive aspect in the authors' proposal. The final objective, which is to encourage the implementation of new projects assisted by highly qualified coaches to support the development of these new projects, can also be measured over the years, when each successful project mentions the support received for its formation. . Finally, the monitoring of project results seems to us to be organized, reliable and perfectly auditable.", "q2r": 5, "assessor": "z_assessor_1612", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2691, "q0": " I agree that the proposal will help to grow cardano faster since most of this developers and NGOs mostly pay for online courses and programs purposely to build their capacity and that of their staff, the target group ( Developers) is rightly selected and will continue to make cardano serves relevant to many.  ", "q0r": 4, "q1": "The proposal is able to spell out clear time lines it will carry out every activity that sums up to 18 weeks, this time frame is enough to carry out activities propose and much experts are available to implement the program.", "q1r": 4, "q2": "The proposal has a clear matrix from enrollment of 'Developers', training and completion of project which will be contained in summarizes report for cardano community to review.\nAlso, the proposal anticipates weekly engagement with stakeholders of the project, of which feedback on project outcomes will be reported to cardano coordinators appropriately. ", "q2r": 4, "assessor": "z_assessor_1554", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8030, "q0": "The lack of infrastructure that affects growing businesses in Africa is an issue in this challenge. I see real value in providing a trainer training course to government organizations in Africa that can help corporate entrepreneurs streamline business operations, increasing the potential of the system. cardano's ecology with more users. Proponents present an easy-to-understand solution that clearly shows us their problem and the perfect solutions to solve it. I have no doubts about their proposal, if successful this proposal could have a huge impact on businesses that make the Cardano community even stronger. The proponents identified the risks and challenges they also cited in great detail in the challenge, showing that they know what they need to do next to make their project better.", "q0r": 4, "q1": "Proposals are defined with clear and reasonable timelines. The proposal details a roadmap to the tasks for each stage and the estimated time to complete the project within 8 weeks, time frames are given for each item to be addressed. A group of 10 trainers is expected to participate in this process, the roadmap for implementation is clearly described in terms of the issues to be targeted. With a suggested amount of $33,800, the author's budget has been divided into reasonable expenses. But here I have not seen that my project has a forecasting method, according to me, the team should leave a little amount of estimated money so that when the project arises, there is still more money to spend. I appreciate their team I do not doubt the experience of the evangelists. Individuals and teams of companies have certain professional experience. I believe that with the experience and the proposed presentation plan, I have given a lot of practical information, enough capacity, and authority to help the project implement successfully.", "q1r": 4, "q2": "Metrics are clearly stated, it is suggested that there is a clear mention of KPI / Number of trainers, number of subscribers, number of completers the author lists these metrics for the duration of the project Processing. Holding weekly project management meetings, reassessing progress against the project roadmap communicated through Catalyst coordinator meetings is a great way to help people keep track of the project in 1 more general way. The success of the project is divided into two phases: short-term and long-term. The indicators are listed by the author. The proposal to correctly address the challenge if the project is successful will increase the Cardano ecosystem and help the business grow more. The project has been funded at fund 7 with a score of 3.87 points, the project continues to implement and apply for funding at fund 8.", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Adapt our proven purpose-led accelerator into a ‘Train the Trainer’ model for African NGOs, as a blueprint for other developing regions. ", "experience": "As Impact focused experts we run high growth coaching & mentoring programmes from tech startups, thru to Global businesses & Universities. \n \nThis is a continuation of our funded MVP for the F7 Accelerators and Mentors challenge, in our Impact Innovation Accelerator project. "}