{"id": 404659, "author": "shirogat", "title": "Children write African Stories", "url": "https://cardano.ideascale.com/a/dtd/404659-48088", "category": 26442, "amount": 20000, "description": "African children in marginalized areas do not have the opportunity to use digital tools to tell their own stories", "funded": 0, "upvotes": 16640091, "downvotes": 15886380, "votes_result": 753711, "votes_cast": 77, "f6_no_assessments": 9, "f6_rating": 3.962962962962963, "videos": [], "media": [], "f6_assessments": [{"id": 809, "q0": "Children of today are the world of tomorrow. Development projects for children of all ages are fantastic. Children write African Stories is a very unique idea that can help African children better access blockchain technology and can help them understand that applying blockchain technology in real life is also very simple. This successful proposal will help Cardano take another step into the realities of life in Africa, thereby expanding Cardano's reach in the region.", "q0r": 4, "q1": "Anne, Victor, Antony are all experienced in related fields. You are especially passionate about education. I appreciate this very much and I also believe that you will definitely succeed with this proposal. Aside from funding that could affect the progress and success of the proposal, are there other risks? You need to carefully evaluate these risks. For example: Is it difficult to link with schools? Does the education system prevent students from learning about digital at an early age?", "q1r": 3, "q2": "Your route is pretty clear. However, you need to be more clear and transparent about the amount of $20,000 if funded. Example: Develop additional resources to support use of digital storybooks in schools $2000. How is this money used specifically?\n  Training and support in writing and editing 500 stories from 10 schools into ASB $4000 inventory. You need to be more specific about this expense.\n  Develop monitoring tools and formats for reporting progress and schedules for $2000 support visits. This amount you also need to be more specific.\n  Visit schools every two months for a six-month period to monitor $4000 progress. This expenditure also needs to be further clarified.", "q2r": 2, "assessor": "z_assessor_1213", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2005, "q0": "This Proposal most definitely falls very well in line with the Challenge Brief: it is using African developers to code the project, thus local impact and partnerships, shares children’s stories onto our blockchain as NFTs thereby positioning Cardano to be a Web 3.0 leader, and in doing so therefore the African developers programming it Cardano should wind up naturally onboarding African developers here in 2022. These should all lead towards Cardano becoming the blockchain of choice in Africa by 2023. The six (6) UN Sustainable Development Goals that this project covers further bolsters the local impact and therefore likely seeding long-term projects by providing great PR for Cardano.\n\nAssuming that the geographic range spanned by this project will be similar to the massive coverage of the linked 2013 YouTube video, with the incredible network/partnerships like PUKU Books, Nal’ibali, NRTI, CodeCan, PWIAS, STIAS, and NRF, this Proposal should have impact well beyond just one local area, but all across the eastern half of Africa, which again has powerful implications for Cardano expansion. \n", "q0r": 5, "q1": "The africanstorybook.org/ website they linked to shows that they already are connected with resources to make this a reality. 500 stories seems a bit ambitious at first, but over 3 months’ time, spread across 10 different schools, and given that the project has already begun somewhat from previous round funding, it seems very realistic. Further, the proposed team seems quite strong with great credentials and experience, apt to put plans into place. The price breakdown looked a bit steep, but I trust that the listed team has the experience and network to put the funds to efficient use. \n\nI found it a bit peculiar and notable that the linked/advertised 10-minute YouTube video link for the African Storybook Project is dated from 9 years ago, in Nov 2013. That gives me pause, at what changes have happened over the past 9 years and whether momentum remains to continue the project at full strength/speed. \n\n\nThere were a lot of acronyms used that weren’t clarified or spelled out, so I found myself struggling to follow along in meaning, with what things like “County school managers from MOE TSC . KICD for support the teachers use of existing devices” or “ICT education space” meant. Those being made more explicitly clear may have helped me understand the Feasibility likelihood a bit better. \n", "q1r": 4, "q2": "The timeline KPIs provided in the Feasibility section seemed quite well suited for checking up on status updates and verifying that the timeline is playing out as planned. \nWatching the NFT marketplace for when the stories are minted/published onto the blockchain seems like a great way to monitor end-progress when the project begins to finalize, however monitoring steps along the way may be slightly more difficult, since there doesn’t seem to be much numerical/quantitative for an auditor to check; only asking for progress reports from the team. \nThe Auditability section was okay, but I would have liked to have seen more concrete breakdowns for how an auditor could track or watch progress in this project as it develops and evolves. \n", "q2r": 4, "assessor": "z_assessor_1446", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3101, "q0": "The aim is to provide African children with digital tools so that they can be used to write their own story. The proposal can have an impact by putting the stories on Cardano and sharing them with the world. These stories will also be used by NFT. This can then lead to sponsorships that can ensure that the quality of education improves. This project has already been partially funded. If there is no more money, implementation will be difficult. I am a teacher myself and I sometimes have problems using digital tools. I suspect that not all students have a computer or laptop. Would there be a possibility to provide some sort of loan system for laptops? There is already a website where the stories can be viewed worldwide", "q0r": 4, "q1": "The team has over 20 years of collective experience in the ICT education space and has connections with teachers in East Africa. The relevant experience is described in the proposal, LinkedIn is also given. A budget of $20,000 has been requested. The proposal states for which parts the money will be used. It is good that the schools are visited once every two months to monitor the progress of the project. The proposal states that they want to create an NFT marketplace. It is better to first see if the project is successful. If this project is a success, an NFT marketplace can be built afterwards. By leaving this out, the costs are reduced. There is a timetable in which the monthly target is stated. If you leave the NFT marketplace behind for a while, more energy can be put into supporting and writing the stories. The resources are described that are necessary to elaborate the proposal. These are included in the budget overview. If this project is not funded, this project may not be completed because the team cannot be paid.", "q1r": 4, "q2": "The project will run from May 2022 to July 2022. This timeline shows the goals that the team wants to achieve during this period. These objectives can certainly be achieved during this period. (raising awareness among teachers, school visits, writing workshops) The KPIs are included to follow the development of the project. About 500 stories from 10 different schools are clearly measurable. When things go wrong, feedback can always be given during the visits to make everything go better. This project gives African youth the opportunity to work with digital tools to write their own stories. In the long term, there is an opportunity to create an NFT seat. The advantage is that this project can be followed by other people on their website (https://www.africanstorybook.org/).", "q2r": 5, "assessor": "z_assessor_1606", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4603, "q0": "The proposer helps in increasing the concept of learning and writing  for the african children where literacy is very low, the proposed model helps in educating people ,and also know the western world about the problems faced by African students during the studying course it will also help children to get connected with internet , which also enables them to learn from the new world techs hence the proposed model effectively addresses the challenge", "q0r": 5, "q1": "Completion of task is not difficulty here because building library just to write their story doesn't need any complex coding for developers .\nThe team members have good knowledge over the languages which they can handle the server data easily and more effectively . The proposer has also mentioned his ultimate goal of Creating an NFT marketplace for African digital stories, which shows the proper  long vision has been done on the project for being successful one, so the plan presented is likely to be implemented successfully", "q1r": 5, "q2": "The audit has also clearly mentioned about all the goals step by step, and has mentioned about using those stories effectively in the market. \nThe audit has the best Key Performance Indicator to know the progress of the project effectively. it has also mentioned on how the project can widened in the future  hence the info provided is sufficient to audit the progress and the success of the proposal\n", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5718, "q0": "Clearly this project has a huge community impact, giving voice to the kids and allowing everyone who’s interested in using these stories in their classrooms or even to learn how is the point of view of a child living in their conditions (which I imagine there is a enormous difference between their life and an EU child life).\n\nThis idea tackle almost every key metrics of this challenge. I just don’t imagine how this is going to bring new developers into the platform, since you’re aiming kids and their lecturer.\n\nHowever, if there is a marketing campaign around this project and people start to see this and other usages of ADA, it might encourage the devs.\n", "q0r": 4, "q1": "I’ve noticed that you said that you need to be funded in order to get going. However you already has a platform running, maybe if you implement ADA payment (donation part only allowing USD payment) and ask for a minimum amount of ADA to a person download the book, it will help you to have a cash flow to fund your activities.\n\nIn order to improve the proposal, I think it would be good to add more information about ‘output 1’ such as time (how long are these training take), when will this task start, what gonna be the approach, who is going to train the child, etc.\n\nAbout the budget, I would be glad to have some more informations: a) why do you’re asking for a USD 1K to communicating with schools? b) what do you mean by ‘further develop resources’? Which resources ? c) how the progress is going to be measured, by number of books, by downloads, by child involved? This could be further explored.\n\nAbout risks: 1) there is the risk of not having enough donations, or downloads or ASB bought. In this scenario, how are you going to continue giving voice to those children? – this may be overcome by adding ADA donations and payments, another aspect is train and allowing children to create their art NFT and sell it, probably there is a market for this; 2) there is a risk of teachers no wanting to have another job with no salary change (they’re going to supervise the children, I imagine)\n", "q1r": 3, "q2": "I fell that if you add some more objective kpis the proposal would gain, like # books used in X time, # of downloads in time, # of transactions, donation’s volume.\n\nAnother thing that should be added is a roadmap with more specifics milestones in order to allow us to follow all the development more closely.\n\nA good thing to do is add all these statistics in the current website. It would help to give more trust in the platform.\n", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7041, "q0": "The proposal addresses the challenge as it aims to deliver a series of stories under an NFT collection on Cardano. These stories would be written using digital tools by children, who will get in touch with  web3.0 and at the same time get the opportunity to share their work.\nTo create the NFTs African developers will be involved", "q0r": 5, "q1": "The team is capable of delivering the challenge as it counts member who already got funded in Fund 7, and people with expertise in the educational field.\nThe timeline is realistic as in 4 months the team should be able to collect 50 stories by each of the 10 schools reached and mint the NFTs.\nHowever, budget for the NFT marketplace should be zero, as there are are other projects that are creating an NFT marketplace, and there is already one in place, CNFT.io", "q1r": 4, "q2": "The team provided relevant links to their profiles providing their past experience.\nThe budget is itemized and justifies the costs except for the last item (see above). \nThe team also provided a 10 minutes video explaining the project mission and a link to the website of the project, which is already ongoing.\nWhat I see missing is what happens after the NFT selling phase. \nIs it a part of the profit going to children ? Do they get royalties from secondary sell ?", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8861, "q0": "The author of the project has identified the problem that needs to be solved, The lack of opportunities for African children in remote and marginalized areas to use digital tools to tell their own stories, The scheme has the potential to expand its scale if it is successfully rolled out to other less developed countries of the world. This project has identified part of the problem to be solved of this challenge, which we can extend to the region with similar conditions in the world.\n\nThe humanity of the project is great when it comes to children's sense of autonomy, independence, and competence in the 21st century in East Africa. I came across solutions, which are good ones based on resources already available in Kenya like Concordia University Learning Toolkit, READS components. Also, it is a good idea to create NFTs for these stories. The solution the proposal provides is good, it identifies a few problems of the challenge, the author of the proposal argues logically and creatively.\n\nThis project has not yet anticipated the risk of implementation, I would like to see the addition of risk management in the next Fund. According to the information provided, this proposal has received a small amount of funding, and according to the author is a financial risk if not funded with a larger amount. Author please list more risks and solutions to those risks IF THE PROJECT IS FUNDED, For example: how to make sure it is the child's own story ?!, how to encourage those kids to come back next time and tell more stories?!,... The community needs to understand more of the risks of the project so that they can be deployed on schedule and easier to manage.", "q0r": 3, "q1": "The ultimate goal is for children to master the ASB tool and tell their stories on it. The KPI activities are relatively reasonable and clear. Great when the project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project aims at are also very specific and completely achievable.\n\nThe budget is already over 20% of the total budget for this challenge, compared to the information the scheme provides some of the project expenditures need to be clarified if it is to be Funded. Expenses need to be more detailed to increase the transparency of the project, For example: Create an NFT market for African children's stories is 6000 USD, what specific work items will be done for the price (Code, labor, tools, ...)\n\nThe implementation staff has been assigned specific jobs, clearly and logically, the experiences listed are suitable for each member's ability with the project, in addition to the members' identities, which are easy to verify clearly. A great team. Great transparency, when most of the information about the project implementation team is clear, to me it is great confidence when the author provides clear personnel information like so. It also showcases the team's experience developing the Haskell/Plutus course, pioneering Atala Prism, and other roles in Catalyst.", "q1r": 4, "q2": "The project provides KPIs, but the overall goals are easily measurable compared to the information the project provides. The above parameters are completely measurable.\n\nThe scheme has clearly defined success, the information from the scheme shows what is being done, however, the test has not been successful. I consider the test unsuccessful because the author has provided that: This proposal has been submitted before and received a small amount of funding, In my opinion, the author for it to be implemented on a small scale to see its effectiveness, before applying the full solution to extend it.\n\nThis is a completely new proposal, it was suggested by an author with Catalyst experience when the author had a project funded in the Fund before.", "q2r": 3, "assessor": "z_assessor_709", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9029, "q0": "The problem described here is kind of deviating from the challenge. I can’t figure out the alignment it has with the challenge. The proposal focuses on providing opportunities for children to tell stories without indicating what Cardano stands to gain from that although some NFTs are employed. I think there is a misalignment of the goal in relation with the critical issues of the challenge. \nI don’t really see how the proposal will address the challenge.", "q0r": 2, "q1": "Information about the team provided and the relevant experience described here gives me the assurance that the team is capable of implementing the project. The budget is well explained and broken down into clear items. With the nature of the proposal, I think the budget is reasonable to achieve the set goals. The roadmap presented is not quite detailed however the timeline is clear and definite. I was expecting to see some detailed challenges and risks but what I am seeing is kind of making reference to the past funding round which is not actually a challenge/risk in this round. \nCome clear on the risks and challenges nex time.", "q1r": 4, "q2": "The roadmap is not described in detail however there is clarity in the time horizon, milestones are kind of hidden. The described problem in this proposal is clear and I believe the proposed solution can tackle the problem. The KPIs/metrics, I’m sure are good indicators for evaluating the success of the proposal as they tell the total number of stories amongst others that can be garnered over the stipulated time.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10491, "q0": "They have identified a every essential problem. The lack of participation by children withing the Blockchain and for that matter the cardona ecosystem is a worry that lives much to be desired. Their proposal to end this problem is to give children an opportunity to use digital tools to write, their own stories in their own languages on an open sourced digital library. This is achievable since Cardano has that capacity and platform to make it fun loving to children.\n\nAs to how their proposal will address this challenge, they emphasized and proposed that Cardano tech use-case solutions by the repository of these digital stories going on the block chain and being used.\n\nAfrican developers will be used to code this project\nI love the aspect they indicated that the project has a global reach local impact (measurable through user activity and reach)\n\nI however wanted to raise an issue regarding whether there is already a project like this in Kenya. However, you can note from their proposal that local partnerships formed (size of institution + influence) this is already available through the Learning Tool kit by Concordia University that uses the African story book stories in the READS component. I therefore think that the proposal effectively addresses the challenge hereby stated. I strongly agree with this proposal.", "q0r": 5, "q1": "There is a very important thing I was looking out for in the proposal and that included the timelines and milestones. However, it's impressive to note that it was totally included and was specific. The experiences of the team members is also encouraging and rich in content. The proposal is very likely to be successful because the timelines when properly followed will yield great results. ", "q1r": 4, "q2": "\n\nThe proposers provided  adequate information that seek to audit the progress and success of the proposal. They provided about 6 KPIs. Out of the lot, I think the ability of the proposers to include the following is a huge inspiration since that certainly gives an indication of the auditability of the project:\n\n1. Resources to support use of the digital storybooks in the schools further developed\n500 stories from 10 schools into the ASB repository written\n2. Monitoring tools, and formats for reporting on progress, as well a schedule for support visits.\n3. Schools visited once every two months for a period of six months to monitor progress.\n", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Give children an opportunity to use digital tools to write, their own stories in their own languages on an open sourced digital library", "experience": "Education Advisor ICT for development agencies and governments and schools, African Story book- Saide team, VLS, M-lugha"}