{"id": 405003, "author": "victorcorcino", "title": " Win-Win South Africa Expansion", "url": "https://cardano.ideascale.com/a/dtd/405003-48088", "category": 26442, "amount": 15000, "description": "Legal tech platforms such as Win-Win need to do some research to localize their products according to other countries' laws and culture.", "funded": 2, "upvotes": 115270785, "downvotes": 7580621, "votes_result": 107690164, "votes_cast": 545, "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7459, "q0": "The proposal is perfect for the challenge as it will surely help both the people of the African continent and the Cardano blockchain. It is about expanding the Mediators.ai platform, formerly known as Win Win, so that its activities are also developed by African countries. Let's first recap what the Mediators.ai platform is: founded by the company Loxe Inc., this platform aims to resolve conflicts between people outside the traditional judicial system. The idea is to exclude unnecessary and abusive fees, as well as the bureaucracy that is traditionally found in the judicial systems of each country. This project is already underway in the United States, because most of the entrepreneurs who founded the platform live there, so they already have more knowledge about how the system works there. This platform is already being expanded to Latin America, which is a very positive point here, because this proposal specifically intends to take Mediators.ai's activities to a new context, the African one, and it is not the first time that they expand the project. As a result, some assurance is already given that the proposers have experience in what they are doing, which automatically increases the chances of the proposal's impact being as positive as expected. I think it fits very well as it will benefit Africans a lot first. For example, they can work as mediators. This already represents an income opportunity, in a continent that we know is not easy to get a job and financial stability, at least it is not as simple as in places like the United States, for example. Another advantage for them would be to literally enjoy the service that is offered, Africans can start to resolve their conflicts in this alternative way, which is less expensive, more transparent (since everything that happens will be minted on the Cardano blockchain, making it inviolable and totally secure ) and faster than the resolution of conflicts in the traditional judicial system. For Cardano, this proposal would be interesting because it would certainly help to popularize our blockchain across the continent, it would break some of the prejudice that Cardano and blockchain technology itself still suffer, since Africans would realize in practice the advantages of all this. Perhaps this project causes greater adoption of our currency, creation of new digital wallets, greater transaction number on Cardano blockchain, etc.; that is, the ecosystem will certainly benefit greatly. Therefore, I think the proposal's impact will be maximum and it deserves to be funded. \n", "q0r": 5, "q1": "The proposal script is very good, it is determined which activities would take place in which months of the year. Despite not being the most detailed script of all, it is enough for us to understand in a safe way how the development process of this project would take place. I have no further remarks to make regarding this part of the proposal, as I think the information provided is already satisfactory. Regarding financing, I think the asking amount is fair for the scope of the project, and it is also quite simple to understand how it would be used. Basically, the total amount would be divided between the salaries of those involved and the “Location of the mediators.ai platform for South Africa”. I think that in this part a more detail would be necessary, because: we don't know exactly how many hours the mediator would work per month, for example, to receive his salary of 2 thousand dollars. What would be the part-time duration of the mediators.ai platform member, 4h? This is usually the case, the question is more about the mediator's dedication time. The platform location fee could also be better explained, I personally didn't quite understand who this fee would be paid to. I think the budget explanation is ok, but not ideal. And finally, speaking of the team, total trust is conveyed in the members of this team, for several reasons. Starting with the fact that they are already developing this project, that is, it is not something that is starting from scratch. They already have experience in the subject, which automatically conveys confidence in the group's ability to succeed in this new stage, as I also commented on impact. Also, they attach a lot of information about who they are, what their areas of academic training are, previous professional experiences and how they are involved with the Cardano ecosystem (and they are certainly very active, already delivering several products/services to our community, such as example the CA tool and vCA tool, so useful for us). So I think the only part of feasibility that deserved better attention and more detail is the budget, including the exact amount of hours each professional would dedicate to the project and also an explanation of the localization fee. This, however, does not diminish the quality level of this part of the proposal, which I think is quite high. \n", "q1r": 5, "q2": "Proponents have told us safe ways to monitor both the process and the end results. Regarding the process, they state that “internally, we will use the Agile methodology to manage and monitor our progress in the development of this project” (what would this methodology be? How will it help to organize teamwork?) and that, externally, a “progress report will be made through monthly meetings with the challenge team and coordinators' meetings with the IOG team”. That is, we have very clear ways of how the progress of the steps will be monitored. It would also be interesting if the proponents were to specify even more what the content of these reports would be. What will be done, if it will only contain the goals achieved that month or also explanations about the work routines of those involved in the project in that period of time. Speaking of the final scenario, I think the analysis suggested by the proponents is great for us to understand how the project reached in a quantitative way, because they specify what numbers (of mediators for example) are expected for each passage of time (3, 6, and 12 months). In addition, it would be very positive if the proponents also carried out research that tried to understand what were the impacts, qualitatively, of the project both for Africa and for the Cardano ecosystem. How did this proposal help our blockchain to become popular on the continent? Really, new people acquiring and delegating Ada, has general confidence in the technology increased as the project became known? It would be important for them to also clarify what the consequences of this initiative would be on our blockchain, specifically. Therefore, I think the auditability is good, but it could still improve in terms of deepening the analysis in the second part (of the final results). \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 813, "q0": "Disputes will often result in loss of both money and time for both parties in any given country. The successful implementation of the proposed Win-Win South Africa Expansion will provide South Africans with an additional solution to resolve disputes quickly and inexpensively. This contributes to increasing Cardano's presence with the South African community, thereby contributing to the development of the Cardano community in South Africa in particular and promoting the Cardano African community in general.", "q0r": 4, "q1": "Loxe is a team of many experienced members such as Matthias Sieber, Eli Selkin and an experienced advisory board. They have achieved a lot of success in the Cardano ecosystem like getting $290k through Catalyst or $60k through Hackathons, which proves the main team's ability so I believe this proposal will work. currently successful in South Africa. Furthermore, this proposal is an extension of the previous https://cardano.ideascale.com/a/dtd/368353-48088 proposal so I believe they will do well this time as well. What's missing is that you need to include more risks that could affect the success of this proposal. For example: In each country, the legal system is often different, the settlement of mediation also needs to comply with the laws of each country. How will you handle this problem? Another important thing lies in the mediators. How can you attract qualified mediators to join your project? In case there are too few people interested, do you consider opening mediator training courses for each country or region? I think if you guys give more of these things the community will appreciate a lot more.", "q1r": 5, "q2": "The project implementation route I found to be completely reasonable. I believe that you will achieve the goals you have set. However, I think if you give a timeline further within the next 1 year then the community can easily visualize the whole process of this project. The use of the $15,000 budget I see you offer is also very transparent and highly reasonable. The KPIs you give are also very easy for the community to measure with numbers. I believe the community also appreciates this.", "q2r": 4, "assessor": "z_assessor_1213", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 5243, "q0": "I'm impressed with the creativity that this project brings to the table. I love the concept of producing independent/privatized conflict resolution that can directly serve the people. I do have a lot of questions in the areas of enforceability, market analysis, and presentation of the problem. With these questions, I am relatively uncertain if I feel comfortable granting this proposal a whole $15,000. Given the experience of the team and the relevance of Africa to the ultimate goals of Cardano, I lean more in favor. ", "q0r": 4, "q1": "I think the relevant experience and education of this team gives me full confidence that they can deliver. At least on the technical end, it's not even a question. It is very helpful to see the breakdown of the costs and that they are going entirely to the service aspect of the proposal. I love that this project creates jobs in South Africa and is a sustainable business venture. ", "q1r": 5, "q2": "The number of organizations and agencies overlooking this proposal is intimidating. The coordination with IOG is quite a big stamp of approval, along with the intentions to become very integrated into the culture of South Africa and other institutions there. The roadmap and success metrics are very clear, attainable and ambitious.  We don't have to trust the leaders of this proposal because of the high level of oversight, but I still think it's worth stating that I do. They were previously approved for a similar approval for Latin America, so I expect that diversity of experience in this exact industry will help refine development across the world. ", "q2r": 5, "assessor": "z_assessor_1896", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6005, "q0": "I believe that this proposal is in line with the challenge setting. The proposers aim to expand their mediation platform to Africa and, in the process, grow the number of cardano use cases within Africa. At the same time, they will be providing helpful solutions to the people of South Africa, which will show the people how blockchain can be used in real-world applications. Showing people how cardano can be used could inspire other people to get involved with cardano or cardano catalyst, which could lead to a whole plethora of new projects on the blockchain. In order to have a greater impact on South African society, the proposers plan to work with a local South African mediator who will help their research efforts. Since the proposers have someone on the ground to help them, they will gain a better sense of the niche that this service can fit into within Africa. (score given: 5)", "q0r": 5, "q1": "Given the information provided, I have confidence that this proposal will be implemented successfully. The proposers all have many qualifications, ranging from professional software engineer to data science, to having completed many successful projects in the past. Thus, I am confident that the proposers have the knowledge necessary to make this project happen. With regards to the proposal timeline, there is a roadmap that is well laid out. It is broken down into month chunks, starting in September 2022. It is very clear for me to see what the proposers plan to do. For example, the proposers will first select a local South African mediator to partner with, then they will research alternative dispute resolution and mediation in South Africa. Afterwards, they will conduct outreach to law universities and local governments, etc. I think that all of the tasks listed by the proposers can be done within the timeframes listed. With regards to the budget, the proposers have listed out a good breakdown that is simple to follow. I can see where the requested funds will be going, and I think that the requested funds seem reasonable given the scope of the proposal and the amount of time this project will be running. (score given: 5)", "q1r": 5, "q2": "Given the information provided, I think that this proposal is highly auditable. The proposers mentioned that they will be using the Agile methodology to keep track of their project’s progress, as well as making progress reports that will be shared with the IOG team. The team’s roadmap is a great way to track the success of the proposal because there are many goals that have a timeframe associated with them. Additionally, the proposers have included a few KPIs that would allow for easy auditing of the proposal. For example, they have 3, 6, and 12 month KPIs that include a specific number of institutions and mediators onboarded. The cardano community will be able to easily track this proposal’s success with these metrics because they are easy enough to report and check up on. Lastly, the overall goal of this proposal is for the proposers to understand the landscape related to mediation within South Africa. While this goal is more intangible when talking about success, the other numerical KPIs are connected so that there are quantitative metrics that can be associated with this understanding. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6296, "q0": "The proposal is connected to the challenge by the fact that they are implementing a use case that is unique and has implications on broader contexts, reaching common people that wouldn't be aware of blockchain or Cardano.\nProposal could explain here (to make it easier to readers and voters) how it's \"built on the Cardano Blockchain\", but this does not make it less readable and clear. ", "q0r": 5, "q1": "The proposers have presented budget that is compatible with what they are asking for, and based on the context of the connecting proposals, they are giving evidence of their expertise to conduct this project in South Africa. There are some risks foreseen. Although other risks could have been included, the proposal is structured enough. ", "q1r": 5, "q2": "There's enough metrics, a clear roadmap, detailed indicators and a perspective for implementing the idea step-by-step. Also, as it has a clear perspective in the problem and its solution, it's easy for the community to audit this proposal.", "q2r": 5, "assessor": "z_assessor_386", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Outreach universities, legal bodies and local governments in South Africa to expand and localize Win-Win services.", "experience": "Loxe Inc. team, Sr. Software Engineers, Plutus Pioneers, Gimbalabs PPBL veterans, legal experts and dispute resolution specialists."}