{"id": 367227, "author": "", "title": "Cardano Wallet JS Multisig", "url": "https://cardano.ideascale.com/a/dtd/367227-48088", "category": 26094, "amount": 4800, "description": "**cardano-wallet-js** libは、複数の当事者からのトランザクションに署名するために、マルチシグ・ウォレットを作成することができるはずです。", "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Multisignature support opens up possibilities that are only currently possible using Cardano-cli. It will produce features like shared ownership of NFTs/ wallet user-friendly and other innovative contracts. Currently, this feature is not present in the official wallets. Therefore getting a wallet with this feature will definitely improve the developer ecosystem. ", "q0r": 5, "q1": "The proposers have built the current JS wallet and it is a well-received package in GitHub with about 15 forks. Therefore it is highly likely that the proposal will be implemented successfully.\r\n", "q1r": 5, "q2": "The deliverables are a js wallet that supports more than one signature. The project will be open-source. The team is asking for 160 hours of work with 30$ per hour. This is a reasonable development cost for the system proposed by the team. Sufficient information has been provided in the proposal to audit the progress.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal aims to facilitate JavaScript developers by adding a multi-signature to their own wallet SDK. Thus, this project is part of this challenge. To better evaluate the impact, it would be good to have information about the usage of the SDK and how this project differs from other similar proposals.", "q0r": 4, "q1": "The project is simple and does not always require a long description of the solution, especially if, as in this case, a detailed repository of previous developments is available. The budget is easily explained, and from my perspective the amount is fairly measured. Unfortunately, however, no schedule is provided.", "q1r": 4, "q2": "A GitHub repository is available so that the progress of the project can be easily followed by the community. It would be an improvement if the success was defined, e.g. how many users/applications this SDK has at a certain point in time. Also a date of delivery would improve auditability.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is very useful because the extension of the existing api which multi-sig functionality will help a lot of developers creating dApps and is therefore  within the challenge setting (Developer ecosystem)", "q0r": 5, "q1": "Due to the fact, that the proposer is also the developer of the underlying api cardano-wallet-js api it seems very likely that the proposal will be implemented successfully.\r\nThe assumed budget for realizing this proposal is appropriate and the defined timeframe  (1 month) is realistic.", "q1r": 5, "q2": "The proposal gives a clear and understandable description of the targeted problem and its solution.\r\nA clear time horizon for achievement of the proposal  exists. \r\nThe progress of the project can be tracked through the GitHub repository. ", "q2r": 5, "assessor": "z_assessor_618", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "cardano-wallet-js**に、複数のパーティからトランザクションを作成/署名する方法を実装しました。", "experience": "オープンソースプロジェクト **cardano-wallet-js** のクリエーターおよびメンテナー"}