{"id": 367595, "author": "", "title": "Crowdfunding Website for Start-Ups", "url": "https://cardano.ideascale.com/a/dtd/367595-48088", "category": 26094, "amount": 120000, "description": "カタリストの資金は、アイデアの成功、プロジェクトの開発、市場への導入を保証するのに十分ではありません。", "f6_no_assessments": 7, "f6_rating": 4.238095238095238, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=13257"], "media": [], "f6_assessments": [{"q0": "Their links to their other proposals are useful in evaluating. I do wonder why this is in the Developer Ecosystem rather than DApps, but this is an important project for many filmmakers, including myself, would love to use smart contract features in crowdfunding: but without the need to write Plutus code. Also, if some of us were to write a Plutus smart contract: the code changes often, and so if a firm was handling this development: it would be extremely needed and useful for filmmaking and other products.", "q0r": 4, "q1": "This is an extension of their Fund5 efforts, and that seems to have been a success. Their roadmap seems to be a valid one, and they have metrics and other necessary information present on this proposal. This team appears to be adhering to their Fund5 promises, although falling a bit short of projections. This team also contacted me on Discord, so it seems they are active, moving forward on goals, and are delivering items.", "q1r": 5, "q2": "This team has quite a bit of material to go through, and as I did: I found more confidence in giving more stars. The team seems serious and dedicated from these materials, as well as technically able to handle this project. These contracts could be complex, and like they have reached out to LimeChain and LimeLegal, among other consultants, for assistance on this project...for it will need all they can get.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "I have known Innovatio's proposal thanks to a YouTube channel and I found it excellent, I think it can bring a lot of value to the ecosystem, bringing a platform that would allow hundreds of projects to raise funds in various ways and develop a much more concise and self-sustainable business model than Catalyst's proposals.", "q0r": 5, "q1": "The Innovatio team seems to have experience and knowledge on how to develop this proposal, I have seen them active in the IOG Slack and discord community solving doubts about the development of Smart Contracts with Plutus/Haskell.", "q1r": 5, "q2": "The metrics and vision of success are absolutely clear and concise to quantify and measure successfully.", "q2r": 5, "assessor": "z_assessor_372", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "This Proposal addresses the problem of limited funding to guarantee idea success, project development  which is great but it seem this Proposal addresses the DLT Entrepreneurship Toolbox challenge and not the Developer ecosystem challenge.  The Proposer is requested 120,000USD to implement a crowd funding website with Cryptocurrency which is great, but at the same time has in a Future implementations plan a feature to \"Raise funds in fiat currency via debit/credit card \".\r\nIt appear to me that the solution is not well defined , what will be solve now with the requested fund and the future is the same. I believe the proposal can be refine to bring impact to cardano ecosystem? I also think building an IDO can solve the same problem. The proposal also mention that a  \"Simple and practical creation of an external wallet\" in MVP  which add additional complexities  to the Project without any impact to the cardano ecosystem", "q0r": 1, "q1": "The team seem to have the technical skills but no Cardano Experience is included , there is no start date , There is a budget breakdown but I wonder why we should pay the salary of CEO and CTO , when they already have salary for 6 Engineers to build an MVP. The milestone and road map does not include actions that will lead to the product launch, for example \"Development of the project's financial and self-sustainability plan\" . Based on the Information Provided i strongly disagree that this proposal will be implemented successfully.", "q1r": 1, "q2": "There is KPI but its not well form , for example \"Verified members of Innovatio's Community.\" is not a metrics we can use to audit the progress and success of the Proposal . Most of the item on the milestone are to be announced (TBA)\r\n\"Audit of Smart Contracts for legal use within the platform. (TBA)\r\n🔔 Launch of the final platform to market. (TBA)\"\r\n", "q2r": 1, "assessor": "z_assessor_430", "no_vca": 11, "ne": 2, "ng": 4, "nfo": 5, "vca_o": 1, "reply": "1)The assessment says that the proposal address the DLT Entrepreneurship Toolbox challenge and not the Developer ecosystem challenge and gives a rating of 1, without further explaining his decision, the rest of the assessment address not related topics to the question if the proposer successfully address the challenge brief and is therefore not valid and should be filtered out.\n\n2) The Assessment says: The team seem to have the technical skills but no Cardano Experience is included. What exactly means that no Cardano Experience is included? Are only proposers allowed that built everything on Haskell/Plutus, etc? Then, almost no proposer would meet this criteria which is not at all an official Criteria. CA’s do not have to set their own criterias for proposals and challenges but should follow the official CA and Assessment guidelines, that's why this assessment is not valid.\n\n3) I as a proposer added on three points (TBA) by being aware that it is not possible, nor fair to make false promises for goals which will be approached by the evolution of the proposals execution and therefore cant be explained in detail in such an early stage. This statement gived by the CA shows the ambition to give the whole proposal a lowest possible rating which is not in relation to the auditability as other points show very clearly how the project aims to evolve. Not agreeing with 3 out of 15 listed points does not show any relation to a good and well made assessment. This assessment definitely should be filtered out as it gives the lowest possible ranking for all categories without acting in the CA and assessments guidelines.\n"}, {"q0": "The proposal is to create a crowdsourcing website for funding innovation not only for Cardano-related projects but the system will use Cardano blockchain for implementation. The direct impact of this proposal on the developer ecosystem in Cardano is debatable. However, it can be argued that it will provide developers to raise money for innovations. ", "q0r": 4, "q1": "The team behind the proposal has a combined experience of more than 30 years and in all fields relevant to the proposal. There are no major technical hurdles or challenges which need to be solved. Therefore the team will be able to field the crowdsourcing site. The success will finally depend upon marketing. ", "q1r": 5, "q2": "The funding request is for initial development that is expected to be completed in 3 months. The funds for maintenance and hosting services are not included in the budget. It can be expected it will take some definite period to break even. The promoters are being well-compensated in the nascent stage and seem to have no plan for fund flow after the three months. The success of the proposal can be measured by progress based on the code output is not sufficient. There is a need to monitor the effort of the team in marketing and in attract projects to  the site this is a subjective and difficult to measure.", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 12, "ne": 1, "ng": 6, "nfo": 5, "vca_o": 1, "reply": "1) The assessment indicates that it is a crowdsourcing platform, which is totally incorrect, he has not read the proposal in detail and has not even paid attention to the title of the proposal. Then it indicates that the impact of the proposal with the challenge is debatable and the same is answered by indicating that it can provide developers to innovate. The assessment demonstrates that he have not read the proposal and gives no objective reason for the rating.1) \n\n2) As a proponent I would value a score of 5 as it would help the overall rating, but I reaffirm that the assessor has not read the proposal, as he keeps insisting on crowdsourcing, it is true about the experience of the team and its capabilities, but I think it does not go with the spirit of Project Catalyst if the assessor is unable to read the proposal to understand that it is a crowdfunding platform and not crowdsourcing.\n\n3) The assessor does not follow the stated CA Guideline, as it focuses on rating whether the information provided is sufficient to audit the progress and success of the proposal. The assessor makes no reference to this itself, talks about the breakdown of funds and then subjectively begins to indicate how the project should be measured or developed in the future. When we are proposing to develop a non-commercial MVP. This particular statement does not address the CA Guideline properly and also fails to justify why the information provided is not sufficient to qualify for a 3."}, {"q0": "I really like how they have thought on a platform like this that makes it easy to get funds, and for investors to invest, using fiat money and also cryptocurrencies. I think it is a part if the Cardano ecosystem that was missing and it can really help the community to grow.", "q0r": 5, "q1": "The teams looks awesome. Very well prepared people, young, covering many different areas. I am sure that they will be an important part on the succeed of this project.", "q1r": 5, "q2": "The proposal really explains everything in great detail. It doesn't leave anything to the imagination and gives trust about the path they want to follow.", "q2r": 5, "assessor": "z_assessor_467", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "Most developers may need funds for finishing their projects and ideas in the cardano ecosystem and with Catalyst is not enough, so this proposal is exactly what the developer ecosystem needs.", "q0r": 5, "q1": "I think that the plan is very well detailed. Clear roadmap, initial team has several members of different fields and for sure they will try their best for achieving the success.", "q1r": 5, "q2": "They have clear KPIs and milestones to get, following both will provide sufficient information for both auditing the progress and if the proposal is successing.", "q2r": 5, "assessor": "z_assessor_498", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "The proposal seeks to help developers in fundraising, so I think it brings a very important tool to the ecosystem and especially to the development and financing of projects.", "q0r": 5, "q1": "The proposal is well explained, as well as the implementation and development of the plan, I also believe they have a team with the capacity to develop the MVP.", "q1r": 5, "q2": "Detailed metrics to measure the development and success of the proposal are objective and measurable.", "q2r": 5, "assessor": "z_assessor_511", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}], "solution": "クラウドファンディング市場を活用して、ユーザーを巻き込み、プロジェクトの発展と自立を可能にする多額の資金を調達する", "experience": "De-Fi開発、ビジネス、テック、デザイン、マーケティングの知識を持つ10名のチーム。(AWS、サイバーセキュリティ、React、Node、Deno）添付ファイルをご覧ください。"}