{"id": 368236, "author": "", "title": "Fair Stake Pool Selection", "url": "https://cardano.ideascale.com/a/dtd/368236-48088", "category": 26094, "amount": 29500, "description": "多くのサイトでは、プールの選択において、他の多くの指標よりもランキングを優先しています。私たちは、より公平な選択をコミュニティに提供します。", "f6_no_assessments": 3, "f6_rating": 2.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "This seem like a lot of money to create a site that generates a randomly sorted list of staking pools. I understand why that's desirable to new pools with low stakes, but is it fair to the stakers? What about reliability of the pools? Are they missing slots? What about their fees?\r\nPerhaps there's more to it, but the details are not in the proposal.", "q0r": 2, "q1": "The proposers would seem to have the skills to deliver the plan. The plan doesn't really seem to line up with the mission statement. Why a bare metal server and cloud server just to host a site with a random list of stake pools. If this really is the way forward, where is the marketing budget to draw stakers to your site?", "q1r": 3, "q2": "There are not really any clear deliverables and timelines other than expenses which can be audited. What is success here, how may users do we expected to make staking decisions for the 29,500 budget?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Similar to PoolTool, this proposer at PoolPeek.com will random sort order pools as a default for the list of Stake Pools in order to make delegations more \"fair\". This may not be an issue that users need corrected, as most delegators typically choose pools based on past returns and fees.", "q0r": 3, "q1": "Creating this proposal should be no problem for this team as they are very experienced stake pool operators and have experience with - Software Engineer/Architect, 12years\r\nM1Eagle - Mobile Developer, 10+years\r\nBraveHeart - Electrical Design Engineer, 10years", "q1r": 5, "q2": "The key performance indicators for this proposal are not clearly defined, and they will be difficult to measure. The final product will be a website used by potential stake pool delegators to make decisions about their delegation.", "q2r": 2, "assessor": "z_assessor_449", "no_vca": 12, "ne": 2, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "There may be a requirement to come up with a new pool selection algorithm. This does not add any value to the developer ecosystem. Moreover, the proposal does not provide any details even about the proposed ranking algorithm to evaluate. ", "q0r": 2, "q1": "The proposers are operating https://poolpeek.com and the proposal is to migrate the site to a bare metal server and create a mobile app. with the established credentials it is likely that the proposal will be completed with about 30K USD.", "q1r": 4, "q2": "Auditing the progress of the implementation is fairly simple but if we need to audit how the implementation is going to improve the developer ecosystem it is a grey area. The idea is simple to implement and is likely to be easy to measure the progress. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "PoolPeek.comでは、すべてのプールに戦うチャンスがあるべきだと考え、リストのデフォルトとしてランダムなソート順のプールを採用しています。", "experience": "シャムロック・プール - ソフトウェア・エンジニア／アーキテクト, 12years\n\nM1Eagle - モバイル開発者, 10年以上\n\nBraveHeart - 電気設計エンジニア, 10年"}