{"id": 369011, "author": "", "title": "Retroactive Project Funding SDK", "url": "https://cardano.ideascale.com/a/dtd/369011-48088", "category": 26094, "amount": 64200, "description": "Project Catalyst & SoFi DAppsは、財源を活用しながらイノベーションに資金を供給しなければならない。そのための強固な市場メカニズムの構築は難しい。", "f6_no_assessments": 5, "f6_rating": 4.800000000000001, "videos": ["https://youtu.be/F83iamXu7N0", "https://www.youtube.com/watch?v=AftfAbJMxQE&start=21147"], "media": [], "f6_assessments": [{"q0": "This seems like a great project to build the core infrastructure to enable funding of groups of developers/entrepreneurs who are willing to take the risk of building first and only being paid for success. \r\n", "q0r": 5, "q1": "The team has great technical and financial experience and well defined plan, budget and timeline. No reason not to be highly confident of success.", "q1r": 5, "q2": "The project has a clearly defined set of deliverables which will be easy to audit. They have set some clear definitions for success such as 2 case studies using the model.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "More and more people are realizing the benefits and necessity of DAOs. Providing developers with tools to ease the creation of Dapps for DAOs is a beneficial way forward for everyone. If DAO creation is better on Cardano more devs will use Cardano and the tools the community provides. ", "q0r": 5, "q1": "Already committed team with relevant experience. \r\nIt would boost voter confidence if you added more evidence of your team's experience. Like profile pages, github pages or past projects you worked on. \r\nBudget seems sensible and has been broken down in identifiable items. The timeline provided to complete the project seems fair.", "q1r": 4, "q2": "They've gone into great detail explaining how and what they will build on a timeline. Also provided key performance indicators, some that will be measured using github. They provide a tool that will benefit Dapp creation for DOAs. Turning this project into a DOA and making it open source makes it resilient to future challenges and tasks.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "A retroactive project funding tool kit is proposed by this team. Despite this clear solution, I would like to see more reflection about the underlaying problem to be able to rate the impact on the Cardano ecosystem. With this SDK this proposal addresses this challenge as this solution helps to simplify the workload for developers. I rate the impact with 4.", "q0r": 4, "q1": "The team has been very active in the community so far and have proved their ability to deliver important solutions/improvements. However, I would like to see more personal information about the team to further assess their references.\r\nThe presented plan is very much in detail and the technical description of the architecture makes sense from my perspective. Also the presented licensing model is a good solution for this SDK. Due to the detailed plan and ongoing activities I think it is highly likely that this team will deliver this proposal. \r\n", "q1r": 5, "q2": "The team presented a clear roadmap and a realistic time horizon (from my experience). The success is well defined and the presented metrics help to assess the success of this proposal. A GitHub repository is linked to the project as well, where you already see a lot of activity. I agree, that the community has sufficient information to assess progress and success of this proposal.  ", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I think the RABC funding model is inarguable a very novel idea, many startups simply run out of money despite having a working product and all the potential in the world. This seemingly continuous funding model could absolutely revolutionize the way companies are started and built.\r\n\r\nAs a developer myself I can appreciated the modular component base approach, there is much in this proposal that can be reused throughout the Cardano ecosystem. As the proposal itself says \"There will be no need to keep reinventing the same components.\" - which I tend to agree with. The entire Cardano dApp ecosystem can benefit from the RABC modular SDK.", "q0r": 5, "q1": "This team appears to be exceptionally qualified given their professional experience and technical skills. Given that, the roadmap as presented and the amount of money requested it becomes likely that this proposal will be successfully implemented as described. \r\nVoters should be aware that the proposal is most likely to implement the SDK in Haskell, which is worthy of note as this will work seamlessly with smart contracts which of course are written in Plutus.", "q1r": 4, "q2": "The roadmap presented was exceptionally detailed, with reasonable milestones and relevant KPIs for each milestone. \r\n\r\nThe team lays out a very clear and concise plan in plan terms and it will be clear to voters and project catalyst whether this proposal was successful or not based on the milestones laid out in the roadmap.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "A robust software development toolkit is crucial for the developer ecosystem. This proposal does an excellent job of defining how they will accomplish this task \"By focusing on primitives and engineering for reuse across the Cardano Ecosystem, we can make it faster to deploy reliable market-focused DApps\". I also really like the open source MIT licenses nature of everything being developed without allowing any patents on contributions.", "q0r": 5, "q1": "This team consists of a strong core of Plutus Pioneers and the proposal has an overwhelming amount of information to digest. The proposal has a clear and fair budget breakdown. These two elements lead me to believe strongly that this proposal will be implemented successfully.", "q1r": 5, "q2": "Included is a detailed twelve month timeline with clearly listed milestones and goals. This team appears to be committed to the long-term success of the project. I believe the proposal has provided more than sufficient information to track and audit the progress and success. ", "q2r": 5, "assessor": "z_assessor_68", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "DAOの財務管理のために、開発者が遡及的なプロジェクトの資金調達と投資を実装するための条件付き融資モジュールとSDKです。", "experience": "金融市場のソフトウェアエンジニアリング、暗号通貨の決済、スタートアップ、データ＆Govtech、インパクトインベストメント。リーガルテック・コミュニティの組織化"}