{"id": 369522, "author": "", "title": "ADA MakerSpace Bounty Hunters DEVX", "url": "https://cardano.ideascale.com/a/dtd/369522-48088", "category": 26094, "amount": 18000, "description": "多くの人がカルダノで何かを作る手助けを必要としているにもかかわらず、フリーランスの仕事をする開発者を見つけて、それに接続することはまだ難しいのです。", "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This idea could be a good resource for the developer ecosystem, however there is little in the way of details. ", "q0r": 3, "q1": "Its great the idea was played with in a hackathon, however in this proposal there is no detailed plan or deliverables so it is hard to give it a high probability of successful delivery.  It would be good to have evidence of the experience needed to deliver this type of platform. \r\nEscrow of funds in a smart contract has a clear issue. Who is the arbiter if the two side don't agree on work done. Are the funds locked up forever?", "q1r": 2, "q2": "The plan lacks enough details and milestones to allow auditing of progress. The proposer should set some KPI's on expected usage post launch.", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "There is a lot of people with great ideas that need developers. A platform like this would help accelerate these ideas into fruition. This would create opportunities for freelance developers and startups and also drive more startups to build on Cardano", "q0r": 5, "q1": "Given the community/devs already behind this project and active on the website and the budget allocation together with a sensible plan. This project\r\nseems highly likely to succeed.", "q1r": 5, "q2": "The solution to bringing entrepeneurs/startups and devs together is clear and  it's done in a fun way. Having a leaderboard that showcases the top talent\r\nis also a nice addon. Clear roadmap with estimated launch. Also added additional info of previous events that shows the need for this project. 5 stars", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "The probelm statement mentions about the requirement of a developer an djob marketplace requirement built on cardano and with MVP mentioned and the smart conract implemention mentioned, it would efeectively answer the problem statement", "q0r": 5, "q1": "Considering the fact thatthe proposer have multiple open source contribution for ADA development and have relevant experience in building the MVP too the project is most likely to be implemented with this experience", "q1r": 5, "q2": "The information consists of both fund distribution and relevent timeframe for development and general success measure it is sufficient for auditing the progress.", "q2r": 4, "assessor": "z_assessor_16", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to build a platform to bring developers and entrepreneurs together to build applications in Cardano through the bounty program. The software bounty system is a successful system that is being followed in many open source projects. A go-to place for devs and entrepreneurs can accelerate the ecosystem. The bounty model provides a clear reward mechanism for the developer and is likely to be very useful. ", "q0r": 5, "q1": "The proposer has consistently been contributing training videos of Cardano on youtube and has been building his platform. His website is fairly functional and has the potential to grow. He has demonstrated commitment and capability. With this background, it is very likely that the project will most probably be completed successfully.", "q1r": 5, "q2": "The expenditure has been spelled out clearly as 10000 for smart contract developers (bounty system ) and 8K for the front end. This is a fair estimate. Assuming a remuneration of 4K for one smart contract developer and approx 3 K for a front-end developer. The amount of work expected is also estimated clearly. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "開発者がADAやその他のネイティブアセットを得ることができる開発バウンティを投稿することができるゲーム性のあるマーケットプレイスです。", "experience": "私はfund1以前からCardanoスマートコントラクトの開発を試みており、他のDEVと一緒に多くのオープンソースレッスンを行ってきました。"}