{"id": 369803, "author": "", "title": "Legal resources for developers", "url": "https://cardano.ideascale.com/a/dtd/369803-48088", "category": 26094, "amount": 98000, "description": "カルダノ開発者のコミュニティが拡大するにつれ、法的な専門知識の必要性が高まっています。どうすれば効率的にそのニーズに応えることができるのか。", "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems like it would be a great resources for developers. Cardano is obviously global in reach, is this only focused on US law?", "q0r": 5, "q1": "This is a detailed proposal by an experienced team. There is not doubt they can deliver on the plan presented. ", "q1r": 5, "q2": "The proposal has a clear set of deliverables and timelines thus progress should be easy to audit. Some metrics around number of attendees at the workshops and downloads of the videos and templates would be good measures of success which should have some goals attached to them.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Excelent and much needed idea. Legal support would benefit the whole community and engage fresh eyes to the blockchain world (people from law). I wonder how many lawyers are already engaged in the community, maybe some scouting could be done beforehand. I'd also do an overall analyais on the state-of-art of current legislation, gaps and main challenges to users, companies and developers in order to see in what to focus on, at first.\r\nIt could clearer in the proposal how the website/platform will be created. Will it be from a 3rd party or developed within the team? It is also mentioned phase 2, but no explained what it is about.\r\nOne problem I see here is the scalability of it. It doesnt if the scope is local or global, but as it uses LSDAS, it seems focused on the US. How could it be expanded worldwide, as every country has its own legislation? This definetly a challenge to overcome but also an opportunity to learn and help legislators and companies (compliance here would play a big role) with \"global benchmarks\", in a subject that is still embrionary.", "q0r": 5, "q1": "4 already committed people with legal and blockchain background seems a great start, enough to implement it. Maybe more people to maintain it will be needed as network grows but it can be solved as the project goes.\r\nIf the platform will be developed within the team, someone with development expertise will be needed. Marketing and video editing knowledge would also come in hand. ", "q1r": 4, "q2": "There are some deliverables but no major milestones or kpis are mentioned. It would be interesting to see how many lawyers they could engage as project progresses, how many content and template they generate, everything with a target per period.\r\n\r\nI like the idea of having a board to oversight the project because it helps to mitigate risks related to quality (in content, templates, dicussions, etc)", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The implementation of this proposal could be a first step in the direction closing the gap between legal competences and software development competences.\r\n\r\nHaving a pool of legal experts and law students would bring a new set of skill within for the growing developer community.\r\n\r\nThe proposal is aiming to work within the US national law frame", "q0r": 4, "q1": "The team has multi-decade experience in the following topics:\r\n\r\nteaching jurisprudence, contracts, legal reasoning and theories of justice, corporate law,practicing trusts, estates and tax law.\r\n\r\nWithin the team are present also developing skills: experience teaching writing, mathematics with a current focus on blockchain full stack development.", "q1r": 4, "q2": "The team will have various deliverables as output of the Phase 1 of the project (expectad duration 4 months).\r\nAuditing these deliverables such as: website, series of educational videos, set of sample contract templates, could be an efficient way to evaluate the project", "q2r": 4, "assessor": "z_assessor_356", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "There is a great need for legal advice and Cardano implementations. With smart contracts alone: legal advice is needed, but with governance and other Cardano needs: legal counsel is more important to this chain than most others.", "q0r": 4, "q1": "The experience appears to be plentiful to take this proposal to a success. https://www.keplerscs.com/our-team-1 appears to be the best page and resource for their team's experience overview. They seem to have a variety of legal experience, as well as a few members with technical skills. They seem to have a good mix of what is needed to bring expert legal blockchain advice.", "q1r": 5, "q2": "Information is sufficient to audit. The proposal is a good one that addresses important issues. With Cardano: more developers are thinking in terms of projects that could use legal counsel, and this project could help projects avoid legal hassles and being shut down due to compliance issues. However, $98,000 is nearly 10% of the whole Developer Ecosystem budget. I would think that the community could find a way to advertise Kepler's services to where they could gain much of the community as clients, and have them work in their project costs into the costs of other's projects that need legal counsel. The community does need \"go to\" legal counsel that is readily available, however, so if there is room in the budget for this project: it may be worth the costs.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The Developer Ecosystem challenge asks how we can \"make a positive developer experience\" in cardano and how we can allows developers to \"focus on business value they can generate and not on infrastructure\". This proposal aims to ease the legal burdens developers might face when building for cardano. This proposal aims to create legal templates which are highly scalable.\r\n\r\nOne thing that's missing is KPIs and metrics by which we can measure the outcomes of the proposal. Some possibly interesting metrics could be: number of templates generated, number of jurisdictions covered, and number of developer hours saved with the templates (though this would be very hard to calculate effectively). \r\n\r\nI give this a rating of 5 because I personally have experience building businesses and being a developer. I know the firsthand pain of dealing with the law as a developer not having legal expertise myself. It's expensive and cumbersome and hard to know if you're \"doing it right\". Having these templates is a scalable way of helping all developers within the ecosystem.", "q0r": 5, "q1": "The team behind this proposal has linked to a website of a legal company. The proposers claim to have decades of experience in the professions. These are very positive signals for the feasibility of this project. One thing that's missing is links to the LinkedIn of the members of the proposal for further validation of their experience. \r\n\r\nThe project is large in scope but each of the tasks of the project have a well defined for example \"Months 1-3:  outreach to lawyers through national and state bar associations: ($3000)\". Each of the tasks comes with a budget which is very helpful. This breakdown of funding helps CAs accurately asses the complexity and relative expense each task.\r\n\r\nIt's unclear how well the team will be able to deliver on non-legal aspects of the proposal like website building and creating educational videos. The proposal also lacks a \"Risks and Challenges\" section which outlines how they might fail to deliver the proposal.\r\n\r\nOverall I strongly agree (5) that this proposal has high feasibility. While the proposal isn't perfect, I do believe that the team can deliver on what they out to deliver. I like that they have a second phase which they will request funding for in a future Fund.", "q1r": 5, "q2": "I think this proposal lacks auditability considering the amount of expertise and experience on the team. While I do believe many of the tasks within the proposal are important, it's hard for me to know how well many of the tasks will be carried out.\r\n\r\nFor example, how do we measure the success of \"outreach to lawyers through national and state bar associations\" or \"sponsor essay competition for law students to write white papers for publication in leading blockchain and public policy journals on legal questions of concern to the developer community\". That being said, some of the tasks do include numeric metrics like \"organize and host a series of eight legal workshops on a range of topics based on input from the developer community. The workshops will be hosted on Zoom with recordings available on project Youtube channel\" which is very auditable. We can easily go to youtube and see if 8 videos of legal workshops have been uploaded.\r\n\r\nI mentioned in the impact section that KPIs are missing. I think it would be great have clearly identified metrics like \"outreach to 30+ legal institutions in 10 states\" or \"sponsor essay competition aiming to receive 30 submissions with at least 1 publication in a leading journal\". \r\n\r\nI very much like how each task is broken down and that enables the community to ask \"was this task completed\" but it doesn't let us ask \"how well was this task completed\". Given the experience of the team I expect more thoroughness on the auditability of the proposal. I recommend adding more numbers to each of the tasks within the proposal. Because of this, I give this proposal a score of 2 for auditability.", "q2r": 2, "assessor": "z_assessor_531", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "このプロジェクトは、弁護士のネットワークを構築して、契約書のテンプレートを作成し、開発者コミュニティに法的ガイダンスを提供することを目的としています。", "experience": "法的な指導、教育リソースを作成するプロジェクトのディレクター、ネットワーク構築、ブロックチェーンスタック開発者。"}