{"id": 369899, "author": "", "title": "Heidrun Expansion Upgrades - Part 2", "url": "https://cardano.ideascale.com/a/dtd/369899-48088", "category": 26094, "amount": 20000, "description": "Heidrunは、カスタムアプリケーションとCardanoの統合を可能にする素晴らしいツールですが、現在サポートされている機能ではアプリの範囲が限られています。", "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is to add 2 functions relating to tracking Native payments to an existing open-source system that allows easy addition of ADA payments triggers linked to actions for developers. The question must be asked now that we have moved into the time of smart contracts, whether this type of functionality that requires trust and runs offchain is the best way for developers to go forward with this type of functionality.\r\nIt should be noted this $20k proposal is one of 4 proposals totaling $85k each adding 1 to three functions", "q0r": 4, "q1": "The proposer created the initial software and is asking for funding to increase functionality. There is no reason to thing they won't be able to deliver. However the plan is 3 months to plan who to implement then another 3 months to deliver. That implies the proposer has not yet planned how to deliver this project which implies some risk on successful delivery. It would be nice to see a breakdown justification of the budget. How many hours of work does the proposer believe implantation of these 2 functions will take?", "q1r": 4, "q2": "The proposal is a simple deliverable of 2 additional functions, in that sense it is easy to audit delivery. The metrics for success should have some clear goals as to how many implementations using the functions would be considered a success.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposer starts with a problem statement that his related to his product/project instead of identifying a problem within the challenge that he wants to solve. It would be better to start with how this proposal is addressing the challenge. However, this proposal is based on Fund 3 proposal that is already in progress. This proposal seeks for funding to add further methods and functionality to this API. Therefore, it lays within the challenge. To get a higher rating more context about how (not only saying that) it positively impacts the adaption of Cardano. ", "q0r": 4, "q1": "Heidrun is an open source API to integrates Cardano payments into custom applications. The presented plan to further add functionality is well described and from my standpoint reasonable. The team is well-known in Catalyst and has already proven their ability to create complex solutions. In order to get a better rating, I would like to see more technical details to fully understand and assess the scope of this project. I expect that this team will successfully implement this proposal. ", "q1r": 5, "q2": "The team has defined a clear date of delivery in combination with some metrics how a successful implementation will look like. Furthermore, there is a Github repository linked, where the community can track the progress of this proposal.\r\nTo improve auditability, I recommend to add a specific number of new application using Heidrun instead of saying 'numerous'. In summary, they provide us with sufficient information to audit this proposal.\r\n", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Heidrum platform is already available to Cardano developers that makes integration of applications simpler. Adding functionalities to this platform as this proposal states, will help on developer adoption and productivity. Definitively this proposal is aligned with the goal of the Challenge.", "q0r": 5, "q1": "There's a clear definition of the deliverables that are two new functions to the current Heidrum platform. The team have already shown expertise building this platform and with other fund challenges. Also, budget and timeliness are well defined for this development. For those reason the successfulness of this proposal can be guaranteed.", "q1r": 5, "q2": "As there's a well defines scope of work, with due dates and allocated budget for development, \tthe transparency and auditability of this proposal cab be assured.", "q2r": 5, "assessor": "z_assessor_554", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Heidrunを拡張して新たな機能をサポートすることで、アプリケーションの幅が広がり、Cardanoのビルダーのターゲットプールが急速に拡大します。", "experience": "QuinnとKyleは、どちらも実績のあるベテラン開発者です。Adosiaは、Heidrunの最初のイテレーションを提供しました。"}