{"id": 369876, "author": "", "title": "Marketing for Ada Integration Tools", "url": "https://cardano.ideascale.com/a/dtd/369876-48088", "category": 26094, "amount": 30000, "description": "電子商取引や開発者向けアプリケーションにAda決済やカスタムCardano統合を可能にするツールは、専門的に販売されていません。", "f6_no_assessments": 7, "f6_rating": 3.4285714285714284, "videos": [], "media": [], "f6_assessments": [{"q0": "Whilst this may be a great tool, how is a proposal to fund a marketing campaign for an existing tool helping the developer ecosystem? A quick check on the github page states the tool is sill in Beta testing. when will it be ready for release. Would it not be better to ask for funding under this challenge to get the product to a releasable stage?", "q0r": 2, "q1": "As the proposal is merely to spend funds on a marketing campaign, its likely the proposer can achieve this. However how does that successfully improve the developer ecosystem?", "q1r": 3, "q2": "The proposal is just to spend the money on marketing. Assuming we did want to fund a pure marketing campaign, to audit progress and success there needs to be clear goals and metrics around every stage in terms on views, clicks engagements, conversions etc. ", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to attract new developers who use two specific plugins / platforms through a marketing campaign and targeted paid ad campaigns and this concept is in line with some of the challenge goals (attract developers into the Cardano Community).\r\nIn general the approach can obviously work (advertising always attracts new people?) but, as a web developer with more than 9 years of experience, I think the advertising tool for this kind of things is not very effective: if I were to integrate in a site one of the features provided by the plugins / frameworks indicated, I would prefer to find tutorials, documentation and examples, instead of being targeted by a campaign.", "q0r": 3, "q1": "The proposers are well-know in the community, they were funded in previous catalyst rounds and their previous experience in the digital marketing world is obviously very suitable for the proposal.\r\nAt the same time, what should be the core of the proposal, the \"marketing content\" is described only in a generic way: I would focus about this aspect to better explain to voters and CAs what will be produced in parallel with clicks, views and email collection and I would add some specific information about the social platform that you intend to use (only Youtube is explictly mentioned).\r\nThere is a budget breakdown, but it would be great to have some estimations about the numbers related to the various paid targeting campaigns (e.g. estimations of views / clicks with $15k?)\r\nIt would be also good to add an operational plan relating to the dates on which the contents will be produced, the various campaigns launched, etc.", "q1r": 3, "q2": "The definition of success is described, and it is clear how can be verified the successful implementation of the proposal. However, for a marketing proposal that relies on digital tools and aims to promote two specific dev tools, I would have expected to find specific numbers as goals for the developers onboarded, plugins installations, repo using the tools, etc.\r\nThe metrics indicated to track the success of the proposal are only generic and sometimes not really realistic: \r\nHow do you think, for example, of tracing the adoption by + 1M of new users on Cardano to your marketing campaign?\r\nIt would be really difficult for the community to be able to monitor such a thing: I would probably focus more on providing numbers and KPIs for the main recipients of the campaign, i.e. developers.", "q2r": 2, "assessor": "z_assessor_147", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "The proposal highlighted a unique problem and offered a solution which is short but clear with example use case of the solution . great work by the team.\r\nI agree", "q0r": 4, "q1": "The proposal provided links to given experience and a detailed implementation plan with cost implications.\r\nI agree.", "q1r": 4, "q2": "the proposal provided some information that will help to audit the progress and success of the proposal solution , however the milestones provided is not very clear and increases the difficulty in auditing the progress of the proposal.\r\nIt will be helpful to the proposal if the milestones and timelines are broken down further to help easily track progress.\r\nI can neither agree or disagree.", "q2r": 3, "assessor": "z_assessor_331", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The ADA payment gateways are not popular due to the value appreciation of ADA. There is a more complex mechanism at play than a simple advertisement requirement. Moreover, there is no major benefit to the ecosystem for the 30K USD proposed.", "q0r": 2, "q1": "The proposal is for online advertisement and therefore it is just hiring of online services for advertisement. This is likely to be implemented successfully. ", "q1r": 5, "q2": "The proposal's success is quite easy to measure in the literal sense, but it is difficult to measure the effect of this advertising campaign on the developer ecosystem of cadarno. Most of the advertisement campaigns will also provide readymade reports on the progress. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is asking for marketing budget to market two applications/tools by the two proposers. For me the question arises, how this will improve directly our developer ecosystem. I agree that availability of tools doesn't mean that they are used. But marketing on its own does not replace a missing go-to-market strategy for these tools. More explanation about the marketing strategy and a directly linkage to the challenge would help to see the positive impact of this proposal to Cardano.", "q0r": 3, "q1": "What content will be created, what will it look like, how will it reach its target audience? From my own experience, I know that it's easy to waste money on online marketing if there's no structured plan. Paid ads without a clear call-to-action (such as a landing page) are likely to go nowhere (again, from my experience). As a marketing expert, I miss aspects like a media plan, a marketing strategy, different audience profiles. What other channels besides Youtube do they want to use? The budget breakdown only shows ad spend. But what about campaign management?  Adjusting settings and monitoring conversion rates is the most important part for a campaign's success! It's possible that the proposer has experience with good marketing, but with the plan in place, I highly doubt that the campaign will be successful.", "q1r": 2, "q2": "As mentioned above, to track a marketing campaign, we need more metrics and a media plan. Which channels will be used? What is the expected outcome of each channel? How is the campaign managed? What is the timeline? Without answering these aspects upfront, these efforts are not auditable. I recommend to add much more details in a future proposal to increase the chance of getting funded. ", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is in the right challenge, as it aims to better and grow the developer ecosystem.\r\nIntegration tools are in my opinion as a developer the first step for any dev community to grow. You need to have plugins done by more experienced people to enable less experienced devs to grow the tree of DApps. In that regard, the proposal is spot on!", "q0r": 5, "q1": "The linked profiles and Github repositories are more than enough to convince me of the credibility of the whole proposal. These are both names that I've already heard getting to know the community behind ADA.\r\nI like the practicality of the proposal since it's really hands-on and in perfect alignment with what the ecosystem needs right now as it's starting to grow.\r\nTher could have been a more detailed roadmap, but what's given now is also doable and adds plenty of understanding to the plans of the project.\r\n", "q1r": 5, "q2": "As a suggestion, I'd recommend to the proposer to have a more detailed explanation of the budget distribution and timetables, to enable non-tech-savvy community members to follow the progress of the proposal. Another thing would be better-defined KPIs, although it's very important to say they have the right idea and are headed in the right direction for sure.\r\nAs a developer, I'd be happy to follow the progress in Github, but a news letter with each newly reached milestone would be also a great idea. The authors of the proposal may have this planned already, but it wasn't mentioned in the proposal and that's why I'm mentioning it here.\r\nGood luck!", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I believe this proposal effectively meets the criteria of this challenge of growing the developer ecosystem through the use of this plugin that developers and website owners alike can integrate into their websites to allow payments using Cardano.\r\n\r\nThis in my view, is a crucial type of project which offers a seamless plugin to install on a WordPress website which, for the uninitiated 28% of all online stores. The kind of traction this project could generate for Cardano is potentially monumental, and marketing this plugin to developers is the next step in gaining real-world usage for Cardano.", "q0r": 5, "q1": "Given the long history and experience of the team behind this proposal, given the fact that have already built the plugin and it is ready for usage - I find it highly probably that this proposal is successful in gaining real-world usage with developers and owners of wordpress websites.", "q1r": 5, "q2": "The roadmap looks great and the proposer has provided a lot of detail with milestones that make sense for this proposal. However I would like to see specific KPIs for each milestone included to more carefully asses the likelihood of a successfully implemented proposal and what that would look like in exact terms.\r\n\r\n\"after 3 months we would like to see the campaign achieve success at converting emails favorably,\" - this should include a KPI with a targeted conversion ratio for example.\r\n\r\n\"after 6 months we would like to see developers begin to deploy more custom applications utilizing Heidrun\" - this should include a desired number of developers as another example.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Adosia社のHiedrunとAdam Dean社のMercury Wordpress payment Pluginを、ターゲットを絞った有料広告キャンペーンやコンテンツマーケティングを通じてプロモートする。", "experience": "Pivoting以前のAdosiaは、1B以上の広告インプレッションを配信するアドテクノロジーのイニシアチブをとっていました。カイルは、デジタルマーケティングの経験が豊富です。"}