{"id": 370083, "author": "", "title": "Cardanoscan API Service", "url": "https://cardano.ideascale.com/a/dtd/370083-48088", "category": 26094, "amount": 68000, "description": "インフラ管理に無駄な時間を費やすことなく、開発者のためのサーバーレスのバックエンドサービスとAPIが必要です。", "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Great proposal to create an API to a an existing service to allow dev's to query the blockchain rather than having to run their own nodes and run dbsync. This will reduce costs and simplify the system for dev's to new applications on Cardano tested and up and running.", "q0r": 5, "q1": "This is a simple plan to ad API's to the Cardanoscan service, a project the proposer shave previously received funding for and delivered. There is no reason to doubt they will be able to successfully deliver.", "q1r": 5, "q2": "The proposal has a clear plan and deliverables. Whilst there are not really milestones, the final timeline of 45days is relatively short. It would be nice include some metrics for success with attached goals such as number of projects using the library and the number of users those projects have. Basically what impact will delivery of this project have on the Cardano ecosystem. What impact are voters getting for funding this project. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "As the problem statement refers to API services to be provided for the data in Cardanoscan explorer as the data is already being used by cardano scan opening it for developers will effectively address the existing problems that developers are facing in fetching/ accessing the data.", "q0r": 5, "q1": "Since the team of developers of Cardanoscan have done a great job in building cardanoscan platform and have also come to know from community that they have completed their previously funded proposal this should be successfully completed with their current experience", "q1r": 5, "q2": "The information provided in detail addresses the proposer's intended info to be conveyed both about the fund break down and estimated timeframe on which the progress and success can be measured.", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "As they already have main net and a test net explorer which is vastly helping developer community, this proposal would give easier access to their data so developers can build D-Apps around them. This will effectively addresses the challenge.", "q0r": 5, "q1": "The proposer and their team has been involved in cardano from couple of rounds in catalyst also have delivered one of their previous proposal, Also the plan provided looks promising this indicates they will be successfully able to deliver.", "q1r": 5, "q2": "The proposer has provided detailed fund break down and timeline which will be helpful to track the progress and success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "This is a good 3rd party API service that can extend the capability of websites and apps. This proposal opens a bridge to Cardano where developers can work with many different coding languages. It effectively addresses the challenge.", "q0r": 5, "q1": "Cardanoscan is a blockchain explorer which over 250,000 users access. They have been funded multiple times so this implementation should also be successful.", "q1r": 5, "q2": "The milestones and metrics need to be more clearly defined and have clear KPIs associated with them. There is only one deliverable, so the audit will rely on a successful application on the Mainnet as the only determination of this proposal being completed successfully.", "q2r": 4, "assessor": "z_assessor_449", "no_vca": 14, "ne": 2, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "This API service is going to be really helpful for developers and thinkers to come up with the different new products by using this.", "q0r": 5, "q1": "Team has great background of building these kind of products and cardanoscan is already running successfully. Recently team has launched testnet support in wallet.", "q1r": 5, "q2": "Idea is presented very well and structured which will make this a successful proposal.", "q2r": 5, "assessor": "z_assessor_538", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "Cardanoscanは、広く使われているCardanoのエクスプローラーです。私たちは、cardanoscanデータのAPIでエコシステムのためのAPIサービスを作成します。", "experience": "私はcardanoscan explorerの生みの親であり、このプロジェクトのリーダーを務めます。"}