{"id": 381405, "author": "dwayne", "title": "DAO-NET: Multilingual Translation", "url": "https://cardano.ideascale.com/a/dtd/381405-48088", "category": 26252, "amount": 19000, "description": "Translating and creating multilingual platforms requires sustained funding however Catalyst funding is for specific projects.", "funded": 2, "upvotes": 68055931, "downvotes": 3385966, "votes_result": 64669965, "votes_cast": 174, "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal meets the objectives of the challenge well, as it seeks to create a DAO that will provide funding for different translators to work on different projects, with the goal of initially translating a voting page. The idea here is, as I understand it, to get as much content of this type translated into as many languages ​​as possible. What was a little confusing in my view is whether the project aims to translate only this type of content (voting) or intends, later, to start producing other types of projects. It is positive that the authors have already defined translators and partners, because this project is not going to materialize only from the technical side, and having professionals in this area of ​​translation in mind will already accelerate part of the development process. Therefore, I believe that what was lacking would be the understanding of what would happen beyond the translation of the voting contents; other than that, I believe that the proposal is very relevant to the challenge, as it directly addresses the premise of taking content from the Cardano ecosystem to different people who are not English speakers.", "q0r": 4, "q1": "The proposal authors have a lot of involvement with our blockchain, being Plutus pioneers, SPO operators, CAs and etc., according to what is said. We are provided with a brief description of the duo, in which we can identify their names, areas of expertise and their linkedin profiles are also attached, where we can see more about their trajectory and get to know them in more detail. I believe they have a lot of confidence in their ability to promote this project, as they have so much experience with the blockchain and already participate in the ecosystem through their pools and Catalyst. They also attach a roadmap, which breaks down into months what would be done through a topic listing. With this, it is possible to have a view of the whole, a solid understanding of the process, because we know what activities will be done and in what order to result in the final product. And finally, they share how the funding would be used. About this part, I would like to comment that, in my opinion, I could have had more details on the two topics that are not Algorithmic DAO Smart Contract. For example, in the translation part, they set aside $6,000 from which we don't know how many people will be divided, what the cost of the translator's work hour, if all translators would earn the same amount (or suddenly whoever knows how to translate a less common language , which is more difficult to find translators, would earn more...). Therefore, this part left a little to be desired in terms of detail, if there were more explanations, we would have a more specific view of what would happen with the requested money.", "q1r": 4, "q2": "The authors establish a series of KPIs, which can be used to objectively understand the main results to be achieved with this project. It is noted that they dialogue directly with the objectives of the challenge, further reinforcing the issue of impact; and through them, it is possible to monitor in a simple way if what was proposed was achieved. The definitions of success according to the months are also provided, that is, the authors were careful to detail the specific objectives according to the passage of time, making the auditability of the project totally possible. In my view, as it is a platform that will guide other platforms, and there would be several languages ​​being worked, with very different people being reached, it is complicated to elect community members to work with the auditability of this project (there are many different things to be monitored and they would have to be people who speak the present languages). I believe it is better that the project team itself, together with its translators, promote this monitoring and organize the data collected in reports to be exposed to the community. This could be done in conjunction with the presentation of the results of other funded proposals from the challenge, for example, during Town Hall or by other means of communication with the Cardano community.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Very good idea! Creating a dao for translators can basically solve this challenge fund for good! \r\n\r\nDefinetly in accordance to the challenge goal and being very effective!\r\n\r\nRating given 5.", "q0r": 5, "q1": "Based on the information in the proposal, it is highly likely that they will implement the proposal successfully.\r\n\r\nI find their experience and skill suitable for the aim, the only drawback are missing positions to be filled.\r\n\r\nBesides that, I am confident.\r\n\r\nRating given 4.", "q1r": 4, "q2": "The roadmap is provided in very detail, sufficient for audit.\r\n\r\nAlso, the relevant KPIs are stated, along with a budget description increasing the possibility to audit.\r\n\r\nAlong with addressing possible risks and their mitigation, IP being open source, the progress and the outcome will be transparent.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "Cardano is a growing ecosystem, and adoption is crucial part for its success. Multilingual resources is still limited, and needs initiative and funding (for example, through this Fund 7 challenge setting). This proposal will create a DAO, that will govern around this multilingual resource ecosystem in Cardano. Although we already have Project Catalyst to fund these project, it just wouldn't enough to kickstart and fund a lot of multilingual resource in this early stages. DAO-NET will help to address this, by creating a DAO specifically to fund translators for various documentations, software interfaces, videos, etc. However, this proposal doesn't belong in this challenge, since the product they're building are DAOs, not the multilingual resource itself. It should be placed under 'DAOs <3 Cardano' challenge category. I acknowledge that this team have another proposal on DID challenge setting, but it would be better if they could combine this to one single DAO-NET proposal under the DAO challenge category. ", "q0r": 3, "q1": "This proposal provide team's linkedin profile, and able to prove that they have the experience needed for this type of project. This proposal can identify the skill requirements for Product Manager and the Lead Developer, both explained well. This proposal laid out the plan in details, from the roadmap, action plans, goals and achievement for each months. The budgets is explained in identifiable manner, and future funding consideration also provided. The team able to identify the risk and explain the mitigation solution, such as DAOs regulations, and bad actors from the participants within the DAO ecosystem. Overall, this is a well written and comprehensive proposal and have a high chance of successfully implemented. ", "q1r": 5, "q2": "The roadmap is well explained, with achievements and goals laid out in details. Metrics and KPIs are also provided, such as number of non-English speakers joining Cardano/DAO-NET community. However, it would be better if they provide the target number for each metrics, such as 100 people minimum joining the DAO-NET community.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "It is true that AI-based automatic translation tools have many shortcomings, but I think that it should still be focused on developing them rather than investing in traditional translation. Automation is the trend of current world. We need to invest in the right places to minimize waste of resources. However, in the short term, traditional translation still proves its superiority based on accuracy and sensitiveness.", "q0r": 3, "q1": "The team has many years of experience in the related field and present it well in the proposal. The proposal also includes a specific and reasonable plan (including phases and desired output for each phase). They also analyze risks and have corresponding provisions for those risks.", "q1r": 5, "q2": "The proposal includes KPIs along with Success Definition. Moreover, the outcome of project is easy to audit (output is document).", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Create a DAO, with sustained funding for translators, to provide translations for software interfaces, documentation, meetings and videos.", "experience": "An experienced team of Blockchain developers, Plutus pioneers, SPO operators, Community Advisors and Solutions Analysts."}