{"id": 381834, "author": "tienna", "title": "Townhall Channel in Vietnamese", "url": "https://cardano.ideascale.com/a/dtd/381834-48088", "category": 26252, "amount": 17100, "description": "Strategy info from the weekly Cardano Townhall has not promptly reached the majority of Vietnamese and avoid mis/disinformation.", "funded": 1, "upvotes": 49591230, "downvotes": 14876190, "votes_result": 34715040, "votes_cast": 205, "f6_no_assessments": 10, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal fully meets what the challenge asks for, as it intends to produce summaries of Town Halls for Vietnamese, bringing the main news from the Cardano ecosystem to the Vietnamese in a practical and quick way (the summaries would have a maximum of 30 minutes, and would also be available in podcast version). I thought it was an extremely good idea, in my view it would be perfect to be done in all languages! Because as a two-fund Catalyst participant, I can assure you that I suffer from this ailment, I can't keep up with the Town Halls very well, both because I usually have college classes at the time it's broadcast (which isn't that much of a problem , as they are recorded), but mainly because they are in English. I can read, write and speak English, but understanding an entire meeting in the language, plus the fact that most presenters are native English so have an accent, makes it very difficult to follow the content. For the Vietnamese the situation should be similar, which makes this idea very useful, keeping up with major ecosystem updates is something every member of the community should do, and certainly this proposal will make this more possible for the Vietnamese. Another positive point I found here was that the authors already have a project funded by f6, which demonstrates that they have competence and experience with our ecosystem and with Catalyst, and it is also very useful that they already have a site created where this new content could be introduced.", "q0r": 5, "q1": "The project team proves to be very well prepared to carry it out, because they provide a small individual description of who they are, which is summed up by their contacts on social networks, making real the possibility of making direct contact and getting to know them better, and also the fact that they already have a project that was funded in f6. About the script, they present which phases would need to be completed to reach their goals, but I believe that these phases could be explored further. For example, in the part providing the summaries for the main communication channels in Vietnam about Cardano: how would this bridge be built? What would \"workflow\" be in the first phase? It is always good to explain each term in detail, so that people who are not familiar with it fully understand the proposal. In relation to the budget, I believe that the level of detail here was high, and with that, satisfactory. We know what each part of the project will cost, and regarding variable costs, they are very well calculated, broken down and explained so that we can understand exactly what would happen here. So I think the only thing I would suggest would be a little more detail in the phases.", "q1r": 4, "q2": "I found it interesting how concerned the team is with auditability. They are not only careful to pass on information that would help the rest of the community to monitor the progress of the project, but they drew up an aubitability plan in which they would monitor the project's growth, according to the number of visits to the site. , podcast listeners, and so on. That way, all we would need to do is have access to such information as well, which they would generate weekly, but could present to us monthly, or every 2 months, for example. I believe that monitoring this project is relatively simple, compared to other proposals, and has already been very well supported by the team itself.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 16, "ne": 12, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposer identifies the problem that the information from the weekly Cardano Townhall does not reach the majority of Vietnamese and presents as a solution the creation of a podcast with a summary of the main townhall. This proposal is in line with the challenge as it has the potential to increase the engagement of Vietnamese in the Cardano community. The proposer is not sure if he will continue with the project after the funding period and whether the project continues will depend on further funding from Catalyst. ", "q0r": 4, "q1": "The proposer provides evidence of the experiences of each member of the team. The budget is detailed and appears to be reasonable. The deadline for completing the work is realistic. The proposal presents a detailed plan of what will be done. The proposer considered the risks to control the project.", "q1r": 5, "q2": "The proposal clearly presents the target problem and its solution. A roadmap with milestones is provided which is important for tracking the progress of the proposal. It also presents KPIs that are necessary for evaluating the success of the work.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 15, "ne": 3, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The problem needing to be solved been identified and articulated namely that the info from the weekly Cardano Townhall has not promptly reached the majority of Vietnamese because its in English. Another issue is that the meetings are held at a very inconvenient time of 1am (Vietnam Time). It is clear that this proposal falls within the scope of the challenge brief by providing Vietnamese content for the people in Vietnam regarding Town Hall content.This proposal shows clearly how it adds value to the Cardano system as it would enable  Vietnamese to understand everything about Cardano and the Town Hall content. Key metrics are clear, reasonable and realistic. THese include  Number of Episodes, how many viewers, how much feedback from the community, how many subscriptions, how many comments, how many members of the community. The key metrics and goals of the proposal fall within the scope of the challenge.Proposal can scale to address future challenges by increasing the numbers of Town Hall meeting recordings. This project will have a positive impact on Cardano system by increasing the awareness and trust  among Vietnamese. \r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.", "q0r": 4, "q1": "The proposers have   provided evidence  of themselves where he is a managing the Eastern Town Hall activities  . They have included his LinkedIn profile. The links are sufficient. I have visited the links.The proposer is competent to build this content. \r\nThe proposal  gives has given details of other team members\r\n He has provided the team structure of members and their capabilities and other partners who he would work with such as experts, developers etc.The budget has  been outlined clearly and broken down into identifiable items. Clear costs have been given for the various hosting fees on platforms and marketing campaign costs as well as podcast apps.   The budget is  not reasonable to achieve the set goals.  The costs are higher than I feel are reasonable. For example 1500 USD to develop a website of this nature is too high. Text to speech convertors may not cost this much. The cost per video has been taken as 360-400 USD which is high for a video of this nature. Typically videos like this are not costed per word but per audio minute. As such a video like this may cost around 200 USD each.Labor cost has been taken as 60 USD per hour which is far too high even by Western standards, leave alone Vietnamese rates.  A Labor cost of 20 USD is more reasonable. \r\nThey have a massive reserve of 1700 USD which I feel is too high. The proposer has not provided a verifiable plan if additional funding is required but has kept a massive contingency fund. \r\n\r\nThe timetable is realstic to build the site and related content.The proposal  provides  a sensible and conductible plan for implementation. It has a very practical plan with detailed breakdown in terms of the various stages of site production. The costs stated are too high in my professional opinion as one who runs a translation agency and does translation and audio production as well as have run a web development company for 10 years.\r\nResources  necessary to implement the proposal are described. The proposal has technical aspects which have been addressed. The proposer has not identified risks in this proposal but has allocated a large contingency fund. Even though this project has team members who could do the work, the extremely high cost allocations make me  disagree with this budget, hence my rating of two stars. \r\n \r\n\r\n", "q1r": 2, "q2": "Is there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\n \r\nThere is a clear roadmap with milestones and a time horizon for achievement  \r\nThere are  clearly defined Metrics/KPIs that define the success of the proposal  they could define number of subscribers, number of podcast episodes and videos created , how many comments and interaction from the community, no of feedback comments.There is a clear understandable description of the targeted problem . \r\n  \r\nThe proposer has not identified possible hurdles, challenges and difficulties.\r\n They have allocated a fund for possible contingencies of 100$ per week. \r\n\r\n\r\nThe information provided is may not be sufficient to audit the progress and the success of the proposal hence i have given a 3 star rating. \r\n", "q2r": 3, "assessor": "z_assessor_460", "no_vca": 12, "ne": 2, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "The proposal aligns with the challenge as the solution proposed is to get all the townhall information (videos) translated into Vietnamese to make it accessible for people there.", "q0r": 5, "q1": "The team behind this proposal is familiar with the catalyst Funding and was successful for a proposal they submitted in the previous fund cycle. This situation allows them to identify what are the gaps to be filled in order for the Cardano message reaches to as many people as possible.\r\nThe work that the group has started with the publication of the https://cardano2vn.io/ website, is already a tangible of what has been done, and that would be continued by adding a section named: Townhall2vn containing all those materials (video & podcast. I think the is proposal would be successful.\r\nThe budget and the roadmap are clear and well detailed. ", "q1r": 5, "q2": "The follow-up mechanism is in place through the https://cardano.ideascale.com/a/dtd/Townhall-Channel-in-Vietnamese/381834-48088#:~:text=https%3A//github.com/cardano2vn, where people may check the progress. Also, risks have been raised, and ideas on how to tackle them. the financial aspect was more considered, but I would like to also learn about any other challenge that the team think they may face. But by being out of the proposers team, I assume they have more knowledge about their internal resources and capacity to undertake such a project.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal has everything that is needed, a well explained timeline and budget, clear plans for success and facts to support their reasons. Their budget of $17 100 might be a little overpriced.", "q0r": 5, "q1": "The proposer/s already have lots of experience in this area as they already participated in Fund6 and were successful. Their plan is clear and simple, they have a timeline and budget.", "q1r": 5, "q2": "Due to the proposers experience it is clear the this proposal will be easy to audit. They have planned what they will do monthly as well as having an exact picture of success.", "q2r": 5, "assessor": "z_assessor_585", "no_vca": 16, "ne": 2, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "Great idea! The team clearly points to the problem of time differences and the problem of language barriers as far as Vietnam is concerned and offers a great solution. The proposal clearly shows that if this idea were to be realized, the Cardano ecosystem would expand into the Vietnamese market, and this could have a positive impact and certain value for Cardano ecosystem. KPIs in the proposal match the ones indicated in the challenge and proposal is able to scale and address future challenges.", "q0r": 4, "q1": "This team has the necessary skills, knowledge and experience and everything is transparently displayed and everything can be checked via LinkedIn, Twitter, Facebook. The proposal clearly presents the team and the budget is reasonable and it is broken down into identifiable items. The additional funding is not required to implement the proposal. The team has made a very detailed plan with all the details of the actionable tasks and the order of execution and the proposal has clearly set time frames in which the work will be completed. The team clearly explains the technical aspects and presents what is needed for the project to be realized. The team is aware of the possible risks and that is the reason why they left $ 1700 of the requested budget aside. But the question is what if there will be no risk, where will the money end up?", "q1r": 4, "q2": "The team prepared an excellent roadmap with milestones and thus a framework for the realization of this project. There are metric / KPIs that define the success of a project and make perfect sense and metrics can be used to track the success of a project. The community can track the progress of the proposal without any problems.", "q2r": 4, "assessor": "z_assessor_656", "no_vca": 16, "ne": 6, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "I strongly agree the proposal is impactful because the proposal addresses the objectives in the challenge's success:\r\n    - Increase adoption and community engagement of non-English speakers\r\n    -  Increase amount of resources in a variety of languages\r\nThe proposal not only identifies a problem within the challenge (English language could be the barrier for lots of Vietnamese when they try to learn about Cardano and Project Catalyst) but also clearly articulates how it will add value to the Cardano ecosystem .", "q0r": 5, "q1": "I strongly agree that the proposal is likely to be successfully implemented because of following points:\r\n- The proposal provide a website 'Bring Cardano to Vietnam' (the winning project in Fund6) where translations, podcasts from the Townhall meeting will be posting. Moreover, the team is highly engaged fulltime Catalyst Community members and 3 members of the team are in The Eastern Town Hall Team who successfully organize and host online events  for Asian communities since Fund 5 (a Google document about Eastern Town Hall Zoom live participants record is included). These things are strong evidences of the team's experience and relevant skills fulfilling for the successful implementation. Type and number of team members and roles are also provided in details in the proposal. \r\n- The budget is clear and broken down into identifiable items extremely clear understandable, so that the budget is reasonable to achieve the set goals.\r\n- The plan of the proposal is sensible and conductible with roadmap and milestones and timetable outlined clearly.\r\n- The risk which is relevant to the success of the proposal, is considered and controled.", "q1r": 5, "q2": "Roadmap with milestone and time horizon as well as metrics/KPIs are set clearly, make the proposal easy to be tracked. Additionally, the team commits to delivering transparency by keeping track of all activities in the website. Therefore, I rate auditability with a score of 5.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 13, "ne": 3, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This seems like a good proposal by a team who are currently doing such activities to the Vietnamese community. \r\n\r\nIt would be great if the proposal give some details on how big this community (ie: how many people in some major facebook group about cardano or blockchain..) is so voters can imagine what is the level of impact to the cardano community.", "q0r": 5, "q1": "The proposal team is already doing such activities on a pro-bono basis. \r\n\r\nIt is extremely likely that this proposal will be implemented successfully. \r\n\r\nThe details of the plan is very detail and make sense: ie. hour involve, the calculation about the number of words in a video are great information then the voters can understand the workload and provide an understandable and reasonable budget", "q1r": 5, "q2": "The success criteria and suggested measurement metrics are set clearly to measure progress, quality and the impactful of the work done .\r\n\r\nIf proposers give more detail on the survey session (ie: number of survey will be collected, some example content of the survey), it would be great for voters to measure the impact of this particular activiy other than other activities since the website can contain other contents that also help increase number of vistor.\"", "q2r": 4, "assessor": "z_assessor_819", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The Cardano ecosystem in Vietnam is growing rapidly, several DeFi project teams are based there and it was one of the locations selected for the Cardano Summit this summer. Providing timely Catalyst information in Vietnamese is effectively addressing this challenge.", "q0r": 5, "q1": "The team has a combination of Cardano community members, SPOs from technical backgrounds and business minded folks needed to make this proposal a success. ", "q1r": 5, "q2": "The team describes each component of their proposal plan and their relevant experience to deliver this multilingual resource to the Cardano community in Vietnam. All of this info is sufficient to audit the progress.", "q2r": 5, "assessor": "z_assessor_868", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The Viatnam community is growing and this proposal is a great way to support that growth and include more in the catalyst process.", "q0r": 5, "q1": "The team of developers, SPOs and Cardano community members behind this proposal are native Viatnamese speakers and they currently host the Eastern town hall.", "q1r": 5, "q2": "The proposal's information provided is wholly sufficient to audit progress.", "q2r": 5, "assessor": "z_assessor_869", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}], "solution": "After 2 and 6h from the main Townhall, a 5 mins brief and 30 mins summary Podcast versions in Vietnamese ready for commuters, TL;DR users.", "experience": "Our team with relevant experiences in translating projects, DevOps, blockchain tech-savvies, SPO, Eastern Townhall moderators/co-hosts."}