{"id": 382308, "author": "homi", "title": "Vietnamese-English BlockChain Video", "url": "https://cardano.ideascale.com/a/dtd/382308-48088", "category": 26252, "amount": 17940, "description": "There are very few resources about blockchain technology knowledge and most of them are very hard to understand and boring.", "funded": 1, "upvotes": 28270508, "downvotes": 14868761, "votes_result": 13401747, "votes_cast": 120, "f6_no_assessments": 9, "f6_rating": 3.7777777777777777, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea itself is good, creating a youtube channel to explain more deeply about blockchain and Cardano, having half the content in English and half in Vietnamese will certainly meet the objectives of this challenge, bringing knowledge of content about Cardano to non-English speakers . The team claims they already have a youtube channel where they post videos with this proposal of simplifying, that is, making videos in animation and in a more accessible language, to avoid them becoming \"boring and difficult\", as they themselves claim that most of the content on the subject is. However, if we're going to notice, this channel was created now, at the time I write this review the first video was posted just 4 days ago. In this way, I don't think it can be said that the team has experience with the activity it intends to develop. I'm also worried about the fact that the animation videos would be generated by software, VideoScribe, and not by animators themselves; I don't know the quality and subtlety of videos made by a software would be the same as by someone who works with it. I believe there are already several videos on youtube about Cardano, Blockchain, etc. in English; so I think maybe it would be more useful to focus on content for the Vietnam audience, especially given what this challenge seeks, and maybe insert English subtitles in such videos as well. In summary, the proposal can bring the results we hope to the bottom, but it needs to be thought carefully about how each video will be constructed, if it is really necessary to do half English/half Vietnamese (my opinion: focus on the content in Vietnamese), as well as a way to publicize this work to the Vietnam community.", "q0r": 3, "q1": "This part of the proposal is very well detailed. The team is concerned with giving a brief description of each team member, and also what each time prior to this project, in which area they worked and how, as well as the telegram contacts of all ears. They also give us what the subjects covered in the videos would be, although in my opinion 104 videos is too high a quantity to start the project. They could have a slightly smaller goal, after all, they gave us subjects for only 15 videos, if it was one in English and one in Vietnamese, it would be 30. What would the other 74 be about? I believe it would be more appropriate to ask for the money to fund fewer videos, and renew the order on f8 if the proposal succeeds as planned. It is very positive how they give us the frequency at which they intend to release the videos (2 per week) and what would be the task of each team member to make this project a reality, which gives us a sense of the script to be followed. About the marketing plan, I think this part left something to be desired. What we are told is that \"Mrs. Hannah will share these videos with the community\", which would lead those 1500 telegram people to know about the project, but outside of that group, how do the authors intend to reach the Vietnamese audience? It would be necessary for them to set aside a portion of the funding to take care of advertising, hire someone to do a strong publicity campaign that would exactly reach the target audience they intend to reach. They themselves say how difficult it is to find blockchain content online, because most of the stuff that involves the cryptographic world is of the \"get very rich\" nature, because it wants to attract new investors with the possibility of high profits, which can, in fact, happen, but Cardano ecosystem technologies go beyond that promise. How can people in Vietnam who have no contact with the community know about the existence of this channel? About the division of the financing money, I found that everything is ok, they divide who would do what, for how many hours, what is the cost of the hour of work, resulting in a total of 345$ spent per week. In this part, I believe that everything is as it should be. It is only necessary to recover 1) the amount of videos (very ambitious, in my opinion) 2) how the marketing of this campaign would be, beyond the group on the telegram.", "q1r": 4, "q2": "The team is concerned about giving us content to monitor during auditability, but it is not very extensive. What I would suggest is that some member of the community from the country in question can work to monitor whether the videos are actually being posted, whether the content in Vietnamese is accessible and bring that information to the rest of the community. It would also be interesting if the team itself gave us feedback on how the videos are reaching the target audience, how many submissions are there, and whether these people are intending to actively participate in the ecosystem, either through Catalyst or working elsewhere. The auditability is a bit shallow, especially if we compare it with the item previously analyzed, which had a lot of detail. I believe the team needs to revisit these details so that we, the rest of the community, especially non-Vietnamese speakers, can understand if the project is meeting the desired expectations and that this information comes to us through data and numbers.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "What saddens me about this proposal is the problem statement. It is not true that there are few contents about blockchain technology. Nowadays have thousands of sources, channels, courses, etc. If the problem statement AND the solution focused only in the Vietnamese content I would not complain.\r\n\r\nThat said, in order to address better this challenge, I would rather focus only in the Vietnamese speaker, making videos only to them and reducing the overall budget. The challenge addresses the entry barriers based on language, therefore you should take it into account.\r\n\r\nOther point that should be pointed out is that the metrics and goals are not well defined.  How many people are you expecting to reach with these videos e.g.\r\n", "q0r": 3, "q1": "All the videos and the translations are quite simple to do. I don't see any major barrier that demands great efforts to surpass. That said, I think that creating the content only in Vietnamese would be more useful and would allow the team to have more content in this language – not necessarily reducing the budget, but reallocating it.\r\n\r\nIn order to scale, how is the plan to monetize and keeping creating content or even increase the releasing rate, or enhance the quality of these videos?\r\n\r\nMaybe investing some of the budget in marketing in order to reach more people would help it grow faster and will allow you to monetize.", "q1r": 4, "q2": "Since the videos will be published on YT it's quite easy to verify if the proposal is being done. However I'm missing some metrics and validations. How many people are you expecting, which are the measurements? How are you going to validate that your videos are making people to effectively join the ADA community?", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 17, "ne": 3, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposal starts from a premissse that I'm afraid may not be completely true. There are plenty of content about blockchain and cardano in english already produced, even by other past funds. Furthermore, \"boring\" and \"hard to understand\" seem a little subjective, specially considering the varienty of material existing.\r\n\r\nMaybe here, the best option is to focus on vietanemese language, both to make the project run quicker and cheaper. Only if videos are succesful in Vietnam, I'd consider providing them in eglish as well, but with subtitles in order not to have record audio again.\r\n\r\nAnother point that could've been highlighted here is how many people in vietnam use cardano and how many they intend to reach and engage, to give a more insightful perspective on the total potential impact. A communication startegy would also be welcomed as this content would compete with others.\r\n\r\nAlso, it would be nice to have a dedicated place (could be like an online portal) for Q&A and discussions.\r\n\r\nAs good points in the proposal, I liked the content is already defined and seems to cover good topics. It's also nice that its said here how he intend to overcome the \"boredom\" in the problem statement, even though its quite subjective\r\n", "q0r": 4, "q1": "There is a team of 3 people with experience in video producing and blockchain which seems to be enough to complete this project succesfully. There are links to other projects of theirs that seems to be a good reference to certify the information.\r\n\r\nThere's a solid plan and a clear budget breakdown. However, as I said in the impact that budget could be better leveraged if invested only in videos in vietnamese.", "q1r": 5, "q2": "There are milestones on video creating but no metrics related to them. It would be nice to see how many viewers should be expected and some way to measure their quality (surverys, number of likes, good feedbacks, etc).\r\nIt would be nice to see also how many new people joined tthe community because of the videos created.", "q2r": 2, "assessor": "z_assessor_298", "no_vca": 18, "ne": 4, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposer identified the problem that there are few resources about blockchain technology and that most of them are difficult to understand. As a solution, the creation of a YouTube channel to share knowledge about blockchain in English and Vietnamese was presented. The proposal presents a detailed plan of what will be done. The proposer does not present a plan to make the project sustainable in the future.", "q0r": 4, "q1": "The proposer identifies each member of the team and presents evidence of their experiences. The budget is detailed and appears reasonable given the timeframe and proposed work. The proposal presents a realistic deadline for completion of the work. The resources needed to implement the proposal are also described. The proposal does not appear to pose relevant risks for its implementation.", "q1r": 5, "q2": "The proposal presented a roadmap and KPIs that enable monitoring and evaluation of the proposal's progress and success. The proposer presents a clear description of the target problem and the proposed solution.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "In-depth knowledge about blockchain is often difficult to understand, so if it is not presented in easier and simpler methods, it will be difficult for people to access and understand it. I really like the solution of this proposal. Through the video of the proposal, I can see that the presentation is very simple and intuitive. With hand-drawn images on videoscribe software, it is possible to create very interesting content with images and attract viewers.\r\nIf content about in-depth knowledge about blockchain can also create attraction and excitement like content about dump and pump of blockchain projects in the crypto market, then Proposal can completely help everyone in the market. The crypto market becomes knowledgeable investors and will limit a lot of scam projects", "q0r": 5, "q1": "I am a member of this team's community. They have done a lot of zoom sessions sharing in-depth knowledge about blockchain. I am really impressed with the sharing of this team. They provide examples and detailed research on knowledge and projects. Everyone can completely review those shared zoom sessions on the youtube channel. I have no doubts about the team's ability to implement this proposal.\r\nBesides, the proposal also gives a very detailed plan to make these knowledge sharing videos and the implementation tasks are assigned to each member with relevant experience for that job. These things help strengthen the feasibility of this proposal", "q1r": 5, "q2": "The implementation plan of this proposal is given very specifically by the team according to the volume and time to complete the work. Budget is clearly divided by job and video. Cost per hour: $15 is a reasonable number.\r\nAll of these works are auditable with videos completed and posted on the YouTube channel of the proposal. Therefore, this proposal is completely auditable", "q2r": 5, "assessor": "z_assessor_645", "no_vca": 19, "ne": 5, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to use English alongside Vietnamese to share blockchain knowledge with more people. This addresses the challenge very well. It is clear and concise.", "q0r": 4, "q1": "The team has 3 members who have various skills in translation and video production, teaching , entrepreneurship and operation of stake pools.  The detailed plan explains that videos will be in animated form and contents of video among others includes; What blockchain is, what is Cardano, what is NFT?, etc. With all these details the proposal can be implemented successfully.", "q1r": 4, "q2": "The road map shows 12 months project work with 2 video sessions per week. The budget breakdown is comprehensive to make effective auditing. Good proposal.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal target is to create a YouTube channel to share blockchain knowledge with animated videos both in Vietnamese and English. I can not say I agree or I disagree the proposal is impactful because the proposal addresses only 1/3 of the objectives in the challenge's success: Increase amount of resources in a variety of languages. It would not increase adoption and community engagement of Vietnamese speakers because the proposal does not set viewers as the target of the proposal.\r\nAs my reading, the only target of the proposal is the videos (It states through the proposal: in the problem statement, plan, solution, KPIs and budget). In my opinion, the team should care about how many people would watch the videos, how many feedback, how many people among these viewers become Cardano community members. That would raise the impact of the proposal and help to increase Cardano adoption in the specific region.\r\n", "q0r": 3, "q1": "The proposal provides type and number of team members with their roles in the proposal very detailed. The Youtube channel which has already built, shows the undoubtedly experience and skills of the team for the successful implementation. Personally, I like those 3 videos, they are not only easy understandable but also interesting about Cardano and blockchain technology. The plan is also very clear about what is being done and how to do.\r\nHowever, it's all about the videos (number of videos, videos contents, how much cost for making videos,etc). I highly recommend the team re-set the target, and add information about viewers as expected, set the active viewers and their feedback in the success metric/KPIs. The team should plan how to attract people to access the channel, too. Because generally, the most important thing we care when creating a video (a channel) is how many views/viewers, isn't it? And in this case, the important thing community cares should be benefit for community.\r\nIn summary, I rate feasibility with a score of 3.", "q1r": 3, "q2": "The idea and the work (which has already started) is very great. The KPIs of the proposal is very easy to see and to audit. By adding more 2 KPIs that I mentions above (number of views/viewers and number of their feedback), the proposal would become fully auditable. I believe the team will make it best in the next Fund. Now I rate auditability with a score of 3.", "q2r": 3, "assessor": "z_assessor_714", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "It can clearly be seen that there are plenty of channels which also educate people about Cardano, the proposal has emphasized the different in approach: using animation video. However it did not project a sustainable solution, because people cannot detect which information is up to date, which not. The suggested topics are also quite general, it might not get enough attention. ", "q0r": 3, "q1": "With the unclear unique selling points of the channel, we are not sure about the impact of the videos. The videos on the current channels has only few views, which not prove the potential of projects. ", "q1r": 3, "q2": "The information is not yet sufficient since the team did not show the connection and achievement in engaging with community (the number of members just say that there are plenty people attract in Cardano and investment)", "q2r": 3, "assessor": "z_assessor_822", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "This is a great proposition. It created a youtube channel to share blockchain knowledge with animated videos in English & Vietnamese to make it easy to understand. This proposal will surely attract a large number of users, especially those who use English or Vietnamese. Provide them with in-depth knowledge about blockchain in particular and the Cardano ecosystem in general, besides, great applications of blockchain in present and in future life will also be provided. Thereby helping the Cardano ecosystem to grow.", "q0r": 5, "q1": "After reviewing the team information provided by the proponent, I found that their team consists of members with full experience and knowledge, working in many different fields, with certain success, it makes project implementation much easier.\r\nThe plan provided is quite clear, the content of the videos is described in detail, mainly the background knowledge about blockchain and Cardano. However, how many minutes is each posted video? Should provide more criteria to evaluate the success, for example: the number of viewers, the number of positive comments, ...\r\nThe budget allocation is quite reasonable (hours worked, amount per hour,...) this helps the project to be sustainable over time.\r\nOverall, with the team information and plan provided, I think the project is doable!", "q1r": 4, "q2": "The information provided is relatively complete, creating a solid basis for everyone to monitor and evaluate its success. However, it is necessary to add a few contents as I mentioned in the previous section (success assessment indicators, ...)\r\nBecause of the results this proposal brings, I hope it will be implemented successfully. In the future, I think it should not stop at English-Vietnamese, but should aim at more languages (languages commonly used in the Cardano community: Spanish, Japanese,...)", "q2r": 4, "assessor": "z_assessor_862", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1}], "solution": "We created a youtube channel to share blockchain knowledge with animated videos in English & Vietnamese to make it easy to understand.", "experience": "Our team has made a lot of webinars about about analyzing projects and knowledge on Cardano and other blockchains to community"}