{"id": 383857, "author": "everstake", "title": "Educational materials about Cardano", "url": "https://cardano.ideascale.com/a/dtd/383857-48088", "category": 26252, "amount": 15000, "description": "As Cardano ecosystem grows, there is a constant need for educational materials in different languages.", "funded": 0, "upvotes": 17694750, "downvotes": 19250772, "votes_result": 1556022, "votes_cast": 116, "f6_no_assessments": 6, "f6_rating": 3.722222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "In my opinion this proposal is within the challenge goal, because could improve the diffusion of educational materials in different languages alla round the world and adoption of Cardano Blockchain.\r\nThis proposal is well written and clearly demonstrate  the experience and the team's commitment, guarantees solidity in deliverables, support transparency and accountability for all Cardano community.\r\nThe proposal clearly articulates the contest, the problem (new developer ecosystem to write and test smart contracts) and how it will add value to the Cardano governance ecosystem and for all of the stakeholders.", "q0r": 4, "q1": "It's simple to define if the proposer team states has the necessary experience, because it's clear the experience of the proposer (Cardano SPO since Shelly launched, and we have experience with 30+ blockchains…) and it's not simple to discover team member details (https://medium.com/everstake) and professional experience to imagine the project's success, especially in writing documentations. \r\nFurthermore then plan proposed is only draft plan as a launch phase, so it's good as approach, but not completed with enough details.\r\nThe metrics for the assessment is given so it's possible to assess what the proposer wants to do.", "q1r": 4, "q2": "In this area the proposer has mentioned  KPI and adoption criteria (2 KPI and deliverables phase), so It's completed.\r\nThe proposer missed possible difficulties and how to deal with them (e.g. difficulties in publish materials, updated frequency of the documentation/guides…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 27, "ne": 6, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "The proposal identified the problem that needs to be resolved. The proposal addresses the challenge of increasing the engagement of non English speakers by providing educational materials in different languages. The proposer presents key metrics and goals that allow the assessment of the proposal's success", "q0r": 5, "q1": "The proposer presents evidence such as blog articles and articles translated into other languages that demonstrate relevant experience for implementing the proposal. The proposal does not identify the exact number of people who will work on implementing the proposal. the budget has not been detailed to assess whether it is reasonable or not. A realistic deadline is presented. The proposal does not pose risks that compromise its success", "q1r": 4, "q2": "The proposer presents KPIs and metrics to define the success of the proposal. The proposal presents a description of the target problem. The proposal presents a roadmap with milestones and a time horizon for achievement", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "Providing educational material about Cardano is a good way to engage non-native English speakers. By providing this in their native language delivers what we need in this challenge. People are hesitant when it comes to new technologies if they know nothing about them.", "q0r": 5, "q1": "Reading through the proposal the proposer state that the education material is translated to Russian and Spanish. They provide links where we can see articles that are translated into Russian, Chinese, Turkish and Korean. They say that the articles are usually translated by local communities, which begs the question of whether Everstake has translators of their own. We are not provided with evidence about team members who can translate from English to their native language. This is a crucial piece of information that makes or breaks this proposal. We are also missing a budget breakdown and a roadmap.", "q1r": 1, "q2": "How can we assess auditability without a roadmap? We have no communication from the proposers on what they plan on doing with the funding. If they would've provided a funding breakdown we would've been able to assess this a little but we are only provided with KPIs. These KPIs however fit well within the proposal.", "q2r": 2, "assessor": "z_assessor_471", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The team clearly points to the problem of lack of content about Cardano in multiple languages and offers a great solution to that problem. This project definitely has a positive impact on the Cardano and Catalyst ecosystem. The team clearly explains how this project will add value to the Cardano and Catalyst ecosystem. The team developed KPIs in the proposal and they match the ones indicated in the challenge and the proposal is able to scale and address future challenges.", "q0r": 5, "q1": "The team in the proposal clearly lets us know how many people will work on this project and highlights all the necessary links from which we can clearly see the team's work so far and the necessary skills, knowledge and experience needed to implement this project. The team represents the requested budget that is not broken down into identifiable items, although the budget may be realistic, but it is unclear on what and how the money will be spent. The team presents the current proof of work but the detailed implementing plan and details of actionable tasks and order of execution for this proposal are not clearly defined. It would be good to develop a plan that would show during which time the project will be implemented, what resources are needed and technical aspects for implementation. It would be good to know if there are any risks that may arise during the implementation of this project.", "q1r": 3, "q2": "It would be good if the team developed and presented a roadmap with milestones and a time horizon for achievement. KPIs have been presented and can serve to quantify the success of the project but the community unfortunately cannot track the progress of the project due to lack of information.", "q2r": 3, "assessor": "z_assessor_656", "no_vca": 14, "ne": 6, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Everstake has already collected and created a lot of material before translation this needs to be checked by Project Catalyst so that this is the information they want to spread about Cardano. The idea is in line with the campaign description; the proposer will translate material into Spanish and Russian, does the company Everstake have Spanish and Russian-speaking people in their team, or where are they going to find these people with the right knowledge?\r\n", "q0r": 4, "q1": "This proposal can certainly be worked out well, there is enough evidence of what the proposers have already achieved. Do you already have an idea of ​​the team that will develop this project? It is clearly defined which sources and mediums will be used to disseminate the project.", "q1r": 3, "q2": "The KPIs are clearly defined for all categories of materials. The total budget has been entered but is still missing details, how do you come at this amount? I also propose to draw up a roadmap with possible goals to measure success.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "Everstake offers to develop educational material in different languages. This material will take the form of articles and video tutorials. This obviously meets the \"multilingual ressources challenge\" criteria. Apart from content creation, the proposal highlights that part of the funding will be dedicated to content distribution on several channels. \r\nWhat makes me remove 1 star is that it relies on \"community\" to make the translation in local languages (apart from Spanish and Russian), while translation is the main purpose of this challenge. \r\nI agree that this proposal effectively addresses the challenge.\r\n", "q0r": 4, "q1": "Everstake has an existing activity to demonstrate his ability to develop and distribute educational content about blockchains. The topics to be addressed are listed (wallet guide, staking guide, video introduction to Cardano). I agree that this proposal will be likely to be implemented.", "q1r": 4, "q2": "KPI  Deliverables are well detailed. I would recommend that the proposal elaborates about how the 15000$ funding will be used in detail.\r\nI agree that the community will be able to monitor the progress of this proposal.\r\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "Everstake is ready to create many educational materials about Cardano and distribute them among our customer base", "experience": "We are Cardano SPO since Shelly launched, and we have experience with 30+ blockchains."}