{"id": 382635, "author": "jeffrey.downard", "title": "Model Contracts for DeFi Loans", "url": "https://cardano.ideascale.com/a/dtd/382635-48088", "category": 26233, "amount": 25400, "description": "Los requisitos legales para los contratos relativos a los préstamos para la vivienda y el automóvil varían de un estado a otro. Los desarrolladores de apps necesitan un enfoque uniforme.", "funded": 0, "upvotes": 18079812, "downvotes": 19961810, "votes_result": 1881998, "votes_cast": 275, "f6_no_assessments": 5, "f6_rating": 2.1333333333333337, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal seeks to build standard contracts for use in different industries. This effectively meets the challenge by providing a DEFI approach the others could use helping Cardano to scale. As someone who is more involved with product that programming having a set of standard templates would be really useful.  This is a problem that I have experienced in the NFT space. so creating a real world contract solution would be amazing. ", "q0r": 5, "q1": "The team is supported by a proposal incubator so there seems to be supporting the proposer already. It's not 100% clear who will program this, there are no resources on the team currently to do this. It will be great to find out more about the technical aspects of this proposal.", "q1r": 3, "q2": "There is a simple roadmap and budget. There are also a lot of outreach activities to the community providing visibility to the team. However the amount of money requested is only budgeted for the first three months. I wonder if the team has enough time to deliver what is required before raising more funds, this seems to be a risk.", "q2r": 2, "assessor": "z_assessor_466", "no_vca": 15, "ne": 1, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "This project will save a lot of resources and initiate a new management model of home mortgages and auto loans. Making this dapp in the Cardano ecosystem, it will drive a lot of user to it. \r\nUnfortunately, the proposer doesn't provide key metrics for this project. And there is no content in the plan or info to say that this project will add value to the Cardano ecosystem. \r\n", "q0r": 2, "q1": "The idea is good but the proposer should provide more info. This type of project will have a lot of things to do, especially relating to government standards as they mention in the proposal. I really want to know in detail how they can solve that problem but not just with some words. \r\nMoreover, there is no plan, so their timeline and budget detail is unclear to me. I can't understand why they have to use $3100 for a workshop, which activities in that workshop make it cost so high like that. And many others that also confused me. ", "q1r": 1, "q2": "To me, they have no roadmap and key metrics. Means that we cannot audit this project. \r\nMoreover, because the content in the proposal is just about an idea and team introduction. So I can't understand in detail the problem that the proposer wants to solve and solution can address it or not. Of course, there is no risk management that is included in this proposal also. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Assessor unsure of what aspects of the proposed solution would assure increased decentralization. Proposal should put more emphasis on what access to defi loan involves, and what/how prospective loanees (across various states) will have to submit to access these services. ", "q0r": 3, "q1": "The team seems to have the experience and enough of a vision to facilitate workshops and network with prospective mortgage and auto finance participants. However, it's not clear if the team has a sophisticated or even adequate understanding of the current and/or future state of decentralized finance toolings. ", "q1r": 3, "q2": "Some deliverables are clearly public-facing and accessible for Cardano community to assess progress/success. However, a significant number of deliverables did not clearly commit to transparency that would afford us the ability to monitor/audit (e.g., publishing board of advisors meeting minutes). ", "q2r": 2, "assessor": "z_assessor_716", "no_vca": 13, "ne": 0, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "It is an enormous impact on C.A. time to read and forensic each of your team projects and vCA time reading these comments more than 10 times again and over again.\r\nTotal fund requested $320100 of 12 proposals (inc two shell proposals, proposal number 11 and 12 listed in Feasibility). \r\nI could sum up three main areas that all of your 10 submitted projects as follow: 1) introduce PRISM + Cardano by using Youtube, website and workshops as delivery channels 2) developing PRISM at gathering data rather than an essential tool in Phase I (6 months) and 3) some intangible legal involving.\r\n\r\nMost proposals paraphrased each other with minimal change. Here is one example. \r\n\r\nFor example, Defining Success of 1) and 2) below are only difference \"roadmap that small cities\" vs \r\n\"schematic model that\" and the rest are IDENTICAL—the same fashion for the rest of the 12 proposals.\r\n \r\n1) DIDs for Cities https://cardano.ideascale.com/a/dtd/DIDs-for-Cities/382636-48088\r\n\"Creation of a schematic model that use in the adoption of Atala Prism ID system. \r\nDevelopment of webpage on the Kepler SCS website with videos presenting a narrative of the community conversation as citizens learn about the opportunities to create and take ownership of a secure digital I.D.\"\r\n\r\n2) DIDs for Health Records https://cardano.ideascale.com/a/dtd/DIDs-for-Health-Records/382633-48088\r\n\"Creation of a roadmap that small cities can use in the adoption of Atala Prism ID system. Development of webpage on the Kepler SCS website with videos presenting a narrative of the community conversation as citizens learn about the opportunities to create and take ownership of a secure digital I.D.\"\r\n", "q0r": 1, "q1": "With 12 proposals for six months to do similar outcomes such as data gathering, workshops and legal advice, I do not believe these projects would address and expand Cardano and PRISM aggressively and can be deliverable with the listed team members. Here is the list of 12 similar proposals submitted by the same team.\r\n\r\n1) F7: Accelerate Decentralized Identity \r\nDIDs for Cities ($26,000) DID\r\nhttps://cardano.ideascale.com/a/dtd/DIDs-for-Cities/382636-48088\r\n2) F7: Accelerate Decentralized Identity \r\nDIDs for Health Records ($21,400)\r\nhttps://cardano.ideascale.com/a/dtd/DIDs-for-Health-Records/382633-48088\r\n3) F7: Boosting Cardano's DeFi \r\nModel Contracts for DeFi Loans ($25400)\r\nhttps://cardano.ideascale.com/a/dtd/Model-Contracts-for-DeFi-Loans/382635-48088\r\n4) F7: Lobbying for favorable legislation \r\nNetwork of policy advocates ($9700)\r\nhttps://cardano.ideascale.com/a/dtd/Network-of-policy-advocates/383251-48088\r\n5) F7: A.I. & SingularityNet a $5T market \r\nEthical A.I. for Singularity/Cardano ($31300)\r\nhttps://cardano.ideascale.com/a/dtd/Ethical-AI-for-Singularity-Cardano/382631-48088\r\n6) F7: A.I. & SingularityNet a $5T market \r\nHypotheses for A.I./Singularity Net ($26800)\r\nhttps://cardano.ideascale.com/a/dtd/Hypotheses-for-AI-Singularity-Net/382632-48088 \r\n7) F7: DAOs ❤ Cardano \r\nSpaceship Earth DAO ($28000)\r\nhttps://cardano.ideascale.com/a/dtd/Spaceship-Earth-DAO/382630-48088\r\n8) F7: DAOs ❤ Cardano \r\nCardano Climate DAO ($31500)\r\nhttps://cardano.ideascale.com/a/dtd/Cardano-Climate-DAO/382637-48088\r\n9) F7: Nation Building Dapps\r\nCreating a Level Playing Field ($28000) \r\nhttps://cardano.ideascale.com/a/dtd/Creating-a-Level-Playing-Field/384242-48088\r\n10) F7: Nation Building Dapps\r\nSmart Contracts and the Law ($32000) \r\nhttps://cardano.ideascale.com/a/dtd/Smart-Contracts-and-the-Law/383250-48088\r\n11: Redeploy Catalyst  ($30000) for 31 words proposal\r\nhttps://cardano.ideascale.com/a/dtd/Redeploy-Catalyst/383247-48088\r\n12: F7: Nation Building Dapps\r\nEducation Records ($30000) for 38 words proposal - \r\nhttps://cardano.ideascale.com/a/dtd/Education-Records/382634-48088\r\n", "q1r": 1, "q2": "Time and budget are close (copied/pasted) to the identical pattern with no detail and slightly differ in Dollar and not support-base and expected outcomes. There is no precise mechanism for Project Catalyst and the challenge team to follow and monitor your 10 proposals (minus 2 shell proposals).\r\n\r\nHere is a summary \"Time and Budget\" pattens used in 10 submitted projects with the listed team member, Law Professor.\r\n\r\nPhase I (6 months)\r\n\r\nMonth 1: some type of \"outreach\" (vary $$)\r\nMonth 1-2: \"Workshops\" (vary $$)\r\nMonth 2: Webpage development and and Youtube channel related (vary $$)\r\nMonths 2-3: identify the issue (vary $$)\r\nProject direction:  (vary $$)\r\nProject oversight and evaluation by members of Board of Advisors months 1-5: (vary $$)\r\nLegal work on guidelines for the roadmap (vary $$)\r\nTotal: (vary $$)\r\n\r\nPhase II (6-9)\r\nPhase III (10-12)\r\n", "q2r": 1, "assessor": "z_assessor_726", "no_vca": 17, "ne": 5, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "The proposal looks to implement smart contracts that will make it easier to comply with different regulations for home mortgages and autoloans. The complexity of using DeFi within the context of other DApps is a valid and important issue to solve meaning this proposal could have high impact. The proposal team provides no depth when explaining how the smart contracts will be implemented such as the core components required and the order these parts would be executed.\r\n\r\nThere is potential that this proposal could have impact but without more specific information on how it will be implemented it is hard to gage whether their suggested solution is achievable or impactful to the wider ecosystem. ", "q0r": 3, "q1": "The proposal lists team members in the proposal with an overview of their background. The website provided offers a LinkedIn profile for one of the team members Jeffrey. There is no evidence that this team has the technical skills to implement the solutions they have suggested using Plutus nor a reasonable plan as how to find a developed suited to this task. The budget break down values are incorrect in numerous places (take the hourly rates and multiply them by the hours listed). The budget provided for the developer stands at $75 with only $5,000 allocated to implement the system they've suggested. It is very unclear on whether this proposal is feasible to be implemented effectively by this team. The inaccuracies in the proposal budget should be resolved along with better articulation on why such a small budget is needed for Plutus development along with better evidence that the team can deliver against the proposal objectives.", "q1r": 1, "q2": "A roadmap is provided and a statement about what success looks like which maps more closely to completing the tasks of the proposal. The clarity of the proposal could be a higher standard, it is unclear on how they have broken down the problems that need to be solved and intend to implement solutions using Plutus smart contracts. The team mentions the templates will be freely available to the community which suggests everything will be open source, this will make it easier for the community to audit. A better understanding of who may use these templates in the short term and what KPIs they can look for would be useful to give a better rating here.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 17, "ne": 6, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Construir modelos de contratos inteligentes que incluyan disposiciones en lenguaje natural con código de concordancia que funcione en todas las jurisdicciones.", "experience": "Derecho contractual, derecho fiscal, ética, derecho empresarial, consultor de sistemas empresariales, desarrollador, educador."}