{"id": 383394, "author": "manfo2021", "title": "Djangui: Local Savings Account Mgmt", "url": "https://cardano.ideascale.com/a/dtd/383394-48088", "category": 26233, "amount": 24000, "description": "Los agentes recaudadores organizan el ahorro diario informal para los comerciantes locales, pero no ofrecen transparencia en la gestión de los fondos, lo que expone a los usuarios al fraude.", "funded": 2, "upvotes": 114706446, "downvotes": 10407538, "votes_result": 104298908, "votes_cast": 829, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "La influencia que la propuesta podría tener en el ecosistema Defi es inmensa. La solución propuesta de abordar los inconvenientes actuales de los sistemas financieros locales disponibles para los comerciantes locales. La participación de las instituciones financieras junto con el proyecto aportará confianza entre los locales y mejorará la adopción de Cardano para las aplicaciones de Defi.  Esta propuesta traerá mucho más tráfico al ecosistema y también resiliencia a sus capacidades. Las huellas que puede dejar la propuesta serán el inicio de la difusión de Cardano y Blockchain en varios países africanos cuando la mayoría de la comunidad se concentra en Europa y América del Norte en este momento.", "q0r": 5, "q1": "El equipo ha demostrado tener suficientes habilidades y experiencia en el campo para llevar a cabo este proyecto. La cantidad de investigación y trabajo realizado por el equipo demuestra su pasión y voluntad de hacer que esta propuesta sea un éxito. El equipo también ha presentado un plan detallado de cómo piensan llevar a cabo este proyecto y los hitos parecen factibles. El equipo también ha tomado nota de los posibles riesgos a los que podría enfrentarse a la hora de ganarse la confianza de la población local e inculcarles un sentimiento de fiabilidad. Sin embargo, la propuesta parece carecer en un área particular de cómo la aplicación propuesta podría rectificar las vulnerabilidades y los constantes hackeos de las aplicaciones Defi ya existentes en la red de Ethereum y Binance. Siempre que el equipo pueda proporcionar su enfoque para minimizar estos susceptibles contratiempos, esta propuesta será una forma perfecta de aprovechar el inmenso potencial que las comunidades africanas podrían añadir al ecosistema y a la adopción de Cardano para Defi. Las posibilidades de que la propuesta sea un éxito son bastante elevadas, dado que el equipo cuenta con centros activos ya establecidos, a pesar de que se necesitan más datos para tomar decisiones concluyentes. Por lo tanto, justifico la viabilidad con una puntuación de 5 sobre 5.", "q1r": 5, "q2": "El equipo menciona los hitos que se podrían utilizar para seguir su progreso. Sin embargo, no hay un plan detallado con el momento en que se puede esperar que se alcancen los resultados deseados del proyecto. Sin embargo, el equipo proporciona una lista de métricas finales que uno podría utilizar para auditar sus objetivos finales y su éxito. El equipo también proporciona un breve desglose del presupuesto que es plausible y práctico. El objetivo de la propuesta de aumentar las inscripciones y las transacciones al cabo de 12 meses es competente. Sin embargo, un plan de juego detallado y un horizonte temporal junto con métricas que muestren cómo se está produciendo la descentralización de los sistemas financieros locales y cómo de fiable es esta aplicación Defi en comparación con las aplicaciones existentes en otras monedas harán que la auditoría sea más significativa y fácil. Por lo tanto, creo que una puntuación de 4 sobre 5 para la auditabilidad hace justicia.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 20, "ne": 15, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralisation can be for economic empowerment. However, it is important that DeFi projects have good accessability and also enable to bank the unbanked instead of just beeing an elitist project. I have done some personal research on both DeFi and microlending especially with a focus on Global and social justice and hope to bring in a valuable perspective on accessability for poorer people with my reviews in this challenge. The proposal identifies a problem in just this area and presents an excellent solution to this: tackling sometimes fradulent tendencies in microfinance and presenting a good, transparent solution to it that everyone dependent on microfinance will benefit off and that will greatly boost the DeFi capablities of the Cardano ecosystem. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing, and the related business seems serious and credible, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they and their project partners will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 5, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This proposal fits very well with the main objective of the challenge, because it intends to create dApp to oversee activities and protect merchants as well as facilitate the digitizing of collection activities for the collectors in Africa.  Providing a solution that works in both the developed/developing contexts will have an even greater impact and positive effect for the community at large.", "q0r": 5, "q1": "I completely believe that given the experience and plan presented here that it is highly likely this proposal will be implemented successfully. The level of detail and thought throughout this proposal exemplifies the preparedness and background of the proposers. The roadmap as presented is clear with each stage building on the next, though timeline (Q1/Q2/ eg 2022) is recommended to support the roadmap. ", "q1r": 5, "q2": "All the information provided in this proposal is sufficient to be audited for progress and success. The team provides a suite of objectives, marketing challenges and risks, and deliverables in the proposal. Each is well thought out and articulates what voters can expect for the money being spent. \r\nIf my understanding is right, the main concern here is how do we educate the collectors to actually use this protocol and not the latter (which gives him more benefit) since there is still a middle men between the exchange and the merchants.", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Crear una plataforma descentralizada para gestionar las actividades de recaudación centrándose en: la transparencia y los derechos de propiedad de los fondos recaudados.", "experience": "Contamos con dos veteranos recolectores diarios que trabajan con el equipo de desarrolladores y arquitectos de software de Wada para crear esta solución en Cardano."}