{"id": 383631, "author": "joacovitale", "title": "Lossless Donation DEFI protocol", "url": "https://cardano.ideascale.com/a/dtd/383631-48088", "category": 26233, "amount": 70500, "description": "Ayudamos a las ONG a recaudar fondos mediante donaciones sin pérdidas en las que los usuarios pueden donar los intereses generados mientras tienen libre disponibilidad de sus tokens", "funded": 1, "upvotes": 32456727, "downvotes": 20648485, "votes_result": 11808242, "votes_cast": 305, "f6_no_assessments": 3, "f6_rating": 3.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposed idea could work well for this challenge, mostly with the protocol including ADA as one of their currencies to run the donation based staking pools. ", "q0r": 5, "q1": "The team does not provide enough information about their background and related skillset. The website they provide is under construction and the Twitter is new with only little interaction on it. The way the proposal is written makes it seem that this company is already up and working with many partners, but that might be a language-related miscommunication and might refer more to their future plans, as there is no website and no information on Twitter as well as no linkedin or other credentials. For risks - especially in the Cardano Community, the proposers would have had to explain how they would support and onboard ADA holders to stake in their pool instead of the SPOs that Cardano already offers and many of them do support important causes. While the idea to include celebrities might be a good argument for onboarding new and veteran ADA holders, more information about prior work and actionable steps of the protocol would make it easier to assess feasability.", "q1r": 3, "q2": "Auditability is not very easy with the provided information. There is no discord or github repository for transparency, there is no source or reference for the relevant experience of the proposers like linkedin or a website. The milestones don´t match the budget breakdown. They are for instance requesting funds for 5  months of developing the smart contracts for their pools but their milestone is to implement the smartcontracts after only one month. They are envisioning to onboard over 15.000 participants with their project in 6 months, but there is no information about actionable steps and existing networks that would implement this to be realistic. The twitter at the moment has very little follower and the team did not include any information about outreach and marketing in the roadmap. The budget breakdown has some flaws (like the  mismatch of the roadmap and the budget breakdown when it comes to smart contracts) and for auditability reasons it would have been interesting if the team provided some milestones on how many ADA holders and how many funds in ADA they are planning to onboard to their protocol.", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 22, "ne": 9, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "This project will help develop the first Lossless Donation Defi protocol to help donate interest without losing users' tokens. The proposer pointed out how this project will benefit Cardano ecosystem and their outlined content shows that can help. \r\nMoreover, the KPIs in a month show that the proposer really concerned about what this challenge need, this will directly help to grow user in Cardano network.", "q0r": 5, "q1": "This project already runs the first MVP in Argentina and get great results, now want to deploy it on the Cardano network. Hence, it's no doubt that this team can do it successfully.\r\nThe proposer show us detailed info about what they did and their ongoing plan in Cardano network. The proposer also stated the vision of the project and ability with experience team members so clear. \r\nBut, for assessing the feasibility of a proposal, my advice to the proposer is that he should provide the roadmap. The info in the \"goal\" session is not enough to be a roadmap, the proposer should describe more which task or activities will have in every important period of time in the plan.  ", "q1r": 2, "q2": "It's impossible to audit this proposal because lacks a detailed roadmap, even the proposer shows their goals but the Catalyst needs more info to know each path of the project's plan. Then the proposer should also add more other key metrics to fit with the new roadmap.\r\nThe proposer helps us to understand clearly the problem and how their solution can help, not just by definition but also with their MVP did in the past. ", "q2r": 2, "assessor": "z_assessor_671", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This is a great project and one that is very close to my passion as I am part of the Cardano4Climate as well as an advisor to NGOs and to a technology donation platform. The solution is well described but the problem could include more details. What are the problems today with available donations systems? It is included in the proposal text but should be better specified for example in the problem statement - which in this case it is more the solution. Also, it could have been good to relate to the challenge objective and explain better how this proposal fit the challenge. It might fit other challenges better such as Dapps and integration. It will be good to know also the long-term plan of the project and how it will be financed post catalyst project scope.", "q0r": 4, "q1": "The team seems great with relevant experience but more details are needed to validate the information - for example, a Linkedin profile would have been helpful. It is not mentioned also any relevant experience with Cardano or with managing an SPO. Great that you already had a pilot use case and that you attached videos - cool ones. The use of funds is well explained, however, more details will be better - for example for the smart contract auditing. Missing some details about the roadmap and timing. Risks and challenges are missing as well. KPIs are well stated over time, but will be good to add some other basic KPIs such as projects supported, amount staked and amount donated. Overall, It is a great project but missing some info re the implementation of it. I have a good background in managing technology projects and more roadmap details will be helpful for the planning of the project.", "q1r": 3, "q2": "The KPIs presented are easily auditable but they focus mainly on the number of users staking and using rewards for donation. Although not mentioned by you the amount staked and rewards going to donation will also be easy to audit. Deliverables with the timeline are not well specified so difficult to audit - for example, what measurable deliverables are after a few months of smart contract development. I still gave 4 and not 3, as from the MVP you clearly register the KPIs and can share it with the community. Although I suggested also there to have a more standard reporting.  ", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 24, "ne": 10, "ng": 13, "nfo": 1, "vca_o": 1}], "solution": "Wooy es el primer protocolo DEFI de donación sin pérdidas, donde el usuario puede ganar experiencias y premios increíbles mientras ayuda a las ONGs", "experience": "Hicimos un MVP en Argentina con +3k usuarios orgánicos, 8 celebridades y una asociación con la Cruz Roja para ayudarles a luchar contra el Covid 19."}