{"id": 384919, "author": "adenan44", "title": "Interoperable platform", "url": "https://cardano.ideascale.com/a/dtd/384919-48088", "category": 26233, "amount": 40000, "description": "Cómo conseguir que las transferencias de dinero basadas en África sean interoperables con ADA y la blockchain de Cardano", "funded": 0, "upvotes": 20042413, "downvotes": 30806998, "votes_result": 10764585, "votes_cast": 324, "f6_no_assessments": 11, "f6_rating": 1.484848484848485, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal has a sound idea, but it did not develop into a solid and detailed proposal.\r\nKPIs, metrics, milestones and goals are not presented. \r\nBenefit for the Cardano ecosystem is not elaborated in detail, except mentioning enabling payments in ADA.", "q0r": 3, "q1": "The proposer has not demonstrated sufficient knowledge for this development, team expertise or any info related to the skill needed for such implementation. Only available data was link to the webpage, possibly from the proposer but not clearly explained.\r\nThe proposal lacks a plan, resources, detailed breakdown of steps, milestones, budget breakdown, team members. There is no justification of the budget or its implementation, it is just a lump sum.\r\nNo technical aspects have been explained or presented.\r\n\r\n", "q1r": 2, "q2": "The proposal lacks detailed milestones and timeframe for delivery of each portion.\r\nThe proposal lacks KPIs or any measurable success indicators. It would be beneficial to have some measure of progress during the delivery and after the delivery to evaluate the actual impact.\r\nThe potential risks and challenges are not particularity addressed. It would be beneficial to see the potential roadblocks and ways to mitigate them, such as lack of funding, interest or similar.\r\nBased on the lack of info, it is difficult to monitor or evaluate success during or after implementation.\r\n", "q2r": 1, "assessor": "z_assessor_160", "no_vca": 26, "ne": 7, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "A few sentences is not enough to get $40,000 USD funding. As per the commentator: \"There is still a lot of details to flesh out on the proposal\".", "q0r": 1, "q1": "Unable to assess.", "q1r": 1, "q2": "Draft proposal.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 40, "ne": 0, "ng": 21, "nfo": 19, "vca_o": 1}, {"q0": "The identified problem and the solution to the problem doesn't fit in the challenge objectives as DeFI (DEX) is more (different) that what \"money transfer\" means. The solution is presented in a vague manner (a plugin that will add functionality to what specific computer program?)\r\n\r\nIt is unclear what will be the benefits added to the Cardano ecosystem by developing this plugin (why this blockchain is better than other blockchains?)", "q0r": 1, "q1": "There are no details about the team members and their relevant experience.\r\n\r\nThe budget is not broken down into identifiable items and there is no timetable to complete the work. Also the proposer should present the resources needed to successfully implement this project.\r\n\r\nThe proposal doesn't explain technical aspects like architecture, programming language(s) and technologies that will be used in this project. Risks and challenges should be taken into consideration for a successful implementation.", "q1r": 1, "q2": "As no relevant info is presented in the proposal, at this time, there is nothing to assess.\r\n\r\nIt needs more editing so that it can be assessed properly given its direction. Perhaps reworking it and submitting it at the later stages will work. ", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 23, "ne": 2, "ng": 19, "nfo": 2, "vca_o": 1}, {"q0": "Draft proposal of only 68 words requesting $40k to build a plugin to interface traditional money with crypto in Africa - that's about all the detail we're given.\r\nThere is a link to a company website that is related (African company selling financial softwares) but there is no detail at all. This proposal does not seem to be mentioned on the website so we can't be even sure that the proposers are actually related to the linked website.", "q0r": 1, "q1": "No real experience is provided, only very vague even in wordings. We need evidences such as LinkedIn profiles or past/current projects. (The linked website does not include the names of the proposers in its about section)", "q1r": 1, "q2": "As this is just a 68 words draft proposal there is no plan provided.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 19, "ne": 2, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The proposer wants to build a plugin that can enable interoperability between blockchain and African currency. The problem is not clearly stated. I assume that maybe the proposer wants to create a stablecoin pegged to local African currencies that would facilitate transactions. While it can be a good idea, the proposer should add more information that will help readers better understand the goal of the proposal. Key metrics and goals that align with the challenge should be included as well. \r\n", "q0r": 2, "q1": "This proposal is not feasible at the moment because it lacks basic information to track its progress. The proposer should add evidence of relevance skills and experiences. This can be a linkedin profile or previous similar work completed by the proposer. Furthermore, the budget should be broken down into identifiable pieces. The proposer should also add a back up plan in case additional funds are needed. In addition to that, a timetable to complete the work should be included. My advice to the proposer is to look at the previous funded proposal and use them as reference to better structure this proposal.\r\n", "q1r": 2, "q2": "The proposal doesn't include any information that will help track its progress.  The proposer should add a roadmap with reasonable milestones. Metrics and KPIs that define success should be added too. This proposal can be improved and get a chance of getting funded in the future. As it is right now I don't have a positive note on its suitability.\r\n", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 21, "ne": 7, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The proposal does indeed address the challenge category, but is sorely lacking in the details and implementation plan and detailed roadmap. \r\n\r\nThere is a need for a plugin to bridge traditional finance to blockchain, but this proposal is unfortunately lacking in specifics and cannot be considering to be effectively addressing the challenge.", "q0r": 2, "q1": "This proposal does not include and information about the team members and their technical expertise and ability to delivery a successful proposal.\r\n\r\nI would advise the proposer to next time include the CVs and social media profiles of the team that will be implementing this proposal to ensure a higher likelihood of success.", "q1r": 2, "q2": "This proposal does not include a roadmap with detailed milestones, nor does it have KPIs that can be used to audit each milestone since the roadmap itself is not inclded in this proposal.\r\n\r\nI would advise next time to include a detailed roadmap with milestones and KPIs for each milestone so that the proposal can be successfully audited!", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 18, "ne": 1, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "\"Money transfers have always been a problem in Africa because of the weakness of the banking system there. Using blockchain to interact with traditional remittances could be a great way to boost banking operations in Africa. So this is a good idea.\r\nBut there is still a lot of details to flesh out on the proposal. Looking forward to a more detailed outlook especially the scope of implementation and how it will workout.\r\nCurrently, the proposal is nothing but an idea\"", "q0r": 1, "q1": "The proposer said that they work with a software development company and with a strong team. But what company? How strong is your team? Do you have any evidence to support what you say? I can't find them in this proposal. In addition, this is just an idea, not a specific product or solution", "q1r": 1, "q2": "There is no detailed plan of what the funds will be used to produce which can be assessed against. Thus progress and success cannot be measured. It is not clear what, if anything has already been built.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 23, "ne": 3, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "This proposal focuses on getting a plugin that will enable interoperability between blockchain and traditional money transfers like Mobile money. It seems that this proposal is incomplete, since the detail plain was not provided. As a result, potential impact can not be seen. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1. ", "q0r": 1, "q1": "Since this proposal is not completed [almost no profile description and links for verification, not any roadmap or KPIs, and of course, the risk is not defined], there is not much proof of feasibility to evaluate. Therefore, based on the given information, I strongly disagree with this proposal's feasibility, and would give it a score of 1.", "q1r": 1, "q2": "As mentioned, since this proposal is incomplete [no profile description and links for verification, doesn't have any roadmap or KPIs, the budget structure is not defined, and the risk is not defined], transparency is at a low level. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "Hello, the idea of creating interoperability between the Fiat world and the Cardano network fits the challenge and tries to solve the problem, but does not mention DeFi / NFT, would your proposal use these technologies?\r\nAlthough I see that your proposal is interesting, I think that more explanation and development on how your proposal adds value to the challenge.\r\nI recommend you include images or some visual information. In the first few paragraphs of your proposal try to summarize the impact and its appropriateness to the challenge as best as possible.\r\nA voter who enters such a terse proposal is likely to skip it.", "q0r": 3, "q1": "On the website we can find a lot of information about the activities of \"Nest Systems\" perhaps there should be a section \"about us\" who are the natural persons who give life to the project and what their mission as a company. This information can also be provided in the section where you must detail the experience of your team.\r\nThe information you provide in your project makes it difficult to determine if the project would be successful.", "q1r": 2, "q2": "I think it would be difficult to audit the project, even the information provided by the website seems insufficient, as a suggestion I recommend that you improve these aspects.\r\nThe 30,000 budget is not detailed or disaggregated, it does not mention an implementation plan or description of how you intend to achieve this interoperability.\r\nI think the idea is interesting, but it needs more development and explanation.\r\nI really hope to be of help to you. Greetings", "q2r": 1, "assessor": "z_assessor_743", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "Creating decentralized applications for money transfer between blockchain and fiat money especially in Africa region. It's always a good proposition that has a high impact on the community. However, I found that in the proposal besides describing what to do, there are no more detailed descriptions (technical solutions, how the protocol works). The impact of the proposal could not be assessed", "q0r": 1, "q1": "The proposer did not provide any information to demonstrate that they are capable of implementing the project. No team member identity, no roadmap, no KPI, no funding breakdown", "q1r": 1, "q2": "It is completely impossible to audit the proposal because member information is not available, Roadmap is not available, specific achieved goals are not available, funding breakdown is not available.", "q2r": 1, "assessor": "z_assessor_783", "no_vca": 22, "ne": 0, "ng": 16, "nfo": 6, "vca_o": 1}, {"q0": "While this does address the fund, it is very limited on Ideas and ways to implement. ", "q0r": 3, "q1": "There is no plan or any information about the proposers. There is also no plan or roadmap. ", "q1r": 2, "q2": "This proposal, while speaking to the nature of the fund, lacks any visible way to measure the progress of the proposal. The monetary breakdown includes no mention of how the 40000 will be applied to the project. ", "q2r": 1, "assessor": "z_assessor_970", "no_vca": 33, "ne": 1, "ng": 23, "nfo": 9, "vca_o": 1}], "solution": "Conseguir un plugin que permita la interoperabilidad entre blockchain y las transferencias de dinero tradicionales como Mobile money.", "experience": "Trabaja con una empresa de desarrollo de software y con un equipo sólido."}