{"id": 414114, "author": "rhysstoic", "title": "DAO Turn Key Deployment", "url": "https://cardano.ideascale.com/a/dtd/414114-48088", "category": 26594, "amount": 65000, "description": "Lots of projects are currently building on Cardano but have to fund their own UI development, service & tool integration and more", "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 1969, "q0": "The proposal aims to design, build and create a turnkey DAO tooling templates from the backend integrations to user experience frontend thus making it easier and less costlier for ideas to be easily deployed on the platform. This idea ensures that DAO enabled tools such as decision making processes, governance structures and DAO based functionalities etc. are made available off the shelf for both potential and existing projects in the ecosystem. Am convinced that the proposal is an awesome idea that should supported as fits into the challenge settings of making Cardano into a great platform to attract DAO based projects.", "q0r": 5, "q1": "From the information provided, it is obviously that team has the competence and capacity to deliver the project. The intended collaborations with ADAO Core Team and other partnerships is clear indicators that this proposal is very feasible. The budgeting is explicitly elaborate and corelates with its specified roadmaps. Am convinced that the proposal will be effectively implemented accordingly.", "q1r": 5, "q2": "The proposal has provided sufficient information about its goals and mission, and what it considers as being a successful project by readily making toolings and integrations available for the community. However, there should be a way for the community to verifiably confirm the progress and success of the project by ecosystem. A measurable metrics of the number of adoption and/deployment, number and/size of these integrations/tools and which segment and /category will be emphasized or designed.", "q2r": 3, "assessor": "z_assessor_2292", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7402, "q0": "It is proposed to build a DAO schema, helping projects not lose time to develop interfaces, easily connecting parts related to blockchain tools. Optimizing finance and capacity for projects. So this proposal is perfect for the Challenge\nAs for the solution, the items listed by the project help me visualize the work to be done with the partner. All support and cooperation are necessary to produce quality products, especially suitable for the end purpose. It seems that the path to the mainnet of the projects is clearer\nIn terms of risks, does the project plan to audit or test the open-source code for developers to check? This limits the risk that projects are not confident when collaborating. Projects related to voting, wallet addresses, to tokens must be transparent. But if using open source code, with all the code presented, will it affect the financial picture the project is aiming for? I'm looking forward to the project explaining this part in detail. I rate this part 4 points\n", "q0r": 4, "q1": "The project lasts for 6 months with specific topics at each stage. And as suggested above, the project should add an audit phase. This helps the project to create real power, a truly decentralized tool. With a total budget of 65,000$ accounting for 6.5% of the whole Challenge, this is an appropriate ratio, the detailed budget is divided into 6 items, I think the project should be more specific in terms of hours worked, and the number of tasks in each subject. The more specific, the better the project can manage the work progress, and the easier it is for the community to monitor and evaluate\nAbout the team, with what the proposal presents, I see the members have a lot of experience as developers, DAOs, and SPOs. However, I cannot verify these data because the project does not provide the social network links of the members, and the products they have made.\nAt the same time, for this project to be completed properly, the workload is much in 6 months, and the members are involved in other projects in this fund and previous funds. Will that affect this project? How do you allocate your working time? Please make it clear for the community to understand.\nI rate 4 in this section\n", "q1r": 4, "q2": "Github commits, publishing progress to youtube (please provide specific link) includes what results? The project should be more specific, for example, the number of designs, number of variations, number of marketing materials, number of projects providing services, etc. These are visual indicators that are easy to quantify. Make it easy for the project to keep track of the progress, and easy for the community to follow and support. The success of the project as a turnkey for DAO services, unblocking the knot, with an expected boom in the near future. Hope my contributions help the project more complete, I rate 4 points in this section", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8825, "q0": "As there is lot of time and money wasted on writing the codes of UI ,which holds the same designs of previously created by other people , hence  instead of wasting such time on Duplicating task , The same time can be utilized to improve the logic or optimize the task ,hence to develop a portal which is similar to bootstrap is a great idea where new developers can make use of the code and can add it in to their personal code, and can even change the design according to requirement, hence to remove the duplication of task this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The mentioned task is never an easy one where developing different types of UI codes takes time , and a portal should also be built to show case these codes,  the build can be achieved but the time is a main concern that can be seen here.\nThe team has experienced people where it involves software engineer ,who have contribute d in development in block chain development previously, the team has even great experience on how block chain works, which is definitely helps in developing codes and where linking of wallets, staking,voting and other aspects related to cardano. Hence, with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit has clearly introduced the proposer's team and other members who have expertise in software development with additional  knowledge of on how cardano works, The audit has displayed which are the turn key tools they are concentrating which involves Improvement proposals, Voting, Wallet connection, Staking mechanism\nContract deployment documentation & integration tools.\nThe audit has clearly explained about budget breaking idea and it has also presented well structured timeline to complete the project, with a great goal ahead to make easy for new UI developers the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12660, "q0": "- Issues to be addressed: A lot of projects are currently being built on Cardano but have to self-finance the development of the user interface, service integration, tools, and more\n- Solution to the problem: Create a turnkey DAO schema to set up DAO services easily.\n- Ask for a project budget of 65000$\n- it helps cut design costs, and man-hours, and enables common standards of design and format to be established, enabling a larger and easier-to-use Interface standard for Cardano DAOs\n- makes DAO implementation much easier and will reduce the amount of work required for other teams to get their project from concept to Mainnet!\n- enable people to deploy the services they need with a prototyped user interface and detailed documentation of connecting services, styling to include project branding, and more\n- Possible risks:\nIntegration issues can slow proponents if they do not hire the right people for rapid deployment. Finding people with the right skills to build services efficiently can also slow growth dramatically.\n- Proposals can expand the scale of the project", "q0r": 5, "q1": "- The proponent provides information about the project participants and their relevant experiences.\n- Provide a realistic timetable to implement the proposal within 6 months, the work content of each month is planned in detail, and in detail, it is possible to assess the progress of the project.\n- Budget broken down into reasonable categories including UI Design & + UI & UX Design: $8000\n+ Schematic design and implementation in Nx: $16000\n+ React Developer: $16000\n+ Marketing: $12000\n+ Service and back-end integration: $10000\n+ Consulting fee for the service: $ 3000 for each job corresponding to the funding the proponent also clearly identifies the amount of manpower needed as well as the specific time to perform.", "q1r": 5, "q2": "- Provide a specific, detailed roadmap with milestones and timelines for achievement and clearly defined metrics to measure.\n- When the project is successfully implemented: An initial scheme can be a turnkey implementation of DAO services with wallet connectivity, voting, staking, and user interfaces for related tools. will provide more turnkey solution diagrams for individual elements of web3 applications such as staking, voting, minting, and more.\n- Clearly describe the problem, understand the problem and give the appropriate solution.\n- Is a completely new project and is not a continuation of another proposal.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 13456, "q0": "This proposal effectively solves the challenge of so many projects currently built on Cardano but having to self-finance UI development, service & tool integration and more this is the problem need to address this challenge and it is directly related to the challenge. Well defined solution is to create turnkey DAO schema for easy setup of DAO services this solution can solve the problem of challenge. This idea fits the criteria of the proposed challenge to be scalable to address future challenges. The proponent has also identified the main risk to this project's failure as integration issues that could slow the project's progress if they don't hire the right people to quickly implement the project will perform as undesirable as their previous request. To minimize this risk, the proponent has collaborated with the ADAO community to attract the right people to carry out this project, with relevant skills the author is confident that the project will be successful.", "q0r": 5, "q1": "Propose clear timelines. The timeline for implementing this project is divided into 6 months, the content to do for each month is listed in detail by the author. I find that this timeline is completely possible to make the project successful. The author has given an initial sketch that can implement DAO services with wallet, voting, staking, and user interfaces for related tools. The success of the project is entirely related to the challenges of the campaign.", "q1r": 5, "q2": "Well defined KPI determines the success of the proposal through the number of views, some people follow the project on gihub, share...they will make monthly progress calls and publish to Youtube to clearly see the transparency for the community. The author came up with great ideas that effectively tackled the challenge. The team's development team includes: DAO staking team, ADAO team, Web Devs, UI & UX designer, Blockchain developer. They are elite members and passionate about their profession. The grant application budget of this proposal is $65.000 of the budget that has been subdivided by the project author into smaller and appropriate chunks to meet the stated objectives. The budget is divided into 6 stages: UI & UX design: $8000, diagram design and implementation in nx: $16.000, React developer: $16.000, marketing: $12.000, service and integration back-end case: $ 10.000, consulting fee for the service: $ 3.000. This budget I see the author's detailed allocation will increase the credibility of the proposal.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Create a turn-key DAO schematic for easy set up of DAO services.", "experience": "StakingDAO Team, ADAO Team, Web Devs, UI & UX design, Blockchain developers"}