{"id": 414257, "author": "lpanchot", "title": "Clarity DAO Infrastructure", "url": "https://cardano.ideascale.com/a/dtd/414257-48088", "category": 26594, "amount": 99200, "description": "There is not an existing solution on Cardano that enables non technical DAO creation, DAO proposal/treasury management, and DAO governance participation.", "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 6298, "q0": "This proposal is about creating DAO infrastructure with the help of a library of smart contracts known as the Clarity protocol. This infrastructure will allow non-technical DAO communities and members to interact with on-chain DAO.\n\nAs mentioned by the proposer, there is a lack of protocols on Cardano. This proposal aims to lower the barrier to entry for a non-technical group to establish and interact with DAOs. They will do this by increasing the DAO toolsets and frameworks available at the disposal of interested participants.\n\nThis proposal aligns with the challenge statement as it will grow the number of communities engaged in Cardano-based DAOs and help onboarding new DAO creators and users.\n\nThis will surely add value to the Cardano Ecosystem as it is overcoming the non-availability of Cardano-based DAO solutions. Moreover, the successful execution of this proposal and onboarding of many DAO creators & users will have a significant impact. ", "q0r": 5, "q1": "The proposer and his team will carry out the proposal, which involves Ben Hart from MLabs. MLabs is involved in many projects on Cardano and has completed many ventures. Hence the team seems qualified to execute the proposal. Also, all team members' details are provided with their qualifications and role in the proposal.\n\nThe roadmap is provided, which is divided into nine milestones. Each milestone is assigned with the tasks and the duration required for those tasks.\n\nThe budget is based on the number of development hours required to complete the several tasks mentioned in the roadmap. Therefore, considering the total hours of 1,240 to achieve the tasks, the budget is reasonable.\n\nGiven the above positive points, the proposal seems to be implemented if funded.", "q1r": 5, "q2": "As described by the proposer, we can track or audit the proposal's progress by following the completion of each milestone of the roadmap. I suggest using some platform like GitHub or Jira. For example, Auditors can check Agora's progress updates on GitHub. The use of Discord for voting is coming in the later stage of the proposal.\n\nThe twitter spaces and Discord will be suitable to spread the awareness and marketing of the DAO infrastructure built under this proposal.\n\nThe proposer stated the key delivery dates with each milestone. These details will undoubtedly help the auditors or interested parties track the progress with the time factor. The timeframe is three months which is also reasonable.\n\nThe mentioned KPIs, such as total assets under DAO management, governance token holders, active voters and proposal makers, etc., can be considered to measure the proposal's success upon completion.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6961, "q0": "   - When society is developing strongly with emerging technologies, it is very appropriate to put DAO technology into the infrastructure. Here I saw the team come up with a solution that is, create a hosted web platform to interact with the ora admin module and extend Agora to provide advanced features foAgr DAOs. I found the issues raised by the group well suited to the challenges. The description of the solution is also quite clear that with an Infrastructure this will increase the number of communities participating using the Cardano DAO tools. solutions as stated were also very clearly defined. however, the group has not yet mentioned specific evidence or studies. On the part of risk management, the proposed team also mentioned some risks such as Technical challenges related to computation/reward distribution and concurrent voting. However, it is not clear how to reduce that risk. It will be great when the team can add that.", "q0r": 4, "q1": "   -  In the section providing the detailed plan and progress of the project, I see the team has outlined very specific timelines that are divided into 9 timelines the milestones have been broken down into specific phases I think with the stated timeline is reasonable to complete the set tasks. In addition, I see that the team has also stated specific goals that will complete the project in about two months. With a budget of $99,200 and has been broken down for each specific stage as mentioned above, I think this is very reasonable, but if the group has more budget contingency plans, it will be better. With the presentation of the team, I found the group to have listed seven members and assigned specific tasks to each member so it is very reasonable. the members all have a lot of experience so I think this project will be implemented very well. when asked If funded, would you return to Catalyst in a later round for more funding the team that responded will return to add features to the core infrastructure. I appreciate this very much.", "q1r": 4, "q2": "   -  On unit description to track project progress. I see that the group has outlined 9 very specific targets as in the project mentioned above. The success of the project has also spoken fully, there will be certain successes if the project is implemented KPI in stages, showing that the success of the project is very good and success is also very important. related to the campaign. However, this project is still in the concept stage and has not been tested in practice. This is a follow-up to two previously funded proposals, so I hope the project will be funded in this FUND.", "q2r": 4, "assessor": "z_assessor_2856", "no_vca": 12, "ne": 2, "ng": 5, "nfo": 5, "vca_o": 1}, {"id": 9917, "q0": "DAOs are the core feature of a wide range of different types of decentralized solutions. Because of this variety of use cases there is a need for multiple kinds of customized and easy to implement DAO structures. Modularity of DAO tooling is an important element for making it possible. Agora is an existing open source solution, funded by previous Catalyst funds, for an easy blockchain governance setup. This proposal aims to use and extend Agora's functionalities by providing audited smart contract libraries to perform different capital operations inside a DAO. Governing funds securely in a decentralized way is a vital feature of DAO architectures. \n\nClarity is a DAO itself so there is a decentralized process to keep upgrading the tooling for the custom DAOs. This increases the certainty of evolving infrastructure and adds confidence to build on it. It can be expected for this new DAO tooling solution to attract more communities to use Cardano as their DAO infrastructure. Because these communities do not need to have high technical skills, the number of potential users expands significantly. \n", "q0r": 5, "q1": "There are 9 different milestones covering one project entity each. The budget breakdown matches the roadmap well but could include a bit more technical details to add my understanding. \nThe team members are and have been deeply involved in building infrastructure on Cardano. Their work is well documented and information about their skills and roles are visible. The project is highly technical, requires a successful UX design and tentative timelines seem ambitious so there may be delays. The infrastructure is planned to be expanded after this round and the need for follow-up funding is likely in the future. However, it is not required for completing this project.\n", "q1r": 5, "q2": "The clear roadmap gives a solid background for measuring the progress. Weekly development updates are extremely welcome when it is about a technical development project as this project is. A specified opportunity to ask questions would be a nice extra.\nThere are clear quantifiable KPIs for both pre launch and after launch periods. The target goals on these metrics are also given. Some metrics as total assets under management are capable of estimating the overall value whereas the number of different projects and tokens captures more general awareness and the growth potential. Creating automated tools to trace and track value paths which have origins in this project, might possibly generate useful information in the future. \n", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11440, "q0": "The proposer has good idea about creating the Clarity - an user-friendly protocol which allow even non-technical DAO communities to participate in on-chain DAO interactions. If successfully, this protocol could lower the barrier to entry so that anyone could create, manage and participate in DAOs. Moreover, I think, this project is suitable for the challenge as it will increase the number of communities engaged in collaboration using Cardano DAO tools, the amount of ADA generated from DAO's transaction fees,...I appreciated the proposer's effort and seriousness in this project which could be shown in his attached White paper that tell more about his idea. ", "q0r": 4, "q1": "\"The proposer have a good detail of the development of the project. The project is devided into 9 milestones with targeted main tasks and clearly estimated completion time from 1 to 2 weeks which shows their seriousness and effectiveness in delivering this project. My suggestion is to give starting day and finishing day of the project. Regarding the budget, it is quite detailed, the total time of project development is 1240 hours, and we know how much time will be needed for each task with the corresponding hours. My recommendation is that I would like the proposer to detail how much is paid per hour for professionals? How many people would be needed to complete each task?\nFinally, the team involved in the project are introduced very detailed. I know their name, education background and their rich experiece with public Linkedin profile. Therefore, I believe in the feasiability of this project because the information is provide in a quite detailed way. \"", "q1r": 4, "q2": "The auditability of this part is very good as we could track the development of the project based on key metrics for pre launch and post launch given by the proposer. Also, they give a very clear KPIs for Pre launch: milestone completion rate, the number of DAOs, proposals, votes, and community members, ...and Post Launch: 5 DAOs in 3 months, 20 DAOs in 6 months, and 50 DAOs in 12 months by using Clarity. Afterall, I give give this part full mark because the information is very detailed so anyone in the community could follow the project. ", "q2r": 5, "assessor": "z_assessor_3246", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12288, "q0": "This is a set of smart contracts promises to create the ideal incentives and conditions for decentralized and egalitarian economic growth. At its core, Clarity is an ecosystem that enables organizations, communities, investors, and company owners to pool, manage, and govern money in a secure, efficient, and decentralized manner.\nBy giving democratized access to a library of verified smart contracts functioning as DAO infrastructure, organizations and communities are able to organize, rule, and manage themselves in novel and creative ways.\nEven non-technical DAO communities and members can participate in on-chain DAO operations thanks to the user-friendly Clarity protocol. Anyone will be able to create, manage, and engage in DAOs with the use of this protocol. By developing a Cardano rival to DAO roll up and administration platforms that now run on Ethereum and other chains, this infrastructure would boost the amount of DAO toolsets and frameworks that are accessible when choosing DAO ops on that network.\n", "q0r": 5, "q1": "they also mentioned the problems and risks encountered along with remedial measures. Besides that is their development plan in phases (1 week, 2 weeks). The development team is experienced and has made their identity public. They will be able to develop an Agora \"Governor\" component after they have created the necessary smart contracts. They will be able to construct a DAO with simple, configurable governance rules once they have created the necessary smart contracts,... I think the project will become a success with the dedication of the development team.", "q1r": 5, "q2": "The completion rate of the aforementioned milestones will be used to gauge progress. Weekly development updates will be provided to the community in order to communicate milestone progress.\nUsing the Clarity DAO discord bot, they will count the number of DAOs, the number of proposals, and the number of votes cast.\nThey will gauge the Clarity Community's size.\nThey will calculate the number of hosted Twitter spaces. They will actively measure, track, and communicate these KPIs for each DAO using Clarity Infrastructure: Total Assets under management , Governance token holders , Active voters and proposal makers , Decisions , Votes. Auditing is entirely possible.", "q2r": 5, "assessor": "z_assessor_3395", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 13352, "q0": "This is a great project that helps simplify the DAO infrastructure through audited templates and makes it easy and automated to use DAO use cases.\nAnd I think with a new trend like DAO, if this project is successful, it will be used a lot by the community, bringing a lot of value to the ADAO ecosystem.\nThe novelty here is that your project can allow \"non-technical\" DAO members to also participate in on-chain DAO interactions, which can be said to remove technical barriers to making it possible for anyone to create, manage, and participate in DAOs operating on the Cardano blockchain, if this is successful it would be a great thing to attract users to the Cardano DAO.", "q0r": 5, "q1": "First of all, the MLabs DAO is already a project in full development with some work done from Catalyst before that.\nThis proposal provides a detailed and clear workflow.\nMembers are provided with details of their expertise and work experience to apply to your project, the team also has many years of working in the Cardano ecosystem, so they have a good understanding of how DAO works. more on Cardano.\n  However, when it comes to the description of the budget breakdown, I see 1240 hours of development, how do you calculate this? and I also haven't seen the cost per hour worked? So how do you come up with a budget figure of $99,200 for the project? You can share more with the community.", "q1r": 4, "q2": "The information provided is sufficient to fully assess the progress and success of the project across the 3-month, 6-month, and 12-month milestones.\nKPIs have also been given a specific number so that the community can visualize the success of the project.\nThe information is described fully and in detail by the team, easy to read and check, but you should provide a URL or a link so the community can go there and see the KPIs for audits your project audits.", "q2r": 5, "assessor": "z_assessor_3616", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "We are creating a hosted web platform to interact with the Agora governance module and extending Agora to provide premium features to DAOs.", "experience": "Our core team has been in the Cardano ecosystem for years and have been key contributors to the development of Agora, an open source governance module for the Cardano Blockchain."}