{"id": 414491, "author": "jo8n", "title": "DAO DAO! (sing song, like: tä-ˈdä!)", "url": "https://cardano.ideascale.com/a/dtd/414491-48088", "category": 26594, "amount": 3333, "description": "Ensure you say what is wrong. --> DAO: 1) Decentralized 2) Autonomous 3) Organization has no TRUE definition: <3...Has anyone used community created DAO tools to make a DAO of One person on Cardano?", "f6_no_assessments": 6, "f6_rating": 1.7222222222222223, "videos": [], "media": [], "f6_assessments": [{"id": 14979, "q0": "In the interest of saving us time, I will not mince words. I find this proposal incoherent at best and intentionally confusing at worst. If I’m wrong and I misunderstand, I apologize. The reason I say this is because the problem statement says the following: “Ensure you say what is wrong. --> DAO: 1) Decentralized 2) Autonomous 3) Organization has no TRUE definition: <3...Has anyone used community created DAO tools to make a DAO of One person on Cardano?”\nI for one do not understand what the proposer means when they are referring to a DAO of one. The proposed solution does not clear it up either: “Focus on what you are going to do --> Starting with the 1st principle, I TAO/道 (daʊ) to justify a TRUE belief of the definition of D.A.O. I TAO, therefore I D.A.O...I only, truly know a DAO of One.”\nI tried reading through the rest of the proposal and it’s mostly the same type of nonsensical statements, aside from the fact that it’s also mentioned that the proposer wants to work towards decriminalizing psychedelics in their state of residence and to make NFT’s.\nAs I said, the problem statement, the solution, the plan and everything else is incoherent and I completely disagree this proposal effectively addresses the challenge. Score: 1.", "q0r": 1, "q1": "Again I do not want to waste anyone’s time by going too deeply into something that’s essentially incoherent, so I will simply say that there is no valid deliverable described in this proposal and as a result, we cannot even talk about Feasibility.\nThere is no plan (quoting from the proposal: “What will happen at each stage --> Collaboration”), no actual budget breakdown (“3 Months --> $3333 / $1,000,000 = .003333 x 100 = .3333 % of the F9: DAOs <3 Cardano Budget”), no information about the proposer except for their Ideascale profile, nothing that is expected of a serious proposal. Score: 1.", "q1r": 1, "q2": "There is not much else to be said in Auditability either. It’s full of nonsensical statements, the same as the other categories. For example: “Decentralized --> Have I submitted this proposal that no one else could have made right now for vote in Project Catalyst? Yes, (given no technological issues) audit complete.”\nTo conclude, this proposal does not explain clearly what it wants to achieve, there is no plan and no metrics to measure progress, so I completely disagree that the information here is sufficient for auditability. Score: 1.", "q2r": 1, "assessor": "z_assessor_2335", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15005, "q0": "The proposer is attempting to legalize cannabis in their town by creating a \"DAO of one\". This DAO would sell art to the Cardano community and allow the community to provide advice on how to ultimately approach city council to argue the merits of legalizing cannabis. Indeed, cannabis is not illegal everywhere. There has been legislation allowing it's use passed in many places. It might be helpful if the proposer compared this approach to what they are proposing and assessing which path might have more of an impact with their regional lawmakers. The proposer hopes that they spark discussion of the legalization of cannabis and supposes that it is a taboo subject, however this is not true as cannabis is legalized in many places and there are quite a few blockchain/NFT projects that embrace that theme.  The proposer also compares the acronym DAO to Tao - of the Taoist spiritual belief meaning \"the way\", a universal principle that underlies everything. Using something in ways other than they were intended is fine; you could use a chair as a table to hold a plant or perhaps as a art piece if you wanted to, but you could argue that it might have a bit more impact if it is used for sitting - the purpose it was created for. Recommend that instead of a DAO of one, the proposer create an actual  DAO that uses methods that have proven to be more reliable in the past to purse their goal of legalizing cannabis in their jurisdiction. While this proposal is very creative and unorthodox, by definition, a DAO of One isn't really a DAO at all and won't have much impact in the challenge", "q0r": 1, "q1": "The proposal brings up some deep philosophical arguments - can someone be in two places at once? This question follows from the definition of decentralization: \"the transfer of control of an activity or organization to several local offices or authorities rather than one single one\". Unfortunately, in order to be a DAO of one, the proposer would have to violate the principle of quantum superposition (perhaps best demonstrated with Schrodinger's Cat). The framework for a DAO will utilize the blockchain for the \"autonomous\" part setting rules in place for the governance of the DAO. The proposer doesn't suggest that they have any experience with this (this might be because the only ledger a DAO of One would need would be a leatherbound one in their pocket.)", "q1r": 1, "q2": "The proposer breaks down how their proposal will be audited into some quantifiable aspects: They hope to measure an increase in the discussion of the topic and obtain a business license. They hope that they can discuss progress at town hall meetings to update the community as well as other channels such as zoom and discord. There is also art that would be produced which is quantifiable aspect. Success is determined if the proposer is able to submit their proposal with the communities help to their local government representatives.", "q2r": 5, "assessor": "z_assessor_2242", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15012, "q0": "After reading this proposal, I consider that what is being sought does not have a great impact on the attraction of DAO's as well as the creation of tools to facilitate their management. I consider that the proponent found in this challenge the most viable vehicle to launch his proposal that has more to do with a forum to talk positively about Cannabis, but although a DAO could help to give this topic visibility, this is not the goal of this challenge.\nUnfortunately, I do not consider this proposal to be aligned with the challenge at hand.", "q0r": 1, "q1": "I understand that the proponent has a strong interest in promoting discussion and dialogue about the use of Cannabis, and believes that a DAO could be a vehicle that would allow him to have a forum and greater visibility to discuss these issues before the community. However, in this proposal there is no detailed plan nor is there a clear notion of how to create such a DAO, it only lists a series of unconnected actions to promote such a dialogue.\nI recommend the proponent to meet with people from different disciplines with the same interest, so that they can join their skills and shape the creation of this DAO. Right now this looks like a one man show with no clear plan. There´s also no explanation of what will the budget be used for.", "q1r": 1, "q2": "Unfortunately, a successful outcome of this approach is difficult to measure given that no  parameters or metrics are proposed.\nThere are no concrete objectives or events to monitor, and the goals proposed are ambiguous and too general.", "q2r": 1, "assessor": "z_assessor_2719", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15020, "q0": "The proposal would be within the challenge goal of Cardano NFT but not for DAO, because I think that this proposal probably will increase utility & adoption of Cardano NFT  challenge for the community (developers and consumers).\nAt the same time the statement of how problem is to be solved is poorly explained and in my opinion it doesn’t clear the problem that this challenge resolve, beacuse it is chaotically described and not explained the sense of the proposal… cannabis, nft, Dao, TAO… and so on!\nI think it's important to improve details about the proposal services solution for the challenge (eg. Typical services use case for developer, example benefit for service creator and community, …).", "q0r": 2, "q1": "The proposer not declared the team members and there aren’t any team members details and professional experience to imagine the project’s success, neither proposer experience and his experience on cardano community. \nThe aren’t given metrics measure what the proposer wants to do, so the success of his actions is not defined. As mentioned above, the description of the solution is not well explained (e.g. how the funds will be spent because there are only 3 months milestone and marketing effort, how the solution improve their customer experience, and so on…), so the progress of this proposal is not possible to assess.\nRoadmap and milestones (incl. time horizon) are poorly described and the budget’s information provided is very basic.", "q1r": 2, "q2": "There aren’t KPI to identify the proposal goal, but only poorly described deliverables. There aren't more details how the budget is going to be spent, also I'm trying to discover attachment to deep dive the solution.\nThe metrics for the assessment isn’t given, so it’s impossible to assess what the proposer wants to do, but the success of his actions is not defined. ", "q2r": 2, "assessor": "z_assessor_2245", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15029, "q0": "The proposal aims to create a „single person DAO“ based on the philosophical question – how can you form a DAO if you can not be a DAO yourself? Then, proposer lays out multiple aims such as to continue discussion on Cannabis and Psychedelic decriminalization within the town hall where he lives, create CNFTs, engage discussions within cardano community or creating AI art (but it is unclear whether it is AI generated, or just an art displaying AI, I would lean to the latter). Overall, the proposer then sets additional goals such as development of a toolkit of community tools for everyone to use, block chain use for cannabis seed sale tracking, or use of DIDs for cannabis  licenses. These goals are definitely a long stretch, because there is no proof or supporting information how would a single-person DAO would aim for these, no plan nor more details of such. \nOverall – the proposal lacks the clarity and logical relations between problem (create a single person DAO) and solution (engage with city halls, create CNFTs, create DID for cannabis licenses), and at the same time, there is no information to support the problem statement. Currently, there is plenty of DAOs, and if the proposer states that you need to be DAO yourself to be form a working DAO, then, some examples of issues that current DAO are facing could have been outlined. Without this evidence, it is lacking the reasoning. At the same time, most of tasks outlined by proposer are actually being already done (with or without funding), and some successes could have been provided to increase the impact of this proposal. Based on the information in the proposal, I do not find it aligned with the challenge (there is no information why cardano would be go-to block chain for creating DAOs, and at the same time, the impact of such proposal is not emphasized nor supported with any data. \n", "q0r": 1, "q1": "The timeline is set to three months, and the goal for each month is stated such as – after  1st month to have DID set up for proposer, 2nd to sell or donate CNFTs, 3rd to submit DAO business application to the proposer city. Reading the resources needed for these tasks, it appears that proposer will be asking community for help, thus, it is largely relying on the community, which makes the success questionable. Regarding the budget, the proposer just sets amount of 1111 dollars per month, without any justification, reasoning or expected time donation. For the proposer himself, and his skills and experience, there is no information provided except the ideascale link, but we can already see that some CNFTs are crated, or from the recording of the public speech from city hall, that he is capable of being engaged community citizen. Nevertheless, because the budget is not justified and the timeline relies on community, I do not have a high confidence that the proposal is feasible. ", "q1r": 3, "q2": "The problem is actually poorly defined, and is posed as philosophical question, and the solution is ranging from many different outcomes such as CNFTs, engagement, town halls speeches, DIDs for cannabis businesses, and some more. From the perspective of problem – none of these goals will measure whether the problem is solved. On the other hand, all of these goals are measurable or trackable…number of sold CNFTs, recording of town hall speeches, and proposer mentioned some even in feasibility section such as discord chats (but it would be nice if a dedicated discord is going to be used, or chats on multiple other discords will be used). ", "q2r": 3, "assessor": "z_assessor_2222", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15065, "q0": "This “DAO of One” proposal is surely irreverent, quirky and noteworthy. Unfortunately, it does not fit any of the challenge setting directions for Cardano DAO Tooling. Challenge metrics like number of DAOs and ADA from fees of DAOs will also not be moved meaningfully, if at all. Maybe this could have had more Impact under a miscellaneous, art or products related challenge.", "q0r": 1, "q1": "The artwork of the proposer listed on Fibo looks beautiful and a lot of milestones have been provided. However, it is very unlikely that the planned Cannabis/Psychedelic DAO business application to the proposer’s City will go through successfully without more planning on who the relevant politicians are, what the current status quo is and whether a DAO is the right tool for the job.", "q1r": 2, "q2": "The proposer could have come up with meaningful success metrics, for example relating to CNFT sales, community engagement or alternative metrics that measure the quirky, offbeat nature of this proposal. Unfortunately, this chance was missed and only two binary metrics are presented. Will the outcome be Decentralized (yes) and Autonomous (we decide). This is no way to assess whether $3333 have been well spent. I do not doubt the good intentions, but we need just a little bit more focus on the business as it is the voter’s hard earned Treasure ADA that are on the line.", "q2r": 2, "assessor": "z_assessor_2761", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Focus on what you are going to do --> Starting with the 1st principle, I TAO/道 (daʊ) to justify a TRUE belief of the definition of D.A.O. I TAO, therefore I D.A.O...I only, truly know a DAO of One.", "experience": "My City does not allow Cannabis business. I spoke in multiple City Council Meetings about Cannabis/Psychedelic decriminalization to no avail. Now, I realize I must take the legalization route, & I will submit a local business application using Catalyst/Cardano CNFT/DID/DAO tools."}