{"id": 414982, "author": "littlefish.foundation", "title": "littlefish - Ikigai in Community", "url": "https://cardano.ideascale.com/a/dtd/414982-48088", "category": 26594, "amount": 50000, "description": "Participants of digital communities lack visibility on each other. Individuals' interests, skills, and wants are not visible to others. This slows down collaboration in decentralized work.", "f6_no_assessments": 4, "f6_rating": 4.916666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 6661, "q0": "Littlefish is a DAO that wants to reimagine work. In today’s world, the mechanisms we use to earn income are outdated and suboptimal. They limit autonomy within the workspace and represent a costly trade-off between financial stability and personal growth aspirations. Well, littlefish wants to start afresh with a model that stimulates individual leadership and initiative, asynchronous work, voluntary participation and a constantly evolving landscape. \n\nLittlefish have chosen the distributed ledger technology to set up camp because it can boost ideas like anything we have seen before, and they have chosen Cardano in particular due to its research focused ethos and the fact that Catalyst was the spark behind the idea rolling down the hill. As a personal note, I add that Cardano was an excellent choice also due to low transaction fees, best suited for such a project, but more details on this in the following section. \n\nTo fully understand their value proposition you have to visit their website and read the white paper. They have a fresh style, they keep all the information simple, easy to understand and it is complemented by very informative charts and diagrams. This assessment cannot really do justice to all their ideas, but here is the nutshell: the functioning model is built around the user (little fish) who is part of a wider entity (the colony). Littlefish are of course economic actors wishing to maximize their utility, while the colonies are created around a common goal / idea / task / cause / etc. The littlefish performs actions, and these actions are treated as an economic goods, thus carrying value and can be exchanged, or rather sold by the little fish. Another key feature of the model is a revenue sharing mechanism between the fish and the colony, complemented by a reward aging characteristic to incentivise fresh action over inactivity.   \n\nWhy are littlefish asking for funding? Because they want to develop a visual onboarding profile tool for new members, based on the old Japanese concept of Ikigai. Ikigai, in a traditional sense, has a certain meaning, but turning this into a DAO / blockchain analogy, would mean building the onboarding tool with the purpose of finding each new member’s sweet spot where competence, passion, a higher purpose and economic incentives meet together to create the perfect environment for that member (or little fish) to create value through the Action NFT. Littlefish have seven funding requests in this round, and they are all interconnected. Of course, all of them come with slightly modified value propositions, but nevertheless all are highly connected to the topic of DAOs, including this one which is probably the bonding agent between all of them and beautifully shapes the entire concept around this Ikigai onboarding tool. \n\nEverything within this proposal is a testament to the team’s rigorous process, no-nonsense approach of explaining their thinking and of course, it all fits extremely well within the challenge whose role is, I remind you, to foster the development of DAOs on the Cardano space and build the tools necessary for future projects. Well, this is definitely a perfect use case for that purpose. Moreover, if Catalyst would ever implement a sixth star, littlefish would be a prime candidate to receive one. ", "q0r": 5, "q1": "Let’s talk about the team first of all. You can search through the Fund 9 proposals high and low, it’s unlikely to find a better example of how a team presentation should look like. Each main team member presents him/herself in a few paragraphs, and it is all complemented by Linkedin profiles as well as the personal github repository (where relevant). Each member's presentation ends with highlighting the actual modules on which each member will focus, thus making the reader’s job effortless when trying to make connections throughout the text. I am extremely impressed by their meticulous approach. \n\nFor this proposal, their deliverables are split into four core modules and an auxiliary marketing module. Module 1 is the teaser, and free of charge, since the team would do those activities anyway - since it has to do with continuing the experiment with their Miro-based onboarding tool that captures the Ikigai concept. In module 2 the team plans to create and run 3 workshops with other communities and teach them how to use the Miro tool, as well as to collect information about the experience. In module 3 they would focus on designing the tool and offering a solid UI/UX. The features are not yet written in stone since they will use the workshops from Module 2 to clarify the scope of work. Module 4 is the building phase: developing the front and backend, testing and finally launching the MVP in beta mode for community use. \n\n Of course, each of the modules briefly touched upon in the previous section are presented in great detail, and we can immediately realize what kind of activities will be taking place, as well as complementing the description with an estimation of the hours involved. Going further into the details, for each module we know the relevant stakeholders, the primary working group, the estimated duration and necessary hours. And if this wasn’t already enough, the entire proposal is sprinkled with useful links where you go very deep down the rabbit hole into, for instance, past payment sheets for existing members, external case studies relevant to what you are reading or simply a beautiful post-it board to see the broad picture of how a certain module is intended to work. \n\nThis is also one of the very few projects that do take seriously the task of going through a risk assessment, and actually identifying, documenting, finding ways to mitigate and properly disclosing some of the risks that could affect the project. Again, just to offer a flavor of what is presented, the team discloses in great detail the financial risk stemming from the fact that a significant portion of the team is based in Turkey, currently experiencing hyperinflation, and the mitigating actions to lower the future impact of the situation. \n\nThe budget is built on very solid principles, however it works a little differently compared to traditional projects. We start with the key information that the budget is built around the base hourly rate of 50 USD, deemed by the proposers sufficient to sustain a living wage in most places around the world, thus offering financial stability to full timers. Each module has its own separate personnel budget and there is also an extra caption for each module, similar to an overhead, as a percentage of personnel costs. A part of it is to be spent at the discretion of the module team while the rest is pooled to cover common good expenses. On top of all this lies an action fund (25% of the total) acting as a buffer mechanism to ensure short term sustainability and allow for estimation errors or even to fund additional modules if deemed necessary. \n\nIn conclusion, tt is a joyful experience going through this proposal and again, reinforcing the message from the previous section, littlefish passes the feasibility test with flying colors. ", "q1r": 5, "q2": "Littlefish is built around openness, so ensuring full auditability of its activities comes rather naturally. The team publishes major updates on Obsidian (an online knowledge base solution), while their Miro boards are open to the community. The team uses Discord for daily activities as well as to “shout” when actions are done, in a similar way as to how Deworks / Discord works for Catalyst Swarm and bounties. The team will also use google analytics to track the overall success of the DAO (number of visitors, average time spent, etc.).  \n\nLittlefish also offers very logical solutions for tracking the proposal’s specific modules. Generally, the team will maintain open source repositories and share updates with the community on their communication channels. For this proposal in particular, it is of great value the fact that they will collect information during the workshops and publish their findings - since this will offer the best view that the community can expect into the inner workings of the project and judge qualitatively the results of the work. Overall we have a very solid way of tracking the performance of the proposal. Littlefish is a beautiful experiment and it will be extremely easy for the Cardano community to follow its development. Of course, five stars for auditability.", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9924, "q0": "The simplified vision (in my own words) of the Littlefish Foundation is to create powerful information systems to allocate any kinds of resources more efficiently than has been possible in the past. This proposal suggests building visually appealing tools to spread purposeful information about and between human community members so that they can be as efficient as possible at solving any kinds of real world problems. The concept helps people to find their place in the community. Especially when it is about decentralized work happening in DAOs, people don't know each other well enough to find optimal collaboration dynamics. \n\nIn many cases the whole purpose of a DAO is to keep its members as independent and diverse as possible but still able to work towards a common goal in an efficient and aligned way. With machines and AI we have APIs for creating connections and natural scalability but in the case of humans there is a great value in being able to get a good understanding of numerous other fellow contributors. Visual presentation is generally the most efficient way for the human brain to grasp information. \n\nHaving the suggested system in place makes it much faster and easier for newcomers to connect to the others and the process itself. When this friction is alleviated the DAOs become more functional, dynamic and efficient faster than before. The DAO structure may also become an attractive option to many processes for which it has earlier been too inflexible, expensive or inefficient. However I would like to emphasize the importance of easy UX and successful visual outlook when the application is dealing with people' personal traits, features and preferences. In conclusion, this proposal when completed enables more DAOs and more efficient DAOs on Cardano blockchain. Thus it is very well aligned with the goals of this challenge.\n", "q0r": 5, "q1": "Budget has been divided into five clear modules and there are separate budgets for personnel and other operations. There is also flexibility and synergies with other proposals from Littlefish Foundation. So called Action Fund, which is used for creating demand for action NFTs, can flexibly be higher or lower depending on realized costs and funding outcomes of other proposals. Schedules and duration estimates are given for each module and everything is expected to be finished by the end of the year. \n\nTeam members and their roles in implementation of the proposal are presented clearly. LinkedIn profiles and github repositories are available. After learning about team members' experience, I don't see big risks regarding technical delivery of the proposal. It is more about the design of social attractiveness to gain adoption. They have also been deeply involved in Catalyst operations in different roles. \n", "q1r": 5, "q2": "The most important delivery phase KPI is the Actions because all the community contributions are Actions. Step by step these actions take the form of NFTs and the process gets more efficient. All the advancement can be followed in Obsidian, Miro board, Discord and git repositories. Everything is publicly available and free to be discussed. Community, Ikigai use, and development work are all regularly measured from above mentioned sources and reported to the community. \n\nPost implementation KPIs are quantifiable and easy to understand. There are metrics for onboarding people to LFF as well as onboarding other communities. As a fully open and community driven project, the level of transparency is extremely high. \n", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 15179, "q0": "The proposal is a great idea. It adresses difficulties of  organizing decentralized work and of sourcing of specific skills by an easy-to-use aproach. Coming from project work myself I know how invaluable tools for proper sourcing of skills are to efficient work.\nIt will be quite useful to DAOs, to the reasons also mentioned in the proposal.\nThus it also matches the challenge quite well and will contribute tothe scalability of DAOs, thus being extremely valuable towards the Cardano ecosystem.", "q0r": 5, "q1": "The proposers are known faces in the Cardano community and have proven to be reliable and credible. The whole feasibility section is pretty well-made: The proposal team is transparent about their skills and they seem up to the task. \nThe roadmap is fine-grained, clustered by sensible milestones that have sub-tasks explaining the courses of action and giving all neccessary info. \nThe budget is explained, has a reasonable hourly rate and milestone specific budgets that add up, also having a contingency budget. Moreover, also the risks to the implementation have been discussed in a credible manner with matching mitigation strategies.\nOverall, a good, feasible proposal.\n", "q1r": 5, "q2": "The problem description is clear, as is the described solution that will be implemented. A very detailed roadmap gives a good impression of what will be done and has to be tracked, and the proposers provides the neccessary tools, platforms and communication channels to enable the community participating and auditing.\nThe success criteria and metrics are clear and in order, some quantifiable KPIs however should be added. Good job overall though :-)", "q2r": 4, "assessor": "z_assessor_2257", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15181, "q0": "Great idea, very excellent. Proponents recognize problems in collaboration in communities that are working online. In order to achieve a perfect decentralized model, decentralized but still connected between people, it is necessary to understand each other's wishes, aspirations, interests, and forte. Thanks to the understanding, there will be a division of work, proper use of the opponent's skills, and increased work efficiency. The proponent proposed the idea of ​​building a tool based on Japan's Ikigai principles to visualize the interests and strengths of members in the decentralized community. This tool applies blockchain technology and operates like DAO, helping introduce and connect community members together to work together more effectively.\nThe proposal, if successful, will help increase the number of communities participating in using tools for DAOs, increase ADA from DAO transactions, and contribute to increasing the number of tools for DAO activities.\nTherefore, it can be said that this idea has an impact that fits this Challenge requirement.", "q0r": 5, "q1": "The implementation plan is very detailed. Work items and necessary durations are clearly listed. Display work is modules, including internal use, education, information sharing and collection, UI/UX design, user interface development, and marketing. The proponent thinks very carefully about the execution plan, which is a plus point showing good planning ability.\nThe budget is also presented very easy to understand. The staffing cost is quite reasonable, the unit cost of project development labor is 50 USD per hour. The budget makes up 5% of the Challenge's total budget.\nAbout the development team, the information about the experience is very detailed, the introduction paragraph is written with great enthusiasm, and all the information can be verified through the Linkedin and Github links. Sufficient information to determine that the project development team is experienced enough to turn the idea into reality.", "q1r": 5, "q2": "Catalyst and the community can track progress in the official Catalyst reporting channels, the team's public Miro, and Discord, Obsidian. Proposals have specific KPIs, both quantitative and qualitative.\nOverall, the proposal is informative and presented in a way that is easy to understand and thorough. This shows that the proposal team put a lot of effort into this proposal. Expectations are high for the transparency and viability of the project.", "q2r": 5, "assessor": "z_assessor_2578", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "An Ikigai based visual onboarding/member profile tool, charting what each member loves, is good at, can be paid for, and thinks the community needs.", "experience": "A community of Ikigai enthusiasts numbering 100+, started in Dec 2021, a core team of 10+ and growing, 20+ years of experience in software development, plutus developers, designers, entrepreneurship and startup experience, and active Catalyst community members."}