{"id": 416451, "author": "diegotorres", "title": "Web3 Onboarding DAO", "url": "https://cardano.ideascale.com/a/dtd/416451-48088", "category": 26594, "amount": 25300, "description": "The crypto industry onboarding can be overwhelming for most people. Access to grants is a great way to learn and experiment in this field. Most spanish speaker people don't know how to approach this", "f6_no_assessments": 6, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"id": 2578, "q0": "The issue raised by the proponent reflects the fact that there are very few people who understand the field of cryptocurrencies, specifically Spanish speakers. by creating a DAO solution to encourage people to gather in a group to learn and exchange together to understand cryptocurrencies. here they create an effective collaboration management system to encourage participation and reward individual and collective contributions in promoting the active participation of all human members who speak Spanish. The project uses Cardano as its governance platform. The project will issue tokens to finance DAO development ferry operations, moreover, it will also be used for value-sharing as well as DAO activities. This project will connect and provide more new members to join this industry. The proponent has identified the risks and has a plan to limit them. From the information available I agree with the impact of this proposal.", "q0r": 5, "q1": "The proposed team has 3 key members who are capable and experienced with blockchain, especially our Cardano platform, they have RatsDAO, RatsLab, 1Mate & Mazy as active projects on our blockchain. With such experience, I fully agree they can do it successfully. about the project roadmap expected to operate according to the 7-step process. they are expected to start implementation once the budget is approved and will be implemented in 6 months. About Budget it is listed in quite detailed subsections by month. however, if it has more information about the specific working time of the jobs, how long will it take to complete, they charge monthly but I don't know how many days they will work in a month, how many hours per day, convert the budget into working hours, the budget will be easier to evaluate the reasonableness. From the information already the feasibility of the proposal is good however it can be further improved by my contributions.", "q1r": 4, "q2": "In terms of auditability, the project provided timelines and metrics to measure the number of members, the number of teams, the number of grants, and the number of scalable projects. the success of the project is to have 1000 more members with more than 100 grants, 50 more projects in progress, and 5 projects coming out by the end of 2023. from the above parameters, I have enough information to check the project's progress. the only thing I would add to this suggestion is that it should have weekly or monthly reports maybe by talking to the community, or by updating them on Github, groups, and fanpage so readers can observe the continuity of the proposal.", "q2r": 5, "assessor": "z_assessor_2323", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1, "reply": "I agree that to improve budgeting rationale, I should work with FTE or monthly hours per profile."}, {"id": 2904, "q0": "The proposal addresses the challenge of onboarding new members to DAOs specifically on Spanish speaking countries. By allowing teams to apply for grants the proposal aim to incentivize registering and joining a DAO.\n \nCreating a new DAO based on a podcast listeners community is a worthy effort, however, this goal is not fully aligned with the challenge goals. Creating a new DAO does not addresses it directly as this challenge is for providing tools and services for DAOs on Cardano, as detailed on the challenge brief.\n\n", "q0r": 3, "q1": "The exiting team members seems to have the skill set required for this project, including DAO's designing and managing, community outreach and technical abilities. \n\nEven though the team is missing a project manager and a content manager, I assume that the proposers will be able to find people with the needed skills and fill those roles successfully. \n\nThe roadmap is clear, and the budget breakdown is feasible. The fact that the proposal is based on an existing Spanish speaking community of the proposer podcast listeners brings more assurance about this project chances to be implemented successfully. \n\nI will just add that some stats about the podcast engagement and listeners (how many? how much subscribers? on which platforms?) would have been helpful.", "q1r": 5, "q2": "The proposal provided KPIs and milestone, and measurable countified success metrics. \n\nHowever there is no clear timeline for the plan  progress by milestones, beside the estimated launch date that is planned for the end of 2023.", "q2r": 4, "assessor": "z_assessor_2360", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "I'm afraid I have to disagree that the DAO does not directly address the challenge of providing tools and services for DAOs on Cardano; creating a Social Layer is essential and complementary to the tools. Tools and services without people to use or test them provide no value! "}, {"id": 3378, "q0": "The proposers team has a vision to engage community in collaboration using Cardano DAO creation. And through this proposal, once the DAO operational, a lot of new people may become members and work together on various proposals within the catalyst project. The idea being onboard members and make them work in teams other  than individually.\nThis creates a direct impact on the cardano ecosystem. Meantime, the challenge objective would be met since Communities will be engaged in collaboration using Cardano DAO creation tools.\nThe scalability would be possible as the number of DAOs will grow and members increased.", "q0r": 5, "q1": "The Proposers team has already an advance on the project implementation. By running a podcast around crypto in general and cardano in particular, he should already be a known personality who would easily convince people to be part of the DAO. And as he said, 70 people in 2 weeks were ready to take part. A combination of elements susceptible to make this proposal a success.\nHowever the budget breakdown covers the general expenses with not much details about some items expenses to be covered under operative expenses and/or capital expenditure.\nThe six months project duration is well covered and reasonable for such an initiative to get established. \n", "q1r": 5, "q2": "The KPI are well detailed, but the proposers didn't specify how would the community be following the process of the present proposal.\nThe risks have been raised, which include: Irresponsible actions from the team; the complexity of the projects; the lack of developers and for each, a mitigation plan is foreseen.", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1, "reply": "I agree that the budget can be improved to be more legible.  "}, {"id": 3886, "q0": "The problem is that for most people, onboarding in the cryptocurrency industry can be overwhelming. Grants are a wonderful resource for learning and experimenting in this area. The majority of Spanish-speaking people are unsure of how to approach this, so the proposer wants to create a DAO to make the onboarding process easier by encouraging and assisting people in forming teams to apply for grants. By doing that, they can learn about and experience cryptocurrency. The proposal does add value to cardano ecosystem. The proposal effectively addresses the challenge", "q0r": 5, "q1": "Based on the details given the proposer and their team have relevant skills and experience to successfully implement this proposal. They have provided a clear explanation about the plan to implement. The amount requested being $25300 to execute the proposal. The proposer has provided a clear budget breakdown after analyzing it can be said that the budget demanded is reasonable for the work needed to be done. The proposer has mentioned all possible risk which may effect implementation. hence it is likely that this proposal will be implemented successfully. ", "q1r": 5, "q2": "The proposal do consist of a clear plan and tasks to be conducted in order to complete the project. But the proposer hasn't provided any timeline which would have been helpful the proposal has given a KPIs which will also be helpful to measure the success of the proposal. The proposer has also provided details on how the success of the proposal would look like. Therefore the info given should be enough to track the progress and the success of the proposal but I have deducted 1 star for missing timeline", "q2r": 4, "assessor": "z_assessor_2496", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 4561, "q0": "The proposal addresses the relatively steep learning curve crypto can have, especially once you move beyond basic transactions and into \"Web3\" applications and use cases. With much of the industry also English-centric, this can add additional barriers to entry. The proposal's strategy of focusing on grant-seeking and team formation through a DAO could be a smart strategic choice.\n\nIt would be nice to see a more developed version of the incentive system the proposal seeks to implement. Taking a cut of grant funds is an interesting approach to sustainability and would incentivize the DAO to hone its methods. ", "q0r": 5, "q1": "Though the idea is sound, the project appears to be in a very early stage of development with a white paper and working outline of the DAO's tokenomics still forthcoming. With a number of questions still in the air regarding the project's trajectory, the chances of a painless implementation of this DAO come into question.\n\nThat said, the proposer's experience within the Cardano ecosystem, project management experience, and in gleaning information through his podcast are certainly well-aligned to this project. Similarly, Ayelen's background in designing DAOs should help to quickly address some of the concerns I raised in the previous paragraph. Expenses appear to be appropriate.\n\n", "q1r": 4, "q2": "The proposal lists a number of KPIs which should give auditors a good sense of how well the project is performing once completed. I'd suggest giving them something to chew on in the meantime, however. Give us a window into how development of the DAO is proceeding. Where will the white papers be displayed? Will there be a testnet for tokenomics? Will we be able to see profiles for teams as they're formed? Even a development blog could add value.", "q2r": 4, "assessor": "z_assessor_2564", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "Good point in Auditability: The DAO will be as transparent as possible. A web page with a Notion & a forum should be enough at first, at least! "}, {"id": 5265, "q0": "The web3 onboarding DAO proposal is creating a DAO to ease the onboarding process by encouraging and helping people to form team and apply for  grants. This will evolve the community around the podcast he hosts. The proposal fits the DAOs love Cardano challenge quite well as it educates people on DAO 'by doing' although the proposal formation is based on the assumption that the community who listen to the proposer podcast would be interested to form team applying for grants. The proposer has provided the tokenomics how the tokens will be distributed and the 'project program' that he said is the most innovative aspect of this distribution. Tokens will be distributed in teams in exchange for a small % of grants awarded and for project tokens in case of successful protocols. However, he might want to explain where the grant is coming from and its relationship with project program. The proposer has mentioned the interest after he presented his ideas in podcast after 2 weeks, +70 people applied. However, he doesn't elaborate in which aspect they want to participate. The proposer has provided the link of his podcasts and RatDao to show his community. The proposer also identify risks and ways to mitigate them.", "q0r": 4, "q1": "I have read the white paper of RATDAO and the proposer might want to explain more about tokenomics. The total time for this project is 6 months and the responsibilities should be allocated along these 6 months instead of the list of milestones with no specific timeframe to complete. The cost is quoted per role per month with no pay per hour. The team member and responsibilties are sufficient to handle this project successfully. The team mentions that the revenue of this project is a % of the grant awarded by the teams (understandable as it takes the cut from the grant awarded) but the proposal doesn't elaborate further if the project program (accounted for 40% of tokenomics) are related to this grant, this revenue or else. The proposer will need to explain the revenue model clearer as obviously the grant itself is not purposefully to channel back to DAO and it makes the whole DAO structure become more like a shell for projects (accelerators) even though DAO should not aim to be an accelerator but more like decentralized in power and autonomous in its own form. ", "q1r": 4, "q2": "The success for this proposal is that the DAO will onboard +1000 people in this industry and apply for more than +100 grants. and that 50 ongoing projects and five projects about to launch theirs on platform and tokens. The team aims for the above success by the end of 2023. The team mentions different numbers for the KPI and put specific timeline to end March 2023. as the number of members +300, number of teams +30, number of applied grants +60, number of awarded grants +30 and number of scalable projects +5. Although these are concrete figures in KPIs. There is no particular KPI in this proposal that would allow community to track project progress between now (Aug 2022) and then (Mar 2023). From the information provided, The metrics along project timeline is important for the community to check in how much have been done to progress their DAO concept. Would the team show the proposal progress on RatDAO website or else? The team has not mentioned very clear yet about the metrics during their project timeline and could improve its auditability by giving the metrics for in between (start and end of project). ", "q2r": 4, "assessor": "z_assessor_2684", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "A few good points to improve regarding the Webpage of the DAO and a report of status! Both are considered to be on the web page and a notion dashboard."}], "solution": "Create a DAO to ease the onboarding process by encouraging and helping people gather into teams applying for grants. By doing that, they can learn and get crypto exposure ( poor countries can't buy).", "experience": "I've worked as Product Team Leader in web2 for over ten years. I also have a podcast with a committed community ready to onboard the Crypto ecosystem in general and Cardano in particular. I have also run a few projects on Cardano like RatsDAO, RatsLab & 1Mate Pool."}