{"id": 417704, "author": "lutvirosyady", "title": "Ads Platform SSP & DSP with Cardano", "url": "https://cardano.ideascale.com/a/dtd/417704-48088", "category": 26594, "amount": 100000, "description": "There is a few advertising platform using Blockchain in Globe especially in Indonesia. The main issue\ndigital advertising is only working on the online things (Web and App) and the ROI Tracking.", "f6_no_assessments": 5, "f6_rating": 1.9333333333333336, "videos": [], "media": [], "f6_assessments": [{"id": 10977, "q0": "The problem of this proposal is the limitation of advertising platform using blockchain and the proposer want to solve it with offline advertising. I think this is a very conflicted idea, since we build blockchain technology to be more effective and efficient, but in this proposal, it proposed us to go back to offline advertising.  It is more confusing with the appearance of perak token as a payment of adverstisement and there will be ADA coin reward per click. I am not sure with the proposal purpuse, whether to expand Cardano ecosystem or perak token owned by the developer. No well-though risk displayed and I don't think this is investible before it has a clear vision and purpose.", "q0r": 1, "q1": "The timeline is off, because the fund will be given by September, but the timeline is at Jun-August. I don't see the correlation with building online apps to answer the plan to have offline advertising who is written in the proposed solution. The budget also over and unrealistic. It is not outlined clearly and broken down into identifiable items. It is a very big amount with unclear usage strategy. The proposer hasn't considered challenges and risks relevant to a success implementation.", "q1r": 1, "q2": "There is no accessible public channel for auditing progress. There is no well-though metrics/KPIs. There is no clear understandable description of the targeted problem that can be measured against the proposed outcomes. The most confusing part is the goal to end poverty in all its forms everywhere by 2030 at SDG goals section. It's just all over the place and I don't see a solid proposal and project in here.", "q2r": 1, "assessor": "z_assessor_3213", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11004, "q0": "Based on the problem this proposal identifies and the general solution I am trying to understand that this proposal is intended to combine both offline and online advertising tools using their Perak Token to track and to measure how well an advertising campaign will reach a broader audience. \nAnd by doing this, such activity will add value to Cardano ecosystem and create utility to their token as DAO or governance token.\n\nNevertheless, the proposal does not give any mechanism regarding how this governance token will integrate to bring participation from the community other than just stating that the token will be used to run some particular advertising campaigns. And to make it even more confusing the proposal says that ADA is the currency that will be used to reward the advertising publishers. In this respect, I would like to ask a question: What will be the governance token? Is it ADA or Perak Token?\n\nThe proposal does not convey how this is going to work. If the Perak Token will only be used to track the reach of a particular advertising campaign, then the token should be used simply as a membership token, and is given free to campaigners who pay the publishers to publish their campaign, thus having no market value and can not be traded by all means.\n\nFurthermore, another complicated thought I found in this proposal is that this project will reward ADA to people from pay-per-click or pay-per-view activities. How would this be implemented? Is the reward coming from the team's own pocket or is there another way to generate this amount of ADA that will be given as reward? As far as I know, one of the metrics to measure the success here is the amount of ADA coming from DAOs transaction fees after the solutions on this challenge get implemented (> than the challenge's allocated fund amount).\n\nFrom the very little elaboration given on how the impact of this proposal will bring a solution, I would consider this proposal as not effectively addressing the challenge.\n", "q0r": 2, "q1": "From the perspective of the team's capabilities, I see no evidence of Cardano related portfolios other than a link to a wallet that is holding the Perak Token and personal pages on LinkedIn. This has left me in doubt whether the team has a real profound knowledge on how a DAO really works, especially on the Cardano blockchain. I noticed that the team consists of software engineers but I did not see anyone with experience in building smart contracts, let alone a Plutus Pioneer representation in the team. How this project will be conducted without the implementation of smart contracts should there be any alternative methods also not being articulated.\n\nThe budget outline is not in chronological order and is not set by their priorities. What I am trying to say is that there is no time-frame given which allocation will be the first and the later to be spent in sequence, although I see there is a proposed allocation for office rent, which I would assume is the first fund needed to start the whole operation.  And how is it that only 20% of the proposed budget is allocated for software development? As the main tool that you will create to provide a solution in this challenge, shouldn't it be the main priority in the outline?\n\nNow I move into assessing the plan. I am curious to know how the 'pitching session with local investors' will go. Would you be offering them another proposal to fund your project?\n\nHaving so many questions not being answered in the feasibility analysis of this proposal I must say that this proposal will not be successfully implemented.\n", "q1r": 2, "q2": "The proposal only indicates that to be able to keep track of the work progress, they will be using Trello. And there are so many goals and rating indicators being given without any explanation on how and when those goals and rating indicators are going to be accomplished and delivered publicly. In this respect, I would say that this proposed project is far from being auditable.", "q2r": 2, "assessor": "z_assessor_3214", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13380, "q0": "Advertising on Blockchain is a new idea but quite confusing, usually advertising only runs on platforms such as the Web or on Mobile applications. Blockchain has no interface, I don't know how can I run ads on it?\nCan you explain more about what Perak Token is?\nWhat is SSP and what is DSP in your proposal?\nAnd because blockchain doesn't have an interface yet, your front-end still has to run on a web or app like Android or iOS, so how can your ads not be inserted by ads of that web or app?", "q0r": 4, "q1": "The team's plan for 3 months and the work arranged for each month seems to be detailed, but 3 months to develop applications on the Web, Android and iOS are not sure if it is time, because the block The amount of work for this project is not small.\n If possible, break it down into further phases and assign specific tasks with fixed timelines and ensure a continuous path to project success.\nThe budgets are broken down but are still incomplete and detailed, the community needs more detail for jobs and hours worked.\nTeam members are described briefly, I only see their LinkedIn URL but do not see important information such as work experience, and skills related to job expertise, you need to describe it more clearly. again.", "q1r": 3, "q2": "In the proposal, you say that the success of the project is \"When blockchain funding joins us and all blockchain integration in our platform is released\"\nVery general, you should have a specific KPI such as how many users, and how many ad impressions, ... and publish that on a link for the community to track and verify.", "q2r": 3, "assessor": "z_assessor_3616", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 15123, "q0": "No, unfortunately the proposal does not align with the objectives of the challenge. The idea is to create an advertising platform that takes blockchain technology to applications in the offline world, for example: billboards, newspapers, social media (isn't that online?). We need to get decentralized advertising solutions out of the crypto bubble, this is really an important issue to think about. However, it is not something that relates to a DAO, the proposal, in my view, would fit much better with the challenge of dApps and integrations. I'm not saying that the idea is bad, as it can bring new use cases and help popularize Cardano, but at the same time it is not in harmony with the specific objectives of this challenge itself. It would be necessary to understand the relationship of this initiative with the DAOs of the Cardano ecosystem.", "q0r": 1, "q1": "The roadmap presents activities to be developed in June, July and August 2022. This worries me a little because by the time I evaluate the proposal, we are already on August 2, 2022, so when the funding comes out, what would I have to do? Be done? For these reasons, as much as the script is interesting and adequate at the details, it would still be necessary to understand this issue of temporal organization. The explanation on how the requested funding would be used is also not good, because the total amount requested is high and divided into parts that are also expensive, for example, 20 thousand dollars are requested for software development, but we do not know the value of the work hour from developers; How would the $40,000 requested for marketing be used? The team does not include details about each one, CVs and explanations of how they relate to Cardano, they only provide the linkedin profiles. In other words, there is a lot to be improved here.", "q1r": 2, "q2": "Progress auditability is unfortunately pretty poor in detail, all that being said is that Trello will be used to perform this monitoring. However, we don't know how, what data will be measured, how the activities themselves will be monitored, how the partial results will be perceived, how all this will become public for our community. The same is true of success – all that is said is that it will be considered post launch of the platform and also when partnering with Blockchain Sponsorship. But how could the real impacts of this project be perceived in practice, and, above all, how could we understand that this is beneficial for DAOs? Unfortunately, the level of auditability is quite low.", "q2r": 1, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15353, "q0": "This proposal for token based track-and-trace system for advertisers seems to be of limited impact for Cardano.  The main issue is no real idea about the cohort that is to be onboarded.  This may be a particular market that the proposer serves, or it may be for a particular industry sector, but the description needs more detail to suss this out.  There are references to both online and offline, and the attempts at clarification only help somewhat.  The tokenization of online is less clear, if that is the case, so seeing the architecture spelled out may be the the key to getting a better picture of this.\n\nIf the plan is that this is more of a proof of concept in order the provide a template tokenomics and dApp structure for others to adopt, there is a bit more potential impact inherent in it, however, the descriptions provided really don't mention anything of the sort, with no mention of opensource, or documentation or platform or SaaS.\n\nI'm afraid that while the broad idea looks like it has potential, the descriptions provided and the plan mapped out don't do the potential any justice.  I can't agree that this project has impact for the Cardano ecosystem.  2 stars.", "q0r": 2, "q1": "The main thing missing here is a good description of the kind of architecture they see as being able to address track-and-trace for advertising via tokenization.  The way the budget is lined up against the project, the amounts seem a bit out of whack, accruing outside of development, where such a token engineering project really lives.  I believe this is likely because the proposing team still needs to do more research on the tech side of this solution, which is fair, and not a reason not to fund, however, if research is a primary deliverable, it really needs to be added to the  timeline and milestones.  \n\nAs it is, the timeline is only 3 months, which seems wholly unrealistic given that there is still much research and planning to accomplish.  Digging more into the budget, we find that it really lacks granularity.  5 total budget items, with no hours or rates provided makes it very difficult to parse a 100k budget, and importantly, it makes it very difficult to line up with the timeline and milestones.  Being as the milestones are only presented as broad concepts in the timeline (\"Maintain Current Platform to supports BAU\"), this kind of misalignment only further increases the confusion.\n\nThough the team has provided some basic profile information, what is really missing here is a description of a process that is actionable and implementable, or a plan (and enough time) to get educated on exactly what is needed to properly execute this idea.  Because of this and because what has presented is not internally well aligned, I cannot agree that this proposal can feasibly be completed.  2 stars.", "q1r": 2, "q2": "They unfortunately didn't get around to updating this portion of their proposal.  They indicated they would be adding a link to their Trello that they use for project management, but it has yet to be provided as of the writing of this assessment (8/4).\n\nSometimes it is possible to extract metrics from milestones on the timeline, but as mentioned above, these milestones have been phrased in an abstract way, and it is unclear how to frame them properly.  The included success metric seems fair, if repetitive, suggesting that a blockchain integration to their business is the objective.  However the implication is that this would be impactful, and no guidance is provided as to how that will prove out in the end.  Given the structure of the proposal, I don't feel comfortable making any suggestions for KPIs either, as they may be unsuitable, due to a misunderstanding.\n\nBecause the deliverables certainly are measurable, but because there is no guidance from the team on progress or success, I do not agree that this is a project that will be able to stay on track, and achieve its outcomes.  2 stars for auditability.", "q2r": 2, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We are working on the Advertising Platform to connect with Offline Advertising such as Billboard, Newspaper, Social Media, etc. Solving ROI Tracking issues, we want to add ADA Network for traceability", "experience": "I'm Software Engineers with 12 Experiences with multi platform (Web and App), this is not designated I claimed, But It's more a way of life to myself and proud to be Software Engineers.\nIn my experience, I gained Product Management knowledge with more than 5 years experiences."}