{"id": 419242, "author": "natdwamena", "title": "Ubuntu Crypto Use Map DAO", "url": "https://cardano.ideascale.com/a/dtd/419242-48088", "category": 26594, "amount": 64500, "description": "Africa is a target for most innovative businesses that are integrating crypto use. How do we easily locate businesses adopting crypto use in Africa?", "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 8100, "q0": "The proposer has identified the problem of difficulty in locating businesses adopting crypto use in Africa and his solution to this problem is to develop a crypto use map DAO on the Cardano blockchain to organize and easily locate credible business locations with integrated crypto use.\n The proposer has indicated that, this proposal would add value to the Cardano blockchain by onboarding businesses onto the cardano ecosystem and adopting the use of the ADA coin in their businesses.\nThe key metrics and goals outlined in this proposal are in line with the challenge settings.\nThis proposal will go in a long way to move individual businesses from completely/partial cash system to cashless system which is going to reduce the rate of theft in our communities.", "q0r": 5, "q1": "The proposer has provided the reader with a detailed timeline, budget breakdown, key milestones and details of team members to work on the project with their relevant profile links.\nThe 3 months timeline the team intend to deliver the project is ideal for them to complete the project and the amount they are requesting for would be enough to complete the project successfully.\nThe team members on this project have the relevant skills (developers, marketers, designers, Geospatial experts, web designers, etc) to complete this project successfully.  \nThe budget allocations are ideal to complete their respective items on the budget.\nThe proposer has also provided readers with key milestone to determine the success of the project.", "q1r": 5, "q2": "The proposer has provided the community sufficient information that would be used to audit the progress and success of the project.\nThe project team is committed to provide the catalyst community with integrated progress reports which would be published monthly on the website and also document DApp development in Github.\nThey are also committed to provide funding updates, impact and progress report on Discord.\nThe proposer has provided the relevant links to their various platforms in the proposal.\nThe proposer has also provided the community with roadmap, milestones and KPIs to track the progress of the project. ", "q2r": 5, "assessor": "z_assessor_2954", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12255, "q0": "I agree that this proposal addresses the needs outlined in this challenge by adding yet a new tool that is likely to give cardano a distinct advantage over other ecosystems.********************************************\nThe solution provided which is to build a crypto use map DAO for the cation of informal businesses,  I think also aligns itself with the objective of this challenge as it has been set up to begin from small businesses and gradually diffusing into global communities.*******************************************\nIn as much detailed plans i think were not outlined enough to address future challenges, I am of the view that, the benefit of this tool with its distinct features such as this crpto use map DAO will in the short and medium term have a greater potential to impact the Cardano ecosystem ,given the well provided detailed plan also for its sustainability.", "q0r": 4, "q1": "I  agree that the implementation of this proposal will be successfully executed. Considering the skills and provided by the team especially the mapping coordinator. Per his experience I have no doubts he will be up to the task to tackle any difficulty that may arise from then use of the tool in the near future.*****************************************************\nIn as much as i have some little doubts on how the mapping could easily be done and education of informal businesses since in Ghana most of informal businesses are in markets squares and parks which is a bit overcrowded. I am pretty sure per your in-depth research you will focus on businesses that are easily located and have permanency of locations at least for the time being.****************************************************\nAlso the  timelines provided for the successful implementation  for this project is within reasonable range only that time taken for education of informal business should be adjusted up a bit in order to concentrate on the need for the adoption of Ada by these businesses if not other cryptos will take advantage which will defeat the objective of this challenge..*************************************************\nWith the larger focus of this proposal  on sole proprietorship businesses ,  think the team is up to the task to help them easily make decisions on the adoption of this crypto use Map DAO on the cardano", "q1r": 4, "q2": "I strongly agree that, the information provided is very sufficient to successfully evaluate the outcomes. With a clear description of the problem and suggested solution in mind, the KPIs provided in this proposal such as the number of locations mapped and other ecosystems using the app makes evaluation of the progress quite easy.*****************************************************\nAlso the monthly updates progress reports for the 3months time interval for implementation serves the community with a time bound basis for measuring the progress against the intended objectives.*******************************************\nPer the clarity of the activities outlined in this proposal, the benefits to the Cardano blockchain is evident for me to see, including direct ways also provided for successful audit of this project", "q2r": 5, "assessor": "z_assessor_3371", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12486, "q0": "This proposal tries to create a map DAO as a tool to organize, locate and map functioning existing and new businesses that have integrated with crypto. The ideas and the background problem are presented in detail, where crypto users can locate and identify where and what businesses accept crypto as payments. The proposal explains the main potential risk which is the fear of crypto use by businesses in the informal sector. However, the proposers provide a reasonable mitigation plan by using education and demonstration about the benefit of using crypto for businesses.", "q0r": 5, "q1": "This proposal has clear milestones grouped into 4 timelines consisting of phase A to phase D with a total time of 12 weeks. The proposal provided a breakdown budget divided into 8 parts such as App Development will cost $20000. However, the breakdown budget is not detailed enough and it can be better to provide more detailed budget information on each part such as cost per hour for the engineer or cost per item for hardware in the App Development part. The proposal provides detailed information about each of the team members consisting of background, experience, and relevant skills, and also attached LinkedIn link so its easily to verify their profile and credibility.", "q1r": 4, "q2": "The proposal is easy to track with the project report published monthly on the project website, the app development also can be tracked easily through their Github repository. This proposal uses 5 KPIs which are clear, measurable, and reasonable one of them is the number of downloads. However, it will be better if they also mentioned the detailed number of each KPI to indicate the success of the proposal such as the number of downloads more than 200K, etc.", "q2r": 5, "assessor": "z_assessor_3422", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12910, "q0": "Through the use of an open source application that would promote the usage of ADA for informal commercial transactions, the idea aims to enhance the value of the Cardano ecosystem. By offering an application that would set up a decentralized autonomous organization that would benefit the informal sector by increasing financial inclusion, simple access to clients, and effectively to map out business using crypto for ease of access, the idea appropriately addresses the difficulty. Since company owners employing cryptocurrencies would be exposed to a whole new audience as a result of this, the economy of Ghana and Africa as a whole would grow, which would have a significant positive impact on the informal sector.", "q0r": 4, "q1": "The proposal includes a thorough plan and timeline for the accomplishment of different project milestones, with an estimated completion time of around three months. A thorough budget was created, and it was projected to cost about $64,500. The team members working on this project have the necessary expertise and experience to complete it successfully, increasing the likelihood that tasks like software development, GIS, surveying, and NGO management will be successful.", "q1r": 4, "q2": "Through regular progress reports and comprehensive github documentation of the app development process, the proposal illustrates how community members can audit the project. The project's milestones and roadmaps were laid out; among them is the deployment and completion of the application, which has no specific delivery date. The number of new Yoroi users, the number of application downloads, and other factors can be used to gauge the proposal's success. The plan considers the project's risks, such as public concern about the adopting of cryptocurrencies.", "q2r": 5, "assessor": "z_assessor_3507", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13388, "q0": "The project has good and creative thinking, very good for Cardano to expand the market in Africa, DAO mapping will help businesses that are using cryptocurrencies to have more connections with each other, and create a link Strong connections in the Cardano DAO community.\nAnd as more SMEs use ADA to pay and exchange value, ADA will become more popular, and the amount of ADA coming from transaction fees of DAOs will increase after solutions to this challenge. successfully deployed\nAnd since then, the number of ADA wallets has also increased over time.\nIf the project is successful, will you expand to other continents, Asia for example?", "q0r": 5, "q1": "The roadmap for the implementation of the plan is divided into 4 phases over a period of 3 months by the group, and the processes in each phase are clearly described.\nThe budget for the proposal is also properly allocated by the team for each specific job.\nTeam members are also described in detail in their profiles, there is a link on LinkedIn for community reference, members are people with good expertise, experience, and passion for their cause. me. Their skills have a lot to do with the work they do on the project, so there's a good chance this project will be successful.", "q1r": 5, "q2": "The team has provided clear community-verifiable progress tracking metrics via the website such as: the number of business locations mapped, number of communities using the app, number of downloads, number of contributors, and number of business lines.\nThose KPIs are good but it is better that we have a specific target number for each KPI, such as success will be 10 businesses after 1 month of launching the project, the number of downloads will be 20, and the number of business lines is 7...etc.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Develop crypto use map DAO on Cardano blockchain that would organize, locate and map credible business locations with integrated crypto use/adoption.", "experience": "We are a team with 15 years of experience in GIS, surveying, software development (React.JS, Plutus, Haskell inclusive), and non-profit management."}