{"id": 419483, "author": "pace", "title": "Funding Categories Analysis", "url": "https://cardano.ideascale.com/a/dtd/419483-48088", "category": 26594, "amount": 42150, "description": "The challenge setting process needed thorough analysis to make suggestions on how to improve funding categorisation within Catalyst", "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3794, "q0": "DAO is predicted to be the next big thing in crypto space and blockchain industry. After the booming phase of DeFi and NFT in the previous bull market, DAO will be the next ultimate driver to the broader adoption by general global population and higher-level implementations and utilizations. Proposer PACE and team had done a very extensive work since Fund 8 in researching and developing a novel and optimal governance model for Catalyst that will be beneficial to the general betterment and advancement of Catalyst as Cardano’s largest and most important DAO.\n\nThe study done by PACE has developed a lot and becomes much more refined since the last submission on Fund 8. The analysis done in this comprehensive study is so compelling that I spent a good amount of time yesterday trying to catch up, read, and understand the whole documentation so I can gain deep insights and create an impartial and deep assessment towards this proposal and the essential core idea inside it. I somehow agree that the repetitive works of doing challenge setting could be a less effective and efficient way of allocating and spending community’s collective resources. I think these resources could be well optimized and allocated to create proposals with direct implementations of idea creating means to an end.\n\nAnother interesting and impactful point I want to emphasize is this framework model allows attaining the adaptability and scalability with budget or fund allocation on every fund with the democratic weighting vote process. This necessity to develop such voting system will push and lead accelerated innovation in the discovery and development of necessary infrastructures and tools to support the essential and vital processes in Catalyst and Cardano governance.", "q0r": 5, "q1": "The proposer had detailed himself and the team with clear evidence and relevant capabilities. Budget is outlined into identifiable items clearly and is easy to understand. Rate is soundly reasonable considering the quality and scope of the work delivered. Future refinement and improvement have also been mentioned and the end goal is to progressively apply the funding categories effectively so they can be tried and maybe in the end be implemented as a whole. As for the future funding, proposer stated that the Catalyst Contributor model could be the best way to compensate the stewards to support, maintain, and improve the analysis and implementation of the Funding Categories idea. The execution method is detailed and elaborated inside the Gitbook documentation.\n\nNow for the most crucial and important fact that I would like the voters to know is the works in this proposal has actually been completed and delivered to us. Pace team worked in advance, and we might (not) pay them later. The proposal is totally ahead of its schedule and proposers had voluntarily spent their resource to lay the groundwork. Therefore, no risk is associated directly with proposal and the study is never finalised or closed since proposer stated that approach or outcome deemed negative by or to community will be revised and adapted to iterate and accommodate the future Catalyst and following series of funding. Moreover, the Nurturing Ideas & Teams category is the receipt that feedback was well-received, processed, and implemented in effort to improve the diversity and inclusion of ideas and teams in Catalyst. It is also a testament that proposers are aware of downsides towards this proposal and idea and willing to put the effort to mitigate those downsides and improve upon them. The study has addressed about the concerns regarding the theory and framework model with some proposed solutions. Proposers even served FAQs section for anyone to get the gist of the study and have sufficient understanding about Funding Categories.", "q1r": 5, "q2": "Since this is completed work, I think we got no concern whatsoever in the auditability. Anyone wants to audit it can directly go to the full documentation anytime, maybe even learn a new thing or two from reading it like I did. The proposer also mentioned that the other key benefit of this completed work is it is open-source and free for all other DAOs to utilize and benefit from. Open-sourcing is always a win in the auditability aspect. I have stated it once and I got no problem stating it again that this high-impact, high-value idea with great multiplier effect is why Cardano built different from other blockchains out there. The serious devotion that proposer has shown to his work and community can not go unrewarded. We need to set a precedent for the members of community to ingrain build-first, worry-later mentality and I trust this is one of the best chances we got to execute it.", "q2r": 5, "assessor": "z_assessor_2482", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11106, "q0": "This proposal is suitable for the challenge, the problem that the proposal proposes is that the classification of challenges and grants in Catalyst is complicated, inefficient, and time-consuming for voters, proponents, and evaluators.\nThe solution given is to create a tool to analyze the challenge setting, then classify the desired attributes to free up the community's capacity and resources, help the ecosystem improve and accelerate. degree\nThe proposal also anticipates risks such as low barriers to entry for bad actors that harm the process, limited knowledge of the challenging ecosystem about the ecosystem, overlapping classifications, risks that have all been identified. foreseen and have solutions so that there is no risk when the project comes into reality... in addition, I added about ADA's price slippage during the project implementation, I see that the proposed team anticipated it. get the minimum threshold for this slippage\nThe product is more tools to add to the classification of grants, to make the Catalyst funding process simpler, more efficient and scalable, but still ensure the open source code.\nThe end users of this tool are proposer, assessor, voter, category teams", "q0r": 5, "q1": "The group has 2 members, George and Jakob, who are professional web developers, with over 5 years of experience, in addition, they also have partners Lidonation and Gimbalabs, groups that are active in catalyst, are cooperating The implementation partner of the proposal was funded by Atala PRISM, so I appreciate the ability of the PACE team to complete this project, they had a professional proposal\nthis is a continuation and expansion project that the team has proposed in fund 7, fund8. The total budget required for 6 months is 42,150$ including PACE labor hours and community contributions, I have not seen how to do post-disbursement audits for the community to proactively assess transparency easily. in disbursement and progress of work completion", "q1r": 5, "q2": "With a success report, this project promises to be transparent when it comes to providing open source measurement. this will allow the community to understand the details of how the project works, as well as the progress of the project, the measurement is also very detailed. I appreciate the success of this proposal", "q2r": 5, "assessor": "z_assessor_3217", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "The auditability section lacks depth to the rationale however the proposal is already completed and auditable so only a completion (success) report is needed"}, {"id": 15118, "q0": "The proposal suggests a new approach to implementing Catalyst funding categories. It is stated how Catalyst itself is Cardano's biggest DAO, which in a way is reality; that is, creating new tools that contributed to the progress of our community based on a more accurate categorization of what the challenges of future funds will be, is, then, contributing to the growth and further establishment of this DAO that is the center of our ecosystem ( at least from the tenderers). With that, I believe that yes, the proposal fits very well with what the challenge seeks. The idea is quite complex, but the proponent has a series of documentation that demonstrates how the idea came about – what steps have been taken so far. In my view, this initiative can contribute to a better establishment of activities in our community, having a very relevant impact.", "q0r": 5, "q1": "We don't have a roadmap, in fact the proponent claims that the deliverables are already available, and provides a series of github pages where we can observe the work done. It also has documentation that proves the activities carried out. The total budget of around $42,000 is very well explained. We know that the hour of work cost about 45 dollars, in relation to the research. An extra $3,000 is required to pay community members who have contributed throughout the process. Regarding the team, we have two participants who are featured on Notion; there are also partnerships with famous groups at Cardano, LidoNation and Gimbalabs. I believe they are very strong teams. Honestly, the case of this proposal is an exception, because the work has already been done, so it is up to us to decide if it deserves to be paid according to the amount requested. But in terms of security about the directors' competence, everything is very well placed.", "q1r": 5, "q2": "Progress does not need to be monitored as the proposal is ready and open for public consultation. What should be analyzed, then, are the results of this initiative, that is, “use of categorizations to verify their impact and suggest any changes that may be necessary”. I would like this to be better studied, researched and demonstrated to members of the Cardano community. The idea interests everyone, so in my view the refinement and feedback that resulted in the evolution of the categories should be addressed and presented directly to our community members. In general, the proposal is auditable, but the project's creator duo could put more emphasis on the demonstrations to be made to the community.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15152, "q0": "This proposal has a different concept than the vast majority of Catalyst proposals, it is asking for funds for work that have already been completed. There have already been cases of proposals that requested funding to cover expenses for projects carried out and there is no guideline that differentiates this concept in the Proposal Assessor Guide, but I think it is important to inform voters that the content of this proposal have already been delivered and this can be seen as a good thing or bad.\n\nGood, because the team has already shown commitment, delivered what it proposed and the results are positive and relevant. Voting for the proposal would reward PACE's volunteer work and dedication.\n\nBad, because this work was already carried out voluntarily by the team, so it wouldn't need funding to deliver.\n\nI will leave it to the voter to decide how to see this situation, but I will not consider this aspect to define the score of this proposal.\n\nThe problem presented is extremely relevant for Catalyst, which is the biggest \"DAO\" existing on Cardano. I made a point of leaving the DAo definition in quotes as IOG and a part of the Cardano community know that the DAO definition stands for decentralized autonomous organization and Catalyst still isn't decentralized enough, but that can be said of almost all DAOs out there today.\n\nThe proposal explains in a very detailed and clear way the problems observed with the Challenge Settings model, such as overlapping challenges with similar themes, excess complexity and costs involved in the Challenge Setting and the absence of funding for various niches in the community.\n\nThe proposed solution has great potential of impact for Cardano and for this challenge and this is evident from the fact that the proposal has already been developed and delivered. Some of the results that signal extremely positive impact were the approval and funding of the Fund9 \"Dapps, Products and Integrations\" challenge, as well as research, analysis, documentation and engagement of various community members to participate in the governance of Catalyst.\n\nThis proposal can be updated for future challenges, in fact the intention is for the Funding Categories to replace the current Challenge Setting, so the idea is exactly for continuity. There is a structured and very well documented project indicating the financial sustainability of this proposal in the future through the Catalyst Contributors category or the Funding Categories(Full Fund), which are currently two Challenge Settings submitted to Fund9.", "q0r": 5, "q1": "As the proposal has already been delivered, it doesn't make much sense to evaluate the team's capacity, but PACE has already created different solutions in the Catalyst ecosystem and all the work done and published on Github and in different social media demonstrates the team's capacity.\n\nRegarding the budget, PACE used the Catalyst Contributor rationale to define the hourly rate of work and this was established by research that took into account the average remuneration of analysts based on OECD data. $45USD/hour is an adequate amount for the activities and roles performed.\n\nAlthough the definition of an hourly rate was adequate, it was not so clear how the volume of work performed was fixed at 870 hours. I understand that the rationale is to use 29 weeks and 30 hours on average per week, but how can we check if this average of 30 hours per week is consistent or not?\n\nI could see that activities in the repositories started about 2 months ago and the team reports that they started activities before that, so I believe that a more detailed explanation of this calculation would be appropriate.\n\nA plan/timeline evaluation is not suitable as this proposal has already been delivered, so I will disregard these aspects in this evaluation.", "q1r": 4, "q2": "As this proposal has already been delivered, it makes no sense to evaluate roadmap and milestones.\n\nWork conducted by PACE has been published on Github, the PACE Gitbook and we also have access to various conversations, voting stages and content on YouTube.\n\nSeveral categories chosen and voted on by the community will be voted on in the Fund9 Challenge Setting, so soon we will have more data to evaluate the performance of this proposal and compare with the established definition of success.\n\nThe results of the analysis work carried out can already be evaluated by metrics as more than 300 proposals submitted in the Fund9 challenge \"Dapps, Products and Integrations\".", "q2r": 5, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15303, "q0": "As far as I recall, since fund 5 and until the current fund, the community has chosen which challenges would be available for the next fund. To choose them, the same criteria used for any proposal is used, any user can propose a challenge, which is evaluated by PA/vPA and the community then votes and those who accumulate more voting power are the chosen ones. This has brought many quick wins and diversity in the types of challenges, but also brought several elements that do not favor the community as a whole. PACE, understanding the PROs and CONs decided to make an analysis of the challenge setting process to make proposals on how to improve it. As a result of this work already done, from fund 8 PACE proposes to the community a new approach for governance, seeking to establish \"challenge categories\" (to go deeper into this aspect, please go to this proposal (https://cardano.ideascale.com/c/idea/414562), with this PACE expects the challenge setting process to be simple, efficient, flexible, scalable and egalitarian. Given that Project Catalyst is currently the most important DAO in Cardano, and that this proposal attempts to find an alternative to pivoting to a new governance model, it certainly meets what the challenge seeks.\n\n", "q0r": 5, "q1": "Despite this proposal already being delivered, all its deliverables have been scrutinized by the community since Fund 8, and by this I mean both the GitHub and Gitbook pages, where everything necessary is explained in a comprehensive manner to understand the justifications underlying the final results. So one could argue that, making an assessment of implementation feasibility may seem redundant. However, PACE does an excellent job of explaining all the logic to be used to determine the budget to be requested in this proposal. George Lovegrove, who leads the pass team, has been making major contributions to Cardano, and his proposals have been selected for funding multiple times. The team maintains a site on notion, where you can see everything related to the progress of all proposals.", "q1r": 5, "q2": "As the team pointed out, the results of this research are not exclusive to Catalyst, and could be used to develop Treasury management strategies for multiple DAOs dentro y fuerna del ecosistema de Cardano. All this information is available on the sites provided, and is currently being tested, so auditability is not an issue here. It will be interesting to analyze the community's feedback if this approach is selected for the next fund. \n", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Analysis on the challenge setting process, comparisons of categorisation approaches and desirable categorisation properties. This led to the suggestion of funding categories as an effective solution", "experience": "6 years of web/mobile development experience, funded for Catalyst focussed proposals in funds 5/6/7, proposal assessors for multiple rounds and very active in Catalyst groups, discussion and any collaboration efforts"}