{"id": 420084, "author": "b4ggreg", "title": "Catalyst GPS and Blockchain4Good", "url": "https://cardano.ideascale.com/a/dtd/420084-48088", "category": 26594, "amount": 39000, "description": "Blockchain4Good is a growing collective of projects with their own engaged and motivated communities. We need support in effective collaboration management to organize community intentions and actions", "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"id": 549, "q0": "This is a good proposal that could have a huge impact on the Cardano space, however; it does not align well with the challenge brief of \"What tools can we provide to enable effective DAO's Creation & Operation\" As the funds would be used for compensating members to conduct meetings, and it's not clear if any additional tools would be created that will be shared with other DAO's. However, Catalyst GPS is a promising tool/framework already created by the catalyst community, and it is well suited for this proposal to offer a solution to Blockchain4Good. Funding this initiative will also help to refine, test, and develop this framework with Blockchain4good as a great case study. The member organizations of blockchain4good each have a large reach and will help to bring exposure to Cardano by working together to multiply their collective impact. I would also suggest the team focus on delivering specific tools that the wider community can access and use, so as to align this project with the challenge goals. ", "q0r": 4, "q1": "The proposing team has included their LinkedIn profiles with relevant work experience. They have successfully delivered results with their work on Catalyst in the past, and are capable of delivering on this proposal. The team will also consist of 2 unnamed members from WMT, Empowa, Immunity Life, Waya Collective, Cardashift, EthicHub, and Cardano Foundation. This will create a powerful team of Cardano community members with wide ranging skills and abilities and proven track records. The budget is clearly broken down into specific milestones, and is a reasonable amount for this proposal. The plan includes the necessary resources and detailed roadmap with a reasonable timeline. The risks are explained with mitigation strategies for each identified risk. ", "q1r": 5, "q2": "The team will be tracking the completion of each phase in the roadmap, and the number of people participating and estimating their time contributed. However many of the other auditability criteria presented in the proposal are not easy to quantify and are subjective. I suggest the team provide some more specific quantifiable metrics if possible, although the nature of this proposal makes that difficult. ", "q2r": 4, "assessor": "z_assessor_2108", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 1474, "q0": "Assessment of this proposal requires more intellectual bandwidth than most. Governing structures, notably DAOs are theoretically complex organizations that require a great deal of thought, collaboration, communication and constant feedback. On the surface, the proposal is very interesting and clearly aligns with the challenge setting. Upon closer inspection, the incredible work done by their member organizations shows great promise within the framework of a decentralized decision making body. From supporting sustainable agriculture to financing and building green homes in Africa, and including the visionary World Mobile, the Cardano Foundation, and others, the ability of a DAO housing these members could be limitless. Creating the perfect conceptual structure to enhance these already highly impactful programs is a venture well worth investing in.", "q0r": 5, "q1": "The core team behind this proposal have a combined skill set that is optimum for success. Between Tomi, Nadia and Ondrej, you have a wealth of experience in Catalyst, business admin, economics, agile development, project management and development and much more. In addition to the participating organizations mentioned prior, Cardashift, Immunify Life, Waya Collective are some of the other programs invested in this project. From the perspective of deliverables, each one these entities has contributed significantly in that regard. In fact, Waya Collective is already functioning as a DAO, lending further credence to the high feasibility of success.", "q1r": 5, "q2": "A very detailed budget creates dozens of points on a timeline that are quite useful as KPIs. Further indicated metrics include decentralization goals, creation of a foundation and best case practices. Perhaps the most ambitious measurable indicator of success is the goal of soliciting input and feedback from 500 individuals. Collaborative and decision based metrics are a bit more intangible, but for a project of this nature, could prove to be highly relevant. The budget and the other KPIs form a matrix of auditability from which progress will be thoroughly investigated and easily verified.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2095, "q0": "\"Blockchain4Good is a collection of for-profit businesses that are using blockchain technology to combat some of the most pressing social, financial, and environmental challenges. Projects are signed with a collective belief that doing good is good. could be good business Each project is focused on optimizing profit, people, and the planet However what is needed is support in effective collaboration management to organize intents and community action, so the solution to this problem is Catalyst GPS (fund8-funded project8) — Global Engagement Solution — as a way to improve understanding, communication, coordination, and collaboration Catalyst GPS partnership strategies for Blockchain4good include:\n-Clarifying your identity: Purpose, Dreams, and Values.\n-Setting strategic themes: 3-5 selected strategic focus areas that, when combined, we will realize the Dream.\n-Understanding and being able to rephrase Functional Perspectives helps structure and harmonize our work at different levels.\n-Introducing the Goal setting process: measurable, time-bound, and achievable results found at the crossroads of topics and perspectives.\n-Example brainstorming Initiatives that can help achieve goals.\nOutline the roles and responsibilities needed to execute the strategy.\n-Guide and Template to engage leaders in the community.\nThis proposal is right, and it addresses the goal of the challenge of \"An effective collaboration management platform to organize community intentions and actions.\"", "q0r": 5, "q1": "I have full confidence that with the experience and planning presented here, this proposal will likely be successfully implemented. Regarding the roadmap, the plan of this proposal is clear and detailed. We're given timelines tied to the tasks that need to be done during that time, so we have a solid view of the plan. The budget is also very well explained, and all associated costs are listed, so the $39,000 requested amount is perfectly reasonable. And finally, about the project team, the proposal included short documents detailing who they were, where they were founded, past work, and even personal links such as LinkedIn, This gives us a solid idea of ​​who we are dealing with.", "q1r": 5, "q2": "The proponent states that \"The completion of each stage is easy to track. Participation from different member communities will also be estimated. The goal is to get feedback and input from at least 500 people.\" I agree that this proposal might be easy to follow based on the plan it proposes, but how does it add up? Can you track this project? What will be the foundation to bridge the gap between the project and the community? Are updates posted on any websites? Any social networks? I think if these improvements were made, this project could easily be tracked\nAnd finally, in terms of success, the team identified 5 successes. Each success is described very clearly as stated in the proposal.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2463, "q0": "Only by working together we can achieve big things. \nFrameworks are a useful tool to make the complex task of bringing many people together easier. \nSince one of the goal of this challenge is to provide DAOs with tools for collaboration this proposal fits the challenge perfectly and will bring a huge advantage to DAOs on Cardano if the team should succeed. ", "q0r": 5, "q1": "The team already in the middle of the project which means they know their situation and what they are in for. \nThe experience required to undertake a task like this is not small but the team seems capable of doing so. \nBudget breakdown and timeline seem realistic with some room for error planed in. \n\nAll in all it seems highly likely that the team will succeed in implementing the solution. ", "q1r": 5, "q2": "The team provides detailed information which is more than enough to audit the whole process. Furthermore they plan to get feedback by a group of people for every milestone. Since the team is engaged with the catalyst community the community is easily able to audit the whole process. \n\nThe KPIs provided by the team are a good indicator for success.", "q2r": 5, "assessor": "z_assessor_2307", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2908, "q0": "The proposal include a framework for collaboration between blockchain compnies, while the challenge is asked for tooling and services for DAOs. This framework, if it will implement successfully, may provide value to DAOs as well, but the proposers did not mentioned DAOs as potential benefiters. ", "q0r": 3, "q1": "The two groups that will be responsible for delivering this proposal seems to be well established and have the persons with the needed skill set, specifically community management, organize collaboration and strategy. The plan details are clear and feasible, and suggest comprehensive strategy process. ", "q1r": 5, "q2": "The plan include monthly deliverables that can be tracked and audit using the monthly report for funded proposals. The budget sections are detailed and contains the plan items, but it was not specified how those items costs were calculated. An hourly fee and work time estimation, for example, or outsource services costs, or even monthly payments for the different roles that are needed for this project could have answer it.   ", "q2r": 4, "assessor": "z_assessor_2360", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 7368, "q0": "The proponent needs assistance in managing the effective collaboration to organize the intentions and actions of the community. The author has launched Catalyst GPS — Global Engagement Solution: as a way to improve understanding, communication, coordination, and collaboration. Proposals impact the challenge and are detailed and richly described. Blockchain4Good is a growing collection of projects with engaged and motivating communities of the team. This is a collaborative strategic framework led by the Catalyst community. The proposal aims to work towards an \"Effective collaborative management platform for organizing community intentions and actions\", contributing to the United Nations Social Development Goals, against a number of social challenges, social, financial and environmental urgency. Proposal is consistent with the objective of the challenge. Besides, the author recognized the challenges in the project. At the same time, this risk will be significantly reduced thanks to the goal that all B4G members have set, and using the skills, experience, and time to execute the project well, minimizing the risk of may happen.", "q0r": 5, "q1": "The proposed team outlined a very clear and detailed plan. Milestones are established over the months for each operational event. The proposal team provides us with information about the work to be done each month. This is the first step we need to understand how the development of this project will happen. In my opinion, the team provided us with a detailed, specific schedule to see how it works. Next is the budget. The proposal requires a $39,000 budget. In my opinion, the required budget is reasonable for the work and time of the project. The author has provided a detailed budget table. Funds are broken down, and allocated to each work in the project in a clear and coherent way. Finally, the team members. According to the information the author has provided, we know that the core members who will work on the project are members of the Catalyst GPS team. Blockchain4Good will appoint two people from each member project. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides presentation documents about each member, and attaches links for us to know more about the history and experiences of the members that the proposal has presented. Overall, the proposal's plan is very good, the budget is transparent and the members are skilled. Proposal is highly feasible.", "q1r": 5, "q2": "The author provides indicators, to measure progress and evaluate. Here the author says: The completion of each stage is easy to follow. Participation from different member communities is also estimated. The goal is to get feedback and input from at least 500 people. It's testable in my opinion, but not ideal. I say this because we have little information and tools to test continuously and openly. However, the detailed roadmap, the members have enough skills and experience, will perform well the work according to the schedule, to complete each stage. Transparent budgets can be easily audited. And finally the success of the project, which is expected of this project. We know the goals that need to be achieved, the values ​​that will bring to the community and the Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_2888", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9046, "q0": "The goal of this proposal is to create a sort of DAO of DAOs. Blockchain4Good is a collaboration of several  for-profit organizations with the goal of creating positive social, economic, and environmental impact. This process will be based upon the GPS process that was funded by Catalyst and fund 8. This is a process tool for helping DAOs to work together to determine a collective goal and a process for accomplishing that. Replicating this process in Blockchain4Good would create a positive impact in meeting the goals of this challenge. The proposal could have been more specific in terms of how it plans to meet the challenge goals as it does  not seem to be creating or developing a tool for DAOs, but utilizing an existing tool. This will have an impact, but I feel like the overall impact of this specific proposal is less than others in this fund. However I can see that this team’s success will have a positive impact on the overall cardano ecosystem.", "q0r": 4, "q1": "I believe that this proposal is fully feasible. The team is well qualified and experienced in developing this GPS model of DAO governance. Implementing this in Blockchain4Good  will be feasible as there are many of the same players and team members working in both projects. The milestone and timeline are detailed, and filled with achievable below goals. The timeframe of this  proposal will enable the team to be successful in achieving their goal.  The budget is also detailed and sufficient to accomplish the tasks for the team to be successful. There are no questions regarding feasibility or capability of the team. They should be a successful project that brings  the various organizations of Cardano4Good  into alignment for them to be able to achieve more together than they could by themselves.", "q1r": 5, "q2": "The metrics that this project will be measured by are completing the tasks in the timeline. Due to the detailed nature of the timeline,  these metrics will be auditable and transparent. The team are already committed partners in the Catalyst ecosystem. This means they are aware of reporting requirements and will follow through and make sure the community is up-to-date on the progress of this project. There could have been additional detail regarding how they plan to measure Community engagement, but they did mention their goal is to get feedback from 500 people. These goals will enable this project to be auditable. There is Clarity across the proposal in terms of the goals and the method for carrying those out. A little extra detail would have been beneficial in this last portion of the proposal.", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Catalyst GPS—Global Participation Solution—is a way to improve comprehension, communication, coordination and collaboration. It brings everyone on the same page and shows how our efforts are aligned.", "experience": "Blockchain4Good is a collective of for-profit businesses that are using blockchain technology to combat some of the most pressing social, financial and environmental challenges. Catalyst GPS—a collaborative strategy framework led by Catalyst community—was spearheaded in Fund8."}