{"id": 420132, "author": "bobkvan", "title": "NFT Fractionalization System", "url": "https://cardano.ideascale.com/a/dtd/420132-48088", "category": 26594, "amount": 30000, "description": "Being able to directly own DAO treasury NFT assets requires a system that enables members to participate in a fair and representative distribution mechanism that currently doesn't exist.", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 2910, "q0": "The proposal aim to design and build a framework for fractionalized NFTs. A tool like this can be used by DAOs for many purposed, including managing diverse treasury assets, representing real world assets on the blockchain and experiment novel finance models. \n\nAs a system, the fractionalized NFTs proposed here can contribute for onboarding new communities to build DAOs on Cardano, and can bring value for exiting DAOs.", "q0r": 5, "q1": "The team of ADAO have been proven to be capable of creating and managing big and very committed community, and building useful tools for DAOs on Cardano, such as the multisig ADA wallet \"roundtable\", the \"Agora\" system with collaboration with Liqwid Finance team and more. \n\nThe NFT Fractionalization System described in the proposal is very detailed and show that a lot of thinking is already put on this project. However the plan for implementation is very general. In the plan section the proposers focused on the team capability (which is great) and not enough on actual work plan beside mentioning three milestones - research, smart contract development and testing/auditing. \n\nA more detailed plan would have bring more assurance of this proposal chances to  succeed. ", "q1r": 4, "q2": "The proposal provide a measurable success metrics based on use of the tool proposed, that are aligned with the challenge KPIs.\n\nThe proposers did not provide a progress tracking as needed. however, based on my acquaintance with ADAO community and team which I follow on twitter and other channels, I have witnessed their culture of transparency and community engagement, and I'm rest assure that this will be apply on this project, if it will get funded, as well.  ", "q2r": 5, "assessor": "z_assessor_2360", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 5062, "q0": "The proposal addresses one narrow part of the challenge with one specialty tool. The proposal clearly shows the use case for this tool which would allow users to fractionalize NFT assets.\n\nThis may be more of a tool for investments and could possibly be applied to fractionalizing real property. The part of the challenge this does not address is how the tool will be used for widespread adoption of DAOs. \n\nFractionalizing assets can be done for any investment, and can be done with other legal structures, such as partnerships or corporations. \n\nCreating this tool also may increase centralization as it pools money to buy assets. That pooled money can drive asset prices up, thus making it more difficult for individuals to participate. ", "q0r": 3, "q1": "The team has relevant, detailed experience working in this area. They have demonstrated knowledge of the area. The team has clearly researched the needs and wants of NFT DAOs. The team has the community connections and technical abilities to create this tool. \n\nThe backup plan for developers is admirable and gives confidence that the plan will be executed and the tool completed.", "q1r": 4, "q2": "The goals of users are a little vague. Success can be measured in terms of number of users, of course. However, some sense of what those target numbers are would be very helpful. The team has knowledge of how many people and groups currently exist that might make use of this. Some measurable goals related to those users would be helpful. \n\nLikewise, the metrics for tracking progress are subjective. A timeline with some goals would help with auditing this in an objective way.", "q2r": 3, "assessor": "z_assessor_2669", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5593, "q0": "The proposal correctly adheres to the challenge at hand,  fractionalizating tools like the one proposed here abound in Solana and Ethereum, however in Cardano we still have tp arrive to a single good  option. Given that NFTs are generally a great entry point and public activity to the crypto environment, it is necessary to provide competent tools to users to allow a better analysis of their assets, and thus generate the environment conducive to a more active and thriving market", "q0r": 5, "q1": "The team's credentials demonstrate extensive experience working with successful organizations such as ADAO and RatsDAO, pioneers of the necessary tools to correctly fractionalize a broad portfolio of so-called \"Blue chips\", laying the foundations for the plan to be carried out without overshoots. and with competent results.\nThe theory that explains the mechanism has been reviewed by peers and the proposal has a clear breakdown of both the budget and the tasks and their execution times.\nI believe that the fractionalization of NFTs will be a fundamental component for the CNFT scene in the next bullish cycle, which is why Cardano must promote the creation of these tools and put them at the service of the community as soon as possible.", "q1r": 5, "q2": "I consider that in the auditability section, the team could have put more effort into explaining to potential users what the success factors of the project will be, both in terms of its construction (how many reports, how often, in what format, etc. ), as well as once finished, understand what is the number of users by means of which a successful project could be considered, something like projecting the expected market share of all the DAOs and projects that resort to fractionalization as a method to help the decentralization of organizations.\n", "q2r": 2, "assessor": "z_assessor_2719", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6844, "q0": "This is a very interesting proposal.  In order to attract more people to DAOs on Cardano I believe that innovative tools such as this are necessary for the ecosystem.  This addresses the challenge as a potential way to solidify the innovation taking place in DAOs on Cardano.  \n\nAs a proposer I will admit that I have spent most of my three years in crypto as a Cardano student, after coming over from Ethereum.  So as far as my education reaches here, I am familiar with something like Consitution DAO, but I am not familiar how a project like that would ever fractionalize a Constitution.  I am saying this as I have nothing to compare this new concept to on a different blockchain that may have already experienced success or failure on something like this.  \n\nThis all being said, I strongly agree that this addresses our challenge of being prepared to prove why DAOs on Cardano operate at the highest capacity as other blockchains migrate over.", "q0r": 4, "q1": "In terms of the experience, I see at the beginning of the proposal under \"relevant experience\" that it mentions just one person which looks to be Bob that will be working on the project.  Then when I look at the bottom of the proposal it appears that states who will be working on the project it appears that TCT from the ADAO community will be helping as well.  I am familiar with some of the work that ADAO has done in the community to make DAO tooling easier for everyone.  Additionally I do know some of the work that Bob has done working for the team at Rats Dao and also being an active ADAO community member.  This seems to check the experience box for me.  \n\nLastly I would add that in terms of a great plan, its good to see that ADAO has already contributed DAO tools such as Roundtable dApp, so I believe in the implementation of this project. ", "q1r": 4, "q2": "As a proposer I would state that the formula is complex and that the tools created to do this can be easily measured for security and durability once built.   There are two very clear metrics as stated in the proposal of how the success is measured.  How many DAOs use this feature, and how many other use cases would this provide.  One can only assume that this will be tested heavily before someone decides to fractionalize a high value NFT like a Berry, so I believe their is sufficient info to measure and audit the proposal. ", "q2r": 3, "assessor": "z_assessor_2835", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11915, "q0": "This proposal asserts that currently no system to fractionalize and distribute fairly fractions of cNFTs, for example to allow certain roles in DAOs, exists. The proposal makes no mention of Fracada by dcSpark, funded by Project Catalyst, which was built specifically for NFT fractionalization. https://medium.com/dcspark/fracada-a-protocol-for-fractionalizing-nfts-14b9017b3d91\nThis tool might have lack of functionality when it comes to intended gating or voting authorization for DAO members, but the proposers should at least have considered and mentioned this protocol in their proposal and maybe explore building on the existing code-base, for example to work with dcSpark to audit the on-chain programmability and behavior more efficiently. Apart from this note about possible duplicate effort, I fully agree that the ability to generate a derivative token asset to represent DAO treasury NFTs does add to the stack of tools that would enable Cardano to service DAOs with a competitive advantage, or close the gap to Ethereum tooling, as the Challenge Setting calls for. What this system provides that is very likely unique and poweful is the distribution mechanism for fair treatment of DAO members according to the proposer's formula (x = ((R / Su) × n) / t - see inline) as described. Overall, a possibly elegant and novel solution that directly addresses DAO tooling, which very closely matches the Challenge brief and may constitute an impactful addition to the Cardano DAO stack.", "q0r": 4, "q1": "The two main proposers have provided their background in sufficient detail and we are also assured that core contributors of the ADAO community will be working on the core smart contract programming, which is often a bottleneck for ambitious Cardano project requiring on-chain programmability. When it comes to DAO-specific knowledge, the proposers are key experts on the subject in the community and it reassuring to see the progress ADAO have made. The portfolio of contributions and previous work provided through the proposer's websites is also impressive and reassuring, and should ensure a good user experience, technical feasibility and relevance to the pain points of Cardano DAOs.\nFor my personal taste, the budget breakdown and timeline are quite tentative, providing wide ranges (like 10k-20k, 2-4 weeks etc) that I would have preferred to be either narrowed own, or discussed for their risk factors in the risk section. This is, however, mere \"nit-picking\" (or you can call it friendly advice) and should not affect the feasibility and likelihood of success, which are high, in any way.", "q1r": 5, "q2": "The sole success goal and supporting quantitative measures are stated as the number of DAOs and non-DAOs that use the system to create derivative tokens of the treasury NFT. \nThe websites provided for ADAO and RatsDAO include links to Github, where this project can hopefully be tracked and audited sufficiently, and the team apparently uses social media like Twitter, Discord, Medium to  good effect, so it is ensured that the community will be able to follow the progress of the the proposal.\nI would have preferred to see more of the Impact section like mechanics and specification of the proposed system, shown on an external website, versus getting much more audit and roadmap detail within the proposal on IdeaScale for the sake of auditability, but this is only my personal preference. Overall, the clarity of the success goals of this proposal is good and auditability is sufficient.\n", "q2r": 4, "assessor": "z_assessor_3314", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "The mechanism presented here allows DAOs or any entity to be able to take NFT assets that they own, fractionalize them, and fairly distribute those fractions to their members.", "experience": "Being an active member of multiple well established DAOs and community organizations in Cardano has enabled me to forge relationships and work closely with other teams and individuals in the ecosystem ensuring longevity and usability in our approach to develop this application."}