{"id": 420989, "author": "dov", "title": "dLiber8", "url": "https://cardano.ideascale.com/a/dtd/420989-48088", "category": 26594, "amount": 60000, "description": "DAOs make decisions.\nGood decisions require good discussions.\nThreaded message platforms are slow and labor intensive.\nLive discussions are often more engaging but subject to disorder and domination.", "f6_no_assessments": 6, "f6_rating": 4.388888888888888, "videos": [], "media": [], "f6_assessments": [{"id": 2974, "q0": "This proposal defines the creation of a tool for gamified video deliberation. The finished dApp would effectively address the challenge, as it would create a new tool for Cardano DAOs to discuss and deliberate on ideas. Ultimately, governance requires communication and decision making. This tool will provide a framework to assist in decision making. By building the results on the chain, the proposal also fosters the transparency of governance decisions.", "q0r": 5, "q1": "The proposal includes sufficient information to determine budget and scope. The project intends to run for 6 months and pays reasonable amounts for mid-career developers to complete the proof-of-concept product. Specific technology requirements need to be addressed, according to the team. They have performed a thorough risk assessment and have identified the major risks that they will face. \n\nThe team lists name and experience, but does not provide links to external sources to verify the experience listed. In future proposals, providing links which validate experience will help proposal assessors to better understand the team and gauge feasibility.", "q1r": 4, "q2": "There is sufficient information to audit the overall success of this project. The proposal includes trackable milestones for interested parties. The metrics are not time bound, outside of a 6 month frame of operations from funding. In the future, adding dates to your milestones may improve auditability of the progress. Providing methods of visibility may also help determine auditability.", "q2r": 4, "assessor": "z_assessor_2376", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3686, "q0": "This project aims to build a game to help improve the quality of discussions online for DAOs. It is envisioned to be a video solution kind of like zoom but with an in-built game where people take turns to vote on ideas and suggestions. Right now discussion channels for DAOs are mainly text based, video or voice options are often Discord or Twitter spaces, presumably because that’s where everybody is at and because it affords a level of anonymity that Zoom isn’t perceived to have. Such an online game based discussion could have the same benefits of anonymity and also improve the quality of discussion as people will have their turn and good ideas won’t get drowned out by the loudest voice or the most outgoing personality. Good decision making is paramount if we want to advance the capabilities and success of DAOs. Some things to add would be if this could be integrated into current software that DAOs and people are already comfortable using, the costs associated with it and the fact that this will probably be run on centralized cloud software for the time being until blockchain tech is mature enough to support the same kind of speed and bandwidth for video.", "q0r": 4, "q1": "The tasks are broken down into manageable timelines and the team has experience across product management, front and back end, as well as in project management. The amount requested for is also reasonable for 6 months and they are not working on other proposals from the current or previous funds.", "q1r": 4, "q2": "While the team proposed tracking completion of key components and that is a good start, there should also be focus on achievement metrics such as number of people using the game, not just ‘doing’ metrics. Open sourcing the code and giving regular community updates would also help score higher points in this segment.", "q2r": 4, "assessor": "z_assessor_2468", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5346, "q0": "The dLiber8 proposal is creating a real-time gamified platform where participants can use video presence, cards and chips to advance, champion and challenge idea. This will make all idea inclusive. The platform is compared against Zoom but better structured discussion to reach conclusions. The tool is aiming to be a collaborative DAO tool as per the goal of DAO love Cardano challenge. The proposal  effectively addresses the challenge well although it is not clear yet in term of execution since there is no demo of this project. The example of questions after reading this proposal and going through his presentation deck are  How would it be possible to allocate speaker time in accordance to the idea's support and novelty? How do you stake chips to buy airtime? etc. The proposer should come up with product demo to illustrate his chip idea, airtime, and show how each user video access can help to decentralize DAO decision. The combination of cards and chips are confusing without product demo. ", "q0r": 4, "q1": "The project will cover 5-7 months (2 week sprint). For milestone 1, he will test out game idea with game team and testers doing this manually. Milestone 2, the app will be created based on the idea. Milestone 3 the multiplayer feature will be enabled  Milestone 4 there will be video cards on game screen Milestone 5. digital chips are coins.  The proposer doesn't mention if each milestone will take the same time period. The budget breakdown is provided by each role (with pay rate and hours in the project). The proposer hasn't provide the linkedin of his co-proposers. The fund will go towards dapp building. The proposal will improve in its feasibilty if each milestone will accompany with time period and that the main proposer provide the linkedin of his team member (although he include his linkedin in the general link). ", "q1r": 3, "q2": "The success of this proposal is that each participant can voice their own idea and have their voice heard. Meetings will take place on this dLiber8 platform instead of the well known platform -zoom, meet etc. In the medium term, this could be an extension/plugin/app and ultimately with web3 Cardano. The team would have to identify KPIs clearer as there is no metric that the community can see that the project has some progress and on track to achieve the success. Also the proposer might add a few sections on his own website that show progress to the community. As it stands now, the concept will still needed to be tested in milestone 1 and the community will definitely want to know if the idea of using cards and chips would work well in parallel. ", "q2r": 4, "assessor": "z_assessor_2695", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8918, "q0": "As to get the best idea out of the box lot of discussion must go on among the members of the community, Hence to maintain such discussion the proposer wants to develop a online meeting tool which is named as dLiber8 ,which provides features to get the best conclusions and maintain healthy discussion among the members of the cardano , Hence by using such portal all the people can contribute in making ideas efficient ,Hence This proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposed solution is not easy to achieve, because creating a online meet up portal needs lot of Engineers to work with, and it should support all over the world and should hold the huge server traffic, the proposed even wants to provide a gamified touch to it , so that it can make the user enjoyable certain time, However the the proposer's team has great track record for solving difficult problems with creative game science and team consist of members who have great experience in developing GUI's  so this will be new challenge to the team , Hence Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clearly mentioned the experience of the team members who'll be involved in the project and has provided proven experience details of solving difficult problems with creative game science, audit even mentioned how the proposed model will be different from other online meeting portal.\nThe audit contains detailed budget breaking idea to complete the project, it even contains well structured budget breaking feasibility for the project to be more efficient , with key indicators provided for each step from launch to providing the set up on Web 3.0, Hence The information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 9061, "q0": "The successful completion of this project would have a large positive impact on DAOs. It will create a gamified discussion system. This will enable DAOs to have complex discussions and include everyone in discussion. It will provide options for providing facts, ideas, pros, cons, and other ideas. This tool would make an incredibly useful positive impact on meeting the challenge goals of incorporating more people into DAOs. The more that have a voice, the bigger the impact Caradno DAOs will eventually have. And this tool is a great way to make sure that when people are first brought in, they will feel like their voice can be heard and their opinion matters to the community. ", "q0r": 5, "q1": "This team does appear to have the skills and experience necessary to accomplish the scope of work required to develop this project. The project also has a clear solution to the discussion problem. The core idea of the deliberation game is solid and clear. The plan of work is a little less clear in the proposal. It seems doable based upon what is here, but there is not enough detail to determine feasibility with a score of 5. The plan is clear, but could answer questions about the number of hours assumed it would take to accomplish each step. What are the roles required to accomplish the different steps? The team experience is listed and the budget is also available. The budget is feasible and doable. Another feasibility question is regarding the need for additional funds. Ideally, this would be more than a demo at the end of the process. But, given all these minor issues, this proposal is still feasible. ", "q1r": 4, "q2": "The milestone schedule that triggers the metrics listed and clear and auditable. It would have been nice to have a set of metrics regarding numbers involved in the community. The logs as evidence of the completion of each phase could also have been more detailed. What will the logs contain? How will they be released? A project like this will need a growing and vocal community to advocate. The project has no mention of growing a community or metrics involved with community engagement. OVerall, these are minor improvements, but the project is clear and auditable, thus a score of 4.", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13485, "q0": "The problem is clearly defined by the author. Daos make decisions, and those good decisions require good discussions. This is the problem that needs to be addressed in this challenge. The author creates a platform where all users can use videos, cards and chips to advance, champion and challenge ideas. This is a good solution that fits the current challenge. In this proposal, the author has also mentioned many risks and solutions for those risks.", "q0r": 5, "q1": "The author has clearly defined timelines, they divided the timelines into 5 important milestones and implemented the project in a period of 5-7 working months. This timeline I find perfectly reasonable to do the assigned work. The definition of project success is divided into 3 milestones by the author:\n1. Initial success: Meetings take place on dLiber8 instead of Zoom, Meet, Team, Jitsi, etc.\n2. Mature success: All of these platforms include dLiber8 as an extension/plugin/app.\n3. Final Success: dLiber8 links these Web2.5 platforms to the Cardano Web 3.0 infrastructure.\nAll of these successes are related to the challenge's campaign.", "q1r": 5, "q2": "KPIs are clearly defined and easily measurable. Milestones are unequal in time but split the budget evenly. The author has listed 6 measurable progress of the project in which each is listed in detail what needs to be done. The group consists of four key components: 1. Dov Jacobson: as a hands-on product manager, and user interface developer he has over 30 years of leading experience. 2. Michelle Kim is a project/community/testing manager with 2 years of experience with this team in similar roles. 3. Jon Dameron is a front-end/GUI/user experience guy with over 9 years of experience. 4. Jesse Jacobson is a technology/backend strategist and functional/mathematical programmer with over 16 years of experience. This is a solid team of professionals with good leadership, with the experience of the team and the solutions they provide being objective and workable the subject matter is very serious about their challenge. which is a $60.000 budget broken down by the author into reasonable expenditures that I find appropriate for the current challenge.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "A platform where you all can use video-presence, cards and chips to advance, champion and challenge ideas. The best ideas surface. None are neglected.", "experience": "Our team has an exemplary track record for solving difficult problems with creative game science.\n(Earning top awards from US Ed. Dept, Nat'l Academy of Medicine, ESA, Polygon, etc)\nWe deliver meaningful games on platforms ranging from coin-op arcade machines to VR/AR or social."}