{"id": 421444, "author": "thiago.ouros", "title": "Brazilian Community DAO", "url": "https://cardano.ideascale.com/a/dtd/421444-48088", "category": 26594, "amount": 50000, "description": "The Brazilian community needs a DAO to act independently on day-to-day pain points, as well as get a first glimpse of how to govern and engage as a DAO.", "f6_no_assessments": 6, "f6_rating": 4.388888888888888, "videos": [], "media": [], "f6_assessments": [{"id": 2914, "q0": "The proposal aim to build a DAO that will focus on the Brazilian Community for diverse goals, while the challenge if for creating tools, infrastructures and services for DAOs on Cardano. \n\nThe proposal may help to achieve some of the challenge KPI as described at the IMPACT section by onboarding the Brazilian community to Cardano, but eventually building a DAO does not address the challenge goals as it will not be useful for other DAOs and won't promote Cardano as the favorable blockchain for DAOs.", "q0r": 3, "q1": "The proposer have the skill set needed for successful implementation of this project, including the technical ability and marketing experience. Been a Cardano Ambassador and stake pool operator also can be helpful for the success of the project.\n\nHowever It is not clear from reading the proposal if there is already an active Brazilian community that will be the beneficiaries of this DAO. I see it as a crucial information for assessing the proposal chances to be successful. \n\nA DAO is first and foremost a community, and only on top of that a technology framework. By aiming to a specific geographic region community the proposers are actually put a potential limit on the DAO grows potential. On the other hand this could be also an advantage, as the DAO can start from existing group that have already working together and knowing each other, but if that is the case I would expect to see some information about the exiting community in the proposal. This information can be provided, for example, by showing engagement stats on communication tool as discord channel, telegram groups etc. \n", "q1r": 4, "q2": "The proposer provided a detailed and clear plan divided to monthly progress phases, and reasonable budget. Using tools as Dework and treasury guild as suggested in the proposal can be helpful for progress tracking and auditing by the Catalyst community. ", "q2r": 5, "assessor": "z_assessor_2360", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 4581, "q0": "Breaking Cardano out of the English-speaking \"ghetto\" remains a persistent challenge for the community, so it's not hard to make the case that non-English speaking subsets could benefit from DAOs that more specifically address challenges they are facing. With that in mind, I think it would be helpful to enumerate some of these pain points (we can sort of derive these from the goals as stated, but it's good to err on the side of clarity).\n\nIf we assume the initial establishment of the DAO will be successful, it would be useful to hear more about how the proposers would go about scaling. Is a category like \"Brazilian community\" too broad to address the complexity of the challenges that might arise long-term? I'd also recommend setting the table a bit more for us by giving us a sense of what the current state of the Brazilian community is within Cardano. ", "q0r": 4, "q1": "The first and second month of this project's roadmap/budget look solid. Things start to get vague with the third month, however, which is where the vast majority of the budget is allocated. This leads me to wonder whether the project funding cycle might not be better broken up into two phases, with the first phase dedicated completely to laying out the groundwork for the DAO's governance and getting buy-in from community members. The proposal's risk assessment even acknowledges that it will take time to build the DAO's vision with community members.\n\nThat said, I am confident Thiago and Cristian are up to the task of building a DAO, and the $35/hour initial operating budget is more than reasonable. ", "q1r": 3, "q2": "The project's commitment to budget transparency will be an important part of tracking not just expenditures but priorities as they emerge. The proposers are veterans of the Cardano community and appear to have a good sense of what's expected of them in terms of disclosure and updates. \n\nWe could use some more information about the kinds of products that might be sold on the store as well as bounty tasks to get a better sense of how useful they'll be as KPIs, however.", "q2r": 4, "assessor": "z_assessor_2564", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5349, "q0": "The Brazilian community DAO proposal is structuring a DAO to promote rewards to help community get involved in tasks and develop small projects to improve Governance. It will be the first Brazilian community DAO. The collaboration between community members will be promoted via bounty system. It will increase community engagement as they use Cardano DAO tools and ADA flow (DAO transaction fee). It fits the challenge of DAO love cardano as it will showcase how DAO would work for the community. The proposer also expects the DAO tools would be increased as he implements his DAO concept. The proposer mentions a few key risks for this project which are low engagement and the software implementation delay and lack of challenges specifically for DAOs. However, he has identified the potential mitigation ways. I think the community engagement will be the most challenging as the DAO concept for Brazilian community will be the first and this engagement issue could be solved by being more involved in the townhall representing LatAm and share idea for feedback.", "q0r": 4, "q1": "The project will take 3 months with involvement with Treasury Guild and Dework team. The end result for first month would be bounty program and governance NFT and products in third month. In the budget breakdown section, the proposer might want to indicate what would be Cardano products he plans to sell and how could he reinvest in the DAO. The proposer should identify the objective of setting DAO clearer so the bounty system can be tailored to reach the DAO objectives more effectively. The team members are Brazillian community members and should have the edge in implementing this proposal successfully.", "q1r": 4, "q2": "They will incorporate the auditability tools like Treasury Guild (record payment transaction) and Dework (track task transaction). They will create the Gitbook for the community to audit this project and provide the link in the Catalyst monthly report. Although the team has identified the key metrics for this proposal as number of community members incentivized by DAO to execute a task, number of products sold at the store and that 50% of budget spent on bounty tasks, it is unclear what would be the important agenda for Brazillian community DAO. The team would explain this better by raise example of bounty tasks - in which way these bounty tasks would benefit the Brazilian community. Without identifying the mission of Brazilian DAO, the KPIs would be scattered across different ideas and the community will be confused as to which metric they should look to measure the project progress and the completion.", "q2r": 4, "assessor": "z_assessor_2695", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7765, "q0": "Decentralized Autonomous Organization(DAOs) Playing a vital role in all projects and working for its progress. As Brazilian community lacks DAOs it is not able to act on it own as per there requirement. They need DAO to act independently on day-to-day pain points. That will also help and provide them how to govern and  engage as a DAO. As solution to it they want to structure a DAO with promoting rewards and attracting people and users, So they can get involved in community. With simple tasks and projects they will improve there governance and thus developing a vision for this DAO. As DAO play important role I strongly agree with proposal and  This proposal effectively addresses the challenge.", "q0r": 5, "q1": "proposer has given full information regarding there roadmap and timeline for project of setting up DAO, They have provided 3 months plan which includes from DAO Basic Setup to engaging new people to community to Development of the vision of the DAO in 3rd month. They have given full details on budget breakdown and how they need for 3 months such as Set up cost $2500 to incentives program to Set up a store with ADA, They have even explained required hours of work and there hourly pay plan. Thiago Nunes and Thiago Nunes both have many years of experience in Tech writing and Analysis and Systems Development. So I Strongly agree as they need DAO in Brazil. With given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer will be using integrating auditability tools created by the community so that KPIs and Metrics will be available in required standards. They will have separate department treasury guild that will provide all cost related details and reports. On Dework\nall ongoing regular reports will be provided.\nThey will provide all details and monthly reports separately to catalyst community.\nI strongly agree with proposal because all \nnations should have DAO and independent bodies . With given information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2917", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8981, "q0": "The community governance in any part of the world is a welcome development. Brazil is no different, especially with the population and technology adaptation.\n\nThis proposal aptly addresses the issue of creating awareness and educating the population about some of the concepts of DAO and Blockchain. The proposer aims to build a DAO that incentivizes the contribution of the members through a bounty system hosted on the Cardano blockchain.\nThis deals with major challenge to any governance like misinformation and engage the community through social media and create awareness about the same.\n\nHowever the onus is on the proposer to describe the long term goals and impact of the project on both community and general population. This could have been done in a better way.", "q0r": 5, "q1": "Thiag Nunes and Cristian Amaralo have well demonstrated experience in their respective fields of software development and technical writing &digital marketing. This is evident from their LinkedIn profiles.\n\nThiag Nunes also has experience in game development and entrprenuership domain. This can be helpful in propagating the idea throughout the community.\n\nThe experience thus is enough however the main challenge that lies ahead of them is the sustainability, which can be discussed at a later time.\n", "q1r": 4, "q2": "The KPs are aptly mentioned to be number of community members incentivized and 50% of fund spent on bounty tasks.\nBut the number of products sold at store could use a target figure.\nThe timeline described for each month separately over the period of three months and also the budget breakup is justifiable and can be used in auditing.", "q2r": 5, "assessor": "z_assessor_3009", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11489, "q0": "The proposal simply answers the challenge needs provided in the brief, i.e. an improved decentralized infrastructure in the cardano ecosystem, by connecting to and inviting local Brazilians to learn and develop the organization using the available tools in cardano. As an early adopter, the team’s move to build a Brazilian community as a decentralized system for local members to [1] partake in small developer tasks yielding bounty rewards etc., [2] while sharing a common vision to grow as a developer community in the cardano ecosystem is impactful to the community. This way the decentralized community can be maintained as an entryway for future adoptions in the region.  As it stands, the demand for building cardano based DAO infrastructure is a driving factor in the cardano ecosystem currently, due to its likely future progressions in the world of blockchain. What better way to be prepared for a new wave of decentralized systems, if not to propel for effective DAO developed under cardano governance and the future of community innovations. This proposal however, has clear and specific goals achievable at the end of a successful implementation. It recommends a system to curtail misinformation in the Brazil region, host local events for bounty rewards and educate its members looking to develop in cardano or potentially trade as well. I strongly agree that it fits all the requirements of the challenge and impacts how the growing number of members will interact with the tools and protocols in the system to enhance its widespread use. ", "q0r": 5, "q1": "The team is very concerned with its implementation strategies as provided in the proposal. Further risk assessment measures have been put in place to calculate the potential risks involved during the implementation phase. The proposal includes a list of solutions derived to mitigate risks that arise. The proposal is backed by an experienced two person team, sharing combined skills in software development, technical writing and in building companies/company management. The proposal includes documents that provide further information about the team’s past job experiences. In the proposal is a very detailed budget with a stipulated time of 3months to achieve results. These results which are expected to include a functioning DAO, the number of incentivized members etc. will indicate the growth rate of the organization in its first phase of operation. In my opinion, the team can be very reliable and resourceful looking at the skills necessary for DAO implementation. The budget ask is reasonable, as it mostly will go into the administration of the business and salaries. However, for assessing the project, the community will have platforms integrated into the system for scrutiny and proof of progress. I strongly agree that the proposal is feasible, it checks all the requirements and should be granted funding. ", "q1r": 5, "q2": "The team is highly concerned with its auditability as it has provided DAO metrics to measure the growth of the project. Also, it has a simple and straightforward solution to a problem in the Brazilian developer community. The project impact is greatly expressed as being a tool to encourage the adoption and extensive use of the cardano protocols in its set tasks and potential DAO growth within the ecosystem. Aside from the risks involved and the proposed measures to curtail it, the proposal indicates its roadmaps for achieving results. In a span of three months, the community can experience the small innovations promoted within the DAO community. All information provided allows for a thorough monitoring of the events mentioned in the proposal, hence my justification that this is an auditable project. I rate it a 5 out of 5. \n", "q2r": 5, "assessor": "z_assessor_3252", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Structure a DAO to promote rewards to help our community get involved in simple tasks and develop small projects to improve governance, thus developing a vision for this DAO.", "experience": "Thiago Nunes - Cardano Ambassador, Developer and SPO. Owner of a digital marketing agency for more than 7 years.\nCristian Amaral - tech copywriter, 10 years of experience in content marketing. Redirecting his career to be a copywriter specialist in blockchain."}