{"id": 421792, "author": "littlefish.foundation", "title": "littlefish - Redefining Earning", "url": "https://cardano.ideascale.com/a/dtd/421792-48088", "category": 26594, "amount": 260000, "description": "Earning solutions today limit individuals, take away their freedom in the work space, and chain them to jobs that prevent personal growth and fulfillment in the name of financial safety. ", "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1988, "q0": "The core purpose of this proposal is redesign and create a novel reward earning algorithm and/or token economies that will enable a paradigm shift from traditional institutions based pyramid reward system to a meritocratic work reward earning system befitting for a DAOs and DAO based projects for the Cardano Blockchain ecosystem. The idea aims to ensure that the Cardano Blockchain is novel platform and enabling environment for DAOs based projects through innovative and new DAO tools, governance, features and functionalities that puts Cardano in the forefront of this emerging opportunity in the Blockchain technology. As such, this is awesome proposal that definitely fit into challenge settings and should be supported accordingly. ", "q0r": 5, "q1": "The proposal has provided more than enough information about the profile of the team and am satisfied with experience, knowledge and expertise to deliver the proposal. The budget estimates are very reasonable and tailored to the specified roadmaps. The approach and perspective in which the proposal will implemented, is very impressive. Am also confident that with the intended collaborations and partnerships with the community for feedbacks and other contributions, this proposal is in good hands for an effective implementation. ", "q1r": 5, "q2": "The proposal has given details of its goals and mission and being a research and development based project, the progress and development of the proposal can be monitored and accessible from specified communication channels. However, the number of potential users after the proposal is delivered and the orchestrated roadmaps would also suffice as a credible basis to audit the proposal. In general, am convinced that the community has sufficient information to assess and confirm the progress of the proposal if eventually funded.", "q2r": 4, "assessor": "z_assessor_2292", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3292, "q0": "This elegant and well crafted proposal is the flagship of the LFF efforts in Fund 9, from the POV that what it seeks to build out is that beating heart of the whole LFF decentralized vision.  The team properly captures incentivization of action as the central issue facing decentralized organizations that embrace systems or network thinking paradigms, and on a much deeper level (via their dive into the concept of action, which if you only read one part of their extensive knowledge base, it should be this:  https://publish.obsidian.md/littlefish-foundation/A.+Whitepaper/D.+Technology%26Philosophy/The+Attributes+of+Action) they dive into exploring the deep-end of the pool:  the ethics of personal agency, i.e. the integration of individualism into a non-contradictory collaborative framework that doesn't sacrifice the sovereignity of the individual.  \n\nWhat they are seeking to provide here is a framework for decentralized networks to put \"harmony\" on autopilot through a distributed rewards model, and to this end the proposal looks to build out a robust and outcome oriented tokenomics.  Taking into account the education required (including ethical and philosophical, often overlooked aspects of any token) they seek to deliver a functioning tokenomics (with token smartcontract and a dose of marketing at the end, in anticipation of an ICO of some type).\n\nBecause this project seeks to build out critical, opensource DAO infrastructure along with a knowledge base to support the best principles of decentralized organizations, I believe it has exceptional alignment with impact factors, and give it a full 5 stars.", "q0r": 5, "q1": "The team has laid out a choreographed roadmap here, though, in true systems thinking style, it is maybe better described as a \"road-compass\" as it embraces emergence and self-organizing principles.  It provides clear milestones, grouped as phases, or modules (and again, the systems thinking shows up with distributed modules allowing for flexible organizing of the project) and each module has clear deliverables described.  Early modules prioritize building out the team and community, with a focus on dedicated education and professional certification, while later modules are much more refined and technically specific, targeting specialist level skills and training.\n\nThe budget is broken up and quite granular, broken up by module, and within modules broken up by hours and actions.  The hourly rates are generically set at $50 for non-specialist and $100 for highly-specialized actions, which, given the amount of background, training and studying asked for from participants, looks like a pretty good deal.\n\nBecause of the interesting layout of the knowledge-map provided for the LFF proposals in Fund 9, it was quite easy to see how all the proposals they have relate to each other, and where the overlap in the ecosystem is, and also to get a good overview of what *isn't* covered in the proposals, such as how the big picture fits together further down the road.  Again, this is what you can do with a compass that can't be done within the limits of a map.\n\nBecause they have clearly described the architecture they need and are pursuing, and because the budget is complete and thoroughly broken down, this proposal has a very strong foundation for success.  With the growing team and its diverse technical and professional background, and perhaps especially their enthusiastic learning and teaching within the community, I believe it is fair to give this proposal a full 5 star rating for Feasibility.", "q1r": 5, "q2": "The fantastic knowledge map creates a great foundation for tracking the proposals, and the team has been creating this documentation, along with public Miro's and archived meetings for a while now.  Their community is growing and vibrant, and they are regular contributors to Swarm, with hosted community meetings.  Their Discord is a critical bridge between the current governance methods and the envisioned ones involving this token and NFTs, so it is a place where the team makes themselves available and accessible.\n\nThey have listed out some basic participation KPIs for the community building, and then more specific KPIs for participation on the various modules supplied here.  Overall I expect that their progress reports will be brimming with data.\n\nFinally, their objectives here are clearly captured in the deliverables and milestones, so it should be an easy call to tell when they have crossed the finish line on this proposal.\n\nAll in all I feel that this proposal is presented in a highly auditable way and should allow for maximum community insight and oversight of it.  A full 5 stars for auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6141, "q0": "Today's monetization solutions restrict individuals, lack of freedom, and chains impede the growth, and fulfillment of individuals in the name of financial security. A well-designed crypto-economy where individuals share income in peer-to-peer, bossless networks that allow DAOs and other organizations to collaborate. The Littlefish Foundation (LFF), a decentralized global organization, builds technologies that help align individual actions toward shared goals, enabling collective intelligence. Proposals impacting the challenge posed and described in detail, rich. Recommended to be experienced and has many links with Littlefish Vault. In fact, the relationship between employees and employers, organizations with power pyramids: boss-subordinate system. Littlefish Foundation no pyramid exists: LFF and this proposal is the key to making it a reality on a large scale. The proposed group posed 3 issues and explained in a dense, easy to understand manner. And How the team approached the problem: Token Engineering R&D, solutions, rewards and results. It is very positive that the author has given the main indicators of the challenge. Show that the author has prepared very well, knows what he will do, how to do it, and reach the end goal, which is the success of the project. Besides, the author has recognized the risks in the project. At the same time, there are specific solutions to minimize leakage when the project is implemented.", "q0r": 5, "q1": "The proposal team outlined a plan for the project, which was very clear and detailed. Milestones are set across 5 Modules. The team also provides a specific and coherent timetable with each task to be done analyzed by hour, day, in months, and elaborately explained. With the planner provided, we know all that will be done in terms of key work, resources, timelines, milestones and delivery quantities... We have a lot of information we need. necessary, is provided here. It shows that the author has prepared for the project very professionally, carefully and spent a lot of time and effort on the project that he will develop. Power up the success of the project. Next is about the budget. There is no doubt here. The proposal requires a $260,000 budget. This is a fairly high budget requirement, accounting for more than 20% of the total challenge budget. However, in my opinion the value is appropriate given the complexity of the work and the project's roadmap. The budget allocated for each job is analyzed in detail, and coherently. We know how the funding will be used. Specifically: As a budget for 5 Modules, Human Resources, LFF action fund, etc.. Budget is transparent, increasing the level of trust and sustainability of the project. Finally, about the team of team members. Another strength of the proposal is having a strong team, full of technical expertise and experience to execute every step of the project well. We know each member's identity, role, skills, expertise and experience. In addition, the author also provides presentations and attaches a link profile, so that we know more about what was presented. In general, the proposal has a very good plan, the budget is explained transparently, the team is qualified and experienced members. all make up a perfect and feasible project.", "q1r": 5, "q2": "Testability is perfect. The proponent cares a lot about this part of the proposal. The proponent says everything will be made public, the team will publish key Obsidian progress updates, and share learning about the Catalyst community. The Miro board will be open to the community, their progress can be seen here. Miro: this is a very interesting tool that allows you to integrate a variety of content and formats into your tables such as photos, videos, spreadsheets, and more. In addition, Miro integrates with many popular data storage and resource storage applications. Discord: supports video calling, voice chat, messaging and allows users to communicate with each other whenever needed... is a good place for us to find updates, and take action every day. date.etc. That is, we have many ways to audit accurately, continuously and transparently. Proposal has a plan to implement the project successfully in a transparent manner. Detailed step-by-step roadmap and budget breakdown for easy audit and successful project progress. The team of experts are those who have enough expertise and experience to execute the project well on schedule, and successfully complete the project.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6726, "q0": "Littlefish is a DAO that wants to reimagine work. In today’s world, the mechanisms we use to earn income are outdated and suboptimal. They limit autonomy within the workspace and represent a costly trade-off between financial stability and personal growth aspirations. Well, littlefish wants to start afresh with a model that stimulates individual leadership and initiative, asynchronous work, voluntary participation and a constantly evolving landscape. \n\nLittlefish have chosen the distributed ledger technology to set up camp because it can boost ideas like anything we have seen before, and they have chosen Cardano in particular due to its research focused ethos and the fact that Catalyst was the spark behind the idea rolling down the hill. As a personal note, I add that Cardano was an excellent choice also due to low transaction fees, best suited for such a project, but more details on this in the following section. \n\nTo fully understand their value proposition you have to visit their website and read the white paper. They have a fresh style, they keep all the information simple, easy to understand and it is complemented by very informative charts and diagrams (except the dog coin meme, that was not necessary). This assessment cannot really do justice to all their ideas, but here is the nutshell: the functioning model is built around the user (little fish) who is part of a wider entity (the colony). Littlefish are of course economic actors wishing to maximize their utility, while the colonies are created around a common goal / idea / task / cause / etc. The littlefish performs actions, and these actions are treated as an economic goods, thus carrying value and can be exchanged, or rather sold by the little fish. Another key feature of the model is a revenue sharing mechanism between the fish and the colony, complemented by a reward aging characteristic to incentivise fresh action over inactivity.   \n\nWhy are littlefish asking for funding? Because they want to develop their model, advance their research and put it all in practice. They have a very clear way of dividing their work into modules, and they are seeking funding to finance an educational module (token engineering learning), a module to apply the lessons from the previous part, one to develop the working model, one for smart contracts and a marketing focused one. \n\nEverything within this proposal is a testament to the team’s rigorous process, no-nonsense approach of explaining their thinking and of course, it all fits extremely well within the challenge whose role is, I remind you, to foster the development of DAOs on the Cardano space and build the tools necessary for future projects. Well, this is definitely a perfect use case for that purpose. Moreover, if Catalyst would ever implement a sixth star, littlefish would be a prime candidate to receive one. ", "q0r": 5, "q1": "Let’s talk about the team first of all. You can search through the Fund 9 proposals high and low, it’s unlikely to find a better example of how a team presentation should look like. Each main team member presents him/herself in a few paragraphs, and it is all complemented by Linkedin profiles as well as the personal github repository, since most of the members have a strong technical background. Each member's presentation ends with highlighting the actual modules on which each member will focus, thus making the reader’s job effortless when trying to make connections throughout the text. I am extremely impressed by their meticulous approach. \n\nOf course, each of the five modules briefly touched upon in the previous section are presented in great detail, and we can immediately realize what kind of activities will be taking place, as well as complementing the description with an estimation of the hours involved. Going further into the details, for each module we know the relevant stakeholders, the primary working group, the estimated duration and necessary hours. And if this wasn’t already enough, the entire proposal is sprinkled with useful links (especially here) where you go very deep down the rabbit hole into, for instance, past payment sheets for existing members, external case studies relevant to what you are reading or simply a beautiful post-it board to see the broad picture of how a certain module is intended to work. \n\nThis is also one of the very few projects that do take seriously the task of going through a risk assessment, and actually identifying, documenting, finding ways to mitigate and properly disclosing some of the risks that could affect the project. Again, just to offer a flavor of what is presented, the team discloses in great detail the financial risk stemming from the fact that a significant portion of the team is based in Turkey, currently experiencing hyperinflation, and the mitigating actions to lower the future impact of the situation.  \n\nThe budget is built on very solid principles, however it  works a little differently compared to traditional projects. We start with the key information that the budget is built around the base hourly rate of 50 USD, deemed by the proposers sufficient to sustain a living wage in most places around the world, thus offering financial stability to full timers. Modules 1 and 5 use the default rate, while for the others the rate is increased to account for the higher skilled labor necessary. Each module has its own separate budget, and there is also an extra caption for each module, kind of like an overhead budget. A part of it is to be spent at the discretion of the module team while the rest is pooled to cover common good expenses (videoconferencing tools for example). On top of all this lies an action fund (25% of the total) acting as a buffer mechanism to ensure short term sustainability and allow for estimation errors. \n\nIn conclusion, tt is a joyful experience going through this proposal and again, reinforcing the message from the previous section, littlefish passes the feasibility test with flying colors. ", "q1r": 5, "q2": "Littlefish is built around openness, so ensuring full auditability of its activities comes rather naturally. The team publishes major updates on Obsidian (an online knowledge base solution), while their Miro boards are open to the community. The team uses Discord for daily activities as well as to “shout” when actions are done, in a similar way as to how Deworks / Discord works for Catalyst Swarm and bounties. The team will also use google analytics to track the overall success of the DAO (number of visitors, average time spent, etc.).  \n\nLittlefish also offers very logical solutions for tracking the proposal’s indicators in particular. For module one they offer as a key indicator the number of graduates from their course, while for the others, the unique number of contributors. For the code built, github repositories and unique contributors, again. \n\nI think it’s only fair I close this assessment with mentioning the Japanese Ikigai concept, frequently used by the team in the various descriptions of how the DAO is supposed to function, in which every little fish is supported from the beginning in the quest for his own Ikigai, meaning the sweet spot where competence, passion, a higher purpose and economic incentives meet together. \n\nLittlefish is a beautiful experiment and it will be extremely easy for the Cardano community to follow its development. Of course, five stars as well for auditability.", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 7, "ne": 3, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 12527, "q0": "As for the impact part, I noticed the proposers made the issue very clear and detailed. They have indicated that the goal of the proposal is to design and create a highly economic and equitable reward sharing system. Then come up with reasonable solutions to solve the problem. Proposers also point out that if the proposal is successful, it will make a difference that only the Cardano blockchain has. What I haven't seen with this proposal is how it can scale to solve other problems in the future. However, I still appreciate the detail of the impact, rating: 4 points", "q0r": 4, "q1": "The feasibility part is even more impressive in its detail. The activity plan, timeline are very detailed, full of each activity, divided into very reasonable stages. The budget allocation is also very clear and specific. The required resources are all listed. Regarding the implementation team, these are all talented people, with knowledge and experience in their fields, suitable for the requirements of the proposal. Have a clear plan to return to Catalyst if more funding is needed. There is consideration of risks and challenges. They also put in place measures to manage those risks and all solutions they mentioned in the Impact are possible. In conclusion, I highly recommend this proposal and believe it to be highly feasible. Rating: 5 points", "q1r": 5, "q2": "The proposal has milestones and sets out clear KPIs for each stage. There are tools to track progress or measure activities, such as Google Analytics, etc. In addition, the activities and progress of the proposal are public on community channels. The proposal also gives the reader an idea of what the project will look like when completed. In addition, the description is also very clear and easy to understand. Rating: 5 points.", "q2r": 5, "assessor": "z_assessor_3426", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "A well-engineered crypto-economy where individuals share earnings within peer networks, without bosses, allowing DAOs and other organizations to collaborate like never before.", "experience": "A growing community of 100+ started in Dec 2021 with a contributor core approaching 20 with highly technical individuals experienced in software development, system administration, plutus development. Extensive experience in entrepreneurship, startups, organization building."}