{"id": 422185, "author": "adaraimova", "title": "ADAwell: Wellbeing DAO", "url": "https://cardano.ideascale.com/a/dtd/422185-48088", "category": 26594, "amount": 5690, "description": "Wellbeing portals are not reliable & monetize user attention via ads, sponsorships. Today’s health care system focuses on only disease and doesn’t seek a holistic approach or a health optimization.", "f6_no_assessments": 8, "f6_rating": 4.541666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 1717, "q0": "In terms of impact, this proposal is good, but I would like to know in more detail how Cardano's technologies would be used. The problem to be work is the way the health and wellness system works today, focusing only on the disease and not on the human being; proponents suggest a more holistic approach to this problem, promoting health optimization. The focus is to generate a platform, which would be a DAO, called ADAweel. It would be fully focused on promoting health through this alternative approach. I thought the idea was very important, necessary and current, as it is a fact that nowadays we tend to search for diseases and symptoms on the internet, on unreliable sites, which can generate several harms. For example, these sites support themselves through advertisements and abusive propagation (we are required to read an advertisement to continue browsing or otherwise provide cookies). The information passed on these sites is often dubious, as proponents state: “some may even contain false medical information that tricks consumers into purchasing 'snake oil' medical treatments. Proponents also raise the problem of lack of time and interest in looking for more reliable and complete information (“The popularization of science is on the rise like never before. But not everyone has the time or interest to read medical journals and journals, listen to podcasts from 2 to 3 hours or consume other types of scientific materials”). So the ADAwell platform would work precisely on top of these 3 problems, as is clear in the excerpt: “function 1 - Curation and Synthesis (Performing a role in this proposal) + role 2 - Events and Challenges (Performance in the future) + role 3 - Support ( running in the future)”. The amount requested for this proposal is low as it would only correspond to the DAO proof of concept. I think this choice is very smart because it increases the chances of the project being financed and continuing to be built. The proponents also define what activities would make up the curation and synthesis session, such as selecting materials from reliable sources, establishing contacts with experts, etc. There would be tool kits, and each kit would correspond to, respectively, the preventive health part: prioritizing exams and treatments, such as reading labels, keeping personal health records, communicating with your doctor, listening to your body signals, and finally, when and how (protocols) will help you optimize your diet. In summary, the objective of this phase is super clear, as it brings together like-minded people about science and well-being. The problem here is that it is not so clear how blockchain technologies would be used. Some statements are made: “ADAwell intends to become a Cardano DAO. The tools needed for DAOs are currently lacking, but under development.” What tools would these be? The proponents' own preposition, “how to turn ADAwell into a community-oriented wellness DAO in Cardano”, is not answered directly. How can we be sure that the amount of Ada and smart contracts will be increased? That the number of active community members will grow through this project? Therefore, I think this technical part should have been explored further, in order to provide a better understanding of the bridge between Cardano and the ADAwell project.", "q0r": 4, "q1": "The proposal does have some positive points in relation to how the applicability of the project would be made, but some things could improve here. The script starts well - we know a lot of activities that would happen in August; it would be interesting if there were more details about them, for example where the “SLEEP TOOLKITS” would be published and how the user manual would be made, who would work on this part and in what way. In September we also have several activities listed and the same thing happens - the level of detail could be better, we don't know how the AMA session would be planned and carried out - in fact, it's not clear what it is; how would the contact with wellness professionals be made, how would they get to know the project, understand how Cardano gets involved (would it be presented to them about blockchain or just the part more focused on health and well being?). As of October, activities are punctuated less accurately, as we know that in the last 3 months meetings would be held with the community - but we do not know what content would be addressed and how often these meetings would be held - nor are we told how the The community would be engaged in participating in these moments and would “buy into the idea”, that is, how they would understand and embark on this initiative (because many people have a very rigid view of health, how to demystify the subject?). For these reasons, I think the script tells us more generally about what's going to happen, but without the level of detail that I think is ideal. The total amount requested is divided into two parts: the cost of digital tools and the DAO platform, community and building. The first part is more detailed, we know how the 690 dollars would split more precisely, but the remaining 5000 dollars is explained very superficially. It is said that “The remainder of the budget is for implementing the proposal, valued at 1000 USD/month. This fee will allow me to work full-time at ADAwell for the duration of the proposal, August through December.” But it's not clear how the thousand dollars a month would be used because a series of tasks would go in here, would this amount be shared equally between the two people presented in the team part? Because in this case, the value is very low (500 dollars for full-time work); doubt is in the air. Finally, talking about the presentation of the team, the information about the duo Adalat Raimova and ChaKhan is passed on in a very satisfactory way, because we know in detail, who they are, what their professional areas are, we are provided with their linkedin profiles, etc. ; in other words, we have a great degree of detail so that we get to know them with a lot of understanding, what worries me is in relation to their experience with Cardano, apparently only ChaKhan has studies in the blockchain area and we don't know if he studied it more generally or focused on Cardano. It would be important to have that understanding. That said, some improvements could still be made, the topic is ok.", "q1r": 4, "q2": "The way proponents suggest that progress be measured is quite adequate, they report a series of metrics that should be evaluated, such as the number of toolkits and pages managed; visitors and viewing on the Obsidian page; Discord community tracking and etc. It could have been better explained how some of these KPIs would be analyzed, in the case of qualitative factors, such as the twitter analysis. What parameters would you use to run this analysis, how would you plan to track the Discord community - would you analyze the volume of ideas exchanged, conversations and engagement? How can this all be analyzed and more details? It's good that they announce that they will post all updates on Discord, but we would need to know how often this would be done. Weekly, monthly? And how would updates be made, would there be a checklist and be scored? It would also be necessary for us to know a little about the work routine of the professionals involved, in the case of the pair, what they would be doing each month, if the activities that were programmed in the script were actually being carried out, etc. That's why I think it's necessary that the updates are monthly and also made in order to understand about the accomplishment of the tasks and about the partial results, not just one or the other. The success scenario here would not correspond to the complete closure of the project, as the requested budget and activities would focus on carrying out only an initial phase; even so, the proponents tell us what would be considered success for this phase; which would be “curation and synthesis toolkits (Sleep, Eye health, Homo Sedens) were published, more than 100 views each, receive more than 3 positive feedbacks from people who have benefited from it”, in addition to the growth of the ADAwell community and the greater involvement of the Cardano community with the project, requesting a curatorship on a health topic - would this be done in the created dApp, discord…? Anyway, the main objective is to unite the ADAwell + Cardano community around health and well being. I think it would be important for all this data to be collected and exposed to our community; I think the most suitable format would be an online meeting, or on Zoom, or in an after Townhall space (or even in the main meeting)... objectives were achieved as well as the specific objectives of this challenge. For these reasons, I think the auditability is good, but it's not 100% perfect, a little bit of depth would be welcome.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 987, "q0": "### GENERAL\nThis is a community building proposal aiming to lay the contextual foundation to tackle very real and serious issues within the health & wellness economy.\nThe great solution summary, takes into account that a DAO can't simply by created, but has to be formed by a unified vision of a community engaging with it. \n\n- missing: cognitive security, spiritual / shadow / inner work?\n\n(!) suggestion to look into SociaDesignAcademy (SDA) and the conversational UI toolkit they're building. Could be a very good fit for the ADAWell app\n\n(+) very extensive research and knowledge bits mapped in Miro\n\n### IMPACT\n\nThe problems are very well recognised and reiterated. Extracting health and well being knowledge and (lo-fi) tools from behind paywalls, and curating it for a DAO ) on Cardano sounds like a great idea!\nIssues and their roots will still remain, but not be as painfully felt for some Cardano community members that dig into the tools (checklists).\nIt comes down to what quality the community will have that forms around the idea. \nIs the proposer able to collaborate with and integrate well the health experts, other DAO focused communities (like ADAO, LittleFish) and design paradigm shifting initiatives like SocialDesignAcademy (SDA)?\nIf yes, then future forms of this proposal could have a huge impact that already be felt here & now.\n\n(!) Maybe worth looking into the DisCo framework\n\n(+-) checklists are a very basic and bit boring tool, how can especially dry matters be conveyed in a more exciting an thus more memorable and accessible way? Here again the suggestion to look into the \"conversational UI toolkit\" that SDA is building (or in general the transition from page to chat like interfaces).\n\n(!) A thought to ponder on: How is curation, synthesis, and the content creation and maintenance remunerated? It has to be clear how the DAO is generating funds to reward work done.\n\n(-) it's mentioned that DAO tooling is missing at the moment, but not specified which specifically they are missing the most and would like to focus on\n\n(+) plus points for reaching out to LittleFish Foundation\n\n(-) The KPIs are not well defined, neither specific, nor measurable, nor time bound. Additionally the proposer falsely claims a thriving wellness based DAO will generate transaction fees after this solution is implemented. \n\n(-) Risk / challenge of building a wellness community has been identified but not assessed in detail. How will people contacted help? What if no one can help? Plans to make the development engaging and proactive by integrating members from other (non wellness related) Cardano DAOs, DisCos or design initiatives (like SDA)?\n\n(+-) Risks of false information identified, especially dangerous in regards to health suggestions. How is trustfulness of sources verified? ", "q0r": 3, "q1": "The plan is very \"cost efficient\" and requires only a small team. That's why it's quite likely that it will be completed successfully.\n\n(+) The budget breakdown is detailed enough for the level of funding requested\n\n(?) Why use Obsidian it's quite expensive (also when scaling!), what about Joplin, GitBook (free for Open source communities) or some of those alternatives? https://alternativeto.net/software/obsidian/?license=opensource\n\n(-) Timeline seems very packed, with little to no breathing room, wouldn't have hurt to leave some buffer space. Always better to under commit and over deliver\n\n(+) The team is very well qualified to kickstart the community building of a wellbeing DAO\n\n(+-) Since this is only a community building proposal, the team will return for funding in later rounds to start building the DAO with the community stub they have created.", "q1r": 5, "q2": "The auditability is straightforward and well defined.\n\n(?) Will there be a progress dashboard in Obsidian or do Catalyst coordinators have to read through the pages to get an overview and measurement of the progress?\n\n(+) Progress KPIs are very well defined and though through for a proposal of this scope!\n\n(+) Success metrics for the project are clearly communicated, actionable, specific and time \"related\".\n\n(+-) Long term success KIP is mentioned but not yet in a measurable form", "q2r": 5, "assessor": "z_assessor_2170", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2922, "q0": "The purpose of the proposal is very important and can improve people lives and health, but unfortunately it does not align with the challenge and does not address its goals. \n\nIt is true that a new DAOs such as \"ADAwell\" and others on cardano can impact the key metrics that was sepsified on the challenge brief, as number of communities engaged, amount of ADA coming from DAOs transaction fees etc., as the proposers mentioned at the \"impact\" section, but the challenge itself is for building tools, infrastructures and services to DAOs on cardano, not for building a new DAO on cardano. If this was the case, then the scope of this challenge was huge, because almost every initiative can organized as a DAO (instead of LLC or NGO).\n\nThis proposal is very well written, it address a real problem and offer a compelling solution, but as I see it, it was not submitted on the right challenge. ", "q0r": 3, "q1": "The proposal is focused on creating a proof of concept and on building a community for a future DAO. The team aim to submit more proposals on next catalyst funds for future development of the DAO. As such its success chances are pretty good, as it does not try to establish the organization all at once.\n\nThe plan is well detailed, and includes very specifics about the services that the project will provide, as education materials for health literacy, information and toolkits for wellbeing and day to day habits for healthier life. \n\nThe team consists of two members - a researcher and a software developer, and according to the proposal they have the needed experience, skill set and knowledge needed for a success of the proposal. ", "q1r": 5, "q2": "The proposal provide a clear milestones and deliverables on a monthly bases, that can be align with the Catalyst reporting. The proposers also provided measurable success metrics, as users traffic to their website based on google analytics data, community members numbers that will derived from discord server data and engagement based on twitter outreach. \n\nFor a proposal that is focused on community building this measurables can be useful for tracking the project and to audit the team effort.    ", "q2r": 5, "assessor": "z_assessor_2360", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2975, "q0": "This proposal does not directly meet the requirements of the challenge. \n\nThe proposal seeks to create a DAO focused on health and wellbeing. As described, the DAO will allow members to guide the direction of the content curation performed by the organization.\n\nThe Challenge Setting is for the creation of DAO tools, not the creation of an individual DAO.\n\nThe challenge setting has a key performance metric for several communities engaged in collaboration. This proposal states that it meets that requirement. Unfortunately, that is a measurement for the success of the challenge setting, not a measure for a single DAO to address the challenge. \n\nThis is a unique community within the Cardano blockchain. The proposer seeks to add people from outside of the community. This meets a core aim of Project Catalyst, expanding use cases and reaching new audiences. \n\nIn future funding rounds, the proposer can find a more appropriate category for this excellently written proposal.", "q0r": 3, "q1": "The proposer has extensive, verifiable experience in the field. In other communities, the proposer is active with similar goals for health and wellbeing of participants. The proposal lists a wide variety of sources for potential curation. They planned the idea out thoroughly, and it has excellent potential for success. There is a clearly defined risk analysis with good quality mitigation of the risks.\n\nThe proposal has a cost breakdown for technology needs and pays for 6 months of time for the primary applicant to spend full time on building the first phase of their proposed structure.", "q1r": 5, "q2": "There are ample metrics available to audit the success of this project. The proposer has listed firm timelines and usable third party analytic tools to gauge the success of the proposal. The community can measure this DAO using transparent, verifiable information.\n\nBy using the metrics of participation, the team will learn if they have met their own goals. This could help them prepare for future funding rounds to meet the later goals of their DAO that they have stated in this proposal. It will be important for future proposals that they clearly meet their goals, or explain challenges that block them from meeting those goals.", "q2r": 5, "assessor": "z_assessor_2376", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3334, "q0": "ADAwell is a an amazing project that looks to provide concrete real life value to people by creating a wellbeing community platform, with the vision of eventually becoming a DAO. I believe that even though this kind of project may not be very technology based, it should be very welcomed in the Cardano community since all kind of applications to Cardano are valuable, especially when providing direct value to the public in and outside of Cardano. This proposal also addresses the challenge setting well through its integration with the Cardano network and community building, and also its focus on letting the community request curation for specific topics. The procedure and ideas behind the project and vision are all explained well and in great detail and its easy to grasp how this platform is meant to function. Having reliable refined health care content validated by experts and in a structured manner is a really great thing, and I believe this project has a lot of potential and will be very exciting to follow.", "q0r": 5, "q1": "The proposal presents a clear-cut plan with detailed milestones for each month that is easy to follow. The team behind this project are Adalat and CHaKhan and seem to be capable of carrying out this task, however, one recommendation is that they may want to find a developer that is well versed in cardano/blockchain development when it comes to Cardano integration and building a DAO platform. It is also a bit unclear of how exactly the DAO element of the platform will be created, since there are not any technical explanations in this regard in the proposal. That said, this proposal only asks for funding for minimal resources to kickstart this procedure and they have mentioned we might see future proposals that cover further parts of this mission. Therefore, based on the budget, which is broken down clearly and mainly consist of fixed licensing costs and work for 1 person, their plan for this proposal seem very sensible. Overall, they seem passionate about wellbeing and helping people which shows that they will try their very best to create a good platform, and this is a great project to support in my opinion.", "q1r": 5, "q2": "Auditability wise this proposal is excellent, they have provided us with a variety of well thought out metrics to measure, such as numbers of visitors, requests, and community growth. Additionally, there are public channels where anyone can follow their work and updates on, namely their Obsidian knowledge base and Discord. The success KPI’s are also very detailed with exact target numbers to achieve. They have created good ways of tracking and measuring the progress and success of the project.", "q2r": 5, "assessor": "z_assessor_2448", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3771, "q0": "The team at Adawellness wants to create a trusted source of knowledge and curate accurate info in basis with toolkits(checklists,tips etc..),a database for all things health and also address for potential community requests that provide for neccesary prevention and possible treatments expressed and validated by experts.Wellness is an essential area of focus considering the effects it associates with Crpto industry in particular and having a place to address and ask for help is quintessential.Since it wants to progress into a DAO there is a lot of room for openness ,collaboration and sustainability.The project takes a steady approach with the timeliness and extraordinary caution it requires while rolling out the more personalised features of direct support to an individual.The initial rollout involves for sleep,eye and lifestyle modules curated across many resources and I would prefer this happens with proper validation from industry experts to stay upto date on the findings of research and avoid any potential misrepresentations.", "q0r": 5, "q1": "The initial rollout involves DAO formation and community development phase rolled out across a span of 5 months with sufficient budget to work on it fulltime.The timelines mentioned are realistic considering the need for slow and optimal improvements considering the risks involved.Although the initial rollout seems feasible as the team progresses into personal support systems and expands into a DAO would prefer them to take utmost caution in filtering out bad actors from infiltrating to provide improper and illhealth advices.A reputation model could be built in to identify for these and a decentralized cloud storage systems could be used to be as open and transparent for the community to check for while preserving privacy,whether if its scheduled meetings in discord or in zoom.Proper disclaimers need to be in place.", "q1r": 5, "q2": "Every curation is published on Obsidian knowledge base henceforth becomes easy to track the progress of updates along with google analytics and discord analytics which could be a used as a measure to track for community growth.The metrics for success seems well plausible within the given timeliness.Improving the quality of life is the main goal and all possible steps with accurate analytics could help push to meet the targets on time.More requests and curation of topics as the project grows are all a sign that the project moves in the right direction as intended.Would prefer to see an expanded team of curators and health specialists to be present during future proposals to indicate for strong care and growth evolving through the timeperiod after establishing the community", "q2r": 5, "assessor": "z_assessor_2479", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6198, "q0": "I believe this proposal addresses the challenge and ADAwell, if executed properly will make a huge effect on the Cardano community by giving them health advice and making sure that DAOs stay well mentally and physically. One problem I found with your plan is that having ADAwell could discourage people to see doctors because they feel they can handle their own problems. All health professionals have different views and seeing something on screen may look different than seeing something in person. A soloution to this problem would be putting ADAwell stations in medical centres so, if it's something serious than proffesionals will be there to have a look themselves. The 3rd stage is where there will be a series of challenges to help people get fit and healthy however this is very reward orientated and if there is not specific evidence on how this will help the body then going on a diet (for example) could end up making some participants very sick. This can be changed by having ideas of how to change your diet and recipes of healthy meals because dieting is very bad for your health.", "q0r": 4, "q1": "The proposal and the plan have a very high chance of being implemented successfully because of the high level of planning that the team have included and the experienced individuals on hand. It is a really great idea for a good cause and I think that it's most likely that people agree with my point. The system that the team chose for ADAwell is a dicord server but you can oly do so much as look at a person instead of all that testing you would do down at a medical centre. This, I think is not the best of choices because of the screen. Looking at a screen is very bad for your eyes and ADAwell is encouraging this yet it is a wellbeing platform. However, this is unavoidable and something that could help is monthly fun runs or yoga groups where the participants can also get monthly checkups while being outdoors, not on their phones.", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and the sucess of the proposal. The milestones provided are sufficient to evaluate the progress but will require quite a lot of time to get accurate results. Nevertheless, an experienced auditor will be required to make sure the results on ADAwells progress are right. On the first step of success it says that more than 100 views on a topic and more than 3 positive reviews however, it is impossible to know that these reviews are actually true. For all the team knows, ADAwell could be doing terribly and someone could be lying. This, I think is important as if the first step of success has happened then the team will think that it's time to move on to step 2 which will require more team members which will in turn mean that they will require more funding. A way to solve this problem is to make it a private discord server and invite people who the team trusts so the community will build at a slower pace but they can trust the success. When they have had many good reviews the discord server can become public and everyone can have access to the health information.", "q2r": 4, "assessor": "z_assessor_2790", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13801, "q0": "\nThe proposed group acknowledges that today's healthcare system focuses solely on disease and does not seek a holistic or health-optimized approach. The proposed team is working towards building ADAwell, a community and health management platform with a vision of becoming a DAO. The group aims to promote health understanding, health optimization and the collaboration of individuals. The proposed impact on the challenge is posed and described in detail, rich with 3 issues, specifically explained. This proposal is a proof of concept ADAwell. With ADAwell's full vision is to make all 3 functions work. ADAwell platform, toolkit information; Community building; From the community to Cardano DAO presented and explained in detail. I find that extremely positive. The proposed team, in addition to stating what they will do, provides a lot of detail on how to do it. Besides, the team has come up with the main indicators here. It proves that the team has precise goals, knows what it is going to do, how to do it, and that all the work will be based on those goals. At the same time, the team has introduced 3 risks in the project and has solutions to reduce risks when the project is implemented, increasing the success power of the project that the team wants to develop.", "q0r": 5, "q1": "\nThe team made a plan to implement the project within 5 months. Specifically from August: Platform launch; September: increased community engagement and number of Toolkits; October to December: increase the number of Toolkits and collaborators, expand the core team. At the same time, the tasks to be performed in each month are clearly stated. We know what work will be done to get the end result a success of the project. Next is the budget. The proposal requires a budget of $5,690. In my opinion, this is quite a small budget requirement. It is possible that the team will need more funding to ensure favorable conditions and sustainability for the work to be done on the project, with a period of 5 months. However, the team allocated the budget very well. We are told the $690 budget is used for digital tools and explained in detail. and $5,000 usage: platform, community, DAO building (promoter works full-time on ADAwell, $1,000/month) 5 months. Finally, about the core team members. According to what the group presented. We know the group has 2 members. We know each person's identity, role, skills, experience and suitability to do the work on the project. At the same time, the group also provides presentation documents about each member, and attaches links for us to know more about the history and experiences of the members that the proposal has presented. Overall, the proposed plan is very good, the budget is transparent and the members are skilled and experienced. Proposal is highly feasible.", "q1r": 5, "q2": "\nThe auditability of the proposal is very good. The team provided us with good data to evaluate this section. Starting from the fact that in this topic the team has tasked the work in very specific milestones. We know what goals are expected, and the benefits it will bring to the community and the Cardano ecosystem. We are provided with indicators to measure the progress of the project. And transparently tested on the basis of public Obsidian knowledge; through the Discord community and Twitter Analytics. Discord: Is a very interesting piece of software that can communicate by voice calls, video calls, text messages, media and files in private chats or as part of a community. Obsidian; is a fun note-taking and knowledge-management app... we have many ways to check what's been covered. In my opinion, the information that is necessary and satisfactory has been established. Proposal has good auditability.", "q2r": 5, "assessor": "z_assessor_3820", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "I am building ADAwell, a wellbeing curation platform and a community with a vision of becoming a DAO. It aims to promote health literacy, health optimization and collaboration of individuals. ", "experience": "I'm a wellness researcher. My passion for wellbeing started a decade ago with Ayurveda. I'm highly motivated with Science Communication and have a strong interest in the Creator Economy. I have 3+ years of research experience and the network in the Decentralized Science community"}