{"id": 422599, "author": "yojo", "title": "Smarthubs=more impact/adoption", "url": "https://cardano.ideascale.com/a/dtd/422599-48088", "category": 26594, "amount": 28600, "description": "It’s not clear how to use a DAO as the model and collaborative structure for ‘smart’ business development hubs interacting and operating in various countries, sharing data, tools, roles, resources", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2126, "q0": "The idea of ​​this proposal is very good that is to design a DAO model to connect localized hubs for collaboration starting with 3 businesses promoting Cardano (Suiss, New Zealand & Canada) to distribute & decentralize the work to onboard organizations. Work that has begun and is ongoing in Geneva is also being done in New Zealand and Canada promoting Catalyst & Cardano to local communities and businesses. Results were seen in Fund 9 with proposals from more organizations with which the centers were involved. There is clarity in the problem, the solution, and the connection of both to this challenge is clear. The aim of developing the Cardano business development hub concept was to provide a DAO of “smarthubs” that could perform a specific Cardano ecosystem-building role – driving awareness and adoption of blockchains. The organization is currently based around the world. Smarthubs has the following tasks:\n- Raise brand awareness, develop trust, and stay in touch until potential organizations are ready to make proposals in Project Catalyst or participate independently in the Cardano ecosystem.\n- Support collaboration between the business people, engineers, developers, and designers of the Project Catalyst organization and community.\n- Provide the means to create more transparency, traceability of results, and organizations with real-world impact participating in the Cardano ecosystem on social and environmental challenges.\nIn addition, the proposal reflected the potential challenge in many details and established several measures to overcome/avoid them.", "q0r": 5, "q1": "The project roadmap is divided into 2 phases: Phase 1 - Defining Smarthub functions (8 weeks) and Phase 2 - DAO model design (8 weeks). Each phase is broken down into activities very clearly so we can visualize how the process will go. The plan is indeed optimal, there is a good chance that this proposal can be successfully implemented in the manner described by the proposals. Next about the project team, the project team is very well presented, we know the names, training areas, and LinkedIn links of the team members, creating strong security and credibility strong in their work. The references, the organizations involved, the team members, and the knowledge of the catalysts and Cardano all represent a high probability of a successful proposal. And finally the budget, the total required budget is $28,600, it is distributed in 2 phases of the roadmap. We know what the requested amount will be used for, so the requested amount is a perfect fit. Based on the information provided I see no problem if the proposal is funded", "q1r": 5, "q2": "This project has enough information to include a roadmap and milestones required for a successful audit. The proponent has also provided some metrics and KPIs that we can use to track the progress of this project such as:\n-Participation with the Cardano community and quantitative and qualitative participation\n-Identifies globally applicable use cases and how they connect smarthub(s) and DAOs - as evidenced by the documentation accompanying the project closure report.\n-Regular documentation of progress, tracked using Kanban with process and practice\n-Time limit for completing meetings\nRegarding the final product that is expected to be the success of this project, I believe that complete and satisfactory information has been established. What we really need is to set up this tracking, such that these progress updates will be communicated to the community via means like Discord, Telegram, or the project's general website.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2928, "q0": "Smarthubs DAO can be a great model for onboarding exiting organizations to Catalyst and Cardano. \n\nWhile it is not addressing the challenge directly, as the challenge goals are to build tools, services and infrastructures for DAOs on Cardano, and not for building new DAO, the proposers did plan to \"present the model back to Project Catalyst in 3 months time with scopes for tools needed to enable this DAO and many others\". Publishing the model, assuming that it will be successful, can be of value to other DAOs on Cardano, beside the smarthubs DAO.\n\nThe team should make an effort for making this model report accessible and helpful as a general model for building DAO on Cardano. Creating awareness for this publication is necessary for this proposal to address the challenge, even though it is not in the hart of this proposal project. ", "q0r": 4, "q1": "The team has been shown to be worthy of the community trust. As they have already completed previews proposals and are working in collaboration with other projects and people from the Catalyst community and Cardano ecosystem. \n\nThe plan provided is well detailed, and includes research needed for successful outline and implementation of the smarthubs DAO model. The fact that the plan includes also examination of potential collaborations with other Project Catalyst community platforms and tools reassure the value that this proposal can bring to Catalyst.\n\nThe budget is reasonable, and the breakdown for both deliverables and team members compensation could be helpful for tracking the proposers use of the funds. ", "q1r": 5, "q2": "The milestones, timeline and measurable are clear and well designed. The proposers plan to record the work meetings and document their progress. Publishing those recording and documentation could be useful for auditing and tracking the project progress. ", "q2r": 5, "assessor": "z_assessor_2360", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4420, "q0": "The proposal solve the goal set in the Challenge, design a DAO model to connect localization centers for cooperation. The team identified the problem to be solved as clearly defining how to use the DAO as a model and collaborative structure for 'smart' business development centers to interact and operate in different countries, and share data, tools, roles, and resources.\nIn my opinion, this proposal adds value to the Cardano ecosystem because it is originally built on the Cardano blockchain platform, the main purpose of the team in developing the Cardano business development center concept is to provide a DAO of “smarthubs” that can perform the role of building the Cardano ecosystem. As such, the Cardano ecosystem is the foundation for DAO development and is also the object of the positive influence of this proposal, which is also the clear value that this proposal brings to Cardano. In terms of the potential of the proposal, I think that if successfully implemented, this proposal will have a great impact on the community, it has a lot to do with business development centers, regional businesses, and even the country. Therefore, this proposal is fully scalable and solves many challenges in the future. If the scale is further expanded, the impact will be much larger accordingly. But that takes a long time to come (distant future). I strongly agree with the impact of the proposal, it is not only valuable in the present but will likely have long-term value in the future for the wider social community if successfully implemented. I vote 5 stars.", "q0r": 5, "q1": "I find the author and team to have extensive experience in business and skill development, being a longtime Project Catalyst community member, Cardano ambassador, reputable founder, PA, entrepreneur, etc. .. The team also provided a full explanation of the problem, documents related to the proposal, related to what the team did at Fund 7, Fund 8 (post links, websites, .. .) I strongly support the disclosure of the identities of all team members via the Linked social network link, because from there it will be convenient for the community to look up the members' identities and verify them. feasibility of the proposal and further affirms the credibility of the team (who already has prestige and experience on Catalyst). It is very commendable that the team has been clear and very specific about the detailed list of members (not all proposals will work). The number of core members in the team as I understand it is 3 people, these are the key members, and the team may also have other unidentified collaborators.\nThe budget is divided into 2 phases (each phase contains the work to be done). I find it reasonable for the purpose. The team lists in detail the important tasks that need to be done, which clearly shows professionalism and meticulous attention to budget balance. I am very pleased with this listing of the work at each stage, through which the community can further strengthen confidence in the feasibility of the proposal. The fact that the team presents the budget clearly and in detail but without being so verbose makes it completely understandable to newcomers in the community. The method of calculating the wages to pay the salary of the team as proposed above is the calculation of the hourly rate - this is consistent with the calculation method of the large corporations in the world today - it brings accuracy and effectiveness. That's my subjective opinion on the budget breakdown. I have a question for the team if it hasn't been funded by Catalyst in Fund 9, will the team continue to work on this proposal? And what other sources of funding does the team have to ensure the implementation of this proposal (perhaps the budget comes from contacting support from other organizations)? I want to know the obvious feasibility of the proposal.\nThe plan and implementation method have been fully stated by the team in a very scientific and logical step-by-step. It is divided into 2 phases, each phase consists of smaller work execution steps. This is one of the important factors in clearly defining the feasibility of the proposal.\nHere, I consider the necessary resources for implementation, I divide them into two main resources, which are financial resources (mentioned in the above budget) and human resources. Regarding human resources, with the key members having professionalism and experience, I believe the proposal will be successfully implemented. However, as the team shared, some members are also working on another proposal in parallel with this proposal at Fund 9. I would like to ask if this reduces the quality of work on this proposal. shoot it? In my opinion, the team can demonstrate to the community that even though there are currently members implementing another proposal, the human resources are still sufficient for the successful implementation of this proposal. It is the best way to create more trust in the community, thereby increasing the feasibility of the proposal. For this proposal to be implemented successfully, I think it needs the participation of many members, not just a few key members. So can the team share more about who (collaborators or other staff) could work with the team to develop and implement this proposal? My advice is that the more the team shares publicly, the more trust the community will gain. That is favorable to the feasibility of the proposal.\nIn terms of technique, technology and language used when implementing the proposal. This is a collection of high-tech technologies: Blockchain Cardano, DAO, programming languages, writing Dapps, creating tokens, combined with governance techniques, information dissemination, etc… I think it is mainly used. built by core team members who already have many of the skills I just mentioned. In addition, such a large prestigious team can completely mobilize external support to propose to be implemented in the best way. I strongly support this. That is the basis for me to believe that the team will do a great job when implementing the technical aspect of the proposal implementation.\nThe team also stated quite clearly the risks that may be encountered when implementing this proposal: Risk of differences in the system when combining businesses…; Risk of time difference… - accompanied by 2 satisfactory solutions to prevent 2 risks. Here, I add a third risk: Ada slippage - will affect the budget of the proposal. We know that the digital currency market is at the beginning of hibernation (devaluation of digital currencies), so Ada may depreciate when the team receives from the Catalyst fund, then the team will face the problem of a lack of budget to implement the proposal. So my advice is for the team to take a close look at Ada's slip-in budget to make the budget requirements in the proposal appropriate.\nThese are just my positive comments, the team can review and adjust this proposal. I strongly agree with the feasibility of the proposal. I vote 5 stars.", "q1r": 5, "q2": "The roadmap of the proposal is presented by the team in 2 phases with a duration of weeks. This is a reasonable roadmap and milestone. The work steps that need to be performed in each phase are very specific and in a step-by-step sequence - containing all the necessary information. I think it would be better if you try to associate this milestone with a specific month in a year (eg January, February,... - this is just an example). If the team can do so, it will be much easier for the community to conduct a review of the proposal's transparency and auditability.\nI have a question when I don't see a team of performance indicators (KPIs) and key metrics. Did the team present these two elements? We all know the role of KPIs and key metrics in auditing. This makes it more difficult for the community to evaluate and audit the proposal. I consider KPIs and key metrics to play a certain role in demonstrating the transparency and auditability of the proposal. So my advice to the team is to quickly add KPIs and key metrics. Then this proposal will have much higher transparency and auditability.\nIn terms of \"what the success of this project looks like\", the team had a clear criterion for measuring success: Develop a launchable DAO model to start a new experiment. Thus, the definition of success is not tied to specific numbers and is more about theory and practical application. I am satisfied with this definition of success, it makes sense. Throughout the proposal, the team clearly described the problems and solutions.\nAs such, I have provided comments on the auditability of this proposal. We hope that the team will consult and pay attention to the addition of KPIs and key metrics. I agree with the auditability of the proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5426, "q0": "As smart business point are blooming everywhere, Having one in blockchain as collaborative structure sounds interesting.  As we are not clear yet how to use DAO as the model to collaborative in business development hubs which let users to interact with others and use it for operating in various countries, sharing data, tools, roles, resources. As solution to to proposer explains building DAO model that can connect localized hubs for collaboration. \nAs trails starting with 3 countries and promoting Cardano to distribute & decentralize the work to onboard organizations. I strongly agree with proposal and This proposal effectively addresses the challenge.", "q0r": 5, "q1": "Whole Timeline and roadmap presented by proposer has explained into 2 phases taking 2 months for each phase. They have explained phases  Defining the Smarthub and designing the required DAO. They have presented detailed budget breakdown and same followed explained in phases. Research & analysis & preparation  and required hours of work and its its fees. The team of 3 and founder Nori Nishigaya has tremendous experience and has good track record of delivering projects \non time. I strongly agree with proposal having all smart point in one, Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "As proposer will be providing details about key deliverables on total engagements on Cardano community, regular progress reports, documentation of progress and all will be available in  public domain to track the progress and challenges and status of the project. As they will be updating status and answering the enquires till 12 months , With all above metrics and KPIs I feel it can be audited easily. As there SDG goals will create impact after launch and attract and bring more users I strongly agree with proposal and \nThe information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2702", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 6628, "q0": "A DAO of smarthubs will be developed to support the growth of the Cardano ecosystem by providing a common, professional onboarding experience and support for organisations joining the ecosystem. The smarthubs will offer a variety of services to organisations including raising brand awareness, developing trust, providing resources and support for collaboration, and tracking the real world impact of organisations joining the Cardano ecosystem. I believe that this project would add value to the Cardano ecosystem.", "q0r": 5, "q1": "The team is a mix of experienced business developers, digital marketers, engineers, and designers with experience in blockchain technology, local hubs for business and entrepreneurial development and onboarding local companies. They have a good understanding of the technology, the ecosystem, and the communities. And importantly, they have a track record of successful community building and business development in the Cardano space. They have been working together in the Cardano community for more than 2 years, and are the same team behind the successful Geneva and New Zealand Catalyst & Cardano business development hubs, which were the first two smarthubs to be piloted. They have a deep understanding of the risks involved in combining local businesses with a DAO model, and have a team in place that is well equipped to mitigate these risks. Strong communication channels and protocols are in place to keep everyone on the same pageand they have a broad range of advisors and supporters who can help them to navigate any challenges that may arise.", "q1r": 5, "q2": "The Cardano community will engage in a participatory process to develop a vision, mission and values for the DAO. This will involve identifying use cases with global applicability and how they connect the smarthub(s) and the DAO. Regular documentation of progress will be maintained, tracking using Kanban with process and practice, challenges and opportunities being updated regularly based on the topics described in the plan.\n\nSuccess for this project is developing a DAO model that can be used by businesses worldwide to demonstrate how they can work in a collaborative way. A metric could have been to measure the adoption rate of this model to measure its success.", "q2r": 4, "assessor": "z_assessor_2823", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Design a DAO model to connect localised hubs for collaboration starting with 3 businesses promoting Cardano (Suiss, New Zealand & Canada) to distribute & decentralise the work to onboard organisations", "experience": "Team leads comprise 90 years experience in business development with additional complimentary skills and expertise. F7: Geneva Business Hub proposal. Very active in Cardano & Catalyst, operating local business hubs in their countries with a focus on Catalyst for the last 6 months"}