{"id": 422581, "author": "jpg.store", "title": "JPG DAO: User-First NFT Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/422581-48088", "category": 26594, "amount": 63000, "description": "The NFT Ecosystems across chains have been growing rapidly, yet marketplaces are mostly run in a centralized fashion without user input or control.", "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 25, "q0": "I agree that NFT Ecosystems across chains have been growing rapidly, yet marketplaces are mostly run in a centralized fashion without user input or control. That’s even more interesting to hear these words from one of such centralized services - JPG.Store. That’s why it’s even more valuable when successful project wants to decentralize. Like Cardano staking was run by federated IOHK-owned nodes in the past, and step-by-step gave it’s block producing function to the SPOs, centralized services can decentralize with the help of DAO tools. ", "q0r": 5, "q1": "Taking to account the  experience and plan presented it is highly likely this proposal will be implemented successfully. But the plan is very brief, I would advise you to describe it in more details. That’s why I’m putting 4 stars, and if I wouldn’t be aware of JPG.Store and your extensive experience I would put maybe even less. ", "q1r": 4, "q2": "Many of us in the Project Catalyst used JPG.Store and you were present at the Consensus event recently. Your reputation speaks a lot in favor of progress and success of this proposal, but still I think you could make the budget in more details. You say that you will be tracking these milestones internally and inviting our beta testers to provide feedback on usability and functionality. But could you add more information about the metrics? In case your proposal won’t pass this time, maybe you can add this in the next Fund. That’s why I put 4 stars and not 5\n", "q2r": 4, "assessor": "z_assessor_2028", "no_vca": 23, "ne": 2, "ng": 14, "nfo": 7, "vca_o": 1}, {"id": 1422, "q0": "Marketplaces have been a key piece of centralization with generally large revenue streams that can quickly decouple incentives from the users of their platform to the investors in the company running the marketplace. \n\nThe approach seems sound and covers the bases and prime examples that other projects will need to follow in the future. Token Creation will allow them and their legal team to review and suggest their learnings on how to create Tokens in the US jurisdiction which has been a large road-blocker for many. They also cover the issue of Token Staking and the Governance structures that need to come from the staking mechanic. With these proposal submissions and voting processes, we will likely also learn how to engage with a very active community at scale to help set a high standard of execution for other DAOs in the ecosystem.\n\nWith the DAO Challenge specifically focusing on making Cardano the go-to example for building a DAO, having the #1 Marketplace set the example for community engagement, well beyond what they have already done, seems to be a clear signal to broader blockchain communities. I believe the impact of having a well established company and team work on this is a great use of Catalyst funds specifically related to maximizing impact. Due to the large community, proven track record on transparency, collaboration, and execution I give this proposal a 5/5 rating.", "q0r": 5, "q1": "JPG Store and Blake (Founder) have been very open and engaged with the broader Cardano community as they have launched and built the marketplace. From hosting Twitter spaces addressing key concerns, often taking the feedback to reverse a decision they may have made too hastily even, shows me a level of empathy and engagement needed in building the initial framework for a DAO. \n\nFurthermore this direct access has given Blake a great name and the company rocketed to the #1 Marketplace on Cardano. With this broad of a reach (90%+ marketshare) it’s likely the largest active community using an app on Cardano. They have reported ~2M unique active users to their site since their launch in January and consistently deliver new features with a rigorous engineering approach that often involves security audits by third party collaborators. \n\nThe milestones and team resources needed for this project are well within the expected timeline and needs for a project like this. \n\nA concern that I have seen from some in the community around existing (profitable) companies receiving funds seems unwarranted to me. The feasibility of this project being delivered to a high standard for the Cardano community is much higher because of their profitable status, along with excellent track record of product iteration and delivery. For these reasons I give this proposal a 5/5 rating. ", "q1r": 5, "q2": "Auditability is a key part of any Catalyst project and from my own experience it’s largely based in a projects further visibility in the social communities and Cardano user experience. The tactical implementation of providing visibility into the outcome of proposals is mostly a reporting and community update role, and I wish there would have been more details outlined here in how they would engage and share results with other teams trying to build out DAOs. \n\nUpon further personal discussion and encouragement to provide deeper docs - the JPG Store team has committed (review proposal comments) to providing a technical writeup and relevant engineering details. In the future I would like to see a bit more depth here for deliverables and accountability but also realize that with such an unknown undertaking this can be quite fuzzy to commit to. \n\nFinally the last metric that could have improved this proposal and the only reason I am giving a 4/5 rating, would be a measurable milestone aligning with the Challenge parameters that can be audited by the community. I would suspect that the best Challenge Key Metric for this would have been either Number of Communities engaged (NFT Projects for example) or Amount of ADA coming from DAOs transaction fees. These would have been fairly easy for JPG Store to model and predict based on current usage data. Overall this proposal should be fairly easy to audit as a “Good use of funds” or not with such a high profile proposer.", "q2r": 4, "assessor": "z_assessor_2241", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2942, "q0": "jpg.store is a leading NFT marketplace in Cardano community, the proposed DAO would certainly have a big affect in the NFT ecosystem, and will have a big number of community engage. Since there are already high TVL on it's NFT marketplace, the transaction fees related to this proposed DAO will be huge too, with focus of community driven in the CNFT space, this proposal address the challenge well.", "q0r": 5, "q1": "The develop team from jpg.store is verified through their own product, the NFT market, they have great experience with NFT smart contracts for trading and auctions, creating a DAO, making a new native token on Cardano, managing the wallet voting in theory would be no problem for them.", "q1r": 5, "q2": "The proposal lined out 6 weeks scheduling work, the first week structure development can be audit through a public report, the development and implementation can be followed by weekly update report, and the final testing and auditing report can be shared with public too, as for the voting token, its policy id can be easily verified too. I'm confident that this proposal have enough information for the progress auditing.", "q2r": 4, "assessor": "z_assessor_2362", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3235, "q0": "This proposal would create a DAO to manage the main Cardano NFTs marketplace, launched in November 2021, its team has never stopped building new products and features since then, and it feels it’s time to give users and stakeholders their say in jpg.store development. Apart from potentially being the main Cardano DAO in the near future, this proposal doesn’t seem to perfectly align with the challenge because it doesn’t create tools or facilities for DAOs to establish on Cardano, moreover, it doesn’t introduce innovation or resolution to DAOs problems like true decentralization, whales or voting power distribution. However, JPG DAO could be seen as an example of successful DAO even from other blockchains, so that communities from other chains might choose to establish their DAO on Cardano, moreover, in the comments section, jpg.store highlighted that they will share a technical writeup of how they implemented the voting process and other relevant engineering details to make easier for other builders to launch their own DAO’s, so I agree that this proposal addresses the challenge.", "q0r": 4, "q1": "I strongly agree that this proposal will be successfully implemented, the timeline is short and concise, the funds requested seem reasonable, the team involved is talented and motivated, and their skills have already been proved several times during jpg.store improvements and new features delivered in only a few months.", "q1r": 5, "q2": "I strongly agree that this proposal provides me with enough information to audit its progress and success. Different modules of the smart contract involved will be separately and together tested, users’ and stakeholders’ feedback will be considered during the production process. Their final milestone and success parameter is to have a functional and active DAO with a voting pool of 50%+ users, which can be easily checked by the community.", "q2r": 5, "assessor": "z_assessor_2419", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 3641, "q0": "The proposal has been presented in the correct challenge, since the goal is to build a Decentralized Autonomous Organization (DAO) for the popular NFT marketplace known as JPG Store. The problem statement is presented as marketplaces are run in a centralized fashion, for which the solution proposed is to create a DAO for their own marketplace so users can have a voice in the direction of the store. The solution is divided in three main pillars, the creation and distribution of a token representing the share in the DAO’s decision making, the governance platform where users will be able to present proposals and vote and a system of tokenomics to encourage the holding of the token itself. While the proposed solution is within the expected boundaries of a DAO’s working mechanisms, is a little worrying the lack of thought put into the risk management. Instead of analyzing the risks, they stated in the proposal that: “We are very confident in our ability to create the project we have described with the biggest challenge being adoption and usage of the end-product.”", "q0r": 4, "q1": "The team provides some information regarding the timeline and the budget breakdown, although in my opinion given the amount requested this information is lacking. The timeline and key milestones is divided into four categories allocating between one and two weeks to each one. They state that three employees will be working on this project, two engineers and one designer but these people have not been identify yet. Also the team page in their website is all anonymous people without any information about their LinkedIn or actual work history. Regarding the budget breakdown they only provide a high overview of employee costs and “overhgeards” for “unexpected delays” among other things. This section should provide more detailed information on how the budget was put together and how it will be spent.", "q1r": 3, "q2": "The proposal doesn’t provide too much information about how the project can be audited by the community. Since this will be developed in-house the progress can’t be verified transparently with Github for example. They mention inviting beta testers to provide feedback but this point is not explained further or included in the timeline of the project. ", "q2r": 3, "assessor": "z_assessor_2465", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4231, "q0": "The \"JPG DAO: User-First NFT ecosystem\" proposal addresses the challenge by building the first ever user driven NFT marketplaces  (incorporating user input & control) via DAOs. This will make the Cardano go-to choice when building DAOs. Users will have the ability to create proposals and vote on them and break the centralized pattern that hinder the growth of Cardano NFT ecosystem. The proposer team has addressed adoption and usage of end products (DAO NFT marketplace) as the main risks. Also as a recommendation to this proposal, they should also consider other risk possibilities ie. susceptibility to hacking and slowness in decision making. The project has high potential to scale as the  jpg.store community size is large enough to make the DAO adoption matter and create a potential success DAO user case. The team has foresee the future direction of jpg.store that it should empower its users, stakeholders and collaborators to have voice and control how they want the jpg.store community to evolve. Should the JPG DAO proposal be implemented successfully, many other NFT communities would like to follow suit. This will boost DAO transaction fee and bring Cardano to the forefront when it comes to building DAOs. ", "q0r": 5, "q1": "Given the plausible timeframe of 6 weeks, the schedule is quite tight but achievable. The majority of cost is related to employee costs ($8500/ week) and the overheads cost  ($2000/ week) already include unexpected delay, hosting, marketing cost and tutorial development. Although the proposal has requested quite a high amount of $63000 in implementing this project in the span of 6 weeks, it is understandable that they deploy 3 staff and the number of working hours per week per person makes sense.  I believe that it is highly likely that the proposal can be implemented successfully given the timeframe and their dedicated 3 team members (others are working on ad-hoc on the project). The team does not expect to return to future Catalyst funding round. One thing that is quite a major drawback of this proposal is that by looking at team members profile on their official website jpg.store, most team members have specified only their twitter profile with no professional background information. The feasibility of this JPG.store proposal could be improved if the team would be more transparent on which members are deployed on this project and elaborate more of their core functionality development in their milestones.  ", "q1r": 4, "q2": "It is commendable that they would invite the beta testers to give the feedback on the functionality of their JPG DAO NFT marketplace once it's ready. The proposer team should not only find ways to track & monitor project progress internally but also communicate and report back to the community if they have achieved their KPIs. The team mentions proposal creation and active voting pool of > 50% user on approved proposal as KPIs. This exhibits that the jpg.store truly cares in delivering the impact of this proposal which is to integrate the DAO concept to the NFT marketplace and that means that the community participation in voicing opinion through voting does matter. The team could decide on their preferred channel of reporting back to the Catalyst community once funding is received via bi-weekly meeting or after townhall breakout rooms. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Staying true to the ethos of Cardano we want to build a DAO to enable our users, stakeholders and collaborators to have a voice and control over the direction of JPG Store going forward.", "experience": "The team at JPG launched the marketplace in the second week of November 2021. Since then JPG has pushed to create a user driven marketplace servicing all NFTs on Cardano with a strong development team of 10+ engineers driven to create on Cardano."}