{"id": 422741, "author": "muesliswap", "title": "Secure off-chain community voting", "url": "https://cardano.ideascale.com/a/dtd/422741-48088", "category": 26594, "amount": 51750, "description": "Voting protocols with astonishing security properties have long been a topic in cryptography. For Cardano off-chain voting systems no implementations of such perfectly suited systems are available.", "f6_no_assessments": 9, "f6_rating": 4.814814814814815, "videos": [], "media": [], "f6_assessments": [{"id": 27, "q0": "I agree with proposers that right now in Cardano there are neither off-chain voting systems, nor implementations of such systems. This proposal seems to be able to enable the formation of DAO structures for many projects in the ecosystem. \n", "q0r": 5, "q1": "The team behind this proposal is very experienced - OpenSwap Technologies - created MuesliSwap, one of the biggest decentralised apps on Cardano. I used it personally several times. Moreover some team members have in-depth understanding of cryptography and deeper insight into the theoretical research that has been conducted on voting systems. This is very important as nowadays many people talk about DAO, many people want to earn money on DAO, but few people really understand cryptography and the technical aspects. ", "q1r": 5, "q2": "The budget of 51,750 USD is small comparing to 1 million USD of total budget. What I like is that budget is also written in details, which will help the aduit of this proposal if it’s successful. The team says the development will be open source so it will be publicly observable via GitHub and everyone with technical skills will be able to track the progress. ", "q2r": 5, "assessor": "z_assessor_2028", "no_vca": 26, "ne": 0, "ng": 15, "nfo": 11, "vca_o": 1}, {"id": 2896, "q0": "I strongly agree that the proposal effectively addresses the challenge head on. The proposal communicates a solution to make DAO decision-making mechanisms more efficient. The OPEN-SOURCED nature of the proposal means that prospective organizations will have the tools necessary to thoroughly examine the features available on Cardano. These tools to organize community actions do not yet exist on Cardano. The proposal also took the time to highlight all the hallmarks of a person-centered project by putting emphasis on privacy, verifiability and many other factors important to the human users of these types of tools. This proposal is exciting. \n\nI want to highlight that the proposal’s communicated scope means that it will not DIRECTLY satisfy one of the campaign measures to increase the amount of transaction fees coming from DAO actions. But this should be celebrated.  And it should be noted that it can actually lead to way more participation, way more opportunities to vote, and therefore way more transaction fees (indirectly) related to DAO activities. \n", "q0r": 5, "q1": "Based on what the proposer has communicated I strongly believe that the proposal is likely to be successfully implemented, and that the proposer has ample ability to solve the problems identified. The proposer identifies the type and number of team members that will successfully implement the project, and shows their relevant skills and experiences. There is a comprehensive budget outline that is broken out into appropriate terms that seem reasonable to achieve the goals. The proposal gives us a very ambitious timeline to complete the work (three months), but I believe the team is more than capable of delivering on this for the community. The proposal takes time to clearly explain the technical aspects that are crucial for implementation, all of which will be shared openly with the community. Finally, the proposer provides more than sweat equity, but informs the community that the team will also contribute monetary funds towards delivering on this project. It is highly likely that this proposal will be successful and bring real utility to the Cardano community in a short order of time. ", "q1r": 5, "q2": "I believe that the proposal provides me with enough information to assess the progress in attaining set goals. The proposal does a great job if reinforcing the fact that the technical development will be observable and open sourced for the community to audit and even re-use. This is great. It goes on to explain that the findings from research phase will also be shared, and a survey conducted. This makes the entire process responsive to the inputs of the Cardano community. With that said, the proposer does not offer me a clear way to measure the targeted problems against the desired outcomes. But perhaps this is because there isn't such an elegant solution currently on Cardano. ", "q2r": 4, "assessor": "z_assessor_2358", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4591, "q0": "The proposer makes a compelling argument for the value of off-chain voting solutions, particularly an open-source one. Even if off-chain voting isn't the answer for every governance model, having it as an option for DAOs will likely be valuable. \n\nWhile the Impact statements are sufficient as is, a few minor details could be improved. \"Astonishing security properties\" in the problem statement is a vague statement. Astonishing in what way? Good? Bad? Perplexing? I'd also like to see a deeper exploration of the need for both verifiability and receipt-freeness, since on the surface level those two goals seem to be at odds with each other. It doesn't need to be technical, but a 10,000 ft. view of how one might allow a vote to be verified for the voter, but not verifiable by a third party would be illuminating. \n\nFinally, while I appreciate the team's confidence--and they do have reason to be confident given their history--I am a little surprised to see no risks assessed for the project. There's no need for false modesty, of course, but voters may wonder if the proposer has a realistic appraisal of the situation, particularly if they're unfamiliar with the team's work. That said, the proposer's commitment to finishing the project even if it runs over budget is admirable.", "q0r": 5, "q1": "MuesliSwap is one of the most well-known dApps on the Cardano blockchain, which in turn served as a proof of concept for what Cardano could do. Needless to say, the dev team has built up a reserve of good will when it comes to delivering projects. \n\nSince this project is a bit of departure from their DEX-based work, however, I'd like to see a little more information about the team's specific human resources both when it comes to cryptography and how the team (will all 9 developers be working on this?) will be applied to specific tasks. ", "q1r": 4, "q2": "The proposal has clear deliverables in the form of a survey paper for the research phase, with Github commits serving as KPIs for the development phase. \n\nA lingering question provoked by the answers: since voting systems aren't an exact science, how will the team prioritize and incorporate different types of feedback when choosing the voting system they're intending to build? Admittedly, this may not be an easy question to answer at this phase, but any details the proposer is able to provide could be helpful. ", "q2r": 5, "assessor": "z_assessor_2564", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5038, "q0": "The objective of the MuesliSwap Team proposal is directly inline with both the challenge question and Cardano as a whole. The ability to demonstrate a secure and verifiable voting mechanism has incredible potential far beyond just Cardano. The protocol described in the proposal would be a very valuable tool for the ecosystem that does not currently exist. ", "q0r": 5, "q1": "What the MuesliSwap Team has delivered to the ecosystem so far has been impressive and the team has shown dedication to the community. Based on the description of their development team and after reviewing their GitHub, I have confidence they can deliver the proposed protocol. \n\nThe budget has been thoroughly laid out and while the timeline does seem ambitious, the team sounds confident in their ability to keep to the outlined schedule. ", "q1r": 4, "q2": "With open-source information being so important to the core values of Cardano, MuesliSwap's sharing of information will be so vaulable to our ecosystem. The ability to audit this project via MuesliSwap's GitHub will make verifying progress straightforward. ", "q2r": 5, "assessor": "z_assessor_2664", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5315, "q0": "With every Catalyst fund that passes, I expect it to be the last one using a fully centralized sidechain and mainly manual processes relying on Google docs and Telegram troubleshooting. It has long been argued for by various community members that we need a governance token and a new open source, decentralized tool-kit, not just for the Catalyst process, but any DAO creation or community. Right now, we see some budding DAOs like Gimbalabs and littlefish emerging, and MuesliSwap plan to create the open-source off-chain solution specifically tailored for this kind of process. In my opinion, this comes at the right time, as MuesliSwap have proven themselves with their order-book style DEX that has proven more robust and user-friendly than many AMM-style alternatives. Throwing their experience with complex smart contract and on-chain development into the ring is a great place to start, even if the end result needs more teams to build on it. As far as our own DAO tooling is concerned, this hits the nail on the head for this Challenge Setting. Massive kudos, please build this!", "q0r": 5, "q1": "This proposal is presented by the MuesliSwap team and their backgrounds and external links are provided. Nobody would have any doubt I think that they have the technical skills to build a Community Voting Tool, which should be orders of magnitude easier than a working DEX. The budget is broken down with a lot of detail,  but mainly consists of two parts, research with 150 hours at 75 dollars per hour = 11,250 USD  and development 540 hours = 40,500 USD. I also find it amazing that high quality teams like MLabs and Muesli can offer their work cheaper than many totally unproven proposals with white label development or freelancers, but if this is the case then I think it is great for us. Everything provided in this proposal makes me think it is very, very likely to be successfully implemented, and as it is open source others will have a chance to make it even better. ", "q1r": 5, "q2": "It is encouraging that although successful with their own project, MuesliSwap are inviting the community to provide feedback and provide sufficient mechanisms and time to hear more stakeholders about their solution. After the 150 hour research phase the team will publish the findings in a \"survey paper\", sharing their initial ideas about possible mechanism designs. After that an evaluation for implementation will be discussed pro/con style. This sounds reasonable and a great way to gradually share findings and progress. As the team is exposed via their DEX, social media and interviews with the community, this information and the rest of the proposal provide enough ways and info to audit the progress and hopefully result in a fruitful, back-and-forth implementation process instead of a \"take it or leave it\" approach by many development teams who prefer to go it alone.", "q2r": 5, "assessor": "z_assessor_2688", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6183, "q0": "DAO (Decentralized Autonomous Organization) is a decentralized autonomous organization, by applying rules coded in code, we can operate independently without the intervention of People. The DAO makes it easy for members to access, verify certificates, and participate in organizational decisions. DAO is growing and expanding in many fields. Based on that, the team's Proposal was given the idea: Develop an open-source, open-chain solution for conducting Cardano community elections allowing the establishment of a structured DAO for multiple projects in the ecosystem. thai. Thus, the issues proposed by the team are consistent with the goal of the Challenge: to provide tools and improve the operational efficiency of the DAO. At the same time, the issue raised has also solved some of the Challenge's questions: open source chain to conduct elections, increase DAO tools (off-chain), attract Cardano users. Thus, your proposal has been towards Developing solid, quality, reliable and sustainable infrastructure, expanding infrastructure and improving technology to provide modern energy services. and sustainable for all, empowering and promoting social, economic and political inclusion for all. Therefore, the proposal can be scaled up in the future to bring positive benefits to the community for sustainable development. This concept proposal bridges the gap between the theoretical results and the respective implementations developed specifically for the Cardano ecosystem (i.e. participation via Cardano wallet). All resulting tools will be made open source, with such infrastructure essential for a community-managed ecosystem that is thriving as it enters a new era of the platform. truly democratic and decentralized, while aiming to bring the best features of the voting mechanisms known to cryptographers (and in many cases the best they can be) into the Cardano ecosystem. This also allows any project with open source access to implement high-quality voting which will give a huge boost to the community governance of many projects in the ecosystem. Cardano <3 DAO and DAO <3 secure election. The way of bringing ideas, introducing the positive effects of ideas to the sustainable development of the community, is logically argued by the proposed group. In the process of implementing the idea you determine that there is no risk. And the reason given by the team is: having a large development team, not having to face the risks of leaving developers. However, I would like to have you explain more about the security of the DAO that you have done. I have also seen DAO-like community governance development also part of the MuesliSwap roadmap so the team is very interested in developing quality solutions towards the development of Cardano DAO.\nI rate: 5 points\n", "q0r": 5, "q1": "The proposed team has determined the timeline for implementing the idea according to the characteristics of the work (research and development timeline). This timeline is suitable, very Logical and ensures the success of the proposal (all products put into practice go through the research phase). You also presented the goals in the work process clearly, research time (1 month), Development (2 months). Specific solutions: During the Study, the group will draw conclusions by reviewing existing works in this area. We will then evaluate the suitability of the various methods for a specific use case as a Cardano community voting solution and publish a paper outlining our results. Development time implementing the results of the research phase will be documented through open source repositories. This makes the implementation completely transparent and progress is immediately observable. The development will be publicly observed through GitHub. The Cardano Voltaire Era is all about turning the Cardano Blockchain into a self-sustaining system on a global scale. With the development of an off-chain voting solution, the proposal will greatly contribute to efficient and secure governance at the internal project scale, the success of the proposal makes it possible for many other projects to reuse. the team's open source code or even extend it further. In order to realize the idea you have requested to sponsor $ 51570, less than 2% of the total budget, this is appropriate in my opinion. Besides, the Proposal has a detailed and transparent spending plan. Research Period: 150 hours - 11,250 USD; Stage: Development: 540 hours - $40,500. There is no budget contingency plan. The MuesliSwap development team currently consists of 9 developers. There are specific assignments for each member, experienced in different fields, most of them are longtime Cardano community members. Authenticate identity at https://github.com/MuesliSwapTeam.\nI rate: 5 points\n", "q1r": 5, "q2": "You have defined a Metric that ensures transparency throughout the entire research and development process by writing a survey paper; The development will be publicly observed through GitHub. Answers, Survey Paper, Open Source Development. Easy to check information. Specifics: After the research phase is over, the proposed team will publish its findings in a survey paper, detailing possible mechanism designs, and assess their relevance. to implement as a Cardano community voting system and interpret the ups and downs of each potential solution. I am confident that any further input from the many dynamic and experienced Cardano community members can then be taken into account when deciding on a specific solution and planning the details of the remaining implementation. Once the development phase begins, the proposal will have an open source repository on GitHub so that the community can publicly monitor the progress. With the development of an off-chain voting solution, it greatly contributes to the efficient and secure governance of the project internally, but many other projects can reuse the open source code or even extend it. it more. This is a great thing when you provide a foundation product on which the developer has an idea that will research and continue to create other DAOs that help the ecosystem grow in quantity and possibly quality. of DAOs. Therefore, the success of the proposal has a contribution, which is positively related to the Challenge. The above is just the idea and plan of the team, so there is no test product yet. Brand new proposal from the team. If granted, there will be no return because when the product is completed the remaining development costs will be covered by the MuesliSwap team.\nI rate: 4 points\n", "q2r": 4, "assessor": "z_assessor_2787", "no_vca": 11, "ne": 3, "ng": 3, "nfo": 5, "vca_o": 1}, {"id": 6770, "q0": "The problem identified by this proposal is that no secure voting protocols have been implemented for Cardano yet. The team plans to fix this by developing an open-source off-chain voting solution that uses state of the art voting mechanisms and is specifically tailored for DAO structures on Cardano.  I believe this fits within the challenge as it is trying to provide tooling to support the development of any future DAOs on Cardano.\n\nThe proposal explains what properties their voting system will have and why those properties are valuable.  A few examples of some properties given are privacy, integrity, and verifiability. Not only do they explain why those properties would be useful, but also why an off chain solution is useful.  Off chain solutions allow for feeless voting, which in turn allows voting to be available for more people and for a greater frequency of elections.", "q0r": 5, "q1": "The team behind this proposal is the team behind Muesliswap, so they have experience developing on-chain and off-chain code for Cardano.  Additionally they state that several team members have an in-depth understanding of research around voting systems and cryptography, which will be useful for building a secure voting solution.\n\nThe team provides a three month timeline for delivering on this proposal.  Within that timeline they have well defined milestones with predictions of the amount of hours that will be spent on each milestone. This indicates they have a clear and well thought out plan for execution.\n\nWhen asked about potential risks, the team states that there is a very little risk of not delivering considering the size and experience of the team behind this proposal.  They also state that running out of funds will not be an issue because if any unexpected expenses come up, the team will cover the extra costs.  This is because this tooling is something they themselves would like to use for Muesliswap, so they are highly interested in getting this developed.\n\nThey break down the budget into two categories: $11,250 for research and $40,500 for Development.  That’s where the breakdown ends. I think it would have been helpful to see the budget broken down even further to help the community evaluate if what they are asking for is reasonable.\n\nNevertheless, I think the team has provided enough evidence to believe that this proposal would likely be implemented successfully.", "q1r": 5, "q2": "The team emphasizes that they want to be transparent throughout the entire process. Once the research phase has finished they plan to publish their findings in a survey paper where they go over the details of all the possible voting mechanisms they could use.  This will allow the public to see what progress has been made prior to the development phase.\n\nOnce the development phase begins, the team plans for all of their work to be publicly observable via GitHub. Combine this with clearly defined milestones in their roadmap, and you get a project that can be easily audited by anyone.", "q2r": 5, "assessor": "z_assessor_2826", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 8962, "q0": "Every voting media must include Privacy, integrity, verifiability, receipt-freeness, dispute resolution hence to develop a portal where secured voting can be done and this can be used by cardano eco-system in the future is definitely a great idea .\nEvery member in DAO community has the right to vote on each project and his vote must be secured, it shouldn't be exposed to any 3rd party members by maintaining integrity hence to provide a solution where the proposer wants to build a secure community voting system effectively addresses the challenge.", "q0r": 5, "q1": "Developing a secured voting system is never an easy task but the team has alreaday contributed in building MuesliSwap, one of the biggest decentralised apps on Cardano, where it shows the team has proven experience . \nSince cryptography is the main key used by developers to maintain the security of the portal ,the team members  have in-depth understanding of cryptography and deeper insight into the theoretical research that has been conducted on voting systems. so with such a team provided the task can be achieved without much barriers ahead hence, with given experience and plan presented it is highly likely this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The presented audit has displayed the experience of the team in the past and again he using \" The MuesliSwap development team\" where together they will provide external help  on this project. this shows the team has preplanned on working experienced people.\nThe audit contains well structured timeline to complete the project and it also has excellent budget breaking idea, which has calculations over timely basis as well as monthly basis , the audit even contains how it'll be using survey papers and Open Source Development to make their project more impactful. Hence, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 11919, "q0": "In my not-so-humble opinion this is one of the very few submitted proposals in the challenge that actually address the challenge brief nicely. Yes, it is about making DAO tools, not DAOs! By providing their smart contract expertise from the successful DEX and UTxO order book mechanics, MuesliSwap promise to contribute Cardano infrastructure that can compete with Ethereum tooling. \nThe proposers demonstrate a good understanding of the importance of DAOs for Cardano's Voltaire Era and offer a reasonable price tag for their services. In my opinion this proposal is highly effective in bringing DAOs on Cardano to the next level.", "q0r": 5, "q1": "The MuesliSwap team are secretive about who is going to work on this exactly, but their popular DEX, appearances on Youtube and answering of questions from the community make me confident that we are paying for 690 high quality hours from people who know what they are doing and do not need to go our there and search for Plutus talent after they get funded. 90 hours are promised in high quality white paper writing and strategy, presumably by the founding members of MuesliSwap, so even partial outcomes of this proposal would be a welcome addition to the DAO capabilities of the Cardano ecosystem. The timeline appears to be a bit rushed, but as the hours are broken down in great detail, I am confident that enough development power will be allocated to the task, and I would be happy with the result even if there are a few delays. The proposal could have been written a little bit better, i.e. being more transparent and detailed, and not relying on the \"brand name\" of MuesliSwap alone. The deep thinking that went into the tasks required and the implications of Volatire do however compensate for this oversight / secrecy. ", "q1r": 5, "q2": "The community will be presented with a survey paper somewhat mid-way through the proposal and the development will be carried out as Open Source. Given the high exposure of the proposal team, I am confident that they will follow through on this promise and the community will be kept in the loop about the progress and success of this proposal. Auditing it given these promises would be possible. I would however have hoped for some more detail such as Github links or specific Discord channel to track the progress, not only because there are $50k of community funds requested, but also because this is a research area that should interest and excite a lot of community members, and would present an excellent opportunity for MuesliSwap team to feel the pulse of the community and tinker with their development directions accordingly - win / win.", "q2r": 4, "assessor": "z_assessor_3314", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Development of an open-source off-chain solution specifically tailored for conducting Cardano community elections enabling the formation of DAO structures for many projects in the ecosystem.", "experience": "We are OpenSwap Technologies - the team behind MuesliSwap, one of the biggest decentralised apps on Cardano. On top, several team members have in-depth understanding of cryptography and deeper insight into the theoretical research that has been conducted on voting systems."}