{"id": 422883, "author": "benjaminhartin", "title": "'What The DAO?' Twitter Space", "url": "https://cardano.ideascale.com/a/dtd/422883-48088", "category": 26594, "amount": 3850, "description": "There is no DAO-specific meeting place on Social Media aimed at interviewing significant people in the world of DAOs, geared towards adopting Cardano as the premier “DAO-Space” across all blockchains.", "f6_no_assessments": 7, "f6_rating": 4.238095238095238, "videos": [], "media": [], "f6_assessments": [{"id": 2573, "q0": "The proposal raises a very interesting problem about the lack of a DAO meeting place that participants can learn and get inspired by significant people in the DAO space and particular those who utilize the Cardano ecosystem. The suggested solution to run weekly interviews  sounds brilliant as it can attract users, developers and members from other DAOs to learn and understand what Cardano can offer in the DAO space. Sharing knowledge and experiences in this yet undiscovered DAO area will enable Cardano as the go-to platform for DAO tools, communities and dApps.\nThe proposal clearly articulates how it will add value in Cardano by providing very well-defined answers to specific questions set by the challenge.  Additionally, the proposer has identified a few possible risks and provided some mitigations that make good sense. This fact raises the level of confidence that the proposal will succeed and any possible risks will be minimized.", "q0r": 5, "q1": "The team behind this project is the proposer himself. Although this imposes a one-man-show, the proposer holds superior experience on research, as a journalist and writer but he has been very active in the Cardano ecosystem as well.\nThe proposal provides a quite detailed breakdown of the requested funds and it clearly explains how the amount of money for each task is calculated. The provided hourly rates are reasonable so it is the whole budget for the project.\nThe project's roadmap includes a well-defined and realistic timeline, a description of all project activities and the time duration in months to complete them. Although the plan is sufficient it would be nice to describe the key milestones for the project. Based on a potential success the \"What The DAO\" proposal may continue expanding and scale its success to other regions in the world.", "q1r": 5, "q2": "The proposal will measure the active listeners both for each space and sum them up for all spaces. This looks good from a quantification point of view but it lacks an indication about the quality of the interviews held. I would suggest for future funds to add some sort of feedback either during the live sessions or through running some surveys.\nThe success is well described and analyzed by setting specific and measurable targets to achieve.", "q2r": 5, "assessor": "z_assessor_2322", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2930, "q0": "Producing a regular twitter space/podcast that will be focused about DAOs on Cardano can increase awareness about the benefits of the Cardano blockchain for DAOs builders, set a platform for DAOs members to engage with the community and collaborate with other DAOs and projects. This can help to achieve the challenge goals and bring new DAOs to Cardano and to increase the activity of the existing DAOs.", "q0r": 5, "q1": "The proposer is an active member of the Catalyst community which give him an advantage as he can be known to interesting projects and other Catalyst members for hosting in the show. As a writer the proposer will be able to bring a relevant content in an interesting way. \n\nHowever to host a podcast require some skills that are not necessary needed for writers. Interviewing guests and engaging in conversation that is broadcast and recorded is different then writing and researching. \n\nUnfortunately, I was not able to enter the proposer website by the link provided in the proposal, and couldn't see if he does have those skills. more information about the proposer experience on hosting podcasts could have been helpful for estimating the project success chances.   ", "q1r": 3, "q2": "The plan is focused and clear. The project progress will be very easy to be tracked, as it is will be all public - the twitter spaces and podcasts events, the number of participations and engegment.\n\nThe success metrics are based on exposer numbers which make them measurable and reasonable. ", "q2r": 5, "assessor": "z_assessor_2360", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 4681, "q0": "This proposal is addressing the need for DAO-specific information about DAOs and relevant tools. Whilst it does not directly address the outlined challenge by delivering an app or solution for DAOs, it is a worthwhile complimentary service for tool builders and DAOs. The approach to create an MVP with the potential to grow this into a multilingual solution with a number of Twitter spaces is a sensible approach and defines a reasonable pathway for its success.", "q0r": 4, "q1": "Based on the described existing expertise and considering the fact that moderation of Twitter spaces requires a specific skill, there is a good chance that this proposal will succeed. The timetable for the investigative and administrative work seems to be quite optimistic. The proposer is the only person involved, which limits the financial risk and additional effort that might have to be invested. Time will tell if the planned time is going to meet the estimated effort.\n\nThe assessment of the risks could be wider as aspects of e.g. dependency on Twitter spaces (the could be a change in the way the service is provided), promotion channels (all selected channels are quite \"noisy\"), and personal availability (due to illness) have not been considered.\nIt might be helpful to think about technical alternatives (if required) like YouTube, promotions during Project Catalyst \"After Townhall\" meetings, or the mitigation of unavailability of the host through co-hosts just to name a few.", "q1r": 5, "q2": "Generally, the proposal is providing a good roadmap and milestones to measure the delivery of intent in an effective way. The only concerns are around the total number of 10K listeners as there is a big gap between the assumed live listeners on Twitter spaces and the total number of listens for the complete period of 4 months (30 listeners per the first-month per show, 50 for the second month and 100 in month three) which equals 720 live listenings vs. 10K listeners over 4 months. Furthermore, there is no clear indication, of how the listening will be reported. A bespoke webpage or a Gitbook page should be considered to report the KPIs.", "q2r": 5, "assessor": "z_assessor_2586", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5083, "q0": "(Will address the proposer as “the proposer”, “they”, and “you”, and I use “///” to indicate paragraphs.) ///\n\nThis proposal fits good into its challenge. It helps with some marketing, and also education. The idea is to hold Twitter Spaces every week over a four-month period of time – the Spaces will contain a 45mins interview and a 15min Q&A for the listeners to ask their questions. ///\n\nNow, I see several potential disadvantages that are not addressed sufficiently in the proposal. ///\n\nFirst of all, Twitter is the end boss of bubble-creation – there is hardly any outreach to people outside of your bubble (sometimes not even for inside). The proposer wants to use their personal Twitter Account, which is very unfortunate regarding this issue, because nobody will just go onto your Account and just find your project randomly. My advice would be to make a totally new Account for your project, even make a new email address to use for that new Account; then also upload on YouTube, Spotify, and Anchor.fm, etc. The main reason is because Twitter is not good to re-find stuff again and it’s not good to search through. And regarding that, make sure to create a (pinned) thread where you collect your episodes, so people find it at least when they visit your (new) profile. ///\n\nThen, the proposer suggests finding more audience in some Discord Servers or Telegram channels. This pro-active style of reaching-out is not exactly the most efficient way to gain a lot of traffic (rather just specific traffic), especially because these Social Medias only reach these people that are in the specific group – and then there’s also the question whether they will see the message and interact with it. Therefore, I hope that the “admin work on web presence” (quoted from the budget breakdown) maybe even goes into having a webpage, because content for inside the bubble is great, but it needs also to be accessible from the outside alone. ///\n\nIf you don’t gain further reach than your own bubble on Twitter, I feel like this proposed project will only add more value to the echo-chamber the proposer is in, rather than being a well-organized and well-marketed interactive podcast. For that echo-chamber, it will be good content, but that does not make “Cardano the go-to choice for building DAOs” (quoted from the Challenge), because the listeners are those who already consider Cardano to be the go-to place for building their DAO. ///\n\n“To spread awareness and bring new creators and operators to the space” (quoted from the proposal), I’d advise you to get a deeper understanding of the Social Medias, and how they work. And also have a look into podcast-specific tools! Because an interview alone can be a bit overwhelming for both interviewee and interviewer, and a public Twitter Space is then an additional layer to that. ///\n\nThe proposer certainly knows much about interviewing, and I am sure these will be of good quality, and the proposer knows what they do with interviews. However, I am not sure whether Twitter Spaces are the best format to execute these skills. The idea mixes two very different styles of content: One is a journalistic, organized, pre-planned 1:1 one; and the other is an interactive Q&A part that wants to include a yet-to-be-established community. Twitter Spaces are good for also-interactive conversations, but the idea is to wait with the the questions until the end – which is counterintuitive to the podcast-aspect of the idea. This is exactly the mixing of styles I mean. MAYBE it works for this event, but I just wanted to raise this point. ///\n\nAnother aspect of this problem is, that the interactive part requires people to attend, while a podcast is something you want to listen to whenever you got time and feel like listening to a podcast – it’s not necessarily something you would attend like a regular meeting. And with a regular meeting, you only get people who got exactly this time-slot free and are willing (and free) to participate. ///\n\nThe proposer identifies three risks that are related to this – but their solutions are in my understanding rather ideas than solutions. The first risk is, that the audience does not grow, and the solution is the mentioning of going into some Discord and Telegram channels. The second risk is that guests are not attending, and the solution is to invite all the guests to come and listen to every Space. The third risk is that the Q&A part does not roll, and the solution is to provide more interview questions. ///\n\nWhy not differentiate the two styles? Why not make a solid nice podcast AS a podcast, and then also hold an interactive space? With that, you don’t have as much pressure – and you can fully enjoy the interactive sessions as interactive sessions, and your listeners can enjoy your podcasts fully as podcasts. Additionally, you could also provide your new email address for them to send questions whenever they want to – or let them slide into the DMs of your new Twitter Account. ///\n\nThe penultimate problem I would like to address is the timeframe. Four months are not very much to build a regularly attending community and to get the word spread out. Content relies much on consistency – but you, as the content creator, also need to be able to hold that consistency up. If you start with one interview every week, that will/may drain you – because it does not only mean you are holding spaces, but you also want to do all the research and prepare with high-level interview skills. (AND if you got a certain schedule, you already put that time-slot in stone also for your interviewees (especially for them).) Again. Social Media and journalism are two different things, and I would suggest staying mindful of their differences. Especially if you take my advice and expand onto other platforms as well. Find out what they live of, how they function, how people interact with content – and let it inspire you. (And look into podcast tools!) ///\n\nAnd the last problem I want to address here: Someone who just wants to know what Cardano DAOs are and whether Cardano is the “go-to choice for building [their] DAOs” will not listen to a podcast every week. Maybe you can also create a little FAQ or some other resource with your newly-gained community? – Yes, you mention that later in the proposal, but I wanted to emphasize it (to hopefully become more than a document and video for Catalyst). ///\n\nAnd as a little disclaimer (at the end, wohoo) – maybe I am wrong about the concern with high-level interviews on Twitter Spaces and only such a short time frame for interaction. Maybe you should totally go for it and try it out! But still, collect the recordings in- and outside of Twitter! ///\n\n(OH, and my very last idea would be, that you could maybe also connect with already existing podcasts/Twitter Spaces and make a special series in THEIR show – as a kinda bootstrap of audience participation – but then you’d not have your own project, so I totally understand it if you want to build your own podcast! (You could also just go randomly into other Twitter Spaces as your New Account (build/connect community), which gives you some visibility)) ///\n\n((And please don’t forget to let people have their open questions where they can just talk openly about their stuff, these are the absolute best parts in podcast IMO!))\n", "q0r": 4, "q1": "Yes, this proposal is feasible. My already stated concern is about the attendance and the interaction – but as advised, there are Social Medias which do not require listeners to be listening LIVE (apart from the recording being on Twitter, but again – Twitter is not the best platform for reach, nor for archiving/collecting). ///\n\nThe budget breakdown does not really go into why these numbers that are chosen are chosen, but instead says that “[t]he prices above reflect rates charged to recent customers for similar work.” What is meant with “recent customers”? And what about the time, how are the hours calculated? ///\n\nSpeaking of time, I do not know whether a one-week interval is a good choice to prepare the interviews and host them and everything; my first strong impression is that it will be very stressful and that I should advise a more chill, but also more thought-through approach. Maybe I totally underestimate the interviewing skills of the proposer, then I would advise this only because of the Social Media aspects mentioned – and to first get to know everything. Hosting is quite a challenge, especially with live stuff. (Again: Look into podcast tools!) ///\n\nAlso, a note about what is written in the timeline/roadmap: The proposal for the next iteration will not be due in 4 months, but in less. ///\n\nThe idea is, that this project can evolve into something bigger – and I feel like this pilot is feasible, but the proposer will learn a lot about how Social Media and podcasts work. And how people actually and truly engage with content. I very much wish them that their path of learning will be a fulfilling and nice one! ", "q1r": 4, "q2": "This proposal is quite auditable, because anyone can just join the Spaces or listen to the recordings. ///\nI feel like the measurements of success are too arbitrary though (and with that also not really understandable why you chose them) – the proposal suggests counting the attendees. This was a big indicator for me that the proposer needs to get to know better how Social Media interaction works and what they live off – these numbers suggested are just what the podcast also kinda relies on (because of the interactive part). Here, I am again uncertain whether I underestimate the fitting of the two styles (journalistic and interactive in one), but I’d like to emphasize that your content needs to appear on other platforms as well. And there, you can count numbers too, but they will be different and do not rely on joining LIVE. (Maybe you can do something like a Linktree to collect all the upload-places in one spot.) ///\nAnd then there’s a small contradiction I see: “The more people contributing to the conversion and engaged in concrete experience, the better.” (quoted from the proposal) Yes, this makes sense in case you rely on them to carry the Q&A part – but that only is for 15 minutes. I do not really see a fastly growing audience to contribute 15 minutes after listening 45 minutes. If you want more people contributing, you will probably need to leave the space open – else I feel like you will be cutting off many conversations, since people need to acclimate to the setting as well – and 15 minutes are just enough to acclimate. (OR, as suggested already, differentiate them and make the interactive conversations as interactive as they can get! – or invent a whole new model of holding the spaces, idk :) Wish you all da best!)\n", "q2r": 4, "assessor": "z_assessor_2670", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6084, "q0": "The name is snazzy. It may not be the proposers own creation (https://www.omm.com/resources/alerts-and-publications/alerts/what-the-dao-why-everyone-is-talking-about-decentralized-autonomous-organizations/) but has the potential to make people curious. This proposal is for a weekly hour-long Twitterspace over four month for the princely sum of $3850\nThis is a good idea and goes a long way towards the challenge goal of boosting Cardano adoption and reputation. Become the low-fee, awesome-community alternative to Ethereum as the go-to solution for building DAOs. I like it. I think that the proposed format sounds reasonable and the growth strategy to start with Catalyst and then move out, via Cardano and cross-chain, is highly reasonable. I would have liked to see some more evidence of \"pulling a crowd\" and a portfolio or work example of providing quality audio content. The match with the challenge setting is very good, the ideation of the content is good, this proposal could have been 5 stars for impact if some more evidence of \"why this proposal\" would have been added to the mix.", "q0r": 4, "q1": "Unfortunately, the proposer's own website did not work at the time I am assessing this proposal, and no other background information or links to work experience and portfolio are given. It is stated that the proposer worked on previous proposals and I can find him as the co-proposer of F6: Distributed decision making, Catalyst Interactive News Journal. For this proposal to make sense, it is absolutely vital to convince the voter that the person hosting the Twitterspace can \"pull it off\", for example by presenting a portfolio of previois work, linking their Twitter account to showcase number of followers, tweets, hosted spaces, and so on. It is not vital to have a detailed budget and business plan for a 4k Twitterspaces project in my opinion, it is however vital to be viral. ", "q1r": 3, "q2": "In light of the very modest budget and very public nature of the deliverable (weekly Twitterspaces!), this proposal does a fantastic job of being transparent and detailed with its goals and auditability. Goals are: 100 live listeners after the four months funded period, at least 10K listens across all episodes and number of listeners who stay around for the Q&A as a bonus KPI, broken down into sub-goals for months 1-3. It would be really nice to also get a way to contact the proposer, for example a Twitter handle, LinkedIn profile or something of the sort. It is possible that the website provided contains all these, but it was not working at the time I am doing this assessment. When it doubt, put it into IdeaScale as well for the extra convenience and redundancy. Thank you.", "q2r": 5, "assessor": "z_assessor_2781", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6499, "q0": "The proposal states that there isn't a twitter space focused on DAO's in the community. Twitter spaces can be a great way to build a community and promote engagement. Especially during a bear market. This proposal could explain a little more on what is going to be discussed in each twitter space. It needs to be engaging every week so that more people can join. I would suggest writing about how you plan to market the idea and get more people to join. Overall, I think that it is a great idea and that twitter spaces focused on the building of Cardano and DAO's are extremely important. For these reasons. I give this section 4 out of 5 stars.", "q0r": 4, "q1": "The plan is written well and there is a lot of information that supports the proposed idea. The biggest question is, what will the proposer do to gain a large enough following that these funds go to a proper cause that will increase the Cardano blockchain and promote a positive atmosphere where people can come and learn. The detailed roadmap is a huge indicator of how likely a proposal will be implemented successfully. There is a great deal of information that supports the cause and explains what the plan is. Something that should be considered is, what will be holding this person accountable to making sure that this idea becomes a reality. Catalyst is focused on ideas that will help benefit both the proposer and the community. If there can be more information included on how this is going gain a larger following. It can be a great success. For these reasons. I give this section 3 out of 5 stars. ", "q1r": 3, "q2": "Looking into the detailed budget breakdown is a great way to determine how likely the proposal will be successful. It is explained where the requested funds would go which is a good look. I also find it important that there is a timeframe provided. Having specific metrics allows for more accountability. This leads to a higher chance of success in the proposal. Something that could be beneficial to this proposal is having gathered a small community before the idea of a proposal. When there is already a form of a community, it will make it easier to determine if it will be successful or not. The idea of the requested funds would then be to help grow this idea even further. That could be something that will allow this proposal to flourish and potentially receive funds. For these reasons. I have to give this section 3 out of 5 stars for now. ", "q2r": 3, "assessor": "z_assessor_2817", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 8965, "q0": "The idea of interviewing DAO builders tool makers & avid members and other contributors on the Cardano Blockchain is definitely a great idea where people can understand their voting rights for presented project.\nThis idea will also help the new comers to Block chain who wants to develop their own dApps, where they'll get to know the experience of these people, and the idea of QnA will help people to clarify the doubts related to DAO's. Hence, to conduct interview regularly helps people to more engaged so the provided proposal effectively addresses the challenge.", "q0r": 5, "q1": "The plan doesn't involve any risk involved in it where setting up a interview and streaming it over twitter can be achievable here the proposer has 10+ years of research,1000s of hours of combined interview experience.\nFinding a DAO developer or Block chain contributor can also be found with online mode through LinkedIn, the main challenge here is about the marketing strategy , since there are lot of channels who update about cardano currently, how will the end user  find this twitter channel and will start getting with this channel , with the minimal risk involved and with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit has presented clear goal about 45 mins and 15 mins of QnA session, and it has also displayed the experience of proposer in the interview field. But the proposal has failed to explain the marketing strategy that will be used by him to attract most of the audience.\nThe audit has presented overestimating budget where it is using more than 3000 dollars just to write script and host the program through twitter channel, the proposal could have presented its timeline in still more efficient way.Hence , the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Build an organic weekly audience through Twitter Spaces that participates, listens, & learns through interviews of DAO builders, tool makers, & avid members––all working on the Cardano Blockchain.", "experience": "Benjamin Hartin is a memoir ghostwriter, journalist, blockchain enthusiast, & Proposal Assessor.\nHis experience includes:\n\n10+ years of research\n1000s of hrs of combined interview experience\n1.5+ yrs of investing, learning, & working in both the Cardano & Catalyst Communities\n"}