{"id": 423041, "author": "tevosaks", "title": "Innovation Fund Research - Roles", "url": "https://cardano.ideascale.com/a/dtd/423041-48088", "category": 26594, "amount": 45220, "description": "We lack an overview of interactions between the Catalyst community roles in different funding stages.", "f6_no_assessments": 7, "f6_rating": 4.6190476190476195, "videos": [], "media": [], "f6_assessments": [{"id": 773, "q0": "As Catalyst is itself an Innovation Fund building clear definition of roles, their interactions and how they combine into a DAO is a great idea. It will help building better DAOs in the future, including Catalyst. This proposal while a bit \"meta\" is clearly in line with goals of this challenge.", "q0r": 5, "q1": "Looking and plan and budget it's clear to see that the proposer has been involved in Catalyst from Fund 1. Precise, detailed, thought out. Experienced team. Timeline is well defined. This project has high probability of success.", "q1r": 5, "q2": "Clear deliverables, KPIs, definition of success. While not strictly a tool in itself, results of this proposal will do heaps of good for way of thinking about innovation funds DAOs and can be used as a base of building actual tools for such DAOs. Including building of a tool would make this proposal too big and complicated, so actually limiting scope is reasonable and it's additional strength.", "q2r": 5, "assessor": "z_assessor_2125", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1}, {"id": 1993, "q0": "This is a research and development proposal that intends to demstify project catalyst with main purpose of simplifying it's processes and making more efficient and effective in its governance and decision making roles of each funding cycle. It actually fits into the challenge settings as it helps to ensure\"an effective Collaboration Management Platforms such as Project Catalyst to Organize Community Intentions and Actions\".", "q0r": 4, "q1": "The lead proponent of this proposal is well known, active and notable community member involved in numerous funded projects and groups in the community such Catalyst Swarm, Catalyst School etc. Although we can confident that the team had a hands on experience in the community as great organizers, there is little testaments to their knowledge, expertise and competence to handle the project successfully. However, going by the well detailed and articulated plans of implementation and the detailed roadmaps and milestones specified in addition to the  intended collaborations with experienced community members in the ecosystem, am convinced the proposal has a great potential being effectively implemented.", "q1r": 4, "q2": "The proposal has provided sufficient information on what is deemed to be a successful project and the proffered success metrics are reasonable and reliable, and being mostly community collaborative efforts from onset, it is obviously clear that the community will be able to confirm the progress and success or otherwise of the proposal if eventually funded.", "q2r": 4, "assessor": "z_assessor_2292", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2705, "q0": "This is a proposal by Tevo Saks, a Catalyst veteran, with the aim of documenting all the current positions / roles that currently exist in Catalyst, in order to gain an overview of what we have here and how people can contribute. Over time, Catalyst has grown quite large and it’s becoming ever more difficult to have a complete picture of who does what and how the entire system functions and Tevo aims to bring clarity to this. An added benefit of this will be that it will help people understand what they can help with, if they want to get involved. Since each role will also have a few requirements defined, it will be easy for people to then figure out where their skills can be applied, or what skills they need to acquire if they want to activate in a certain position in Catalyst.\nAs risks, Tevo identified the fact that in all likelihood, the roles that he identifies and defines now, will change in the future. As a way to mitigate this, he included the projected cost of keeping the information up to date in the future in the requested amount for this proposal. \nI fully agree that this proposal effectively addresses the DAOs <3 Cardano challenge. Score: 5.", "q0r": 5, "q1": "Tevo has had a large amount of funded proposals in the past, many of which were similar in nature to this one. As usual, he has a very detailed plan on how to do this, a timeline, milestones, plans on how to manage the Miro board that will be produced after the proposal is completed successfully, etc. It goes without saying that he has the necessary skills to gather this information and host the workshops that he plans to host in order to educate the community, as he has been doing this for more than 4-5 funds now. The budget is not very large at 45000 USD, as the work will span at least 8 months (and probably more). Moreover, the breakdown of the budget is extremely comprehensive, with each and every action that must be taken having a time and cost estimation.\nI fully agree that this proposal is highly likely to be implemented successfully. Tevo is very good at this kind of stuff. Score: 5.", "q1r": 5, "q2": "Tevo has added comprehensive and very clear key progress indicators, such as having at least 7 people per each workshop session, 50 views for each youtube video produced here etc. Moreover, there already is some groundwork done from previous funds, which he linked to in the proposal. Finally, he will also gather feedback from the participants of the workshop and publicly keep track of that as well.\nThe measure of success is defined as having mapped out all the roles, their tasks and all other related info, by fund 12 (since this will be an 8 month on-going proposal). Aside from this, Tevo added a lot more info to support the community in tracking the progress and success here. I am fully confident that this proposal is as transparent as possible to Catalyst participants. Congratulations for your work done here and everywhere else in Catalyst Tevo. Cheers! Score: 5.", "q2r": 5, "assessor": "z_assessor_2335", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3214, "q0": "Although the proposal might offer a positive impact to Catalyst, it does not match the challenge metrics and goals directly, only indirectly. Even the proposers did not invest too much in giving arguments to show the connection with the challenge, as they state that helping to understand Catalyst will lead to future DAO operations. That might be true, but it's not a strong and direct connection with the challenge goals. In this case, I neither disagree or agree that it will have a great impact. ", "q0r": 3, "q1": "The proposal is overall feasible and has a reasonable timetable of completion. And the team has enough experience to conduct the proposal and research, as they are active members of Catalyst. However, there's a small gap between the explanation of how the proposal will be executed and the budget description. Analyzing the budget, one can see that rewards will be distributed to those who contribute to the research. However, the description of the solution does not explain this well, nor gives much information about how this process will work with external contributors to the proposal (and the miro board also does not explain this much). It seems to be clear for the proposers, but an external reads does not understand well the operation. If they could explain more this connection between external collaborators and the execution, it would make the proposal stronger in terms of feasibility.", "q1r": 4, "q2": "The proposal can be audited by its deliverables – especially the main one, which consists of a readable and good representation of the roles in Catalyst. In addition, there are good metrics to assess the progress of the proposal during its execution. In this case, a score of 5 is appropriate.", "q2r": 5, "assessor": "z_assessor_2409", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 4506, "q0": "Catalyst project is the most important DAO for making Cardano the financial operating system of the future. Ideascale is a good platform to collect and assess proposals but the true driver of innovation is the community. Many roles contribute to generate meaningful projects that support Cardano innovation. Even if the proposal is not a general tool for DAOs it's identify a problem that is facing Catalyst and propose a research endeavor to clarify roles and interactions.", "q0r": 4, "q1": "Highly skilled team with a track record on delivering and serving the community. The work has already started and documented and they choose Miro board as the tool that I find adapted to the task. It's a tool for ideation organization of thoughts more and more used by the community. Moreover, the team presents a detailed plan with deadlines and clear deliverables.", "q1r": 5, "q2": "Having provided clear plan and deliverables is highly contributing to the auditability of this proposal. Those deliverables, namely recording of working sessions and the Miro board will be open access and shared with the broad community. The funds will also be distributed to collaborators in a transparent way by the SWARM treasury. For all of those raisons, I'm giving five stars.", "q2r": 5, "assessor": "z_assessor_2555", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6504, "q0": "Project Catalyst has proven to be such an important part of the Cardano ecosystem. This proposal identifies the current challenge that we face. The proposal states \"We lack an overview of interactions between the Catalyst community roles in different funding stages.\" The team plans to address this challenge by opening a discussion channel to gather knowledge about the specific roles. They will then implement this into their \"Miro Board\" which will make it easier for viewers to see the data. This proposal is important because it suggests improving the catalyst process and bringing the knowledge to more people. I would agree that this proposal addresses the challenge by promoting further education and organization in the funding process. I know that it can be confusing for newer users joining Project Catalyst. I think that this could have a positive impact on the Cardano ecosystem and could potentially allow more users around the world to participate in governance. For these reasons, I give this section 4 out of 5 stars.", "q0r": 4, "q1": "The team behind this proposal is very solid. The proposal includes specific members on the team members and also includes their LinkedIn profiles. The head of the proposal is the co-founder of Catalyst swarm and the Catalyst school. This shows how important education is for this team and how that will likely play into their Innovation fund research through their Miro project. There is a specific roadmap that gives details on what the team plans to accomplish and the timeframe to do so. The estimated time of completion for this project is 8 months. They will be using the funds as described in the budget breakdown to fund their work for the 8-month period. They have a very specific budget breakdown. It shows exactly where the requested funds will be implemented. This also includes why the funds are needed for these specific areas. There are very few proposals that include this. However, it is extremely important when determining the likelihood of this proposal being implemented successfully. For these reasons, I give this section 5 stars.", "q1r": 5, "q2": "As suggested in the previous response. There is a great deal of information included in this proposal. There are clear details on the team behind the proposal and includes their skills and accomplishments. There is also a specific roadmap and budget breakdown that describes exactly what the team plans to do. The only suggestion I would include for this section is potentially including information on building a community behind this project. The marketing side of things. In order to create a successful proposal, there should be a strong community behind the project who will help hold the team accountable for the success and implementation of this proposal. I think that there is sufficient information for this proposal and that the innovation fund research can be extremely beneficial to the whole Cardano community. Given that enough people are aware of this project. For these reasons, I give this section 5 stars.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8970, "q0": "The presented idea is an excellent idea to new developers working in governance field or other fields in cardano catalyst program.\nThe presented plan wants to gather knowledge of all the members considering each members role in the project.\nThe presented plan helps all the new comers where they can read the experience of the seniors and they can even relate that experience to their presented role, the proposer even wants to add experience of the people at different stages of funding , which will also be of great helpers to understand the planning of project , hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The presented plan of adding experiences and reach of each roles can be achieved since the proposal himself has been working in catalyst project since fund 1 , he alone has a lot of experience available to share with the viewers.\nIn the channel the proposer's team will be using Miro White board where it helps the audience to understand the topics more effectively the proposed solution even wants to add channels for discussion, where all roles available people can interact with each person more effectively, so the team itself has developed catalyst swarm which shows that they have lot experience to share with hence with gven experience and plan presented it is highly likely this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer has clearly explained about his solution to the project, the audit has even mentioned about adding adding channel where all people can discuss about their roles which will definitely enhance new developers of DAO's.\nThe plan has even mentioned about on how they are going to use Miro White board to increase  the effectiveness of teaching or sharing the experience of the seniors, the plan has well structured part where it will organized based on roles and it will also be organized on stages of funding to developers of the project, the proposal has displayed the experience of the members in the project and how they even built a catalyst swarm , the presented idea has well mannered budget breaking and detailed timeline structured to complete the project , hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "I am opening a discussion channel to gather all the knowledge about the specific roles. \nTogether we will be organizing all these Catalys role activities on Miro Board for visualization. ", "experience": "I am a founding Swarm member and have worked on ideation workshops for Project Catalyst since Fund 1. I work closely with different Catalyst Governance bodies like Catalyst Circle, Sub Circles, and Community Governance Oversight."}