{"id": 381151, "author": "matthiasksieber", "title": "Distributed Governance", "url": "https://cardano.ideascale.com/a/dtd/381151-48088", "category": 26257, "amount": 200000, "description": "催化剂社区如何发展、实施和维持分布式治理？", "funded": 1, "upvotes": 64776485, "downvotes": 9547499, "votes_result": 55228986, "votes_cast": 299, "f6_no_assessments": 5, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe underlying challenge targeted by the proposal (effective community self-governance) is critical to support two of Fund 8 strategic goals: make cardano into an open-source system and grow the number of contributors.\r\n\r\nAt the same time, the proposal would be stronger if it included:\r\n1) an overview of specific problems/use cases that create damages/lost opportunities for the community.\r\n2) a list of recent success stories and their impact on the community.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a discusion about specific use cases and their importance for Cardano ecosystem.\r\nMy rating is 4.", "q0r": 4, "q1": "The Catalyst community is well positioned to innovate in the self-governance space because Project Catalyst gathered a lot of enthusiast for decentralized governance and self governance.\r\n\r\nAt the same time, the proposal does not define any specific problems/use cases, which is a big risk for the success of it. Without a specific list of use cases, it is not clear which skills and resources are needed, and which blockers need to be eliminated to create a noticeable impact.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The measures defined by the proposal a very ambiguously defined (legitimacy, strategic capacity, auditability), making it hard to regularly and precisely to track progress.\r\n\r\nIn addition, the proposal defines the measurement system through good-to-have attributes (fairness, direction and purpose, etc.) instead of the progress towards the desired outcome - the fulfillment of the mission of Cardano.\r\n\r\nFor example, assuming the definition of Carano's mission as to \"provide a financial and social operating system to the world\", the following metrics could be valuable to consider:\r\n1) the % of the world's population that relies on cardano for financial use cases (need a list of use cases).\r\n2) the % of the world's population that relies on cardano for social use cases (need a list of use cases). \r\n3) the use satisfaction (by use case) of with Cardano's solution vs those of competitors/alternatives.\r\n\r\nI have made the following deductions:\r\n- 1 point for the ambiguos definition of activity metrics.\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 2.", "q2r": 2, "assessor": "z_assessor_1011", "no_vca": 30, "ne": 5, "ng": 17, "nfo": 8, "vca_o": 1}, {"q0": "The challenge is one of the most critical for Cardano with the formation of multiple DAO's onchain distributed governance tooling and resources will be key.", "q0r": 5, "q1": "The catalyst community is efficiently managing similar distributed decision making proposal in the current round and has the capacity to continue to address the challenge in the next. ", "q1r": 5, "q2": "The success criteria and metrics outlined in the proposal are correctly configured to measure progress against the initiatives submitted in this challenge.", "q2r": 5, "assessor": "z_assessor_1015", "no_vca": 31, "ne": 2, "ng": 16, "nfo": 13, "vca_o": 1}, {"q0": "The challenge aligns with the mission to prepare a group of people willing and able to make contributions to the ecosystem.\r\n\r\nTo improve challenge: better articulate how the challenge aligns with more than 1 of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "There is demonstrated interest and skills required for the challenge. The budget is moderate although there is no historical funding to gauge demand. There is another challenge that significantly overlaps with this challenge.\r\n\r\nTo improve challenge: Community capacity to address a challenge also includes budget considerations. Clearly articulate how there is demonstrated demand to fund multiple challenges in this area or why this challenge should be funded instead of the other overlapping challenges.\r\n", "q1r": 4, "q2": "The success criteria is clearly articulate however the metrics for measuring progress are simply blank KPI fields.\r\n\r\nTo improve challenge: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 17, "ne": 3, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": " Relation to personal qualifications: As I am actively participating in Project Catalyst since several funds and have a good grasp of Cardanos mission, I confidently can assess whether a proposal meets aspects of this mission. Since the mission of this challenge proposal is to figure out good concepts of decentralized governance, it is obvious that it is vital for Cardanos mission, as this aspect is an important part of it.It will also have a huge societal impact.", "q0r": 5, "q1": "The Project Catalyst community is a diverse group of people with various skills, but all of them are united by the aspect of governance. So I think this is the perfect challenge to enable many people to bring in these capabilities.  The challenge has a credible challenge team and it is credible to achieve results in the set milestone times.", "q1r": 5, "q2": "The challenge metrics are set up clearly and are actionable and auditable. They leave room to a lot of different concepts while they define a clear framework that provides various points of action.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 4, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "I share the importance of experimenting with different governance mechanisms. In a challenge of these characteristics, ideas may arise such as: mechanisms for making small short-term decisions. I think it is within the objectives of the challenge.", "q0r": 5, "q1": "clearly the community can address this challenge, it would create a space to play and imagine.", "q1r": 5, "q2": "it is correctly raised and substantiated. The benefits and the proposals that may arise would generate an impact in the community, stimulating participation.", "q2r": 5, "assessor": "z_assessor_743", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}], "importance": "卡达诺路线图的伏尔泰时代旨在确保卡达诺网络能力以去中心化的方式得到长期维护和改进。", "success": "该社区正积极参与开发、实施和维护分布式治理解决方案。"}