{"id": 381328, "author": "felixweber", "title": "Catalyst - Rapid Funding Mechanism", "url": "https://cardano.ideascale.com/a/dtd/381328-48088", "category": 26257, "amount": 500000, "description": "我们如何才能以透明、负责任和安全的方式更迅速地分配Cardano国库资金？", "funded": 1, "upvotes": 83565602, "downvotes": 11111364, "votes_result": 72454238, "votes_cast": 403, "f6_no_assessments": 7, "f6_rating": 4.523809523809524, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis proposal aims to increase the speed of project funding, which is an important factor that can support all of the Fund 8 strategic goals: grow the number of contributors, make Cardano into an open-source project, and grow the dev and app ecosystem. Moreover, as evidenced by proposals in Fund 7 there are practical solutions that can improve the situation.\r\n\r\nAt the same time, the proposal can be made stronger by:\r\n1) presenting historical cases where the inability to quickly \"move rapidly from volunteers to paid professionals\" has created notieceable damage to the community.\r\n2) providing an analysis of the expected ROI on quick funding.\r\n3) providing an example of the size of the issue: what is the relative number of projects that cannot be funded through Catalyst?\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a clear analysis of the problem.\r\nMy rating is 4.", "q0r": 4, "q1": "The catalyst community is well positioned to make improvements with regards to the speed of funding. Fund7 already had a challenge aiming to increase the speed of funing, and it recieved some interesting and practical proposals, proving the presence of skills and resources in the community.\r\n\r\nAt the same time, the development of quicker funding mechanisms or prossesses, doesn't necessary mean that they will be supported by the respective financial resources. So, the proposal would be much stronger if it provded an anylsis of the demand and a commitment from providers of funding (Catalyst, IOHK, etc.) to financially support the new mechanisms if they are deemed of sufficient quality.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a discussion about a sustainable source of funding for rapid funding process.\r\nMy rating is 4.", "q1r": 4, "q2": "The proposal presents some measures to evaluate the suggested mechanisms (scalability, transparency, accountability, impact, etc.) which are reasonable evaluation criteria for potential projects.\r\n\r\nHowever, out my experience as a product manager, the challenge would be stronger if it considered its own impact on the Cardano ecosystem:\r\n1) the % of projects funded through Rapid Funding Mechanisms.\r\n2) the % of funds distributed through Rapid Funding Mechanisms.\r\n3) the community satisfaction with the reapid Mechanisms in comparison with the satisfaction with Catalyst process.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 30, "ne": 6, "ng": 18, "nfo": 6, "vca_o": 1}, {"q0": "I believe that speeding up the financing process so that projects can begin sooner aligns with Cardano's overall mission. Some proposals, due to their characteristics and the amount requested, may not need to go through all the control points to which they are currently subjected.  \r\n", "q0r": 5, "q1": "19 proposals were submitted in fund 7, with a budget of $250000, now seeking to double the amount allocated to this category of funding. Even though it was not the challenge with the majority of the proposals, it was possible to identify great ideas that demonstrate a willingness and ability to tackle this problem. \r\n", "q1r": 5, "q2": "The challenge question relates to the success criteria. In relation to the success criterion, the main indicators are both meaningful and measurable. As a result, I strongly believe that the success criteria and suggested metrics are suited to tracking progress in meeting the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 25, "ne": 2, "ng": 20, "nfo": 3, "vca_o": 1}, {"q0": "This challenge can accelerate growth in Catalyst and Cardano. It is also aligned with Fund8 Challenge Setting Strategic Goals in the sense of getting more people on board and accelerating growth in developer and app ecosystem.  ", "q0r": 5, "q1": "The Catalyst community is already volunteering in some spaces. Imagine if they could get funded immediately and start dedicating more time to Catalyst. They definitely have the capacity to address this ,because they are already here, ready to do the work. Inventing mechanisms to get essential projects on the road will be priority for Catalyst members in some circles.", "q1r": 5, "q2": "The success criteria and suggested metrics are well thought out as it is essential to measure for transparency, accountability, scalability, speed and impact of proposals funded when it comes to rapid funding. If these metrics are followed to success the ecosystem can experience rapid growth.  ", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 25, "ne": 1, "ng": 22, "nfo": 2, "vca_o": 1}, {"q0": "The challenge aligns with the Cardano mission by accelerating funds disbursement to proposers so they can make contributions to the ecosystem. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The challenge exists in fund 7 in which it had 15 assessed proposals, which is rather low in number however the proposal budgets were larger than many other challenges. The doubled funding request aligns with the doubling of the total budget and is moderate given there are no overlapping challenges.", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 20, "ne": 2, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "I feel like the challenge is not needed for Fund 8. I've been a CA for 3 funds now and the rapid evolution Catalyst is making is too fast in my opinion. We need to focus more on accountability and safe manner than rapid evolvement. If F6 743 assessed proposal were made and in F7 now we have 944. Although it's still an increase it's not exponential.", "q0r": 2, "q1": "I get that the Catalyst community has a strong drive to evolve because looking at the challenge we cover a wide range of topics. From legalization to AI. But looking at Catalyst and the community I have a feeling we are expanding Catalyst faster than the community. The budget requested for the challenge is feasible.", "q1r": 4, "q2": "Metrics and KPIs are provided and give clarity on what the challenge holds. The success criteria given in this proposal are in line with what the proposal represents in the community.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 18, "ne": 0, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": " Relation to personal qualifications: As I am actively participating in Project Catalyst since several funds and have a good grasp of Cardanos mission, I confidently can assess whether a proposal meets aspects of this mission. Since many of once single proposals developed to ongoing projects, it is important to have viable mechanisms to support those ongoing projects. Ongoing support for projects will also have a huge societal impact.", "q0r": 5, "q1": "The Cardano community has many creative people to adress this challenge. To efficiently implement new mechanisms on the blockchain, a various set of blockchain/software engineering skills might be required however, which could limit the number of people that are able to propose in this challenge. The challenge has a credible challenge team and it is credible to achieve results in the set milestone times.", "q1r": 4, "q2": "The metrics are well set-up and comprehensible and provide concrete points that can be adressed by proposals. The challenge has a credible challenge team and it is credible to achieve results in the set milestone times.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 3, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "Accelerate the funding process so projects can move faster, thereby helping to realize Cardano's mission. Currently, the funding process has many loopholes that lead to inadequacies in resource allocation. Therefore, I completely agree that this challenge is crucial to achieving Cardano's mission.", "q0r": 5, "q1": "The community of course has a strong desire and will to innovate this funding process and mechanism. I completely agree that the Catalyst community is perfectly capable of taking on this challenge", "q1r": 5, "q2": "Metric is well thought out, the success criteria are closely related to the challenging questions. My only question is: would $500,000 be a one-time challenge at will this aim to establish a sustainable long-term mechanism for rapid funding ?", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "importance": "催化剂依靠社区的持续工作来进步和发展，快速的资金可以支持更多的工作和个人需求", "success": "实施快速的 \"催化剂 \"资助机制，在 \"催化剂 \"项目准则范围内为提案人提供可持续的经济价值。"}