{"id": 381705, "author": "filip12", "title": "Cross-Chain Collaboration", "url": "https://cardano.ideascale.com/a/dtd/381705-48088", "category": 26257, "amount": 400000, "description": "在未来6个月内，我们可能如何在Cardano和其他区块链之间建立联系和合作？", "funded": 2, "upvotes": 159383147, "downvotes": 7069246, "votes_result": 152313901, "votes_cast": 710, "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"q0": "跨链互操作性、建设、合作将是Cardano生态系统和整个区块链行业的可持续增长和富有成效的未来的关键。正如提议者所指出的那样，将项目、代码、社区孤立起来有可能导致停滞不前和极致主义。这是一个抛开分歧，结合知识库，为一个而不是多个社区的利益而创造的机会。拥抱这些技术和机会的社区在面对不可避免的挑战时，将更有能力，更有可塑性，更有进步性和准备。保持挑战的开放性和持续性，对这一领域的持续发展也同样重要和有影响。", "q0r": 5, "q1": "参与的社区和团队将需要超越他们的极端主义、粉丝男孩和影响者的角色，以便一起工作。专业精神、信任和尊重将被要求和期待，所有这些都是可以实现的，以便在参与的区块链社区中采用。应该以透明和沟通的方式解释整合的愿望和意图。虽然该团队有丰富的经验，但我相信所设定的预算是最低的，并相应地解决。这有可能导致许多小型的、无关紧要的跨链合作努力，可能/可能不会提供价值。团队也没有远见来建议未来的预算调整，这一点不应该被指责，但是社区应该继续提供与每个基金之前提出的预算增加或减少有关的意见。", "q1r": 5, "q2": "采用将是一个相对容易的指标，在整个基金8中通过各自的建议数量来查看。社区也可以持续监测催化剂上的这个特定挑战设置。虽然第7项基金的挑战设置解释了挑战团队的要求，但我希望看到团队计划向社区更新有关采用情况、提案数量、受资助的提案和其他常见指标。提供这种性质的信息可以让团队获得声誉，让社区更多地了解催化剂和跨链项目的不同方面。\r\n", "q2r": 4, "assessor": "z_assessor_591", "no_vca": 14, "ne": 8, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe challenge's aim of collaborating with other ecosystems to bring new ideas and solutions to Cardano can support the objective of growing the dev and app ecosystem.\r\n\r\nAt the same time, the proposal would be stronger if it:\r\n1) provided an explanation why this challenge can provide a higher ROI to the community compared to broader challenges, such as as DApps and Integrations.\r\n2) discussion of popular use cases blocked because of the lack of collaboration or tech foundations within Cardano.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this segment can bring high ROI to the community.\r\n- 1 point for the lack of a clearer analysis of the problem (name popular struggling use cases in additional to missing technologies).\r\nMy rating is 3.", "q0r": 3, "q1": "The Catalyst community definitely has the skills and capacity to address this challenge: the academic and engineering talent to review the alternative ideas and create implementations.\r\n\r\nAt the same time, without a clearer discussion of users problems unlocking which the adoption of Cardano can be accelerated, it is not clear how much impact can be achieved from the funds requested.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a detailed discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposal defines some metrics (the transaction growth, etc.) that can help track the activities resulting from this initiative.\r\n\r\nAt the same time, the proposal can be stronger if it included measures to track progress towards implied objectives (missed opportunities in adoption). For example, some of the following metrics can worth the consideration:\r\n1) the share of transactions resulting from cross-chain activity brought by this initiative.\r\n2) the % of Cardano users using apps with cross-chain support brought by this initiative.\r\n3) the developer satisfaction with Cardano tech stack in comparison vs that in alternative ecosystems.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.\r\n", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 26, "ne": 5, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "Interoperability is one of Cardano's core missions thus proposals promoting bridges to other chains are key to the achieving this mission.", "q0r": 5, "q1": "The community member who proposed this chose a modest amount to assign to this challenge specifically for the community to be able to efficiently address this challenge, and scale it in the future as required.", "q1r": 5, "q2": "Success criteria and metrics as they are defined by the proposing team are set correctly to measure progress in addressing the cross-chain challenge.", "q2r": 5, "assessor": "z_assessor_1017", "no_vca": 29, "ne": 2, "ng": 15, "nfo": 12, "vca_o": 1}, {"q0": "The challenge makes a good case for how it matches all 3 of the Fund 8 strategic goals to achieve Cardano's mission.", "q0r": 5, "q1": "The challenge budget is moderate and there is little overlap with other potential challenges so the community has the capacity to address the challenge.", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "The important of this project is explained really well in the challenge setting. Good initiatives for interoperability will put Cardano more then ever in the focus of Blockchain enthusiasts and will provide a space for many valuable projects. A collaborative blockchain environment will also have a huge societal impact.", "q0r": 5, "q1": "While only a limited part of the Catalyst Community has the capabilities to adress this challenge, some actors have already shown now that they are up for this challenge, so I am positive a sufficient amount of proposals will be provided for this challenge. The challenge has a credible challenge team and it is credible to achieve results in the set milestone times.", "q1r": 5, "q2": "The metrics are set up right matching the topics and make it quite possible to plan matching, auditable proposals.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "Entering the Basho era which emphasized scalability and interoperability, I couldn't agree more that we need to have this topic in Fund 8 and on. I believe Cardano can reap the benefit from other blockchain users and vice versa. With this Cardano will have a better image not only in the crypto space but also further with more mainstream audience going on when crypto adoption is getting more popular. The target blockchain partners are also well-selected and we can learn much through their perspectives.", "q0r": 5, "q1": "I believe the community have enough member with decent knowledge of other blockchains in general and knowledge of interoperability topic in particular. The proposers can be a good starter in guiding this topic while familiarizing the community through Townhall, 360, etc. We can see a large enough number of proposals coming in when the Fund8 is launched and having it now when we are in the early stage of Basho will be a very precise timing.", "q1r": 5, "q2": "The elaborated metrics are accurate and on point. Perhaps we can also add some metrics like Cardano's public image score measuring the number of positive and negative mentions related to Cardano in platforms such Twitter and Reddit. It will also be nice to see some numbers in the metrics such as target numbers of proposal, cross-chain projects emerging next year, co-hosted events, etc. Still, this will be the key initiatives we need for Cardano going into 2022 and I am very excited to see the implementation and resulting growth.", "q2r": 5, "assessor": "z_assessor_943", "no_vca": 15, "ne": 5, "ng": 9, "nfo": 1, "vca_o": 1}], "importance": "区块链的互操作性和多链意识保证了整个加密经济的共同成功。", "success": "项目催化剂和其他社区之间合作创造价值。我们欢迎技术性和非技术性的倡议。"}