{"id": 381894, "author": "pace", "title": "Cardano Contributors League", "url": "https://cardano.ideascale.com/a/dtd/381894-48088", "category": 26257, "amount": 800000, "description": "我们如何能让更多的人在Cardano内部全职工作？", "funded": 1, "upvotes": 37992266, "downvotes": 14825360, "votes_result": 23166906, "votes_cast": 216, "f6_no_assessments": 5, "f6_rating": 3.733333333333333, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=25101"], "media": [], "f6_assessments": [{"q0": "这项挑战充满了矛盾的目标和机制。1）。挑战书要求评估者解决影响问题。这一部分的说明被标记为 \"一致性\"（而不是影响），并建立了一个非常高的标准。要求评估者同意或不同意该挑战 \"对实现Cardano的使命至关重要\"。作为一个实验，这很有趣。但如果不要求将 \"任务关键目标 \"作为奖励的基础，挑战书就不符合这一标准。如果我们考虑影响，（撇开一致性不谈），一般的机制（在Catalyst/Cardano空间资助6个月的全职工作，虽然有吸引力，但16个人对追求非常普遍定义的目标的社区的可能影响可能不大。还有其他矛盾的方面，但这些对我来说足以证明我可以授予的最高评级--3星--不同意或不同意。", "q0r": 3, "q1": "同样，挑战书似乎有矛盾。选择的标准（由社区投票批准资金申请是一个太远的桥梁。承诺是不明确的。对某人或某些团体在短期内 \"分配任务 \"的期望表明（就像本挑战书的其他方面一样），一些权威人士可以指导受资助者改变他们正在做的事情，以解决一些以前未知的问题。无论受资助者是否有正确的技能来攻击和尝试解决这个问题。谁来决定？会是挑战小组吗？这个由5人左右组成的委员会从什么地方获得权力，将受资助的人重新安排到新的任务。总而言之，这项挑战赛试图一下子包括太多东西。咬得太厉害了。我可以看到，如果获得批准，按照提出的方案，挑战赛很快就会在实施中陷入瘫痪。当16个人收集5万美元时。或者，如果他们不按照指示做，他们的资金就会被切断？(摘自简报：\"灵活--如果贡献者能够在快速发展的环境中灵活应变，并转移到他们能够产生高度影响的地方，那么他们就会产生最大的影响。\"", "q1r": 3, "q2": "挑战书再次出现了矛盾。每周的进展报告可能毫无意义，即使受资助者正在做一些有益的事情。许多指标似乎只是将受资助者描述为有帮助的人。仔细看看简介中的 \"对成功的候选人有什么期望？\r\n\r\n支持生态系统 - 贡献者应该专注于为生态系统提供最高价值，并寻求解决社区当时面临的最大问题。[谁来决定这些问题是什么？］\r\n支持社区 - 贡献者应该了解生态系统，并能够在需要时帮助社区。这可能是回答问题，把人们引向正确的资源，或者让人们更多地认识到生态系统的不同领域需要支持。\r\n\r\n高度合作 - 贡献者有能力成为将社区凝聚在一起的粘合剂，并确定重叠和重复的工作。贡献者花时间了解不同的相关项目，并在对他们和生态系统有利的情况下将这些项目结合起来，使社区受益。\r\n\r\n高参与度--为了成为高效的贡献者，他们需要尽其所能地了解整个生态系统正在发生的事情。贡献者可以明智地专注于生态系统中的一个或几个领域，在那里他们确保自己是最新的，并了解问题、项目、团队和路线图。\r\n\r\n灵活 - 贡献者如果能够在快速发展的环境中灵活应变，并转移到他们能够产生高度影响的地方，那么他们就会产生最大的影响。\r\n\r\n最著名的类似项目是麦克阿瑟基金会的赠款（无附加条件），250美元，为期12个月。与50美元/6个月相比，并没有大的变化。他们要求零报告。但他们会选择特别有才华的人。而且没有人可以申请。来自他们的网站。\r\n\r\n\"将不受限制的奖学金颁发给有才华的人，他们在创造性的追求中表现出非凡的独创性和奉献精神，并有明显的自我指导能力。\r\n\r\n关于该计划\r\n麦克阿瑟奖助金是一项625,000美元的无条件奖助金，颁发给具有非凡天赋和创造力的个人，作为对其潜力的投资。\r\n\r\n遴选研究员的标准有三个。\r\n杰出的创造力\r\n基于重大成就的记录，未来有可能取得重要进展\r\n研究金促进后续创造性工作的潜力。\r\n麦克阿瑟研究员计划旨在鼓励具有杰出才能的人追求自己的创造性、智力和专业倾向。根据这一目的，基金会直接向个人而不是通过机构颁发研究金。获奖者可以是作家、科学家、艺术家、社会科学家、人文主义者、教师、企业家或其他领域的人，无论是否有机构关系。他们可以利用他们的研究金来提高他们的专业知识，从事大胆的新工作，或者，如果他们愿意，改变领域或改变他们的职业方向。\r\n\r\n虽然被提名人的成就会被审查，但该奖学金不是一个终身成就奖，而是对一个人的原创性、洞察力和潜力的投资。事实上，麦克阿瑟研究员计划的目的是使获奖者能够发挥自己的创造本能，为人类社会造福。\r\n\r\n基金会不要求或期望麦克阿瑟奖获得者提供具体的产品或报告，也不对获得者在奖助金期间的创造性进行评估。麦克阿瑟奖助金是一个支持人而不是项目的 \"无附加条件 \"的奖项。每项研究金都有625,000美元的津贴，在五年内按季度等额支付给获奖者。", "q2r": 3, "assessor": "z_assessor_251", "no_vca": 17, "ne": 9, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe underlying problem of incentivizing high-contributing members is important and supports one of Fund8 objectives - grow the number of contributors.\r\n\r\nAt the same time, I believe that the specific solution of introducing full-time roles is not aligned with the strategic objectives of Fund 8 because spending a chunk of budget of full-time positions, minimizes the chance of part-time involvement of new contributers and new contributors provide a higher chances for spreading word of mouth (due to uniqueness of each individual's private networks).\r\n\r\nIn my opinion, the current project-based model is already flexible enough to fund individuals (they just need to propose problem areas they plan to work on + KPIs) for 6+ months. Furthermore, the project-based model makes it much easier to deliver the return-on-intention for the funds allocated (a clearer connection between funding and outcomes).\r\n\r\nTo make this proposal stronger, I would suggest a much more thorough analysis of how and in which-cacses full-time positions can bring more return on intention! The arguments about tax benefits, etc are not sufficient since solving the right problems orders of magnitude more impactful than saving 20-30% on taxes.\r\n\r\nI have made the following deductions:\r\n- 2 points for not directly supporting any of Fund 8 strategic goals.\r\n- 1 point for suggesting a solution instead of clearly articulating problem by providing relevant analysis and the eveidence of impact.\r\nMy rating is 2.", "q0r": 2, "q1": "The proposal is feasible and simple to implement, since all it requires is for contributors to submit proposals for funding, which is already a widespread practice in the community.\r\n\r\nAt the same time, I have reasons to believe that proving full-time positions would solve all the community problems with regards to incentivizing more members for contributions since it is likley to affect only a small fraction of them due to the limited funding.\r\n\r\nI have made the following deductions:\r\n- 1 point for the limited influence on the behavior of all the contributors in the community.\r\nMy rating is 4.", "q1r": 4, "q2": "While some of the metrics (the number of contributions, events, etc.) help track the activity, the proposed metrics don't provide insights into the efficiency of the full-time model as compared to the project based funding - which is the key assumption behind the proposal.\r\n\r\nThe proposal can be stronger if it considered comparative metrics as well: the number of contributions(commits, events,etc.) from from full-time community vs the project-based comminuty and the satisfaction of the community with the incentives scheme.\r\n\r\nI have made the following deductions:\r\n- 1 point for not tracking the impact on the underlying objectives (more contributions from the community).\r\n- 1 point for not considering competitiveness and community satisfaction.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 23, "ne": 6, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This challenge pays a small group of contributors which at least partially aligns with Cardano's mission.  To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "This challenge heavily overlaps with the Catalyst Circle and potentially the proposed Catalyst Technical Council. The deliverables of participate, collaborate, support and report seem rather light for a self-defined 6 month contract, especially given the large budget request. I doubt the Catalyst community has the capacity to address this challenge given the large budget request.", "q1r": 3, "q2": "The key metrics and success criteria are adequate but a little light in measuring progress in addressing the challenge.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This challenge is critical to achieving Cardano's mission, since human resources are required to upgrade this ecosystem, therefore, full-time community members, especially full-time CA and vCA play a very important role. Therefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 5.", "q0r": 5, "q1": "Undoubtedly, the Catalyst community has the capacity to address this challenge. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "Suggested metrics are logical and measurable to measure progress in addressing the challenge. Therefore, based on the given information, I strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Of course having more people working full time as their main job will help the Cardano Catalyst community to become more stable and grow faster, at least in the early stages. However, Cardano appeals to participants because of its transparency and freedom, which, with a more focused and specific group of people, can create a bureaucratic system. Moreover, there are now many people working full time for the benefits of the community and I believe that just increasing the benefits will increase this number of people.", "q0r": 3, "q1": "The Catalyst community can assess which candidates are suitable for the challenge. The number of people participating in the challenge is also promising because the challenge creates new serious jobs and will attract existing people who already have an interest in the activities of the Cardano community. However, there is a risk that the number of people who want to work full-time is small, people only participate in the community as a hobby or part-time job.", "q1r": 4, "q2": "The challenge is very well defined with key metrics, what should be included in the proposal, what is expected from successful candidates, what should contributors report, what sort of candidates are most suitable, what candidates may be less suitable etc", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "importance": "Cardano需要更多的社区成员在生态系统中全职工作，这样它才能发挥其潜力。", "success": "解决Cardano中重要问题的社区成员得到资助，以便他们能够在生态系统中全职工作。"}