{"id": 381990, "author": "rivenbark", "title": "Cardano Challenges", "url": "https://cardano.ideascale.com/a/dtd/381990-48088", "category": 26257, "amount": 25000, "description": "催化剂如何解决更广泛的Cardano社区面临的具体问题，同时让更多人有机会参与其中？", "funded": 0, "upvotes": 23902097, "downvotes": 26664735, "votes_result": 2762638, "votes_cast": 171, "f6_no_assessments": 6, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims to improve the problem solving capacity of Cardano community and improve participation.\r\n\r\nAt the same time, the proposal does not discuss specific issues in the current process improving which a noticeable can be created.\r\n\r\nIn addition, the proposal does not provide examples of similar success stories to help evaluate the potential impact and necessary resources.\r\n\r\nLast but not least, the current definition is too unspecific to strongly support one of Fund8 strategic goals: grow the number of contributors, make Cardano into an open-source project, and grow the dev and app ecosystem.\r\n\r\nI have made the following deductions:\r\n- 2 points because this initiative does not support any of the strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of the current problem through specific use cases.\r\n- 1 point for the lack of a clear analysis of the ability to achieve a noticeable impact.\r\nMy rating is 1.\r\n", "q0r": 1, "q1": "The Catalyst community is well positioned to participate in innovative projects of many kinds.\r\n\r\nAt the same time, the lack of specificity in the definition of this challenge, makes it hard to say which specific skills and resources can be needed. In addition, it is not clear which potential technological, regulatory or political roadblocks could be present.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of clarity in the problem setting.\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 2.\r\n", "q1r": 2, "q2": "The proposal defines some metrics (specific community based problems solved, benefits from the solution, etc.) which could allow to track progress. However, most are ambiguosly defined for a regular and precise tracking. For example, how specificly to compute the benefits?\r\n\r\nIn addition, the proposal does not provide a way to evaluate:\r\n1) the relative impact of the initiative on the Cardano community.\r\n2) the user/community satisfaction with the created solutions in comparison vs alternatives.\r\n\r\nI have made the following deductions:\r\n- 1 point for the ambigous definitions for most metrics.\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 2.\r\n", "q2r": 2, "assessor": "z_assessor_1011", "no_vca": 27, "ne": 7, "ng": 14, "nfo": 6, "vca_o": 1}, {"q0": "The challenge is sort of an open ended wild card, although the solutions are supposed to help Cardano so it at least partially aligns with the mission. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "Based upon the description, it is not clear to me how this challenge would function. Is the idea that proposers submit problems that when solved would direct the funds to the solution provider or is it that proposers submit a solution to a problem which they get funded for if their proposal is successfully voted for? The challenge needs some copy editing however the funds requested are minuscule compared to the total budget. ", "q1r": 3, "q2": "The challenge needs some copy editing in general and specifically around the success criteria and metrics to provide clarity of intent. To improve challenge: better articulate how the success criteria address the challenge and how the metrics can measure progress towards the success criteria.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "I can understand what is meant by this challenge, and an approach of adressing very concrete problems with various solutions sure might be quite beneficial to both society and Cardanos mission. However the overall formulation of this challenge is a bit fuzzy and could be formulated more concretely and comprehensible.", "q0r": 4, "q1": "The overall formulation of this challenge is a bit fuzzy and could be formulated more concretely and comprehensible. This makes it hard to provide feasible solutions. The challenge team is in order and solutions should be providable in a timely manner.", "q1r": 4, "q2": "The metrics should be more related to the solutions for this challenge than to the output derived from those. Still however, these metrics seem auditable. They could be more structured.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This proposal seems to be proposing that we need a challenge setting? It is very confusing as we already have this exact type thing which is where this proposal was submited.", "q0r": 3, "q1": "The cardano community has the capacity and bandwidth to address problems in the world and bring them to the forefront of catalyst through challenge setting.", "q1r": 5, "q2": "The criteria doesn't go into much detail, but on the surface those are important measurables. The main point of the challenge setting is to solve community problems.", "q2r": 3, "assessor": "z_assessor_612", "no_vca": 19, "ne": 1, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "This challenge is quite unclear / remains very abstract, there are 2 issues that should be clarified: (1) How does Catalyst currently not try to address problems the Cardano community facing? \r\n(2) How is participation opportunity hindered right now? By clarifying these issues, we might see the urgency of why we need this challenge.\r\nTherefore, based on the given information, I disagree with this proposal's alignment, I can rate the alignment of this proposal with a score of 2.", "q0r": 2, "q1": "As mentioned, since this challenge remains very abstract [ for (1) the reason why we need to form this challenge; (2) Unclear definition of success; and (3) some metrics are hard to measure (ex: how to measure \"Benefit derived from solution\" ?]. As a result, I am neutral that the Catalyst community has the capacity to address this challenge. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate the feasibility of this proposal with a score of 3.", "q1r": 3, "q2": "Suggested metrics are logically set to measure progress in addressing the challenge, but it is not quite measurable [ex: how to measure \"Benefit derived from solution\" ?]. Therefore, based on the given information, I am neutral with this proposal's verifiability, I can rate the verifiability of this proposal with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "This is not a bad idea, a good way to grow the community more on par with the great communities around the world. However, as part of the Cardano Community, everyone wants it to grow and grow even more. We create cutting-edge technologies and bring them to life. The solution you give does not say how to develop it. In my opinion we need to listen to users' opinions. People who believe in the Cardano community and the ADA coin. With rewards, everyone who has contributed to building this community is rewarded and recognized. Create technology algorithms to build and facilitate the development of the technology age. In addition, you can point out the weaknesses that exist so that the representatives of the community can develop. For example, the usefulness of the wallet is sufficient or the use of the ADA coin.", "q0r": 4, "q1": "To increase the feasibility, I hope that with this proposal, you will have a clear roadmap and KPIs to implement the solution you propose. You can introduce people to your profile, background and experience. The routes will help Cardanian trust and support you more.", "q1r": 2, "q2": "With $25,000, I believe you have a plan to grow the Catalyst community. However, let everyone know how you will allocate this money most effectively. You will develop web or develop ADA coin or invest in wallet. If you can figure it out, I believe you will make a great contribution to this community", "q2r": 2, "assessor": "z_assessor_710", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}], "importance": "这种方法使催化剂资金能够用于一个特定的、经过投票的解决方案（如X奖），这对每个人来说都更容易获得。", "success": "此外，针对特定解决方案的挑战与要求和赏金，以奖励任何创造特定解决方案以帮助Cardano的人/团队"}