{"id": 384659, "author": "yutazzz", "title": "Encourage DeFi/Dapps/NFT project", "url": "https://cardano.ideascale.com/a/dtd/384659-48088", "category": 26257, "amount": 200000, "description": "现在，有几个DeFi和Dapps项目被开发出来。我们如何区分好的项目和骗人的项目？社区意见很重要", "funded": 1, "upvotes": 77899937, "downvotes": 21442240, "votes_result": 56457697, "votes_cast": 281, "f6_no_assessments": 4, "f6_rating": 1.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe proposal's objective is to encorage development of DeFi/Dapps/NFT projects directly supports the Fund 8 strategic goal of growing the dev and app ecosystems.\r\n\r\nAt the same time, the proposal does not provide details on how it will be different from bigger (with regards to funds requested) proposals in the same area, such as DApps and Integrations, Open Source Dev Ecosystem, and Dev Ecosystem.\r\n\r\nI have made the following deductions:\r\n- 1 point because this initiaitve supports only one of three strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this user segment can bring high ROI to the community.\r\nMy rating is 3.", "q0r": 3, "q1": "The Catalyst community is well positioned to support development of new Dapps and blockchain solutions.\r\n\r\nHowever, the description of the pros and cons of the voting process, leaves the question open - how specifically the funded projects will be selected: using the current Catalyst process or not? If not, the porposal can be risky since the links to existing implementations of the new funding process were not provided.\r\n\r\nLast but not least, the requirements for participating projects are a little ambiguous. Perhaps it could help if the proposal defined the requirements with respect to the expected delivery dates (e.g.: no later than in 6 months since the funding).\r\n\r\nI have made the following deductions:\r\n- 1 point for ambiguous requirements.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.\r\n", "q1r": 3, "q2": "The proposal defines metrics (the number of apps, ADA volume etc.) that can track some progress.\r\n\r\nAt the same time, these metrics could be improved to show the relative impact on the cardano ecosystem and the incremental contribution of this project. The following metrics could be considered to make the proposal stronger:\r\n1) the % of users brought to Cardano through the new apps.\r\n2) the user satifaction with the new apps with the alternatives.\r\n3) the cost per new onboarded user and new developer in comparison to other challenges.\r\n4) the user satisfaction with apps built within this proposal in comparison vs competitors.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 22, "ne": 4, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "It's very hard to understand what the objective of this challenge would be. Is it to promote creation DeFi/NFT projects and dApps ? Or is to check/improve the quality of existing projects (or has you mention: \"distinguish the good project and scam project?\"). If the first, note that there are already a number of challenges running that cover these topics namely \"Boosting Cardano DeFi\", \"DApps & Integration\" amongst others. If the later then that would be a more unique challenge, but the brief will need to be further worked on and refined. It's clear that English is not the first language of the proposer, so i would recommend joining forces without with someone who can translate your ideas into a clear and objective challenge brief. As it's written i strongly disagree that this challenge is critical to the Cardano mission.", "q0r": 1, "q1": "As it is not clear what the goals and objectives of this challenge are it would be very hard (and unproductive) for the community to try and address it.", "q1r": 1, "q2": "A few metrics are defined but they are hard to understand. 1 - \"Entry number of Dapps, DeFi, CNFT and other projects\" is this the number of DApss/DeFi/CNFT projects proposed or created ?  2- \"The treat volume of ADA or other Crypto Asset in the Dapps ,DeFi, CNFT\" i guess you mean total volume locked ? this would be a relevant metric. 3 - \"How many project were encouraged by this setting.\" this is just a different way of describing your first metric", "q2r": 2, "assessor": "z_assessor_125", "no_vca": 27, "ne": 5, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "This challenges wording is difficult to understand. There are many separate ideas mentioned in this challenge. The challenge creator states that the community opinion is important for distinguishing good from bad actors in Cardano DeFi ecosystem, but there is no further development on that statement.\r\n While examining this challenge by referring to the three fund 8 strategic goals, I could not find an alignment in this challenge.\r\n", "q0r": 1, "q1": "The challenge cannot be addressed properly because connection between the challenge statement, success metric and key metrics for measure, is inconsistent. It is very difficult to read and understand this challenge. I suggest to go back to the main idea and seek cooperation with someone with good English language skills.", "q1r": 1, "q2": "The key metrics for measure that are written in the challenge, they seem to be directed towards the challenge proposal itself and not towards future proposals in this challenge.\r\nThe metrics need to be redefined. ", "q2r": 1, "assessor": "z_assessor_276", "no_vca": 19, "ne": 0, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "The wording of this challenge is difficult to understand and may be a translation from another language. A copy editor should be used to improve clarity. The intent appears to be to improve the quality of DeFI and Dapps projects through the creation of a guide and community feedback. It is not clear whether this is a challenge to create such a guide/feedback mechanism or a proposal for a specific solution.", "q0r": 3, "q1": "It is so difficult to discern the intent of this challenge that the Catalyst community cannot effectively address the challenge without major clarifications.", "q1r": 2, "q2": "The success criteria and metrics are not clear enough to measure progress in addressing the challenge. Recommend partnering with a copy editor or translator for the next fund round.", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 16, "nfo": 2, "vca_o": 1}], "importance": "在开始之前，没有最好的方法来检查DeFi和Dapps。然而，我们可以在催化剂启动后鼓励 \"诚实项目\"。", "success": "这项挑战的目标很简单。当我们成功地鼓励催化剂的早期DeFi和Dapps项目。这就足够了。"}