{"id": 384806, "author": "rodrigopacini", "title": "Raising small ghosts, SPOs and devs", "url": "https://cardano.ideascale.com/a/dtd/384806-48088", "category": 26257, "amount": 300000, "description": "如何在Cardano社区筹集小型SPO和开发人员？", "funded": 1, "upvotes": 52387904, "downvotes": 19044145, "votes_result": 33343759, "votes_cast": 258, "f6_no_assessments": 6, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe proposal aims to create more independent Stake Pool Operators, which is inline with Fund8 strategic goal of increasing the number of contributors.\r\n\r\nAt the same time, the proposal does not provide a detailed analysis of the stated problem of potential centralization. Providing the following data points would make the proposal stronger:\r\n1) what is the current level of centralization?\r\n2) how big is a typical SPO?\r\n3) what's the current growth rate of new SPOs?\r\n4) What % of all staked coins belong to smaller SPOs?\r\n5) what is the ideal/targeted number of SPOs on the platform to guarantee its stability/security?\r\n\r\nIn addition, the proposal does not present a rationale why the requested funds would be sufficient to have a noticeable impact on the problem.\r\n\r\nI have made the following deductions:\r\n- 1 point because this objective supports only one of three strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of the problem.\r\n- 1 point for the lack of a discusion of the ability to achieve a noticeable impact.\r\nMy rating is 2. ", "q0r": 2, "q1": "The cardano community can definitely provide financial and educational resources and other support to increase the number of independent stake pool operators.\r\n\r\nAt the same time, the proposal did not provide the details on the current level of centralization the causes of it. Without an understanding of those, it's hard to expect that a noticeable progress is possible.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a discussion of the underlying causes of the issue, making it possible that the funds won't have a noticeable impact.\r\n- 1 point for the challenge team out ouf one member, reducing the ability to support and provide advice to participants.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposal defines metrics (the number of new pools, % of delegation, etc.) that can help track the progress towards the stated objective.\r\n\r\nHowever, given the underlying intention of preventing the 51% attack and keeping the network stable, the proposal would be stronger if it analyzed the impact on the problem:\r\n1) the likelihood and cost of a 51% attack.\r\n2) the changes in the likelihood and cost due to the projects within this initiaitve.\r\n3) the comparison of the likehood and cost vs those of competitive ecosystems.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluting the impact on Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluting the competitiveness.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 21, "ne": 5, "ng": 7, "nfo": 9, "vca_o": 1}, {"q0": "The challenge aligns with the mission to prepare a group of people willing and able to make contributions to the ecosystem. At a broader level the challenge attempts to address the creeping centralization of SPOs which does threaten to undermine the decentralized foundation of Cardano. To improve challenge: better articulate how the challenge aligns with more than 1 of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The proposal states in \"Fund7 we had two challenges funded related to SPOs and there is a good demand for proposals in these challenges\" which is a solid argument that the community has the capacity to address the challenge. To improve challenge: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds).", "q1r": 4, "q2": "The success criteria and suggested metrics are excellent.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "This challenge will help with encourage further decentralization of the Cardano network.  There have been more conversations around low saturated, single pools and small pools and their ability to survive in the Cardano community and there should be more innovation in this area.", "q0r": 4, "q1": "The Cardano community is currently talking about single pools, low saturation pools and barrier to entry of new SPOs.  There are good ideas in the community that could take advantage of this challenge and the timing for this challenge is good.", "q1r": 4, "q2": "The suggested key metrics will help measure the SPO diversity and longevity.\r\nAnother proposed metric might involve increasing saturation in lower saturation pools.", "q2r": 4, "assessor": "z_assessor_674", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "This idea for a challenge in F8 is designed to attract and retain small Stake Pool Operators (SPO's) and developers. It's argued here that small SPO's are both essential to decentralisation but have a high turn over due to a lack of delegators. This challenge idea would target small SPO's and support them to have greater access to funding and distribution. \r\n\r\n\r\nThis would assist Cardano by increasing the number of small SPO's and developers and assists with decentralisation. It also assists in finding new funding mechanisms outside of catalyst for small developers and provides rapid ongoing project funding in a new way. ", "q0r": 5, "q1": "The purpose of this challenge is to attract / support SPO's and developers to the Cardano community. The challenge welcoms at least 5 different proposals in the round with a capped challenge amount per proposal. \r\n\r\n\r\nConsidering the talent in the community already it is likely that this project will see outcomes within the 6 months of the Challenge. ", "q1r": 4, "q2": "The impact of this challenge can be tracked by some key metrics eg by the number of creative ways developed to support and promote small SPO's, new funding models built around SPO's and the adaption of wallets to support ways to delegate to multiple SPO's.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This challenge aims at strengthening small SPOs and developpers, through new tools and services. \r\nIt is indeed essential to Cardano's mission to achieve a great and true decentralization, and this challenge states that this objective requires supporting smaller actors among the community.\r\nThis challenge articulates with #1 Fund8 strategic goal, that is growing the number of people able to make contribution to the ecosystem.\r\nI strongly agree that this challenge is aligned with Cardano's mission and Fund8 strategic goal.\r\n", "q0r": 5, "q1": "The challenge setting lists several potential directions, open enough to receive many proposals and narrow enough to focus on the challenge objective that is supporting smaller SPOs.\r\nBy limiting to 20% of the total funding for each team, this challenges makes sure many various ideas will be funded (at least 5), diversity is source of performance!\r\n2 challenges in Fund 7 are related to SPOs and they received a lot of proposals (51 !), so there is no doubts that the community will be in a capacity to address the challenge. \r\n", "q1r": 5, "q2": "Suggested metrics are based on measuring small pools health (creation/retiring) and delegation. For example, it is suggested to measure the number of delegates over time for pools benefiting from proposal funded by this challenge. It is also suggested to measure the delegation distribution in all pools over time.\r\nMeasuring the impact on pools directly benefiting from proposal funded by this challenge is achievable. However, it will probably be difficult to isolate the impact of this challenge over the whole Ecosystem, as there could be other sources of impact on the delegation distribution for example.\r\nI agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 14, "ne": 6, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The process of raising and how raise small SPOs to ADA community and Developers of CARDONA community,\r\nThe challenge is very important for future Missions of Cardona.", "q0r": 5, "q1": "The Catalyst has many number of onboarded devs outside catalyst , Many Teams , Multiple number of Pools created, many delegates, There idea of increasing greater decentralization and resilience in the blockchain with small and more SPO has the capacity to address the challenge.", "q1r": 5, "q2": "The proposer has provided enough details on how the use funds and on which for period of time from 3-6-12 months,\r\nall the Teams from A,B,C,D has enough experience for the proposal,\r\nThe success criteria and given metrics set are correct,\r\nso they can measure the progress in the addressing challenge.  ", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 27, "ne": 2, "ng": 13, "nfo": 12, "vca_o": 1}], "importance": "通过小型SPO和开发者的可持续性/可行性，在区块链中实现更大的去中心化和复原力。", "success": "小型SPO和开发商有更多的选择、服务和工具来获得代表和资金+在区块链中更大的分布。"}