{"id": 381158, "author": "danbonfil", "title": "LATAM Community DID", "url": "https://cardano.ideascale.com/a/dtd/381158-48088", "category": 26254, "amount": 24000, "description": "在拉美地区，人们几乎不知道SSI/DID，更不用说它们的好处。如果没有社区赋权或归属感，就不可能采用。", "funded": 1, "upvotes": 52195819, "downvotes": 8573001, "votes_result": 43622818, "votes_cast": 194, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "我发现提案的作者如何寻求他所使用的首字母缩写词的读者的背景，这是非常积极的。通常情况下，作者有一定的技术知识，在他们的提案中使用首字母缩写词，所以并不是所有的评审员都能100%的读懂和理解。我想强调 \"平等化 \"理解的重要性，这里就做到了这一点。在与项目有关的方面。我相信是的，这是与挑战赛的目标一致的。这项挑战旨在进一步鼓励采用区块链Cardano所倡导的去中心化身份，是f6中提出的挑战的延续：Atala Prism。这里的想法恰恰是，通过提供一个基础课程，在整个拉丁美洲的领土上促进去中心化身份的使用。作者的理由是，在大多数情况下，这个地方的人不知道它的优势，而这个建议的目的正是要把这种信息带给民众。我认为这也很好，因为它不仅实现了这一挑战的目标，而且还与这一基金的另一挑战有关，即关注拉丁美洲。作者在 \"为什么这很重要？\"这个问题上很好地论证了你的项目的正确性。这里没有必要重复他提到的观点，但事实上，拉丁美洲是一个不幸非常不平等的大陆，当一些人赚了很多钱并拥有所有可支配的技术时，其他人仍然有例行的探索工作，不知道/不了解一些技术（如有关的技术）可以提供的好处。因此，我相信这个项目如果得到资助，会有很大的影响。", "q0r": 5, "q1": "作者很好地解释了他的项目到底会是什么，以及如何发生的。它告诉你细节是什么，还提供了一个脚本，这个脚本相当详细，但可以更详细。它根据时间的流逝对活动进行了分解，在主题中列出了在这些间隔中会发生什么。在我看来，如果他每个月都做这样的拆分，那就更好了，这样我们就能完整地看到项目将如何随着时间的推移展开。然而，所告知的内容足以让我们能够令人满意地将其可视化（尽管并不完美）。关于团队。我认为作者没有正确地详述这一部分。首先是因为他没有正确地介绍自己，我们不知道他的培训领域是什么，以前的经验以及他是如何参与Cardano的。他给了我们他的linkedin，在那里我们可以了解他，但重要的是在提案本身有一个关于他是谁以及到目前为止他做了什么的最低限度的细节。作者介绍了一些合作伙伴，但情况是一样的，他提供了一个链接，我们可以通过它了解他们的提案，但我想知道他们的名字、培训领域等。我不认为每个合作伙伴的一点简历会很重要，不如我们很好地了解作者的情况重要。我们设法找到了他们是谁，但这些基本信息应该包括在提案本身中。而关于预算，我觉得2.4万的数值对于项目所宣称的内容来说是公平的。这个价值被分为几个主题，这让人很好地理解了它的使用方式。然而，我认为，再一次，可以有更多的细节。例如，在第一个主题 \"介绍性课程和研讨会：4000美元\"。所有讲习班的价格是否都一样？这笔钱究竟如何用于开办讲习班？创建的内容，托管，等等...无论如何，我相信作者在总体上为我们提供了一个很好的预算和过程的概述，即使缺乏细节，在我看来，最有待改进的部分确实是团队介绍。", "q1r": 4, "q2": "你可以根据 \"项目细节 \"主题中提供的信息对项目进行审计。我们还可以监测路线图中描述的活动。关于结果，可以通过 \"成功情况如何 \"的主题来监测。换句话说，提案的作者为我们提供了足够的材料来了解将会发生什么，如何发生，以何种顺序和愿景，哪些最终产品。这使得你的提案很容易被审计，只要我们选择有技术准备的人去做这件事。可以选择一些社区成员来参与阿塔拉棱镜项目；如果他们是拉丁美洲的本地人，那就更好了。我还认为，因为这是一个非常复杂的项目，充满了方方面面，所以作者和他的合作伙伴一起，收集关于渐进式结果的信息，而不仅仅是几个月后的最终产品，这很重要。他可以向社区提供这种反馈，以便向大家介绍他的建议的进展情况。是的，我相信这个话题已经被很好地涵盖了!", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 13, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nI will try my best to better presenting my background and that of my partnerships.\nYou're right an important part of the Budget is allotted to workshops and marketing, these aim to generate presence both online and offline. For this, we want to create a workshop in a hotel or restaurant lounge that allows not only for the introduction of the technologies but also for generating connections an engagement.\nWe consider at least 1 face-to-face event in Rio de Janeiro and Mexico City, we will update this for the better consideration of CAs and voters. \n\nBest,\nDaniel Bonfil"}, {"q0": "The proposal is for popularising Atala-based DID use cased using training programs and workshops on the principles of \"Patterns of Commons Ideology and the GAIN Trust Registry parameters. \" This can onboard people who will contribute to the ecosystem. LATAM is being considered in a special way in the Cardano community however the solutions so evolved are likely to be useful throughout the globe. ", "q0r": 4, "q1": "The proposer has substantial experiance and qualification in management and should be capable of carrying out the project. The process also involves use of established procedures. However any information on details of the team which will be implementing and the organization that will be coordinating the event would have added value to the proposal. ", "q1r": 4, "q2": "The KPIs are reasonably clear and implementable. The budget is reasonable; the bulk of the allotment is for website development and publicity, while the core task of organizing the workshop has been allotted with USD4000. This is a bit concerning. It can be argued that there is a need to develop online presence more; however, I feel substantial effort should be in face-to-face and on-ground events. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nYou're right an important part of the Budget is allotted to workshops and marketing, these aim to generate presence both online and offline. For this, we want to create a workshop in a hotel or restaurant lounge that allows not only for the introduction of the technologies but also for generating connections an engagement.\nWe consider at least 1 face-to-face event in Rio de Janeiro and Mexico City, we will update this for the better consideration of CAs and voters. \n\nBest,\nDaniel Bonfil"}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. The proposal identifies an important problem in the challenge that needs to be adressed. The solution seems is based on commons, self-governance and education, which fits perfectly into Cardanos mission and will be beneficial to the Cardano ecosystem. It is explained comprehensibly and matches the Key Metrics of the challenge well. Scalability should be provided considering multiplicator effects.", "q0r": 5, "q1": "The proposers are very transparent about their partnerships and the plan shows they are up for the challenge. The proposers know the type of partners required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every relevant detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 7, "ng": 4, "nfo": 7, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nBest,\nDaniel Bonfil"}, {"q0": "This project proposal could potentially help the acceleration of decentralized identity adoption in Latin America. Although the initial implementation is limited on membership and workshop certificates for community member, it could be expanded in the future for other purpose e.g. commercial, club, and loyalty pass, ID card, etc. The limited scope of this proposal is understandable given the budget requested is relatively low and only 1 team member responsible for the implementation. However, it could be better if Dany can give long term plan in the expansion of project implementation beyond 12 months or expand the scope in the proposal by adding more team member.", "q0r": 5, "q1": "Given the experience presented, it is highly likely that the proposal will be implemented successfully because deliverables, timeframe, and goals of this project are very achievable. Furthermore, in this proposal, Dany provides milestones and detailed roadmap for three, six, and twelve months and requested a reasonable budget. With the vast experiences and community involvements by Dany, I am very confident that this project could be delivered successfully. My only concern is with only one person overseeing the whole project, there is a high risk of failure in case Dany is unavailable for executing the project (e.g. he got sick). Should this proposal is funded, I suggest Dany to have a team member as a backup for himself.", "q1r": 4, "q2": "Dany will use cardano mainnet for issuing the verifiable credential that will make it open to public to audit. Problem statement and solution delivered match and address both the challenge effectively. Success criteria are relevant and feasible, making it not only auditable but also realistic. I would like to suggest the team to provide monthly report on the progress as well as budget spending in their website or cardano forum so it can be more accessible and transparent.", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 15, "ne": 7, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\nYou are right, thank you for your concern and I also agree this cannot -nor it should- be a one-man show. As of now, I am growing my team in the technical part but also I am strengthening my partnerships with further collaborations and synergies with partners that will allow for creating a standardized and scalable first-step implementation.\n\nBest,\nDaniel Bonfil"}, {"q0": "The development of an LatAm specific SSI/DID protocol is a great way to bootstrap technical understanding and adoption of decentralized identifiers in this region. ", "q0r": 5, "q1": "The proposer has an impressive set of partnerships built out for this proposal with other DID projects which are also looking to leverage Atala Prism in their solution. ", "q1r": 5, "q2": "The key metrics, roadmap and budget are sufficient to audit the progress of the proposal. ", "q2r": 5, "assessor": "z_assessor_789", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nBest,\nDaniel Bonfil"}], "solution": "遵循 \"共享模式 \"的思想和GAIN信托登记处的参数，促进拉美社区DID的采用和效益。", "experience": "经济学硕士，专注于量化金融、激励机制和区块链\n2022年1月：管理学博士，专注于社区政策"}