{"id": 381611, "author": "yogo", "title": "Traveler Identity", "url": "https://cardano.ideascale.com/a/dtd/381611-48088", "category": 26254, "amount": 38000, "description": "旅行者的信息被保存在多个集中的网站上，如Expedia，而用户对其没有任何控制权。", "funded": 1, "upvotes": 30741793, "downvotes": 8151619, "votes_result": 22590174, "votes_cast": 122, "f6_no_assessments": 3, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "提议的团队虽然提出了基于旅行者的DID的伟大想法，但却没有解决任何挑战设置的要求，更具体地说，就是自治、互操作性和供应链这三大类。如前所述，想法是伟大的，但是没有达到一致。建议提案小组在彻底研究了未来可能的挑战设置后重新提交。其他没有解决的领域是缺乏一个发行者或验证者。这两个实体对DID的发行和使用极为重要。如果仅仅根据 \"DID \"来评定一致性，由于该提案的模糊性，该提案仍然无法满足标准。某些领域似乎声称要做一个DID，而其他部分似乎只是整合当前的DID。", "q0r": 2, "q1": "我几乎要把它标为2分，但我认为3分更合适，因为这个建议并非不可能，而是以一种极其模糊的方式描述，使我相信这个团队不了解创建DID所涉及的复杂情况。可能，他们认为POC是一个钱包，里面装着旅行者的证件。同样，在任何地方都没有提到签发人、验证人或持有人。也没有提到这些文件将被储存在哪里，如何维护，等等。该提案缺乏必要的清晰度、深度和细节，无法获得高于3的评级。建议提案团队彻底审查他们的提案，纠正拼写错误（即Kotlin，而不是Cotland）并提供相关材料。该团队可能有接待系统的经验，但对去中心化、区块链以及更重要的DID的经验并不存在。时间表远远不够准确，除非他们只是在已经发布的DID之上建立一个服务，而据我所知，目前并不存在DID，至少在Cardano上不存在。最后，虽然不一定是要求，但在创建预算时，最好能看到分配给每个团队成员的时间。这将有助于CA以及投票者确定到底如何理解每人1500美元。", "q1r": 3, "q2": "在项目完成之前，没有明显的检查点。提议的团队很少提到可审计性，似乎在使用可能的API作为一种机制。如果没有更深入的信息，除了提供的模糊性之外，几乎不可能监测这样的项目。不管写作的效率如何，该项目完全缺少与DID相关的太多关键方面。与阿塔拉棱镜接触并不等同于与AP合作。我也参加了，棱镜先锋项目。无论提供任何声明的KPI、可审计的指标或其他信息，由于绝对缺乏细节，仍然没有一个准确的审计手段。我鼓励该团队考虑得更周全，更详细，更深入地解释该提案，并再次提出该提案。", "q2r": 2, "assessor": "z_assessor_591", "no_vca": 27, "ne": 14, "ng": 11, "nfo": 2, "vca_o": 2}, {"q0": "The proposal identifies an industry that could certainly benefit from the use of DIDs to give travelers more control over their data. Using PRISM technology to solve this problem provides a solid response to the challenge settings. What is keeping me from giving this a five-star rating is that the scope is a bit broad and vague (as described in the next section) and attempting to do too many things at once may lessen the impact of the activities. ", "q0r": 4, "q1": "The team appears to have significant experience in the travel industry. Having googled eRevMax, the company seems legitimate, established, and successful. The team demonstrates much less capability regarding the Atala PRISM team. They do mention that they have been connected to the course materials (although the mis-spelling of the Kotlin programming language used for the course does not inspire confidence).  While the technical team referenced could probably learn the coding skills needed to build the software, there is no reference to developing the required governance framework or the trust registry that would be needed to allow many different entities to work together. There is no line item in the budget for developing this documentation. The proposal does not seem aware that DID-holders will need wallets, and that currently none exist. The proposal would be strengthened by collaboration with one of the groups currently proposing to build a wallet. The proposal also does not seem aware that the PRISM technology is not yet live on mainnet. The proposal also does not reference the transaction fees incurred by establishing DIDs and publishing credentials, and there is no discussion of who would pay these fees in their business model. While the proposal mentions the risks related to government regulations about data privacy, more discussion is needed about how extremely sensitive data such as passport details and health info related to COVID status would be protected. ", "q1r": 2, "q2": "A road map is provided, although more detail could be given. The metric for the first three months is only to create the traveler DID, but in the next three months the entire rest of the trust framework is to be created and integrated into two systems. It would be helpful to break those steps into smaller pieces. The KPI references finalizing \"the full cycle from a traveler to the hotel system\" but I am not sure what that means in the context of the Trust Framework. ", "q2r": 3, "assessor": "z_assessor_662", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aligns well with the objectives of the challenge, as it seeks to create a decentralized identity so that travelers have more control over their diverse data. The problem is well contextualized and simple to understand: currently, information relevant to travelers, such as visits to websites, accommodation, tickets, etc., are out of their control (I would say they are a kind of \"cookies\", when we enter and our data is provided against our will). This solution would store such data in Cardano, giving control over who could have access to this information, which would be beneficial for the end user and would also generate new members for the Cardano ecosystem. The interesting thing here is that, in addition to having greater control over their data, users do not necessarily need to be interested in blockchain to join this project; the desire to preserve your privacy would be enough. It's positive how the authors of the proposal include what they call \"key elements\", that is, fundamental and primordial things that would make up this project - it conveys a very solid idea about what we are dealing with here and makes us fully understand the proposal. It is still quite promising that the authors intend to connect this service with other technologies of the Cardano ecosystem, as they themselves cite, wallets or travel NFTs.", "q0r": 5, "q1": "The team consists of 3 people in partnership with a company, eRevMax. They give a good summary of what this company does and a link where we can get to know more about it. They also provide individual descriptions about each of the main group members, so we have a good understanding of who we are dealing with and it is very trusting. It should be noted that we have a member here who is an expert in Atala Prism (Robert O'Brien), which is essential for the success of the proposal. In terms of team presentation, I didn't find criticisms to be made, everything is perfect. Regarding the script, the phases are somewhat superficial. There could be more detail, a breakdown of activities to be done in each time period. Development stage topics, for example, could be subdivided according to these stages. This would make the process visualization more solid and complete. What we have is enough to give an idea of ​​what will happen, but not full understanding. And finally, let's analyze the value of the financing: 36k would be the salaries, each person would receive 1.5k and the total time would be 1 year. I found it a fair value and consistent with the professional expertise of those involved. I got a little lost in the final part: what would Miscelâneos really be? I apologize for the confusion, but this is not very clear to me. In general, the budget division is very clear, I don't think it would be necessary to include any more details here. So the only improvement I would suggest is the detailing of the script.", "q1r": 4, "q2": "The proposal is auditable, for the following several reasons: to begin with, they provide us with the key elements, with this we could verify if such things were done or not (and if so, if they were created properly). The authors also define success, and with that we would have material to work with in the sense of whether the main goals were achieved. The entire process can be analyzed through the development stages and phases, it would be interesting for some (or some) members of the Cardano community to closely monitor the realization of these activities: if they are happening in the order and the way it was planned. KPIs are established, which means that bidders have thought directly about how the community could audit the bid. Finally, we have some challenges to be met, and with that it is possible to verify if these difficulties were in fact overcome. In summary, I believe it is one of the best examples of highly auditable proposals, I congratulate the authors for providing us with so much information that would serve to monitor the possible success of the idea.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 24, "ne": 12, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "基于区块链的旅行者ID将让旅行者控制分享什么和给谁分享", "experience": "在酒店分销方面有20年的经验，在酒店系统之间有大约1000次的整合。"}