{"id": 382626, "author": "kylek", "title": "Open Source Social Account Verifier", "url": "https://cardano.ideascale.com/a/dtd/382626-48088", "category": 26254, "amount": 40000, "description": "验证某人对社交账户、电子邮件等的控制权；交换信息；以及限制平台孤岛和审查制度，不应该是那么难。", "funded": 1, "upvotes": 49937354, "downvotes": 4610590, "votes_result": 45326764, "votes_cast": 149, "f6_no_assessments": 4, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "They identify the problem of a user proving the control of their account. They will ad value to the Cardano ecosystem by onboarding lots of users to Cardano by using Atala as a tool for proving their identity. The metrics of this project is in line with the challenge in the sense of user onboarding into DIDs. The project is able to scale well as they plan to make this open source.", "q0r": 5, "q1": "The relevant skills and team has been provided with proof via LinkedIn pages. The budget is reasonable and broken down into identifiable items. The launch date of 3 months for the primary goal seems achievable.  They explain in detail how their product will function, but they don't provide any technical details on how it is being built. Providing this technical info can reveal a lot about your approach and expertise, which in turn can boost voter confidence. They haven't considered any risks/challenges. Not being aware or prepared for any future risks/challenges will slow you down when they show up.", "q1r": 3, "q2": "The roadmap is broken down into 3 months. Each month has identifiable items that gets completed and gives a good picture of their approach to building this. The KPIs they provided is long term and not so much focused on the time period they are building this. Overall the progress is easy to track and the performance after the product is built is easy to track. They identify the problem of proving ownership and control of online profiles and they solve this by integrating Atala prism to create proof of control issuers. ", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 20, "ne": 3, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. The proposal identifies an interesting approach of verifying Social Media accounts via DID. The solution seems like a good new usecase for DID, thus it will be beneficial to the Cardano ecosystem. It is explained comprehensibly and matches the challenge well. Scalability should be provided assuming correct implementation", "q0r": 5, "q1": "The proposers are transparent about themselves and seem up to the task. The proposers know the type of partners required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable, however a bit course items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a detailed and rationable implementation plan. It describes the resources used. Feedback: While some more things could be adressed, like possible risk mitigation strategies regarding implementation, this is overall a good proposal.", "q1r": 4, "q2": "A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution. A roadmap is presented. Metrics and KPIs could however be formulated more explicitly.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The Proposer wants to create the first open source, proof-of-control credential issuers built on Atala Prism, they will start with the Discord channel. This project will have a positive impact on the Catalyst ecosystem. They have a thorough plan in place and the experience and skills needed to do this.", "q0r": 4, "q1": "The proposal's team is laid out with their experience and skills, and links to their LinkedIn profiles. They have the necessary skills needed for this project. The budget is laid out briefly, a more detailed breakdown would have been better. An implementation plan is presented over 3 months, and seems reasonable. The software will be made available to the public and users should be able to issue their own Discord credentials on the testnet. The risks are not discussed.", "q1r": 3, "q2": "If the software will be made available to the public and users could be able to issue their own Discord credentials on the testnet, this would be a way to track the progress by community members. A Roadmap with timeline and milestones are laid out, and this could also serve as a means to track the project.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "Decentralized identities on social media platforms is a noble concept and completely addresses the challenge at hand. This DID/social account verifier is also going to be leveraging Atala Prism. Social Media is a huge challenge when it comes to proving identity in a decentralized manner. I believe this concept is the next sensible next step for DIDs and this challenge.", "q0r": 5, "q1": "This proposal team has provided great information on the team members involved and their experience. Each member has great technical in various areas. One thing that may help the team is a marketing/social manager. In addition, they even have a good youtube video that gives a great overview.\r\n\r\nThe plan is a 3-month process with an end goal of fully implementing the verifier on the discord platform. The one future challenge that can be considered is integrating/implementing and gaining adoption on other large social media platforms with the likes of Twitter, Telegram, Facebook, etc.", "q1r": 4, "q2": "The two major contributing factors to metrics and auditing the success of this idea:\r\n1) The completion of the code for the social verifier. This is on a 1-2-3 month time frame.\r\n2) Adoption of the platform by end users.\r\n3) A future metric could be the adoption of the platform by social media platforms beyond Discord, in the future.", "q2r": 4, "assessor": "z_assessor_816", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}], "solution": "为了迈出去中心化配置文件的第一步；让我们使用Atala创建第一个开源的、控制证明的发行者。", "experience": "我们是一个由阿塔拉棱镜先锋、软件工程师（20年以上的经验）、桩池操作员和计算机科学学生组成的团体。"}