{"id": 383348, "author": "jochen.leinberger", "title": "Open Source Identity Wallet", "url": "https://cardano.ideascale.com/a/dtd/383348-48088", "category": 26254, "amount": 47500, "description": "Cardano生态系统缺少一个能够处理数字身份的开源钱包。", "funded": 1, "upvotes": 29852643, "downvotes": 10779773, "votes_result": 19072870, "votes_cast": 176, "f6_no_assessments": 4, "f6_rating": 3.9166666666666665, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=14930"], "media": [], "f6_assessments": [{"q0": "影响。\r\n问题声明。\r\n开源身份钱包提供了一种方法，通过解决没有一个可以处理分散ID（DID）和可验证凭证的开源钱包的问题来加速Cardano的分散身份景观。\r\n一个明确的目标。\r\n提议者计划为在主要平台上开发身份钱包所需的组件开发开放源码库。  他们计划通过插件为网络浏览器、iOS平台和Android平台开发这些库。  计划使用C语言在Android和iOS以及Web Assembly虚拟机（WASM）中使用。  由于其功能，在WASM中使用的C语言库的实现是特别有意义的。WASM堆栈机是高效和快速的，因为它们可以通过利用平台的通用硬件能力以本地种子的方式执行。  它们是安全的，因为它们可以在现有的JavaScript虚拟机内的沙盒环境中实现。  WASM库在嵌入网络时可以执行浏览器的同源和权限安全策略。\r\n由于每个实现都涵盖了客户端、读写加密数据、代理层和瘦身UI层，该提案似乎准备为生态体系的最大问题之一的大规模采用创造一个亟需的解决方案。  创建一个强大的后端，允许一个强大的用户体验层，安全且易于使用，将对Cardano生态系统的大规模采用有很大帮助。\r\n该项目被定位为使用Hyperledger Indy钱包组件作为参考，在一个轻量级UI层下创建构建块和库，因此，将实现互操作性。  这种互操作性将允许Cardano和Atala PRISM与其他生态系统互动。  Hyperledger Indy的一些关键特征包括。\r\n1.DIDs是全球唯一的，并且可以（通过分类账）进行解析，而不需要任何集中的解析机构。\r\n2.配对标识符，可以在任何两个实体之间建立安全的1：1关系。\r\n3.零知识证明（Zero Knowledge Proofs），证明一组Claims中的部分或全部数据是真实的，而不透露任何其他信息，包括证明者的身份。\r\n开源身份钱包项目似乎达到了目标。  它为大规模采用的一个非常关键的部分提供了解决方案，建立了一个框架，在这个框架上，易于使用的、安全的、去中心化的ID应用可以为Cardano生态带来主流。  我非常同意这个建议符合挑战的影响。评估得分 5\r\n", "q0r": 5, "q1": "可行性。\r\n开源身份钱包背后的核心理念似乎有坚实的、发达的、真实世界的资源支持。  \r\n行动计划。\r\n该项目在3个月、6个月和12个月的路线图中概述了成功。  3个月的里程碑指出了钱包组件的详细规范和API定义，包括作为其交付物的线框。  值得注意的是，钱包的API和线框似乎是完整的，并在https://github.com/IAMXID。开发团队已经完成了3个月的里程碑，证明了强大的可信度。\r\n他们计划在6个月的里程碑中准备好网络、安卓和iOS的参考实施。  \r\n在12个月的里程碑中，iOS/Android的实施、源代码文件和2022年1月6日的预期启动日期真正展示了这个团队向其最终目标的有力迈进。该项目引用了像Flutter这样的跨平台技术。  Flutter是一个真实的、强大的、基于谷歌的应用开发平台，它能提供结果，并且非常适合于前端开发与令人敬畏的后端配合。\r\n说明完成该项目所需的技能。\r\n开发团队包括。\r\nJochen Leinberger。\r\n精益和以用户为中心的数字产品开发的专家。在一家德国汽车制造商从事用户体验设计和SW开发，数字产品开发和数字产品及软件开发。曾在德国电信新产品和创新部波恩的高级项目（智能家居，娱乐，零售解决方案，支付）。是《界面原型设计》一书的共同作者。\r\n\r\n丹尼斯-米特曼。\r\n在高可用性环境下的大流量网络服务和可扩展的实时数据服务方面有20多年的经验。数据库架构师，支付-系统，统计\r\n5年多的技术领导数据库开发，8年多的团队领导网络开发，自2011年起从事区块链工作\r\n约瑟夫-弗兰克维茨\r\n软件架构师和移动应用程序开发人员，拥有约20年的开发经验，专注于前端应用程序。Cardano EAGLE池的联合创始人。Pool Peek移动应用的开发者，该应用允许用户查看和选择Cardano赌注池。\r\n蒂姆-布吕克曼。\r\n团队架构师，MBA（市场营销，控制，东亚经济），handy.de的CMO，StakeforFuture.org [AZUL]的联合创始人和股票池运营商，wunderwerk生态时尚和wunderwerk电子商务的联合创始人和前CEO，25年的市场营销和销售经验，可持续生活方式产品的专家，Jochen CTO的10年攀登伙伴，与Tim CEO合作25年，PADI潜水教练，Bundespreis ECOdesign奖得主，PETA奖得主。\r\n蒂姆-海德菲尔德。\r\n在电子商务和电子市场Scout24、Allianz24、moneysupermarket.com、preis24.de、handy.de拥有运营知识和战略专长。基于他的运营工作，Tim与商业案例和电信公司有着直接的个人联系。他的核心能力是业务发展。\r\n开源钱包团队由多个高技能成员组成，每个人都有多年的网络开发、数据库架构、支付系统和软件开发的经验。  \r\n一个预算明细。\r\n该项目似乎已经在现实世界中取得了进展，对所述问题有了明确的解决方案，并有一个预算需求明细表，清楚地划定了将项目推向下一阶段所需的内容。\r\n凭借其高技能的开发人员和商业领袖团队，该项目似乎有能力并有条件完成其任务，即提供一个真正的开源身份钱包。  评估得分 5\r\n", "q1r": 5, "q2": "可审计性。\r\n完成了他们所设定的部分目标，证明了这个团队的成就。  \r\n我相信这个团队知道自己在做什么，并且能够为Cardano生态体系增加价值。这个项目的关键性能指标在于他们在Github.com/IAMXID上链接的代码。  对于不精通编码的人/投票者来说，可能很难判断这个团队正在取得什么进展。我毫不怀疑该项目将实现其既定目标，然而，更多的工具使用，以及对开发软件的过程进行更好的描述，可以让人们更深入地了解项目的进展，最终导致该项目在开发圈之外更容易被关注。  该项目缺乏良好的可审计性，在具体的关键绩效指标方面也有些不足，而这些指标可以帮助跟踪该项目进展并增加其整体透明度。评估得分 3.\r\n", "q2r": 3, "assessor": "z_assessor_479", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem of Cardano ecosystem needing an open source wallet that can handle DIDs. They will ad value to the Cardano ecosystem by encouraging the integration of DID functionality in wallets. Paving the way for Dapps that needs DIDs. The metrics of this proposal is aligned with the Challenge in the sense of onboarding more DID use cases and users. The project is able to scale well because it will be an open source library.", "q0r": 5, "q1": "The relevant skills and team has been provided with a link to github page and links to other projects. The budget is broken down into identifiable items. Including the hours and rates per hour would be very informative instead of just one big amount for one task. The timetable of 12 months to complete this seems reasonable.  They explain all the functions this wallet will have and explains all the technical details on how they will build this in great detail. They haven't considered any risks or challenges. Not being aware  or prepared for risks can slow you down when they do surface.", "q1r": 4, "q2": "It is quite easy to track the progress of this project as the roadmap they provided shows different parts of the project being completed as milestones. They also consider this as their KPIs. They should ad more user based KPIs like pull requests or downloads to track the performance of the project post launch. They identify the problem of wallets needed to handle DIDs and they solve this by creating an open source library specifically for creating these kind of wallets.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to fill in a gap in the Atalia PRISM ecosystem by creating an open-source web based, Android and IOS wallet that supports DIDs and VCs. \tIf successful it should aid evolution of mass decentralized identity (DID) adoption specifically with Atalia PRISM.  However one comment pointed out it is nearly identical to https://cardano.ideascale.com/a/dtd/Open-Source-Credential-Wallet/382078-48088.  That proposal proposes a cross-platform wallet but it isn't clear it is Android / IOS so conceivably both projects can be useful additions. \r\n", "q0r": 4, "q1": "The expected launch date is listed as 1.6.2022 but this must be a typo given the 12 month development plan.  I suspect they meant 1.6.2023.  The team look like qualified application developers, yet don't mention the Alalia PRISM pioneer program participation.  The competing proposal listed in the Impact section has more breadth in demonstrating connections to the Atalia PRISM community and documentations.  The budget seems a little high but still within the realm of reason.  ", "q1r": 4, "q2": "The proposal lists milestones at 3, 6 and 12 months, however they are somewhat high-level.  More specifics would help the proposal.  Specific reporting on progress would be helpful.  \r\n", "q2r": 4, "assessor": "z_assessor_607", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal effectively responds to the challenge and is addressing a clear need in the ecosystem as DIDs cannot be used without the existence of a wallet to hold the issued Verified Credentials. The field is so broad, and there are so many different use cases, that the team's proposal to build a flexible and general tool that could be adapted by specific projects also makes sense. However, I am a bit confused regarding whether this proposal seeks to build a wallet that would for end-users (as seems to be implied in some sections) or a tool that would be used by other developers of wallets (as is implied in other sections).  As a result of this lack of clarity, I am struggling to identify the target audience for this wallet, and therefore to assess which community would benefit from its creation. Similarly, the proposal would be strengthened by references to other projects in the ecosystem, to give a clearer view of where this proposal would fit in. ", "q0r": 3, "q1": "The detailed experience listed for the team members is impressive, and clearly supports their ability to build the proposed software. While the introduction references experience in the Atala Prism Pioneer program, it is not clear which of the team members participated in the course. As participation in the course is essential in order to access the Atala PRISM SDK, more detail on this point would be useful. Additionally, while the proposal states that Joseph Frankeiewicz is a co-founder of the EAGLE pool and the developer of the Pool Peek app, none of the other team members appears to have experience in the Cardano ecosystem, as detailed in the proposal. Additionally, no links are available to public information about the team. From googling, I was able to find relatively clear evidence substantiating their experience, but next time around it might be helpful to make that info more explicit. Similarly, IAMX is sort-of referenced in the proposal, but not explained. By googling I was able to find the company's website and they appear to be engaged in very interesting work in the Carano ecosystem, and to be partnered with WADA, which is also a strong community within the eocosystem. More detail about IAMX, and particularly whether this wallet is directly related to that company would be very helpful. If the company is not at all related to the wallet project, then I would suggest removing the references to IAMX completely. ", "q1r": 4, "q2": "The proposal provides a roadmap, although the milestones are a bit vague and would benefit from more detail. There aren't any KPI metrics described. A glaring miss in the proposal is any reference to the fact that the Atala PRISM SDK is not yet final or public. It is not clear how they intend to build an Open-Source wallet when the SDK is not yet available to the public. Other proposers in this challenge have highlighted the PRISM SDK as a risk, and documented their plans to address. The team does reference the Hyperledger Indy SDK. While their familiarity with that material is good to know, it is even more confusing that the Hyperledger SDK's is cited while the proposal is completely silent on the PRISM SDK. It would also be very useful to understand why exactly the Indy SDK is a point of reference, and how it compares and contrasts to the approach taken by Cardano. ", "q2r": 2, "assessor": "z_assessor_662", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1, "reply": "As Open Spource Project the KPI is in adoption of the proposed Wallet framework, something hard to measure in KPIs, as it might be in the Time beyond Wallet development.\n\nThe Scope of the project ist to deliver the main Buidling Blocks to develop an Identity Wallet. The Connectors to specific DID Methods as PRISM will be implmented when ready. \n\nBut Elemnts for storage, Key handling & communication etc. can allready be implemented - anyway it's better to start as people are teaming up to develop Identity Projects on Cardano, but are missing an Identity Wallet.\n\nIn my presentation I mentioned as well that IAMX will build a Wallet on top of the Open Source Wallet. But won't brand the open Source Wallet as it is meant to be a Boilerplate Identity Wallet for all Teams looking for a springboard to push the SSI ecosystem on Cardano forward."}], "solution": "开发一个能够处理DID和VC的开源钱包，并为新项目提供一个参考实施方案作为跳板。", "experience": "软件开发（前端和后端）和用户体验设计（20年以上）。Plutus先锋和Atala Prism先锋。"}