{"id": 383996, "author": "chris42", "title": "Cardano for Global Health Supply", "url": "https://cardano.ideascale.com/a/dtd/383996-48088", "category": 26254, "amount": 50000, "description": "活动简报中的 \"最后一英里 \"问题阻碍了非洲预防艾滋病毒、结核病和其他疾病传播的诊断方法的提供", "funded": 0, "upvotes": 16501536, "downvotes": 18597526, "votes_result": 2095990, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "是的，这个提议有效地解决了这个挑战，如果得到资助，将对Cardano社区产生巨大的影响。由于Kountable系统已经在6个主要的非洲国家建立并运行，这种整合可能会很快，并立即为Cardano生态系统及其用户提供价值。提案人在整个地区建立的信任将减少采用的障碍，并通过带来新的部门来增加Atala Prism的覆盖面。我很欣赏提案人将他们以前在这个领域所做的工作，包括它的成功，以及他们对他们的解决方案将解决的可持续发展目标的确认。这种对以往影响的证明和对全球问题的关注可能会引起选民的共鸣。", "q0r": 5, "q1": "鉴于所提出的经验和计划，很难确切地判断该提案是否会成功实施。现有的产品突出表明，该提案背后的公司在解决 \"最后一英里 \"的问题上有经验和成功，即用必要的资源到达农村和发展中社区。然而，提出的计划虽然令人兴奋，但需要进一步发展，并更好地解释如何进行阿塔拉棱镜的整合。不清楚将阿塔拉棱镜整合到现有计划中需要什么，也不清楚这需要多长时间。不幸的是，也没有真正的工作时间表，也没有预算明细。对于5万美元，选民应该得到更多，而不仅仅是一个没有说明如何达到这个数字或如何使用它的一次性数额。鉴于缺乏关于这些问题的关键信息，我既不同意也不反对它可以成功实施。", "q1r": 3, "q2": "不幸的是，没有真正的信息让选民审计该提案的进展或成功。虽然这个想法明显存在，而且公司的跟踪记录表明提案人能够解决这个问题，但没有办法让Cardano社区识别或跟踪结果。我很欣赏作为可持续发展目标的一部分而提供的关键绩效指标，但是，这并没有解释阿塔拉棱镜的整合将如何帮助实现这些目标。由于该公司清楚地展示了他们在 \"最后一英里 \"问题上的成功，可以推断，这些关键绩效指标中的许多指标并不是针对这个项目的，而是针对该公司的整个运营。此外，如上文所强调的，没有说明预算将如何使用以及用在什么地方，这让我有些担心，投票者可能会对这种方法感到厌倦。为了提高分数，我鼓励提案人更清楚地说明社区如何参与或了解项目的进展和成功情况。", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This team wants to use distributed network and to match diagnostics supply transactions, local distributors, and capital with Cardano tools to unlock access to help prevent transmission of HIV, TB, and other diseases in Africa. This project and its problem are fit with what the challenge wants to address. And their KPIs can be fit with the challenge.", "q0r": 4, "q1": "The team doesn't have a plan to show what they will do with this proposal. They're a great team that helps a lot of people, especially helped deliver 14M diagnostics to 3 African countries cloud tech, treasury, KYC/AML platform and digitized 3K trades $1.25B in value. \r\nTo me, I have no doubt about their ability to deploy this project.\r\nBy for CA and vCA assess and fund, the team should have a plan to go and a detailed roadmap. That's basic!\r\nThe good thing is that the team attached a video of them, some images, and a website that we can visualize what they're doing and support. .", "q1r": 3, "q2": "The basic thing in a proposal the team should have for helping to audit it is the roadmap with a realistic timeline inspired key metrics/ KPIs - they had their goals very clear but lacked roadmap. \r\nMoreover, we want to know what big picture that your team wants to get with your project/ idea by clarifying that you have a well acknowledge of the problem context and have the solution with detail to solve it. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly explains how UN SDG Goal 3 is addressed via an innovative implementation of the Atala family of technologies. ", "q0r": 5, "q1": "The experience of the proposers appears very appropriate - yet there is no actual plan presented with clear milestones and budget assigned to milestones by which progress can be tracked. We encourage the proposers to resubmit with a comprehensive plan detailing how the proposed work will unfold and how the budget requested will be spent at various stages of the plan.", "q1r": 3, "q2": "The KPI presented are very generic and cannot be measured at this stage of the project because their accomplishment require a long time to determine (e.g under 5 mortality rate, etc). We encourage the proposers to resubmit including shorter term measures of success, or at least mention what they achieved in the long run along the respective KPIs so we get confidence in their estimate. ", "q2r": 1, "assessor": "z_assessor_721", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "使用分布式网络，并将诊断供应交易、当地分销商和资本与Cardano工具相匹配，以解锁访问。", "experience": "团队通过云技术、财务、KYC/AML平台向3个非洲国家提供了14M的诊断，并将3K交易数字化，价值12.5亿美元。"}