{"id": 384528, "author": "danbonfil", "title": "Cardano DID Community SPO", "url": "https://cardano.ideascale.com/a/dtd/384528-48088", "category": 26245, "amount": 9500, "description": "As tecnologias SSI/DDI começarão a se tornar mais relevantes em Cardano, mas não há um pool de participações orientado para este segmento", "funded": 1, "upvotes": 51509812, "downvotes": 4857058, "votes_result": 46652754, "votes_cast": 146, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "O proponente está em um campo acadêmico relacionado neste momento da redação. O projeto solicitou US$ 9.500 para criar uma SPO auto-operacional, e o objetivo inicial é criar alguma renda para apoiar sua pesquisa e promover o ecossistema Cardano. É uma solução prática para aqueles que requerem uma renda estável; no entanto, o lado negativo da abordagem seriam os delegados. Você tem um novo bloco que precisa de um certo número de usuários delegados e certas transações que entram e saem a cada cinco dias ou em uma época. A direção proposta ajudaria mais pesquisadores e pessoal acadêmico que desejam administrar seu próprio SPO para criar um fluxo de renda regular e ter mais tempo para promover o ecossistema e a cadeia de bloqueio de Cardano.", "q0r": 5, "q1": "O proponente deve esclarecer como você usará US$ 5.000 para marketing e publicidade, uma vez que isto é quase a metade do fundo solicitado. Portanto, acredito que você deve fornecer um detalhe preciso de como fazer esses 50% do fundo, com as informações para trabalhar com parceiros. Não há muitas informações sobre como você irá trabalhar com seus parceiros e como o parceiro irá compartilhar ou ser pago ou até mesmo pagar por você em seu plano de trabalho do projeto.", "q1r": 3, "q2": "Extraído da proposta \"Como é o sucesso? Se financiados, trabalharíamos com nossos parceiros para criar uma abordagem acessível e padronizada para que qualquer comunidade utilize as tecnologias SSI/DID\" e \"Aumentar a consciência dos benefícios\". A intenção é clara. No entanto, a estrutura do trabalho (WBS) deve ser mais precisa para que a equipe de desafio do Fundo 7 possa facilmente seguir seu caminho e reportar-se ao Projeto Catalyst, juntamente com os detalhes de como a comunidade verá seu trabalho em andamento.", "q2r": 3, "assessor": "z_assessor_726", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\nYou are right, a further explanation of partnership collaboration and a work breakdown structure will help support the proposal.\nI will work my best to include this points for the better understanding of CAs and voters.\n\nBest,\nDaniel Bonfil"}, {"q0": "This proposal is a great and complex implementation that could improve adoption and usability on cardano blockchain for SPOs and delegators, because SPO business model revenue is a huge pain on Cardano blockchain. The proposal allow to maximize the decentralization and the sustainable commercial success of newly created (late-coming) Cardano stake pools.\nAs a SPO I think that any Cardano SPOs sees value on this proposal.\nAt the same time the statement of how problem is to be solved is well being specified with implementation and with revenue model, definition of success that support economic model.", "q0r": 5, "q1": "The proposer is very well skilled about the whole context (DID and ATALA Prism pioneer) and, knows the Cardano community well because he work in the DID community.\nThe scope of the solution is well explained (e.g. how the funds will be spent, what features will be implemented, and so on…).\nIn my opinion (I’m 20 years experienced senior information manager on financial sectors) the budget requested is coherent with the elapsed (< 10k$).", "q1r": 4, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, with  KPI metrics that are shown. It’s good that is that the proposer has briefly mentioned possible difficulties and how to deal with them (e.g. competitors, delay,…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge.\nFurthermore the proposer has very well mentioned possible difficulties and how to deal with them (e.g. difficulties in market adoption, revenue model for cardano ecosystem and SPOs.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 29, "ne": 6, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "The proposal would have a huge impact as it would leverage the use of DID's. With it's successful implementation, we could see a ripple effect in its use within the Cardano ecosystem and wider society.", "q0r": 5, "q1": "The proposer has the requisite experience as does his team. This is supported by the fact that they were Atala Prism program pioneers. A budget and a quarterly plan has been provided but a detailed breakdown would help. ", "q1r": 4, "q2": "While KPI's and success indicators are provided, it would be prudent for the proposer to consider any risk factors that may arise and provide the same. ", "q2r": 4, "assessor": "z_assessor_410", "no_vca": 26, "ne": 0, "ng": 17, "nfo": 9, "vca_o": 1}], "solution": "Criar um pool de participações que permita a promoção e adoção de tecnologias SSI/DID, além de implementações verticais de negócios", "experience": "Msc Economics focada em Finanças Quantitativas, Incentivos e Blockchain\nJaneiro 2022: Doutorado em Gestão com foco em Política Comunitária"}