{"id": 382235, "author": "aljosa", "title": "A Cardano businesses focused DAO", "url": "https://cardano.ideascale.com/a/dtd/382235-48088", "category": 26237, "amount": 75000, "description": "There is no clear path to establish a business to operate a Cardano based project and launch a relevant crypto/blockchain business model.", "funded": 0, "upvotes": 15075146, "downvotes": 27125154, "votes_result": 12050008, "votes_cast": 236, "f6_no_assessments": 5, "f6_rating": 1.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "While there would definitely be a need for an entity that would help businesses establish projects on Cardano and assist them with legal and management advice, I am not sure if this entity really needs to be in the form of a DAO. Since there is no project plan and details attached to the proposal, I cannot assess it properly.", "q0r": 2, "q1": "\tWhile the proposer has provided a LinkedIn profile to better form an impression on his skills, he has not written any plan details. How will members enter the DAO, how many businesses will they be able to help - for legal advice, they would need representatives from different countries. How will the DAO be able to further fund itself? What is the requested budget needed for? ", "q1r": 1, "q2": "Since the proposal lacks any kind of details (detailed plan, timeline, budget etc) I would highly recommend resubmitting the proposal in a future fund with all the required info. As it stand now, it is in a draft stage and cannot be properly assessed.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 21, "ne": 0, "ng": 19, "nfo": 2, "vca_o": 1}, {"q0": "60 words and $75k to build a business focused DAO.\r\nThis is a draft proposal that should have been withdrawn before the assessment stage.", "q0r": 1, "q1": "The experience is given through a LinkedIn profile with developer experience. This is better than most proposals.\r\nSince this is only a draft proposal with no details there is no way to assess the required experience and match it with the profile given.\r\nNote that for a developer, it's also useful to give a link to some open source project so that other developers can assess the quality of your code and your real experience.", "q1r": 2, "q2": "There is clearly not enough information in this proposal of only 60 words.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 20, "ne": 0, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "This is a draft proposal. Relevant information about the impact of this proposal is missing. This proposal is not executable, nor does it provide information on how this idea will create value to the Cardano Ecosystem.", "q0r": 1, "q1": "The proposer doesn't provide relevant information on how to implement this idea. The idea is not clear described. A plan is missing. Also we don't find any information about the proposer.  ", "q1r": 1, "q2": "No info has been provided to show how this project will solve the problems it wants to solve. There is no way to track the progress or success of this project. ", "q2r": 1, "assessor": "z_assessor_484", "no_vca": 26, "ne": 0, "ng": 17, "nfo": 9, "vca_o": 1}, {"q0": "This proposal addresses the main objectives of the challenge, by proposing business focused DAO to enable easier management of the business part of running a Cardano based project in a legal way. Unfortunately the team does not provide further details on the background problem as well as the proposed solution. This proposal looks like unfinished and incomplete, therefore should not be funded.", "q0r": 1, "q1": "The team does mention relevant experience in the proposal but does not provide complete details about the project. The incomplete proposal makes it hard for community to ensure the continuation and success of this project. The team requested a budget without detail on how the money will be spend or allocated. There is no roadmap, budget breakdown, or timeline for the execution of this project in the proposal. My suggestion for the team is to complete the proposal with more information and details. ", "q1r": 1, "q2": "There are no clear success metrics or KPI in the proposal. The team does not provide deliverables, roadmap, or detailed plan on how to execute the project and there is no budget breakdown in the proposal. Team does not mention where they will publish the progress of project execution making it impossible to trace, monitor, or audit the project. My suggestion for the team is to update the proposal with more information and details including deliverables, goals, KPI, roadmap, detailed execution plan, and budget breakdown. ", "q2r": 1, "assessor": "z_assessor_643", "no_vca": 21, "ne": 4, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "This proposal doesn't really have a plan on how to solve the problem. They have outlined an issue and then want 75,000 to build a business focused DAO to enable easier management of the business part of running a Cardano based project in a legal way. But they don't show us why they need that amount of money and how they use that money to do this proposal", "q0r": 1, "q1": "No concrete plan has been provided on how to solve the proposed issue. 75,000 has been asked for to solve the issue, with no real breakdown on how many of who's hours working that will pay for. There are no clear deliverables, thus its hard to say its highly likely to succeed. No evidence of the experience required to successfully complete a project of this kind has been provided.", "q1r": 1, "q2": "There is no detailed plan of what the funds will be used to produce which can be assessed against. Thus progress and success cannot be measured. It is not clear what, if anything has already been built.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 21, "ne": 0, "ng": 13, "nfo": 8, "vca_o": 1}], "solution": "Build a business focused DAO to enable easier management of the business part of running a Cardano based project in a legal way.", "experience": "Aljosa Mohorovic is a senior developer with team lead, product and business owner experience.\nhttps://www.linkedin.com/in/aljosamohorovic/"}