{"id": 383998, "author": "mamazoe", "title": "RAEDA", "url": "https://cardano.ideascale.com/a/dtd/383998-48088", "category": 26256, "amount": 40000, "description": "MOVILIDAD: uno de los problemas más antiguos y acuciantes de un africano medio.", "funded": 1, "upvotes": 30096350, "downvotes": 23392600, "votes_result": 6703750, "votes_cast": 424, "f6_no_assessments": 9, "f6_rating": 1.7037037037037037, "videos": [], "media": [], "f6_assessments": [{"q0": "No estoy en absoluto de acuerdo con que esta propuesta aborde eficazmente el reto. La idea es noble, y creo que tiene un buen caso de uso. Pero claramente la idea no pertenece a esta categoría, y encajaría más en el reto de dapps e integraciones.\r\n\r\nSin embargo, si esta idea es un ajuste a este desafío, entonces habría sido bueno si el proponente había mencionado cómo adaPay solución se integrará con RAEDA. Me falta totalmente esta conexión en la redacción de esta propuesta. Esto apunta a una de las dos cosas siguientes\r\n\r\n1) El proponente no tiene muy claro cómo funciona la integración Cardano/Coti\r\n2) El proponente asumió que el lector puede deducir de la redacción dada que habrá algún tipo de integración con AdaPay.\r\n\r\nEn cualquiera de los casos, creo que esto no es un ajuste correcto para esta propuesta. Por lo tanto, voy a sugerir al proponente, que eche un vistazo a otros desafíos y ponga esta propuesta en la próxima ronda allí. Estoy seguro de que tendrá mucho éxito y muchas posibilidades de obtener financiación en el futuro. Buena suerte", "q0r": 1, "q1": "En la propuesta se ha adjuntado un anexo en el que se explica el equipo, que está formado por una buena parte de personas con experiencia.\r\n\r\n Además, la sección de métricas y los objetivos a largo plazo explican que el equipo tiene una buena visión de cómo será el éxito para ellos.\r\n\r\nSi considero esta propuesta por sí sola, sin tener en cuenta el hecho de que tal vez este no sea el lugar adecuado (escenarios de desafíos) para esta propuesta, todavía encuentro mucho margen de mejora. La implementación exitosa de la propuesta en sí misma requerirá, imo, algunas otras asociaciones, especialmente con dependencias externas, como la infraestructura de Internet en África. Creo que este es un juego a largo plazo, y proyectos como el token móvil mundial y el ritmo de promoción del blockchain serían un gran factor para representar el éxito de esta propuesta.\r\n\r\nCreo que el proponente también debería cubrir la definición de éxito con respecto a la infraestructura dentro de África. Para la comunidad de Cardano, esta es un área muy importante que hay que conocer, ya que la gente/comunidad local, como el proponente, tiene un buen conocimiento y experiencia al respecto.\r\n\r\nPor lo tanto, en mi opinión el proponente debe tratar de cubrir tantas dimensiones como sea posible. Esto sólo aumentará la probabilidad de que su propuesta sea financiada en el futuro.\r\n\r\nPor último, teniendo en cuenta todos los puntos anteriores, para mí no estoy ni de acuerdo ni en desacuerdo con que esta propuesta se lleve a cabo con éxito (teniendo en cuenta sólo este punto y no que esta propuesta no se ajuste a este reto)", "q1r": 3, "q2": "La propuesta menciona que están desarrollando algún tipo de sistema en el que los usuarios también pueden acceder al servicio a través de cripto pagos. Sin embargo, no he podido encontrar ninguna información sobre la hoja de ruta de desarrollo/programación/prueba de esta solución digital.\r\n\r\nAunque la propuesta ofrece un buen resumen sobre el desglose del presupuesto, si RAEDA va a ser un producto digital, creo que alguien tiene que hacer también la codificación y la implementación. Se mencionan los hitos, pero el desglose del presupuesto no menciona nada sobre las horas de trabajo del desarrollador.\r\n\r\nComo desarrollador senior, creo que el éxito de esta propuesta depende en gran medida de la calidad de los desarrolladores que implementarán esta solución. Sin embargo, la información en profundidad sobre cuál es el plan de desarrollo, qué pila de tecnología están utilizando, qué tipo de funcionalidades / conjuntos de características que están trabajando, ¿cuáles son sus planes para la escalabilidad de su solución, quién y cómo se hará el QA (garantía de calidad)? Faltan estos detalles de implementación que son muy importantes para el éxito de esta propuesta y la comunidad quisiera tener una hoja de ruta clara al respecto.\r\n\r\nMi sugerencia al proponente es que eche un vistazo a los proyectos financiados anteriormente en los que se han dado todos estos detalles. Esto le permitirá tener una buena comprensión sobre cómo puede proporcionar a la comunidad una buena confianza sobre si una propuesta puede ser auditada correctamente y, finalmente, la probabilidad de éxito de esta propuesta.\r\n\r\nPor lo tanto, no estoy de acuerdo en que haya suficiente información disponible aquí para auditar suficientemente el progreso y el éxito de esta propuesta.", "q2r": 2, "assessor": "z_assessor_454", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "La propuesta es ciertamente intrigante y está claro que podría hacer maravillas, especialmente en un continente como África, donde la movilidad es un problema constante, como menciona el proponente en su planteamiento del problema. Sin embargo, creo firmemente que esta propuesta no hace la debida justicia al reto planteado. El resumen de la campaña menciona la necesidad de un complemento de pago de ADA, aunque el proponente menciona que está trabajando en una plataforma de pago única, no menciona cómo esta plataforma puede ser escalada a otras plataformas. Creo que esta propuesta podría encajar en otros retos como \"Dapps de construcción de naciones\" o \"Dapps e integración\", ya que la propuesta se concentra en una aplicación particular que podría añadir valor a la vida de las personas y al ecosistema en lugar de proporcionar a la comunidad un plug-in de pago que aumentará las transacciones de Cardano y su adaptabilidad como medio de pago. Por lo tanto, creo que a pesar de ser una gran propuesta, no se presenta bajo el desafío correcto, por lo tanto, puntúo un 2 de 5 por el impacto y lo bien que aborda el desafío.", "q0r": 2, "q1": "El proponente menciona haber realizado ya una buena cantidad de trabajo en la dirección de la propuesta. Sin embargo, no hay ninguna descripción del plan detallado que pretenden seguir para llevar a cabo la idea propuesta. La propuesta presentada tampoco incluye ninguna descripción sobre los miembros del equipo y su experiencia, salvo la mención de las funciones. Además, al haber solicitado un presupuesto global de 40.000 USD, que es aproximadamente 2/5 de los 100.000 asignados, no hay un desglose del presupuesto disponible para los lectores. No hay ningún plan de acción ni documentación sobre los posibles riesgos e inconvenientes y su plan de mitigación. No se ha proporcionado ninguna información sobre cómo sería el éxito y cuánto valor podría añadir al ecosistema de Cardano y a COTI en particular. En definitiva, al faltar muchos detalles, la propuesta parece muy incompleta y genera muchas dudas en los lectores. Por lo tanto, no estoy de acuerdo en que con la información disponible, es muy difícil suponer que esta propuesta cumpla con las expectativas de la campaña.", "q1r": 2, "q2": "El proponente no proporciona a los lectores cuáles son las posibles métricas que pueden utilizarse para ayudar a la auditoría. Además, no hay una definición de éxito por fases para seguir el progreso oportuno de la propuesta. El proponente no ha proporcionado ningún KPI que coincida con los KPI requeridos mencionados en el resumen de la campaña. Al no haber definido hitos claros ni un horizonte temporal, es muy difícil hacer un seguimiento de la propuesta y de su éxito. Tras examinar la propuesta, creo que incluso si se aplica con éxito, no hay pruebas plausibles de que su plataforma de pago pueda ser aprovechada por otros comerciantes y aplicaciones web para los procedimientos de pago. No existe ninguna métrica visible en la propuesta para identificar el número de usuarios que utilizan este método de pago y su fluidez. Un poco más de información sobre la tasa de éxito de los pagos, el coste de la calidad, la escalabilidad y la experiencia del usuario aportaría más valor a la propuesta en su conjunto. Sugiero encarecidamente al proponente que trabaje en un plan más dilucidado y lo vuelva a presentar en las siguientes rondas. Por el momento, la propuesta no es suficiente para ganarse la confianza y la atención de la comunidad y, por lo tanto, tengo que puntuar con 1 sobre 5 la claridad/audibilidad de la propuesta.", "q2r": 1, "assessor": "z_assessor_751", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal completely misses the objectives of the campaign. The main problem of the campaign, that is how to build a plug-in to integrate ADA Pay seamlessly so small merchants are able to accept ADA payments is never addressed. Because of that metrics and roadmap are not aligned with the challenge goals.", "q0r": 1, "q1": "The proposal cannot be considered feasible because the goals are distorted. Even if they succeed with the presented idea, it will not be possible to state that the proposal was successfully implemented because they will not achieve the goals of the challenge.", "q1r": 1, "q2": "Because there is not a clear understanding of the targeted problem it is not possible to affirm the proposal has a good auditability. The KPIs defined completely miss the direction in which the project must go to fulfill the objectives of the challenge. The proposed solution does not address the problem posed so auditing is virtually meaningless.", "q2r": 1, "assessor": "z_assessor_341", "no_vca": 25, "ne": 2, "ng": 19, "nfo": 4, "vca_o": 1}, {"q0": "The proposal states a problem and provides a solution to fix this. Unfortunately the key metrics and goals of the proposal do not align with the outlined challenge settings. I would recommend to re-submit the proposal on the next fund in another category.", "q0r": 3, "q1": "There could be more informations provided about the team and also on the technical aspect of the idea. It is hard to tell how far the project already is and how much work has to be done. Also a breakdown of the budget as well as a risk-assessment would help to further assess the proposal.", "q1r": 2, "q2": "The proposal lays down the general idea but to properly assess the proposal much more informations are needed. A more structured roadmap or a clear budget breakdown would help. In overall the proposal is hard to assess", "q2r": 2, "assessor": "z_assessor_41", "no_vca": 19, "ne": 0, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "This proposal has not identified a problem within this challenge. My advice to the proposer is to find a challenge where this proposal fits better, in order to increase its chances of being funded.", "q0r": 1, "q1": "This proposal is not in the right challenge. Furthermore, it doesn't contain enough information to be implemented successfully. I suggest to the proposer read the the brief challenge or find a better challenge for this proposal.", "q1r": 1, "q2": "This proposal doesn't contain enough information such as a roadmap or metrics that can allow the tracking of its progress. ", "q2r": 1, "assessor": "z_assessor_439", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "Great project and idea. By providing mobility that is fair and easy to use to the people of Africa you solve a big problem. Now my concern is where is the link with the challenge. We look for ways to integrate the ADA Pay plug-in. You talk about developing a system where users can also access services through crypto payments. but as it stands now the funding requested for this proposal does not include this service. You also don't define that this crypto payment would go with ADA Pay. It's one impeccable proposal and the document attached gives all the necessary info but we are missing the link with the challenge. ", "q0r": 2, "q1": "Regarding feasibility, this proposal is very well written and gives the necessary amount of information needed. Looking at the team we get a full fletched team that is qualified for this proposal. They each have their own unique qualities that are explained short but clear. One thing that would've finished this is if you provided a link to the survey that you guys had taken before this. Everything else is well explained and provides evidence of the hard work that you guys already put into this proposal, but what I'm missing is the model to support these affordable rides and drivers offers.", "q1r": 4, "q2": "As stated in the previous rationale everything is provided in this proposal. The timetable is presented and I would normally say one month is not enough to provide a demo version but I assume they already started working on the prototype. risk management is present and nourishes my brain to the point that I see you guys are putting everything in this. One concern I have is the budget. I don't doubt that you guys need the amount but since it's asking for half the challenge funds I hope you guys know you're taking a risk on this. What I would suggest is if this doesn't get funded breakdown your project into several categories and submit proposals for each category. ", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 18, "ne": 3, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This proposal conceptually presents an interesting idea, however it does not demonstrate a strong alignment to the challenge objectives.  This is highlighted by the strong focus on the idea rather than detailing how it plans to address core challenge criteria such as testing the plug-in, measuring key metrics, etc…  Furthermore, the proposal has not detailed out core metrics of success even for its own concept. The business model is conceptual and only provides anecdotal evidence for why it is a needed idea.  \r\n\r\nIn order to turn this from a strong proposal in the future, the project team should aim to submit their idea to relevant challenges as well providing more details around roadmaps and how it realistically aims to become the 'Uber for Africa.' For example what is the detailed pricing strategy for the subscription model? Why use a subscription model as opposed to a Pay-as-you-go model? ", "q0r": 1, "q1": "The team appears to have a diverse background and existing involvement African blockchain community.  Both of these are great starting blocks.  A clear strength of this proposal is the ability to come up with an interesting concept for integrating Cardano into the real world. \r\n\r\nMy recommendation for a future proposal is to add more detail in the budget breakdown and roadmap section.  The requested funds for $40,000 makes up 40% of the total funds allocated for this challenge. Given that amount, I would expect an appropriate level of depth when addressing how this budget is going to be spent. \r\n\r\nFinally, I am struggling to understand the implementation path that lies ahead.  It is still an idea at heart and there is a strong disconnect of how the challenge objectives will be met through this project (as well as how the business model will be sustainable or successful). Using an existing business model would be a stronger proposal for COTI funds. Once again, providing some detail and structure around the next steps / roadmap for this project would give more color and evidence that the project will be successful long term. \r\n", "q1r": 1, "q2": "A key strength of this proposal is the tangible nature of the problem they are trying to solve. In order to improve the proposal even further, I suggest outlining important information such as a roadmap, estimate of key activities to be delivered and details on budget allocation. \r\n\r\nFurther, having alignment with the challenge metrics would increase the change of a successful proposal. For example, the challenge identifies success as testing the ability to integrate ADA plug-in solutions. Forming a view of a roadmap against this metric would have been a great opportunity of showcasing the linkage to the challenge in an auditable way.  ", "q2r": 1, "assessor": "z_assessor_586", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "I disagree that this proposal addresses the challenge because it doesn't mention  payment with ADA plug-in but just mentions \"cryptocurrency\" in general.", "q0r": 2, "q1": "There is just detailed plan, I don't see the team, timeline, budget breakdown, resources, etc. I strongly disagree this proposal will be implemented successfully.", "q1r": 1, "q2": "There is no key metrics to success or KPIs, roadmap or time horizon. This proposal does not provide me enough information to assess its progress.", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 17, "ne": 0, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "The problem statement of this proposal seems not to align with the challenge. The proposal is just about providing solution to making transportation in Africa conveniently and easily accessible by users and creating a Dapps for this purpose. So in my opinion, the proposal does not have effective impact on achieving the set goals of this challenge category.", "q0r": 2, "q1": "There is no detailed skill and experience profile of the team. In addition, there is no information to assess the reasonableness of the budget and it's breakdown plus no roadmapand/or milestone to verify the capacity of the team to achieve the successful implementation of the proposal.. There is a lot of work to be done to fine tune the proposal.", "q1r": 2, "q2": "There is no information on any form of metrics and/ KPIs to assess the proposal if eventually funded.", "q2r": 1, "assessor": "z_assessor_9", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "Raeda es un producto móvil digital que integra un sistema sencillo que permite a los usuarios suscribirse a viajes asequibles en un periodo de tiempo", "experience": "Contamos con un equipo formado por expertos en estrategia de marca, consultores de relaciones públicas, desarrolladores, comercializadores y expertos en gestión."}