{"id": 384468, "author": "nftdao", "title": "One-Click ₳ Pay", "url": "https://cardano.ideascale.com/a/dtd/384468-48088", "category": 26256, "amount": 45000, "description": "₳ La penetración en el mercado de pago requiere patrones de diseño sencillos de usar e integrar dirigidos a sus plataformas de comercio electrónico de tamaño pequeño y mediano.", "funded": 1, "upvotes": 83686576, "downvotes": 18300035, "votes_result": 65386541, "votes_cast": 873, "f6_no_assessments": 11, "f6_rating": 3.757575757575758, "videos": [], "media": [], "f6_assessments": [{"q0": "Estoy totalmente de acuerdo en que esta propuesta aborda eficazmente el reto al dirigirse a los requisitos exactos de \"integrar la solución de adapay mediante plugins a los sitios web de comercio electrónico\".\r\n\r\nComo desarrollador, entiendo que no basta con ofrecer soluciones de software, y uno de los requisitos es la escalabilidad de los plugins. La propuesta aborda este aspecto bastante bien en su plan detallado, así como en el planteamiento del problema y la solución.\r\n\r\nDiseñar una UI/UX sencilla y fácil de integrar es tan importante como integrar una solución bien diseñada desde el principio. Esto está en consonancia con la estrategia de Cardano que ha permitido a Cardano permanecer en el top 5 o 6 de criptomonedas todo el tiempo desde su creación.\r\n\r\nLa propuesta de solución también menciona claramente a qué plataformas de comercio electrónico se dirigen como parte de esta solución. Por lo tanto, para mí está muy bien alineado con la configuración del desafío. Por lo tanto, las estrellas completas de mi parte.", "q0r": 5, "q1": "El equipo de esta propuesta ha dado una buena descripción de la experiencia de los miembros del equipo, sin embargo, un enlace público a su perfil habría sido mejor.\r\n\r\nEsto, sin embargo, se compensa con el enlace público de github a sus repos que también tiene enlace a su perfil de twitter.\r\n\r\nComo se puede ver que ya tienen la integración con una cuenta de comerciante de pago para su aplicación de venta de entradas, por lo que claramente tienen una buena experiencia de trabajo con la integración de la solución de pago ada.\r\n\r\n\r\nEl plan, en términos de cronograma, está bien delineado, lo que da una buena visión general de cuando el equipo espera que la fase de codificación / prueba esté terminada.\r\n\r\nLa propuesta también ha identificado las plataformas de integración y cómo será esta integración. Sin embargo, me interesaría un poco más entrar en los detalles técnicos (yo mismo soy un desarrollador) de por qué 3 ingenieros necesitarían 200 horas cada uno para hacer el trabajo de integración con la solución ada Pay. Para mí, el presupuesto de los ingenieros de JS parece más de lo que debería ser, pero esta cuestión se puede mantener para los tiempos de revisión. En general, esta propuesta pide más del 40% de la asignación presupuestaria total, y creo que el presupuesto está un poco por encima del techo.\r\n\r\nTambién me di cuenta de que el lenguaje de programación está escrito como Java (node.js). Creo que lo que el proponente quería era tener Java o Node.js o ambos, pero por el texto parece que están usando Java que también se llama Node.js?\r\n\r\nEn general, es una propuesta bien escrita, pero, en mi opinión, todavía hay margen de mejora. Por lo tanto, 4 estrellas de mi parte.\r\n\r\n\r\n", "q1r": 4, "q2": "La información proporcionada es suficiente para auditar el progreso y el éxito de esta propuesta, ya que el equipo de esta propuesta tiene una buena experiencia con la tecnología blockchain (como se puede ver en las actividades de GitHub).\r\n\r\nAdemás, podemos ver que la comunidad tendrá la oportunidad de ver claramente en cuántos meses se esperan los conjuntos de características. Esto proporciona un buen bucle de retroalimentación entre el equipo y la comunidad.\r\n\r\nPor lo tanto, creo que debería ser bastante fácil para la comunidad auditar el progreso y el éxito de esta propuesta, por lo que estoy totalmente de acuerdo.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 17, "ne": 9, "ng": 6, "nfo": 2, "vca_o": 2}, {"q0": "This proposal has a very strong and clear alignment with the fund challenge requirements.  They are planning on tackling connections to the top 5 used e-commerce sites making scalability a huge plus for this project.", "q0r": 5, "q1": "The team consists of three members with a lot of qualifications and skills to be able to develop a solution like this one.  Due to the scope that they have this project has a longer timeline.  The roadmap and deliverables all are described with a game plan to get them accomplished.", "q1r": 4, "q2": "This project has clear auditable and transparent plans for the spending of funds, delivery of deliverables, and metrics to audit the project against.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 23, "ne": 1, "ng": 15, "nfo": 7, "vca_o": 1}, {"q0": "They identify the problem of crypto adoption in existing online payment solutions. Even though the value this proposal will ad to the Cardano ecosystem is self explanatory it is still good to explain how your project will ad value. It will give the reader an idea of where you aim to ad value. Their goals of building a 1-click ADA payment into top 5 ecommerce carts is aligned with the challenge setting's. Project is also able to scale as it is a plugin.", "q0r": 4, "q1": "They claim to have the relevant experience and team, but no evidence of their existence and abilities have been provided. I had to google NFT-DAO to find you. Not everyone will know who you are and might not trust you. Adding this info in the proposal will boost voter confidence. Budget is reasonable and broken down into identifiable items. Time to complete project is 12 months, which seems highly achievable. They mention the languages they will use to build this and briefly what they will build, but they don't go into detail how they will build it. Giving a little more info on how you will build it, will give the reader a sense of your expertise and how you want to approach this. No risks/ challenges have been considered. ", "q1r": 3, "q2": "They have a clear roadmap that shows what the different steps is in rolling out this product. No KPIs were shown, although getting the product on the top 5 ecommerce carts can be a KPI. Adding more KPIs would be great, because it makes tracking the performance and progress of the project much easier. The team realizes and explains the problem of no easy way for people to integrate ADA payments into their existing payment solutions. Their solution is an easy one click  ADA payment into the top 5 existing payment solutions by means of a self executable installation and documentation to install and integrate.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 22, "ne": 5, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "As the COTI challenge is very clearly stated, the team made their proposal fits perfectly inside of it. A \"One click\" ADA payment solution for Ecommerce platforms is the way to go ! ", "q0r": 5, "q1": "The project's timeline is plain and simple, declined in four parts and spread over 12 months. Experience from the team members looks totally appropriate, the only thing i could suggest would be to add some  Linkdn profile to your proposal for people who wouldn't know the \"NFT-DAO\" team.", "q1r": 4, "q2": "As long as their work is made available for anyone to read on Github, we should be able to monitor the progress and success of the proposal.\r\n\r\nIt would be great to hear some feedback from the team along the way, in order for them to be flawlessly transparent.", "q2r": 4, "assessor": "z_assessor_146", "no_vca": 22, "ne": 2, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "This is a bold proposal that aims to infiltrate in the top 5 e-commerce websites. However, I feel that it lacked a lot of explanations on how they intend to do that. Their objectives are aligned with the goals of the challenge. For instance, they show a lot of concern regarding the UI/UX of the product, which is quite positive. But more comments could have been given regarding the ideas they aim to put in practice. How exactly they intend to make the plug-ins clean and easy-to-use was not thoroughly debated. Other topic that could have been more explored is the quality of the solution. What are their intentions in terms of what they consider as a robust solution? This was not discussed. In short, this could have been a great proposal have the team articulated better and, in more details, how they expect to add value to the Cardano ecosystem.", "q0r": 3, "q1": "It is not clear that this team will have the capacity to successfully implement the idea proposed. Some evidence was given about the relevant skills of the team, but it was not mentioned who exactly is part of the team and their past experiences were cited in a vague manner. The budget is broken down into identifiable items and its final sum is within reasonable limits, but each item in the budget could have had its value better justified. Also, it could have been better integrated with the roadmap, it is not clear that the hours of work estimated in the budget match the timetable targeted. Finally, there is no considerations regarding the case of needing additional funding, which is always a project risk.", "q1r": 3, "q2": "The auditability of this proposal is weak. It does not seem it will be easy to evaluate if the project is advancing as expected. The roadmap is too simple and too broad. The deadlines presented are reasonable but there are no KPIs specified to assess the progress of the team. Metrics on the success of transactions, number of users expected to be reached and future scalability without loss of quality of the product could and should have been discussed.", "q2r": 2, "assessor": "z_assessor_341", "no_vca": 24, "ne": 0, "ng": 17, "nfo": 7, "vca_o": 1, "reply": "The assessor opinion is they wanted to read more details of exactly how the sausage is made. We feel we added enough detail to be able to assess the proposal, everyone can always add more details and create reams of details, but it is not practical or needed for the majority to assess the viability of a proposal."}, {"q0": "A clean user interface is a good solution to boost the ₳ Pay market share. The proposal clearly identifies a problem and provides a clear solution. ", "q0r": 4, "q1": "The proposal provides a great introduction of the team. It would have been great though If the team provided their linkedin or github page to verify their experience. The proposal additionally has a timeline (roadmap) and a budget breakdown. ", "q1r": 4, "q2": "The proposal could be more detailed. It would help to add some more information to the different parts of the timeline and to the different budget allocations. In overall the provided information is quite short.", "q2r": 3, "assessor": "z_assessor_41", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "By providing a simple UI/UX that is easy to use and able to integrate into e-commerce this proposal hits the perfect spot in this challenge. It is good to focus on the top 5 e-commerce platforms but there is no mention if this would be scalable to other platforms as well. By providing a simple way to pay with ADA Pay this proposal surely adds value to the Cardano ecosystem.", "q0r": 4, "q1": "The proposer provides enough relevant experience to give us confidence that this proposal will be a success, although no actual reference links are provided. It would've been better if some evidence was provided to underline these statements. Though reading through the proposal the proposer clearly shows the knowledge behind his experience. The roadmap is well defined and has a reasonable timeframe. For budget, this takes a huge amount out of the fund pool for this challenge which makes me wonder if this proposal would've been better if this split it up in a few different proposals.", "q1r": 4, "q2": "The roadmap is clear and well described as well as the budget breakdown. The only thing I would've like to see is a risk assessment. The budget clearly states they request funds for penetration testing but they give no indication on what the plans are if major risks are found within the coding? Will they need additional funding if this happens of is it calculated?", "q2r": 3, "assessor": "z_assessor_471", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The One click Ada pay proposal addressed the COTI challenge problem statement by  designing a simple & easy-to-use plug in to integrate ADA Payment to top 5 e-commerce platforms. ", "q0r": 4, "q1": "The proposer team is experienced in UI/UX design and also provide the clear budget and timeline for the launch although the total budget is high due to the number of working hours on the solution. They would get the better score should they address the risk and challenge for their successful implementation.", "q1r": 3, "q2": "Although the proposer has not mentioned possible difficulties and how to deal with them. They mentioned about the experience in NFT DAO that has an ADA Pay merchant account and they integrate it into their ticket sales app and this should give voters with good level of confidence. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The way they address the challenge is copied from the challenge call itself - without any detail of how their implementation will accomplish it.", "q0r": 4, "q1": "The team claims to have plenty of experience but their annonimity makes these claims unverifiable from the proposal text. There is practically not plan presented - only a budget describes the resources needed.", "q1r": 2, "q2": "No information is provided regarding possibility to audit - only a claim that they will \"work closely with COTI\".", "q2r": 1, "assessor": "z_assessor_721", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "The proposal aims to provide a clear interface for small to medium businesses. All the programming steps and ressources needed are well described. \r\nThere remains the question of the legal approval or interest from the target companies (top 5). This questions remains to be answered. Is there interest from the listed target companies to cooperate and integrate this UI/UX into their option of payments", "q0r": 4, "q1": "I agree that the programming and UI/UX can be properly coded. The scope of work they mention is well described. ", "q1r": 4, "q2": "Given the Timeline and programing goals are well listed. It is simple to audit and see the progress over the 12 month period listed", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "This proposal has definitely presented a clear and precise problem and solution. There is no doubt a simple and seamless integration across various e-commerce platform will have a huge impact on achieving set objectives of this campaign", "q0r": 5, "q1": "The proposal has provided detailed and much needed skill, knowledge and experience that is sufficiently adequate to deliver on this project.\r\n\r\nThe information on budget breakdown and timeline to deliver the project is sufficient and in addition, to the potential to collaborate with Coti Expert is also a welcome idea for effective implementation of the proposal.\r\n \r\nHowever, there is no mention of  any marketing efforts to sell the product to ensure user adoption. \r\n\r\nAlso, the proposal did express any potential risk towards the implementation or adoption across various e-commerce platforms.", "q1r": 4, "q2": "Surprisingly, the proposal did not present any information in regards to what success of the proposal will look like if successfully funded. \r\n\r\nHowever there is a timeline to deliver the project but metrics such as no. of platforms will be onboard, number of user adoption, number of transaction usage across the platforms etc. ", "q2r": 2, "assessor": "z_assessor_9", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Diseñar una UI/UX sencilla, limpia, fácil de usar e integrar a la perfección ₳ Pay en las 5 principales plataformas de comercio electrónico.", "experience": "Más de 25 años de experiencia en tecnología de pagos UI/UX/seguridad\nNFTDAO actualmente tiene una cuenta comercial de ₳ Pay que hemos integrado en nuestra aplicación de venta de entradas."}