{"id": 383186, "author": "smilerosepool", "title": "Creating a Bilingual Website Hub", "url": "https://cardano.ideascale.com/a/dtd/383186-48088", "category": 26238, "amount": 12000, "description": "Não existem sites suficientes conectando diretamente as comunidades Cardano de língua inglesa e japonesa com as informações e links necessários.", "funded": 1, "upvotes": 131157592, "downvotes": 5409131, "votes_result": 125748461, "votes_cast": 362, "f6_no_assessments": 5, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal addresses the challenge and intends to create a website with information on Cardano and Catalyst in both english and japanese as well as monthly meetups via zoom to connect community members.", "q0r": 5, "q1": "The proposal does not contain a lot of information, for instance it is not clear if the proposers are already active in the community, if they have a discord server and who/ how many people have been on the zoom-calls, that they mention. It would give them credit for prior work if they provided some information about how they are connected in the Cardano Community. I used deepl.com to translate the japanese part of the proposal into english and found out about how they allocate the budget. In general, the allocation of the budget seems fair, but as they do not provide actionable steps and possible ways to get the community to provide content and they do not explain their reward system for bounties, it is not quite clear, if the budget makes sense.\r\nSince the proposing team is US as well as Japan-based and the idea of the proposal is to bridge both English and Japanese, it would have been relevant to have the full proposal in both languages, as it would have bridged the information gap that was created in the proposal and it would have made it obvious that the team is able to and passionate about delivering information in both languages. The proposal is very broad in what content they want to put up on the website. Since there is for instance adatruth, it would maybe be interesting for the proposing teams to come together to see if they can support each other.", "q1r": 3, "q2": "Auditability is not really covered in this proposal. Their measures of success is to create a website in 3 months and to add an unspecified amount of content in six months and an unspecified amount of meetings. So to increase auditability, it would be interesting for the proposing team to add how many zoom meetings they would want to hold and how many people they are planning on engaging with the zoom calls and the website. It would be great to provide us as a community with a discord or twitter handle as well as possibly a github as this would allow for auditability and transparency. It is difficult to estimate if the two proposers have a good marketing or networking system to attract community members.", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 23, "ne": 10, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "Developing a website where content about Cardano can be viewed in both languages provided by a native speaker is a good way to produce accurate information. A lot of online translation bots are good at translating basic words and sentences but when it comes to a specific category they lack the knowledge to translate the meaning of it. By using native speakers to translate English to Japanese and vice versa you create a solid translation that is understandable and gives comprehensive content.", "q0r": 5, "q1": "The proposers claim to already conduct monthly zoom meetings in both languages but don't provide any evidence of this. Since they are planning on building a website we are missing some information. We are not presented with the information that the proposers are capable of making the website by themselves or if they need to hire new team members? Also, a basic plan is missing from the proposal. The proposers state that the website will be done in 3months but since they give no evidence that they can do this themselves, speaking from personal experience I find 3 months rather ambitious to search for team members and finish a website from scratch. As well as explaining how the plan to reward content creators for adding value to the hub. The budget is on the high end, website design and maintenance is not 5500 in total.", "q1r": 3, "q2": "The roadmap is given, but we lack the knowledge to audit this proposal if it gets funded. The roadmap provided does not give enough depth into the proposal to see how this project will come to life. What deadlines do you set for yourselves? What KPI do you set for this proposal, visitors on the website, amount of content created, website hits/month,... ", "q2r": 2, "assessor": "z_assessor_471", "no_vca": 19, "ne": 4, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "The problem is that there aren't enough websites to directly connect the English- and Japanese-speaking Cardano communities with the necessary information and links.\r\nThe solution proposed by the proponent is very specific, it addresses some of the most important questions of the challenge. Create web and video archived documents in both languages, plus monthly zoom calls.", "q0r": 4, "q1": "I'm not too sure about implementing such a platform. This proposal is difficult to evaluate because it seems that the source of information about the proposal is not sufficient for us to assess the success of the proposal. This proposal seems to be more of an idea than a complete proposal, so if funding is not available in this fund, I recommend returning to the fund later with a more complete proposal.\r\nThere are no details regarding the author team. The team is one of the key factors in determining the success of the proposal, here, I cannot determine the relevant qualifications and experience. It will be easier to judge the possibility if we know more about the people who are working\r\nI would like to see a list of potential risks and challenges. To increase the probability of success of this proposal.", "q1r": 1, "q2": "In summary, it is difficult to assess the progress of this proposal. The presentation roadmap will help create a clear view of the timestamps in the proposal that the team can review or push. The route here is minimal\r\nRegarding the responsible use of treasury, we need further explanation to justify this amount. Need more detailed information on the actual destination of the requested budget and detailed roadmap for this\r\nI would love to see the team develop Key Performance Indicators (KPIs) for the project and connect the KPIs to milestones in the future project roadmap (timeline). There is no definite data to measure what the proposal wants to do, and the success of each step is not determined", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 22, "ne": 4, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "It is unmistakable that live translation will have a high impact and effectiveness. Translations by a physical person are more accurate, especially if it's someone with the right knowledge. It also shows a lot of respect to the Japanese residents that the community is willing to make the effort to preserve a live translation to attract new members to the community.", "q0r": 5, "q1": "Below the proposal is an example of a zoom meeting, it's a good example. Is the website currently being built or do you know an associate who can do this on such short notice (3 months)? I also do not see transparently how these \"bounties\" will be distributed, among whom and how much will each one earn? Do you already have an audience for these zoom meetings? Are these participants sustainable enough to contribute to the ecosystem?", "q1r": 4, "q2": "The timeline is very basic, I am missing information related to the transparency to control the project. How regularly are you going to organize these zoom meetings, what KPIs are there for this proposal, what is your goal in terms of the number of participants and hits on the website? I recommend you further substantiate the proposal.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This proposal focuses on creating a website that hosts text and video in both languages and offers \"bounties\" for content, along with monthly Zoom calls. The problem statement is quite convincing but not explained in detail. The solution is clear and described in detail. Based on the given information, I agree with this proposal's impact, and would give it a score of 4.", "q0r": 4, "q1": "This team's relevant experience shows that they have suitable experience for implementing this proposal. However, the detailed plan is quite very abstract, without a roadmap, KPIs/metrics, risk management,... Based on the given information, I am neutral with this proposal's feasible, and would give it a score of 3.", "q1r": 3, "q2": "There is quite a lot of information provided. However, as mentioned, the detailed plan is quite very abstract, without a roadmap, KPIs/metrics, risk management. Besides, for better understanding, a detailed plan should be provided in English in parallel with the Japanese version.\r\nTherefore, based on the given information, I am neutral with this proposal's auditability, and would give it a score of 3.", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}], "solution": "Vamos criar um site que hospeda texto e vídeo em ambos os idiomas e oferecer \"generosidades\" pelo conteúdo, juntamente com as chamadas mensais Zoom.", "experience": "Já estamos realizando reuniões mensais do Zoom em ambos os idiomas. Um proponente é um SPO no Japão e o outro um artista CNFT com sede nos EUA."}