{"id": 383585, "author": "raz", "title": "Sustainability Hub for Japan", "url": "https://cardano.ideascale.com/a/dtd/383585-48088", "category": 26238, "amount": 5000, "description": "Falta no ecossistema Cardano o compartilhamento de histórias de projetos impactantes que representam a comunidade japonesa, ligados a outros idiomas.", "funded": 2, "upvotes": 163461241, "downvotes": 3043568, "votes_result": 160417673, "votes_cast": 655, "f6_no_assessments": 6, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "Bridging the Japanese community with the rest of the Cardano community around the world will reduce isolation. The best way to do this is stimulating experiential exchanges by translating them. Facilitating a forum could spark collaborational crossovers and stimulate Japanese communal onboarding. ", "q0r": 4, "q1": "The feasibility of this project depends on the capability to broadly distribute the published material. I was not aware of the existence of the website prior to reading this proposal. Are there planned efforts to somehow market your project and get the name out to the community? ", "q1r": 4, "q2": "All necessary tracking variables are elaborately mentioned in the proposal. What I am kind of missing is a way to promote the website. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 28, "ne": 1, "ng": 20, "nfo": 7, "vca_o": 1}, {"q0": "I think this is a great proposal as it actually bridges and seeks to provide stories, news and educational and motivational resources for the use across all the different languages/ communities across the globe. This proposal seeks funding to add two japanese community members to contribute to the platform.", "q0r": 5, "q1": "The project was previously funded, it is up and running and the proposing team provides information about the steps that have been taken and as well as a preliminary roadmap if the proposal receives funding from Catalyst. With the information provided by the team, I find it highly likely that this proposal would be successful in onboarding two japanese community members, reward them for delivering content and to bridge to the japanese community with hopes of onboarding and getting out educational and information about Cardano/ Catalyst, hence providing aspects of community and trust for the japanese cardano community.", "q1r": 5, "q2": "The main roadmap phase for this proposal starts in February next year and includes educational material, stories and content in japanese that will be merged with and published on the sustainable ADA page. Key metrics are feasable and realistic and progress is transparent for the Catalyst community through the website. The team is close to several other proposing teams that work very active in the Catalyst ecosystem, so this is a nice way of expanding the efforts and developing an existing project to make it more accessible. The budget is humble.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 26, "ne": 4, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "This project fits the challenge outlined flawlessly. By providing a multilingual hub for the projects that have an influence on the Japanese community you can create a safe haven for the Japanese community and provide additional support. This will also create a port for Japan to get in touch with the Cardano ecosystem and learn what we do and how we do it.", "q0r": 5, "q1": "The proposers are known within the Catalyst community and already familiar with previous funds. This provides a good baseline and gives confidence that they have the experience needed for this proposal. Because they already have a website that already translates community stories and talks about previous projects also makes it clear that this proposal is in good hands. The proposal aims to include a Japanese translator who preferably is based in Japan to translate content to Japanese and create new content about the Japanese Community. The budget is reasonable for this project and well defined.", "q1r": 4, "q2": "For auditability, the proposers provided enough information for the community to give a good audit. They provide the means to share updates on the project through their social media channels. KPI's that are given are also reasonable and very relevant. The only thing that would be missing in the proposal is a timetable, but since this proposal only includes research and hiring Japanese speakers to the Sustainable ADA this is just a minor detail.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 22, "ne": 4, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "For the Cardano and Catalyst ecosystem, such projects are of great importance. The team points out the problem in the proposal and offers a well developed solution. This project definitely has a positive impact on the Cardano ecosystem. The proposal clearly presents how this project will add value to the Cardano ecosystem. The Connecting Japan / 日本 Community challenge does not list the required KPIs that the proposer should list in their own proposal but nevertheless the team presents the KPIs and this proposal is able to scale and address future challenges.", "q0r": 5, "q1": "We have a clear and transparent insight through the websites and LinkedIn acc into the number of people in the team and their work so far and all the skills, knowledge and experience needed to successfully implement this project. The budget is broken down into identifiable items, it is clearly presented and reasonable and with this budget this project could be realized. The team does not ask for additional funds to implement the proposal. The team behind proposal clearly presents a detailed implementable plan and details of actionable tasks and order of execution. The team has a realistic timetable to complete the work and clearly explains the technical aspects and resources needed to implement the project. The team does not mention possible risks and has not developed an idea of possible risks if they arise.\r\n\r\n\r\n\r\n", "q1r": 4, "q2": "The team has developed a roadmap with milestone along with the horizon for achievement, KPIs are well presented and make sense and can be used to quantify the success of the project. The community can track the development of this project without any problems. Great project!", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 19, "ne": 6, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "The proposal seeks to share information and stories from Japanese community and diaspora with the Cardano ecosystem. They want to expand their team's capacity and open up opportunities for the Japanese community, also to produce content on sustainable stories and projects coming out of Japan and the diaspora, to the wider community. In the long term, their aim is to have stories written by Japanese writers, in their native language, representing the Japanese community, and talking about their connection with Cardano blockchain and sustainability. The challenge is well addressed effectively.", "q0r": 4, "q1": "The team experience in Economics, sustainability, Humanities, Social Studies, NGOs, Social Entrepreneur, Writing, Blogging, Video editing, Figora, Canva, Adobecc all make them capable of implementing the proposal successfully. The plan mentions that they will connect with the global diverse community that are supportive and open. They plan to connect and locate the right people from these diverse backgrounds to work with to implement the proposal effectively.", "q1r": 4, "q2": "They commit to share updates on the project through social media for effective auditing. The road map is clear showing August 2021to April 2022 with details of schedules provided for reference. The budget breakdown is clear and comprehensive for effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This project seeks to expand the conversation of Sustainably to include Cardano in Japanese, this a community-building activity.", "q0r": 5, "q1": "the team is highly experienced and has demonstrated a long track record of building tools of use for the community. Collection and dissemination of stories is well within the skill set of the team.", "q1r": 5, "q2": "roadmap, milestones and success metrics are all listed, the group will be executing in public and so the community will be able to audit the project for themselves.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}], "solution": "Facilitando o compartilhamento de projetos sustentáveis + histórias da comunidade japonesa e da diáspora, dentro + externos a Cardano.", "experience": "Economia, Sustentabilidade, Humanidades, Ciências Sociais, ONGs, Empreendedores Sociais, Escritores, Blogging, Edição de Vídeo, Figma, Canva, AdobeCC"}